{
  "title": "Chi c'era dietro al gruppo Facebook Mia Moglie, finito sotto inchiesta per la diffusione di foto intime di donne senza il loro consenso",
  "text": "Dietro al gruppo Facebook Mia Moglie, un gruppo dove si condividevano foto intime di donne inconsapevoli, ci sarebbe anche una donna. La novità, riportata da Repubblica, emergerebbe dall'esame dei dispositivi sequestrati dalla polizia postale: secondo gli inquirenti, i due amministratori sarebbero un uomo e una donna e utilizzavano telefoni e sim registrati a terzi, nel tentativo di evitare l'identificazione. Il loro ruolo era quello di moderare e pubblicare i contenuti.\n\nLa procura di Roma contesta a entrambi la diffusione illecita di immagini sessualmente esplicite, un'accusa che comprende la pubblicazione sistematica di foto e video di donne spesso inconsapevoli di essere esposte a una platea di migliaia di utenti. La presenza di una figura femminile nella gestione ribalta parte della narrazione iniziale, che ipotizzava un unico amministratore uomo, e aggiunge complessità a un caso che continua ad allargarsi.\n\nLa scoperta del gruppo e l'avvio dell'indagine\n\nL'inchiesta prende forma il 19 agosto, quando gli investigatori si imbattono in un gruppo Facebook che raccoglieva oltre 32mila iscritti. In questo spazio digitale, partner uomini – mariti, fidanzati, compagni – caricavano immagini delle proprie compagne. Foto scattate in casa, in luoghi pubblici, in momenti quotidiani, talvolta rubate. Secondo quanto ricostruito, molte delle donne ritratte ignoravano completamente la circolazione di quelle immagini.\n\nIl gruppo Facebook Mia moglie era divenuto un archivio abusivo alimentato da commenti espliciti, allusioni sessuali, fantasie pubblicate senza filtri. Tra gli utenti figuravano profili di ogni tipo, anche appartenenti a persone con ruoli pubblici. Con l'esplosione della vicenda, decine di donne hanno iniziato a riconoscersi nelle immagini, raccontando matrimoni di lunga data, vite familiari consolidate, e la violenza improvvisa del ritrovarsi esposte online senza consenso.\n\nParallelamente al gruppo, era attivo anche un canale Telegram collegato, in cui alcuni utenti pubblicavano versioni più esplicite del materiale, amplificandone la diffusione. Il gruppo Facebook è stato chiuso a fine agosto, ma le attività investigative non si sono fermate.\n\nCome funzionava Mia Moglie\n\nLa ricostruzione del caso mostra un ecosistema digitale costruito sulla normalizzazione della violenza. Il gruppo non era un semplice contenitore di immagini: era un luogo di scambio e di complicità tra utenti. Le pubblicazioni erano accompagnate da commenti che alimentavano un clima di pornografia non consensuale presentata come gioco tra uomini, dimostrazione di potere sulla partner, forma di esibizione e controllo\n\nI gestori, oggi al centro dell'indagine, avevano il ruolo di moderare, incentivare, selezionare contenuti, e mantenere attivo il meccanismo di condivisione. La presunta presenza di una donna in questo ruolo apre interrogativi sulle dinamiche interne: non depotenziano il carattere misogino del gruppo, ma mostrano come queste comunità siano alimentate da logiche più complesse.",
  "authors": [
    "Elena Betti"
  ],
  "url": "https://www.wired.it/article/gruppo-facebook-mia-moglie-identita-amministratori/"
}