{
  "title": "Supreme Court Allows Trump To Enforce Passport Restrictions For Trans People",
  "text": "LOADING ERROR LOADING\n\nThe Supreme Court on Thursday granted the Trump administration’s emergency request to enforce its policy barring transgender and nonbinary people from updating their sex markers on passports.\n\nThe court said that while litigation continues at the lower level, the government can require passport seekers to select male or female sex designations based on their birth certificate, while the “X” designation is no longer available.\n\nAdvertisement\n\n“Displaying passport holders’ sex at birth no more offends equal protection principles than displaying their country of birth—in both cases, the Government is merely attesting to a historical fact without subjecting anyone to differential treatment,” the court wrote in the unsigned majority opinion.\n\nThe three liberal justices dissented, with Justice Ketanji Brown Jackson writing for all three.\n\n“The Government seeks to enforce a questionably legal new policy immediately, but it offers no evidence that it will suffer any harm if it is temporarily en-joined from doing so, while the plaintiffs will be subject to imminent, concrete injury if the policy goes into effect,” she wrote, joined by Justices Elena Kagan and Sonia Sotomayor.\n\nOn Jan. 20, President Trump’s first day in office, he signed an executive order declaring that the U.S. would only “recognize two sexes, male and female,” and that “sex” was an “immutable biological classification.” The order also directed the State Department to require that government-issued identification documents — including passports, visas and Global entry cards ― “accurately reflect the holder’s sex.”\n\nAdvertisement\n\nThe language of Trump’s order mirrored many state level laws that define sex in an exceedingly narrow fashion, which LGBTQ+ and civil rights advocates have said carve out transgender people from legal protections.\n\nIn February, the American Civil Liberties Union filed a lawsuit on behalf of Ashton Orr, a transgender man and LGBTQ+ advocate, and six other trans and nonbinary plaintiffs to challenge the passport policy, alleging that the executive order unconstitutionally discriminated against people based on sex.\n\nUp until this point, the lower courts have agreed. In April, District Court Judge Julia Kobick temporarily blocked the State Department’s policy to allow six of the seven plaintiffs in the case, Orr v. Trump, to obtain passports with sex designations that align with their gender identity. In June, Judge Kobick expanded the injunction to allow all trans and gender nonconforming people to get passports with the proper sex designation.\n\nAdvertisement\n\nIn early September, a panel of judges for the First Circuit Court of Appeals denied the Trump administration’s motion to halt the injunction while litigation continued. The Trump administration then applied for an emergency ruling with the Supreme Court, alleging that allowing transgender people to have documentation that reflects their gender identity forces the government “to misrepresent the sex of a nationwide class of individuals in official sovereign-to-sovereign communications.”\n\nUnder Biden, passport holders were able to self-select their gender markers, including an X marker to denote a person is nonbinary or gender nonconforming.\n\nJon Davidson, a senior attorney for the ACLU’s LGBTQ & HIV Project called the order “a heartbreaking setback for freedom.”\n\nAdvertisement\n\n“Forcing transgender people to carry passports that out them against their will increases the risk they will face harassment and violence and adds to the considerable barriers they already face in securing freedom, safety, and acceptance,” Davidson said in a statement.\n\nThis is the latest instance of the Supreme Court’s conservative majority ruling in favor of the Trump administration’s emergency appeal to quickly resolve a case while litigation continues at a lower court. Earlier this year, the highest court granted an emergency request from the Trump administration to enforce its ban on transgender servicemembers from the military.\n\nThe justices are still weighing two major cases this term related to trans rights. One case involves the constitutionality of state bans targeting transgender girls from playing on girls’ sports teams in schools. In the other, the justices will decide whether a Colorado law banning conversion therapy infringes on the free speech rights of a Christian therapist.",
  "authors": [],
  "url": "https://www.huffpost.com/entry/supreme-court-allows-trump-passport-policy-targeting-trans_n_68d2d8cde4b03fb4d9345c80"
}