{
  "title": "7 Expert Tips for the Most Satisfying Roast Chicken of Your Life",
  "text": "Advertisement\n\n7 Expert Tips for the Most Satisfying Roast Chicken of Your Life These easy upgrades will make even the most basic bird all the more special. Melissa Clark’s roast tarragon-Cognac chicken. Credit... David Malosh for The New York Times. Food Stylist: Simon Andrews.\n\nThere are countless ways to roast a chicken, and the truth is, if you salt and grease a bird and roast it until it’s cooked, it’ll be pretty good, feed a crew and go with whatever else is for dinner. But for a roast chicken that upstages the supermarket’s rotisserie birds, even when they’re glowing under their movie-star lights, try one of these seven easy upgrades that make the most of a basic roast chicken recipe. (For even more expert tips, see our ultimate guide on roasting a chicken.)\n\n1. Brine It\n\nSamin Nosrat’s buttermilk-brined roast chicken. Credit... Romulo Yanes for The New York Times. Food Stylist: Vivian Lui.\n\nIn some ways, marinating chicken in something acidic like feta, buttermilk or yogurt helps solve many of the pain points of cooking chicken. It keeps the meat juicy while crisping and caramelizing the skin. What more could you want?\n\n2. Spatchcock It\n\nSohla El-Waylly’s spatchcock roast chicken. Credit... Mark Weinberg for The New York Times. Food Stylist: Monica Pierini.\n\nFor a quicker-cooking, uniformly browned bird, spatchcock it. Or butterfly it. The terms sound like you or the chicken might need to perform some gymnastics, but all they really involve is cutting the backbone out of the chicken so it can lay flat. This exposes the thighs and legs to the oven’s heat, reducing the cook time and letting all parts to brown evenly.\n\n3. Bake It Low and Slow\n\nAlison Roman’s slow-roasted oregano chicken with buttered tomatoes. Credit... Michael Graydon & Nikole Herriott\n\nCooking under higher heat can turn a bird’s skin shatteringly crisp, while leaving the meat tender and juicy — if you time it just right. But, if you don’t, that same high temperature can leave the meat, especially the breast, dry and chalky. Instead, drop the temperature to about 325 degrees and cook for longer. The moderate heat cooks the bird gently, and the ample time in the oven gives the collagen a chance to really break down, for silky meat you can pull off the bone with your fingers.\n\nNeed a recipe to start? Slow-Roasted Oregano Chicken With Buttered Tomatoes\n\n4. Double It\n\nAli Slagle’s paprika-roasted chicken and potatoes. Credit... David Malosh for The New York Times. Food Stylist: Simon Andrews.\n\nThe next time you roast a chicken, any chicken, make two. There’s enough space on a sheet pan to do it (even if you spatchcock them). Eat one for dinner, then refrigerate the other for the week’s meals. Think about it as a D.I.Y. rotisserie chicken, personalized with whatever flavorings you desire.\n\nNeed a recipe to start? Paprika-Roasted Chicken and Potatoes\n\n5. Make It a Complete Meal\n\nEric Kim’s roasted chicken with caramelized cabbage. Credit... Christopher Testani for The New York Times. Food Stylist: Monica Pierini.\n\nThere are many vegetables you can scatter around your chicken before they all roast in the oven: carrots, potatoes and cabbage. But there’s more. Roast fruit until they slouch or torn pieces of bread until they crisp. No matter what you decide to roast alongside the chicken for your side, it’ll end up savory and rich (because it was cooked in the chicken’s rendered fat).\n\n6. Add Butter or Parmesan\n\nMelissa Clark’s crispy Parmesan roast chicken with lemon. Credit... Johnny Miller for The New York Times. Food Stylist: Rebecca Jurkevich.\n\nBrush the chicken with butter, and as the chicken roasts, it’ll mix with its fat, making it perfect for basting. (Basting will also seal in the chicken’s juiciness and create a glossy crust.)\n\nIf you’re a crispy skin fan, sprinkle the chicken with grated Parmesan “to get chicken skin as crunchy as a strip of fried bacon,” as Melissa Clark writes. Any questions?\n\n7. Garnish With Herbs\n\nMelissa Clark’s chile-roasted chicken with honey, lemon and feta. Credit... Linda Xiao for The New York Times Food Stylist: Judy Kim.\n\nLet’s lift those deep, roasted flavors by sprinkling fresh herbs over the carved and sliced chicken. Use chopped soft-stem herbs like dill or parsley, or a few leaves of the thyme, tarragon or oregano you may have stuffed into your chicken before roasting. Whichever you choose, they’ll look nice, too, with their color popping against the bronzed chicken.\n\nFollow New York Times Cooking on Instagram, Facebook, YouTube, TikTok and Pinterest. Get regular updates from New York Times Cooking, with recipe suggestions, cooking tips and shopping advice.",
  "authors": [
    "Ali Slagle",
    "Ali Slagle Is A Recipe Developer",
    "Regular Contributor To Nyt Cooking Who Specializes In Low-Effort",
    "High-Reward Recipes. She Is Also The Author Of The Cookbook",
    "I Dream Of Dinner",
    "So You Don T Have To ."
  ],
  "url": "https://cooking.nytimes.com/article/roast-chicken-tips"
}