{
  "title": "Yeti vs. Host Modern: Which Insulated Serving Dishes Are the Best?",
  "text": "Thermoses have gotten kind of amazing these days. Have you noticed? The best double-walled, vacuum-insulated travel mugs can keep your coffee hot literally all day. I've left my Fellow Carter Move mug (see on Amazon) in a car for hours while hitting the farmers market and meeting a friend for lunch, only to discover my coffee still bracingly hot and tasting pretty much the same as when I brewed it. It feels like a miracle.\n\nSo when a new company called Host Modern offered to do the same thing for candied yams or brussels sprouts, with a handsome new double-wall, vacuum-insulated serving dish, I was primed to fall in love—inasmuch as one can fall in love with a serving dish.\n\nIf the dish works well at keeping food hot for extended periods, potlucks and picnics are the most obvious application. But even just serving hotter food at home is, in its own little way, life-changing.\n\nI have cooked multiple seven-dish feasts for my family this past month, while testing Thanksgiving delivery meal kits, and timing is always the toughest part of a multipart meal. It feels sad to nuke your brussels sprouts before dinner because the turkey ran long and the greens got cold. It only takes 20 minutes of reprieve to save Christmas!\n\nInterestingly, Host Modern's public relations touts their serving dish as a “Yeti for food.” But of course, Yeti—a stalwart in the hot-things-hot, cool-things-cool game—likewise makes a Rambler vacuum-insulated bowl that is also, self-evidently, a Yeti for food. Which professed Yeti for food is the most Yeti for food? Yeti or Host Modern? I filled the bowls for a face-off.\n\nFirst off, it's worth asking if anyone needs a thermal serving dish. Is Thanksgiving saved, bettered, its pleasures embiggened? Or is it all just cold comfort? I assessed each brand's ability to keep liquid and solid food hot longer, versus a basic lidded Pyrex 4-Quart Mixing Bowl ($32) that costs a fraction of either the Yeti or the Host Modern.\n\nI also used each bowl at a family feast, as a road test—and logged comments made by family members. Likability also matters in something you hope to keep in your life. Call this the mom-and-sister test.\n\nI'll spare you some suspense here. Serving dishes with big mouths don't and can't work as well as a travel mug at keeping things hot or cold. Most of the heat loss in a vacuum-insulated thermos is out of the lid. The lid on a big serving dish is, well, big. You can feel the heat leaking. But both the Yeti and the Host Modern still performed better than noninsulated serving dishes at keeping your food warmer, longer. Here are the results.\n\nSpecs: Host Modern vs. Yeti Rambler Bowl\n\nThe largest Yeti Rambler bowl and Host Modern serving dishes are, in some regard, radically different beasts—but have about the same advertised serving capacity.",
  "authors": [
    "Matthew Korfhage"
  ],
  "url": "https://www.wired.com/story/the-best-insulated-serving-dishes-for-your-next-dinner-party/"
}