{
  "title": "Ramp hits $32B valuation, just 3 months after hitting $22.5B",
  "text": "In Brief\n\nThe one area outside of AI where investors are still enthusiastic is expense management fintech, at least if Ramp’s 2025 is anything to judge by. Every few months, Ramp has raised another large sum at another giant new valuation. On Monday, the fintech announced it had raised $300 million led by Lightspeed, which also included an employee tender offer.\n\nThis is just a few months after a $500 million Series E-2 at a $22.5 billion valuation led by Iconiq, announced on July 30. That round was just a few weeks after a $200 million Series E at a $16 billion valuation led by Founders Fund, announced in mid-June. And that Series E was just three months after a $150 million secondary share sale at a $13 billion valuation in March.\n\nIn April 2024, Ramp had raised a $150 million Series D co-led by Khosla and Founders Fund at a $7.65 billion valuation.\n\nWith Monday’s round, Ramp has raised $2.3 billion in total equity financing, it says. And in 2025 alone, the company leapt from being worth $13 billion to $32 billion.\n\nRamp in October said it had surpassed $1 billion in annualized revenue, meaning it was on a trajectory to bring in that much on a 12-month basis.\n\nRamp today offers corporate expense management. While it has an AI story to tell — automating some approvals and processes via agentic offerings — it is not an AI company per se. It offers corporate credit cards, expense management/purchase order software, and corporate travel. The company says it has surpassed 50,000 customers.",
  "authors": [
    "Julie Bort",
    "Marina Temkin",
    "Ivan Mehta",
    "Isabelle Johannessen",
    "Kirsten Korosec",
    ".Post-Authors-List__Authors --Font-Size Var",
    "Align-Items Center Display Flex Gap Var",
    ".Post-Authors-List__Authors .Post-Authors-List__Author-Thumbs Display Flex Flex-Shrink Margin Padding .Post-Authors-List__Authors .Post-Authors-List__Author-Thumbs Li List-Style None Margin-Left Margin-Top Important .Post-Authors-List__Authors .Post-Authors-List__Author-Thumbs Li First-Child Margin-Left .Post-Authors-List__Authors .Post-Authors-List__Author-Thumbs .Post-Authors-List__Author-Thumb Background-Color Var",
    "Border Solid Var --Wp--Custom--Color--White",
    "Border-Radius"
  ],
  "url": "https://techcrunch.com/2025/11/17/ramp-hits-32b-valuation-just-three-months-after-hitting-22-5b/"
}