{
  "title": "I Was A Happily Married Mother Of 4. Then I Met A Woman At Pilates.",
  "text": "A photo of the author taken the year she came out Courtesy of Katrina Anne Willis\n\nI remember the moment it happened — the single spark that set my body aflame.\n\nCecelia stood behind me on the Pilates reformer and pressed her legs into my back, her hands into my shoulders. The strength of her long, lean limbs drove me into submission. Her perfectly-highlighted blonde hair tickled the back of my neck.\n\n“Connect your pubic bone to your sternum. Hold it.”\n\nHer voice was deep, throaty.\n\n“Even while I’m pushing you — hold it. And breathe.”\n\nBut I could not breathe. There was no oxygen left in the room. It had been consumed by her touch, her fire.\n\nAdvertisement\n\nSpontaneous combustion.\n\nMy chest heaved with the weight of this recognition. It felt simultaneously familiar and forbidden, known and mysterious, natural and foreign. I searched for air as every nerve in my body shouted, This! This is who you are. This is who you’ve always been.\n\nOut of nowhere, in an instant, she burned me to the ground, along with all of the preconceived notions I had about attraction and desire.\n\n***\n\nI had married my husband, Charles, 25 years earlier, after seven years of dating. We’d attended the same high school, and had been cast opposite each other in our spring production of ″Fiddler on the Roof.” On one of our first dates, he told me about a reoccurring dream he’d had since he was young.\n\nAdvertisement\n\n“It happens almost every night,” he said. “I dream about this woman in a rocking chair in a dark, quiet room. Her back is to me, it’s the middle of the night, and she is holding a baby. I take the baby from her and send her back to bed. I never saw the woman’s face until I met you. But it’s you, Katrina. You’re the one.”\n\nThat’s how Charles convinced me we were supposed to be together. I was unsure that we were the right match, but he made it seem like our future had been written in the stars. How could I argue with the stars? But also, who had dreams about kids and wives at sixteen? I couldn’t even handle my own emotions. Kids were not on my radar. Spouses were not either.\n\nTwenty-five years in, however, we’d made a good life: four beautiful kids, a big house in the suburbs, fancy cars, advanced education and a solid career for him, a homemaker’s life for me. On the outside, we were the perfect family. But there was something about the skin of suburbia that never quite fit me.\n\nAdvertisement\n\nWhen Cecelia touched me on the reformer that day, I began the long journey to understanding why, beginning with my childhood.\n\nI was raised in a world where gay was not really an option. Or at least not a desirable one. My Granny used to call our local TV star, Cowboy Bob, “Gay Bob” because she mistakenly thought that was his name. We all thought it was hilarious. Gay was funny. Gay was foreign. Gay was whispers and giggles behind backs. Gay was a slur.\n\n“Gay” was a hard word for me to say at all, let alone in reference to myself. “Lesbian” was even harder. “Queer” was so offensive that my big sister, Cora, and I weren’t allowed to say it when we were young, so we called each other “quee” instead.\n\nAdvertisement\n\n\"Here I am growing out my gray and smooching my special needs rescue pup, Sissy,\" the author writes. Courtesy of Katrina Anne Willis\n\n***\n\nAs my obsession with Cecelia grew, Charles and I talked at length about what was happening in our lives and in my heart.\n\n“Why her?” he asked. “What’s the draw? She’s not even very nice to you.”\n\n“I can’t explain it,” I said. “But it’s all-consuming. I go to bed thinking about her. I wake up thinking about her. It’s not anything I chose. It just is.”\n\nAdvertisement\n\nWe talked about my propensity to form unusually strong female bonds, to dive headfirst into my closest relationships. I thought long and hard about my best friend in high school and how jealous I became when she chose another friend and turned our duo into a trio. I recalled my girlhood crushes on camp counselors who occupied more than their fair share of space in my head. I reminisced about a female high school teacher whose after-school classroom became my daily destination, a space that I craved intensely so I could spend more time with her.\n\n“Does this feel different than friendship?” he asked.\n\nI nodded, even though I couldn’t quite articulate why.\n\nCharles then confronted me with the biggest question of my life: “Are you gay?”\n\n“I don’t know,” I told Charles as I began crying. “I joined this secret online group of late-in-life lesbians, and someone there said that you know you’re gay if you’re questioning because straight women don’t stay awake at night wondering if they’re gay. That’s all I can think about now. So, what does that mean?”\n\n“I think we both probably know what it means,” he said. “And I’ll tell you this: I can be many things for you. I can be your lover and your husband and your friend. But if you want a girlfriend, I can’t be that.”\n\nAdvertisement\n\n“I don’t expect you to be,” I said. “I never said I wanted to have a girlfriend. That came from you.”\n\n“Seriously, Katrina,” he said. “If you want a girlfriend, go have a girlfriend.”\n\n“What are you saying?” I asked.\n\nBy giving me his permission to explore my sexuality, Charles opened a Pandora’s Box inside of me that could never be closed again. After the kids went to bed, I began spending all my evening hours with Cecelia, sharing red wine and conversation. My desire for her was a living, breathing thing.\n\nCharles and I discussed many ways to try to balance our relationship equation, to try to save our marriage. We discussed it with our counselor, Laura, and with our closest friends. He had, of course, told me to find a girlfriend, but it wasn’t easy when I did. It was far from easy. When I was with Cecelia, he was understandably lonely. And inside that loneliness was where all the fear and questioning and insecurity made its home.\n\nAdvertisement\n\n“I wish you’d plan a boys’ weekend,” I said. “Reconnect with your old friends, go out for drinks, chase women, listen to music. It would be so good for you.”\n\nBut he stayed home.\n\n“I wish you’d make some new friends,” I said. “Or connect with some old ones. It would be nice for you to have a drinking buddy, someone to play golf with. Why don’t you go find that person?”\n\nBut he didn’t.\n\nAnd when those ideas fizzled out, I said. “Do you want to date? Would that make you feel less lonely?”\n\nAdvertisement\n\nIt made me queasy to imagine him alone with another woman, to think about his hands on the small of her back. It was hypocritical for me to feel that way, but in this one way, it wasn’t: He would always be the only man I ever loved. There would never be another beyond him.\n\nThe thought of him with another woman felt redundant to me. It felt like a replacement. One soft body for another. A head full of long hair exchanged for a head full of, perhaps, another color. Intertwined fingers that felt a little different, but mostly the same. Soft and supple from lotions and potions. Smooth from waxing. The familiar scents.\n\nWe had friends in an open marriage and asked them all the pertinent questions. How did it work? How did you keep your relationship primary? How did you establish rules and boundaries? How did it feel? How might it fail?\n\nAdvertisement\n\n“It’s a beautiful thing to see the one you love happy and fulfilled,” Christine told me. “It’s a concept called compersion. When Steve comes home and tells me all about his dates, it fills me. I know without a doubt that I will always be his number one, and I love to see him so happy.”\n\nI wanted to see Charles happy.\n\n“But what about jealousy?” I asked her.\n\n“I don’t feel any jealousy,” Christine said. “It’s all about establishing rules and boundaries and sticking to them. That way, there are no surprises and no secrets.”\n\nThe author in Chicago attending her first Pride event Courtesy of Katrina Anne Willis\n\nAdvertisement\n\nCharles and I read books, we consulted websites, we tried to create a safe space, and we established our rules of engagement. We created joint accounts on multiple dating sites, including Tinder, OKCupid, and Plenty of Fish. Our accounts specified that we were a married couple looking to expand our sexual experiences. Then we created individual accounts that said, In an open marriage. We both set our gender preferences to women.\n\nUltimately, as many might have predicted, our experiment ended in disaster. As our marriage began crumbling and our split was imminent, we vowed to be the best divorced couple in the history of divorced couples, but expectations and reality don’t always align.\n\nCharles wanted to walk me down the aisle when I met the woman I would someday marry, but we couldn’t even manage to walk each other gracefully into the next phase of our lives. There was anger and hurt and vitriol, and we kicked all our dirt up onto each other until we were both messy and muddy and unrecognizable.\n\nAdvertisement\n\nI held guilt. I held blame. I had made a beautiful family, and then I’d broken it.\n\n***\n\nThe day I told the kids I was gay was the hardest day of my life. A couple of them cried and asked how and why, and the only answer I had for them was this: I wasn’t brave enough to be me in a world where I was taught to be someone else.\n\nMy wish for them was that they would someday understand that authenticity is more important than expectation; that regardless of who I loved as a partner, my love for them as a mother would never, ever change; that they, too, should always feel free to change their circumstances when where they were didn’t necessarily match who they were.\n\nIn the early days of my post-marriage life, I cried myself to sleep more often than not. I loved my new little rental house, loved the freedom and independence it granted me, and I learned how to mow the lawn and grill some pretty perfect burgers. I was also plagued with guilt for making my kids share two homes and altering their teenage existence so radically.\n\nAdvertisement\n\nOne of the greatest challenges in my new life was the loss of so many friends. It was eye-opening to me to understand that some people loved the married, mother-of-four me, but they could not embrace the me that did not match their societal expectations.\n\nMy best friend, Abigail, said to me, “You have to let that life go. You’ve outgrown it. It’s time to live in the one that fits you now.”\n\nHer words made me realize that I had been holding so tightly to what was that I wasn’t allowing room for what was yet to be — an opportunity to create a community of those who love me as is, not as was; an opportunity to live an authentic life.\n\nAdvertisement\n\nMy relationship with Cecelia was not sustainable for many reasons, but she opened the door to a new existence for me. She was what many in the LGBTQ+ community would call my “catalyst.” My feelings for her had awakened my true identity, and I tentatively began dating women online for the first time.\n\n***\n\nAs my burgeoning independence grew, I traveled to Provincetown, Massachusetts. To be present in that place was like nothing I’d ever experienced before. There were gay couples and families everywhere. Men dressed in skimpy shorts and sequins, holding hands. Drag queens passing out show fliers. Women walking hand-in-hand with kids wearing rainbow shirts.\n\nIt was flamboyant and fun and alive with joy. There were no sideways glances. There was raucous laughter and loud music and acceptance. I danced with wild abandon at the Boatslip. It was a life I could not have summoned in my wildest imaginings.\n\nAdvertisement\n\nGrowing up the way I did didn’t lend itself to understanding or knowing what a gay-friendly space feels like and how acceptance can seep into your blood and make you feel human and at home in skin that has always felt like a betrayal. In fact, the people I knew as a child never really spoke words like “gay,” “homosexual,” or “lesbian.”\n\nThose words were so foreign on my tongue that it took me a long time to actually be able to say, “I am gay,” and even now, I don’t proclaim it openly. Internalized homophobia is real. There is a discomfort inside of me that settles around the edges of who I am. I never had any reservations about introducing Charles as my husband, but the first time someone introduced me as another woman’s “partner,” I felt my face flush a thousand shades of red. It was exciting and unknown and terrifying all at once.\n\nThere is power in naming things. I know farmers who do not name the animals intended for slaughter. Naming makes everything too real — too intimate. But in Provincetown, all the words were used, all the labels were proudly displayed, all identities were celebrated.\n\nAdvertisement\n\nThe people were gay. The shops were gay. The decor was gay. The clothes were gay. The music was gay. The shows were gay. The parades were the gayest gay I could possibly imagine. This town was a safe, gay oasis in a world full of fear and prejudice.\n\nI never wanted to leave.\n\nThe author at a book signing event for her novel, \"Parting Gifts,\" in 2016 Courtesy of Katrina Anne Willis\n\n***\n\nIt’s been eight years since that Pilates class and five years since my divorce. Charles has happily remarried, all my kids are grown and thriving, and I am openly gay. I’m 53 now. It took me a long time to figure out who I truly am. Longer than most, really. But now that I’m finally getting to know my authentic self, I’m able to reflect on some of the lessons I’ve learned along the way.\n\nAdvertisement\n\nI’ve learned that some people will say words like ”love” and ”forever” and still leave you crying on the floor in a heap of confusion and pain.\n\nI’ve learned that those people include me.\n\nI’ve learned it’s okay and necessary to say words like ”no,” and ”that’s enough,” and ”I’m done,” and ”I’m sorry.” And I’ve learned when someone says you’ve hurt them, they need you to know. To listen. To acknowledge.\n\nI’ve learned how lucky I am that I get to live my life the best way I know how. I acknowledge that not everyone has that kind of freedom and privilege. I’m so grateful I get to love who I love in the way that works best for me, despite the hardships and losses I incurred along the way. I’ve learned that societal rules don’t always fit everyone equally. That belief systems are personal and complex and sacred. That we get to define our lives and loves with honesty and careful consideration. That the shackles of what should be can be thrown off to welcome what is instead. That the beauty of life is in the choices we make—for our loved ones, our friends, our families, ourselves. That our hearts will guide us if we listen and let them.\n\nAdvertisement\n\nI’ve learned that nothing stays the same. And that this reality will simultaneously make and break us. And that if we understand and embrace and welcome those changes, we get to grow and reinvent and rediscover what we love most about others and about ourselves.\n\nI’ve learned there are so many we don’t know yet who will end up loving us. A lifetime of love and opportunity. What a beautiful thought; what a reassurance.\n\nI’ve learned that life is a great unraveling, and that I’ve only begun to scratch the surface. I’ve learned that I have so much yet to learn.\n\nAdvertisement\n\nNote: Some names and identifying details of individuals mentioned in this essay have been changed to protect their privacy.\n\nThis piece was originally published in April 2024 and is being reshared as part of HuffPost Personal’s “Best Of” series.\n\nKatrina Anne Willis is an author, proud mother of four, special needs dog rescuer, pickleball fanatic, LGBTQ+ community member, and full-time RVer. Her first novel, “Parting Gifts,” was published in 2016. She has been named a Midwest Writers Fellow, a BlogHer Voice of the Year, and has been featured in a number of anthologies. She is currently at work on her memoir, “Hurricane Lessons,” which chronicles her late-in-life coming out.\n\nAdvertisement",
  "authors": [
    "Guest Writer"
  ],
  "url": "https://www.huffpost.com/entry/married-25-years-pilates-gay-relationships_n_6914c775e4b09f6fd8c48d13"
}