{
  "title": "Engineering Professor Answers Electric Car Questions",
  "text": "Transcript\n\nI'm Willett Kempton,\n\nprofessor of Electrical and Computer Engineering\n\nat the University of Delaware.\n\nI'm here today to answer your questions from the internet.\n\nThis is Electric Vehicle Support.\n\n[bright upbeat music]\n\nRHAmembers asks,\n\nEVs explained: How do electric cars actually work?\n\nI'm gonna use this diagram to explain.\n\nA gasoline car uses a fuel pump and gasoline pushed in.\n\nInstead for an EV,\n\nthat blue cable that you see is a charging cable.\n\nYou plug the car in and electricity flows into the battery.\n\nSo instead of a fuel tank, you've got a battery.\n\nThat big yellow thing is a really large battery.\n\nIt's more or less the same as a battery\n\nin your cell phone or laptop computer.\n\nIt's maybe using lithium ion.\n\nThat's a traditional type,\n\nand you can store kilowatt hours of electricity.\n\nThen when you drive, you unplug, of course.\n\nAnd now the electric energy,\n\nthe kilowatt hours that's in that battery\n\nis flowing out through a motor drive,\n\nthe blue thing of the diagram.\n\nSo that's turning the battery power into electric energy\n\nthat's ready to run a motor.\n\npettyrepair954 asks,\n\nWhy do electric cars accelerate faster\n\nthan most gas-powered cars,\n\neven though they have less horsepower?\n\nAverage electric car\n\nmight have less horsepower than a gasoline car.\n\nIt'll still accelerate much faster.\n\nThe torque of an electric motor is 100%\n\nfrom starting all the way to full speed.\n\nTorque is the turning power.\n\nIf you're turning a crank and pushing harder,\n\nthat's more torque.\n\nIf you're pedaling a bicycle uphill,\n\nyou have to push harder on the pedals.\n\nThat's more torque.\n\nOn a gasoline motor, you get maximum torque\n\nonly when you're at almost the maximum RPM.\n\nSo that's why you have gear shifts and all this.\n\nThe way you run at a gasoline car,\n\nit's [imitates acceleration sounds].\n\nYou know, you're shifting\n\nand moving to higher and higher gears.\n\nThat's because you're only getting maximum torque\n\nat nearly the full RPM.\n\nSo you don't have any of that nonsense\n\nwith an electric motor.\n\nSo Random-Nerd827 asks,\n\nHow environmentally friendly are electric cars actually?\n\nYou consider two things in environmental friendliness.\n\nOne of the mining materials, manufacturing,\n\nall that that goes into making the car.\n\nAnd then what about the fuel consumption\n\nand pollution from fuel consumption?\n\nIf you're using electricity,\n\nthere are probably some emissions\n\nin creating that electricity.\n\nWhen you drive your new electric car off the lot,\n\nit's less environmentally friendly than a gasoline car\n\nthat you would've bought new and driven off the lot.\n\nThere's more materials, more weight,\n\nand some of those materials have environmental impacts.\n\nSo actually the embodied environmental cost\n\nof the car is a bit higher.\n\nNot a huge amount,\n\nbut maybe 30% higher, something like that.\n\nIf you are using gasoline or diesel,\n\nobviously you've got emissions right out of the vehicle.\n\nThat is so much dirtier,\n\nthat over the time of driving the car,\n\nit may be as soon as two years after you've bought it,\n\nyou're already ahead.\n\nAnd over the life of a car,\n\ntypical car in the US lasts 12 years or so,\n\nyou're much more environmentally friendly.\n\nOkay, morecowbell520 asks,\n\nWill we see 600 mile range EVs standard\n\nin the next 10 years?\n\nWe have an announcement from Toyota\n\nthat they will have a 900 mile Toyota in 2027.\n\nThat's what, two years, not 10 years.\n\nBut you said standard.\n\nDo we want a 600 mile standard for EVs?\n\nI would say no on that.\n\nMaybe you need 600 miles or 900 miles\n\nor 1500 is certainly possible\n\nwith batteries that we see now coming.\n\nBut do you really want that?\n\nBecause that's gonna be more than weight.\n\nFor most people, 300 miles is really a reasonable range,\n\nand that's what most EVs sold in the US are today.\n\nYou can buy a 500 mile range EV in the US today.\n\nGonna cost you maybe 80 grand or 100 grand.\n\nOr would you rather have a lighter car,\n\nprobably get a little bit better mileage,\n\npay less for the car and get say 300, 350 miles range?\n\nThat_Cool_Guy, What is maintenance like on an EV?\n\nEV maintenance is way less\n\nthan maintenance of a gasoline car.\n\nMostly it's going to the dealer,\n\nand they check some things and do software updates,\n\nand it's all free.\n\nThe electric systems on EVs\n\nare generally warranted for 100,000 miles.\n\nSo very little maintenance.\n\nYou gotta still fill the windshield wiper fluid,\n\ncheck the brakes.\n\nOf course, there's no oil changes or any of that.\n\nYou still have to lubricate the chassis.\n\nSo very little maintenance.\n\nBean_Tiger asks, China makes cheap electric vehicles.\n\nWhy can't American shoppers buy them?\n\nThe purpose is to protect the American automotive industry.\n\nIf those were let in at very little tariff,\n\nit would be very hard\n\nfor the US automotive industry to develop EVs,\n\nwhich is what they're very furiously trying to do now.\n\nThe Chinese, as a national policy,\n\nhave emphasized new technologies,\n\nnot sort of supporting legacy technologies.\n\nSo they are the world's global lead\n\nin solar panel manufacturing.\n\nThey are making more wind turbines\n\nthan I think all the rest of the countries\n\nin the world combined.\n\nAnd they've moved way ahead on electric vehicles,\n\nway ahead of any other company\n\nwith legacy automotive industries\n\nlike Germany, Japan, Korea, the United States, obviously.\n\nThey have emphasized, in the case of electric vehicles,\n\nlearning how to make them\n\nand having a bunch of companies competing with each other\n\nto make very-high quality, very good,\n\nwell-engineered electric vehicles.\n\nmorganselah asks,\n\nDoes carbon footprint of EVs include lithium mining?\n\nYes, it has to.\n\nAny decent peer reviewable study\n\nof lifetime carbon emissions or pollution\n\nhas to include all the mining materials,\n\nprocessing, manufacturing, everything.\n\nWhen you drive the car off a lot,\n\nEV has a larger carbon footprint than a gasoline vehicle.\n\nWithin a year or two of driving,\n\nit has less and it gets much less over the lifetime.\n\nbullzFromAT asks,\n\nWhy are hydrogen cars not more prevalent than EVs?\n\nJust from an energy standpoint or a efficiency standpoint,\n\nhydrogen cars, you start with electricity,\n\nmaybe get natural gas, but ultimately,\n\nyou're gonna have electricity making hydrogen.\n\nSo you lose half the electricity\n\nwhen you turn it into hydrogen,\n\nand then you've got the energy of the hydrogen\n\nthat goes into the car,\n\ninstead of plugging in electricity straight into the car.\n\nThe car has a tank,\n\nwell, that's cheaper than a big battery, great.\n\nBut now when you take that hydrogen,\n\nturn it into electricity to drive the motors,\n\nyou're losing another half.\n\nSo you start with electricity,\n\nyou've knocked it in half to get to hydrogen,\n\nyou lose another half\n\nto turn it into electricity to run the motor.\n\nWhen you take electricity\n\nand put it straight into the car's battery,\n\nyou're losing maybe 10%, 20%.\n\nSo hydrogen, you're using almost four times\n\nas much electricity to drive the car.\n\nElectrical_Hyena5164 asks,\n\nDo EV batteries really outlast the car?\n\nYes, so they're warrantied for 100,000 miles.\n\nBut what does that mean?\n\nThat means they have at least 80% of the range\n\nstill in the car 100,000 miles after you buy it.\n\nIf I had a car that had 200 miles in the beginning,\n\nI'd now have a car that has 160 miles\n\nand still drives great.\n\nEverything's the same.\n\nI just can't go quite as far.\n\nGenExpat asks, What is the lowest tech electric car?\n\nThe lowest tech electric car is maybe the Fiat 500e,\n\nwhich has got 150-mile range battery.\n\nIt's a really small car.\n\nIt doesn't have any frills.\n\nReally low cost.\n\nYou can buy it used, you know,\n\nmaybe 8,000 bucks or something.\n\nNothing wrong with it.\n\nxmorecowbellx, Have Elon's antics affected Tesla sales\n\nin the real world?\n\nYeah, you could see there's a reduction in sales\n\nthat correspond to his high public visibility\n\nand what actions he was taking.\n\nI don't remember the percentage, but there's an effect,\n\nand there's an effect across countries.\n\nSo I think it's actually reduced their sales\n\nrather than just leveled them out.\n\nAnd that gives other US automakers\n\nand worldwide other automakers\n\na chance to sell more vehicles.\n\nTechnogky asks,\n\nDo you still call it the gas pedal or what?\n\nYou call it the accelerator pedal.\n\nAlgebraicIceKicg asks,\n\nWhy is fast charging only DC?\n\nWhy can't we fast charge with AC?\n\nMy team at the University of Delaware has developed\n\na way to do that in the US.\n\nSo it used to be that AC charging in the US\n\nwas limited to just 19 kilowatts.\n\nThat's how fast the power goes into the car.\n\nJust for comparison, a toaster is about one kilowatt.\n\nIt's faster than a toaster, but it's only 19 kilowatts.\n\nSo if you've got a large tank,\n\nit might take you 12 hours or more to fill it up.\n\nSo we've developed 100 kilowatt AC charger,\n\nwhich is a much lower cost way to quickly fill up a car.\n\nSo when you're charging with AC,\n\nuse a plug like this in the US now.\n\nIf you have a Tesla, it's a little bit different shape.\n\nThere'll be some other cars\n\nthat are starting to use that too.\n\nBut this is a very common AC charging connector.\n\nYou plug it into the car, and it starts charging.\n\nOn the other end of this wire is a plug,\n\nso you just plug it into an outlet in your garage\n\nor wherever is convenient, on the porch.\n\nYou know I've gotten expert\n\nat finding plugs outside of Airbnbs and places.\n\nPlug that in, pull the cable over to the car, plug it in.\n\nThat's an AC charging system.\n\nIt's cheap.\n\nYou can buy something like this for $300 or something.\n\nDC charger is a Coke machine size thing.\n\nIt's maybe 20 grand up to 100 grand,\n\nand you put it in with a forklift.\n\nYou would never have that at home.\n\nHome charging is always AC.\n\nFast, en route charging is usually DC.\n\nThatdud77608645,\n\nWhen will we have solar panel back windows\n\nfor electric cars?\n\nYou could run a car off solar,\n\nbut you need much more area than the whole car.\n\nYou would need solar on the hood,\n\nyou'd need it on the trunk in the back,\n\nyou'd need it on the roof,\n\nyou'd need it on the side.\n\nAnd to even run for like a normal days driving,\n\nyou'd need to leave it outside about three days.\n\nSchweitzerEd asks, Question for EV experts,\n\nis that the actual noise the motor makes,\n\nor do they add that\n\nso they don't silently run over everyone?\n\nYeah, that whir that you hear\n\nwhen you hear an electric cargo by,\n\nthat's the actual noise that it makes.\n\nnickvanosdol asks,\n\nAnyone got a quick source on\n\nhow many consumer EV models already support vehicle to grid,\n\nor even just vehicle to home?\n\nVehicle to grid means providing power out of your battery\n\nto the power grid.\n\nNow why would you wanna do that?\n\nThat has value because it means less strain\n\non electric lines,\n\nand it means generators, if they're stressed to the max,\n\nthey don't have to go further.\n\nThey can turn down maybe.\n\nVehicle to home is using your car to power your house\n\nwhen the power goes out.\n\nBoth of those are becoming much more something you'll see.\n\nA Quora User asks,\n\nHow close are we to getting cheap solid-state batteries\n\nto power electric cars?\n\nsolid-state batteries are lower weight in mass,\n\nso that's an important advance.\n\nAnd so there are today cars in China\n\nbeing sold with solid-state batteries\n\nbut there are none sold in the US.\n\nThere's a plan to have them sold\n\nto US customers in 2027.\n\nSo we're very close to that.\n\nladevita12 asks,\n\nWhy do EV and e-bike batteries keep catching on fire?\n\nThey're using lithium-ion batteries.\n\nLithium is flammable\n\nand burns at a very high temperature,\n\nwhich makes it hard to put out.\n\nSometimes if they're not properly managed,\n\nbut that shouldn't ever happen.\n\nIt means that two or three systems have all failed.\n\nEnergy can cause fires and heat\n\nand all kinds of other stuff.\n\nSo we have lots of fires with gasoline cars also.\n\nIn fact, even though EVs are a new technology,\n\nthe number of fires per 100,000 miles driven\n\nin gasoline cars is already much more\n\nthan the number of fires in EVs.\n\nSo it's just that EVs are novel\n\nand so, oh, EVs caught on fire, so that's news.\n\nDevz0r asks, Will charging electric cars\n\never be as fast as pumping gas?\n\nProbably not.\n\nIt's just harder to move amount of energy needed\n\nthan to move a liquid fuel.\n\nAnd yeah, maybe you could get the car\n\nto accept a really fast charge.\n\nLike, megawatt charging is a thing.\n\nThere's a new standard for megawatt charging,\n\nbut then you're gonna have a really high electric bill.\n\nbecause when you use a lot of electricity at the same time,\n\nthey start charging you more money for it.\n\nAwkward-Plenty-24 asks, Is wireless EV charging the future\n\nor just a cool gimmick?\n\nIt's just a cool gimmick.\n\nIt's really easy to plug in.\n\nIt's not necessarily something you have to solve.\n\nYou have to have the car positioned exactly over the coils\n\nthat are in the pavement or the garage or whatever.\n\nOne of the car manufacturers I visited, they said,\n\nA person can't park precisely enough to do this.\n\nWe have to have automated parking by the car\n\nto get it positioned exactly where we get enough transfer.\n\nAnd you are losing energy.\n\nIt's not gonna be 100% efficient.\n\nWire to wire is always going to get more across.\n\nSACtrades asks, What actually happens\n\nto EV car batteries after they die?\n\nWhen the electric car's done,\n\nyou scrap the chassis, the metal\n\nlike you would any other car.\n\nBut then the lithium-ion batteries are handled separately.\n\nOver time, I think what we'll primarily see is\n\nthat the batteries are disassembled\n\nbecause we wanna reuse that lithium\n\nin other batteries in the future.\n\nSo there's a disassembly of the batteries\n\nand separation of the materials,\n\nand then they get used in other products.\n\nFor example, other lithium batteries.\n\nA Reddit user asks, By the end of the 2030s,\n\nwill electric cars have largely replaced gas-powered cars\n\nin the United States?\n\nEnd of the 2030s?\n\nThat's like 2038, 2039.\n\nIn terms of new car sales, personal opinion, yeah,\n\nI mean, there's gonna be very few gasoline car sales\n\nby that time.\n\nIt's a superior technology.\n\nYou know, once you've driven an electric car,\n\nyou say, Oh man, I'm not buying another gas car.\n\nOnly people in specialized situations,\n\nthey need to drive a long ways,\n\nor there's some reason they need to refuel quickly,\n\nthey may keep buying gas cars for a while.\n\nBut by the mid 2030s or early 2030s you say,\n\nOh, well, I'll just buy a thousand-mile range EV\n\nbecause I don't wanna go back to gasoline.\n\nCallAmbassador4891 asks,\n\nAre EV sales really tanking?\n\nConsidering buying one this year\n\nbut hearing mixed things.\n\nEV sales are are gonna level out a bit\n\nwith the tax credit gone for the next several years.\n\nBut EV sales are not tanking.\n\nThe rate of growth has dropped a bit.\n\nWe're at about 10% of new car sales are EVs.\n\nI don't really expect that to shrink.\n\nMarkJParkerSr asks, Can we retrofit EVs\n\nso these tiny forever batteries will continuously run\n\nan alternator to continuously charge the car's EV battery?\n\nThen you'll never have to pull into a gas station.\n\nOkay, well, this is a perpetual motion machine.\n\nNo, you can't make something that works like that.\n\nLawtoshi asks,\n\nWhy aren't gas stations installing EV chargers?\n\nMore customers, more revenue, minimal upfront investment.\n\nThat's a good question.\n\nSome gas stations are installing EV chargers.\n\nSometimes people use them and oh, that's fine.\n\nBut a gas station's not really\n\na place you want to hang around for half an hour.\n\nIf you're gonna be out there a half hour,\n\nwouldn't you rather be at a 7-Eleven or McDonald's?\n\nYou know, someplace where you could have a coffee,\n\nmaybe a little food,\n\nor would you rather be someplace that's really smelly\n\nand kind of dirty and grease on the pavement?\n\nNo, gas station's not a good place for EV charging.\n\nYou're much more likely to have a fast food place\n\nor some kind of small shop\n\nwhere you can buy a bite to eat, something like that.\n\nThat's a much better place for an EV charger.\n\nOkay, that's it.\n\nThat's all the questions.\n\nHope you learned some things for next time.\n\n[bouncy music]",
  "authors": [
    "Condé Nast"
  ],
  "url": "https://www.wired.com/video/watch/tech-support-engineering-professor-answers-electric-car-questions"
}