{
  "title": "Wired, in edicola il nuovo numero: l'energia che muove il mondo",
  "text": "Il nuovo numero di Wired è in edicola da qualche giorno ed è dedicato alla forza che alimenta il mondo: l’energia. Un tema che attraversa le pagine dell'edizione autunnale del nostro bookazine trimestrale in tutte le sue forme. Dalla fusione nucleare al solare spaziale, dalle startup più innovative ai carburanti di domani, i lettori troveranno in questo volume le tecnologie e le soluzioni che ci salveranno dal prossimo blackout. Ma non solo.\n\nIl cuore della rivista si apre con S.O.S. Software, un reportage che racconta cosa accadrebbe se il mondo digitale collassasse: chi custodisce davvero il codice che fa girare il pianeta? E come si prepara a salvarlo? Seguono Mai più blackout, un'inchiesta su ciò che abbiamo imparato dalla crisi energetica della penisola iberica, e Alta tensione, analisi dell'esperto Massimo Lombardini su come la battaglia sulle risorse di gas e petrolio stia ridefinendo le alleanze globali.\n\nWired\n\nNon manca uno sguardo al futuro: Neuroni e neutroni è l’intervista a Jacopo Buongiorno del MIT, che spiega come il nucleare (di nuova generazione, ovviamente) possa essere parte della soluzione, mentre l'articolo Galassie di specchi ci porta a ragionare sul solare spaziale, tra scienza e fantascienza. In La grande stanchezza, Cal Newport ci ricorda che anche la nostra energia è una risorsa da proteggere, mentre chiudono la sezione una selezione delle migliori startup dell’energia alternativa e due splendidi servizi fotografici: uno sull'estrazione del gas nelle remote lande siberiane e uno sul carburante del futuro.\n\nNel blocco Flash (storie brevi ma d'impatto) troviamo un’intervista esclusiva a Brian Chesky, CEO di Airbnb, che svela come intelligenza artificiale, overtourism e design stiano cambiando il modo in cui viaggiamo. Jason Kehe ci riporta al 1995 con Angelina Jolie aveva ragione, un’ode semiseria al film Hackers che diventa una lezione sul futuro dei chip. Entriamo poi nel sottobosco inquietante dei biohacker nell'articolo Vivere per sempre (o morire provandoci).\n\nChiude il numero la sezione Folder con le storie più visionarie: l’intervista a Demis Hassabis (DeepMind), l’inchiesta su chi ha trovato alcuni pericolosi assassini grazie alla cronologia di Google e un’immersione nella vita del “Dio” degli allucinogeni DMT firmata dallo scrittore Andy Greenberg.",
  "authors": [],
  "url": "https://www.wired.it/article/wired-in-edicola-nuovo-numero-energia-che-muove-il-mondo/"
}