{
  "title": "7 Ways to Improve Any Lentil Soup",
  "text": "Advertisement\n\n7 Ways to Improve Any Lentil Soup These expert tips will make every bowl of the season feel fresh and fun. Keep your lentil soups exciting all season long. Credit... Dane Tashima for The New York Times\n\nStir, simmer, sip, savor: The steps to making lentil soup are as steadying as the dish itself. Regardless of what’s added to it, a spoon of soupy lentils warms from within. Here are seven secrets to conjure that softness whenever you need it.\n\n1. Add some heat\n\nSambar, a South Indian stew typically served for breakfast, is topped with chiles. Credit... Rachel Vanni for The New York Times. Food Stylist: Spencer Richards.\n\nBecause lentils are fairly mellow in flavor, they can work with whatever aromatics they’re simmered with. One option is a confident kick of heat, like in Lidey Heuck’s lentil soup, which uses red curry paste, garlic, ginger and fresh red chile. The lentils lend a creamy, soft padding so that the punch of heat doesn’t burn too much.\n\n2. Throw in a dash of turmeric\n\nTurmeric gives this quick everyday dal a distinct earthiness, and the chhonk, or tempering, made from spices sizzled with ghee, adds instant depth. Credit... David Malosh for The New York Times. Food Stylist: Simon Andrews.\n\nA pinch of turmeric is never terribly far from a lentil. Dishes like dal, sambar, ash reshteh, harira and mulligatawny soup all pair the two ingredients, to list just a few. The turmeric stains the broth golden, a hint at the warmth within. Add some to your next soup to deepen its earthy flavor.\n\n3. Blend half\n\nA hearty red lentil soup from Somali cuisine, maraq misir can be blended until smooth or creamy, or just partly blended and left satisfyingly chunky. Credit... Armando Rafael for The New York Times. Food Stylist: Simon Andrews.\n\nWhen you blend up a lentil soup, the starches will make the broth creamy, which could get monotonous to sip after a few spoonfuls. So instead, blend just some of it. The broth will thicken, while the remaining lentils will lend a bit of texture. Red lentils, like the ones used in Ifrah F. Ahmed’s recipe, are especially suited for this: Because they typically come skinned and split, they’re more willing to give up their starchiness at the buzz of a blender.\n\n4. Make it in a slow cooker\n\nThis sausage and lentil soup simmers while you’re at work all day. Credit... Julia Gartland for The New York Times. Food Stylist: Barrett Washburne.\n\nA slow cooker turns just about any dish into a hands-off endeavor, but it’s especially nice for lentils, as they gently, fully cook in their surrounding liquid. Throw in some aromatics, broth and lentils in the morning. (Or make up this sausage and lentil soup, this version with apples or this tomato-y take.) Then when you return from work, your house will smell wonderful, and your soup will be ready for you.\n\n5. Turn it into a potpie\n\nA puff pastry lid can beautifully finish leftover lentil soup. Credit... Julia Gartland for The New York Times. Food Stylist: Samantha Seneviratne.\n\nThe classic combination of lentils, carrots, onions and celery is incredible underneath flaky pastry. By using store-bought puff pastry, the soup is still pantry-friendly, but the shatters of warm and buttery crust make it feel anything but everyday. You can use this recipe to start from scratch, or enliven leftovers by reheating them in the oven under a puff pastry cap.\n\nNeed some recipes to start? Lentil Soup Potpie\n\n6. Incorporate fresh produce\n\nAdd raw chard to your lentil soup, along with a spray of lemon or lime juice, to brighten its earthiness. Credit... David Malosh for The New York Times. Food Stylist: Simon Andrews.\n\nA sprinkle of soft herbs like cilantro, dill or parsley can brighten any lentil soup. But you can take it further. For instance, in this soup, raw chard stems marinate in a combination of lemon or lime juice, salt and fresh jalapeño. The crunch and acidity uplifts the soup without mitigating any of its soothing properties.\n\n7. Top with roasted vegetables\n\nSlices of caramelized eggplant add a welcome bite to Yewande Komolafe’s lentil and orzo stew. Credit... Tara Donne for The New York Times. Food Stylist: Liza Jernow.\n\nThe crisp, golden edges of roasted vegetables are a treat to come upon in slurps of soup, so top bowls of lentil soup with any easily roasted produce you have on hand. Rich, caramelized cubes of eggplant bring allure to Yewande Komolafe’s lentil and orzo stew, probably more so than if the eggplant was stewed in the same pot.\n\nFollow New York Times Cooking on Instagram, Facebook, YouTube, TikTok and Pinterest. Get regular updates from New York Times Cooking, with recipe suggestions, cooking tips and shopping advice.",
  "authors": [
    "Ali Slagle",
    "Ali Slagle Is A Recipe Developer",
    "Regular Contributor To Nyt Cooking Who Specializes In Low-Effort",
    "High-Reward Recipes. She Is Also The Author Of The Cookbook",
    "I Dream Of Dinner",
    "So You Don T Have To ."
  ],
  "url": "https://cooking.nytimes.com/article/how-to-make-lentil-soup"
}