{
  "title": "Kim Kardashian's Skims Debuts Face Shapewear",
  "text": "The Kardashians have a special knack for unironically generating rage bait, and their latest comes in the form of a special product Kim released under her billion-dollar shapewear brand, Skims.\n\nFor a breezy $48, you can now buy Skims’ “Seamless Sculpt Face Wrap,” a piece of fabric that resembles a post-surgery compression garment. A Herve Leger bandage dress for your face, if you will, that comes in “clay” or “cocoa.” This Sculpt Face Wrap, like many of the brand’s full-body products, is supposed to make your jawline — particularly your chin — look absolutely snatched over time.\n\nBefore we get into my cultural appropriation rant, let’s cover the basics. Will it work? Allure, who thankfully did the research that we couldn’t bear to for this product, found that plastic surgeons “see no reason to believe it could snatch a jawline in a meaningful manner.” If you want a snatched jawline, you’ll need Kris Jenner money and a couple of weeks off from work.\n\nAdvertisement\n\nFace wraps are nothing new. They’ve been around for years and are particularly ubiquitous across the East Asian beauty industry. In China, the idea that compressing and/or rubbing parts of your face can change its composition goes back centuries, namely with the traditional medicine practice of gua sha.\n\nIf you’ve never heard of it, gua sha involves taking a smooth-edged tool—often made out of jade, rose quartz, or other stones rich in minerals—and rubbing it across your face at certain angles to promote blood flow, relieve pain, and ultimately give the face a healthier, more rested look.\n\nIn East Asia, where round faces and fuller cheeks are common, many of these face-shaping tools are now meant to create sharper, more Western-looking jawlines. Case in point: viral Korean face-shaping tape that is supposed to make your face “smaller” and create a sharp V-shape out of your chin. Like many new-ish beauty products in countries that have been impacted by colonialism, face shaping has turned into a means of achieving Eurocentric beauty standards. Today, attempts at face shaping exist within the multiverse of procedures like double eyelid surgery, which creates a visible crease in the upper eyelid and is the most common form of plastic surgery in South Korea today.\n\nAdvertisement\n\nThe western industrial beauty complex also heavily co-opted the gua sha to promise a snatched jawline too. In the U.S., the idea that you can physically mold your face has recently received a lot more attention thanks to TikTok, where some creators swear by face wraps and sculpting tools they claim are changing the composition of their faces.\n\nTo me, these trends feel a little more ominous than the ancient practice of gua sha, which is meant to promote a healthier version of the face you already have.\n\nAlthough Skims’ face wrap is already shaking up social media, it’s drawing from a trend in the East Asian beauty industry that prioritizes suffocating standards of Western beauty. We’re all for a placebo that makes you feel good (hello, watermelon sheet masks), but this probably ain’t it.",
  "authors": [
    "Contributing Writer"
  ],
  "url": "https://www.huffpost.com/entry/skims-shaping-face-wrap-asian-culture_n_688cd526e4b066f1fa227b8b?origin=top-ad-recirc"
}