{
  "title": "US in talks to attend G20 summit after initial boycott, South Africa says",
  "text": "The US has changed its mind about attending the G20 summit in Johannesburg, South Africa’s president has said, without confirming whether Donald Trump, who had said the US would boycott the event, now wanted to come.\n\nTrump has claimed that South Africa racially discriminates against the minority white Afrikaner community, which led the country during the apartheid regime that ended in 1994.\n\nEarlier this month, the US president alleged there were “abuses” of white farmers, including violence and land confiscation, and said it was a “disgrace” that South Africa was hosting the G20. South Africa’s government has vehemently denied the accusations and pressed ahead with its plans to host the first G20 summit in Africa. The two-day summit opens in Johannesburg on Saturday.\n\nAt a press conference with the European Commission president, Ursula von der Leyen and the European Council’s president, António Costa, Cyril Ramaphosa said: “We have received notice from the United States, a notice which we are still in discussions with them over about a change of mind, about participating in one shape, form or other in the summit.\n\n“This comes at the late hour before the summit begins and so therefore we do need to … see how practical it is and what it finally really means. In a way we see this as a positive sign, very positive, because as I’ve often said, boycott politics never work.”\n\nView image in fullscreen ‘Boycott politics never work,’ said the South African president, Cyril Ramaphosa. Photograph: Kim Ludbrook/EPA\n\nEarlier on Thursday, Chrispin Phiri, a spokesperson for South Africa’s foreign ministry, had accused the US of trying to coerce the country, after media reported that a US diplomatic note sent to South Africa said no final statement by G20 leaders could be issued without its presence.\n\n“Washington’s absence negates its role over the G20’s conclusions,” Phiri said. “But we cannot allow coercion by absentia to become a viable tactic; it is a recipe for institutional paralysis and the breakdown of collective action.”\n\nThe note from the US embassy in Pretoria, sent last weekend, said the US would accept only a “chair’s statement” rather than a leaders’ declaration, according to AFP.\n\nThe note read: “South Africa’s G20 priorities run counter to US policy views, and we cannot support consensus on any documents negotiated under your presidency. The US opposes issuance of any G20 summit outcome document under the premise of a consensus G20 position without US agreement.”\n\nSouth Africa’s priorities for its G20 presidency include improving debt sustainability for low-income countries and more finance for a “just energy transition” away from fossil fuels. It has invited an additional 22 countries to the summit and tried to present itself as a mature champion of multilateralism, the global south and Africa.\n\nThe US secretary of state, Marco Rubio, said in February that South Africa’s G20 themes of “solidarity, equality, & sustainability” amounted to “anti-Americanism”.\n\nThe US, which is taking over the presidency of the G20 next year, has also criticised the forum’s expansion from its initial focus on global financial and economic issues when it was founded in 1999.\n\nThe US treasury secretary, Scott Bessent, said at an Oval Office event: “We have whittled down the G20 back to basics … the G20 had become basically the G100 this past year. So it will be a concentrated group in Miami, seeing the best America has to offer, with American leadership.”\n\nView image in fullscreen South Africa’s priorities for its G20 presidency include improving debt sustainability for low-income countries and more finance for a ‘just energy transition’ away from fossil fuels. Photograph: Themba Hadebe/AP\n\nIn a separate event on Thursday, Ramaphosa responded: “My retort is, no, we didn’t convene the G100; we have convened the G million, if you like, the G20 million.\n\n“Because if we are to create a world that is prosperous, a world that is caring, a world that is more equal, a world that is underpinned by solidarity, we do believe that it is important to involve the people who are going to be affected by the decisions that the leaders’ summit are going to take.”\n\nRamaphosa also told reporters last week that he didn’t want to hand the G20 presidency over to an “empty chair”.\n\n“But the empty chair will be there, probably symbolically hand over to that empty chair and talk to President Trump and say, ‘Even though you are not here, I am now handing over to you the reins of chairing or being president of the G20.’ Because the G20 as an entity continues, whether they are here or not.”\n\nThe G20, which includes 19 of the world’s largest economies and the European Union, traditionally issues a communique at the end of the leaders’ summit every year. Last year, Ukraine and its western allies criticised the final statement for not mentioning that Russia had invaded Ukraine.\n\nAgence France-Presse contributed to this report",
  "authors": [
    "Rachel Savage"
  ],
  "url": "https://www.theguardian.com/world/2025/nov/20/south-africa-says-us-boycott-of-g20-is-coercion-by-absentia"
}