{
  "title": "Jasmine Crockett Explains In Fiery Speech Why Trump Is Fully ‘Crashing Out’ Right Now",
  "text": "LOADING ERROR LOADING\n\nRep. Jasmine Crockett (D-Texas) on Wednesday delivered a scorching opening statement during a House Judiciary Committee hearing, stating President Donald Trump is “crashing out” over the increasing focus on his past ties to late child sex trafficker Jeffrey Epstein.\n\nCrockett began by arguing that Trump has turned government agencies into “instruments of autocracy,” citing his troop deployments to major cities, before giving “complicit” Republicans supposedly enamored with law and order some reasons to follow through.\n\nAdvertisement\n\n“No. 1, this is the president of the United States standing beside his best friend Jeffrey Epstein,” said Crockett as an aide held up a photo of the two. “As we all know, Mr. Epstein was one of the most notorious sexual predators in American history.”\n\nThe Texas Democrat went on to argue that her Republican colleagues have “chosen to protect” the pair instead of working toward justice for Epstein’s victims, who recently shared tearful testimonies on Capitol Hill, noting: “Now the administration is panicking.”\n\nA unanimous consent vote Tuesday in the Senate landed the Epstein Files Transparency Act on Trump’s desk, which he signed after months of dismissing the case as a “hoax” despite U.S. Attorney General Pam Bondi vowing in February to release related files.\n\nAdvertisement\n\n“First, they campaigned on releasing the Epstein files, then AG Bondi and associates did a photo-op with the files, and she said, and I quote, ‘The Epstein list is on my desk,’” said Crockett. “Then, somehow, the Epstein list didn’t exist.”\n\nShe continued, “Then, the Epstein files became a ‘Democratic hoax.’ Now, the president is supposedly supportive of releasing the files, even though he’s currently ignoring a congressional subpoena to do so. Now, the president is simply crashing out.”\n\nJasmine Crockett: “Now the president is simply crashing out. It’s because he can’t seem to explain his special decades long relationship with one of the most prominent sexual predators in American history. It’s already public that he’s in the Epstein Files, but his administration… pic.twitter.com/dsyJjsyDWG — Marco Foster (@MarcoFoster_) November 19, 2025\n\nAdvertisement\n\nCrockett went on to wager that Trump is frazzled because “he can’t seem to explain his special, decades-long relationship” with Epstein, whom she described as “one of the most prominent sexual predators in American history.”\n\nThe congresswoman noted that the public already knows Trump is mentioned in numerous government documents relating to Epstein, but said Trump’s administration is actively “hiding the context of his involvement, if any,” in Epstein’s criminal wrongdoing.\n\nCrockett, who went on to chronicle the alleged crimes of numerous other Trump officials, including Homeland Security Secretary Kristi Noem, ICE director Tom Homan and Trump’s pardon attorney Ed Martin, was certainly right about the president “crashing out.”\n\nAdvertisement",
  "authors": [
    "Trends Reporter"
  ],
  "url": "https://www.huffpost.com/entry/jasmine-crockett-trump-crashing-out-epstein_n_691f1af4e4b0d33fcd98ce2d?origin=top-ad-recirc"
}