{
  "title": "When will the Epstein files be released now that the Senate has agreed to make them public?",
  "text": "When will the Epstein files be released and will they be redacted?\n\n8 hours ago Share Save Bernd Debusmann Jr, The White House and Nardine Saad Share Save\n\nReuters Survivors and family members talk about Jeffrey Epstein files\n\nUS President Donald Trump has signed a bill ordering the justice department to release all its files from its investigation into convicted paedophile Jeffrey Epstein. The legislation, which calls for the release of the files \"in a searchable and downloadable format\" within 30 days, was approved overwhelmingly in both chambers of Congress, the House of Representatives and Senate, on Tuesday. Trump then announced on his Truth Social platform that he had signed it on Wednesday, starting the clock on release of the files. Under pressure from Epstein's victims and rank-and-file Republicans, Trump on Sunday made a major reversal in his stance on the files and gave his blessing to passing the legislation. For months, he had resisted unsealing many documents from the federal investigation into the late financier.\n\nCongress' lower chamber began debating the measure on Tuesday morning and voted within hours. Several of Epstein's victims spent the day on Capitol Hill advocating for the bill's passage. Nearly all House lawmakers voted in favour of the resolution, which passed 427-1. Clay Higgins, a Louisiana Republican, was the only one who voted against the bill. Two Republicans and three Democrats did not vote. The Senate then passed the resolution. The House Oversight Committee has already made public thousands of documents from the Epstein estate relating to the late financier, but the resolution covers material currently in the possession of the justice department. Those records could, in theory, include files about imprisoned Epstein co-conspirator Ghislaine Maxwell, as well as figures - including government officials - mentioned in the case. It could also include internal justice department documents.\n\nWhen did Trump sign the bill?\n\nOn Wednesday morning, the Senate confirmed that it had passed the Epstein bill and sent it to Trump. Later that evening, Trump posted on social media that he had signed it into law. While the press and others are often invited to witness Trump's bill-signings, this was done out of public view, and the announcement was included in a long post that also blasted Democrats he claimed were tied to Epstein, touted the president's record during this second term, and addressed the two impeachment trials of his first term. \"Perhaps the truth about these Democrats, and their associations with Jeffrey Epstein, will soon be revealed, because I HAVE JUST SIGNED THE BILL TO RELEASE THE EPSTEIN FILES!\" he wrote. He added that because he had asked Republican lawmakers to support the measure \"the votes were almost unanimous in favor of passage.\"\n\nWhen will the Epstein files be released?\n\nThe justice department now has 30 days to release its materials on Epstein. But there are obstacles to the files being shared. The House bill said the justice department can hold back any documents that \"jeapordise an active federal investigation or ongoing prosecution, provided that such withholding is narrowly tailored and temporary\". That could potentially lead to delays, given that Trump has called for investigations into Epstein's links with prominent Democrats, such as Bill Clinton and Larry Summers, \"to determine what was going on with them, and him\". Clinton has strongly denied he had any knowledge of Epstein's crimes, whereas Summers has apologised for his \"misguided decision\" to continue communicating with Epstein until 2019. \"That's a potential hurdle,\" Jonathan Entin, a constitutional law professor at Case Western Reserve University in Ohio, told the BBC. \"If, in fact, this is a serious investigation, presumably the prosecutors will not want everything out there while they're sorting out whether they bring charges.\" For those who have campaigned for the release of the files, anything short of full disclosure is likely to spark further questions and even outrage. Several Republican lawmakers have expressed worries that Trump's order to the justice department to investigate Epstein's ties could slow the release of the files. Thomas Massie, a Kentucky congressman, vowed that he and fellow Republican dissident Marjorie Taylor Greene, of Georgia, would \"absolutely\" go to the floor of the House and read out the names of \"some of the men\" in the files if the records were not duly released by the justice department.\n\nWatch: How much do Americans care about the Epstein story?\n\nWill the files be redacted?",
  "authors": [],
  "url": "https://www.bbc.com/news/articles/cq50nvq8znvo"
}