{
  "title": "Chinese Beverage Chains Spread Across the US, Challenging Starbucks' Dominance",
  "text": "Starbucks opened its first store in China in 1999, when drinking coffee in a Western-style café was still a novel idea to many locals. But in the years since, homegrown coffee and bubble tea brands like Luckin Coffee, Heytea, Chagee, and Mixue have gradually chipped away at Starbucks’ share of the Chinese market. Now, they are crossing the Pacific, hoping to compete with the Seattle-based coffee giant and other American beverage chains on their home turf.\n\nWe wanted to experience—and taste—what these Chinese brands are offering American consumers. Over the past week, we visited two Luckin coffee shops and one HeyTea store in New York City, as well as one Chagee location in Los Angeles. What we found was a new and different beverage culture taking shape, built around speed, smartphone apps, and premium flavors.\n\nThe arrival of these Chinese chains comes at a difficult moment for Starbucks. The company closed more than 600 stores worldwide this year and laid off roughly 900 corporate staffers. New York City mayor-elect Zohran Mamdani urged people on Thursday to boycott Starbucks as unionized baristas at dozens of its US locations went on strike. And earlier this month, Starbucks announced it had agreed to sell up to 60 percent of its China business to a private equity firm.\n\nLuckin’s App-First Model\n\nThe Chinese beverage brand that appears to be expanding fastest in the US is Luckin, which has opened five locations in Manhattan this year alone. Luckin is China’s largest coffee shop chain, with more than than 26,000 stores globally. In China, there are about three Luckin coffee shops for every one Starbucks. The company was started by a former tech executive less than a decade ago and is known for its slick, app-oriented cafés.\n\nZeyi visited one of Luckin’s outposts in the Financial District in New York City, where he got a regular-sized iced coconut latte that cost $7.02 after tax. He says he was struck by how quiet it was—at 4 pm on a Tuesday, there were about four customers in the store. But the eerie silence had more to do with how the staff were behaving. Luckin requires customers to place their orders online, so there’s no need to speak to a human.\n\nA computer screen alerted the baristas when orders came in and printed stickers for them to put on each cup. The only customer interaction happened when Zeyi and another person appeared confused at the counter. \"Is it your first time here?\" an employee asked. “We do everything online here. You can scan the code and order.\" When Zeyi’s drink was done, he says the baristas just left it on the counter, and he had to figure out which one was his by himself.\n\nThe next day, Zeyi visited another Luckin location in Midtown that he says was busier than the first store. This time, he decided to download the Luckin app—new customers who use it can get their first drink for $1.99, a very good deal in New York City. Zeyi ordered a cold brew, and the baristas once again said nothing when it was ready.",
  "authors": [
    "Louise Matsakis",
    "Zeyi Yang"
  ],
  "url": "https://www.wired.com/story/luckin-chagee-mixue-chinese-tea-coffee/"
}