{
  "title": "Following Your Stolen Data Through The Dark Web",
  "text": "Transcript\n\nPeople and companies get hacked all the time.\n\nCorporate secrets, credit card numbers,\n\npassword to your email, your medical information,\n\neven your Netflix login might get stolen.\n\nBut where's that data go?\n\nToday, we're doing a deep dive into the hacked data economy.\n\nWe'll also speak with Troy Hunt,\n\nfounder of Have I Been Pwned,\n\na tool that lets you know if your data's been breached.\n\nThis is Incognito Mode.\n\n[pensive music]\n\nThere are a few types of hackers.\n\nThere's state-sponsored hacking groups\n\nor advanced persistent threats.\n\nThere's hacktivists.\n\nAnd then there's criminal hackers.\n\nState-sponsored hackers are typically going to be hacking\n\nfor espionage, blackmail,\n\npurposes that serve the state that they're sponsored by.\n\nThere's also hacktivists, which go after companies\n\nor other organizations that they have some problem with.\n\nThink a weapons manufacturer or a police department.\n\nAnd then there's criminal hackers.\n\nThese types of hackers are pretty indiscriminate.\n\nThey'll go after any system where they can steal data\n\nand then make money from that data in one way or another.\n\nWhat happens to your data\n\nafter it gets stolen really depends on who did the hacking.\n\nIf it's a state-sponsored hacker,\n\nwe might not know what happens to that data.\n\nBecause state-sponsored hackers\n\nare acting on behalf of their own government,\n\nthe data often goes into a black box,\n\nand as an outsider,\n\nit's really hard to know what happens to that data.\n\nOne of the largest data breaches in history,\n\nit happened at Equifax,\n\nthe company that tracks all your credit cards\n\nand mortgages to determine your credit score.\n\nIn the case of Equifax,\n\ntens of millions of people's data was stolen,\n\nbut we've never seen that data surface online.\n\nSometimes the data is leaked.\n\nThink Russia's hack of the Democratic National Committee,\n\nwhich had all its emails published online.\n\nThe US government investigation\n\ninto the Russian hack of the DNC\n\nfound that one of the main reasons for the breach\n\nwas to release the data\n\nand cause chaos in the US political system.\n\nWe don't know if they did anything else\n\nwith the data as well.\n\nIn the case of a breach by hacktivists,\n\nthe hackers will often steal the data\n\nand then share that with journalists\n\nor maybe just post it themselves online.\n\nNotorious hacking group Anonymous\n\nhas declared war on Russia.\n\nRussian government,\n\nRussian military records being dumped out\n\nunder the internet.\n\nThe goal is really to embarrass, shame,\n\nand cause problems for whatever entity that they packed.\n\nHacks by cyber criminals are probably what you think of\n\nwhen you think of getting hacked.\n\nWhen criminal hackers break into a system,\n\nthey'll often steal as much data as they can.\n\nThink credit card numbers, your email and passwords,\n\nyour medical information.\n\nFrom there, it gets sold and traded\n\nto other criminal hackers.\n\nAnd by the time you know\n\nthat your credit card has been stolen,\n\nit may have been posted online multiple times.\n\nWhile any hacker might post information online,\n\nit's a criminal hack\n\nwhere you most likely see your information exposed.\n\nSo if you go to a website like Have I Been Pwned\n\nand see that your information was breached,\n\nit was probably a criminal hack.\n\nSome state-sponsored hackers blur the lines\n\nand get into criminal hacking.\n\nNorth Korea, for example,\n\nis involved in billions of dollars worth of theft\n\nof cryptocurrencies either through ransomware attacks\n\nor hacking crypto exchanges directly.\n\nIt's widely believed North Korean hackers\n\nused the stolen money to fund the government,\n\nincluding its nuclear weapons program.\n\n[pensive music]\n\nThere are two main ways that criminal hackers make money:\n\none is selling your data and the other is ransomware.\n\nFirst, we'll talk about ransomware.\n\nRansomware is a type of malware that allows a hacker\n\nto go into a system, steal the data,\n\nand then encrypt the system so it's unusable.\n\nYou often see hospitals, government organizations,\n\nand other entities that need to function\n\nget targeted by ransomware.\n\nThey'll say, If you don't pay me, say 200 Bitcoin,\n\nwe're gonna leak your data online.\n\nWhen we're talking about medical information\n\nor financial information,\n\nthis is really sensitive\n\nand could be extremely damaging,\n\nnot just to you, but to the organization itself.\n\nA victim organization typically has two choices.\n\nThey can either pay or not.\n\nIf they choose not to pay\n\nand the hackers do leak the data,\n\nthe victim organization is just gonna have to deal\n\nwith the fallout from that\n\nand likely have to have some type of way\n\nto mitigate the attack and get back online\n\nand continue their operation.\n\nThe other option, which experts highly advise against\n\nbecause it encourages other ransomware attacks,\n\nis to pay the ransom.\n\nThis happened to Change Healthcare\n\nwhen in 2024 there were victims of a ransomware attack\n\nand ultimately paid 350 Bitcoin, around $22 million,\n\nto the hacker group.\n\nUnfortunately, for Change Healthcare,\n\na second hacker group got his hands on the data\n\nand appeared to post it online.\n\nSo even though Change Healthcare paid a fortune\n\nto keep their data from getting leaked online,\n\nit still happened, and they didn't get much out of it.\n\n[pensive music]\n\nAnother way hackers make money\n\nis by just selling your data online.\n\nSo what does that mean exactly\n\nand what does that look like?\n\nSo if your data is sold, it's often packaged together,\n\nauctioned off, and paid for.\n\nThis is a massive underground economy\n\nand what we call the hack data pipeline.\n\nNewly stolen data often first appears in private groups\n\nlike hacker networks, forums, and group chats\n\nbefore it ever hits the open market.\n\nYou can think of this as the wholesale distribution step\n\nwhere hackers share the data with trusted sources\n\nand try to unload it all at once for a huge sum.\n\nFrom there, the data makes its way to dark web marketplaces.\n\nThe dark web is in searchable with normal tools like Google.\n\nYou have to use a special browser called a Tor Browser\n\nto access dark website.\n\n[Narrator] Tor Browser is just like any other browser,\n\nexcept it protects you against surveillance and censorship\n\nwhen surfing the internet.\n\nIt was developed\n\nto make it difficult for people to know who you are\n\nand what sites you're visiting.\n\nDark web market places provide anonymity\n\nfor both sellers and buyers,\n\nmaking it ideal for cyber criminals.\n\nHacked data is also used to build tools\n\nto help protect people who've been affected by breaches.\n\nOne of these tools is Have I Been Pwned.\n\nTroy Hunt, thanks for joining us.\n\nFor somebody who's never like been\n\non one of these kinds of forums,\n\nwhat does that look like?\n\nWell, they look just like a forum to comment on cats.\n\nThere's threads and comments and reputations\n\nand everyone's trying to be anonymous.\n\nIt's a very recognizable environment.\n\nYou've just got people there talking about crimes\n\nand exchanging personal data for their own benefit.\n\nWhat would you say is kind of the most sensitive data\n\nthat ends up getting shared in these databases?\n\nSo we categorize somewhere in the order\n\nabout 150 data classes,\n\nso different types of personal information,\n\nand by far, the number one most prevalent is email address.\n\nPasswords are still enormously prevalent as well.\n\nUsually not in plain text these days.\n\nThey're hashed and protected to one degree or another.\n\nAnd after that, the most common attributes\n\nare things like name, phone number, physical address.\n\nBut then if we go all the way through\n\nto the most sensitive end,\n\nwe get anything from, say, government-issued IDs.\n\nSo it's things like a passport, a driver's license,\n\nthrough to the things that are deeply personal,\n\nlike health data,\n\nand all the way through to sensitive topics\n\nabout the desires that you have in the bedroom.\n\nAnd then something like Ashley Madison\n\nis a good example of that.\n\nThere are dozens of market places for stolen data.\n\nSome of them include STYX Market, Brian's Club,\n\nRussian Market, and BidenCash.\n\nSome of these marketplaces\n\nhave tens of thousands of listings.\n\nOften your data will be sold there\n\nalongside things like drugs, counterfeit items,\n\nor other cybercrime tools.\n\nMarket prices for your data vary,\n\nbut some are surprisingly cheap.\n\nFor example, the details for a credit card\n\nwith a $5,000 balance can go for as little as $110.\n\nA Netflix login could cost somebody as little as 10 bucks.\n\nThings like credit card info are usually sold in bulk.\n\nBut for higher value data like corporate secrets,\n\nthey're often auctioned off to the highest bidder.\n\nMarketplaces are often controlled by groups\n\nor individuals based in Eastern Europe\n\nor in other areas that don't have extradition treaties\n\nwith the United States like Russia or China.\n\nAs you can imagine,\n\nmost sales in dark web markets\n\nare made using cryptocurrency,\n\nwhich make it much more difficult to trace\n\nthan something like a credit card or PayPal.\n\nStolen data is often sold to other cyber criminals\n\nwho use it for identity theft,\n\ntaking over social media accounts,\n\nmedical fraud, and more.\n\nStolen emails, usernames, and passwords are often used\n\nfor something called credential stuffing.\n\nThis is when a cyber criminal tries a username and password\n\non a bunch of different sites or services\n\nand tries to hack in.\n\nThis works because people very often reuse the same password\n\nover and over again,\n\nallowing a criminal to get into an account\n\neven if they don't really know what the password is.\n\nSo if the cyber criminal buys the login\n\nfor your email address,\n\nthey might then use that information\n\nto get into your social media accounts,\n\nmessage all your friends and ask for money.\n\nThey could also do something more straightforward,\n\nlike get into your bank account\n\nand then just wire themselves all your money.\n\nYour stolen information can be used\n\nto open fraudulent bank accounts,\n\napply for loans, or commit tax fraud.\n\nYour medical information might be used for insurance scams\n\nor to get prescription drugs.\n\nOnce your information is posted online,\n\nit can be sold and resold and used by multiple hackers\n\nbefore you even know it's stolen.\n\nThat means the hacker that stole your data\n\nisn't necessarily the same person\n\nwho's putting fraudulent charges on your credit card.\n\nEven if the information is stolen is really basic,\n\nlike just your name and your email address\n\nand phone number,\n\nthat can still be used for phishing attacks\n\nin which cyber criminals send malicious links\n\nand get people to download malware.\n\nIt can also be used to target you for scams.\n\nSo if your phone number is leaked,\n\nscammers might have you on a list\n\nand text you trying to get you to send the money.\n\n[pensive music]\n\nTroy, if you've been in this world doing this work\n\nfor more than a decade,\n\nhow would you say things have changed since the early days\n\nin terms of either the types of data,\n\nthe frequency of breaches?\n\nThe things that I have clearly seen change\n\nis, for example, the way passwords are protected.\n\nIf we go back to data breaches from 2012,\n\nLinkedIn, Dropbox, for example,\n\nthe way the passwords were protected then\n\nand the hashing algorithms they used\n\nare not things that we see very often today,\n\ncertainly not with any sort\n\nof large significant organizations.\n\nOver the course of time,\n\nwe've definitely seen different attack vectors,\n\nso different ways in which data has been obtained,\n\nvery frequently\n\nbecause different platforms have either gained popularity\n\nor there's been common vulnerabilities or misconfigurations.\n\nThere was a while there\n\nwhere there was lots of MongoDB that was exposed,\n\nand then there was a lot of Amazon S3 buckets exposed,\n\nand then a lot of Elasticsearch instances exposed.\n\nSo we're seeing that sort of vector change,\n\nbut we're not really seeing the fact that there's millions,\n\nhundreds of millions of email addresses\n\nand personal information appearing\n\nin data breaches every day.\n\nDo you feel like the public understanding of cybersecurity\n\nand cybersecurity practices has changed?\n\nConsumers, if anything, I feel\n\nare developing a little bit of apathy\n\nwhere they're just say, Ah, this is another data breach,\n\nuntil something actually stings them in some way\n\nand they actually lose some money\n\nor there's a tangible impact to their privacy.\n\nWe feel that there's probably not a lot of impact\n\non consumers\n\nor not a lot of things that are changing,\n\nand we're hearing this term a little bit\n\nof data breach fatigue.\n\nFor organizations, it's a tricky one.\n\nI feel organizations are increasingly standoffish\n\nwhen it comes to data breach.\n\nI'm finding very, very often\n\nthey're not disclosing to individuals,\n\nand usually they have a legal right\n\nnot to disclose to individuals as well.\n\nThey're particularly skittish\n\nabout the things like class actions.\n\nIt just seems like every data breach\n\nof any significance that happens\n\nregardless of what the actual impact is on individuals,\n\nliterally the next day,\n\nthere's a law firm doing a class action.\n\nAnd I think organizations are adapting their behavior\n\nto disclose much less information\n\njust due to fear of being then used in legal proceedings.\n\nSo what can you do?\n\nWell, first, if you're notified of a breach\n\nand your data was stolen,\n\nmake sure to change your password\n\nand not use that password anywhere else.\n\nIn fact, the best thing to do is use a password manager.\n\nThis allows you to create unique,\n\ndifficult to crack passwords across every app\n\nand website you use.\n\nThat way, if a hacker gets access to one password,\n\nthey can't use it on another account.\n\nEven if you learn about a breach that happened months\n\nor even years ago,\n\nthat data is still out there\n\nand the hacker or some other person\n\nmight use that data in the future.\n\nMake sure to freeze your credit\n\nif you're part of a breach\n\nwhere a lot of personal information\n\nthat can be used in financial fraud is stolen.\n\nIf someone takes out a credit card in your name\n\nand never pays the balance,\n\nwhich of course, they're not going to do,\n\nit's not gonna tank your credit score\n\nand prevent you from getting loans\n\nor credit cards in the future.\n\nYou'll also want to get credit monitoring services\n\nso that you'll be alerted\n\nif somebody tries to open an account in your name.\n\nAnother key step in practicing good security\n\nis to use multi-factor authentication\n\neverywhere it's available.\n\nIt's important to use a tool that's trusted\n\nlike Google Authenticator or a YubiKey.\n\nOtherwise, your data might not be as safe\n\nas you think it is.\n\nTry to avoid SMS-based two-factor authentication.\n\nAnd finally, always aim to use apps and websites\n\nfrom companies that have a good security track record.\n\nThis will reduce the chance\n\nthat your data will get stolen in the first place.\n\nThe fact of the matter is\n\nif your data hasn't already been stolen,\n\nit's probably gonna happen at some point.\n\nBut even if it is,\n\nit's still important to take steps to protect yourself\n\nbecause there can always be another breach\n\nthat exposes more data\n\nand creates more risk for yourself.\n\nThis has been an Incognito Mode.\n\nStay safe out there.\n\n[pensive music]",
  "authors": [
    "Condé Nast"
  ],
  "url": "https://www.wired.com/video/watch/incognito-mode-following-your-stolen-data-through-the-dark-web"
}