{
  "title": "Este país era un lugar pacífico. Hasta que llegaron el crimen organizado y la violencia",
  "text": "CNN Español —\n\nEsa húmeda y fría madrugada del jueves 20 de junio, que marcaba el inicio oficial del invierno uruguayo, Patricia Amaral se despertó sobresaltada por una ráfaga de balazos. Se asustó, pero no se sorprendió. Lamentablemente, era un sonido común en su barrio, Cerro Norte, donde los ladridos de los perros se confunden con los disparos y cualquier rotura con orificios de una 9 milímetros. Lo que no imaginó en ese momento es que al que estaban acribillando era su hijo, Arturito “el Chileno” Espinosa.\n\nEspinosa es uno más de los 277 asesinados entre enero y septiembre de 2025 en Uruguay, un país que, según su ministro del Interior, Carlos Negro, registra “tasas epidémicas” de homicidios. El índice es de 10,7 por cada 100.000 habitantes, uno de los más altos de la región. Pero en Montevideo esa cifra trepa a 16,8 y en la seccional 24, la zona del oeste de la capital uruguaya en la que vive Patricia, alcanza los 57,5 por cada 100.000 habitantes.\n\nEn particular, Cerro Norte es el epicentro de un enfrentamiento entre dos bandas dedicadas al narcotráfico y otras formas de crimen organizado: por un lado, “los Colos”, y, por el otro, “los Suárez” y “los Albín”. “Hay un enfrentamiento que empieza por el tráfico de drogas en la zona, pero luego esa relación va cambiando en la medida en que se dan asesinatos de un lado y del otro: la venganza”, explica el periodista policial uruguayo Guillermo Losa.\n\nPero Arturito nada tenía que ver con esos grupos, asegura su familia. Los vecinos y familiares lo describen como “un muchacho tranquilo”, querible, fanático de Peñarol y de Santiago Wanderers, de Chile —por herencia de su padre chileno— y buen padre de sus dos hijas. Trabajaba en la pesca, atendía un puesto en la calle y ayudaba a su madre en la rotisería barrial. Nada de eso sabían los que entraron a su humilde vivienda para matarlo mientras dormía. Los involucrados luego reconocieron ante la Justicia que se equivocaron de lugar y que buscaban a otra persona en la casa de al lado.\n\nA unos 30 metros de ahí vive Patricia, quien dedica sus horas a cuidar a Agustina, su nieta de cuatro años, la hija de Arturito, a quien cariñosamente apodan “la chilena”. Su casa es austera, de bloque, con pocas habitaciones. El lugar que en otro momento fue el salón de visitas se convirtió en un santuario para Arturito. Su madre muestra con cuidado un pequeño altar que simula un jardín (“él siempre quiso tener un jardín”), repleto de velas, fotos, dibujos, poemas, ropa, banderas, carteles, zapatillas deportivas y hasta una bicicleta. “Esto lo hicimos nosotros, la familia, para recordarlo”, dice, mientras acaricia su imagen. “Pero, además, el alma de Arturito concede deseos a quien se lo pida”, agrega.\n\nEn la fachada se ve el rostro del joven pintado en la pared, un texto en pintura blanca sobre negro que dice “por siempre en el alma, porque el corazón algún día se detiene y el alma continúa viva” y un poema escrito en tiza por Patricia, que empieza diciendo: “Para mi estrella luminosa”.\n\nAtaque a una fiscal, muestra de la escalada de la violencia\n\nOtra madrugada húmeda, esta del domingo 28 de septiembre, a unos 20 kilómetros de Cerro Norte, también se escucharon tiros y un fuerte estruendo que hizo vibrar las casas cercanas. Esta vez, la víctima del ataque fue la fiscal de estupefacientes, Mónica Ferrero, quien además desempeña el cargo de fiscal general subrogante.\n\nLa funcionaria resultó ilesa, pero el sistema político uruguayo y la propia fiscal recibieron el mensaje. El Parlamento se reunió de urgencia y tanto senadores como diputados condenaron unánimemente el atentado. El presidente de Uruguay, Yamandú Orsi, convocó de inmediato a la fiscal y a los líderes de todos los partidos y llamó a fortalecer las instituciones y a coordinar el combate al crimen organizado con los demás países de la región “ya que estos grupos no reconocen fronteras”.\n\nCNN\n\nLa fiscal Ferrero compareció un mes después ante una comisión del Senado y sus declaraciones provocaron otra explosión que resonó en la política uruguaya. Dijo que Uruguay debía mirarse en el espejo de lo que sucede en Río de Janeiro o en Ecuador, para evitar llegar a esos extremos. “Miren lo que está pasando en esos lugares”, les dijo. “¡Y miren la situación de Uruguay, donde a mí no me mataron por 15 centímetros!”, exclamó.\n\n“El crimen organizado, matándome a mí, mandaba un mensaje dentro del crimen: ‘lo logramos’, ‘miren hasta dónde llegué’. Ese es el mensaje interno”, enfatizó la funcionaria judicial. “Los fiscales están con temor”, agregó, y pronosticó que personas vinculadas al narcotráfico “van a empezar a tratar de coimear (sobornar)”. “Lo digo con el lenguaje claro del uruguayo: van a tratar de coimear y van a amenazar a los fiscales. Les van a decir a los fiscales que no digan nada porque, si no, mandan un video —como generalmente hacen estas organizaciones— diciendo: ‘Mirá que estoy viendo a tu hijo’.\n\n“A ustedes les va a pasar también”, les advirtió a los senadores, “cuando ellos quieran que exista una legislación que los favorezca en la parte criminal, van a ir por alguno de ustedes, como también por algún periodista”.\n\nCinco personas han sido detenidas como posibles autores materiales del ataque a la fiscal, pero las autoridades no las consideran “autores intelectuales”. La principal hipótesis de los investigadores, mencionada por la prensa, es que la banda de “Los Albín” está detrás del ataque.\n\n“Una decisión que tomar”\n\nSegún una encuesta de la consultora Cifra de octubre de 2025, el tema que más preocupa a la población uruguaya es la inseguridad (38% de la población), por encima de la economía, un ítem que suma “trabajo”, “desocupación”, “sueldos”, “pobreza”, y “situación económica” (37%).\n\nDespués del atentado a la fiscal, Diego Sanjurjo, gerente del Ministerio del Interior durante los últimos dos gobiernos (de partidos diferentes), posteó en su cuenta de X que, desde 1985 hasta ahora, “Uruguay tuvo 22 ministros del Interior y 13 directores de la Policía Nacional” y que, “pese a sus mayores esfuerzos, ninguno logró reducir los homicidios y todos fueron testigos del crecimiento de los mercados ilegales y de un consecuente aumento de distintas formas de criminalidad”.\n\nLa disposición de los barrios más conflictivos dificulta el ingreso de la policía — CNN\n\n“No somos excepcionales. Prácticamente todos los países latinoamericanos recorrieron el mismo camino: aumentaron cada quinquenio el presupuesto, el personal y los recursos de sus fuerzas de seguridad, solo para comprobar que el problema se volvía cada vez más grave y complejo”, añadió. “Las únicas excepciones son regímenes autoritarios como Cuba y El Salvador, donde la solución fue suspender el Estado de Derecho y la presunción de inocencia”.\n\nEl exfuncionario concluyó entonces que “Uruguay tiene una decisión que tomar” y escribió: “Podemos repetir la historia: polarizarnos en torno al populismo, exigir renuncias, pedir otra vez más policías y penas, siguiendo nuestra ruta fallida y la de nuestros vecinos. O podemos reconocer que precisamente esa combinación de polarización, populismo penal y abandono de las políticas preventivas y penitenciarias es lo que nos impide obtener resultados”.\n\nRécord de armas, otra señal de alarma\n\nLa “zona roja” de Cerro Norte es un entramado de apenas siete cuadras por siete, con pasajes tan angostos que ni los patrulleros ni las ambulancias pueden pasar por allí. Un laberinto que protege las actividades delictivas. “De noche te da miedo —dice Patricia— porque escuchás tiros y no sabés de dónde vienen”. Cuando oye disparos, su reacción es instintiva: “Saco a mi nieta del cuarto y la llevo más atrás”.\n\nCasi todas las casas del barrio muestran rastros de violencia. Agujeros de bala, algunos pocos apenas reparados, en puertas, techos y carteles. Coches quemados. Viviendas con carteles de “se vende” escritos a mano, porque cientos de vecinos quieren irse de allí o son expulsados. Casas saqueadas. Pedazos de vidrio, plástico y ladrillo que riegan el piso.\n\nUno de los pasajes, el de “los Colos”, es considerado por la gente del barrio como el más peligroso, porque a menudo los de la banda rival, “los Albín”, llegan hasta allí a repartir balazos. Fue ahí que, entre un almacén y una reja herrumbrada, en octubre de 2024 mataron a un bebé de un año, según informa la Policía.\n\nLa Policía patrulla la zona con vehículos blindados. “Andan por acá, sí”, se encoge de hombros Patricia Amaral, “pero las cosas igual pasan. Ellos buscan el momento justo”. Además, considera que los narcos tienen mejores armas que la policía.\n\nUruguay ostenta otro récord: es uno de los países con más armas de fuego registradas de América Latina. En diciembre de 2024, había en este país más de 617.000 armas, equivalentes a 17,5 por cada 100 habitantes o, dicho de otra manera, una de cada 6 personas tiene un arma legal, según un informe oficial del Ministerio del Interior. Las autoridades calculan que, por cada arma registrada, hay al menos otra más que no lo está.\n\nLa Hidrovía: el atajo del narcotráfico\n\nCinco jóvenes fueron acusados y tres de ellos condenados por el homicidio de Arturito Espinosa, según el expediente del juez Matías Porciúncula difundido por el diario El País. El padre del joven asesinado lleva el mismo nombre que el joven: Arturo Espinosa. Espinosa es chileno de nacimiento y uruguayo por adopción, cocinero y pescador. Junto a su mujer, Patricia, sostienen un cartel que reza: “Arturo Espinosa, justicia para él. Fiscalía, investigar más”.\n\nAmbos consideran que falta detener a otros implicados. Y que, además, las responsabilidades llegan mucho más arriba. “Es la droga de Marset”, dice Arturo.\n\nSebastián Marset es conocido como “el gerente de la Hidrovía” por la Justicia de Paraguay y de Bolivia. La Hidrovía es la ruta comercial marítima que conforma los ríos Paraguay y Paraná y que desemboca en el Río de la Plata. Ese mismo camino que permite a los narcos sacar su producción, sobre todo de cocaína, desde Bolivia y Paraguay y enviarla a los mercados que mejor pagan por ella: los de Europa.\n\nUno de los puertos de salida de ese comercio ilegal hacia el Viejo Continente es el Puerto de Montevideo. En los últimos años se han hecho públicas noticias de incautaciones de cocaína en embarcaderos europeos como Amberes o Rotterdam, en buques o contenedores, que habían pasado por Montevideo.\n\nUno de los puertos de salida de ese comercio ilegal hacia el Viejo Continente es el Puerto de Montevideo. (Imagen de 2020) PEDRO UGARTE/AFP/AFP via Getty Images\n\nEn agosto, las autoridades uruguayas incautaron más de dos toneladas de cocaína en un galpón del oeste montevideano. Esta “histórica incautación”, como la calificó la Policía uruguaya, confirmaría lo que las autoridades y analistas sospechaban: que Uruguay ya no es solo un lugar de tránsito, sino también de acopio de cocaína en su camino hacia Europa. “La cocaína estaba en un galpón precario, pero lleno de cámaras de seguridad. Esa droga se acopió en el lugar durante meses”, explica Guillermo Losa. “Eso quiere decir, de alguna manera, que los grandes narcotraficantes están confiando más en los grupos locales, porque les están dando más responsabilidades”.\n\nEstados Unidos ofrece una recompensa de hasta US$ 2 millones por la captura de Sebastián Marset. También es buscado por la Justicia de Bolivia y Paraguay, donde la operación “A Ultranza Py” vinculó, según el Departamento de Estado de EE.UU., “una red criminal liderada por Marset con más de 16 toneladas de cocaína incautadas en Europa, incluyendo 11 toneladas en el puerto de Amberes en abril de 2021 y otras 4,7 toneladas en Paraguay”.\n\nMarset está prófugo de la Justicia desde comienzos de 2022, después de haber estado casi tres meses preso en Dubai, donde había sido detenido por portación de un pasaporte falso. Las autoridades emiratíes lo liberaron tras un trámite diplomático del gobierno uruguayo de Luis Lacalle Pou, que le envió un pasaporte legal de este país. La Cancillería y el Ministerio del Interior argumentaron que por entonces desconocían los antecedentes de Marset. Esto desembocó en una crisis de Gobierno, que se saldó con la dimisión de varios ministros.\n\nLavado de activos: la cereza del postre para el crimen organizado\n\nLa vitamina que alimenta el negocio del crimen organizado en Uruguay es el lavado de activos, según el Gobierno uruguayo. El asesor y exdirector de la Secretaría Nacional Antilavados de Uruguay (Senaclaft), Daniel Espinosa, argumenta que, para funcionar, las organizaciones ilegales necesitan “sistemas que disimulen el origen delictivo de su dinero”. “Se ha considerado que el lavado de activos es un delito de escritorio, un delito hasta tolerable porque genera movimientos de fondos que pueden resultar ‘buenos’ para la economía, pero no se ve que esté financiando a las organizaciones criminales. El poder de las organizaciones, las armas que compran, los vehículos, los sueldos que les pagan a sus soldaditos salen del lavado”, explica.\n\n“Y eso ocurre acá”, dice Espinoza, señalando edificios del centro de Montevideo. “Estas oficinas son donde se diseñan estructuras societarias o se simulan negocios de exportación, que son los que justifican el dinero que paga y que alimentan la violencia”.\n\nEl ministro del Interior de Uruguay, Carlos Negro, quien dijo que para su administración la “verdadera prioridad” es “la reducción de los homicidios”, coincide: “La persecución del lavado de activos está en la base de la lucha contra el narcotráfico, porque esto es por plata. Si no tenemos herramientas para hacer el seguimiento y la ruta del dinero, difícilmente podamos combatir eficazmente a los grupos organizados”.\n\nPor eso, el Gobierno uruguayo pretende aprobar en este periodo la reforma de la Ley Integral contra el Lavado de Activos y, entre otras cosas, limitar los montos de las transacciones en efectivo y fortalecer los organismos de control. Ese proyecto ya fue votado en la Cámara de Senadores y falta que lo confirme la Cámara de Diputados, donde el oficialismo no tiene mayoría.\n\n“Todo por la maldita droga”\n\nEl narcotráfico y los homicidios no son los únicos delitos que pululan en Cerro Norte. El otro es la extorsión, que se ha triplicado en los últimos años, según datos oficiales citados por el diario El Observador. Por este motivo y por la violencia de cada día, cientos de familias en los últimos años se fueron o quieren irse del barrio: algunas venden sus casas por poco dinero, otras se marchan con lo puesto.\n\n“Antes, en ese campito jugaban todos al fútbol”, recuerda un sobrino de Patricia Amaral. “Ahora, vienen del otro lado a tirar tiros y hay que encerrarse”. También se encierran en las fiestas de fin de año. Patricia cuenta que en Navidad ya no pueden ver los fuegos artificiales porque no saben si los ruidos que escuchan “son de cohetes o de tiros”.\n\nLa familia Amaral–Espinosa está convencida: nada de esto habría ocurrido sin la droga que está inundando Uruguay ni sin el dinero del crimen organizado. “Ahí empezó la guerra -afirma Arturo Espinosa-. Todo por la maldita droga”. Y, con la voz quebrada, agrega: “Nos arruinaron la vida”.",
  "authors": [
    "Darío Klein"
  ],
  "url": "https://cnnespanol.cnn.com/2025/11/20/latinoamerica/uruguay-pacifico-ahora-narco-violencia-crimen-orix"
}