{
  "title": "Hands On With Google’s Nano Banana Pro Image Generator",
  "text": "Corporate AI slop feels inescapable in 2025. From website banner ads to outdoor billboards, images generated by businesses using AI tools surround me. Hell, even the bar down the street posts happy hour flyers with that distinctly hazy, amber glow of some AI graphics.\n\nOn Thursday, Google launched Nano Banana Pro, the company’s latest image-generating model. Many of the updates in this release are targeted at corporate adoption, from putting Nano Banana Pro in Google Slides for business presentations to integrating the new model with Google Ads for advertisers globally.\n\nThis “Pro” release is an iteration on its Nano Banana model that dropped earlier this year. Nano Banana became a viral sensation after users started posting personalized action figures and other meme-able creations on social media.\n\nNano Banana Pro builds out the AI tool with a bevy of new abilities, like generating images in 4K resolution. It’s free to try out inside Google’s Gemini app, with paid Google One subscribers getting access to additional generations.\n\nOne specific improvement is going to be catnip for corporations in this release: text rendering. From my initial tests generating outputs with text, Nano Banana Pro improves on the wonky lettering and strange misspellings common in many image models, including Google’s past releases.\n\nGoogle wants the images generated by this new model—text and all—to be more polished and production-ready for business use cases. “Even if you have one letter off it's very obvious,” says Nicole Brichtova, a product lead for image and video at Google DeepMind. “It's kind of like having hands with six fingers; it's the first thing you see.” She says part of the reason Nano Banana Pro is able to generate text more cleanly is the switch to a more powerful underlying model, Gemini 3 Pro.",
  "authors": [
    "Reece Rogers"
  ],
  "url": "https://www.wired.com/story/google-nano-banana-pro-hands-on/"
}