{
  "title": "Law Professor Answers Supreme Court Questions",
  "text": "Transcript\n\nI'm Stephen Vladeck,\n\nauthor and professor at Georgetown University Law Center.\n\nI'm here today to answer your questions from the internet.\n\nThis is Supreme Court Support.\n\n[lively music]\n\n@Cryptoking asks,\n\nWhy do Supreme Court justices receive life appointments\n\nwhile every other type of judge has retirement ages?\n\nSo this is actually a real disconnect\n\nbetween the federal courts and state courts.\n\nMost states have imposed retirement ages\n\non their judges and justices.\n\nThe federal courts have not.\n\nAnd so under Article III of the Federal Constitution,\n\nthe Supreme Court,\n\nthe intermediate federal courts of appeals,\n\nthe 94 federal district courts, all of them served\n\nduring what the Constitution calls good behavior.\n\nAnd the idea here was to provide a modicum\n\nof protection against being forced off the bench\n\nfor anything other than the kind of misconduct\n\nthat might warrant impeachment\n\nby the House of Representatives and removal by the Senate.\n\n@kpolaprateek asks,\n\nSo how do Supreme Court justices get appointed?\n\nThe appointments process is actually pretty straightforward.\n\nThe president gets to nominate anyone,\n\ndoesn't matter how old they are, where they're from,\n\nwhat their qualifications are,\n\nto be a Supreme Court justice,\n\nand as long as they're confirmed\n\nby a majority of the Senate, they got the job.\n\nVAWNavyVet asks, Are confirmation hearings effective\n\nin preventing unqualified appointments\n\nor have they become mere formalities?\n\nYou know, this really does vary\n\nand has varied historically based upon who the President is\n\nand based upon which party controls the Senate.\n\nThere have been moments in American history\n\nwhere the Senate really has exercised\n\na rigorous oversight role.\n\nIn vetting the Supreme Court's nominees,\n\nthere have been some who have been blocked by the Senate,\n\nsome who were withdrawn\n\n'cause they didn't have the votes in the Senate.\n\nBut I think what we've seen lately\n\nis when the presidents of the same party\n\nas a majority of the Senate, there really is a push\n\nto get through the President's nominees.\n\nAnd so I think we've seen less of that criticism\n\nfrom the Senate in recent nomination processes.\n\nProfessional_Cat_437, Could somebody explain\n\nwhat the 2016 drama of Obama being unable\n\nto appoint a new Supreme Court justice was?\n\nSo in February of 2016, Justice Antonin Scalia,\n\nwho was in many respects the leader\n\nof the court's then extinct four conservative justice wing\n\nunexpectedly passed away while he was on the court,\n\nopening up a seat for President Obama to presumably fill.\n\nPresident Obama quickly nominated an incredibly moderate\n\nand relatively older candidates,\n\nthen DC Circuit Judge Merrick Garland, but the Republicans\n\nwho at the time had a majority in the Senate banded together\n\nand committed to provide no process,\n\nnot even to have a vote up or down\n\non Merrick Garland as a nominee,\n\nbut rather to keep that seat open\n\nthrough the November, 2016 presidential election\n\nuntil President Trump was sworn in in January,\n\nat which point he nominated Neil Gorsuch\n\nand the Senate confirmed Gorsuch to fill that seat.\n\nSo the Constitution does not require the Senate to vote.\n\nReally historically, the expectation has been\n\nthat if the Senate were going to shirk its duty\n\nin such a shameless and transparent way,\n\nit would face political consequences for doing so.\n\nIf anything, in 2016, the opposite happened\n\nwhere the Senate holding that seat open\n\nprovided a number of folks\n\nwho might not otherwise have wanted to\n\nwith reasons to vote for President Trump.\n\nIt's also worth keeping in mind\n\nthat when the Constitution was written,\n\nwe didn't have political parties.\n\nHad the founders known that we were gonna have\n\nreally a deeply entrenched two party system,\n\nit's not hard to imagine\n\nthey would've done some things very differently.\n\n@DannyjeGga asks, The Supreme Court is not apolitical.\n\nHas it ever been?\n\nWe should distinguish here between a court that is political\n\nand the court that is partisan.\n\nThe Supreme Court has always been political\n\nin the sense that it's always been involved\n\nin institutional conversations\n\nwith the other branches of government.\n\nSome of the court's most important early decisions\n\ncome as part of a pretty sophisticated\n\ninner branch conversation\n\nwith President Jefferson with Congress.\n\nIt's only since 2010 that we have a Supreme Court\n\nwhere every justices' ideology\n\naligns with the party of the President who appointed them.\n\nThat's part of why today the court\n\nseems so much more divided along partisan lines\n\nthan was true as recently as 20 years ago.\n\nFrom Reddit, How does the process\n\nof a court case going to the Supreme Court work?\n\nJust about every case the Supreme Court hears\n\nhas gone through multiple levels\n\nof litigation in lower courts.\n\nThose lower courts could be lower federal courts\n\nor they could be state courts.\n\nAnd under both the Constitution\n\nand the relevant statutes Congress has passed,\n\nonce the case has gone through those lower courts,\n\nthe Supreme Court has the power to hear an appeal\n\nif whoever lost in the lower courts\n\nwants the court to do so.\n\nAnd if it's coming from a lower state court,\n\nas long as there's a federal issue in the case,\n\nas long as the case turns on federal law,\n\nthe Supreme Court has the power to hear it.\n\nThis is actually a place where the Supreme Court's power\n\nand its docket has actually shifted a lot over time.\n\nSo from 1789 when the Supreme Court was created until 1891,\n\nthe Supreme Court actually had to hear every single appeal\n\nthat Congress told it to.\n\nIt's only since 1891\n\nthat Congress has broadly given the justices\n\nthe power to pick and choose\n\nalmost all of the cases they hear.\n\nThat process is given this Latin term certiorari,\n\nwhich we abbreviate to cert 'cause we can't really spell it,\n\nand the basic gist is the Supreme Court votes\n\nand it takes four of the nine justices\n\nto agree to hear a case for the court to take it up.\n\nWhat that means, perhaps, surprisingly,\n\nis that actually almost all of the cases\n\nthe Supreme Court decides these days\n\nare cases that the justices have specifically chosen to hear\n\nand not just cases that were foisted upon them.\n\n@CS_Westbrook asks, Do you know approximately\n\nhow many cases the Supreme Court takes every year?\n\nThe Supreme Court receives\n\nsomewhere between 4,500 and 6,000 requests every year\n\nto hear appeals, whether from the lower federal courts\n\nor from the state courts.\n\nIt only takes about 65 or 70 of them.\n\nWhat that means is that in 98 to 99% of those cases,\n\nit's actually those lower courts that get the last word\n\nand the justices leave those lower court decisions intact.\n\nSo the process the Supreme Court follows\n\nfor picking and choosing cases is very secretive,\n\nbut basically the parties file briefs\n\nwhere the party that wants the Supreme Court\n\nto hear the case says, Here's why you should take it.\n\nThe party that one below says,\n\nNo, here's why you shouldn't take it.\n\nAnd the justices and their clerks debate internally\n\nwhat to do and they ultimately vote,\n\nshould we hear this case or not?\n\n@KenHicken asks, Yes or no.\n\nCan the Supreme Court be expanded?\n\nYes, the Constitution does not provide any limit\n\non the size of the Supreme Court.\n\nIt gives that power to Congress.\n\nCongress used that power a number of times between 1789\n\nand 1869 to change the size of the Supreme Court.\n\nIt's really a question about politics,\n\nwhether it's a good idea and whether there are the votes.\n\nAnd at least since 1869, the answer to one,\n\nif not both of those questions, has consistently been no.\n\nAn anonymous Reddit user asks,\n\nWhat's the purpose of dissenting opinions?\n\nSometimes a justice will write a dissenting opinion\n\nto make clear to their colleagues\n\njust how wrong they think the majority is.\n\nIndeed, we have examples of a proposed dissenting opinion,\n\nactually persuaded enough justices that it's correct\n\nthat it became the majority opinion.\n\nSometimes the goal of a dissenting opinion\n\nis to lay down a marker so that even if the Supreme Court's\n\nnot gonna reach the right answer, maybe other actors can.\n\nA famous example of this is when Justice Ruth Bader Ginsburg\n\nwrote a dissent in a case called Ledbetter about pay equity\n\nthat called on Congress to fix the relevant federal statutes\n\nwith regard to pay equity in the workplace.\n\nCongress did and it actually passed a statute\n\ncalled the Lilly Ledbetter Fair Pay Act\n\nin response to justice Ginsburg's dissenting opinion.\n\nAnd sometimes dissents really are meant more for the public\n\nwhere the dissenting justice understands\n\nthat they don't have enough votes\n\nfor their position on the court,\n\nbut they're writing for posterity.\n\nThey think that one day the law will catch up with them.\n\nAnd some of the great examples of this\n\nare from Justice John Marshall Harlan,\n\nwho dissented in cases like Plessy versus Ferguson,\n\nwhich established the principle of separate but equal\n\nin a way that actually we now rely upon\n\nthat has largely become the law of the land.\n\n@real_miss_kim asks,\n\nWhich Supreme Court Justice retires next?\n\nAnd who replaces him or her?\n\nSo if history has taught us anything,\n\nit's that it's not always who you'd expect.\n\nI think for obvious reasons,\n\nmost of the attention right now\n\nis on justices Clarence Thomas and Samuel Alito\n\nsince they are two of the three longest serving\n\nRepublican appointed justices on the court\n\nand the ones who I think would be most willing\n\nto have President Trump pick their successors.\n\nBut Justice Thomas is also just a couple years away\n\nfrom the all time longevity record.\n\nFor Supreme Court justice\n\nis something I suspect he's interested in.\n\nIf you really forced me to bet,\n\nI would say Justice Alito is probably at the top of the list\n\nfor the next justice to retire.\n\nBut, you know, I'm glad\n\nI don't have to put any real money on it.\n\nWeary-Farmer-4894 asks, Did RBG destroy her legacy\n\nby not retiring during Obama's presidency?\n\nYou know, this is a real debate,\n\nnot just about Justice Ruth Bader Ginsburg,\n\nbut about what a Supreme Court justice's\n\ncentral obligations are.\n\nFamously, Justice Ginsburg did not retire\n\nwhen President Obama was in office\n\nand Democrats controlled the Senate.\n\nAnd that meant that when she passed away\n\nafter a long battle with cancer, in September, 2020,\n\nit was President Trump who was able to fill her seat\n\nas he did with Justice Amy Coney Barrett.\n\nI think it's really tricky to think about this question\n\nbecause retiring solely for partisan political purposes,\n\neven if it's something that justices do,\n\nis maybe not in the best long-term interest\n\nof the institution.\n\nIf we view the court through the lens\n\nof just who controls which seats,\n\nthen we really are accepting the premise\n\nthat the court is a partisan institution\n\nand not just a judicial one.\n\nAt the same time,\n\njustices who care about their legacies have to care,\n\nespecially in this day and age,\n\nabout those partisan politics.\n\nOnly a justice knows their body,\n\nonly a justice knows their mind,\n\nbut I think it certainly looks in retrospect\n\nlike it probably would've been better for Justice Ginsburg\n\nif she cared about such things,\n\nto step down when President Obama\n\ncould have chosen her successor instead of President Trump.\n\n@PoBoyReeves asks,\n\nHow ugly was the Kavanaugh confirmation?\n\nIt was pretty ugly.\n\nThere were seemingly quite plausible charges\n\nof sexual misconduct on the part\n\nof a much, much younger Brett Kavanaugh.\n\nYou had a rushed FBI report\n\nand you had I think a fair amount of railroading\n\non both sides to the fight\n\nover who would replace justice Anthony Kennedy.\n\nAnd then we have to remember that part\n\nof what was going on there, was you had the Justice\n\nwho had become the median vote on the court.\n\nIt was his seat that was at issue,\n\nand I think that's part of why\n\nyou saw the emotions get so high.\n\nHow do we fix that?\n\nWell, I think this is a larger\n\nand deeper conversation about our institutions\n\nand about pushing presidents, pushing senators,\n\npushing everybody to a point\n\nwhere we view the courts in general\n\nand the Supreme Court in particular\n\nas a critically important check\n\non the other branches of government,\n\na check where we're gonna want judges and justices\n\nnot just who believe things we agree with,\n\nbut who are going to assert the power of the courts\n\nover the other branches of government.\n\nThat to me is the real unfortunate consequence\n\nof the Kavanaugh confirmation, is that if anything\n\nthat's moved us more into our political corners\n\nand not more toward\n\nthat kind of institutional understanding.\n\n@theylove_sierra, How did Plessy versus Ferguson\n\nchange law and society?\n\nSo Plessy versus Ferguson is the infamous 1896 decision\n\nin which the Supreme Court articulated the separate\n\nbut equal understanding\n\nfor racial discrimination in public places.\n\nYou can draw a straight line from Plessy versus Ferguson\n\nto the era of Jim Crow, to the idea\n\nthat you would have segregated drinking facilities,\n\nsegregated schools, segregated bathrooms\n\nin cities and jurisdictions,\n\nespecially throughout the south.\n\nI think there's a debate\n\nabout just how much Plessy itself caused those changes\n\nor how much Plessy at least meant the courts\n\nhad no way to stop those changes,\n\nwhich in many respects were already well underway.\n\nIndeed, it wouldn't be\n\nuntil Brown versus Board of Education in 1954\n\nand the Civil Rights Movement\n\nthat Brown was an early part of\n\nthat you really see efforts to push back against\n\nto dismantle Jim Crow.\n\nThe Supreme Court's obviously part of that story.\n\nIt's probably a little much to say\n\nthat the court was solely responsible for it.\n\n@SteveO2385 asks, When did the left\n\never have control of SCOTUS?\n\nSeriously, when was the last time\n\nthere was a liberal majority?\n\nSo I think there's actually some debate about this\n\nbecause until 2010, you had a long history\n\nof Supreme Court appointments\n\nthat were not necessarily party and ideology aligned.\n\nFor example, Justice William Brennan, who for a long time\n\nwas the liberal lion of the Warren Court,\n\nwas appointed by a Republican president,\n\nby Dwight Eisenhower.\n\nThe last time that a majority of the Supreme Court\n\nincluded justices appointed by Democratic presidents,\n\nwhich might be one way to think about this question,\n\nwas May 14th, 1969.\n\nThat was the day on which Justice Abe Fortas\n\nresigned from the court.\n\nActually Republican presidents\n\nwould have the next 11 appointments to the Supreme Court,\n\nwhich is a big part\n\nof why there was such this profound shift\n\nin the court's jurisprudence started in 1970.\n\nReddit user asked, At the time of Roe versus Wade,\n\nwas the Supreme Court overwhelmingly liberal?\n\nNot necessarily.\n\nI mean, the Supreme Court in 1973\n\nwhen Roe versus Wade was decided\n\nwas in some respects a court in transition.\n\nAnd so you had a seven to two majority in that case,\n\nbut there were multiple justices in the majority\n\nwho had been appointed by Republican presidents,\n\nand one of the two dissenters, Justice Byron White,\n\nwas actually a democratic appointee.\n\nHe was appointed by President John F. Kennedy.\n\nAt the time Roe versus Wade was decided,\n\nthe question of the constitutionality\n\nof protections for abortion\n\njust didn't quite divide us so strictly\n\ninto ideological camps\n\nas it came to in the years and decades to follow.\n\n@koreflautas asks,\n\nHow did Citizens United affect elections?\n\nSo the Supreme Court's decision in Citizens United\n\nis actually part of a larger series of decisions\n\nin which the Supreme Court\n\nhas interpreted the First Amendment\n\nto prohibit a number of restrictions on campaign finance\n\nand to prohibit a number\n\nof campaign finance reform initiatives enacted by Congress.\n\nThe result has been a much larger amount\n\nof dark money in our elections, local elections,\n\nstate elections, federal elections.\n\nThe real impact here\n\nis not that it's obviously pro-Republican or pro-Democratic.\n\nIt's pro-money.\n\nMoney interests have had much more say\n\nin our elections in the last 15 or 20 years.\n\nCertainly then was true for a long time before that.\n\n@jsc1835 asks, Trump is asking the Supreme Court\n\nto partly allow birthright citizenship restrictions.\n\nWill the Supreme Court allow this\n\nbreach of the Constitution?\n\nThis is getting a bit into the weeds,\n\nbut one of the things that's really tricky\n\nabout the three birthright citizenship cases\n\nthat the Supreme Court is deciding during its current term\n\nis that the court is being asked not to uphold the policy\n\nbut rather just to let it go into effect\n\nas applied to at least some people\n\nthrough a procedural debate.\n\nBasically the argument is the lower courts ruled too broadly\n\nin blocking President Trump's efforts\n\nto limit birthright citizenship.\n\nI suspect that the court is going to narrow\n\nthose lower court rulings in at least some way,\n\nbut also that either the Supreme Court\n\nor the lower courts pretty quickly\n\nare gonna reach the end of this case\n\nand rule conclusively that the president's efforts\n\nto limit birthright citizenship are in fact unlawful,\n\nwhich will mitigate the effect of a procedural ruling\n\nthat makes those lower court decisions less effective.\n\n@julietfes asks, In the country's history,\n\nhas a Supreme Court justice ever resigned?\n\nSo a number have resigned.\n\nPerhaps the most notorious resignation was in 1969\n\nwhen Justice Abe Fortas resigned\n\nbecause of alleged improprieties\n\nwith a financier named Louis Wolfson.\n\nBut there actually have been a number of justices\n\nwho have resigned for other reasons, for health reasons,\n\nfor personal reasons, in some cases\n\nbecause they wanted or were appointed to different jobs.\n\nIt's really only in the last 10 or 15 years\n\nthat we've seen high profile deaths by sitting justices.\n\nWe actually had gone a very long time.\n\nFrom 1954 to 2005,\n\nthere wasn't a single justice who died on the bench.\n\nThe norm had become resigned before.\n\nThe actuarial tables catch up with you.\n\n@thedrivein47 asks,\n\nWhat are the duties of the chief justice?\n\nSo the chief justice is in some respects\n\nthe first among equals.\n\nHe doesn't have special extra powers\n\nthat the other eight justices lack.\n\nWhat makes him special is he is the senior justice.\n\nHe basically presides over all of the court sessions.\n\nHe gets to decide whenever he's in the majority\n\nwho's gonna write the decision for the court.\n\nAnd he is in various respects the ceremonial figurehead\n\nof the judicial branch\n\nas set out in Article III of the Constitution.\n\nBut when the justices are in their conference room\n\nand they're voting on cases,\n\nthe chief justice really is just one of nine.\n\n@christo53294495 ask, Can you tell me in US history\n\nwhich president has appointed a justice\n\nrepresenting the opposite of his beliefs?\n\nPerhaps the most famous of these is President Eisenhower\n\nappointing Justice William Brennan in 1956,\n\nis a Catholic democratic state court judge from New Jersey,\n\nnot because of his ideology, but perhaps despite it.\n\nBut in general, I mean, really until the 1950s and 1960s,\n\nthere are a lot of examples throughout American history\n\nof president's prioritizing geographical diversity,\n\nother types of experience,\n\nof presidents cashing in political chips,\n\nor even in some cases of presidents\n\nusing Supreme Court appointments\n\nto neutralize the folks they were, you know, rivals with.\n\nIt's really only in the last generation\n\nthat we've come to think of Supreme Court appointments\n\nas being purely about maximizing ideology.\n\nA Reddit user asks,\n\nWhy did LBJ nominate Thurgood Marshall?\n\nJustice Marshall, when he was nominated\n\nto the court in 1967, was the first justice\n\nin the court's history who was not white,\n\nand this was a really important step by President Johnson.\n\nPresident thought it was long past time\n\nthat the Supreme Court have a Black justice.\n\nIndeed, he actually manipulates the circumstances\n\njust to create a seat for Justice Marshall.\n\nHe took Ramsey Clark, who was the son\n\nof a sitting Supreme Court Justice Tom Clark,\n\nand he appointed Ramsey Clark as the Attorney General.\n\nThat would have meant Tom Clark would've had to recuse\n\nfrom every case in which the federal government was a party.\n\nLBJ knew he wouldn't do that.\n\nLBJ knew that Tom Clark would resign from the court,\n\nthereby creating the seat for Thurgood Marshall.\n\n@punycitizen asks, How does the shadow docket work?\n\nThe shadow docket is a term that was coined\n\nby a University of Chicago law professor Will Baude in 2015,\n\nand it was meant to describe everything\n\nthat the Supreme Court does other than the 65 or so cases.\n\nIt decides after briefing an argument every year.\n\nSo that includes all of the rulings\n\nwhere the Supreme Court declines to take up an appeal\n\nand it includes this other chunk of decisions\n\nwhere the Supreme Court is asked\n\nto provide something called emergency relief.\n\nEmergency relief is when you have a case in the lower courts\n\nthat has not gotten to the Supreme Court yet,\n\nbut one party, presumably whoever lost below,\n\nwants to change the status quo\n\nwhile the case works its way to the Supreme Court.\n\nAnd that's become an increasingly prominent part\n\nof the Supreme Court's workload.\n\nIt's why the shadow docket has become so much more,\n\nI think, a subject of popular interest,\n\nespecially as we've seen\n\nduring the second Trump administration,\n\nso many cases where the federal government\n\nis asking the Supreme Court\n\nto temporarily pause lower court rulings\n\nblocking various policies\n\nwhile those cases worked their way through the courts.\n\nA Reddit user asked,\n\nWhat was the first Second Amendment Supreme Court case?\n\nReally, the first time the Supreme Court\n\ndiscussed the Second Amendment in detail was in the 1930s\n\nin a case called Miller where the court basically said\n\nthat the Second Amendment\n\ndidn't protect an individual right to self-defense.\n\nIt was mostly a collective right\n\nto resist tyrannical government.\n\nOf course, it was that understanding\n\nthat the Supreme Court overruled.\n\nIn 2008, since the Supreme Court's decision\n\nin its five four decision in Heller,\n\nwhat we've seen is a lot more litigation challenging\n\nand succeeding in striking down limits on gun sales,\n\ngun possession across the country.\n\nyukicola asks, What do the US Supreme Court justices\n\nactually do during a regular workday?\n\nMost of the justices work goes on in their chambers.\n\nIn the Supreme Court's official headquarters in Washington,\n\na building, by the way, the court has only had since 1935,\n\nthe justices each have their own chambers,\n\nthey have their own staffs, they have four law clerks\n\nwho are recent law school graduates,\n\nand of course they have administrative support as well.\n\nAnd most of what they're doing is reviewing cases,\n\neither which cases they're going to choose to hear or not,\n\nor in the subset of cases the justices have chosen to hear,\n\nreading the briefs, preparing for argument,\n\nwriting opinions, reviewing other justices' opinions.\n\nThe justices really only gather in person formally\n\nwhen they're on the hearing arguments\n\nor handing down decisions\n\nor when they are back in what's called their conference,\n\nwhere they decide how they're gonna rule on specific cases.\n\nBlanckToHideFromWife,\n\nCan the US Supreme Court in practice make law?\n\nThis has been really a bit of a metaphysical debate\n\namong scholars for a very long time.\n\nEveryone agrees that judges\n\nand the Supreme Court in particular\n\nhave a responsibility to interpret the law.\n\nThe difference between that\n\nand what we might call making law is often elusive.\n\nAnd actually there are contexts in which we expect judges\n\nto do more than just resolve ambiguity,\n\nperhaps to fill in language that Congress\n\nor the state legislature has left out.\n\nSo yes, I mean I think there are lots of contexts\n\nin which the judges and justices\n\nare and should be allowed to make law.\n\nWe just tend to think of those in the context\n\nof interpreting statutes, constitutional provisions,\n\nand other legal texts.\n\nHagisman asks, Ideally, should the Supreme Court\n\nlean toward originalism or living constitutionalism?\n\nThis is an age old debate about how judges and justices\n\nshould interpret the text of the Constitution\n\nwhen that text is ambiguous.\n\nNo one really disputes that when the Constitution\n\nsays the President has to be 35 years old, it means 35.\n\nBut when the Eighth Amendment says something\n\nlike there can be no such thing as cruel\n\nand unusual punishment, that of course raises questions.\n\nWhat makes a particular punishment cruel and unusual?\n\nThroughout the court's history,\n\none of the ways we've addressed this issue\n\nis by having justices who were diverse,\n\nwho were from different parts of the country,\n\nwho are from different backgrounds,\n\nwho had different methodological commitments.\n\nAnd it's really only in the last generation\n\nthat there has been this concerted push toward the idea\n\nthat there really can only be one accepted way\n\nto interpret the Constitution.\n\nI'll just say that I think the better answer\n\nis different people are gonna have different commitments\n\nbased upon their own views, their own experiences,\n\ntheir own background,\n\nand part of why we have nine Supreme Court justices\n\nand not just one, part of why we have humans\n\ninterpreting these texts and not machines,\n\nis because those differences,\n\nthat diversity is actually a really important part\n\nof the project of legal interpretation.\n\n@DJvsEverybody asks, How do state's rights\n\nfit into having the Supreme Court\n\nhave the ability to overrule state courts?\n\nThe Constitution divides sovereignty\n\nbetween the federal government and the states.\n\nOne of the ways it does so\n\nis it leaves questions of state law\n\nup to state Supreme Court.\n\nSo if the Missouri Supreme Court\n\ninterprets Missouri law in a particular way,\n\nthe Supreme Court has no power to disagree with them.\n\nThe difference is when it's about federal law.\n\nAnd so if a state court interprets a federal statute\n\nor the federal constitution\n\nor if a state court interprets state law\n\nin a way that is inconsistent with federal law\n\nor the federal constitution,\n\nthat's where the US Supreme Court is able to come in\n\nand is able to reverse that decision.\n\namwreck asks, How does the Supreme Court\n\ngo about overturning a previous ruling?\n\nIt's actually not that complicated procedurally.\n\nIt's just fraught in the sense\n\nthat it tends to be controversial\n\nwhen the Supreme Court overturns a prior decision.\n\nThere's nothing that actually prevents any justices\n\nin any case from saying,\n\nHey, we actually think this prior decision is wrong\n\nand should be overruled.\n\nYou need a majority, of course,\n\nand presumably you need some compelling reason\n\nwhy that older decision should be overruled.\n\nThe principle of stare decisis is the idea\n\nthat all things being equal,\n\ncourt should follow the decisions of their predecessors.\n\nIf and when there are especially persuasive reasons\n\nto overrule a prior precedent,\n\nthat's when the court is I think more free to do so.\n\nkwertix asks, Why does the US Supreme Court\n\nrely on presidential cases?\n\nThis isn't just the US Supreme Court.\n\nThis is actually a feature\n\nof any so-called common law legal system.\n\nAnd the idea is that precedent is itself part of our law,\n\nthat what separates judges\n\nand justices from ordinary politicians\n\nis that they're not just voting their preferences\n\nin every individual case,\n\nthat there is actually this abstract idea of what the law is\n\nthat binds not just current judges but future judges\n\nuntil and unless there's some compelling reason\n\nto overrule it.\n\nThat's not just a sort of principle of laziness.\n\nIt's actually a really important foundation\n\nof what separates judicial power\n\nfrom ordinary political power.\n\n@Andrevin20, Do I think the Supreme Court\n\nwas always nine seats?\n\nHow did it get to nine?\n\nIn fact, I know it wasn't.\n\nThe Constitution itself says nothing\n\nabout how big the Supreme Court ought to be.\n\nCongress, when it created the court in 1789,\n\nstarted with a very strange number with six.\n\nThat was really based\n\non how many lower appeals courts there were.\n\nBetween 1789 and 1869,\n\nthe size of the court fluctuates seven times\n\nbetween as many as 10 justices\n\nfor a brief period in the 1860s\n\nand at one point as few as five justices.\n\nIt's only in April of 1869\n\nthat Congress for the first time hardwires the number nine\n\ninto the identity of the Supreme Court\n\nand we've been set at nine ever since.\n\nThere have been proposals at various points\n\nin the recent past,\n\nespecially during the Biden administration,\n\nto pack the court by adding perhaps four seats.\n\nPractically, you're never gonna be able to do it\n\nunless the same party simultaneously controls\n\nnot just the White House, but both chambers of Congress\n\nand has a filibuster proof majority in the Senate.\n\nAnd in the long-term,\n\nI mean, if you're expanding the court solely\n\nto maximize short-term partisan political advantage,\n\nI think that probably re-downs to the detriment\n\nof the integrity of the court, of public faith in the court,\n\neven if part of why folks are proposing that as a reform\n\nis because they think that damage has already happened.\n\nI'm not sure this is an example\n\nof two wrongs making the right.\n\n@myopinion6810 asks,\n\nHow do Supreme Court justices get impeached?\n\nHas that ever happened?\n\nSo it's the exact same process in the Constitution\n\nfor impeaching a Supreme Court justice\n\nas it is for the President.\n\nIt takes a majority\n\nof the House of Representatives to impeach,\n\ntwo-thirds of the Senate to vote to convict\n\nand thereby remove.\n\nIt's happened exactly once with the Supreme Court Justice.\n\nIn 1804, the sort of Jeffersonian controlled Congress\n\nimpeached and tried to remove Justice Samuel Chase,\n\nwho has perhaps the greatest nickname\n\nin Supreme Court history.\n\nHe was known as Old Bacon Face.\n\nAnd Justice Chase was impeached because the Jeffersonians\n\nthought that he was basically a partisan hack.\n\nBut the Senate refused to remove Justice Chase.\n\nIt wasn't that they decided that he was not a partisan.\n\nIt was that they decided that wasn't enough,\n\nand that to remove a Supreme Court justice,\n\nyou need actual misconduct.\n\nAnd that's really stood as a pretty important precedent\n\nfor judicial independence ever since.\n\nOdd-Flower2744, What actually happens\n\nif Supreme Court decisions are just ignored?\n\nWhat mechanisms actually enforce a Supreme Court decision?\n\nIt depends on who's doing the ignoring.\n\nOf course, if it's private parties, there are lots of ways\n\nto compel their obedience to Supreme Court decisions,\n\nwhether it's monetary sanctions or otherwise.\n\nIt is, of course, trickier\n\nif the relevant party is the federal government.\n\nHistorically, the way the Supreme Court has been allowed to,\n\nbeen able to effectuate its mandates\n\nis because the political consequences\n\nof a president defy on the Supreme Court\n\nhave just been too high.\n\nPresident Nixon turned over the Watergate tapes,\n\nincluding the tape that led directly to his resignation\n\nbecause he concluded with the support of his advisors\n\nthat he couldn't defy the Supreme Court.\n\nPresident Eisenhower sent the army into Little Rock in 1957\n\nto desegregate Central High School\n\nbecause he was persuaded\n\nthat he couldn't not enforce the Supreme Court decision\n\nin Brown versus Board of Education.\n\nThat's why the Supreme Court's legitimacy\n\nwhy public faith in the court is so important\n\nbecause if we get to a point where a president\n\ncould stick his thumb in the Supreme Court's eye\n\nand have no similar political backlash,\n\nthat would be the point where the Supreme Court's power\n\nas an institution would be critically\n\nand perhaps irrevocably damaged.\n\n@ajebolawyer asks, Do I know the difference\n\nbetween the Supreme Court of a state of the United States\n\nand the Supreme Court of the United States?\n\nIn fact, I do. So every state has a Supreme Court.\n\nActually, Texas and Oklahoma have two,\n\none each for criminal cases and for civil cases,\n\nbut those courts are principally tasked\n\nwith interpreting state law.\n\nSometimes you can have federal issues\n\ncome up in those cases.\n\nA state criminal prosecution, for example,\n\ncan raise Fourth Amendment issues.\n\nBut typically the state Supreme Courts get the last word\n\non the meaning of their state's laws\n\nand the US Supreme Court gets the last word\n\non the meaning of federal law.\n\nA Reddit user asks, What government entity has oversight\n\nover the US Supreme Court\n\nthat's now showing almost open corruption\n\nfrom payments for housing vacations\n\nand payment of schooling for children?\n\nSo this has always been a little tricky.\n\nI mean, the Supreme Court is an independent branch.\n\nIt is not supposed to be subject to oversight\n\nin quite the same ways that maybe lower courts might be\n\nor the executive branch agencies.\n\nHistorically the way this has worked\n\nis there has been a healthy, but sometimes heated,\n\nback and forth between the political branches\n\nand the Supreme Court.\n\nCongress controls the Supreme Court's budget,\n\nCongress controls the Supreme Court's docket,\n\nand those have been levers\n\nthat historically Congress has pulled\n\nas a way of pushing on the justices to behave better.\n\nOne of the things that has really happened\n\nin the last 25 or 30 years that has gotten us\n\nto where we are today with the Supreme Court\n\nis Congress has mostly stopped pulling those levers.\n\nAnd so when we talk about problems\n\nwith the current Supreme Court,\n\nwhen we talk about opportunities\n\nfor reform of the current Supreme Court,\n\nI like to start with the accountability question.\n\nHow can Congress impose more accountability on the justices\n\nwithout interfering with judicial independence?\n\nMaybe part of that starts\n\nwith an inspector general within the judicial branch,\n\nsomeone who could supervise\n\nwhether the justices are complying with the relevant ethics\n\nand financial disclosure rules.\n\nMaybe it starts with getting back into the norm\n\nof having the justices testify before Congress,\n\nsomething that used to happen with somewhat more regularity.\n\nWhatever you think the specific answer is though,\n\nI think a big part of how we've gotten to where we are today\n\nwith the Supreme Court is we have a court that is not\n\nand does not think it ought to be accountable\n\nto the other branches the way that was true\n\nfor most of American history.\n\nWell, I think that's it.\n\nI've tried to answer all your questions.\n\nHope you've liked the answers.\n\nThanks for joining us. Until next time.\n\n[lively music]",
  "authors": [
    "Condé Nast"
  ],
  "url": "https://www.wired.com/video/watch/tech-support-law-professor-answers-supreme-court-questions"
}