{
  "title": "Noémie Goudal The Story of Fixity review – welcome to the jungle and please mind the puddles",
  "text": "Is it me, or is it hot in here? A jungle floats in the darkness on three big screens. Each depicts a riot of giant ferns, vine-tangled tree-trunks and sun-struck foliage in layered, dank profusion. With their jumbles of weathered rock, mossy wetness and tropical vegetation, you can lose yourself in these scenes. But, as I look, mist wafts over a patch of dense greenery as if someone out-of-shot were making with the plant spray.\n\nI’m reminded of those unconvincing jungles in movies and on TV, where the plants have been trucked-in from some garden centre warehouse and arranged on set. Only the camera angles and clever editing stop us from recognising the artifice of it all. In the foreground on one of the screens, you can see rivulets crossing what appears to be a floor of waterproof matting. A small puddle is also forming at my feet. Either the film is leaking, though that seems unlikely, or water is dripping from the ceiling. Through the day, I’m told, the water slowly inundates the sheets of metal that cover portions of the floor, but I arrived too early for the flood.\n\nView image in fullscreen As you watch, the jungle deconstructs … The Story of Fixity. Photograph: Noémie Goudal/Artangel\n\nNoémie Goudal’s The Story of Fixity is a complex rumination on ecosystems and water’s fundamental role. Her work involves biology and geology, scientific research and what she calls “fixed points” regarding distances and depths and human perception. I don’t understand the half of it and I’m not sure it matters. In a soundscape devised by French electronic artist and DJ Chloé Thévenin, the air is alive with insect noise and chirrupings, animal cries and calls, devolving into electronic sizzle, percussive beats and hollow echoes.\n\nNaturalism is not a preoccupation in Goudal’s art. She gives us an illusion and then she takes it away again, transforms it and turns it into something else. On screen, the jungle is fading into something that feels like a green-tinted duo-tone illustration in an old encyclopedia, or a collage of engravings thrown together in some multilayered rendition of incomprehensible fertility and chaos. This too falters, as if the ink in the images were running, or turning into watercolour that slowly runs and curdles as it dissolves.\n\nEach screen becomes a pigmented abstraction. A projected film of grey and ochre pigments, iron-rich reds and tangy yellows slowly slide down the screens. As you watch, the jungle deconstructs. The screens themselves aren’t flat, but are made from a number of relief planes whose cut edges correspond, more or less, to the shapes of the foliage and rocks projected on to them. As the natural colour slowly bleaches out of the images, the cut edges of these layered screens become more apparent.\n\nView image in fullscreen Constant flux of creation and destruction … The Story of Fixity. Photograph: Noémie Goudal/Artangel\n\nInevitably, I think of painting, of the innumerable artists who have turned landscape into abstractions of one sort or another. Goudal’s studio-bound jungles are all artifice, and she’s only a painter in an accidental sense. Less a jungly free-for-all mode of free abstraction than a thoroughgoing dissolution of an image, there’s pleasure in seeing Goudal’s illusory world washed away. But her use of filmed dyes and pigments, and real liquid, watery paint, dripping and puddling over the floor is a bit too theatrical for its own good.\n\nGoudal’s mix of photography and film, the real and the illusory, reveals its technical complexities even as it dissolves and deconstructs itself, over and over again in 15-minute cycles. This constant flux of creation and destruction leaves me none the wiser about the processes that support life on Earth, or about how we perceive the natural world. Instead it is a sophisticated theatre, awash in its own complications. I don’t mind the immersive, but I’m not going for a swim.",
  "authors": [
    "Adrian Searle"
  ],
  "url": "https://www.theguardian.com/artanddesign/2025/nov/18/noemie-goudal-the-story-of-fixity-review-borough-yard-london"
}