{
  "title": "Is it true that … you burn more fat by working out on an empty stomach?",
  "text": "‘There’s an element of truth to that,” says Javier Gonzalez, a professor of nutrition and metabolism at the University of Bath. “When we exercise, we’re always burning a mix of fuels – mainly carbohydrates and fat. If you’ve fasted overnight, you’ll generally burn a bit more fat and less carbohydrate than if you’d eaten breakfast, especially one high in carbs.” But that doesn’t mean fasted workouts are better for weight loss.\n\n“We can only store a small amount of carbohydrate as glycogen in our muscles and liver. Any extra energy – from carbs, fat or protein – eventually gets stored as body fat. So to lose fat, you need to be in an energy deficit: burning more energy than you consume. If you’re not, it doesn’t matter whether you’re fasted or fed – your body balances things out over time,” says Gonzalez.\n\nFasted training seems to encourage muscles to move glucose out of the bloodstream, so it can improve blood sugar control\n\nThat doesn’t make fasted workouts pointless, though. Research, including Gonzalez’s own, suggests training in a fasted state can slightly improve metabolic health, particularly how well muscles adapt to exercise and how the body handles blood sugar spikes, which can lead to energy crashes. “Fasted training seems to encourage muscles to move glucose out of the bloodstream,” he says. “So it can improve blood sugar control, especially after meals.”\n\nThe effects are most noticeable with endurance exercise such as jogging or cycling. During higher intensity exercise, such as sprint intervals, the body relies heavily on carbohydrate either way. Overall, the benefits of fasted training are modest.\n\n“The most important thing is to do the exercise. Whether you do it fasted or fed is just the icing on the cake,” says Gonzalez. If you want to try it, start small – 15 or 20 minutes – and build up gradually. “If you feel light-headed or dizzy, that’s your cue to stop and eat something.”",
  "authors": [
    "Kate Lloyd"
  ],
  "url": "https://www.theguardian.com/lifeandstyle/2025/nov/17/is-it-true-that-you-burn-more-fat-by-working-out-on-an-empty-stomach"
}