{
  "title": "Cancer Detectives: Finding the Cures review – this vaccine documentary is so inspirational it’ll make you weep",
  "text": "Cancer Detectives: Finding the Cures should come with a rare warning: may make you feel hopeful for humanity and marginally less convinced that we are all willingly leaping into a handcart and smoothing our own paths to hell.\n\nThis is an hour that outlines the work being done to create vaccines against cancers. Lung cancer, specifically, at the moment – 50,000 cases of which are diagnosed each year in the UK and which is the most common cause of cancer-related death – but with the potential to prevent many more types in the future.\n\nThat such a fantastic possibility is moving out of the realms of the fantastical is because of the progress that has been made understanding the body’s immune system and the work it does zapping (medical term) so many cells, probably on a daily basis, when they first start sending out signals that all is not well within their own bodies, and preventing them from multiplying. Until and unless, of course, the day comes when the signals are muted or missed and cancer results. Survival rates for the disease have doubled in the last 50 years, but diagnoses themselves are on the rise, so the race to defeat it continues without cease.\n\nThe new understanding of how our bodies catch and clear so many potential disasters, however, means that there is now a known interval, a pre-cancerous stage which it is thought could last up to 10 years, in which we could intervene if we knew how.\n\nEnter, to all possible fanfare – though everything about her suggests she would eschew it – Prof Sarah Blagden. Who does know how, and is going to start intervening if she can just get the funding for the next clinical trial she needs to run.\n\nWe meet some of the people under her care, including 68-year-old Trevor from Portsmouth who has melanoma with secondaries in his liver. His wife told him for a year to get his mole checked out. “I should have,” he says. “But this is life.” “Typical Navy man,” says his daughter, Katherine, not wryly. He is now part of the professor’s current trial. His immune system is being trained to attack the cancer cells that were once invisible to it. The growths on his liver are now static. In their consultations we are presented with the rare sight of the doctor looking happier than the patient. You can almost see the sense of triumph – so quiet, but so there – beginning to build in her. It’s amazing.\n\nProf Blagden’s ultimate goal is to develop a single vaccine that will prevent multiple types of cancer. That is what will help patients like Ella, who has Li-Fraumeni syndrome (LFS), which causes a mutation on a tumour-suppressing gene and means carriers have a highly increased risk of developing cancer, especially as children and young adults. Ella had a tennis ball-sized tumour removed from her adrenal gland when she was nine months old and had breast cancer resulting in a double mastectomy three years ago. She is still in her 20s. She is in one of Prof Blagden’s trial groups too, which is working on the potential seen in metformin (a drug usually connected with diabetes treatment) to turn down the particular cellular overactivity in LFS patients, and which could allow a repurposing that would further speed the creation of a multi-faceted vaccine.\n\nYou could weep for the suffering, and also for the minds concentrating not just on alleviating but on banishing it. For Prof Blagden and her team’s extraordinary, intelligent vision (“I have a big idea … ” she says at the start of the film) and dedication, for all the research and researchers preceding her, for the uniting of people and the technologies they have built to defeat this single foe that kills so many of us and our loved ones.\n\nYou could also weep, alas, for Prof Blagden’s attempts to secure funding. All the results she has so far are promising and her patients, she knows, so close to being helped in truly unprecedented ways. “I cannot imagine abandoning them at this point.” But her most recent application was refused. “I was just beside myself.” She is being interviewed by the film-makers at her desk when the email comes through. She breaks off to read the news. The funders have deemed her worthy. “This is … a really important pivot point in what we’re doing,” she says, which is Blagden-speak for “Come in, cancer, your time is fucking UP!”\n\nThe film ends with her holding the first dose of vaccine in her hands, with the news that Ella is still cancer-free and on the new trial, and with Trevor hearing that he has no signs of any active cancer deposits any more. “In my wildest dreams, I didn’t expect that,” says Trevor. The professor just grins. She did, you see. She did.",
  "authors": [
    "Lucy Mangan"
  ],
  "url": "https://www.theguardian.com/tv-and-radio/2025/nov/20/cancer-detectives-finding-the-cures-review-this-vaccine-documentary-is-so-inspirational-itll-make-you-weep"
}