{
  "title": "Curacao qualify for World Cup – How tournament’s smallest nation built history-making side: “What an adventure”",
  "text": "Curacao is a Caribbean island that’s home to around only 185,000 people, and it felt like half of them spilt onto the pitch in celebration at reaching their first-ever World Cup on a dramatic night in Jamaica.\n\nThey are now the smallest nation ever to qualify for a World Cup, breaking a record previously set by Iceland in 2018.\n\nAdvertisement\n\nTwo planes carrying Curacao’s most passionate supporters, or as captain Leandro Bacuna termed it, their “ultras”, were chartered to make sure the players would have some backing for their decisive qualifying match on Tuesday night at Jamaica’s National Stadium in Kingston.\n\nThe overwhelming majority of the 35,000 fans in the ground were still fervently behind the home side, with a sea of yellow wrapped around the pitch. Those in Curacao’s patch of blue waved their flags and chanted, a small enclave of rebellion.\n\nSmallest teams to play at World Cup Team World Cup Population Curacao 2026 185,000 Iceland 2018 350,000 Cape Verde 2026 525,000 Paraguay 1930 850,000 Trinidad and Tobago 2006 1.3 million\n\nDick Advocaat, Curacao’s manager, flew home to the Netherlands on Saturday to support his wife, who has fallen ill. But he watched last night’s game and was in contact with his coaches, most prominently No 2 Dean Gorre, and afterwards he sent the camp a text message: “Congrats. Incredible, fantastic, so good! What an adventure.”\n\nComing from a man who, at 78 years old, has already had plenty of adventures in his football career, that is saying something.\n\nAdvocaat will be going to his third World Cup, having led his homeland the last time FIFA’s showpiece was hosted in the United States, in 1994. He also managed South Korea at the 2006 edition and Russia in the 2012 European Championship. A trip to a major tournament in each of the past four decades. See, he really has had some adventures.\n\nDick Advocaat previously managed PSV, Rangers and Sunderland (Catherine Ivill/Getty Images)\n\nHe chased this, too, putting a call into Gilbert Martina, president of the Curacao Football Federation. Two other veteran Dutch managers of significant repute had been in the reckoning, one of them a former boss of Manchester United.\n\n“The first contact I had with Dick was August 2023,” Martina tells The Athletic. “I told him the vision. He said, ‘Gilbert, if we can acquire those players, for sure we have a squad that can go on to the World Cup’. Then I asked, ‘Can I use your name to acquire sponsors?’. Because a big name attracts sponsors, you know, it gives hope.\n\nAdvertisement\n\n“That’s why I needed a big name, and I had three on my list. The first was Bert van Marwijk, the trainer of Holland for the finals of World Cup 2010 (where they got to the final, losing 1-0 to Spain after extra time). He had trained a lot of these guys in the Dutch under-15s or under-17s, but he said, ‘Gilbert, I have retired, so I want to stick to that, so it’s a no’.\n\n“I then went to (former Barcelona and Manchester United manager) Louis van Gaal. He said, ‘If I go to coach again, it is going to be with the country that can become world champions’. I have to respect that, we’re not there yet. He wanted to win the thing.”\n\nVan Gaal, there, absolutely living up to his reputation. At 74, he is younger than Advocaat, so too Van Marwijk, who is 73.\n\n“And then what happened? I received a call from Dick. ‘I heard that Curacao is looking for a head coach. I’m available’. I’m getting goosebumps (thinking about that conversation).”\n\nMartina is adamant that Advocaat’s fire still burns: “You should see him on the pitch, how much energy, how much passion, how much discipline.”\n\nThe Dutch connection dates back to the era when Curacao was under their colonial rule from the 17th century, and though it is now its own country, it is still a constituent island within the Kingdom of the Netherlands. Martina tapped into that when recruiting for this current squad.\n\nThe Curacao side that faced Jamaica on Tuesday evening (Ricardo Makyn/Getty Images)\n\nOnly one, Tahith Chong, the former Manchester United academy player, was born on Curacao. The rest are from the Netherlands, with Curacaoan heritage.\n\nThe most recognisable is Leandro Bacuna, the 34-year-old former Aston Villa midfielder now playing at Bandirmaspor in Turkey’s second tier. He started representing Curacao in 2019 and, against Jamaica last night, became their most-capped player, with 68 appearances. His brother, Juninho, who once played for Huddersfield Town and Birmingham City, is at Gaziantep in Turkey’s top flight. Kenji Gorre, the son of Dean, came through Manchester United’s academy and is now at Maccabi Haifa in Israel.\n\nAdvertisement\n\n“It was a long way,” says Martina. “This journey started back in 2004 with the former president of the federation, Mr Jean Francisco, who said, ‘We can qualify because we have the players’. That’s when the idea started to acquire the players playing abroad, because before that, it was with the local players who were not professional. From that moment, we have seen an enormous growth in the team.”\n\nLeandro Bacuna adds, “We started off with something like a dream to qualify for the World Cup. And we could pick players from the Netherlands because we are a Dutch Caribbean island, we could have both nationalities.\n\n“We started off picking up players that weren’t good enough to play for the Dutch squad, but could play for Curacao. That’s how we started, and now everyone is seeing it like a big thing. So we are really proud.”\n\nIf that all sounds rather clinical, he does provide some context. “We still have a lot of family there (in Curacao),” Leandro Bacuna said, speaking ahead of the Jamaica game. “And so they’re on top of us, like really on top of us, grandparents, aunties, uncles. So it’s really lively at the moment.”\n\nCuracao’s Bacuna brothers, Leandro and Juninho (Laurie Whitwell/The Athletic)\n\nCuracao have made it through the second and third phases of the Concacaf region’s qualifying competition by first winning all four matches in a group containing Haiti (who have also ended up reaching the World Cup), Saint Lucia, Aruba and Barbados, then drawing twice with Trinidad & Tobago, beating Bermuda twice, including a 7-0 away win, and defeating Jamaica at home, before drawing away on Tuesday in their final fixture.\n\nSome of their moves have flowed nicely.\n\nJuninho Bacuna says that is a consequence of so many of these players having come through the Dutch system.\n\n“There is only a short time (together at any international camp), but a lot of players have been here together for a long time,” the 28-year-old says. “We have one big family, and if you’re one big family outside the pitch, you will connect on the pitch. And if you train with each other a few times, you will understand what the other wants and how the other plays football; that’s one thing we do really well.\n\n“Everyone knows Dick, he is a good coach. The change with him is that he has a big presence with himself, just in front of a group. But it changed a lot, I would say, outside the pitch. Preparations, more professionalism. And on the pitch, it’s more like, ‘We need to get a result, we need to win games, and if we don’t win, make sure you don’t lose’.”\n\nAdvertisement\n\nThat was the key motivation behind appointing Advocaat for Martina, who has been in his role since April but worked for many years at the national federation beforehand. “I said, ‘We need a coach that can prepare a team to play based on results’. Because in a normal (club) season, Premier League or the Dutch Eredivisie, you can start off slow and then, mid-season, the second part of the season, you can perform, and at the end become champion.\n\n“But in the qualification, it doesn’t work like that. Every game is a final. So you need a coach who can prepare a team to play based on results. And the first result you want is to win, and if you can’t win, at least do not lose. Dick Advocaat is a master in doing that. Although he is, you know, at the high age, he has the same passion, the same energy, and he can really spark in every player to make things better.”\n\nCuracao fans celebrate their team’s historic World Cup qualification (Ricardo Makyn/Getty Images)\n\nAvoiding defeat was the name of the game last night. It was a contest low on quality but high on drama. Jamaica hit the woodwork three times from set pieces, Curacao had several chances to break as the home side threw men forward in search of the win that would see them qualify, and they forced goalkeeper Andre Blake into a near moment of calamity, from which he recovered well. He also made some good saves.\n\nIt appeared at one stage as though Jamaica would get a last-gasp lifeline by way of a penalty. Referee Ivan Barton pointed to the spot, sending the home fans delirious, only for the decision to be overturned by VAR. At the full-time whistle, Jamaica coach Steve McClaren sat in his dugout, head bowed for two or three minutes. In the press conference afterwards, he resigned, despite Jamaica still having a route to the World Cup via March’s intercontinental play-offs.\n\nFor Curacao, the away point meant qualification straight up.\n\n“I wouldn’t expect us to be at the World Cup,” said Leandro Bacuna on the eve of the game. “I said to Kenji Gorre, I had a dream about it, like about two or three weeks ago. I couldn’t wait to come to this experience to play the last two games. And now that it’s finally coming, I’m in my room every day, I’m like, ‘I want to go out, I want to train, I want to have this game. I want it done and dusted, you know? I want to be there’.”\n\nCuracao, for the first time in their history, are there now.",
  "authors": [
    "Laurie Whitwell"
  ],
  "url": "https://www.nytimes.com/athletic/6819270/2025/11/19/curacao-world-cup-qualification-smallest-nation/"
}