{
  "title": "How Google Makes Billions Off You—And How To Opt Out",
  "text": "Transcript\n\nGoogle is everywhere online,\n\nfrom Gmail to Maps, YouTube search.\n\nYou can't go online without interacting\n\nwith Google in some way.\n\nAnd while pretty much everybody knows\n\nthat Google makes money from advertising,\n\nwhich makes all these services free or mostly free,\n\nyou might not know how deep it goes.\n\nFor example, in 2024, Google made nearly 75%\n\nof its revenue from advertising alone.\n\nThat means $264 billion from ad sales.\n\nGuess what makes those ads so effective?\n\nIt's your data, your location data, your search history,\n\nwhere you go online, what ads you see,\n\nthe music you listen to, potentially health information.\n\nAll of this is feeding into Google's ad ecosystem.\n\nToday, we're doing a deep dive into how Google makes\n\nits billions off of you.\n\nThis is incognito mode.\n\n[bright music]\n\nSo how vast is Google's reach?\n\nLet's start by breaking down\n\njust a few of Google's most popular platforms.\n\nGoogle Chrome has 67.9%\n\nof the worldwide browser market share.\n\nThe next closest is Apple Safari with just over 16%.\n\nYouTube has 122 million daily active users.\n\nGmail, which is by far the most popular email service\n\nhas over 1.8 billion users worldwide.\n\nAndroid holds over 71% of the global OS market share.\n\nGoogle Maps has 2 billion monthly users.\n\nIn Google search, which is synonymous with searching online,\n\nowns nearly 90% of the search market share.\n\nAlthough Google does make money\n\nfrom other things like Google Cloud or selling phones\n\nor services like YouTube TV,\n\nthe vast majority of its revenue comes from ads.\n\nNone of this is new.\n\nGoogle started serving ads in October of 2000.\n\nThat's around 25 years ago.\n\nIf you spend any time online,\n\nyou've seen these ads become increasingly targeted.\n\nUsing Google's ad tech not only do advertisers know exactly\n\nwhat you wanna buy,\n\nthey know exactly when you're most likely to buy it.\n\nAnd while Google has added privacy protections\n\nover the years, it's still making profit from your data.\n\n[bright music]\n\nSo what information is Google collecting about you.\n\nTo find out, all you have to do is go to your app store\n\nand look under the developer privacy disclosure.\n\nBy go to Google,\n\nscroll down to the privacy disclosure.\n\nYou can see all the different categories of data\n\nthat Google collects about you.\n\nSuch as location, contact, info, search history,\n\nbrowsing history, identifiers,\n\nanalytics like purchases, user contacts.\n\nLet's compare Google to Brave,\n\nwhich makes a privacy centric browser\n\nthat competes with Chrome.\n\nAccording to Brave's privacy disclosure,\n\nit only collects two things, usage data and identifiers,\n\nwhich is just like your username or account id.\n\nSo how is Google collecting this data?\n\n[bright music]\n\nWell, there's basically two different categories.\n\nThere's inputs, which includes things like search history,\n\nyour YouTube watch history,\n\nyour browsing data when you're using Chrome,\n\nmap searches and more.\n\nThen there's passive collection,\n\nand you might not know this is happening.\n\nThis is through things like cookies, fingerprinting\n\nand location tracking, which yeah,\n\nGoogle's collecting the data\n\nwhen you enter something into maps,\n\nbut it's also collecting data in the background.\n\nFor example, if you search shoe stores near me,\n\nit has to know your location to know what's near you.\n\n[bright music]\n\nOne of the ways Google passively collects data about you\n\nis through cookies.\n\nNow, you've probably seen cookies somewhere on the web,\n\nmaybe everywhere, those little popups\n\nthat come up on nearly every website that say,\n\ndo you wanna accept these cookies?\n\nDo you wanna accept only necessary cookies?\n\nReject all cookies.\n\nSo what are cookies?\n\nAt the most basic cookies are little bits of data\n\nthat websites download under your browser\n\nto store little bits of information about your usage.\n\nGoogle uses all different types of cookies.\n\nSome of these are deemed functionality cookies,\n\nand these are things that just make websites or apps work.\n\nAnd then there's advertising cookies,\n\nwhich are the ones you really need to be concerned about.\n\nThese can be used to track the performance of ads,\n\nbut they're also used to track a bunch of information\n\nabout what you do online, what your preferences are,\n\nwhat you look at on certain webpages,\n\nand where you go all across the internet.\n\nYou don't need to be using Chrome\n\nto download Google cookies.\n\nThese are persistent across the web,\n\nand unless you're taking steps\n\nto block more invasive cookies,\n\nyou're still downloading them to your machine.\n\nNow, Google is not the only company that uses cookies.\n\nPretty much all of them are.\n\nBut because Google\n\nis the world's largest advertising company,\n\nyou're likely to run\n\ninto its cookies pretty much everywhere you go online.\n\nNow, cookies themselves are not inherently nefarious.\n\nIt's just the primary way that companies like Google\n\nhave tracked people online, collected their data\n\nand fueled the surveillance economy.\n\nNow, you may have heard that Google planned\n\nto kill third party cookies in Chrome.\n\nThis didn't actually happen.\n\nAt the end of 2024, Google reversed its decision\n\nand is continuing to allow third party cookies in Chrome.\n\nBut the company says it's continuing\n\nto experiment with new ways to serve personalized ads\n\nthat it says are less invasive.\n\n[upbeat music]\n\nOne of those experiments appears\n\nto be what's called fingerprinting.\n\nFingerprinting is collecting a bunch of data\n\nabout your device\n\nwhen you're using it to connect to the internet.\n\nThis data can include\n\nwhat type of operating system you're using,\n\nwhat device you're using,\n\neven how fast your battery is draining.\n\nAll of this data can be combined\n\nto create a unique ID for you.\n\nFingerprinting isn't really about your device's data.\n\nIt's really that all that data combined\n\ncreates a unique profile,\n\nwhich can then be used to identify you\n\nand serve you personalized advertisements.\n\nWhereas a cookie is downloading all the information\n\nabout what you're doing on the internet,\n\nfingerprinting is downloading all the information\n\nabout your specific device.\n\nEvery iPhone is unique, every computer is unique,\n\nand because you're the primary user of that computer,\n\nthose characteristics are tied to you used to create\n\na unique ID that's then used to serve you personalized ads.\n\nNow, cookies can be deleted,\n\nthey can be blocked, but changing the device you use\n\nto access the internet every single time is impossible.\n\nThat's why privacy advocates think fingerprinting\n\nis a more nefarious form of tracking than cookies.\n\nIn February, 2025,\n\nGoogle changed its policies about fingerprinting.\n\nIt used to ban the practice,\n\nbut now it seems to be allowing it.\n\nReally, the details at this moment aren't that clear,\n\nbut this may be one of the ways\n\nthat Google is getting past cookies\n\nand using other ways to track people online.\n\n[bright music]\n\nYou might think Google is selling your data,\n\nbut the company says that's not right.\n\nUnlike data brokers, which actually do sell data directly\n\nto whoever wants to buy it,\n\nGoogle sells access to audiences.\n\nUsing Google's ad platforms,\n\nan advertiser can pick exactly who they wanna advertise to.\n\nSay you're a shoe company that wants to advertise to people\n\nbetween the ages of 20 and 40,\n\nand people who make between 80,000 and $200,000 a year.\n\nGoogle's ad platforms allow you to do that.\n\nThey do this through a real time bidding process\n\nthat puts people into segments or buckets.\n\nThese buckets can include\n\na bunch of different characteristics.\n\nFor example, someone who's in tech, is middle age,\n\nmakes a certain amount of money,\n\nhas a certain amount of kids,\n\nand drives a certain type of car.\n\nRealtime bidding platforms allow advertisers\n\nto use complex algorithms who rapidly bid on advertisements\n\nthat then show up all across the web.\n\nNow, Google says all this data is anonymized,\n\nand the company isn't giving advertisers direct access\n\nto your data.\n\nThey're just giving them a bunch of details\n\nabout who you are based on the data it's collected.\n\nThis means they can serve highly personalized ads.\n\nSo if your data is all anonymized,\n\nwhy does any of this matter?\n\nFirst of all, studies have shown that it's almost trivial\n\nto used anonymized data to identify individuals.\n\nSecondly, you might not want a big company\n\nthat's gonna do whatever it's gonna do with your data\n\nhaving such a wealth of information about you.\n\nThis is amplified in the age of AI\n\nwith Google rolling out its own generative AI platforms\n\nlike Gemini.\n\nNow, Google says it doesn't use any of your private data,\n\nlike your emails, what's in your Google Docs\n\nor search history to train its large language models.\n\nInstead, the company says,\n\nit only uses publicly available information,\n\nlike articles on the web or posts on social media.\n\nStill, with AI evolving so rapidly,\n\nwe don't know how a company\n\nwith such a wealth of sensitive information about you\n\nwill use that data in the future.\n\nWhile Google may have certain policies\n\nabout how it uses your data now,\n\nthere's no law in the U.S. that prevents it from changing\n\nhow it's gonna use that data in the future.\n\n[bright music]\n\nGoogle's data collection isn't new,\n\nnor is the problems that it's faced for doing so.\n\nFor example, Google's face lawsuits and settlements\n\nfor misleading people about its location tracking practices.\n\nDC and three other states are suing Google,\n\nclaiming the tech company deceived consumers\n\nin order to gain access to their location data.\n\nIt also faced a class action lawsuit\n\nfor collecting sensitive health information.\n\nThere are also various privacy settlements over facial data\n\nthe company collected in Google Photos.\n\n[bright music]\n\nAs we've seen,\n\nGoogle is collecting a massive amount of information\n\nabout hundreds of millions of people worldwide.\n\nIt's doing so in a variety of ways.\n\nAnd no matter what you do, it's almost impossible\n\nto avoid Google entirely.\n\nA 2019 Gizmodo investigation\n\nfound that even apps like Spotify and Uber,\n\nbreak when you block access to Google servers,\n\nstill there are some steps you can take\n\nto protect your privacy.\n\nYou can stop using Chrome\n\nand switch to a more privacy focused option,\n\nlike Brave,\n\ntry avoiding all of Google's branded apps\n\nsuch as Maps, Gmail, Chrome, and others.\n\nWhile it may be hard to find apps that work\n\nas well as Google's do,\n\nthere are alternatives that are more privacy focused.\n\nIf you do have to use services or apps,\n\nyou can change a bunch of different settings\n\nto better protect your privacy,\n\nsuch as changing your ad settings\n\nto not get personalized ads,\n\nturning off location history,\n\ndeleting your search history and browsing histories.\n\nWhile Google's data collection is happening all the time,\n\nit's never too late to stop creating that data.\n\nYou're gonna become irrelevant\n\nto the company very quickly if you stop using its products.\n\nAs a rule of thumb, if a product is free,\n\nthat probably means you're the product.\n\nSo browse safely and stay safe out there.\n\n[logo whooshing]",
  "authors": [
    "Condé Nast"
  ],
  "url": "https://www.wired.com/video/watch/incognito-mode-how-google-makes-billions-off-you-and-how-to-opt-out"
}