{
  "title": "Brain Surgery Led To 4 Head Dents: The Surprising Aftermath",
  "text": "A current photo of the author showing the four \"holes\" in his head. Courtesy of William Felice\n\nFive years ago, HuffPost published an essay I wrote about my 2019 brain bleed operation that left four significant “holes,” or dents, in my skull. I described in the piece my struggle to accept my new somewhat “deformed” appearance.\n\nHere’s part of what I wrote:\n\n“Yet, the surgery left me with four significant ‘holes’ (dents) in my skull — a freakish sort of look on my bald head that is a bit overwhelming for me. It is a radical change in my appearance that has created profound feelings of insecurity. … When I’m out in public now, I notice the looks I get from strangers, most of which seem to say, ‘Yikes! WTF?’ Some [people] … literally gasped when they saw me.”\n\nAdvertisement\n\nI also mentioned that I was considering another brain surgery to have titanium plates inserted in the holes to make them visibly less severe.\n\nI wrote the essay as part of my recovery process from the trauma of brain surgery. Throughout my life, writing has provided a way for me to process events and come to grips with both setbacks and achievements. My hope was that writing the piece would help me articulate my deepest fears and insecurities from the experience and allow me to move forward. I didn’t anticipate an intense reaction. Boy was I wrong.\n\nThe author in 2017 before he had brain surgery. Courtesy of William Felice\n\nAdvertisement\n\nI received over 400 responses (emails, letters, handwritten notes) from HuffPost readers with thoughtful and supportive words of encouragement and I saved them all. One reader wrote, “I think your holes are really cool. … Be proud of them. You lived through the procedures.” Another reader wrote, “Keep your chin up, your shoulders back, and go confidently into the world. … Anyone who doesn’t see the person inside isn’t worthy of your time.” Someone else told me, “I understand you’re feeling self-conscious. BUT everyone has flaws or abnormalities that they are uncomfortable with. … If some people are put off by this, it’s their problem — not yours. Enjoy your life to the fullest.”\n\nSuch overwhelming, wonderful support really helped me through a difficult transition to acceptance of my new physical reality. The idea that over 400 strangers would take the time to reach out, not only to bolster my spirits but to get me to see the utter stupidity of our modern culture’s obsession with superficial appearances, was humbling. The people who wrote me truly represent the best of America — individuals doing what they can to help others confront life’s hurdles.\n\nAll of this helped me to focus on what was really important: I survived a life-threatening brain bleed with no neurological damage. With this in the forefront of my mind, I decided not to have another brain surgery to have titanium plates fill the holes in my skull. An operation like that would have been solely for cosmetic purposes and not medically necessary. I didn’t want to take the risks — including neurological damage and infections — that accompany surgery of that nature. The support from my husband, Dale, was the key to helping me make this decision and relax about my appearance. His love has nothing to do with my appearance but is based on who I am. I also received essential support from friends and family.\n\nAdvertisement\n\nThe author in the hospital before his brain surgery Courtesy of William Felice\n\nIn my original HuffPost essay, I wrote about being especially anxious about returning as a professor to the classroom and facing young people with my new appearance. I shouldn’t have worried. My students were accepting, generous and nonjudgmental. They defined me not by how I look, but on the quality of my teaching.\n\nI’ve come to accept my appearance and have moved on with my life. However, I’d be lying if I said it’s been easy or that I’m now totally comfortable with my new physical reality. We still live in a society that puts great value on appearances and bombards us with promotions of manufactured needs for Botox, hair products, cosmetics and plastic surgery.\n\nAdvertisement\n\nIn addition, I can still stir a disquieting public reaction. Recently, while sitting in a medical waiting room with my husband, a man across from us looked at my head and loudly exclaimed, “Wow. Your head really took a beating!” His intent was not malicious. He was just startled and I didn’t take offense. Such reactions now seem normal to me and are just part of my life.\n\nMost people will never face having four holes in their heads like I do, but most of us do or will have something that makes us different from everyone else. The more we can show kindness to each other and our differences, the better off we’ll be. This seems particularly important in our current world where cruelty and sowing division seem more popular than ever.\n\nThe author in the hospital after his brain surgery. Courtesy of William Felice\n\nAdvertisement\n\nMy life transformed radically five years ago — first with my life-changing surgery and then when I went public about my new appearance in HuffPost. Since then, I’ve found my way forward and learned a lot about myself. The love I’ve received from the people in my life — and complete strangers — has allowed me to keep going, while focusing on the things that truly matter in my life.\n\nAnother HuffPost reader sent an email that read, “I have never written a letter/email like this; however, I just want to say that I think the 4 badges of courage you were left with after your life-saving surgery are absolutely beautiful. If I saw you on the street, yes, I might give you an astonished look … but I would also smile and tell you that I’m glad you made it through. Be well, Dr. Felice, and Godspeed.”\n\nI’m glad too — and feel even luckier to have received such beautiful support. I hope we can all endeavor to show up for each other like this.\n\nAdvertisement\n\nWilliam F. Felice is professor emeritus of political science at Eckerd College. He is the author of six books on human rights and international relations. Felice was named the 2006 Professor of the Year by the Carnegie Foundation for the Advancement of Teaching. Felice received his Ph.D. from New York University and served as a trustee on the board of the Carnegie Council for Ethics in International Relations. Felice can be reached via his website at williamfelice.com.\n\nDo you have a compelling personal story you’d like to see published on HuffPost? Find out what we’re looking for here and send us a pitch at pitch@huffpost.com.",
  "authors": [
    "Guest Writer"
  ],
  "url": "https://www.huffpost.com/entry/brain-surgery-head-dents-strangers-reaction_n_68e6c2dce4b0c6dbe0eda065?origin=home-huffpost-personal-unit"
}