{
  "title": "Wicked: For Good to Wake Up Dead Man: 12 of the best films to watch this November",
  "text": "2. Nuremberg\n\nWhen the Nuremberg war crime trials began after World War Two, the Nazi defendants were interviewed by US psychiatrists to determine whether they were mentally fit to take the stand. The most significant of these defendants was Hitler's second-in-command, Hermann Göring. In James Vanderbilt's historical drama, adapted from a novel by Jack El-Hai, Rami Malek plays Douglas Kelley, the chief psychiatrist, and Russell Crowe plays the unrepentant Göring, who hopes to bluff his way out of the death penalty. Michael Shannon and Richard E Grant co-star as the US and British officers who ensured that the trials went ahead, but Malek and Crowe are the film's magnetic centre. Nuremberg is \"a remarkable feat of film-making and acting\", says Pete Hammond in Deadline. \"This is a fascinating and urgently important story that has not been told on film before… [and] these two Oscar-winning actors go toe to toe in a thrilling chess match.\"\n\nReleased on 7 November in the US, 14 November in the UK and Ireland, and 27 November in New Zealand\n\nTIFF\n\n3. Sentimental Value\n\nThe Worst Person in the World (2021) was one of the most adored films of recent years. Chronicling several years in a young woman's life in Oslo, it was a sparkling Norwegian comedy drama starring Renate Reinsve and directed by Joachim Trier. Now the team has reunited for Sentimental Value. Reinsve plays a successful actress, and Stellan Skarsgård plays her father, an egotistical director who hopes to revive his ailing career by signing her up for his next film. When she refuses, he hires a Hollywood star (Elle Fanning) to take her place, which complicates their fraught relationship even further. \"Trier has once again crafted a film that is graceful and limber, thoughtful and surprising,\" says Richard Lawson in Vanity Fair. \"Sentimental Value is another rich and humane look at existence from a film-maker wise to the endless nuance of being a person in the world.\"\n\nReleased on 7 November in the US",
  "authors": [],
  "url": "https://www.bbc.com/culture/article/20251030-12-of-the-best-films-to-watch-this-november"
}