{
  "title": "A robot delivered my dinner",
  "text": "is a senior editor and author of Notepad , who has been covering all things Microsoft, PC, and tech for over 20 years.\n\nLast night I found myself running toward my house to meet a robot. I had just returned from a weekend of surviving on GPRS internet in one of the most remote parts of the UK, so I needed a good dinner. During my trip home, I ordered Chinese from a local restaurant, expecting a human to deliver it at 7PM. Surprisingly, minutes after my order I received a text telling me a robot would deliver my order a lot earlier than I was expecting. What?!\n\nAfter a mad dash involving a train, tram, Uber, bus, and my suitcase, I reached my apartment block to find an adorable little robot sitting outside. Several people walked past it without even acknowledging its odd existence, probably because it looked like a futuristic letter carrier’s delivery trolley. “Your Just Eat delivery has arrived, please come outside the building and unlock the robot from here,” read a text message with a link to unlock the robot. I clicked the unlock button from a website and the hood of the robot popped open to reveal my dinner. Once I had grabbed it, I hit the lock and return button and the six-wheeled robot disappeared back to its base around half a mile away. Simple.\n\nStarship’s web app\n\nThe robot is controlled remotely\n\nWhile I was excitedly taking photos of this human replacement, my girlfriend ran inside away from what she described as an embarrassing nerdy spectacle. I didn’t get to see how this robot interacted with other pedestrians or see many reactions, but a neighbor managed to capture it on its way to my house.\n\nVideo by Ian Bell\n\nIt rides along pavements, crosses roads, and avoids driving into humans, and can travel up to three miles at 4 mph. The robot is part of a trial by Starship Technologies, a company created by two Skype co-founders. Starship is developing self-driving robotic delivery vehicles, but the current robot isn’t autonomous just yet.\n\nThe robot is controlled remotely, thanks to a myriad of sensors and cameras that let someone drive it around a busy city to avoid dangerous situations. Starship’s robot even has a minder that walks nearby it to ensure it’s not vandalized and items aren’t stolen. It all looks very futuristic, but for now a lot of humans are still involved in getting this from A to B.\n\nStarship’s robot has room for a basic food delivery.\n\nStarship has been trialling these robots with Just Eat, a huge delivery service in the UK, in several areas of London over the past year, and if you’re randomly selected (like I was) then you’ll receive the text message after your order. The process is as convenient as you might expect robot deliveries to be, and the food remained warm even though I didn’t pick it up for 15 minutes. The robot minder only had to call me and check I was coming to fetch my food because I was running late. Otherwise, the minder stays out of the process to give the illusion that a robot arrived at your front door on its own.\n\nIt’s a neat demonstration of what our future will eventually entail, but a scary reminder that robots will continue to destroy jobs in the name of delivering automation.",
  "authors": [
    "Tom Warren"
  ],
  "url": "https://www.theverge.com/2017/7/25/16024470/starship-technologies-robot-delivery-just-eat"
}