{
  "title": "Does Airport Security Even Work?",
  "text": "Transcript\n\nWhen you go to the airport, you're likely being surveilled\n\nmore than anywhere else in your life.\n\nAirports are really where the trade-offs\n\nbetween security and privacy come into focus.\n\n2015 and 2017, Homeland Security found\n\nthat TSA failed to stop mock explosives 95% of the time,\n\nso are these current safety measures truly effective?\n\nThis is Incognito Mode.\n\n[tenebrous music]\n\n[machinery clicks]\n\nOne thing that we assume is just part of flying\n\nis going through a body scanner,\n\nbut body scanners have only been in place since 2010,\n\nthat's not really that long ago,\n\nand they're really only there because of one guy.\n\nIn 2009, a man accused of being a terrorist\n\nflew into Detroit on Flight 253,\n\npacked with powerful explosives in his underwear.\n\nThe man attempted to detonate the bomb\n\nwhile the plane was descending into Detroit,\n\nbut it only caught fire and didn't actually explode.\n\nThis man flew from Yemen to Nigeria to the Netherlands\n\nand then to the United States,\n\nand at no point was he detected.\n\nIt's for this reason\n\nthat we all have to go through body scanners.\n\nSo, what do TSA agents see\n\nwhen you go through a body scanner?\n\n[Narrator] Technology that can see under your clothes.\n\nUntil 2013, some body scanners used x-ray,\n\nwhich made a very clear image of your nude body\n\nevery time you went through\n\nand TSA agents were able to see this.\n\nThey've since discontinued the use\n\nof the x-ray body scanners\n\nand now use a version that obscures\n\nany sensitive areas on your body.\n\nThe types of body scanners now in use\n\nare millimeter wave scanners.\n\nInstead of showing your real body,\n\nprivacy software creates a 3D doll-like image\n\nand then flags areas that agents might need to check.\n\nHave you ever gone through one of those\n\nand then an area of your body gets flagged\n\nand checked for, like, no apparent reason?\n\nSometimes the machines aren't working\n\nor the line for the machines is too long,\n\nso then you know, an agent will just let a bunch of people\n\narbitrarily go through a metal detector,\n\nwhich is what they used to use,\n\nand then just as arbitrarily,\n\nthey say, Okay, that's all,\n\nand everyone else continue going through the scanner.\n\nSo, all of these things just make you wonder,\n\nwhat are we really catching here\n\nand how airtight is this security?\n\nIt's really hard to prove that something is working\n\nbecause of the absence of something,\n\nand yet it feels intuitive.\n\nLike, we're pretty sure, like,\n\nthis has to be doing something, right?\n\nLike, knowing that you're gonna go through\n\nall the surveillance and pat downs or whatever\n\nwhen you go to the airport\n\nhas to be a deterrent to somebody somewhere.\n\nLike, there's probably been some terrorist attacks\n\nthat didn't happen just because nobody tried\n\nbecause these systems are in place, right?\n\nDeterrence is a valuable tool in, like,\n\na security toolbox,\n\nbut it can't justify all intrusions into privacy,\n\nso, like, we can understand that there's some amount of that\n\nthat is valuable and productive,\n\nbut it doesn't necessarily mean just anything goes.\n\nWe still wanna think about the balance of,\n\nwell, what is that measure that is having a deterrent effect\n\nand is it worth the trade-off?\n\n[tenebrous music]\n\nYou may have seen in the headlines recently\n\nthat facial recognition is expanding\n\nto more and more airports.\n\nFacial recognition is one form of surveillance\n\nthat relies on biometrics.\n\nBiometrics are your personal identifiers,\n\nthink your face, fingerprint,\n\nanything about you that's inherent to who you are,\n\nand that's why people are so concerned\n\nabout biometric surveillance.\n\nThose are things you can't change, can't hide,\n\ncan't do anything about.\n\nYou can imagine how bad it is\n\nif somebody gets your social security number,\n\nbut now imagine they have your fingerprint\n\nor your iris scan,\n\nand that's when it gets into new, uncharted territory.\n\nOnce an entity has that data, that's you forever, right?\n\nIf that organization were to misuse that data,\n\nor if it's stolen or whatever could happen,\n\nonce it's kind of out of your control,\n\nthere's a potential privacy risk\n\nthat just sort of endures through your whole life.\n\nSo, why is this a big deal?\n\nWell, it used to be that all these databases were disparate.\n\nThey didn't all communicate with each other,\n\nthey didn't all share the same data.\n\nThat's starting to change.\n\nWe're gonna have a big, giant database\n\nof everybody's photos, everybody's identities,\n\nand the fact of the matter is we don't really know\n\nhow these systems could be used in the future.\n\nOne of the first rules of privacy and security\n\nis to limit the creation of data in the first place,\n\nand so facial recognition is just another way\n\nof creating more data about you\n\nthat could eventually be abused.\n\nPeople have said for a long time,\n\nWell, what's the point of declining?\n\nyou know, whether it's a face scan\n\nor other types of data collection.\n\nThe government already has all my data anyway, right?\n\nFor many years, the sort of response to that\n\nwas, well, in the U.S.,\n\nyou know, the way the federal government is set up,\n\neach agency's data is siloed from the others.\n\nEven if you had given data to one agency\n\nor particularly, like, a state-level agency,\n\nthat doesn't mean all the federal agencies\n\nor the whole federal government has that information.\n\nYou know, both sides of the aisle,\n\nlike, that has been viewed as a really fundamental right.\n\nAt times, there've been initiatives\n\nto try to do, like, a universal ID within the U.S.\n\nwhere sort of, like, all the checks and everything\n\nwould be built into this one card or document or whatever,\n\nbut there was always pushback to that,\n\nagain, on both sides, but particularly from Republicans\n\nsaying, I don't want the government in my business.\n\nI don't want a, like, central point of control\n\nof knowing who everyone is,\n\nand that's why it has largely remained a state's directive,\n\nbut now like you're saying,\n\nthere's really a movement away from that\n\nin this very sort of casual, like,\n\nwell, now this is happening\n\nand all federal data is being centralized kind of way,\n\ncompletely ignoring the fact\n\nthat there's been literally decades of debate about this.\n\nIn November 2024, a bipartisan group of 12 senators\n\nthat includes Ted Cruz and Bernie Sanders\n\nsigned a letter asking the TSA for more information\n\nabout how they're gonna conduct oversight\n\nof the expanding use of facial recognition\n\nat airports across the United States.\n\nThe senators warn that soon,\n\nhundreds of airports will have facial recognition,\n\nbut they also say people aren't aware\n\nthat they're able to opt out.\n\nYou're allowed to tell the TSA,\n\nNo, I don't wanna be subjected to facial recognition,\n\nbut the senators say they've received reports\n\nof travelers encountering belligerent TSA officers\n\nwho don't wanna allow them to opt out,\n\nwhich is their right to do.\n\nWhen a bipartisan group of senators\n\nsends the TSA a letter like this,\n\nyou can tell there's broad concern\n\nover the oversight of TSA facial recognition systems.\n\nThe fact that the senators\n\neven had to send a letter like this\n\njust shows that there's very little information\n\nabout how effective these systems are.\n\nEven though things seem to be moving\n\nin this direction right now,\n\nwhere all this data seems like it's being stockpiled\n\nmore and more by the federal government,\n\nit's still worth being thoughtful,\n\nyou know, declining anything you want to decline\n\nor you feel that you can\n\nbecause there can still be value in that\n\nand you kinda never know which way the wind is gonna blow\n\nand what's gonna happen.\n\nThe data minimization concept still applies.\n\n[machinery clicks]\n\nIf you've been to, like, a major airport recently,\n\nyou've probably had somebody come up and be like,\n\nHey, do you wanna sign up for CLEAR?\n\nDo you wanna skip the line? Yeah, exactly,\n\nand then who doesn't wanna skip the line,\n\nbut this isn't a government agency\n\nthat's operating the system.\n\nThis is a system called CLEAR\n\nand it's run by a third-party company.\n\nAn alternative to CLEAR is the TSA PreCheck program,\n\nwhich is basically the same thing,\n\nbut it's run by the U.S. government.\n\nWhat is the deal with CLEAR\n\nand why is there more issues\n\nwith a third-party company kind of doing this\n\ninstead of just the U.S. government?\n\nWell, when something is a third party,\n\nlike a private company,\n\nconsumers may not have control\n\nover what happens to that data,\n\neither right away,\n\nlike, you've had your face scanned, you know, by this entity\n\nand then maybe, you know,\n\na company is selling it to a third party,\n\nor you know, sharing it with a partner, things like that,\n\nbut there's also been a lot of situations where over time,\n\na company that holds data\n\nis then acquired by another company, goes bankrupt,\n\nor merges with another company\n\nand the data starts to change hands and change hands.\n\nSo, something like CLEAR,\n\nshort-term, it's a way\n\nto get through airport security faster,\n\nbut you're entrusting this durable, non-changeable,\n\nyou know, biometric information with an entity.\n\nYou know, you don't know where that will lead over time.\n\nCLEAR works by scanning various biometrics about you.\n\nThat includes your iris, your fingerprint,\n\nand now they're starting to move\n\ninto full facial recognition.\n\nIn exchange for using CLEAR,\n\nyou're able to get through the line more quickly,\n\nand the company claims\n\nthat using the facial recognition technology\n\nwill speed up things even more.\n\nCLEAR's privacy policy says\n\nthat it will share your information with the government\n\nif authorities issue a subpoena.\n\nThe may also share your information\n\nin connection to an investigation\n\ninto potential illegal activity.\n\nYou're also trusting the company to safeguard your data\n\nand you don't really have much insight\n\ninto how the company's doing that.\n\nCLEAR's not subjected to public records laws\n\nand that means it's a lot harder to get information\n\nabout how the company is storing your data,\n\ntreating that data,\n\nand that they're not abusing it.\n\nCLEAR says, what is it, in 10 minutes or something,\n\nyou can, you know, just sign up here\n\nand you can walk right through,\n\nso it really raises the point of that security screening,\n\ntaking shoes off, taking the laptop out of the bag,\n\nall of those things.\n\nIs that really keeping us safe\n\nif we can so easily skip it?\n\nYeah, and it's also normalizing the acceptance\n\nof additional surveillance in exchange for convenience.\n\nIt's not even exchange for security necessarily,\n\nit's just an exchange for getting through the line faster.\n\nI think that's a great point.\n\nYou know, like we were saying,\n\nwe as a society kind of created this challenge\n\nof long waits at airport security,\n\nand now look, here's this private company\n\nthat will solve it for us.\n\nSo, the worst-case scenario I can see here\n\nis kind of already happening.\n\nLike, CLEAR is not just at airports.\n\nIt's in stadiums, it's in arenas,\n\nand so we're already starting to see this company's mission\n\ncreep out into the rest of the world\n\nand it's becoming tied to the profits of a private company\n\nthat we have absolutely no control\n\nover how they're gonna conduct themselves.\n\nIt's one thing for it to be the government,\n\nwhere you have some say in it in a representative democracy\n\nlike we live in in the United States,\n\nwhereas a private company, you just have no control.\n\nThey're gonna do whatever they're gonna do\n\nand mostly they're gonna do\n\nwhatever's gonna make them the most money\n\nin exchange for our privacy,\n\nand so it's gonna become increasingly invasive.\n\n[machinery clicks]\n\nAnytime you go to an international airport,\n\nyou're technically entering a U.S. border zone.\n\nThis means your devices\n\nmight be subjected to warrantless searches\n\nby Customs and Border Protection agents.\n\nIn January, directly after his inauguration,\n\nPresident Donald Trump signed an executive order\n\nallowing agents to conduct enhanced vetting\n\nof anyone entering the United States.\n\nTrump's executive order empowers border agents\n\nto use more aggressive tactics\n\nwhen vetting travelers coming into the United States.\n\nThis might mean pulling people aside\n\ninto interrogation rooms\n\nor searching their devices.\n\nFor example, in early 2025,\n\na French scientist was allegedly denied entry\n\nbecause a border agent found text messages on his phone\n\nthat were critical of Trump and his science policies.\n\nNow, when you're at an airport,\n\nTSA isn't allowed to search through your phone.\n\nIt's only CBP officers that have the authority to do so.\n\nWhile people have become increasingly concerned\n\nabout having their devices searched at the border,\n\nstudies show that since 2021,\n\nthere's only been a 0.1% increase in device searches.\n\nI would say a large number\n\nof the inspections that we have here\n\ndo not include any electronics whatsoever.\n\nIs it within our authority to search those items?\n\nIt is, but we use our discretion\n\nwhen we're looking to use that search parameter.\n\nSo historically, there's no huge cause for concern,\n\nbut that could change.\n\nAnd when we're talking about these device searches,\n\nthere's kind of two levels of a search.\n\nOne is the agent just literally looks through your phone\n\nand you know, some of the advice\n\nis make sure it's on airplane mode\n\nor make sure you just turn it off and stow it away\n\nso they don't think to search it in the first place.\n\nThe other is a lot more invasive. Can you talk about that?\n\nCBP agents could run, like,\n\nmore detailed digital analysis on it,\n\npotentially even remove some of your data\n\nor you know, copy your data off your phone.\n\nIt gives them more ability\n\nto kinda map out, like, your accounts\n\nand start to understand potentially\n\nwhat other data you have stored elsewhere.\n\nSo, that's why that first check,\n\nyou know, when we talk about what might be suspicious,\n\nwhat might raise some red flags\n\nbecause you're in that first search\n\nthat you're talking about,\n\njust sort of a casual flipping through,\n\nyou want everything to look cool and just look chill\n\nbecause then it doesn't need to progress beyond that.\n\nSo, if a CBP officer wants to search your device,\n\ncan you say no?\n\nWell, it depends on who you are.\n\nIf you're a U.S. citizen,\n\nyou can absolutely deny a search of your device.\n\nYour device might be confiscated, you might have some delay,\n\nbut you'll still get in the country.\n\nIf you're a green card holder,\n\nyou may face some types of immigration consequences\n\nfor denying a search of your device.\n\nFor visa holders, they may be refused entry\n\nand have their visas revoked.\n\n[machinery clicks]\n\nFrom the moment you enter a terminal\n\ntill you go to board your flight,\n\nyou're likely being subjected to surveillance from hundreds,\n\nif not thousands of cameras.\n\nThat's something you've probably already thought about.\n\nIt's an airport. Of course you're gonna be monitored.\n\nBut the number of cameras seems to be increasing\n\nat international airports.\n\nAt LAX for example, they recently upped the number\n\nfrom around 1,000 to around 3,000 cameras,\n\nand they have plans to expand that surveillance\n\nto the 10-mile perimeter around the airport.\n\nBut it's not just the number of cameras.\n\nThese devices are also getting enhanced capabilities,\n\nsuch as AI analytics that monitor crowd behavior,\n\nindividual behavior, unauthorized areas, and loitering.\n\nIt's very hard for humans\n\nto grasp when we are being surveilled\n\nby video surveillance nonstop,\n\nand I think the incorporation of AI\n\ninto all of these systems,\n\nit's even harder to grasp the depth\n\nof the analysis and information that can be, you know,\n\nextracted in near real-time\n\nabout just any footage that's coming in.\n\nSo, our instinct is to kinda think,\n\nwell, okay, even if we can understand\n\nthere's all those cameras everywhere, which is hard enough,\n\nthen it's like, Yeah,\n\nbut nobody can be watching everything all the time,\n\nbut AI actually makes it more possible.\n\nLet's say an AI system,\n\nthis can happen anywhere, but an AI system in an airport\n\ndetermined that you were acting suspicious.\n\nLike, Oh, Andrew has a suspicious walk\n\nin the terminal today.\n\nYou know, that is a very subjective decision,\n\nso you know, as AI is integrated\n\ninto more and more systems,\n\nthese are the types of things\n\nthat we all need to be aware of, and be conscious of,\n\nand be, you know, making proactive decisions as a society\n\nrather than just allowing things\n\nto kind of drift where they will.\n\nWe should address that. We shouldn't just leave that.\n\n[machinery clicks] [tenebrous music]\n\nAirports weren't always like this.\n\nIt's only since the September 11th, 2001 terrorist attacks\n\nthat the U.S. really ramped up security at airports.\n\nTSA's 2025 budget is $11.8 billion,\n\nand according to one poll,\n\nthree in four Americans say they trust the TSA\n\nto keep them safe.\n\nIs it important to take measures to keep everybody safe?\n\nOf course, absolutely.\n\nSecurity is paramount, especially at airports,\n\nbut do we really need to be throwing out our water bottles\n\nevery time we go through airport security?\n\nMaybe not.\n\nThere may be other ways to do this that are better,\n\nboth for our security and for our privacy.\n\nA big criticism of TSA and airport security checkpoints\n\nis that they aren't really effective a lot of the time\n\nand that the core thing that's happening\n\nis what's called security theater:\n\nthis ruse to make everyone feel better\n\nthat isn't necessarily doing anything.\n\nYeah, whether the TSA is popular or not, I don't know,\n\nbut people definitely want good security at airports.\n\nIf it's achieving that goal, that's great.\n\nI think it's hard to know\n\nwhether it's actually achieving that goal,\n\nand so I think that's problematic on two fronts.\n\nOne, because that raises the possibility\n\nof something bad happening\n\nand it making all of the surveillance\n\nand intrusions that we're subjected to at the airport\n\nkind of for naught,\n\nand the other is that we're giving up a ton of privacy\n\nto have something that's not really working\n\nthe way that it should,\n\nand so I think there needs to be a lot more clarity\n\nin terms of how effective each and every system and process\n\nthat the TSA subjects the public to is\n\nand whether or not it's actually increasing our safety\n\nor whether it's just making us feel better.\n\nYeah, and I think that's a really good point\n\nthat it isn't all or nothing.\n\nEach component can and should be evaluated\n\nto see how effective it is.\n\nSome could be taken away, some could be added.\n\nIt doesn't have to be in one direction or the other,\n\nbut if we're going to kind of create a problem\n\nand a whole industry around airport security,\n\nit needs to actually be accomplishing the goal.\n\nYou know, it's important to say that, like,\n\na lot of this in the U.S.\n\ncame from the September 11th attacks,\n\nand so there was, like, a real tragedy\n\nand a real reason behind all of this concern\n\nand trying to step up security,\n\nbut just because there's a good reason to consider\n\nor reconsider the security of something\n\nand how you implement that,\n\nyou know, it doesn't necessarily mean\n\nthat where things have landed is the best way.\n\nYeah, exactly, and I mean, I am very sympathetic\n\nto people being okay with surveillance\n\nto avoid terrorist attacks.\n\nI mean, we both lived in New York City on September 11th.\n\nWe are filming this right now in the World Trade Center.\n\nThe footprints of the old World Trade Center\n\nare literally right behind us,\n\nand so, you know, we're well aware\n\nof the consequences of security failures,\n\nbut that doesn't mean that we need to live in a world\n\nwhere intense surveillance any time you travel\n\nis just how it has to be.\n\n[machinery clicks]\n\nSo, what can you do if you're traveling through an airport\n\nand you wanna protect your privacy?\n\nUnfortunately, there's not much,\n\nbut there are a few steps you can take.\n\nOne, know your rights.\n\nThis is gonna change depending on who you are,\n\nwhat your immigration status is,\n\nand exactly where you're traveling,\n\nbut just make sure you're up to speed\n\non what agents can and cannot do.\n\nTwo, use a dedicated travel phone.\n\nThis is a device that is only gonna have things on it\n\nthat you're comfortable an agent searching through.\n\nAnd third, don't sign up for CLEAR or other systems like it,\n\nand opt out of facial recognition.\n\nNo matter how belligerent the agent gets,\n\nyou can always say no.\n\nThis was Incognito Mode. Until next time.\n\n[emphatic music]",
  "authors": [
    "Condé Nast"
  ],
  "url": "https://www.wired.com/video/watch/incognito-mode-does-airport-security-even-work"
}