{
  "title": "Will Padma Lakshmi And Melissa King Please Declare Coupledom?",
  "text": "The queer internet is currently losing its mind over what many are speculating is a romantic relationship not-so-quietly brewing between author, model and foodie Padma Lakshmi, and Top Chef icon, Melissa King.\n\nThe pair have been close for a while, but the delicious rumors really began to swell when Lakshmi and King wore joint The Addams Family Halloween costumes (obviously, Lakshmi was Morticia and King was Gomez). In a post featuring the two of them together — which, by the way, included one picture of King kissing Lakshmi’s bicep — King quoted Gomez Addams: “I would die for her. I would kill for her.”\n\nThe heat under this lesbian stew turned up a notch last week, when Lakshmi was seen at a New York City restaurant laughing with King, who was sitting on her lap. Just a few days later, the two uploaded a video of them cooking together, and at one point King joked about how gay Lakshmi’s nails were.\n\nAdvertisement\n\nIf you haven’t seen the video, Lakshmi’s nails are actually textbook lesbian, with the nails on her index and middle fingers shorter than all the others. “Stop starting rumors,” said Lakshmi playfully, visibly blushing. That’s when most of us knew there was definitely something up.\n\nAlthough Lakshmi has never explicitly come out to the public as queer, she has dropped hints. In her 2016 memoir ”Love, Loss, and What We Ate,” Lakshmi hinted at having had sexual and romantic relationships with women while she modeled in Europe — but she has not, to my journalistic knowledge, been in a relationship with a woman. King, on the other hand, openly identifies as a lesbian and has long been an advocate for LGBTQ+ issues.\n\nI don’t know about everyone else, but to me, the restaurant lap-sitting was definitely giving a couple vibes. At the very least, it’s way more action that I’ve gotten recently.\n\nAdvertisement\n\nAnd the internet’s queer thirst is palpable. “The lesbians are being FED on this blesst halloween,” one person commented on the Halloween costume post. There have also been an array of think pieces on the potential relationship (and lesbian fingernails).\n\nWhether or not they’re dating, neither of them owes anyone an explanation, and Lakshmi certainly doesn’t owe us an official “coming out.” But even if this is just a queerbait friendship, I’m still totally here for it. To me, it doesn’t feel gross or weird compared to the type of queerbaiting that straight and cis men sometimes partake in. That’s because there’s a fundamental difference: There’s a genuine sense of love and physical intimacy happening between King and Lakshmi — sexual or not — and it doesn’t take a queer studies professor to see that.\n\nWhen straight men queerbait, on the other hand, it often feels performative. When they position themselves as queer ‘allies’ or post a vaguely suggestive intimate picture with their homie, I often feel like they’re mimicking how they think a queer person presents themselves. And most of the time, it’s done for clout, praise, or grossly, to bag more women.\n\nAdvertisement",
  "authors": [
    "Contributing Writer"
  ],
  "url": "https://www.huffpost.com/entry/padma-lakshmi-melissa-king-relationship-status_n_691ca695e4b073def3ee6a4e?origin=home-voices-feed-unit"
}