{
  "title": "Mum turned charity shopping into her 'dream career'",
  "text": "'I turned charity shopping into my dream career'\n\n5 days ago Share Save Lauren Hirst North West Share Save\n\nAir Ambulance UK Jen Graham posts under the name Charity Shop Girl on social media\n\nFive years ago, Jen Graham was encouraged by her teenage daughter to share her favourite charity shop finds on social media. Pregnant with her younger daughter, the self-described second-hand fashion addict had just been made redundant from her job at a car dealership. Fast forward to the present day and Jen has nearly 200,000 followers across Instagram and TikTok and is currently filming for the BBC's new series Shift the Thrift. \"Having something that was a hobby and being able to turn it into a career for a positive reason of helping these charities is really special,\" says the mother-of-three, who posts under the name Charity Shop Girl.\n\n'Sharing styling tips'\n\nWhile Jen says she first fell in love with charity shops and the gems hidden within them when she was 17, her love of rummaging actually started much earlier. \"My dad told me that when I was five or six years old he used to take me to the scrapyard where they sold clothes, bric-a-brac and bits of furniture,\" says Jen, who grew up in the Anfield area of Liverpool and now lives in Sandbach, Cheshire. \"I used to love going there and I would buy the most random stuff. \"I loved going there more than I loved going to a toy shop!\" Encouraged by her elder daughter, Jen started sharing styling tips on social media. It was a move born out of necessity as well as passion, though, after she lost her job. \"I was doing like one item three ways, and how I would wear this item and where I got it from and how much it was,\" she says. As her following began to grow, she started sharing the gems she had discovered while sifting through the rails at charity shops. \"It just took off from there,\" says Jen. Her top discoveries include a YSL blazer for just £20, a Coach jacket for £30 and a Hermes purse for £25 as well as clothes from her favourite brands such as Jaeger and Frank Usher.\n\nAir Ambulance UK Jen says it is important to shop out of season while charity shopping\n\nWith her growing following came media opportunities including a styling segment on ITV's This Morning as well as becoming an ambassador for the Air Ambulance UK and the National Children's Air Ambulance. But what top tips would she give to someone on the hunt for budget-friendly, sustainable fashion choices? \"You've got to be prepared to go in for a rummage,\" she says. \"You find one-off unique items - it's cheaper and the money is going back into the charity. \"That's my main reason for charity shopping.\"",
  "authors": [],
  "url": "https://www.bbc.com/news/articles/c93x5g4k7lvo"
}