{
  "title": "Automated Holiday Party Ideas (2025): Ninja, HP Sprocket, Cricut",
  "text": "There's an automated solution, though. For my latest parties, I brought the HP Sprocket Photo Booth Machine ($600), and it was a hit. It's a 21-inch-tall, portable photo booth that both automatically prints 3 x 4-inch pictures and lets you download digital versions via a QR code. I love that you can create events on the device and set up customized filters—mine had the word “Soupsgiving” on the bottom, though it was in an incredibly small font compared to the regular filter designs—and you can also add settings like how many prints of one picture guests can print. We left the default setting of two on for the soup-themed Friendsgiving, but I think I'll bump it up to at least three for future gatherings. Make sure to stock up on HP's Zink paper packs ($40 for 50) for the photo booth to print with, especially if it's a big gathering. It will need both Wi-Fi access and a power outlet.\n\nHow to Automate Your Appetizers\n\nFeeding a crowd is hard. Feeding a crowd that includes some serious allergies and dietary restrictions doesn't make it any easier. In the spirit of automating everything I could, I turned to ChatGPT to come up with my appetizer for a group that featured two vegetarians and someone whose allergies include avocado, beans, shellfish, and eggs. (Getting those two sets of friends their protein needs at the same time has a singular overlap in the Venn diagram of what they can all eat: tofu.)\n\nChatGPT did a good job brainstorming some possible options, and when I asked for a holiday angle, it came up with new options that were nice and seasonal. I chose to go with the lowest-lift option—pomegranate and ricotta crostini—but the baked brie bites were a big contender too. I was able to have this digital conversation and get the recipes all on ChatGPT's free tier, but you can hit the paywall when you ask too many questions or ask things that need more research from the artificial intelligence.\n\nHow to Automate Your Cooking\n\nFellow WIRED reviewer Matthew Korfhage is currently testing two different robots that will cook your dishes for you, but in the meantime, the closest I've found is the 10-in-1 Ninja Foodi PossibleCooker Pro ($119). You can choose from options ranging from sear and slow cook to sous vide and even bake. It turned my broccoli-cheddar soup experiment (I was on a quest to replicate my favorite Panera soup for Soupgiving) into a one-pot dish where I could sauté my onions, stir up my béchamel, and then mix in all my ingredients and let it simmer until done. It even comes with an integrated utensil.\n\nIt was really helpful to use in an already busy kitchen, and I imagine it would be indispensable for big, Thanksgiving-style dinners where the stove and oven are monopolized. While I still had to do the cooking, I was able to hang out in my own little spot and let the PossibleCooker help me. It has a timer in the front to help remind me how long I've been cooking on a setting, though I do wish there were a medium setting (your choices are low and high for the cooktop settings).\n\nAutomate Your Food Disposal\n\nThere are a lot of food scraps when you're cooking for events like Thanksgiving and holiday dinner parties. I really loved grabbing the canister from the FoodCycler and bringing it next to where we were cooking soups so everyone could throw their food scraps in as we went. When it's full, just set it in the machine and it will grind-and-dry the scraps (or leftovers!) into a sort of nutrient-rich meal that can be mixed in with potting soil or sprinkled on your lawn. I have the new FoodCycler Eco 5, and WIRED reviewer Kat Merck recommends the FoodCycler Eco 3 as one of her favorite home food recyclers.\n\nWhat Else I’m Testing This Holiday Season\n\nThe holiday season is only just starting, and I'll be testing more gadgets and gear all season long. Here's some of what I'm testing next:\n\nThe Bartesian Cocktail Maker ($349): This cocktail maker promises to be the Keurig of cocktail machines, with capsules for cocktail mixes instead of coffee. You'll need to bring your own liquor, but once you fill up the included containers with the liquid, the machine should be able to take it from there. I'll be testing some of the fun holiday cocktails too.",
  "authors": [
    "Nena Farrell"
  ],
  "url": "https://www.wired.com/story/automated-holiday-party-ideas/"
}