{
  "title": "The Thing With Feathers review – well-intentioned adaptation of Max Porter novella about grief",
  "text": "This is a painful movie in both the right and the wrong ways; I found something fundamentally unpersuasive and unhelpful in its contrived, high-concept depiction of grief. Adapted by writer-director Dylan Southern from Max Porter’s novella Grief Is the Thing With Feathers, it stars Benedict Cumberbatch who gives an honest and well-intentioned performance as a children’s author and graphic novelist. Living a middle-class existence in London, he is suddenly widowed; one of the movie’s off-target qualities is its refusal to specify the cause of death or even show us clearly what his wife looked like, which in real life would be unbearably vivid facts. Sam Spruell has a quietly sympathetic role as Cumberbatch’s brother.\n\nLeft to look after their two young boys, he succumbs to a kind of breakdown, and hallucinates a giant nightmarish crow, which after a while the boys can sense too. The crow is derisively voiced by David Thewlis, and resembles the Ted-Hughes-ish illustrations Cumberbatch was working on. It sneeringly, ruthlessly mocks and jeers at his “sad dad” anguish; while everyone else is walking on eggshells around him, perhaps making things worse, the brutal crow jabs its beak into his psychic wound.\n\nThe film has some cliches: the cartoonishly misjudged and intrusive gesture of sympathy by a school-gates mum, and the solo pushing of a trolley around a supermarket which morphs into a bad dream. The death-totem crow is not cliched, exactly, though it did remind me of Daina O Pusic’s comparably unsatisfying film Tuesday, which offered a giant macaw as a symbol of death. But this special effects crow is, for me, not believable either as a symbol of grief or as a radically therapeutic way of challenging or working through it, and the film is itself is too flagrantly tasteful and sensitive to work as a horror movie. Quite simply: when the crow is off the screen, the drama starts to be involving and affecting. Once the crow is there, the film looks self-conscious.",
  "authors": [
    "Peter Bradshaw"
  ],
  "url": "https://www.theguardian.com/film/2025/nov/20/the-thing-with-feathers-review-benedict-cumberbatch-max-porter-grief"
}