{
  "title": "Europe calls for role in Ukraine talks amid reported US-Russian peace deal",
  "text": "Europeans must be involved in any attempt to broker peace between Ukraine and Russia, the continent’s top diplomats said after reports of a US-Russia plan favourable to Kremlin interests emerged.\n\nThe EU’s foreign policy chief, Kaja Kallas, welcomed any “meaningful efforts” to end the war, but said Ukrainian and European input was needed for any plan to work.\n\n“[Vladimir] Putin could end this war immediately if he just stopped bombing civilians and killing the people,” she told reporters. “But we haven’t seen any concessions on the Russian side. We welcome all the meaningful efforts to end this war, but like we have said before, it has to be just and lasting. That also means that the Ukrainians, but also the Europeans, agree to this.”\n\nView image in fullscreen The EU foreign policy chief, Kaja Kallas, said: ‘We haven’t seen any concessions on the Russian side.’ Photograph: Nicolas Tucat/AFP/Getty Images\n\nMinisters were solid and calm about the latest plan, Kallas told reporters after the meeting, “because we have seen this before, and because different peace plans cannot work if the Europeans and Ukrainians do not agree to this”.\n\nShe stressed the EU would continue working on sanctions to increase pressure on Russia: “The EU has a very clear two-point plan: first, weaken Russia; second, support Ukraine.”\n\nThe German foreign minister, Johann Wadephul, sounded a similar note. “All negotiations about a ceasefire, regarding the further peaceful development of Ukraine, can only be discussed and negotiated with Ukraine,” he said. “And Europe will have to be included.”\n\nThe draft US-Russian peace plan, which emerged in media reports on Wednesday, would require Ukraine to surrender territory and cede unprecedented control over its political and military sovereignty to Russia. It came after a massive Russian drone and military attack on western Ukraine killed at least 26 people and injured more than 100 in their apartments.\n\nJean-Noël Barrot, the French foreign minister, said peace could not mean capitulation. “The principle of peace must start with a ceasefire on the line of contact which will allow engagement in discussions on the questions of territories and security guarantees. That is what we have always said, that is what Ukraine has always said … But what we see today is that Russia and Vladimir Putin are an obstacle to peace.”\n\nPoland’s foreign minister, Radosław Sikorski, who was expected to inform his counterparts about the sabotage attack on Poland’s railway network this week, said: “We commend peace efforts. But Europe is the main player, the main supporter of Ukraine, and it is, of course, Europe’s security that’s at stake. So we expect to be consulted.”\n\n“I hope it is not the victim that has restrictions on its ability to defend itself, but it’s the aggressor whose aggressive potential should be restricted,” he added.\n\nView image in fullscreen Radosław Sikorski, Poland’s foreign minister, said Europe’s wider security was at stake in any future peace deal between Russia and Ukraine. Photograph: Czarek Sokołowski/AP\n\nMinisters were meeting as Russia’s parliament said that any “confiscation” of Russian assets by the EU should draw legal action against Belgium and Euroclear, the Brussels-based depository where most of the frozen sovereign wealth is held.\n\nThe EU is stalled over a plan to use Russia’s frozen assets to generate a €140bn (£123bn) loan for Ukraine, largely because Belgium is seeking further guarantees about legal risks. EU officials insist their proposal does not impinge Russia’s property rights and have previously downplayed the consequences of legal action against Belgium and Euroclear.\n\nskip past newsletter promotion Sign up to This is Europe Free weekly newsletter The most pressing stories and debates for Europeans – from identity to economics to the environment Enter your email address Sign up Privacy Notice: Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on theguardian.com to send you this newsletter. You can complete full registration at any time. For more information about how we use your data see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nThe Duma vote is a response to a letter by the European Commission president, Ursula von der Leyen, to EU leaders on Monday, where she warned that Ukraine faced a €136bn shortfall in 2026-27 to pay for its defence and keep the country running. She outlined three options to fund Ukraine, but made clear she favoured a reparations loan based on the Russian frozen assets.\n\nEU leaders are to discuss the plan at a summit next month, having failed to reach an agreement in October. Belgium argues that the EU plan lacks crucial details, such as what happens if Russia refuses to pay reparations to Ukraine, or how the risk would be shared if Moscow sued Euroclear. The Brussels-based securities depository houses around two-thirds of all Russia’s sovereign wealth in the west.\n\nOn Thursday the Duma – Vladimir Putin’s rubberstamp parliament – voted unanimously in favour of the resolution, according to a statement on its website. “The confiscation of Russian assets – no matter how artful the disguise – cannot be conceived as anything other than a violation of Russia’s sovereign rights,” it said. “Any infringement of Russian assets must draw an appropriate legal response, starting with claims for damages – with the demand for the seizure of property as a security measure – towards Euroclear and Belgium.”\n\nEuroclear declined to comment, but referred to an interview its chief executive, Valérie Urbain, gave to Le Monde earlier this month. Anything that remotely resembled confiscation would be illegal, she told the paper: “We must be extremely vigilant,” she said, warning that Russia could take legal action.\n\nKallas did not refer to the Duma vote directly, but said Russia was afraid of the reparations loan, suggesting that explained Moscow’s interest in the latest peace plan. “I think they are coming to the point where they are running out of money and they want to show outside that they are super strong ... but actually it’s not the case,” she said.\n\nIn Brussels on Thursday, Hungary’s foreign minister, Péter Szijjártó, voiced his government’s typical hostility to EU efforts to support Ukraine, saying it would be unimaginable to “send the money of the Hungarian people to a corrupt Ukrainian war mafia”. This is a likely reference to the corruption scandal engulfing Ukraine’s government, which Budapest has seized on to bolster its anti-Ukraine stance.",
  "authors": [
    "Jennifer Rankin"
  ],
  "url": "https://www.theguardian.com/world/2025/nov/20/europe-must-be-involved-in-ukraine-peace-deal-negotiations-say-diplomats"
}