{
  "title": "Enduring Mayhem: Images of the War in Ukraine, Now in Year 4",
  "text": "With the largest and deadliest conflict in Europe since World War II stretching into a fourth year, the scale of the devastation wreaked by Russia’s full-scale invasion of Ukraine continues to mount.\n\nThe front line is a place of ghastly violence where hundreds of thousands of Russian and Ukrainian soldiers have been killed or wounded, according to conservative Western estimates. The list of Ukrainian cities and towns largely leveled by Russian bombs and artillery grows with each passing month.\n\nRussian forces have moved forward in small increments, sustaining a staggering number of casualties to take cities like Avdiivka, which they captured last year. Ukraine has sought to slow the advance while also committing some of its limited resources to counterattacks, such as its surprise incursion into the western Russian region of Kursk last year, and its strikes against Russian strategic airfields early in June, using drones smuggled deep into the country.\n\nPresident Trump’s efforts to thaw relations with Moscow and press Ukraine into a rapidly negotiated end to the war have drawn few concessions from President Vladimir V. Putin of Russia. Millions of Ukrainians have spent hours in bomb shelters as Russia rains down missiles and drones on military units and civilians across the nation. Ukraine’s energy grid, severely damaged, is working, albeit with sporadic outages. Thousands of schools, hospitals and cultural institutions have been damaged or destroyed. Millions of people have lost their homes.\n\nFor all that time, photographers with The New York Times and other news organizations have chronicled the war, capturing a slice of how soldiers and civilians have experienced it. Some images, our photographers say, will never leave them.\n\nThis gallery contains graphic images.\n\n\n\nOctober",
  "authors": [],
  "url": "https://www.nytimes.com/2024/04/24/world/europe/images-ukraine-war-fourth-year.html"
}