{
  "title": "This Lightweight Laptop Is Almost Half Off",
  "text": "On the hunt for a lightweight and budget-friendly laptop that won't let you down? Best Buy has the Asus Zenbook A14 discounted from its usual $1,000 price point to just $550 for an early Black Friday deal. This featherweight laptop is a Windows Copilot+ PC, with a Qualcomm Snapdragon X Plus at its core, and is a great deal for students or occasionally putting in some hours from your local café.\n\nWeighing in at just 2.1 pounds, this Zenbook is one of the lightest laptops we've tested to date, with most machines starting closer to 2.4, and only Lenovo's Thinkpad X1 Carbon coming anywhere close at 2.2 pounds. That's largely thanks to a material developed by Asus called Ceraluminum, a combination of ceramic and aluminum that's both extremely light and very durable.\n\nLike a lot of laptops in the Copilot+ range, the Zenbook sports an FHD+ (1920 x 1200) resolution screen, but it's at least an OLED panel, which is great news for those of you who put your laptop on the coffee table to watch movies. Our reviewer Christopher Null ran a video playback test, and even with the screen at full brightness, the laptop managed to run for over 20 hours. That's a truly impressive feat, particularly for a laptop so thin and light.\n\nThe heart of this machine is a Snapdragon X Plus from Qualcomm, a brand you might be more used to seeing in mobile phones than Windows machines. While it does help give you that awesome battery life, the performance leaves a bit to be desired. While it's totally fine for web browsing, text documents, and email, don't expect to play the latest games, or do anything more strenuous than some light graphics work.\n\nQualcomm chips are slowly becoming a more appealing option for laptops, and if you're trying not to spend a ton of money on a laptop, they're worth a look. While gamers and video editors should swing by our laptop roundup for more serious options, at just $550 the Zenbook A14 offers a surprising amount of value in a petite package.",
  "authors": [
    "Brad Bourque"
  ],
  "url": "https://www.wired.com/story/asus-zenbook-a14-deal-1125/"
}