{
  "title": "Nvidia continua a crescere, ma sulle sue spalle ormai si regge il destino dei titoli dell'AI",
  "text": "Nvidia ha perso investitori importanti. Nel giro di poche settimane grandi azionisti hanno venduto partecipazioni per miliardi nel colosso dei chip per intelligenza artificiale. Tra loro il gruppo giapponese SoftBank, l'investitore Stanley Druckenmiller, il fondatore di PayPal Peter Thiel e fondi come Fidelity e JP Morgan. Le vendite arrivano dopo che il titolo è cresciuto di oltre il 1.000% dal 2022, portando il valore di mercato a sfiorare i 5.000 miliardi di dollari a ottobre 2025.\n\nLe motivazioni sono diverse: alcuni vogliono incassare profitti record, altri – come Michael Burry, l'investitore de La grande scommessa – temono che il settore sia sopravvalutato. Le notizie delle vendite hanno pesato sul titolo, che lunedì 17 novembre è sceso fino al 3% a Wall Street ed è calato di oltre il 10% rispetto ai massimi recenti. Per poi recuperare dopo la presentazione dei conti del terzo trimestre. Conti incoraggianti, perché Nvidia ha battuto le attese.\n\nChi è che vende Nvidia e perché lo fa?\n\nL'ultimo a uscire è stato proprio Thiel, che lunedì 17 novembre ha depositato i documenti alla Sec, l'ente che regola i mercati finanziari negli Stati Uniti, rivelando di aver liquidato tutte le 537.742 azioni del suo fondo Thiel Macro, una partecipazione che valeva circa 100 milioni di dollari e rappresentava il 40% del portafoglio. Ha spostato i soldi su Microsoft e Apple, tagliando anche Tesla del 76%.\n\nThiel non è un investitore qualunque. Oltre ad aver fondato PayPal, la piattaforma che ha rivoluzionato i pagamenti online, è stato il primo investitore esterno di Facebook mettendo 500mila dollari nella startup di Zuckerberg, una delle scommesse più fortunate della Silicon Valley. Ha poi creato Palantir, azienda di software per l'intelligence che lavora con governi e grandi aziende. La sua fortuna è stimata in 16,3 miliardi di dollari. Aveva iniziato a comprare Nvidia solo nel quarto trimestre 2024, quindi si trattava di una posizione recente che però era rapidamente diventata centrale nel suo portafoglio. La scelta di uscire completamente dopo meno di un anno è significativa, dato che ad agosto 2024 aveva dichiarato che Nvidia era il vero vincitore dell'intelligenza artificiale, dato che incamera l'80-85% dei profitti del settore. Tuttavia aveva anche avvertito che questa concentrazione era \"molto strana\" e rischiosa.\n\nLa vendita di Thiel si inserisce in un movimento più ampio. Prima di lui, SoftBank Group, il gigante giapponese guidato da Masayoshi Son, ha venduto tutto in ottobre 2024 per 5,83 miliardi. Son, diventato uno dei maggiori sostenitori dell'intelligenza artificiale parlando di una nuova rivoluzione industriale, ha spiegato che il denaro serve per un investimento ancora più grande: 22,5 miliardi in OpenAI, la società che ha creato ChatGPT. Non è la prima volta: SoftBank aveva già comprato Nvidia per 4 miliardi nel 2017 per poi vendere tutto nel gennaio 2019, prima del boom dell'AI. Nonostante l'uscita, il gruppo mantiene legami con il settore attraverso Arm Holdings, la società britannica che progetta architetture di chip per miliardi di smartphone, di cui SoftBank è azionista di maggioranza.",
  "authors": [
    "Riccardo Piccolo"
  ],
  "url": "https://www.wired.it/article/nvidia-azioni-peter-thiel-softbank-capitalizzazione-investimenti/"
}