{
  "title": "Wild Cherry review – this fun, trashy thriller seems to have spent most of its budget on clothes",
  "text": "That its ultra-wealthy characters live in a place called Richford Lake tells you almost everything you need to know about the glossy new thriller Wild Cherry. Yes, it’s another entry in the increasingly popular eat-the-rich genre. Yes, it has shades of The White Lotus and everything starring Nicole Kidman for the past five years. Yes, most of the budget has gone to wardrobe, with any woman over the age of 30 apparently allergic to synthetic fibres and every actor seemingly cast primarily for her ability to carry off swagged silk and cashmere in warm beige tones. Yes, you should have bought shares in the colour camel years ago but it’s too late now. Yes, the insular community and soapy vibe suggests an ancestry that includes Desperate Housewives and Gossip Girl. Yes, in short, it’s trash with pretensions. But trash with pretensions is as fun a way to spend the long winter evenings as any, so why not set your brain aside and enjoy it?\n\nWe begin with the obligatory the-future-as-prelude scene, which here involves four women – two older, two younger – standing in a well-appointed bathroom in their underwear scrubbing blood off their hands. We then flashback to begin the six-part journey to finding out what the jolly heck is going on.\n\nThe four women are a brace of mothers and their daughters. One mother is Juliet. She is played by Eve Best with unfitting reserve in the kind of production that needs a wholehearted “to hell with Ibsen!” attitude from all to make it work. Juliet is described by the arch-with-as-yet-nothing-to-be-arch-about voiceover as “old money”, and therefore deeply concerned with reputation and appearance, even though in real life these are very much the province of new money, which has no breeding to back it up. Even – no, especially – in a soap, getting this kind of thing right matters.\n\nAnyway, Juliet is also a supermum and top cashmere-er, so she is in the middle of launching her first book, on how to be the perfect parent and raise teens “who can be your best friends”. It is a lead title for Hubris Books, an imprint of Come On Now Publishing. As she finishes a publicity interview and is getting the glad-eye from the young sound man, she is called to her daughter’s (posh, private, all-girls) school to be told that the 15-year-old Allegra (Amelia May) and her best friend, Grace (Imogen Faires), were spotted in a now-deleted “lewd video” shown by a fellow pupil to a teacher. Grace’s mother, Lorna (Carmen Ejogo), Juliet’s best friend despite being a self-made businesswoman instead of a lord’s offspring, has been called into the meeting, too. She is shocked, but while she is reeling Juliet goes on the attack, warning the headteacher not to “sex shame” teenage girls and reminding him of the sizeable donations her family has made to his little educational establishment over the years. The problem goes away.\n\nOr does it? It turns out that, unbeknown to their parents, Grace and the embryonic influencer Allegra have been adding a touch of Mean Girls and Heathers to the ancestral mix. They have built an app that centres on “the catalogue”, eventually revealed to be an array of titillating shots taken of and by themselves and their friends (male and female, but mostly female), upon which paid subscribers to the app can vote. The desire to make it to the top of the hotness league will result, I am sure, in a variety of very sensible decisions by all.\n\nMeanwhile, the adult world is not overrun with good ideas either. Juliet goes off and bangs the sound man, allowing Allegra and Grace (on a sleepover) to sneak out to a party held at the house of an older, male content creator with whom Allegra imagines a burgeoning business relationship. A newcomer to the neighbourhood, Gigi (Nicôle Lecky, who is also Wild Cherry’s show runner), is trying to befriend all the horrible women there – who dismiss her either as a gold digger (she is the second wife of a recently divorced rich prick) or vulgar entrepreneur – and ends up standing in the middle of her indoor pool in despair.\n\nClearly, nothing is going to end well, but it hardly matters. There are signs along the way that Wild Cherry wants to be working out big questions – it gestures at the intersection between race and class prejudice, and it aims to criticise the privilege money buys while it salivates over its material trappings – but it would have done better either to commit to that or to developing a proper rich froth that would put it firmly into the escapist nonsense category. As it is, it remains just fun enough for the run.",
  "authors": [
    "Lucy Mangan"
  ],
  "url": "https://www.theguardian.com/tv-and-radio/2025/nov/15/wild-cherry-review-thriller-fashion-bbc-one-iplayer"
}