{
  "title": "Meta wins antitrust trial as judge denies that it’s a monopoly",
  "text": "In Brief\n\nAfter five years, Meta has emerged victorious from a U.S. Federal Trade Commission (FTC) lawsuit over its acquisitions of Instagram and WhatsApp.\n\nIn an opinion released Tuesday, U.S. District Court Judge James Boasberg wrote that the FTC did not prove that Meta was violating antitrust law when it bought Instagram for $1 billion in 2012, and WhatsApp for $19 billion in 2014.\n\nThe FTC did manage to surface evidence showing that Meta — then called Facebook — was concerned about Instagram’s fast growth and the competition it could pose.\n\n“One way of looking at this is that what we’re really buying is time,” Mark Zuckerberg wrote in February 2012, per internal Facebook emails that surfaced during the trial. “Even if some new competitors springs [sic] up, buying Instagram, Path, Foursquare, etc. now will give us a year or more to integrate their dynamics before anyone can get close to their scale again.”\n\nBut Judge Boasberg was not ruling on whether Meta had acted as a monopoly back then, but rather, if it is currently a monopoly. Boasberg pointed to apps like TikTok as evidence that Meta has competition.\n\n“The landscape that existed only five years ago when the Federal Trade Commission brought this antitrust suit has changed markedly,” Boasberg wrote in his memorandum opinion. “While it once might have made sense to partition apps into separate markets of social networking and social media, that wall has since broken down.”",
  "authors": [
    "Amanda Silberling",
    "Sarah Perez",
    "Ivan Mehta",
    "Aisha Malik",
    "Lauren Forristal",
    "Rebecca Bellan",
    ".Post-Authors-List__Authors --Font-Size Var",
    "Align-Items Center Display Flex Gap Var",
    ".Post-Authors-List__Authors .Post-Authors-List__Author-Thumbs Display Flex Flex-Shrink Margin Padding .Post-Authors-List__Authors .Post-Authors-List__Author-Thumbs Li List-Style None Margin-Left Margin-Top Important .Post-Authors-List__Authors .Post-Authors-List__Author-Thumbs Li First-Child Margin-Left .Post-Authors-List__Authors .Post-Authors-List__Author-Thumbs .Post-Authors-List__Author-Thumb Background-Color Var",
    "Border Solid Var --Wp--Custom--Color--White"
  ],
  "url": "https://techcrunch.com/2025/11/18/meta-wins-antitrust-trial-as-judge-denies-that-its-a-monopoly/"
}