{
  "title": "‘Oh my God, this is our Tanzania’: CNN investigation shows police shooting protesters, signs of mass graves",
  "text": "EDITOR’S NOTE: This story contains disturbing images.\n\nIn the chaotic aftermath of Tanzania’s disputed presidential election last month, police and gun-wielding men on patrol shot at groups of protesters, many of whom appeared unarmed or were holding only rocks and sticks, a CNN investigation has found.\n\nGeolocated videos from the scenes, audio forensic analysis of the shots fired and first-hand accounts from witnesses and victims document the brutality unleashed on young demonstrators following the re-election of President Samia Suluhu Hassan – who claimed she won with 98% of the vote on October 29 after barring her chief rivals from the presidential race.\n\nVideos verified by CNN also support witness reports about the deadly toll of the post-election crackdown, showing morgues overflowing with scores of bodies.\n\nAdditionally, satellite images and videos show recently disturbed soil consistent with reports of mass graves in the Kondo cemetery, north of the East African country’s main city of Dar es Salaam. Two human rights groups and witnesses interviewed by CNN say the bodies of protesters killed in the past few weeks have been buried there.\n\nCNN finds evidence Tanzanian police killed protesters 5:04 • Source: CNN CNN finds evidence Tanzanian police killed protesters 5:04\n\nAfter the election, authorities imposed a curfew and an internet blackout as people gathered in the streets to contest the exclusion of Hassan’s rivals from the polls. The main opposition party leader, Tundu Lissu, has been in custody since April, charged with treason.\n\nWhen internet connectivity was partially restored a week later, police barred the sharing of photos and videos “that cause panic.” Government officials initially denied any killings of protesters had occurred. Last week, however, the president acknowledged there had been some casualties, but she did not release any figures.\n\nHassan on Thursday launched a commission to investigate the unrest, but also suggested that protesters were paid. Her government and the police did not respond to CNN’s requests for comment.\n\nThe crackdown on protesters has marred the reputation of Tanzania as a stable democracy that attracts millions of tourists every year.\n\nThe United Nations Human Rights Office, based on information from multiple sources in the country, suggested hundreds of protesters and other civilians were killed, with an unknown number injured or detained.\n\nWith the help of open-source investigator Benjamin Strick, CNN reviewed dozens of videos and images of civilians lying dead from gunshot wounds, as well as images of bodies overflowing morgues at the Sekou-Toure Regional Referral Hospital in Mwanza and the Mwananyamala Hospital in Dar es Salaam.\n\nCNN verified videos of bodies covering the floor inside the Mwananyamala Hospital in Dar es Salaam. Obtained by CNN\n\nCNN also geolocated videos of bodies piled up outside Sekou-Toure Regional Referral hospital in Mwanza. Obtained by CNN\n\nIn Mwanza, photos and videos geolocated by CNN outside the hospital show at least 10 bodies piled up on a stretcher.\n\nOne doctor, who treated victims of gunshot wounds over the course of four days there and requested anonymity for fear of reprisals, said the dead were brought to the morgue by police “until it was full.” After that, he said, they “piled” the bodies outside the hospital.\n\nMany victims, both dead and injured, were young men, the doctor said. “All had sustained gunshot wounds on different parts of the body. Especially the head, abdomen, chest, lower limbs. Badly wounded patients with varying degrees of consciousness,” he told CNN.\n\nIn Dar es Salaam, a video geolocated by CNN at the morgue of Mwananyamala Hospital shows dozens of bodies covering the floor, piled up on top of each other. Tanzania’s Ministry of Health denied the authenticity of the footage in a statement on social media. The ministry did not respond to CNN’s request for comment.\n\nA woman, who requested anonymity out of concern for her safety, told CNN she saw the video from the morgue and recognized the body of her brother, who was killed during the protests on the balcony of his own home. “We’ve been looking for his body at every mortuary in Dar es Salaam since 1st November, but he was not there,” she told CNN.\n\nAccording to witnesses, demonstrations broke out shortly after polls opened on October 29 and continued for a few days after in some locations. In one violent encounter analyzed by CNN, Tanzanian police in the city of Arusha fatally shot two protesters who appeared to be no threat to them – a pregnant woman who was shot in the back while running away, and a young man who was shot in the head.\n\nAt 3:27 p.m. the day of the election, a group of young men who were gathered at an intersection, were confronted by about 10 armed police officers. One protester appears to be seen throwing a rock at them.\n\nObtained by CNN\n\nTwo minutes later, the scene becomes frantic, according to a video circulating on social media which Strick first geolocated. CNN obtained the original footage and confirmed his findings by analyzing its metadata.\n\nIn the video, demonstrators are seen running down the road amid bursts of gunfire. One woman wearing a lavender top and a hat, holding a stick and a rock, is fatally shot in the back as she’s running with other protesters. She drops to the ground, blood coming out of her blouse. Other demonstrators attempt unsuccessfully to help the woman to her feet and administer aid.\n\nIn another video, a woman can be heard asking the mortally injured woman to wake up. The protesters, in distress, can be heard calling for help.\n\nObtained by CNN\n\nA forensic analysis of the scene shows that the woman was shot from behind: a hole in the blouse, the entry point of the bullet, can be seen shortly after a gunshot is heard. Moments later, the woman drops the stick and stone, and collapses.\n\nSources close to her family confirmed to CNN that the woman was three months pregnant, leaving behind a husband and two children.\n\nRob Maher, a professor of electrical and computer engineering at Montana State University who specializes in forensic audio analysis, examined audio extracted from the original video of the shooting.\n\nBased on the time gap between the “crack” sound, the ballistic shockwave of the bullet and the “boom” of the muzzle blast, Maher established the distance between the firearm and microphone of the device that filmed the video to be about 112 meters (367 feet).\n\nA few minutes later, a video filmed from the other side of the road shows a protester dressed in black walking towards the police position at the top of the road. Another protester throws a rock, a shot rings out and a different man with a red shirt is seen collapsing, with a visible head injury. The video was first geolocated by Strick, the open-source investigator, and verified by CNN.\n\nAnother video of the encounter shows the man lying in a pool of blood, still breathing. “Oh my God, this is our Tanzania,” repeats the person filming, along with a Muslim prayer. The man was visible in earlier footage, holding a rock, but he didn’t appear to have anything in his hands when he was shot and killed.\n\nA protester is seen walking towards a police position at the top of the road in Arusha, on October 29, 2025. Obtained by CNN\n\nThe victim was at least 95 meters away from police at the time he was shot, according to an audio analysis by Maher. Both this distance and the one calculated in the video of the shooting of the pregnant woman correspond to the visible location of police at the top of the road, according to CNN’s analysis.\n\nAn eyewitness to both shootings told CNN the Arusha protest had started peacefully until police started firing at them. The witness saw the pregnant woman being shot in front of her.\n\n“I tried to call for help from others to pull her (the pregnant woman) aside because she was still breathing but shots kept getting fired and it hit one young man on the head. It was the most inhumane thing ever,” the witness said. “Someone’s mother died while I and others watched.”\n\nA widespread crackdown\n\nIn other parts of the country, videos have surfaced on social media of security officers and of armed men in plain clothes – who locals suspect are police – pursuing protesters and opening fire on them. CNN has geolocated several videos showing what appear to be plainclothes officers getting off white pick-up trucks in Dar es Salaam and opening fire in the backstreets of civilian areas.\n\nA series of drone videos filmed in the Segerea area of the city, along Tabata Road, shows protesters fleeing and taking shelter in courtyards of a side street, as a white pick-up truck approaches. Armed individuals are then seen getting off the truck and opening fire repeatedly as they roam around a civilian area.\n\nPeople protest in the streets of Arusha, Tanzania, on election day, Wednesday, October 29, 2025. (AP Photo) AP\n\nThe armed men were filmed operating alongside uniformed police officers in the Ubungo area of Dar es Salaam.\n\nViral Scout Management, a local sports management consultancy, released a statement on X saying that seven young soccer players under their contracts were shot and killed at their homes during the protests. The management firm later posted on X that the bodies of six of them could not be located.\n\nThe woman who recognized her brother in the Mwananyamala morgue footage told CNN the family had not located the body of another of her brothers reportedly shot dead at home in the Mara region.\n\nAllegations of mass graves have emerged in the past few weeks, with Chadema, the main opposition political party, accusing police of disposing of hundreds of unknown bodies at undisclosed locations.\n\nA coalition of Tanzanian human rights groups and two local sources told CNN that some of the bodies of the protesters killed after October 29 in Dar es Salaam were buried in a mass grave at the Kondo cemetery in Kunduchi, north of the city.\n\nObtained by CNN\n\nHigh-resolution satellite imagery from Planet Labs and Vantor taken on November 9 and November 15 shows disturbed ground in a barren plot of land 60 meters from the edge of existing graves. Further analysis of Sentinel-2 satellite imagery shows that the digging was done there between November 2 and November 5.\n\nA video filmed on the ground after the soil was disturbed, and obtained by CNN, shows a series of spots of sandy, overturned soil, that weave between patches of vegetation. The exact reason for the disturbance is unclear. In one area of the fresh soil, what appear to be roots stick out, and atop another is what appears to be a couple of articles of fabric.\n\nCNN’s Oliver Sherwood contributed to this report.",
  "authors": [
    "Gianluca Mezzofiore",
    "Larry Madowo",
    "Florence Davey-Attlee"
  ],
  "url": "https://www.cnn.com/2025/11/21/africa/tanzania-police-shooting-protesters-deadly-election-intl-invs"
}