{
  "title": "Donald Trump takes aim at more water and energy efficiency standards",
  "text": "is a senior science reporter covering energy and the environment with more than a decade of experience. She is also the host of Hell or High Water: When Disaster Hits Home , a podcast from Vox Media and Audible Originals.\n\nPosts from this author will be added to your daily email digest and your homepage feed.\n\nDonald Trump signed a presidential memorandum Friday afternoon directing the Department of Energy to “consider using all lawful authority to rescind” or weaken regulations for water and energy efficiency for dishwashers and washing machines. The action also includes water use standards for showers, faucets, toilets, and urinals.\n\nIt closes out a week of attacks on policies meant to save Americans money by incentivizing manufacturers to make products that save water and energy. Earlier in the week, CNN and E&E News reported that the Trump administration would shutter the Energy Star program as part of a “reorganization” planned at the Environmental Protection Agency.\n\nEnergy Star certifies products for energy efficiency, allowing consumers to choose the most energy-efficient home appliances by spotting the recognizable blue Energy Star label. The rules President Trump is targeting now are actually consumer protections, meant to ensure that any customer can purchase something that meets reasonable efficiency standards.\n\n“Congress enacted these laws, the president can’t just decide that they’re going to go away.”\n\nA White House fact sheet says the Secretary of Energy should work with the Office of Legislative Affairs to make recommendations to Congress on any water pressure “or related energy efficiency laws” that ought to change or be repealed altogether.\n\nIt also says the Secretary of Energy should pause enforcement of the rules mentioned in the memorandum until they’re rescinded or revised. “The Federal Government should not impose or enforce regulations that make taxpayers’ lives worse,” the presidential memorandum says.\n\n“It’ll only raise costs for consumers to get rid of these standards, if they get rid of these standards,” says Andrew deLaski, executive director of the Appliance Standards Awareness Project. “Congress enacted these laws, the president can’t just decide that they’re going to go away.” deLaski also notes that while the White House says it wants to get rid of “useless water pressure standards,” the rules mentioned in the memorandum actually target efficiency standards since water pressure depends on the plumbing system connected to the device.\n\nUpdate, May 10th: This story has been updated with more information about water pressure from Andrew deLaski.",
  "authors": [
    "Justine Calma"
  ],
  "url": "https://www.theverge.com/news/664670/water-energy-efficiency-standards-trump-dishwasher-washing-machine-showerhead-toilet"
}