{
  "title": "Battling Big Pharma: A Conversation with Mark Cuban",
  "text": "Transcript\n\nThank you so much for being here.\n\nI don't think our next guest needs much of an introduction,\n\nbut I've been given one, so I'm excited\n\nto welcome entrepreneur co-founder of Cost Plus Drugs,\n\nMark Cuban to the big interview stage\n\nfrom selling garbage bags door to door at age 12\n\nto founding a lot of groundbreaking tech companies,\n\nMark has always been ahead of the curve.\n\nIt's really no surprise that\n\nwith his latest venture Cost Plus Drugs,\n\nhe's also ahead of the curve.\n\nHe is working to demolish\n\nand rebuild the prescription drug industry.\n\nAnd that's what we're gonna talk about today.\n\nEveryone, please welcome Mark Cuban.\n\n[audience cheering]\n\n[upbeat music]\n\nMark, thank you so much for being here.\n\nI liked how you changed fuck up to demolish, you know?\n\nIt's a family friendly event.\n\nOh, then I should leave right now.\n\nThis is just like Shark Tank.\n\nSo I asked a friend here, actually, Sean, earlier today,\n\nI said, what should I, what should I kick off\n\nMark Cuban with?\n\nWhat should I say?\n\nAnd he said,\n\nwhy don't you give him a belated\n\ncongratulations for Klay Thompson.\n\nOh, there you go, Klay's killer.\n\nYeah, we thank everybody here for today.\n\nYeah, you're lucky that you're welcome in the Bay.\n\nI know.\n\nAfter that one actually.\n\nTrust me, I look over my shoulder.\n\n[group laughing]\n\nAll right, so let's talk about Cost Plus.\n\nWhen you actually,\n\nwhen our issue came out in which you're prominently\n\nfeatured, one thing I heard from people was,\n\nI didn't know Mark Cuban was in the pharmaceutical business.\n\nYou've been doing this for a while though.\n\nWhy did you get into pharma?\n\nDoes anybody here like their healthcare?\n\nDoes anybody here think the healthcare industry works well?\n\nThat's why, I mean,\n\nI literally got a cold email from a Dr. Alex Vishinsky\n\nwho wanted to start up a compounding pharmacy,\n\nwhich actually makes drugs that are on, in this case,\n\non short supply, that are on the shortage list.\n\nAnd I'm like, you're thinking too small.\n\nAnd that was right around the time Martin Shkreli\n\nwas going to jail.\n\nSo he was in the news\n\nand I was like, how can this one guy take control\n\nof this drug and jack up the price that dramatically?\n\nAnd so I'm like, let me just take a look.\n\nAnd when you look at the pharmaceutical industry, back then,\n\nit was very obvious that it was opaque.\n\nThere was no transparency at all.\n\nI mean, think about it.\n\nIf you get a prescription from your doctor,\n\nwhat's the first thing they ask you?\n\nNot can you afford it?\n\nIt's what pharmacy do you use?\n\nAnd that's it.\n\nAnd then you've gotta deal with the fear\n\nof can you afford it or what's the impact?\n\nWhat's the copay, what's the deductible?\n\nAll those things.\n\nSo we said, okay,\n\nlet's start a company called costplusdrugs.com\n\nand let's make it transparent.\n\nAnd it seems so simple, but the impact has been so dramatic.\n\nSo if you go to costplusdrugs.com\n\nand you put in the name of the medication\n\nand we've grown from a 111 to 2,500\n\nand we have more to go, you'll, if we carry it,\n\nthe medication pops up and you'll see our actual cost.\n\nSo we'll show you what we pay for it,\n\nwe mark it up 15%, if you want it delivered,\n\nand then there's a $5 pharmacist fee that's included\n\nbecause you have to have a pharmacist review it\n\nand then $5 to ship it to you.\n\nOr you can, now we have an affiliate network\n\nwhere you can pick it up at a local pharmacy just\n\nby showing our price, our cost, and only marking up 15%,\n\nwe were able to take down the price\n\nof drugs like Imatinib chemotherapy,\n\ndrug, MS drugs from like 2000 plus dollars a month\n\nto $21 a month, $35 a month.\n\nSo the impact has been insane.\n\n[audience applauding]\n\nWhat are some of the common drugs people\n\nmight recognize that you're manufacturing and selling?\n\nI mean, you know, Imatinib is probably\n\nthe most dramatic example.\n\nI don't, I'm not the pharmacist,\n\nremember all the funky names.\n\nBut people with MS as an example, we are able to take,\n\nthere's a drug called Daroxadopa that\n\nI'll give you the, I'll give you a scenario.\n\nA friend of mine was in this horrific car accident\n\nand he needed to take this drug and lost his insurance.\n\nEmailed me and said, okay, they're telling me it's going\n\nto be $10,000 every three months.\n\nI'm like, okay, Landon, I'll check into it.\n\nTurns out we carried it\n\nand when we carried it back then it was $64 a month\n\nfrom 10,000 to 64 times three.\n\nAnd now it's in the $20.\n\nBecause as our volumes go up,\n\nbecause we do everything on a straight markup,\n\nour costs go down.\n\nAnd literally we have lowered the price\n\nof a medication every single weekday\n\nfor the past almost 18 months.\n\nAnd so if you think about it,\n\n[audience cheering]\n\nbut the most dramatic thing we did was unintentional.\n\nWe published our entire price list.\n\nAnd so there's places, if you really looked hard, you can go\n\nand find a price for a medication that you might need.\n\nBut there's no place where the\n\ncompany published their entire price list.\n\nAnd we did that for all 2,500 drugs.\n\nAnd what's happened now is that researchers are able to use\n\nthat price list to compare to what the government is paying\n\nfor things to compare to what states are paying.\n\nAnd if you have a company that self insures\n\nto start the process of allowing you to compare\n\nwhat the company pays for the medications\n\nthat their employees and the you know, the people\n\nthat they cover, the population, they cover what they pay.\n\nAnd that has just been a game changer.\n\nI mean, we've had researchers from Vanderbilt, Harvard,\n\nall these different places say, you know, if,\n\nyou know Medicare bought these nine drugs\n\nfrom Cost Plus Drugs, just nine drugs\n\nwould save $3.6 billion a year if they\n\nbought these 11 drugs that, you know, they might,\n\nit's $6.3 billion a year.\n\nI mean, it's insane.\n\nAnd literally, you know, for so many folks out here\n\nin the Valley,\n\nprobably the easiest way to raise money\n\nand put cash in your own pocket is\n\nto change your healthcare plan.\n\nAnd in particular, your pharmacy benefit manager.\n\nBecause the crux of this problem\n\nand the opacity of the industry,\n\nthere are three pharmacy benefit managers that control, give\n\nor take 80% of the market.\n\nSo these are basically, these are the middlemen?\n\nThe middlemen, yeah.\n\nYep.\n\nAnd literally, they don't want you to know what you pay.\n\nIf you work with a self-insured company\n\nand they're working with one of the big three one,\n\nlet's just say the biggest PBMs,\n\nyou're getting ripped off, guaranteed.\n\nThe quickest way is to raise money if you have over\n\n100 employees and self-insure is\n\nto change your healthcare program.\n\nAnd in particular, pharmacy benefit manager,\n\nthat's immediate cash in the bank.\n\nAnd you know, companies don't really realize that.\n\nAnd that's why it's been so successful.\n\nBecause the next question always is how did this happen?\n\nAnd the reality is there's 155 million people covered\n\nby self-insured employers.\n\nAnd it's not the core competency of a CEO\n\nto understand all their healthcare benefits.\n\nYou just don't, I mean, like.\n\nYou could ask a couple of them here\n\non stage today if you want.\n\nHappy to.\n\nYeah, you should.\n\nBrian Chesky, let's talk to him about health.\n\nYou know, and you say.\n\nYeah, Jensen Wong,\n\nI'm sure he wants to talk about health plans.\n\nYeah, Jensen, you know, just say, would you?\n\nNo, seriously.\n\nAsk them, why are you dealing with one\n\nof the big pharmacy benefit managers and ask them, is that,\n\nbecause here's what's happening that's crazy\n\nthat they're gonna be, here's why,\n\nthey're starting to understand there's a law called\n\nERISA that requires the employer now\n\nto take on their fiduciary responsibility for the cost\n\nand care of all the lives they cover for as employers.\n\nAnd J and J and Wells Fargo just got sued\n\nand they're gonna lose.\n\nWhich effectively means\n\nthat every single major self-insured employer is going\n\nto get sued in a class action suit.\n\nAnd so if any of you fall into that trap, get ready,\n\nthey're coming.\n\nBut the bigger point again, is\n\nnow there's transparency for medications.\n\nAnd you can cut the cost,\n\nwhether you're a little company or a big company.\n\nAnd if you have a high deductible or you\n\nor you're uninsured, always check the pricing,\n\n'cause otherwise you're gonna get ripped off.\n\nSo you've made it pretty clear you're not doing this\n\nfor altruistic reasons.\n\nYou're running a business.\n\nYou want this to be a profitable business.\n\nI think people hear about what you're doing\n\nand they think, oh, it's altruistic.\n\nLike it's because you're doing something good.\n\nWell, I could make more money.\n\nRight?\n\nBut, what you said in.\n\nSeriously, but we're a public benefit corporation,\n\nbut how much fucking money do I need?\n\nYou know, I'm not trying to land on Mars.\n\nYou know, it's just,\n\n[group laughing]\n\n[audience cheering]\n\nand not to take anything away from him\n\nfor trying, more power to him.\n\nBut the reality is, I mean, at this point in my life,\n\nit's just like, more money, fuck up the healthcare industry?\n\n[group laughing]\n\nThat was, that was the word I left out of the intro.\n\nYou guys.\n\nF-U-C-K the healthcare industry.\n\nBut how did you, but I guess\n\nwhat I'm getting at is like, how did you decide on\n\nthat being the industry you wanted to go after?\n\nBecause it was so obvious that it would be easy to change\n\nthat it was insane.\n\nWhat had happened in the past is I dug in more,\n\nand we've been in business now, we started shipping,\n\nyou know, two and a half years ago.\n\nAnd you know, now we have millions of people\n\nwhose lives we've changed.\n\nBut you start to realize that\n\nwhat the incumbents would do is they'd go in\n\nand just buy companies.\n\nSo anybody that was a threat, they'd just buy 'em.\n\nAnd one after another, we'd go into situations\n\nwhere we're talking to employers or whatever,\n\nand they're saying, yeah, we were gonna do\n\nbusiness with this company.\n\nAnd they were trying to cut the cost,\n\nbut then so and so bought 'em.\n\nAnd like I said that's just not in the cards for us.\n\nLet's talk about tariffs.\n\n[Mark] Tariffs.\n\nTariffs.\n\n[Mark] Okay.\n\nSo President-elect Donald Trump is.\n\nI know who he is, yeah.\n\nYou heard of him?\n\n[group laughing]\n\nOkay, so he said that he's planning\n\nto impose tariffs Canada, Mexico, China day one.\n\nWe don't know exactly how that's gonna shake out yet,\n\nbut we do know that this could affect the drug industry.\n\nI mean, he's referring often to the illegal drug industry.\n\nBut also this could affect\n\nthe pharmaceutical business.\n\nHow is this potentially going to affect Cost Plus Drugs?\n\nI mean, if it's just China, it won't impact us at all.\n\nWhy is that?\n\nI mean, because we had,\n\n'cause I checked, we had 16 drugs that we bought\n\nthat were shipped from China\n\nand we're changing that to a different manufacturer.\n\nSo the Chinese tariffs won't impact us at all.\n\nAnd now we do get drugs from India.\n\nSo we'll see what happens there.\n\nBut if there are tariffs, our, we only have 15%.\n\nAnd so, you know, we'd have to pass them through.\n\nPass them through meaning the cost goes to the consumer?\n\nRight, the cost would go up 'cause our cost would go up.\n\nOkay.\n\nHave you talked to Donald Trump about this?\n\n[group laughing]\n\nSure, I was like, yo, what's up bro?\n\n[group laughing]\n\nNo, I have not.\n\nYou have not?\n\nIf the conversation were to occur,\n\nif you were invited to have,\n\nwhat's your priority?\n\nWhat's the first thing you would say?\n\nI would say don't fuck it up.\n\nIt's working.\n\nYou know, I mean, I don't look, there's no point in trying\n\nto guess what he's going to do and speculate,\n\n'cause we don't know, I don't think he knows yet.\n\nI think he's trying to, you know, he plays it by feel\n\nand it'll go where he goes and we will react accordingly.\n\nBut I think, you know, he's obviously very cognizant of PR\n\nand the idea that medications from the cheapest provider are\n\ngoing up and it means more\n\npeople aren't able to afford it.\n\nI really don't think he's going in that direction, you know,\n\nI really think he'd make an exception.\n\nYou were clearly a vocal supporter\n\nof Kamala Harris for president.\n\nWhen you look back at?\n\n[audience applauding]\n\nYou see how good a job I did?\n\n[group laughing]\n\nWhen you look at, when you look back at this election\n\nseason, is there anything\n\nthat you think you would've done differently\n\nor taken a different approach in terms of\n\nhow you were communicating?\n\nNot really, I mean, I'm not the candidate.\n\nI did the best I could to try to convey, you know,\n\nwhat she was doing for business people,\n\nsmall business, you know.\n\nAnd I think, you know, the message was good,\n\nbut, you know, they weren't voting or not voting for me.\n\nYeah.\n\nOne of the things\n\nthat we talked about when we did the big interview in the\n\nmagazine was crypto.\n\nAnd, you know, you feel pretty strongly\n\nand you're in favor of crypto\n\nand you were in favor of it not being villainized.\n\nAnd you felt as though that's\n\nwhat Gary Gensler and the SEC had been doing.\n\nAnd I think it really hurt her.\n\nSo you do?\n\nYeah, I really do.\n\nSo what's interesting is, because my response to you was,\n\nisn't that sort of a fringe issue?\n\nAnd you said no, but in a?\n\nHow many people here own crypto?\n\nAnd so when the price go, when crypto go up,\n\neverybody smile, you know?\n\nAnd if, when, you know, if you're,\n\nparticularly if you're a young male\n\nand you're not part of the traditional banking system,\n\nyou know, when I was a kid, open up a bank account,\n\nopen up a savings account, now download an app, right?\n\nRobinhood or Coinbase buy crypto\n\nbecause your friends are buying crypto,\n\nyou understand it more.\n\nMaybe you buy stocks,\n\nbut more kids were getting into crypto\n\nand that was their net worth.\n\nAnd when 40%, according to Pew research\n\nof young men own crypto or have owned crypto,\n\nand the guy you're connected to,\n\nGary Gensler is basically telling you to roll over\n\nand let me stick a bike handle in your ass that just like.\n\nA what?\n\nYeah, I was gonna say worse,\n\nbut I was just going, yeah, that was stupid.\n\nSorry, but basically you say.\n\n[Host] Did you say a bike handle?\n\nYeah, forget it.\n\n[group laughing]\n\nI'm sure that's something Elon will tweet about at me.\n\nBut in any event,\n\nbut Gary Gensler did not make it good\n\nfor people who own crypto.\n\nAnd I think that truly hurt Kamala\n\nand I even said it, I said it to her, I said it to her team,\n\nI said it publicly that Gary Gensler could lose the election\n\nfor her, and you know, when there's what,\n\n240,000 votes across seven swing states,\n\nand the number of men, young men\n\nwho voted against her was much higher than expected.\n\nI don't think it's a stretch to connect the two.\n\nWhat happens to crypto now?\n\nI think, you know, it's, you know, the laissez-faire,\n\nit's whatever comes, comes, you know.\n\nBut it was interesting when he talked about putting, if any\n\nof the BRICS countries stopped using the dollar\n\nas the de facto reserve currency,\n\nthat he was gonna put tariffs on then,\n\nwhich is the antithesis of what people who gave him a lot\n\nof money and support Bitcoin think they, you know,\n\nthey think a big part of the value\n\nof Bitcoin is the fact that fiat currency is weak\n\nand the Federal Reserve weakens it\n\nand it doesn't have a great future.\n\nSo here's Bitcoin to save the day.\n\nSo it'll be interesting to see if he follows through on that\n\nand what the Bitcoin Maxis think about it.\n\nDoes, I mean, is this a moment where Bitcoin\n\nand other crypto currencies actually become more legitimate\n\nor less under?\n\nIt's not about legitimate, it's like gold, right?\n\nI mean god, it's not based off the supply\n\nand demand on jewelry, right?\n\nPeople see it as an option in the event of, you know,\n\nthe economy going down or something bad happening.\n\nBut people aren't gonna walk around with gold bars.\n\nOh look, he owns gold.\n\nBam, now I own gold.\n\nBam, right?\n\nWhat are you gonna do it?\n\nLet me slice you\n\noff a little piece of gold.\n\nYou know?\n\nAnd no people look at it, you know,\n\nFort Knox has got a ton of gold that the United States owns,\n\nyou know, and it's supposed to be an underlying asset\n\nor commodity for the dollar in some respects, right?\n\nTo buy and sell and people look at Bitcoin\n\nas a better version of gold.\n\nAnd I agree with that, I think it's a great store of value.\n\nIt's easier to buy and sell.\n\nYou can fractionalize it, you can buy things,\n\nyou can transfer it internationally.\n\nAnd so I think it has more value than gold.\n\nSo I don't think you have to legitimize it,\n\nbut in terms of the price, you know, I own enough\n\nthat I really want it to go up.\n\nBut it's just supply and demand.\n\nHow much do you own?\n\nA lot.\n\nGlad we got that out of the way.\n\nWe have 10 minutes left\n\nand there's so much I want to ask you about.\n\nI feel like we could talk about crypto the whole time.\n\nI also wanted to ask you about AI,\n\nbut I think we're, one thing I'll say about AI,\n\nand then we should move on from it into the platforms,\n\nis that when, when we spoke for the big interview,\n\nyou asked me,\n\nwhat would you trust more in an environment if you like,\n\nyou weren't able to see, you said a, what is it\n\na self-driving car or a seeing eye dog?\n\n[Mark] Right, right, right.\n\nAnd I said a Waymo and you said, I trust the dog.\n\nAnd I just wanna say,\n\nwhile you're here in San Francisco, you should take a Waymo.\n\nNo, I want to actually.\n\nYeah, so if someone here, if anyone would like\n\nto pull up their app and get a Waymo ride\n\nfor Mark Cuban on this.\n\nI can do that, I know how to download the app.\n\nHe'll pay for it.\n\n[group laughing]\n\nBut the difference is a dog will recognize adversarial\n\nsituations better than AI can.\n\nRight, when you were talking about\n\ntraining the video and all that.\n\nBut I, let's talk about the platforms\n\nbecause you are a very active twitterer.\n\nYou're not using it quite as much anymore.\n\nNearly at all.\n\nYou've gone to Blue Sky.\n\nHow would you describe this moment\n\nfor, I'm just gonna call it Twitter.\n\nHow would you describe this moment for Twitter?\n\nI think it's an existential moment for Twitter.\n\nI really do.\n\nI go over to Blue Sky\n\nand I can engage like it's, you know, 2015\n\nor 2016 like we did on Twitter.\n\nAnd literally, I can talk about the Mavs\n\nand people aren't going to come in\n\nand say fuck, the Mavs, you're an asshole.\n\nYou know, you look like.\n\n[Host] You took Klay Thompson.\n\nYeah, you took Klay Thompson.\n\nOh, I get some of those but that's okay.\n\nOr you look like Rachel Maddow when you wear glasses,\n\nyou know.\n\n[group laughing]\n\nYou know just dumb shit.\n\nThat's the tame stuff.\n\nYou know whats crazy.\n\nNo, it's crazy.\n\nI counted, so whenever Elon would talk shit to me,\n\nI would just bookmark it on Twitter\n\nand somebody said that he said something\n\nand I would just check and he had it.\n\nBut I just decided to count\n\nhow many times he has posted about me\n\nor replied about me in the last 12 months.\n\nMore than 40 times, I stopped at 40.\n\nAnd it's just like, what the fuck?\n\nYou know, I mean, I don't mind going back and forth at him,\n\nbut who, like we talked\n\nbefore, whoever controls the algorithm,\n\ncontrols the platform.\n\nAnd when you have an algorithm that defines\n\nwhat happens on the platform\n\nand what you see, you get one type of engagement,\n\nwhen you go to Blue Sky where you completely control\n\nthe experience,\n\nyou get a completely different type of engagement.\n\nAnd so I can talk about Cost Plus Drugs and really engage.\n\nI can talk about, you know, I can see other discussions\n\nand jump in and ask questions.\n\nAnd it was, it's been great.\n\nI mean, literally,\n\nand when some idiot comes along, like somebody\n\nwho comes over from Twitter who likes\n\nto give me there comes on, not only can you block 'em\n\nand it's a real block,\n\nbut you can do this thing if you started the thread\n\nwhere you can say hide reply for everyone,\n\nthat's like the best thing in the world ever.\n\nBecause, you know, I want to talk about the Mavs\n\nor Cost Plus or whatever, and troll comes in, troll gone.\n\nAnd the one thing about a troll is a troll wants\n\nto be seen, right?\n\nIf you know, within 15 minutes you're gone\n\nand nobody's gonna see what you posted,\n\nthere's no point in continuing to fight it,\n\nparticularly since you truly can't see my post.\n\nAnd even if they, you know, create burner accounts\n\nor whatever to try to get in,\n\nit just takes two seconds to do it.\n\nAnd so as a result, you know,\n\nI forget the topic I was talking about,\n\nbut I counted, I literally counted that there was over five.\n\nAnd if you go to Blue Sky, I'm MCuban,\n\nand you'll see my reference to this,\n\nthat there were 526 responses to something\n\nand only five trolls posted.\n\nAnd that took me just a minute to clean 'em out.\n\nAnd it was a great conversation.\n\nI mean, just.\n\nDo you feel like there, that the Blue Sky\n\nis in any way just becoming an echo chamber\n\nof the people who decided that Twitter was too toxic\n\nor too right wing for them.\n\nTo a certain extent yes.\n\nAnd now they've just moved over to Blue Sky?\n\nTo a certain extent yes.\n\nSo how in a sense, how does that fix anything?\n\nIt doesn't matter, right?\n\nBecause, you know, if I want to talk like the Mavs, right?\n\nSo I went to a bunch of sports writers\n\nand there's these things called Sport Starter Packs\n\non Blue Sky.\n\nAnd they were all in there, and I said.\n\nWe have a Wired one, follow it.\n\nThank you.\n\nThe Wire starter pack.\n\nAnd you see what happens.\n\nI can engage with them and talk Mavs and see where it goes.\n\nAnd you know, like Ben Shapiro, he has an account there\n\nand I can engage with him.\n\nI may agree or disagree,\n\nbut if I start the thread, I have control of it.\n\nAnd if it turns out to be a legitimate argument\n\nor discussion, that's great.\n\nAnd you know the point being\n\nthat whoever controls the Thread controls the conversation\n\nand it can open it up to anybody they want.\n\nAnd there's no for you page, you know,\n\nso it's not like it's dominated by everything\n\nthat Elon says.\n\nIt's dominated, you know, it's dominated\n\nby the people you follow or the list that you create\n\nor the feeds that you follow.\n\nAnd so you get to really engage and that's, it's cool.\n\nI mean, it's just like all that intellectual engagement\n\nthat we kind of miss from Twitter where it was like, oh,\n\nthis is a great topic, I want to learn more.\n\nOr I'm just, you know,\n\nwatching these people have this conversation, it's amazing.\n\nAnd there's, you know, yeah, there's one\n\nor two idiots in there, you know, not,\n\nI'm not even talking about people I disagree with,\n\nbut people who just say stupid stuff, right?\n\nHateful stuff.\n\nIt's so de minimus\n\nthat the engagement is amazing.\n\nAnd I think that's why it's growing.\n\nAnd you even saw the New York Times come on there\n\nand someone told me they referenced one\n\nof their posts on Blue Sky as,\n\nand where in the past they would do that on Twitter,\n\nyou know, and to see them move over\n\nto escape what's going on over there is great.\n\nAnd here they are, I don't know their latest numbers,\n\nbut they have more than 22 million users.\n\nAnd I can tell.\n\nI think we're gonna get update on those\n\nnumbers shortly actually.\n\nJay coming on stage.\n\nJay comes on.\n\nBut you gotta try it.\n\nAnd like I said, I'm MCuban, try it.\n\nI mean, bring your friends on there.\n\nIt is truly a social network.\n\nHey, was that the Mavs game?\n\nDa da da, I was there to, I mean, that's insane, to be able\n\nto have that conversation on a social network.\n\nI think that there was, there's been this idea\n\nfor a long time, and certainly I think probably when you\n\nwere starting out as an in internet entrepreneur, that\n\nthe internet was a little bit downstream from culture.\n\nAnd now we've come around to this idea\n\nthat the internet is culture.\n\nAnd we certainly saw that play out a lot\n\nin this election too.\n\nAnd there were some reactions, responses\n\nto the outcome of this election is saying that, well,\n\nthe on the left people don't have the same kind of audience\n\nthat people are gaining on the right, right?\n\nLike, there's no podcast for the left.\n\nThat was something that.\n\nYeah, I don't agree with that at all.\n\nSo yeah, so talk about this like,\n\nbecause if everyone who just doesn't like Twitter anymore,\n\nmoves to Blue Sky\n\nor moves to Threads or moves to something like it,\n\nbut Twitter remains while small, relatively in numbers\n\nto some social networks, but sort of outsize influence\n\notherwise.\n\nI don't think Twitter.\n\nI mean, if you want to know what Elon thinks,\n\nTwitter's amazing and that's great, right?\n\nThat's his platform.\n\nSo how do we distinguish reality?\n\nI'm sorry?\n\nHow do we distinguish reality then on social media?\n\nI mean, what's really happening?\n\nI've been on Theo Von, I've been on The Nelk Boys,\n\nI've been on all those podcasts and everything,\n\nbut Joe Rogan, he won't have me on for whatever reason.\n\nAnd so when you go on there,\n\nthey just want to have a conversation.\n\nAnd from that conversation, there's a ton of clips.\n\nLike Andrew Schultz, I had a great conversation with him.\n\nThey're still posting clips, right?\n\nAnd so when you go on those, it's not that they're right\n\nor left, it's that they create clips\n\nthat feed the algorithm on Twitter.\n\nAnd so if you happen to, you know, be a fan of theirs\n\nand comparable things, the algorithm's gonna find you,\n\nyou know, the algorithm always finds you with things\n\nthat you've shown interest in.\n\nAnd so that's great.\n\nBut the way to deal with that isn't in trying\n\nto get more Andrew Schultz's, you know, to conjure that,\n\nthe way to deal with that is to flood the zone.\n\nYou know?\n\n[Host] What does that mean?\n\nWhat does that look like?\n\nWhat that means is either going\n\nand going, making the rounds\n\nand, you know, creating things that are,\n\nthat are worth talking about or worth showing,\n\nor just create memes left\n\nand right so that it just dominates the algorithms.\n\nSo like I told the Harris campaign\n\nand you know, they really didn't pursue it.\n\nYou have to, I had a conversation with Mr. Beast\n\nthat was illuminating to no end.\n\nAnd he basically said, he said, spends millions\n\nof dollars reverse engineering the algorithms\n\non each platform.\n\nAnd that's where he comes up with the ideas on\n\nwhat to do next.\n\nAnd that's exactly\n\nwhat the next political campaign has got to do.\n\nYou've got to figure out what you know, for each type\n\nof individual that you want to get to vote for you\n\nthat you want to engage.\n\nYou have to figure out their algorithm,\n\n'cause each one of us in this room has our own algorithm on\n\nTwitter that, you know, it's effectively customized\n\nfor us on Twitter, Instagram, et cetera.\n\nAnd so you have to flood the zone with\n\nas many different memes, clips, everything that you can do.\n\nSo there's something for everybody.\n\nAnd you had, there's so much volume you can't miss it.\n\nAnd it has nothing to do with the right or left.\n\nI mean, like I told 'em, it could be,\n\nit's not like it was facts\n\nthat made the difference in this election, right?\n\nYou know, they're eating cats\n\nand dogs, you know, he's fucking a couch.\n\nYou know, that's what they needed more of,\n\nmore couch fucking stuff for real right?\n\nBecause if there would've been\n\n600 million couch fucking extensions,\n\neverybody would've seen it continuously\n\nbecause the memes don't filter out, right?\n\nThe algorithms don't filter out, right?\n\nThey filter forward.\n\nAnd that's politics going forward.\n\nAnd you really do think\n\nthat would've altered the outcome of the election?\n\nI think if you would, it would've made\n\nall the difference in the world.\n\nBut because when there's,\n\nbecause when Donald Trump would talk about their\n\neating cats and dogs, everybody had to cover it.\n\nAnd it turned into a meme, even though it started\n\nas one person posting one thing on Facebook when they\n\nstarted talking about weird at the beginning,\n\nwhen they talk about Brat, when they talk about\n\nfucking the couch, it was everywhere.\n\nAnd everybody had to respond to it.\n\nYou have to flood the zone.\n\nThey started Kamala's campaign,\n\nstarted off flooding the zone with stuff,\n\nand then dropped it\n\nand tried to be, you know, tried to use accuracy\n\nas a differentiator.\n\nWhereas, you know, Donald Trump's,\n\nhe floods the zone continuously.\n\nThat's what he does.\n\nThat's who he is as a campaigner.\n\nHe's a great salesperson.\n\nHe's willing to put himself in just all kinds\n\nof crazy situations and flood the zone with information.\n\nAnd it got to the point in my mind, at the end of the day,\n\nit was, who do you trust more?\n\nFor the things that they scared\n\nthat you were scared most about?\n\nWere you scared most about tariffs?\n\nWere you scared most about people eating cats and dogs?\n\nYou know, were you scared most about taxes?\n\nWere you scared most about immigration and the border?\n\nAnd they scared you and then they flooded\n\nthe zone with memes.\n\nAnd that's, to me what that and partially crypto.\n\nWe're out of time.\n\nBut I do have to ask you one more question.\n\nI want to leave the audience with a note of hope, optimism\n\nin somewhat politically volatile, unstable times.\n\nI hate saying that in these times, in this moment.\n\nHow, what would you say to people?\n\nWhat's a piece of advice you have to give to people\n\nfor navigating that, for living their lives?\n\nLook, you guys are here for a reason.\n\nYou're here because you believe in something better.\n\nYou believe in something bigger, in this country\n\nthat we are the one country in the world\n\nwhere when you have an idea\n\nand you get that feeling in your stomach,\n\nyou guys know what I'm talking about.\n\nAnd then you say to a friend, oh, I got this idea.\n\nWhat do you think Lauren?\n\nAnd Lauren goes, oh, that's really cool.\n\nAnd then you go and Google it.\n\nOr now you put it into ChatGPT, or Gemini or whatever,\n\nand it gives you a business plan\n\nand go, oh my God, I can do this.\n\nWhat makes us different is we go out there and do it.\n\nThat's who we are as a country.\n\nWe may be in weird times right now politically,\n\nbut that doesn't change who we are as Americans,\n\nthe President, you know, we can be afraid\n\nand we can be aware and we can be concerned.\n\nBut what you do\n\nand who you are, that's what makes us different.\n\nAnd so I am bullish on the United States of America,\n\nno doubt about it because that's why people are here.\n\nIt's not like people aren't showing up.\n\n[audience applauding]\n\nYou know, it's not like people aren't coming\n\nto this Wired conference.\n\nIt's not like, you know,\n\nthere aren't great interviews up here.\n\nIt's not like people are saying, oh we're\n\nfucked let's just go sleep, right?\n\nNo, people are doing what we do\n\nand that's what makes us unique.\n\nIf you look at every single new technology over the last,\n\nwe talked about this, so over the last 30 years, 95%\n\nof them have come here.\n\nMaybe they were born somewhere else, but they're here.\n\nAnd the companies were born here or grown here\n\nbecause that's what we do.\n\nWho the fuck else does that?\n\nWe do as Americans.\n\nAnd that's not going to change\n\nno matter who the president is.\n\nSounds like a stump speech.\n\n[audience applauding]\n\nMark, unfortunately, that's all the time we have.\n\nI'd love to keep talking.\n\nThank you so much for being here.\n\nThanks for having me, Laura.\n\nIt's really great.\n\nIt's really great hearing from you.\n\n[audience applauding]\n\nAll right.",
  "authors": [
    "Condé Nast"
  ],
  "url": "https://www.wired.com/video/watch/battling-big-pharma-a-conversation-with-mark-cuban"
}