{
  "title": "Remove metadata from Office files, PDFs, and images",
  "text": "Your metadata says a lot about you. When I ran 10 years of Gmail messages through MIT Media Labs' Immersion email metadata visualization tool, the resulting image (shown above) predicted relationships with my frequent correspondents with uncanny accuracy.\n\nImmersion scans only the From, To, Cc, and Timestamp fields of messages in Gmail, Yahoo Mail, or MSExchange. A scan of my Gmail account indicated I have received more than 50,000 messages in the 10.1 years I've used the service. Immersion identified 189 collaborators, and it predicted how many new collaborators I would have this year, as well as the number of messages I would send and receive through the rest of 2014.\n\nEmail metadata is easy to access but difficult to delete. MakeUseOf's Guy McDowell explains how to view header information in Gmail messages, and how to decipher the metadata that gets attached to your mail. The eDiscovery Evangelist explains all the types of metadata that are included with your messages and includes a link to the metadata definition in the Internet standards document RFC 2822.\n\nAs The Guardian's Guide to Metadata explains, there's not much you can do about most of the metadata associated with an email, apart from disabling location services on your phone. However, you can remove metadata from the files you attach to emails. Here's a guide to deleting metadata from Office files, PDFs, and images.\n\nStrip the metadata from your files\n\nMicrosoft offers the free Document Inspector for removing \"personal or sensitive information\" before you share an Office file. The Microsoft Support site provides specific information on deleting metadata from Word 2013 and Word 2010; Excel 2013 and Excel 2010; PowerPoint 2013 and PowerPoint 2010; Word 2007, Excel 2007, and PowerPoint 2007; and Word 2003, Excel 2003, and PowerPoint 2003.\n\nLikewise, Adobe's Help site explains how to remove metadata from PDFs in Acrobat X Pro and Acrobat X Standard. A thread on B4Print.com's forum provides step-by-step instructions for excising metadata, or \"hidden content,\" from PDFs using the Examine Document tool in Acrobat 9.\n\nWindows Explorer (File Explorer in Windows 8.1) lets you view and delete metadata from a file via the Properties dialog box. The quickest way is to click Properties > Details > Remove Properties and Personal Information > \"Create a copy with all possible properties removed.\"\n\nThe Remove Properties dialog in Windows Explorer/File Explorer lets you create a version of the file with \"all possible properties removed.\" Screenshot by Dennis O'Reilly/CNET\n\nHowever, as MakeUseOf's Chris Hoffman points out, this method may not work when you try to clean the EXIF metadata from image files. Hoffman recommends the free Metability QuickFix program for removing GPS data from multiple photos at once.\n\nAnother metadata-removal tool for Windows image files is the free JPEG & PNG Stripper from Steel Bytes. Mac OS X users can delete EXIF data from image files by using the free ImageOptim program, as described on OS X Daily.\n\nPhotography Life's Nasim Mansurov explains how to remove EXIF and XMP data from files in Adobe Photoshop and Lightroom. Mansurov's tutorial includes a link to Phil Harvey's free ExifTool.\n\nDon't tag your location to your phone's photos\n\nFacebook, Twitter, and other social sites and image-sharing services automatically hide the location information and other metadata attached to the images you upload to prevent viewers from downloading the information along with the photo. However, you're still sharing the data with the service itself. Maybe you're OK with that, and maybe you'd prefer to prevent the services from knowing where you were when you took the photo.\n\nRemove location tags from photos taken with your iPhone or iPad via the Location Services settings. Screenshot by Dennis O'Reilly/CNET\n\nTo disable location services for the camera in an iPhone or iPad, choose Settings > Privacy > Location services and toggle Camera to off.\n\nAs Martin Brinkmann explains on the gHacks site, the simplest way to remove GPS data from images on Android phones is to use the free Image Privacy app, which adds a \"Strip metadata\" option to the Android Share menu. After you select the option, the menu reappears following a short delay. Now when you select a service (Twitter, Facebook, Dropbox, Flickr, etc.), the image is uploaded minus its location data.\n\nAnother option for removing location information from images is the free VerExif.com service. (Note that the site opens in Spanish by default but can also be viewed in English.) Select the Choose File option, navigate to and select an image, and click Open. You can either remove the EXIF data or view it; the remove option also appears on the view screen.\n\nVerExif.com works on only one image file at a time, unlike the programs referenced above that let you remove location information from multiple image files at one time.",
  "authors": [
    "See Full Bio",
    "Dennis O'Reilly",
    "Dennis O'Reilly Began Writing About Workplace Technology As An Editor For Ziff-Davis' Computer Select",
    "Back When Cds Were New-Fangled",
    "Ibm'S Pc Xt Was Wowing The Crowds At Comdex. He Spent More Than Seven Years Running Pc World'S Award-Winning Here'S How Section",
    "Beginning In O'Reilly Has Written About Everything Web Search To Pc Security To Microsoft Excel Customizations. Along With Designing",
    "Building",
    "Managing Several Different Web Sites",
    "Dennis Created The Travel Reference Library",
    "A Database Of Travel Guidebook Reviews That Was Converted To The Web In"
  ],
  "url": "https://www.cnet.com/how-to/remove-metadata-from-office-files-pdfs-and-images/"
}