{
  "title": "My ex is having an affair with another soccer mum and I feel complicit. Do I tell the husband or keep it quiet?",
  "text": "I left my ex-husband two and a half years ago. He told me the day we broke up that he had feelings for a married woman and she for him. I knew. It was part of the reason I wanted to leave him, along with a very long list of ways in which our marriage was no longer serving either of us.\n\nA few months later he started actively (but covertly) pursuing this woman, who is a mum in my son’s sports team. Apart from my ex and this woman, I am pretty sure I am the only person who knows.\n\nI feel complicit in their awful lie and I feel sick knowing that it will hurt a lot of people. My son is 17 and his soccer team is like an extended family. I am concerned that this relationship has the capacity to destroy not only their family but my son’s relationship with his dad. Do I tell the husband or do I keep it quiet?\n\nEleanor says: Whether to reveal an affair is a classic example of what feels like a tension between doing a moral duty – telling the truth – and avoiding harm. On the one hand there’s such a strong feeling that they’re getting away with something and pulling you into their dissembling.\n\nOn the other, everybody has a story of telling a partner and things blowing up in ways they didn’t expect. The spouse says, “I wish I hadn’t known”. “Why was it your business?”. Or the existing relationship was ending anyway and it turns out the affair is the relationship that lasts. And, it could be that we don’t actually know. Just based on what you’ve said in your letter, it’s not beyond reasonable doubt (to me) that they’re flirting overtly without having crossed into affair territory, which can be different for different people.\n\nSo, I wonder if there’s a question before whether to tell the husband. Could you maybe talk to your ex?\n\nThey probably underestimate the cost to you of keeping this secret. In fact, they might not even think of it as keeping a secret. They might think of your silence as bowing out, not participating, “staying out of it”, when to you it feels every bit as much like a decision as telling would be.\n\nPlus, if they are having an affair, they could be in what people call “affair fog”, where the things people normally value disappear in the intoxicating haze of novelty and secrecy.\n\nYou could correct both those things. You could say to your ex-husband: you have put me in a very uncomfortable position. You’ve not made much effort to conceal what I think is going on. And now I am contaminated with this knowledge and I’m staying up at night worrying about the things that should be worrying you: how would this affect the kids? Is there any way out of this situation that does not hurt a lot of people in the blast radius?\n\nIn other words, you could say to them: you’ve put me in a position where I’m doing something daily that I don’t know whether it’s OK to do. I’m not comfortable remaining in that state. I need to know that you’re not just sleepwalking into blowing up everyone’s lives, and if you can’t get out of this in a way that minimises hurt I will not continue to keep your secret.\n\nThat way you puncture the illusion that this is all OK and nobody’s noticing. You put them on a clock; either stop this, or come clean, or find some other way to sort this out.\n\nClearly the right thing to do would have been for them to not do this in the first place. Now that they have, they’re only left with bad options: come clean and hurt a lot of people, or extricate themselves and keep the secret. Either way they’ll be responsible for things that should keep them up at night. But you can’t know the intricacies that decide which of those is the right choice.\n\nWhat you do know is that you have leverage. And you can use that to make sure they know that this isn’t a limbo you’ll remain in forever.\n\nThe reader’s letter has been edited for length\n\nAsk Eleanor a question",
  "authors": [
    "Eleanor Gordon-Smith"
  ],
  "url": "https://www.theguardian.com/lifeandstyle/2025/nov/21/my-ex-is-having-an-affair-with-another-soccer-mum-and-i-feel-complicit-do-i-tell-the-husband-or-keep-it-quiet#comments"
}