{
  "title": "Why Gen Z Loves Selena So Hard",
  "text": "A month before Selena Quintanilla was murdered, she entered the Houston Astrodome for her first and final televised concert on a horse-drawn carriage. Dressed in a sparkly purple jumpsuit, she waved at the crowd, smiling, as a piano riffed the first few notes of “I Will Survive.” Selena stepped onto the stage ceremoniously and began one of the most momentous concerts in Tejano history, belting out a medley of songs by Gloria Gaynor, Donna Summer and other disco legends.\n\nPerforming hits by American artists was Selena’s way of telling the world she wouldn’t be put in a box. Sure, she could fuck up a Tejano song better than anyone (it was, in the end, the genre she was confined to), but she was also doubling down on her blended identity in a country that struggled to understand how one person could be equal parts Latina and American.\n\nOn the heels of Selena’s killer, Yolanda Saldívar, being denied parole, it seems appropriate to reexamine Selena’s curious popularity among Gen Z. We’re of a generation that was never alive when Selena was, but have nonetheless made her ubiquitous on platforms such as TikTok — from a Selena impersonator walking through the suburbs to a post of a little girl dressed in a purple jumpsuit, viciously pummeling a piñata in the likeness of Yolanda. Thirty years after her death, what’s our unmitigated reverence of Selena really about?\n\nAdvertisement\n\nDuring my TikTok investigation, I met Nessa Diosdado, a 25-year-old who grew up in rural East Texas and runs a popular page where she teaches young people about Mexican-American music. Nessa told me that growing up in a predominantly white town, she hated being Mexican and when she was young. Her only real role model was Selena. Her mom, who was a diehard fan of Tejano music and had actually attended a Selena in concert, would blast her music every weekend while she cleaned the house.\n\nNessa also remembered watching the biopic and hearing the actor who played Abraham, Selena’s father, complain that their family was too Mexican for the Americans, but also too American for the Mexicans.\n\n“It’s been engraved in our heads, for those of us who have watched it,” she said. That sentiment — of being left out by all sides, of being simultaneously neither and both — is the key to Selena’s allure for many young people today, including myself.\n\nAdvertisement\n\nA recent U.S. census found that the Latino population grew by at least 23% in the past decade, which means there are more and more people like Nessa who navigate a Hispanic identity that is neither fully American nor rooted in a Latin American country. So much of the labor of being a hyphenated American lies in the struggle of proving that we belong equally to both ends of that hyphen.\n\nThen, there’s the existential fear of being excluded by both. Selena seemed to navigate this identity maze seamlessly; when the news anchor Cristina Saralegui corrected her for fumbling a Spanish word and teased her for her “Tex-Mex accent,” Selena took the comment in stride. “You understood me, didn’t you?” she asked Saralegui, laughing.\n\n“[Selena] made something so derided into something charming, even endearing,” said Mexican-American journalist Maria Garcia in an episode of her podcast, ”Anything for Selena.” That moment is emblematic of how secure the singer seemed to be in her identity and how unwilling she was to be ridiculed for it.\n\nAdvertisement\n\nGoing to school in suburban Texas, I disavowed my first name, Jesús, and begged my parents in hushed whispers not to speak in Spanish whenever they picked me up from Elementary School. For one, I look pretty Asian and people would ask me why I spoke Spanish when I didn’t “look” Latino. Second, this was the George W. Bush era, and I would hear news anchors and classmates talk about people “like us” infiltrating the southern border.\n\nThings have changed drastically with the mainstream success of reggaeton and an internet culture that actually celebrates Latinidad (this TikTok sound is emblematic of this shift). But this is where things get complicated: Although I am ecstatic for the visibility of artists like Bad Bunny, few people would ever question whether he’s Latino enough. He’s not really concerned with proving to Americans that he is American, either. He seems perfectly comfortable in his identity — which is so powerful and very needed — but he’s also someone who was born and raised in Puerto Rico and is firmly rooted in his Puerto Ricanness. His particular identity still leaves out some of us who walk through the world with an angst of feeling like others aren’t letting us fully claim our Latinidad.\n\nPortrait of American singer Selena at the 36th Annual Grammy Awards at Radio City Music Hall on March 1, 1994. Arlene Richie via Getty Images\n\nAdvertisement\n\nThen, there’s artists like Rosalía, who claim Latinidad while also benefiting from their own whiteness. Rosalía is from Barcelona, but her latest album was heavily influenced by reggaeton, dembow and bachata. Although I’m a fan of her music, there’s a sense that she’s telling stories that are not entirely hers to tell. Despite the visibility of Latin artists, we still don’t have a Selena right now — and we desperately need one. Her authentic embodiment of Hispanic-American angst and joy continues to reverberate.\n\nAnd the internet is just as obsessed with Selena’s death as they are with her life. When she was killed, Selena was in the midst of finishing her debut English language album, which was expected to cross her over as a mainstream American artist.\n\n“I can only imagine how much more she would have contributed to music if she would have still been alive today,” Diosado said. That’s when I realized that at least a part of our fixation with Selena comes from the anger of growing up in a world without her and the Hispanic-American movement that was beginning to form around her.\n\nAdvertisement\n\nThat rage is evident in much of the way Gen Z talks about Selena’s legacy today. Jordan Harb, a teacher in Washington, D.C. told me that one of his fifth grade students recently told the class that once Saldívar “gets out of prison, [she’s] gonna send her a dry ass Popeye’s biscuit so she can choke.”\n\nTikToker Princess Young made a viral video expressing a similar sentiment, where she’s standing in front of a green-screen prison dancing to “Como La Flor” with the caption “Waiting on Yolanda to get out on parole March 2025.” Young, who is 25, said that she was obsessed with the 1997 biopic. “For her to display a sense of pride made me feel so seen as a Black child,” she said.\n\nSelena’s untimely death spilled into other marginalized communities, who understand the depth of American prejudice and the obstacles Selena had to overcome. Unlike other artists, Selena wasn’t just making music for other Mexican Americans — she was reaching out to anyone who didn’t feel fully rooted in their world.\n\nAdvertisement\n\nThere’s a real sense that an inclusive Hispanic-American identity died along with Selena, or that maybe we’d be further along as a community if she were still here. But focusing on her death and lamenting what she wasn’t able to do also feels unfair to her legacy. Selena laid the groundwork by showing us that there can be so much joy and authenticity in not belonging.\n\n“I don’t feel pressure because I’m not trying to portray something that I’m not,” she once famously said. It’s our turn to take that lesson and build something new.\n\nEDITOR’S NOTE: This story has been updated to include recent developments in incarceration of Yolanda Saldívar",
  "authors": [
    "Contributing Writer"
  ],
  "url": "https://www.huffpost.com/entry/selena-quintanilla-gen-z-new-album_n_6304cc2de4b00c150d64ca12"
}