{
  "title": "Meta, per un giudice statunitense il colosso non è un monopolio e i social che conoscevamo sono morti",
  "text": "Meta ha ottenuto un'importante vittoria in un contenzioso legale che prosegue ormai da anni, incentrato sulle acquisizioni di Instagram e WhatsApp. Il gigante tech ha sconfitto in tribunale la Federal trade commission (Ftc), l'agenzia statunitense preposta alla tutela dei consumatori e alla vigilanza antitrust, che l'accusava di essere un monopolio.\n\nIn una sentenza emessa martedì 18 novembre, il giudice statunitense James Boasberg ha stabilito che la Ftc non è riuscita a dimostrare che Meta detiene un monopolio nel mercato dei “social network personali” (personal social networking). L'ente sosteneva che la società di Mark Zuckerberg avrebbe solo due rivali nel settore, Snapchat e MeWe, che peraltro faticherebbero a competere proprio a causa del predominio di Meta.\n\nMa i giorni in cui le app venivano suddivise in “mercati separati di social networking e social media” sono morti, ha scritto Boasberg. Che ha anche sostenuto che la Ftc avrebbe perso l'occasione di bloccare le acquisizioni di Meta citando il filosofo greco Eraclito, secondo cui “nessun uomo può entrare due volte nello stesso fiume”.\n\nIn sostanza, Boasberg ha concordato con Meta sul fatto che i social, così come erano conosciuti agli albori di Facebook, non esistono più. Questo significa che il colosso oggi deve fare i conti con la concorrenza di un gruppo più ampio di app, tra cui due piattaforme estremamente popolari come TikTok e YouTube.\n\n“Quando le prove indicano che i consumatori stanno trasferendo una quantità enorme di tempo dalle app di Meta a quelle dei suoi rivali, e che tale sostituzione ha costretto Meta a investire ingenti somme di denaro per rimanere al passo, la risposta è chiara: Meta non è un monopolista isolato dalla concorrenza”, ha concluso Boasberg. Secondo il giudice, l'ingresso di TikTok nel mercato sarebbe sufficiente a smentire la tesi della Ftc.\n\nPrevedibilmente, l'agenzia statunitense non è soddisfatta dalla sentenza di Boasberg, che ha tra l'altro messo in discussione la neutralità di uno dei suoi principali testimoni, Scott Hemphill, sostenendo che fosse allineato a figure che chiedevano pubblicamente lo scorporo di Facebook.\n\n“Siamo profondamente delusi da questa decisione”, ha dichiarato a Cnbc Joe Simonson, direttore degli affari pubblici della Ftc. “Il giudice Boasberg, attualmente sottoposto a procedimento di impeachment, è sempre stato a nostro sfavore. Stiamo valutando tutte le opzioni a nostra disposizione”.\n\nPer Meta la vittoria pone fine ad anni di contenziosi con la Ftc, che ha cercato di separare la famiglia di app dell'azienda: Facebook, Instagram e WhatsApp.\n\n“La decisione odierna della Corte riconosce che Meta deve affrontare una concorrenza agguerrita”, ha dichiarato Jennifer Newstead, responsabile legale di Meta. “I nostri prodotti sono vantaggiosi per le persone e le aziende e rappresentano un esempio di innovazione e crescita economica americana. Siamo ansiosi di continuare a collaborare con l'amministrazione [statunitense] e di investire in America”.\n\nUn aiuto significativo a Meta è arrivato dagli utenti che cliccano sui Reel.",
  "authors": [
    "Ashley Belanger"
  ],
  "url": "https://www.wired.it/article/meta-causa-ftc-sentenza-monopolio-social-network/"
}