{
  "title": "Palantir CEO Alex Karp On Government Contracts, Immigration, and the Future of Work",
  "text": "Transcript\n\nWe have to build systems like Palantir\n\nand we have to explain to people with working class skills,\n\npeople with normal jobs,\n\nthat their labor's gonna become more important\n\nand more valuable over time with products like ours.\n\nIf you run around saying that, you know,\n\noh, the economy is gonna completely shift to value creation,\n\nonly owned by 10,000 people,\n\npeople on the left and the right are gonna go nuts.\n\nI'm Steven Levy, Editor at Large at Wired.\n\nI sat down with Alex Karp, CEO of Palantir,\n\na controversial company that orchestrates data\n\nand solves problems for government and business.\n\nWe discussed Palantir's work with ICE and Israel\n\nand why he feels the company has no competitors.\n\nWelcome to The Big Interview.\n\n[intense music]\n\nWell, first of all,\n\nlemme say welcome to The Big Interview.\n\nOkay. Dr. Alex Karp.\n\nYou said that Palantir is at odds\n\nwith Silicon Valley from the very beginning.\n\nYou have kind of a harsh critique of Silicon Valley.\n\nYou want Palantir to be different.\n\nWhat do you think the biggest problem of Silicon Valley was?\n\nWell, we have a long and managing relationship\n\nwith Silicon Valley.\n\nIn the beginning we were at odds\n\nbecause we were pro-American, pro-West,\n\nand pro-making the government functional,\n\nand that was very controversial in Silicon Valley\n\nbecause it equated to not making any money\n\nand being a loser.\n\nWe won that battle.\n\nAnd I think Silicon Valley actually has become very,\n\nat least officially and even behind closed doors, patriotic\n\nand Silicon Valley has always been pro-meritocracy\n\nand we're very aligned with that.\n\nWhere we're currently\n\nat like a misalignment-alignment apex again,\n\nis we believe in using large language models\n\nin a way that creates actual empirical value,\n\nbut also, is very strong for workers, technical people,\n\nwhether you're a plumber, carpenter, or electrician,\n\nor you are a high school grad working in a plant\n\nwhere you'd normally be doing engineering things\n\nor couldn't do them.\n\nWe see our products as being able\n\nto enhance your market value.\n\nAnd so, we're kind of pro-labor and pro-military.\n\nSo we're much closer to Silicon Valley\n\non the patriotism thing.\n\nBut for decades we fought Silicon Valley\n\nabout, you know, government is something we should support.\n\nWe walked towards the government when everyone walked away.\n\nThat's how we ended up powering Maven,\n\nwhich is the, you know, US government's military.\n\nYeah, you took advantage when the Google workforce said,\n\nWe don't want Google to work on Maven.\n\nAnd then we built it, yeah, but.\n\nExplain what Project Maven is.\n\nWell, so to find an adversary on a battlefield\n\nfrom any sensor including space,\n\nis a massive integration in analytics project.\n\nSo, how do you find basically a needle in a haystack?\n\nAnd where that needle is also complex\n\nbecause it may look like your adversary,\n\nbut maybe that person's actually working for you.\n\nMaybe they're in your service,\n\nmaybe their phone has been compromised.\n\nFinding that needle in a haystack, so find a person\n\nthat is your adversary, you wanna take out\n\nacross a massive landscape\n\nwhere you have a human controlled in the loop,\n\nlike targeting workbench.\n\nSo you say, you know, this target's been approved.\n\nWhy? Under what conditions?\n\nThe data protections that are necessary,\n\nthe civil liberty protections, interestingly,\n\nthat are necessary.\n\nAnd doing that at scale on the battlefield was not possible.\n\nAnd now, it's been used in every operational context\n\nacross the world.\n\nAnd you know, there are many things that have led\n\nto America's ability to reestablish its deterrence,\n\nI would say, after the disaster in Afghanistan.\n\nBut one of them was actually one of many corrosicism\n\nof our soldiers may, I think one of the other things\n\nis just the superiority\n\nof the targeting capabilities the US government has.\n\nAnd you know, there are other people in other companies,\n\nbut we are the backbone of that.\n\nA lot of your government connections, they go back early.\n\nYou know, you've worked for ICE,\n\nyou've had long-term contract with them, right?\n\nWell, that's actually later.\n\nI mean, our first contracts were at US Intelligence,\n\nso CIA, Special Operations, and FBI\n\nand our biggest contracts ended up being in the DOD.\n\nAnd then later we started working\n\nin Homeland Security under Democrats.\n\nNow it's very controversial because it's Trump in my view.\n\nWell, it's controversial\n\nbecause he's doing things that we haven't seen done before.\n\nI want to ask you, do you keep an eye on that?\n\nAre you making sure that your products\n\nare being used according to your code,\n\nwhich supports democracy?\n\nAnd you know, it says people can't be discriminated against.\n\nI'm wondering if there's a line for you where you would say-\n\nOkay. To a president, No.\n\nWe were the, I mean this is like,\n\nthere's all these things that no one believes are true.\n\nI was the first, and I may be one of the few CEOs\n\nto say we would not build a Muslim database.\n\nNow, everyone thinks I'm like,\n\nand I am, you know, I've defended Israel.\n\nI think, like, people\n\nwho wake up in the morning thinking\n\nabout how Jews are running the world,\n\nand actually, you believe whatever you wanna believe.\n\nI'm not so concerned about people\n\nwho are skeptical about Jews\n\nor even their antisemitic,\n\nbut like people who wake up in the morning, in the evening,\n\nand night thinking about this.\n\nI think like, you know, Jewish derangement syndrome\n\nis a little bit of a carcinogen.\n\nSo, I think I'm the last person in the world\n\npeople kind of expect in the kind of rude\n\nand crude way people think of this to refuse revenue,\n\nto build, you know, a Muslim database.\n\nAnd I would say more like at a high level,\n\n'cause I can't go into the details,\n\npeople internally know I pulled things\n\nfrom places where I thought there was anything\n\nlike that going on in the US.\n\nDiscrimination, yes, I'm against that.\n\nBy the way, even if I was in favor of it,\n\nour products make that nearly as impossible\n\nas anyone's ever seen in a product.\n\nBecause the way you do these things,\n\nthe way you discriminate against people politically\n\nor based on their gender or race,\n\nyou do not have what are called ackles.\n\nSo, you can't see where the data's flowing.\n\nWhat you can immediately see, not as a technical person,\n\nbut as you, your cameraman,\n\neveryone watching this can go look\n\nand see how is the data merged?\n\nWhat kind of pipelines did you create?\n\nWhat were the assumptions that went into it?\n\nWhere did the data flow?\n\nBut where you and I disagree with maybe\n\nis I spent half my life in Europe.\n\nI am an immigration skeptic.\n\nLike, and I personally think that US people,\n\nmeaning citizens, have to decide by their vote\n\nwhat our immigration policy is gonna be.\n\nAnd I'll tell you one of the reasons I'm very skeptical\n\nof my own party is that open border was not only a disaster,\n\nbut it was tolerated.\n\nAnd that is massively corrosive\n\nand it's corrosive to democracy\n\nand it's corrosive to people.\n\nAnd leaving all the theory aside, like I was,\n\nI grew up in a progressive family,\n\nclassic progressives my age and older\n\nwere massive immigration skeptics.\n\nOpen borders is not a progressive policy.\n\nIt is not a progressive policy.\n\nIt never was.\n\nAnd then the fruits of this, you know,\n\nI spent most of my life, adult life in Germany.\n\nLook at what a version of open borders\n\na little different has done to Germany.\n\nOn any vector: rights of women, rights of gay people,\n\nfuture of society. Well.\n\nI just wanna make it clear.\n\nYeah, yeah. I am against discrimination.\n\nI'm not saying you're saying this,\n\nbut people tend to merge being against discrimination\n\nwith being, to be against discrimination,\n\nI have to accept that there's nothing\n\nthat can be done about illegal immigration in the West.\n\nAnd I just, I disagree with that.\n\nBut more importantly than me disagreeing with it,\n\nthe American people disagree with it.\n\nAnd I, quite frankly, you're not asking this,\n\nI think one of the reasons why the Democratic Party\n\ncontinues to fail and continues to fail\n\nand continues to fail is their talent managed.\n\nWhich like in businesses, like you have this problem\n\nwhere the people doing the work sometimes need to be told,\n\nNo, you're wrong and we're not doing that.\n\nAnd the Democratic party\n\nand people like it, the Green Party in Germany,\n\nI don't view these policies as progressive.\n\nWell, I guess what I'm saying is\n\nare you monitoring sort of what's happening\n\nwith this government and democracy in this country\n\nand saying, Maybe at some point I have to look at-\n\nI would say the more important question\n\nis have I ever worked against our commercial interest\n\nbecause it violated our norms?\n\nYes.\n\nHave I done this in governments?\n\nYes.\n\nHave I refused?\n\nWe get no credit for this,\n\nbut we almost went outta business,\n\n'cause we were not working\n\nin Russia, China, or anywhere else, so yes.\n\nHave we refused give our product\n\nto foreign governments because we didn't agree with them?\n\nYes.\n\nDo I agree with your implicit assertion\n\nthat what's going on in immigration\n\nas you formulate it has never been done before?\n\nNo, I think actually that's completely crazy.\n\nYou know, when you're in Japan,\n\nif you miss your visa, do you know what happens to you?\n\nI didn't overstay my visa.\n\nOkay, great.\n\nI'll tell you what happens.\n\nYou politely are put on a plane.\n\nIs Japan not a democracy?\n\nDo you know what happens in like Singapore?\n\nWell, I think like-\n\nYou're, but I just, no, I think this\n\nis a very valuable line of questioning.\n\nYou're asking does our product allow\n\nfor civil rights abuses and will I intervene?\n\nYeah.\n\nOur product is the hardest in the world to violate.\n\nWill I intervene?\n\nYes.\n\nDo I agree with some of the assertions you just made?\n\nNo.\n\nThe legitimate criticism could be,\n\nhey, these are two very rational people.\n\nYou know, you're bringing up exactly the core\n\nand right question.\n\nAnd I'm telling you that I have done this, I will do it.\n\nAnd I've continued to do it.\n\nAnd by the way, not that people our age\n\nlike the term constructive engagement,\n\nI am as obnoxious in private as I am with you,\n\nwith people I agree with.\n\nSo, like, when they're asking me to do stupid shit,\n\nI can assure you, I'm telling-\n\nWait, is this stupid shit or something?\n\nNo, no, I'm not saying you're asking me to do it,\n\nbut I can assure you one of the things\n\nyou can be certain of 100% is when somebody calls me\n\nand asking me to do some completely illogical,\n\nmostly it's illogical before it's immoral.\n\nThat's the thing people understand.\n\nIt's illogical.\n\nIt will not get you the result you think.\n\nI am telling them, This is illogical\n\nand we're not gonna do it.\n\nBy the way, there's variants of this commercial.\n\nI have commercial clients, this is not even moral,\n\nwho are like, Hey, could you give me 50 engineers\n\nto do some crazy thing that will not help their business?\n\nAnd you know what I'm telling them?\n\nNo.\n\nOne of the things that happens when people work with me\n\nis they see I'm meeting clients\n\nand they'll ask me to do something that makes no sense\n\nand I'll tell them, I can't go to my engineers\n\nand tell them to do something that makes no sense.\n\nYeah. And this is,\n\nI think a lot of these questions come down to that.\n\nNow, where we have to expand the prism of dialogue is\n\nI think in complete honesty,\n\nthere is a place where you and I, forget you and I,\n\nyou step in, you're just honestly talking to you's\n\njust like talking to my family.\n\nIt's like, where me and my family disagree.\n\nAnd I'll tell you where those places are.\n\nThey're on the border,\n\nthey're in Israel, and they're in Ukraine.\n\nAnd what's super surprising is I get yelled at all day\n\nabout of those three issues.\n\nAnd by the way, the issue I don't get yelled at\n\nabout the elite is about Ukraine.\n\nThe issue I get, obviously, the Israel thing is like,\n\nyou know, only thing anyone ever wants to talk about.\n\nYou would not, it's like somehow people have forgotten\n\nit's a country with a GDP smaller than Switzerland,\n\nbut you know, and then my progressive friends,\n\nit's all ICE all day.\n\nSome people might actually not even know\n\nwhat Palantir does.\n\nIn the shortest possible way,\n\ncould you explain to people who just know it\n\nas sort of something they see on a page and don't like\n\nand saying, Hey, this is what it really is?\n\nOr love.\n\nWe have a lot of people who love us\n\nand some people don't, but yeah,\n\nwe tend to elicit strong reactions on both sides.\n\nSo, that's definitely fair.\n\nIf you're internal or external intelligence,\n\nyou're using us to find terrorists\n\nand find organized criminals while maintaining security\n\nand maintaining the data protection of your country.\n\nSo, like the highest data protection environments\n\nin the world, Western Europe would love to get rid of us.\n\nThey try every day to get rid of us.\n\nBut building a data protection environment\n\nthat actually allows you\n\nto do anti-organized criminality environment\n\nwith that also does data protection\n\nat any level of granularity,\n\nat any level of complexity is very, very hard.\n\nAsk the German government.\n\nThey would love to find another alternative.\n\nAnd honestly, I'd have no problem\n\nwith them finding it, but it's very hard.\n\nSo, that's one thing we do.\n\nThen you have the battlefield,\n\nthe Project Maven, and also organizing the battlefield,\n\nwhat the Special Forces use it for.\n\nHow do you know where your troops are?\n\nHow do you bring them home with all the data\n\nthat you'd have from any source environment?\n\nHow do you manage assets while doing that?\n\nMeaning assets from the other side,\n\nassets meaning spies, basically.\n\nHow do you get the human,\n\nhow do you prepare your egress?\n\nHow do you get in and out of the battlefield safely,\n\nas safely as possible?\n\nSo, avoiding mines, avoiding enemies,\n\nthose things change rapidly on the battlefield.\n\nThat's a software problem that's powered\n\nin great part by us across America and with our allies.\n\nHow do you supply targeting capabilities to allies,\n\nUkraine, Israel, so that they get the product,\n\nbut obviously, we don't have access\n\nto the full data they use,\n\n'cause we're not part of those countries.\n\nThat's a Palantir thing.\n\nOn the commercial side, it's, you know, how do you to make,\n\nI mean the current version would be if you want AI to work,\n\nyou're gonna have to have precursor things.\n\nYou can think of it as like the precursor to make anything.\n\nWhat are those things gonna be?\n\nYou're gonna need high fidelity data.\n\nTo have high fidelity data, you're gonna need\n\nto be able to integrate your data\n\nwith a model you understand.\n\nYou're gonna have to build something called pipelining,\n\nmeaning you can serialize\n\nand deserialize a technical way of taking apart\n\nand putting together the assumptions within the data.\n\nYou're gonna have to be able to maintain your security model\n\nand maintain the logic and actions of your business.\n\nAnd you're gonna have\n\nto be able to extract that, so ontology.\n\nSo shorthand, if you're doing anything\n\nthat involves operational intelligence,\n\nwhether it's analytics or AI,\n\nyou're gonna have to find something like ontology\n\nor foundry and you know, and FTEs to install it.\n\nThat's Palantir.\n\nIt's interesting, 'cause you,\n\ngoing back a little, you implied that, you know,\n\nthe rest of Silicon Valley\n\nhasn't figured out how to do that.\n\nThat you're unique in exploiting that.\n\nWell it's, yeah.\n\nWhat I'm really saying is we know how to do it.\n\nIf you find someone else who can do it\n\nand you don't wanna work with us, buy it from them.\n\nI mean, is there anyone you consider a competitor?\n\nOur competition is actually political.\n\nThe woke left and the woke right\n\nwake up every day figuring out how they can hurt Palantir\n\nand if they get into power, they'll hurt Palantir.\n\nHow could you build a society\n\nwith unfettered migration in Europe and not have Palantir?\n\nI don't know how you're gonna do that,\n\nbut they think they can do that.\n\nIf they win, if the communists in France win,\n\nthey will pull us out.\n\nIf like the Mamdani win of the Democratic party takes over,\n\nI viewed that as my party.\n\nBut if that's the party I'm not in it.\n\nOr if the right woke wing,\n\nwhich is like everything is a conspiracy.\n\nAny use of technology is actually gonna only be used\n\nto eviscerate and attack us is like,\n\nour data protection part of Palantir\n\nis built into the software.\n\nIt is literally the hardest software to abuse in the world,\n\nbut they don't seem to want it.\n\nBut if you like, don't want meritocracy,\n\neither left or right, you don't like the consequence of it,\n\nyou hate Palantir.\n\nAnd that is actually our competition.\n\nAnd by the way, not that they believe it.\n\nThe thing that is protecting those people,\n\nthe people that hate us the most is actually our product.\n\nBecause it is the hardest product to misuse\n\nto take away the rights of human beings\n\nthat's ever been built.\n\nAnd don't believe me, just go look at it,\n\nspend 10 minutes looking at it, find a technical person\n\nand look at our architecture or look at it yourself.\n\nAnd that's actually our competition.\n\nAnd you know, in a weird way, we embrace the competition\n\nbecause they say these crazy things about us\n\nand then the smart people go look at it.\n\nMy head's spinning a little, how did Mamdani get in there?\n\nI would say some of is downstream from,\n\nif you explain to the world that labor's gonna be valueless,\n\npeople are gonna elect the most ridiculous people ever.\n\nWe have to build systems like Palantir\n\nand we have to explain to people,\n\nbut also let them see the results, the fruit of our labor\n\nthat their labor, meaning people with working class skills,\n\npeople with normal jobs,\n\nthat their labor's gonna become more important\n\nand more valuable over time with products like ours.\n\nWhich happens to be true.\n\nIf you run around saying that, you know,\n\noh, the economy is gonna completely shift\n\nto value creation only owned by 10,000 people,\n\npeople on the left and the right are gonna go nuts\n\nand they're gonna vote for people who are like basically,\n\nyeah, nothing I've said has ever worked in history.\n\nIt has never worked in history.\n\nYou cannot find a time in history\n\nwhere any of that stuff has ever worked, ever.\n\nThey still will gravitate toward it\n\nbecause they're afraid of what could work,\n\nwhich is like an AI-driven AGI environment\n\nwhere no one has a job\n\nand the only people who make money\n\nare like people sitting out here.\n\nAnd so, that's part of the problem.\n\nNow also, honestly, I mean, you know,\n\nI think universities and elite institutions\n\nhave played a really corrosive role here.\n\nPeople are teaching pagan religion views, again,\n\npagan religion as it's a new of religion with sacrifices.\n\nWho's the sacrifice?\n\nMe, I'm the sacrifice.\n\nAnd that, again, it's also like,\n\nit's a form of thought that has never worked.\n\nYou don't seem constrained to me.\n\nYou're you're doing great.\n\nI mean, I'm not complaining.\n\nYeah.\n\nPalantir, we're not victims of Palantir.\n\nYeah.\n\nWe're not playing the victimhood thing.\n\nWe don't, I don't think I'm a victim.\n\nI don't actually believe we should,\n\nthese things should be framed as victims.\n\nAnd yes, we're doing very well,\n\nand you know, we might even do better.\n\nYou'd have this bonkers earnings call in February.\n\nHuge, huge growth and-\n\nWell, it's like people who are not financial,\n\nwhich is most people, and honestly,\n\nI wouldn't be paying attention to this\n\nif I wasn't running Palantir.\n\nThose numbers are a little bit like flying saucer\n\ntook off numbers.\n\nSo, and you know, people are financial,\n\nmany of whom doubted us are like, wait a minute,\n\nthe plate dropped, because what it basically, it's\n\nwhat non-financial people might not appreciate\n\nis we're not just growing, we're growing with high margins.\n\nwith, and that's in at our scale basically.\n\nIn my view, never been done before,\n\nnot in a similarly situated business.\n\nYou said it was an anomalous like, you know,\n\nsome sort of historic moment,\n\nthat the company is anomalous.\n\nYou know, in a weird way we undervalue these\n\nor I undervalue the whole numeric side of our business,\n\nbecause it's downstream of value creation.\n\nSo, if you have a, no, if you are doing anything\n\nlike what we're doing, so call it 68% growth in the US,\n\nand again, we're doing it, you know, our way.\n\nSalesforce is anemic.\n\nWe're not running around really trying to sell our wares.\n\nWe have a conference here, people fight to get in,\n\nwhich is pretty cool.\n\nWe have the best clients in the world,\n\nespecially in America.\n\nClearly we've tapped into something.\n\nI'll tell you what we've tapped into.\n\nThere's essentially a simple thing.\n\nLLMs and software empowered LLMs create power\n\nper the expectation of preyed optimality\n\nbetween partner and vendor.\n\nYou are going to get paid in the future\n\na percentage of the value you create.\n\nAnd the value you create is going to be, you know,\n\nat some point objectively measured\n\nand it's going to flow into your financials and vice versa.\n\nSo, you have this unique culture\n\nand you even have called it a cult.\n\nIt's been called a cult.\n\nI wonder how much you cultivate that outsider mentality.\n\nIt reminds me we're both from Philadelphia.\n\nJason Kelce, after the first Super Bowl saying,\n\nNobody likes us, we don't care.\n\nThe thing people don't understand\n\nis there's a massive feature side to being an outsider\n\nor even popular.\n\nPeople forget, people always think\n\nof the bug size of being unpopular.\n\nLike, you know, you're unpopular, it's not pleasant,\n\nyou're not gonna like it.\n\nI don't like it actually.\n\nBut there are massive feature sides.\n\nLike, you get the best people in the world.\n\nLike someone says something ridiculously stupid\n\nabout Palantir.\n\nFive people look at it and they,\n\nthe fifth person who's exactly the kind of person\n\nyou want inside your business\n\nor will be the person buying your product someday\n\nor investing in you says, Hey,\n\nit can't be as simple as that.\n\nIt's a conspiracy.\n\nIt can't be as simple as they want to eviscerate my rights,\n\nbecause those rights would be the same rights\n\nthat like an agent would need protected\n\nby the agency or something.\n\nThen those people investigate and investigate\n\nand investigate and they're like, Wow,\n\nthis is a real interesting company.\n\nAnd they're thinking of the 10th derivative of this problem,\n\nnot the simplistic bullshit\n\nthat somebody online saying\n\nhas no idea how our products work.\n\nAnd then you get the best people\n\nlike a really unexpected consequence of this.\n\nThere's no country in the world where our brand\n\nis as bad as France.\n\nWe have the best French employees in the world,\n\nespecially in US commercial.\n\nAnd why did they join?\n\nBecause every time the communist party\n\nsays we are doing these crazy things\n\nand they clearly know nothing\n\nabout what they're talking about,\n\nthe smartest person in France says,\n\nWait a minute, if it was that simple,\n\nany idiot would've done it.\n\nBy the time they're done doing the diagnostic,\n\nthey're like, Hey, there's only one company in the world\n\nI wanna work at.\n\nAnd that's how we have the best\n\nFrench employees in the world.\n\nThe best French employees arguably in the world\n\nare at Palantir in America.\n\nAnd that's very counterintuitive.\n\nWorking at a company that's apparently a CIA front,\n\nwhich is like, yeah, obviously complete bullshit.\n\nWell, yeah, no, you may not be a front.\n\nThank you so much, Alex.\n\nThank you very much.\n\nBye.\n\n[intense music]",
  "authors": [
    "Condé Nast"
  ],
  "url": "https://www.wired.com/video/watch/big-interview-palantir-ceo-alex-karp-on-government-contracts-immigration-and-the-future-of-work"
}