{
  "title": "Jonathan Hay talks about his ‘Diddy’ sexual abuse accusations",
  "text": "LOS ANGELES —\n\nIn March 2023 – eight months before Cassie Ventura filed the bombshell lawsuit against her ex-boyfriend Sean “Diddy” Combs that would ignite his public downfall and ultimately lead to his criminal conviction – another accuser was contemplating coming forward.\n\nVideo Ad Feedback Jonathan Hay talks about his Diddy accusations 2:53 • Source: CNN Jonathan Hay talks about his Diddy accusations 2:53\n\nMusic producer and publicist Jonathan Hay had contacted a civil attorney in the spring of 2023 to discuss his claims of being sexually battered by Combs. After speaking with the attorney’s office, Hay got cold feet, fearful of standing up against a figure as powerful as Combs. He was, he said, “terrified.”\n\nCNN has reviewed email correspondence showing Hay reached out to the civil attorney’s office in March 2023.\n\n“I was like, I can’t do this,” Hay said of his first attempt to come forward with his claims against Combs in early 2023. “I’m just not ready.”\n\nHay finally filed his claims against Combs – then as a “John Doe” – in July 2025, shortly after Combs was convicted by a New York jury on two federal prostitution-related counts that would lead to him being sentenced to more than four years.\n\nOnce Ventura filed her lawsuit and dozens of other civil accusers came forward with lawsuits, he felt encouraged to tell his story. Hay said that he’d never considered that there could have been others who had allegedly been abused by Combs.\n\nCombs denies all accusations against him. Roughly 70 accusers have brought civil lawsuits, some of which have been dismissed.\n\n“Once Cassie’s lawsuit came out,” Hay said, “I was like, ‘Oh my gosh, here we go. And then once the raids happened, I was like holy crap. That’s when I was like, ‘Okay, now is my time. Finally, I just decided that, alright, I’m going to go forward with this.”\n\n“I just wanted someone to listen,” he said.\n\nNow, Hay’s claims are at the center of a new investigation, launched this week by the Los Angeles County Sheriff’s Department.\n\nA spokesperson for the Sheriff’s Department confirmed that their Special Victims Bureau is investigating Hay’s claims after receiving a copy of his police report, first documented in September 2025 by police in Largo, Florida, where Hay resides.\n\nIn the police report, Hay says he suffered from sexual battery by Combs in 2020, and then again in 2021, when he was working on a remix of Christopher “The Notorious B.I.G.” Wallace’s music as a tribute project, honoring one of Combs’ closest collaborators. Hay worked on the new music with the rapper’s son, CJ Wallace.\n\nIn the 2020 incident, Hay said he was working at a photoshoot when he found himself in the same room as Combs, who began to masturbate into one of Biggie’s shirts. The police report details that Combs “removed the shirt to uncover his penis and told Hay to come finish him off.” The report states that Hay told police he was in shock and “stated that Combs then finished himself off and ejaculated on one of Notorious B.I.G. shirts” and then threw the shirt on Hay, “simultaneously saying, ‘Rest in peace BIG.’”\n\nIn 2021, Hay told police that Combs forced him to perform oral sex on him, which he said made him feel suicidal.\n\nHay said that a detective from the LASD’s Special Victims Bureau contacted him on Tuesday this week to notify him that she had been assigned to his case.\n\nHay is cooperating with authorities, hopeful that their active investigation may lead to further criminal charges.\n\n“Biggie was like his supposedly his best friend,” he said. “To just do that in a shirt and to attack me like he had?” Hay said. “He doesn’t need to be out on the streets.”\n\n‘A complete fantasy, totally devoid of reality’\n\nVideo Ad Feedback Wagmeister reports on allegations Diddy faces that could potentially lead to more charges 2:12 • Source: CNN Wagmeister reports on allegations Diddy faces that could potentially lead to more charges 2:12\n\nHay’s allegations first became public this July when he filed his lawsuit anonymously against both Combs and Wallace.\n\nWallace is named as a defendant with Hay claiming that he and others “conspired” with Combs to “allow or assist in Combs’ ability to carry out” his actions against Hay.\n\nWallace has filed a defamation suit against Hay. In it, he claims that Hay falsified these accusations because he was “irate” that Biggie’s estate decided not to release the majority of the songs produced back in 2020.\n\n“Jonathan Hay’s allegations against CJ Wallace will be shown to be a complete fantasy, totally devoid of reality,” Jeremiah Reynolds, an attorney for Wallace, told CNN. “We look forward to Hay eventually being held liable in court for defamation.”\n\n“CJ knows what happened,” Hay said. “He was there. He lived it.”\n\nCombs also denies Hay’s claims, as he has done with the dozens of accusers who have sued him.\n\nWhen contacted by CNN, a lawyer for Combs issued a blanket denial statement.\n\n“As Mr. Combs’ legal team has repeatedly stated for over a year now, he cannot address every meritless allegation in what has become a media circus. Let me make it absolutely clear, Mr. Combs categorically denies as false and defamatory all claims that he sexually abused anyone,” Jonathan Davis, a civil attorney for Combs, said in a statement. “He looks forward to vindicating himself in court, where such matters are decided – and not in the media – based on admissible, material evidence, not rank speculation and unsubstantiated allegations.”\n\nHay said he is not surprised that Combs continues to deny his allegations, and he remains focused on pursuing justice through his case.\n\n“I’m hoping that when he gets out of jail,” Hay said, “that he is taken straight to jail in California, or to go through the court proceedings in California, and that he spends the rest of his life in jail.”\n\nAfter a two-month federal trial in New York earlier this year, Combs is currently serving his four-plus year sentence at Fort Dix federal prison in New Jersey.\n\n“We’ve got to respect the jurors and the decision that they made,” Hay said of the conviction, which Combs is currently appealing. “At least he got some time. And hopefully we can add more.”\n\nJason Kravarik contributed to this report.",
  "authors": [
    "Elizabeth Wagmeister"
  ],
  "url": "https://www.cnn.com/2025/11/20/entertainment/lawsuit-diddy-assault-jonathan-hay"
}