{
  "title": "Big Swings Rock Wall Street As Stocks Drop Sharply After Erasing A Morning Surge",
  "text": "LOADING ERROR LOADING\n\nNEW YORK (AP) — Jarring swings keep rocking Wall Street, and U.S. stocks erased a big morning gain to drop on Thursday as the market remains skittish following weeks of doubts and erratic moves.\n\nAfter initially soaring toward what seemed like its best day since May, with an early surge of 1.9%, the S&P 500 erased all of it and fell 1.6%. The Dow Jones Industrial Average dropped 386 points, or 0.8%, and the Nasdaq composite sank 2.2%.\n\nAdvertisement\n\nThe sharpest losses again hit what used to be the market’s biggest winners. Nvidia, cryptocurrencies and other areas that had soared with nearly relentless momentum, as traders feared missing out on more gains, forced the market lower. Bitcoin dropped below $87,000, down from nearly $125,000 last month.\n\nThe market had been shaky coming into Thursday, largely because of twin worries: Nvidia and other superstar stocks caught up in the frenzy around artificial-intelligence technology may have simply shot too high, and the Federal Reserve may be done delivering the invigorating cuts to interest rates that Wall Street loves.\n\nNvidia initially appeared to tamp down the worries about a bubble for AI stocks after reporting a big profit for the summer, along with a forecast for coming revenue that easily cleared analysts’ expectations. By delivering strong profits and indicating more are coming, Nvidia can justify its stock’s price gains and make it look less expensive.\n\nAdvertisement\n\nTrader Vincent Napolitono, foreground, works on the floor of the New York Stock Exchange, Thursday, Nov. 20, 2025. (AP Photo/Richard Drew) via Associated Press\n\nGiven Nvidia’s forecasts, “it is very hard to see how this stock does not keep moving higher from here,” according to analysts at UBS led by Timothy Arcuri. They also said “the AI infrastructure tide is still rising so fast that all boats will be lifted.”\n\nNvidia jumped to an early gain of 5% but then dropped to a loss of 3%. Because it’s the biggest company in the U.S. market by value, Nvidia’s stock has more pull on the S&P 500 than any other company’s.\n\nAdvertisement\n\nDespite Nvidia’s big numbers, worries about a potential AI bubble aren’t gone. The concern among investors is that all the dollars pouring into AI chips and data centers may not ultimately produce the big profits and productivity for the economy that proponents have been promising.\n\nYes, Nvidia expects to sell another $65 billion of chips in the coming three months, which is more than analysts expected. But will all those chips actually create much bigger profits for Amazon and other companies using them? That question — whether all the investment in AI will prove to be worth it in the end — is still unanswered.\n\nThe most recent survey of global fund managers by Bank of America showed a record percentage of investors saying companies are “overinvesting.”\n\nAdvertisement\n\nAmazon went from an early gain of 2.1% Thursday to a loss of 2.5%. Palantir Technologies swung from a jump of 5.5% to a loss of 5.8%.\n\nA television broadcasts crypto market news at the Nasdaq MarketSite in New York, US, on Thursday, Nov. 20, 2025. (Michael Nagle/Bloomberg via Getty Images) Bloomberg via Getty Images\n\nThe last time the overall stock market had swings in one day as wild as Thursday’s was in April, when President Donald Trump shocked the world with his stiff “Liberation Day” tariffs.\n\nAdvertisement\n\nFor the second worry that’s been dogging Wall Street, interest rates, Thursday’s jobs report from the U.S. government came in mixed and offered some relief. Financial markets initially seemed to pick the data apart for encouraging signals, according to Seema Shah, chief global strategist at Principal Asset Management.\n\nThe report showed hiring by U.S. employers was stronger in September than economists expected, which may suggest the economy remains solid. But it also said the unemployment rate worsened slightly, which could give the Fed reason to cut its main interest rate at its next meeting in December.\n\nTraders still see a December rate cut as relatively unlikely, giving it a roughly 40% probability, according to data from CME Group. But that’s better than the 30% chance they saw a day earlier.\n\nAdvertisement\n\nWhat the Fed does is critical for the stock market because prices ran to records in part because of expectations for continued cuts to rates. The Fed has already cut rates twice this year to shore up the slowing job market. But lower rates can worsen inflation, which has stubbornly remained above the Fed’s 2% target.\n\nOn the winning side of Wall Street was Walmart, which rallied 6.5% after the retailer delivered another standout quarter. It reported strong sales and profits that blew past Wall Street expectations as it continues to lure cash-strapped Americans nervous about the economy and prices.\n\nThat wasn’t enough to drown out the losses for Nvidia and tech. Companies enmeshed in the crypto industry also tumbled, as bitcoin dropped to its lowest price since April. Robinhood Markets fell 10.1%, and Coinbase Global sank 7.4%.\n\nAdvertisement\n\nAll told, the S&P 500 fell 103.40 points to 6,538.76. The Dow Jones Industrial Average dropped 386.51 to 45,752.26, and the Nasdaq composite sank 486.18 to 22,078.05.\n\nIn the bond market, the yield on the 10-year Treasury eased to 4.09% from 4.13% late Wednesday.\n\nIn stock markets abroad, indexes rose across much of Europe and Asia.\n\nJapan’s Nikkei 225 jumped 2.6%, and South Korea’s Kospi rose 1.9% for two of the bigger gains.\n\n___",
  "authors": [
    "Stan Choe"
  ],
  "url": "https://www.huffpost.com/entry/big-swings-rock-wall-street-stocks-drop-sharply-erasing-morning-surge_n_691f8486e4b047290e295fe2?origin=home-zone-c-unit"
}