{
  "title": "Acusan a hombre estadounidense de matar a una mujer de Guatemala que se presentó a trabajar en la casa equivocada",
  "text": "CNN Español —\n\nUn estadounidense fue acusado formalmente por las autoridades locales del estado de Indiana de matar a María Florinda Ríos Pérez de Velásquez, una guatemalteca de 32 años, quien recibió un disparo mortal en la cabeza al presentarse a trabajar en el domicilio equivocado en Whitestown, informó el lunes la Fiscalía del condado de Boone.\n\nLa Fiscalía señaló en un comunicado que acusó al hombre —identificado como Curt Andersen, residente de Whitestown— de “homicidio voluntario, que consiste en matar a sabiendas mientras se actúa bajo un arrebato repentino”.\n\nEste cargo es un “delito grave de nivel 2”, indicó la Fiscalía, y puede conllevar una pena de entre 10 y 30 años de prisión y una multa de hasta US$ 10.000 si es encontrado culpable, según la ley de Indiana.\n\nLos registros públicos del caso indican que está programada una audiencia inicial para el viernes 21 de noviembre.\n\nFoto policial de Curt Andersen, de 62 años, acusado de la muerte de María Florinda Ríos Pérez de Velásquez, mujer guatemalteca de 32 años. JailTracker/Oficina del sheriff del condado de Boone\n\nEn sus investigaciones, que llevaron casi dos semanas desde el fallecimiento, las autoridades consideraron varias posibilidades antes de la acusación, entre ellas la revisión del caso bajo la ley “Stand Your Ground” (una legislación de Indiana de defensa propia), la cual permite a individuos usar la fuerza razonable —incluida la fuerza letal— para impedir que alguien entre ilegalmente en su propiedad. Sin embargo, los fiscales afirmaron que esta ley no aplica a las acciones de Andersen del 5 de noviembre, cuando disparó a Ríos Pérez.\n\n“Es de vital importancia que los ciudadanos del condado de Boone comprendan que nuestra decisión de hoy no debe interpretarse en modo alguno como un desafío a la ley ‘Stand Your Ground’ (defensa propia) de Indiana ni al derecho de una persona a la autodefensa. Respetamos esas leyes, creemos en ellas y las defenderemos. Basándonos en las pruebas y circunstancias particulares de este caso, hemos determinado que las acciones de Curt Andersen no entran en las protecciones legales que ofrece la ley de defensa propia de Indiana”, añadió la Fiscalía local en un comunicado este lunes.\n\nPor su parte, Guy Relford, abogado de Andersen, dijo que la muerte de Ríos Pérez es “una tragedia”, pero que están “decepcionados” por la acusación de la Fiscalía.\n\n“Espero poder demostrar ante el tribunal que sus acciones estaban plenamente justificadas por la disposición de la ‘doctrina del castillo’ de la ley de legítima defensa de Indiana”, escribió Relford en un mensaje en X.\n\nCNN se comunicó con Relford para saber si tenía alguna postura adicional sobre el caso, pero respondió que no hará más comentarios hasta el juicio.\n\nEn general, las leyes de defensa propia y las “doctrinas del castillo” permiten a las personas responder a amenazas o a la fuerza sin temor a ser procesadas penalmente en cualquier lugar donde tengan derecho a estar. La “doctrina del castillo” es la noción jurídica según la cual tu hogar es tu castillo y tienes derecho a utilizar la fuerza letal para defenderlo y no retroceder. Varios estados han consagrado la doctrina del castillo en su legislación, a veces con directrices ligeramente distintas sobre cuándo se puede utilizar la fuerza letal.\n\n¿Qué ocurrió? Esto dijeron los involucrados en el caso\n\nRíos Pérez y su esposo, Mauricio Pérez Velásquez, quienes formaban parte de un equipo de limpieza, se presentaron a trabajar en la dirección equivocada en la mañana del 5 de noviembre, según la investigación compartida por la Fiscalía, que añadió que la casa correcta se encontraba “directamente al este” de la vivienda de Curt Andersen y su esposa, Yoshie Andersen, que ha sido su residencia durante los últimos cuatro años.\n\nEn su declaración ante la Policía de Whitestown, Andersen —un hombre blanco de 62 años, según su ficha de arresto— dijo que dos personas intentaban entrar a su casa con unas llaves y que estaban “empujando” la puerta principal. Señaló, además, que los intentos de entrar a su vivienda se estaban volviendo cada vez más “agresivos”, por lo que tomó su arma de fuego.\n\nAndersen agregó que, sin decir palabra alguna a María y Mauricio ni abrir la puerta, disparó en una ocasión hacia ella. Los investigadores hallaron un orificio de bala en esa puerta, pero no pruebas de que la puerta haya sido forzada.\n\nEn tanto, al declarar ante la Policía de Whitestown, Pérez Velásquez dijo que su jefe le envió la dirección de la casa en un mensaje, pero que “no se había dado cuenta de que los números asignados a la casa eran diferentes a los que le había enviado su jefe”.\n\nSin embargo, añadió que su jefe le mandó un enlace para llegar a la casa vía GPS. Al abrirlo, el navegador los redirigía a la dirección de los Andersen.\n\nPérez Velásquez indicó que, tras el disparo, se quedó sosteniendo a su esposa, María, en brazos y llorando, y señaló que en ningún momento escucharon a personas ni otros ruidos en la casa. Andersen declaró que desde la vivienda se escuchaba el llanto de una de las personas que estaban en su puerta.\n\nYoshie Andersen dijo al declarar ante la Policía que primero escuchó un disparo y luego su esposo le pidió que llamara al 911.\n\nAsimismo, Pérez Velásquez dijo que llamó al 911. Desde su llegada al domicilio equivocado hasta la llamada de emergencia, pasaron “aproximadamente dos minutos”, declaró el esposo de Ríos Pérez.",
  "authors": [
    "Uriel Blanco"
  ],
  "url": "https://cnnespanol.cnn.com/2025/11/20/eeuu/acusan-hombre-estadounidense-muerte-mujer-guatemala-casa-equivocada-orix"
}