{
  "title": "Denim gets the designer treatment on Vinted’s fashion show",
  "text": "It’s week three of RE/style, the fashion competition series on Prime Video. As usual, eight talented designers from across Europe are re-imagining pre-loved clothing as they compete for a profile-boosting showcase at the Oxfam x Vinted Style for Change fashion show, an event taking place during London fashion week. But this week the judges have decided to change things up.\n\nRecapped: patterns emerge\n\nThis episode, it’s all about denim. And when the designers entered the design house to be greeted by host Emma Willis and judges Zadrian Smith and Melissa Holdbrook-Akposoe, two pieces of secondhand denim clothing had been chosen for them. This means they’ll have just three additional items from the pre-loved wardrobe (instead of the usual five) to create a “statement” denim piece. Once they’ve styled their design using other pre-loved gems, their complete look should reimagine denim – the iconic fabric pretty much everyone has in their wardrobe. With just six hours on the clock, can they show us denim in a new light? Whoever succeeds will be one step closer to winning a career-defining prize.\n\nView image in fullscreen The contestants receive this week’s brief: denim\n\nFrom the outset, the British contingent – 22-year-old Emily, from York, and 29-year-old Saabira, from London – are in their element. In week one, where the design task was all about “signature style”, they both chose to use denim, so now is another chance to wow the judges. Emily is using what’s known as a “tessellation technique” to create a pair of sculptural trousers. She’s cutting her fabric into squares before sewing them into strips to make trouser legs with zero wasted material. Saabira – who was forced to miss the runway last week after cutting herself with scissors – is channelling her urban streetwear style with two custom denim pieces. Inspired by the 2000s, she’s using a draping technique and hand-painting to create a truly one-of-a-kind design.\n\nAt this point in the competition, we’re really seeing how each designer interprets the challenges through their signature aesthetic, and denim week is no different. Shanie, 26, from France, tends to gravitate towards simplicity. She’s making a unisex denim two-piece, with an elegant flowing silhouette. The gender-subverting look is designed to showcase the versatility and creativity of denim. And at the other end of the spectrum is Alejandro, from Spain. He’s making a deconstructed cape out of white denim, using structural techniques and pleating to bring his otherworldly piece together. At 21, hat enthusiast David might be the youngest designer in the group but that hasn’t stopped him from looking to medieval influences. Drawing inspiration from soldiers who would reuse their armour after battle, his design features a denim hood, and will be creatively styled to look like chain mail.\n\nView image in fullscreen Catwalk time: the contestants’ creations\n\nThis week, the judges are joined by Irish TV presenter Laura Whitmore. As a self-confessed B*Witched superfan, double denim is in her blood. “I’m a huge advocate for sustainability,” she says. “I love pre-loved, because fashion lives forever.”\n\nBy week three, we’re starting to see recurring pitfalls on the runway. Some of the designers keep incorporating too many ideas into their designs, making them look a little messy and chaotic, while others have been struggling with timing and execution. (This week, judge Melissa even compared one piece to a “pitta bread”, which goes great with hummus, but … not so well with denim.) And for others, their recurring issue is styling, with footwear and accessories that distract from the design.\n\nView image in fullscreen This week’s guest is Laura Whitmore\n\nHowever, on the runway, one designer was in a league of their own, creating a design that showcased their signature style, while also highlighting the versatility of denim in a really interesting way. Who was crowned this week’s “head designer”? Tune in to the episode to find out.\n\nRestyled: Louis’ look at how to live in denim\n\nSince 1873, when Nevada tailor Jacob W Davis manufactured what are thought to be the first pair of jeans – before moving his production to the facilities of a designer you might have heard of: Levi Strauss & Co – denim has become one of the most widely worn fabrics in the world. And with each decade, there is the opportunity to reimagine how it should be worn. You don’t just wear denim – you live in it.\n\nOne of my favourite denim style icons is George Michael – who often wore a denim jacket and jeans on stage in the 1980s. We can learn from Michael’s relatively understated take on it, which is basically the opposite of Britney Spears and Justin Timberlake’s iconic denim-on-denim-on-denim 2001 red carpet look. Styling-wise, Michael usually kept things pretty simple, with a plain white T-shirt or vest. And he also colour-matched the denim pieces, which stops the outfit from looking too busy.\n\nThis is the biggest rule about styling denim. If you’re wearing a “statement” piece – such as a pair of dungarees, flared jeans or a double-denim combo – then you want that to be the focal point of the outfit, so it’s best to keep styling fairly minimal. But denim can also be a neutral canvas that you can use to accentuate other pieces. Whether it’s an oversized handbag, a new-to-you pair of trainers, or an accessory such as sunglasses, denim can be an understated and versatile way to let other Vinted finds do the talking.\n\nResold: customise your denim finds from Vinted\n\nNow that we’re free from the tyranny of spray-on skinny jeans – for now! – Vinted is the perfect place to experiment with different fits. (And it’s also a great way to raise some extra money to buy these Vinted gems, because you can detox your wardrobe of the styles you no longer wear.) Personally, I think that everyone needs a relaxed, straight-fit pair of jeans that can be worn casually with Dr Martens or trainers. You can search for these on Vinted under the specific brand name, such as Levi’s, Wrangler or Dickies. And the beauty of buying pre-loved is that you can find higher price-point brands for less, such as jeans from Calvin Klein.\n\nWhether it’s jeans or jackets, dungarees or dresses, denim is one of the most satisfying types of clothing to shop for on Vinted because the pre-loved factor only adds to its character. (There’s just something about pre-loved denim, right? It always looks better.) If you’ve got a creative streak, why not take a leaf out of the RE/style designer’s book and use Vinted to shop for denim that you can customise yourself? Find a jacket you can personalise with patches, or a pair of jeans you can turn into shorts with a frayed hem. Oh, and here’s a tip: for jeans in particular, sizing can vary by brand, so ask your Vinted seller to send you measurements, to make sure they’re a perfect fit.\n\nJeans, jackets, jumpsuits – find your next denim staple on Vinted",
  "authors": [
    "Louis Staples"
  ],
  "url": "https://www.theguardian.com/restyle-recapped/2025/oct/13/vinted-fashion-show-episode-3-denim-week-style-moments"
}