{
  "title": "Reading is 'the best thing' for children, Oxfordshire author says",
  "text": "Reading is 'best thing' for children, author says\n\n48 minutes ago Share Save Galya Dimitrova Oxford Share Save\n\nEdmund Blok Author Sylvia Vetta said the exhibitors and visitors to the Oxford Independent Book Fair had doubled every year\n\nThe organiser of an independent publishing event has said reading for pleasure is \"the best thing you can ever give to a child\". Author Sylvia Vetta is one of the forces behind the free Oxford Indie Book Fair which takes place on Sunday at the University of Oxford Examination Schools. She described the decline in reading enjoyment as \"a catastrophe\", as National Literacy Trust report shows the reading crisis persists. Oxford Brookes University chancellor and author Paterson Joseph, who will be part of the fair for a second year, said \"we just need to be clever about how we deliver books to children and how\".\n\nMrs Vetta said that at seven, she would walk a mile and a half to her local library every Saturday. \"I would take Enid Blyton's The Famous Five, but I also took out books on China, on India.\" Mr Joseph describes himself as \"a serial bunker-off\" at school but books were \"a wonderful escape\". \"Not only are you learning a greater vocabulary, you're also understanding worlds that are very different to yours.\"\n\nReuters Actor, author and Oxford Brookes University chancellor describes books as \"a wonderful escape\"\n\nBut The National Literacy Trust 2025 annual survey shows reading for pleasure at \"its lowest in 20 years\". It is based on 114,970 responses on the reading habits of children and young people aged 5 to 18 from various backgrounds. With just 1 in 3 respondents saying they enjoyed reading in their free time in 2025, that marks \"a 36% decrease in reading enjoyment levels since we started asking about this in 2005\". \"I think we just need to be clever about how we deliver books to children and how,\" said Mr Joseph, who has an acting career in TV and film. \"How we get them interested in in the tactile nature of of having a copy in their hands and the beauty of a book, its colour, its weight, its smell, everything about it should be a delight.\"",
  "authors": [],
  "url": "https://www.bbc.com/news/articles/cgmx4007097o"
}