{
  "title": "JD Vance expressed hope his Hindu wife will become a Christian. That’s ruffled feathers in India",
  "text": "When JD Vance told a stadium of thousands he hoped his wife would one day be moved “by the Christian gospel” the same way he was, he inadvertently stepped into a contentious dialogue in India and among the diaspora about religious freedom and, for some, evoked memories of the country’s complicated past with Christian proselytizing.\n\nSpeaking at an event last month with Turning Point USA at the University of Mississippi, Vance was asked by an audience member about Christianity and American patriotism.\n\n“Why are we making Christianity one of the major things that you have to have in common to be one of you guys? To show that I love America just as much as you do?” the audience member asked.\n\nIn an assertive and lengthy response that began on immigration, Vance then discussed his interfaith marriage: “My wife did not grow up Christian. I think it’s fair to say she grew up in a Hindu family but not in a particularly religious family.”\n\nRaised in an evangelical family, Vance converted to Catholicism in 2019. His wife, Usha Vance, who grew up in Southern California and is of Indian descent, was raised in a Hindu household.\n\n“Do I hope eventually that she is somehow moved by the same thing that I was moved by in church? I honestly do wish that because I believe in the Christian Gospel, and I hope eventually my wife comes to see it the same way,” Vance went on to say.\n\nAs the debate around those comments began to swell online among some Indians and the Indian diaspora, Vance responded to a since-deleted comment on X, writing that “like many people in an interfaith marriage,” he hopes his wife may see things as he does one day, but would continue to support her regardless.\n\nSpeaking on October 30 at the Turning Point USA event honoring his longtime friend and late conservative political activist Charlie Kirk, Vance explained that he and his wife were “agnostic or atheist” when they met.\n\n“We decided to raise our kids Christian,” the vice president said, adding that the couple’s 8-year-old son, Vivek, had his first communion a year ago –– a remark that drew thunderous applause.\n\nPope Leo XIV meets with Vice President JD Vance and second lady Usha Vance at the Vatican, May 19. Simone Risoluti/Vatican Media/Reuters\n\nUsha Vance talked about navigating raising children in an interfaith marriage during an interview with Meghan McCain in June, noting she and her husband had several conversations about it during his conversion to Catholicism.\n\n“I’m not Catholic and I’m not intending to convert or anything like that,” Usha Vance said.\n\nShe added that while their children attend Catholic school, “they can choose whether they want to be baptized Catholic.” They are also exposed to the Hindu faith and traditions through her family, she said.\n\n“My grandmother is a particularly devout Hindu. She prays every day. She goes to the temple regularly. She’ll do her own pujas (prayer rituals).”\n\nDuring the event last month, the vice president said, “One of the most important Christian principles is that you respect free will … You figure this stuff out as a family, and you trust in God to have a plan, and you try to follow it as best as you can.”\n\nBut, despite Vance’s invocation of free will, his remarks struck a nerve –– some described the vice president’s words as denigrating towards Hindus –– and broadly, South Asians –– at a time of rising hostilities towards immigrants in the US.\n\n“It’s ridiculous and absolutely wrong,” 25-year-old Kush Mehta of New Delhi told CNN of Vance’s comments expressing his hope his wife would convert. “I’m in favor of everyone having their own identity, their own values, and their own spiritual path. No one should be forced or pressured into any religion.”\n\n“Vance felt compelled to declare that his wife was indeed raised Hindu, but not that Hindu,” CNN affiliate CNN-News18 editor Shubhangi Sharma wrote in an opinion column. “In a political climate so charged against Indian immigrants, this is not just personal. It’s political. It’s a presidential call to convert.”\n\n“When an elected leader treats his faith as the ultimate ideal for everyone, including his wife, it ceases to be personal,” Areena Arora, a journalist with The Hindu, wrote in an opinion piece, noting at the time of his baptism six years ago, Vance told The American Conservative: “My views on public policy and what the optimal state should look like are pretty aligned with Catholic social teaching.”\n\nVice President JD Vance speaks during a Turning Point USA event at the University of Mississippi in Oxford, Mississippi, October 29. Jonathan Ernst/Reuters\n\nA reminder of India’s colonial past\n\nFor some, Vance’s comments were a reminder of India’s painful past, where the arrival of Europeans in the late 15th century heralded Christian proselytization, prejudice and, at times, forced conversions - particularly under British colonial rule.\n\n“The belief that the Christian religion must shape public order is the same civilisational justification that fuelled Europe’s conquest of the world,” Arora, a journalist with The Hindu, wrote.\n\n“Because of the differences between how Hindus and Christians think of religion, and because of the colonial history of Christian evangelizing, many Hindus today still think of Christianity as a kind of undigestible ‘foreign faith,’” said Chad Bauman, a professor of religious studies at Butler University in Indiana whose research focuses on the interactions and conflicts between Hindus and Christians.\n\n“This view is particularly common among the supporters of the party currently in charge,” Bauman added, referring to Indian Prime Minister Narendra Modi’s ruling Bharatiya Janata Party and its brand of Hindu Nationalism.\n\nIndia has seen recurring ethnic and religious clashes for centuries – but tensions have surged in recent decades amid a rise in violence against the Christian and Muslim minorities and, most notably, since the BJP came to power in 2014.\n\nIndia’s constitution guarantees freedom of religion, although some critics argue that religious freedoms have been eroded under the BJP at the expense of non-Hindu minorities. The issue of changing religion remains deeply controversial, and multiple states have put in place laws restricting religious conversions for all faiths.\n\nBauman said Vance’s remarks also confirmed a common stereotype many Hindus have of religion in Trump’s America: “America is not a nation of religious tolerance and pluralism but rather one that privileges Christianity over all other religions.”\n\nSeveral social media users described Vance’s comments as contrary to American values.\n\nOne X user criticized Vance for what they viewed as him casting Usha’s Hindu faith as a “problem to be fixed,” writing: “This isn’t American values; it’s weak leadership & poor politics, bending to MAGA pressure, not defending her dignity.”\n\nAnother user wrote on X: “When JD Vance had hit his lowest, it was his ‘Hindu’ wife and her Hindu upbringing that had helped him navigate through the tough times. Today in a position of power, her religion has become a liability. What a fall.”\n\n‘She has to stick to her roots’\n\nFor some in India, Usha Vance’s position in the administration as a woman of Hindu faith has become a point of pride.\n\n“It’s amazing … to see someone with Indian roots and a Hindu background in such a visible, powerful space in the US. It shows how far the community has come and how diverse leadership is becoming,” said Mehta of Mumbai.\n\nIf the second lady does convert, “It would create a lot of backlash from people who are very staunch in their beliefs,” said Vanessa Almeida, a business owner in Goa.\n\n“She has to stick to her roots as much as possible,” Almeida said. “That’s what the community has been hoping for.”\n\nCNN has reached out to the vice president and second lady’s offices.\n\nThen Republican vice presidential candidate JD Vance and his wife Usha Vance arrive at a campaign rally, July 27, 2024, in St. Cloud, Minnesota. Adam Bettcher/AP\n\nVance was quick to defend himself on social media against backlash, writing in the X post that the criticism wreaked “of anti-Christian bigotry.”\n\n“She is not Christian and has no plans to convert,” Vance clarified, adding that Usha Vance encouraged him to “reengage” with his faith many years ago.\n\n“But like many people in an interfaith marriage –– or any interfaith relationship –– I hope she may one day see things as I do,” he goes on to say. “Regardless, I’ll continue to love and support her and talk to her about faith and life and everything else, because she’s my wife.”\n\n“This is completely in contrast to Vance’s previous comments that his wife’s Hindu upbringing and values inspired his own return to faith,” Priyanka Deo, US correspondent of Indian network NDTV, said on Instagram, adding that his latest remarks suggest acceptance in the United States is conditional and predicated upon becoming a Christian.\n\nVance, who converted to Catholicism while already married, has said his wife encouraged him to explore his faith and that his family influenced him in the decision.\n\n“I remember when I started to reengage with my own faith, Usha was very supportive,” Vance said during an interview with Fox News in June 2024.\n\nDuring the same interview, Usha Vance said she supported her husband’s decision for a few reasons, including seeing the power of her parents’ faith. “That was one of the things that made them such good parents. That made them, really, very good people.”\n\n“I knew that JD was searching for something. This just felt right for him,” she added.\n\nWooing the Republican base?\n\nVance’s comments come ahead of the 2028 election. Trump, in August, suggested Vance was “most likely” the heir apparent to the Make America Great Again movement –– the furthest he’s gone in backing Vance as a future presidential candidate.\n\nVance also told Fox News recently he plans to talk to Trump about potentially running after the 2026 midterm elections.\n\nRam Puniyani, a Mumbai-based writer and critic of Hindu fundamentalism, said he thinks Vance’s comments trample on freedom of religion –– an essential tenant of any democratic society, be it the United States or India, which is still widely regarded as the world’s largest democracy.\n\n“I believe that America’s civic society had much more liberal attitudes earlier, but those attitudes are getting rigid, and this is not a healthy thing for the growth of democracy worldwide,” he added.\n\nUsha Vance has not spoken out about her husband’s comments, though some have jumped quickly to her defense.\n\n“No one has been harsher on JD Vance’s policy than I have,” wrote California Democratic Rep. Ro Khanna, who is also Hindu, on X. “But his wife is an accomplished daughter of immigrants, and they have young kids. Attack on the policies. Leave his family out of it.”\n\nIn response to others who have called Usha Vance a threat to the “MAGA base,” McCain, daughter of the late Sen. John McCain, said the second lady was a “huge asset” to the Republican party, someone who bridged party and political lines and “brought warmth” to the vice president.\n\n“She is among other things a modern mother and a style icon,” McCain wrote on X. “She’s personally my favorite person in the Trump administration.”",
  "authors": [
    "Karina Tsui",
    "Matthew Rehbein"
  ],
  "url": "https://www.cnn.com/2025/11/21/world/jd-vance-wife-india-religion-debate-hnk-dst"
}