{
  "title": "Las encuestas muestran que el discurso optimista de Trump sobre la inflación no está funcionando",
  "text": "CNN —\n\nLa elección de 2025 hace dos semanas cristalizó cuán grande parece ser el problema de la economía y la asequibilidad para el presidente Donald Trump y el Partido Republicano.\n\nLa estrategia inicial de Trump para abordar este problema parecía ser fingir que en realidad no existía. Trump se dedicó a afirmar falsamente que los precios en realidad habían bajado, que hay “casi nada de inflación” y que todo estaba más o menos de maravilla.\n\nFue extraño, incluso viniendo de un presidente que a menudo parece vivir en su propia realidad alternativa cuidadosamente elaborada.\n\nY parece que no está funcionando.\n\nNuevas encuestas realizadas desde que Trump comenzó a impulsar este mensaje muestran que los estadounidenses continúan viendo las cosas de manera muy diferente a como él las presenta. Y sus opiniones sobre su gestión económica parecen estar empeorando.\n\nMás del 75 % dice que los precios de los comestibles han subido, a pesar de las repetidas afirmaciones de Trump\n\n“Nuestros comestibles han bajado mucho. Todo ha bajado mucho”, dijo Trump el 6 de noviembre. “Los comestibles han bajado mucho, excepto la carne de res”, dijo en otro momento. Agregó la semana pasada que los precios de los comestibles estaban “ya a un nivel mucho más bajo que con el Gobierno anterior”.\n\nPero solo el 12 % de los estadounidenses dijo que los precios de los comestibles han bajado en los últimos seis meses, según una nueva encuesta de la Facultad de Derecho de la Universidad de Marquette realizada del 5 al 12 de noviembre.\n\nEn contraste, el 75 % dijo que han subido.\n\n(Los precios promedio de los comestibles efectivamente subieron aproximadamente un 1,4 % en septiembre en comparación con cuando Trump asumió el cargo en enero, y el aumento del 0,6 % en un mes de julio a agosto fue el mayor en tres años).\n\nIncluso entre los republicanos, solo 2 de cada 10 suscribieron la versión alternativa de la realidad de Trump en la que los precios realmente están bajando. La mayoría dijo que los precios han subido.\n\nLos números fueron similares en una encuesta de Fox News publicada el jueves.\n\nEsa encuesta, realizada del 14 al 17 de noviembre, mostró que el 85 % de los votantes registrados dijo que los precios de los comestibles son más altos que hace un año, y el 60 % dijo que han “aumentado mucho”.\n\nAlrededor de dos tercios o más también dijeron que los precios de los servicios públicos, la atención médica y la vivienda han subido.\n\n(“Hace un año” técnicamente incluye dos meses en los que Trump aún no era presidente, pero es razonable pensar que la gente percibió la pregunta como referida principalmente a su mandato).\n\nQuizás lo más llamativo: el porcentaje que dice que los precios de los comestibles han subido “mucho” (60 %) es significativamente mayor que el porcentaje que dijo eso sobre los comestibles y los artículos cotidianos en octubre de 2021 (43 %). Esto a pesar de que la inflación en ese entonces era aproximadamente el doble de lo que es hoy.\n\nEso sugiere que este problema está realmente arraigado, y será difícil para Trump vencerlo con palabras optimistas.\n\nLa brecha entre las afirmaciones de Trump y la opinión de los estadounidenses sobre la inflación\n\nTrump ha afirmado que hay “prácticamente nada de inflación”, “casi nada de inflación” y ha dicho que la inflación es “casi inexistente”. También ha dicho “no tenemos inflación”.\n\nEn realidad, la inflación se ha mantenido obstinada durante todo el mandato de Trump y está en torno al 3 % anualizado, exactamente donde estaba cuando él asumió el cargo.\n\nY la percepción podría ser aún peor.\n\nEl 52 % de los votantes registrados dijo que la inflación “no está en absoluto” bajo control, según la encuesta de Fox. Eso incluye a casi dos tercios de los independientes (65 %).\n\nMenos de 2 de cada 10 en general, y solo un tercio de los republicanos, dijeron que la inflación estaba al menos “mayormente” bajo control.\n\nTrump culpa a Joe Biden; el público no\n\nEn la medida en que Trump ha admitido que hay dificultades económicas, generalmente las ha presentado como remanentes del Gobierno de Biden.\n\n“Biden fue un desastre con la asequibilidad”, dijo Trump a Fox News poco después de la elección. “Cuando asumí el cargo, era un desastre”, agregó.\n\nPero esto, también, parece ser un argumento perdedor.\n\nLa encuesta de Fox News preguntó si Trump o Biden eran más responsables de la economía actual, y los votantes eligieron a Trump, 62 % - 32 %.\n\nSolo alrededor de la mitad de los republicanos (53 %) culpó a Biden.\n\nLos números de Trump parecen estar empeorando\n\nLa apuesta de Trump al presentar esta realidad alternativa es evidente: si la gente no termina por suscribirse a ella, podrían llegar a ver a Trump como desconectado de la realidad y no tomando el problema lo suficientemente en serio.\n\nUna encuesta de CBS News-YouGov reveló que el 75 % de los estadounidenses y una mayoría de los republicanos han dicho que Trump no está lo suficientemente enfocado en bajar los precios.\n\nY, de hecho, parece que Trump no se está haciendo ningún favor en este momento. Si acaso, su panorama político sobre la economía y la asequibilidad está empeorando:\n\nSu índice de aprobación sobre el “costo de vida” estaba en un récord de 39 puntos negativos en una nueva encuesta de Reuters-Ipsos realizada del 14 al 17 de noviembre.\n\nLa encuesta de Fox mostró a Trump con sus peores números económicos en cualquiera de sus dos mandatos: 38 % de aprobación, 61 % de desaprobación.\n\nLos votantes registrados favorecieron a los demócratas sobre los republicanos por 10 puntos en “hacer las cosas más asequibles” (53 % - 43 %), según Fox. (Esto es llamativo porque los estadounidenses tienden a favorecer por defecto a los republicanos en temas económicos).\n\nEl 72 % desaprueba a Trump en cuanto a la inflación, frente al 65 % en julio, según la encuesta de Marquette.\n\nLa misma encuesta muestra que los estadounidenses dicen, por un margen de aproximadamente 2 a 1, que esperan que las políticas de Trump continúen aumentando la inflación.\n\nDe hecho, Trump ha dado a la gente muchas razones para asociar lo que suceda con la economía a él. Eso es lo que sucede cuando sacudes la economía con una serie de aranceles globales unilaterales que ni siquiera fueron respaldados por los republicanos en el Congreso.\n\nTrump asumió voluntariamente la responsabilidad de la economía. Ahora quiere negar la realidad de lo que ha pasado.\n\nA los analistas políticos les encanta buscar en las acciones de Trump alguna estrategia política secreta o movimientos de ajedrez tridimensionales. Pero esto parece más una muestra de desesperación que cualquier otra cosa.",
  "authors": [
    "Aaron Blake",
    "Análisis De"
  ],
  "url": "https://cnnespanol.cnn.com/2025/11/20/eeuu/encuestas-discurso-optimista-trump-inflacion-analisis-trax"
}