{
  "title": "Judge Orders Trump Administration To End National Guard Deployment In DC",
  "text": "WASHINGTON (AP) — A federal judge on Thursday ordered the Trump administration to end its monthslong deployment of National Guard troops to help police the nation’s capital.\n\nU.S. District Judge Jia Cobb concluded that President Donald Trump’s military takeover in Washington, D.C., violates the Constitution and illegally intrudes on local officials’ authority to direct law enforcement in the district. She put her order on hold for 21 days to allow for an appeal, however.\n\nDistrict of Columbia Attorney General Brian Schwalb sued to challenge the Guard deployments. He asked the judge to bar the White House from deploying Guard troops without the mayor’s consent.\n\nAdvertisement\n\nCobb found that the president only has the power to call up the Guard “through the exercise of a specific power outlined in state law,” not for “whatever reason” he sees fit.\n\nIn August, President Donald Trump issued an executive order declaring a crime emergency in Washington. Within a month, more than 2,300 National Guard troops from eight states and the district were patrolling the city under the command of the Secretary of the Army. Trump also deployed hundreds of federal agents to assist in patrols.\n\nIt’s unclear how long the deployments will last, but attorneys from Schwalb’s office said Guard troops are likely to remain in the city through at least next summer.\n\nAdvertisement\n\n“Our constitutional democracy will never be the same if these occupations are permitted to stand,” they wrote.\n\nGovernment lawyers said Congress empowered the president to control the D.C. National Guard’s operation. They argued that Schwalb’s lawsuit is a frivolous “political stunt” threatening to undermine a successful campaign to reduce violent crime in the district.\n\n“There is no sensible reason for an injunction unwinding this arrangement now, particularly since the District’s claims have no merit,” Justice Department attorneys wrote.\n\nAdvertisement\n\nTrump’s Guard deployments have led to other court challenges, including in Portland, Chicago and Los Angeles.\n\nIn Washington, the Trump administration deputized Guard troops to serve as special U.S. Marshal Service deputies. Schwalb’s office said out-of-state troops are impermissibly operating as a federal military police force in D.C., inflaming tensions with residents and diverting local police resources.\n\n“Every day that this lawless incursion continues, the District suffers harm to its sovereign authority to conduct local law enforcement as it chooses,” his office’s attorneys wrote.",
  "authors": [
    "Gary Fields",
    "Lindsay Whitehurst"
  ],
  "url": "https://www.huffpost.com/entry/trump-dc-federal-enforcement-national-guard_n_691f7aeee4b0448495238b5b"
}