{
  "title": "Alabama board votes to remove books about being transgender from public library youth sections",
  "text": "Montgomery, Alabama AP —\n\nThe board overseeing Alabama public libraries on Thursday voted to remove books that discuss being transgender from the teen and children’s sections of all public libraries in the state.\n\nThe Alabama action is the latest salvo in the national fight over library content that has frequently centered on titles with LGBTQ+ themes and characters.\n\nThe Alabama Public Library Service Board of Directors approved a rule that materials that discuss “transgender procedures, gender ideology or the concept of more than two biological genders” are inappropriate for sections of the library aimed at children and youth. The books must be housed in the adult sections.\n\nBoard Chairman John Wahl, who is also chairman of the Alabama Republican Party, called the action “a major step forward in putting parents back in control in what their children are exposed to.”\n\n“We want to put Alabama families in charge. We want them to make the decision what is best for their families,” Wahl said.\n\nThe state board vote came after a heated public hearing last month. Opponents on Thursday called it an attempt at censorship and the erasure of trans people.\n\nThe decision affects more than 200 local libraries and will take effect in 2026 after a required publication period.\n\nThe language is being added to existing rules that youth sections must be free of material that is “sexually explicit or other material deemed inappropriate.”\n\nThe new language also includes a directive that “all material containing such content must be weeded out of the library’s collection or relocated to an adult section.”\n\nMack Reynolds held a sign outside the building stating that “positive representation” is not the same as sexually explicit material. He noted that the vote was taking place on Transgender Day of Remembrance, a day that focuses on trans people who have lost their lives because of violence.\n\nReynolds, who is transgender, said books are the best way for people to learn about people who are different from them.\n\n“What I hope is that other children can approach my daughter with curiosity and compassion. And if they don’t know, then there is so much more room for angst, fear and frustration,” Reynolds said.\n\nThe scope of the new rule is not entirely clear. During a public hearing, some proponents had objected to books that teach children about pronouns or describe a child’s experience being transgender. It is less clear if any book with a transgender character would be removed.\n\n“Most of the people of Alabama have not asked for this latest library-fixated assault on the LGBTQ community because it’s their children and children of friends and relatives you’re attacking with this misguided proposal before you,” Jim Vickery told the board during a public comment period.\n\nBoard member Amy Minton said most comments that they received during a public comment period were in favor of the change.\n\n“This is what the majority of people of Alabama want,” Minton said.\n\nSupporters of the proposal said parents who want their children to read the books can get them in other places, including the adult sections of libraries.\n\nAngie Hayden, a co-founder of Read Freely Alabama, said she is concerned the aim is to completely remove the books. She said state regulations do not allow the purchase of books aimed at children if state regulations also deem the book inappropriate for children.\n\n“So long term they are banning these books, slowly removing these books from your public library,” Hayden said.\n\nThe board also tightened restrictions on youth library cards, stating that the “standard library card” for minors cannot access books in adult collections. Libraries can issue an all-access card only with the written permission of parents.\n\nBoard members also had sharp disagreements over restoring funding to the Fairhope Public Library. The board had moved to withhold funding because of some titles in the teen section.\n\nBoard members rejected a proposal to restore funding immediately. Wahl said he wanted to wait until they had reviewed Fairhope’s actions.\n\n“John, are you becoming the censor-in-chief for Alabama?” board member Ronald A. Snider asked Wahl.\n\nSnider said the state board is acting like a “board of censorship” when they “second guess” the decisions of professional librarians and local library boards.\n\n“You can call it second-guessing or you can call it accountability,” Wahl replied.",
  "authors": [
    "Associated Press"
  ],
  "url": "https://www.cnn.com/2025/11/21/us/alabama-public-libraries-books-transgender-hnk"
}