{
  "title": "Un fiscal revela nuevos detalles sobre la captura de uno de los asesinos en serie más notorios de Estados Unidos",
  "text": "CNN —\n\nJoseph DeAngelo se movía por los barrios de California como una sombra.\n\nAcechaba a sus víctimas durante días, aprendiendo sus rutinas antes de colarse en sus casas enmascarado para torturarlas, violarlas y asesinarlas. Al principio, atacaba a mujeres que vivían solas, pero luego amplió sus ataques a parejas. Se llevaba anillos de boda, fotos y otros macabros recuerdos de las escenas de sus crímenes.\n\nLo que comenzó como robos y allanamientos se convirtió en brutales ataques y asesinatos que aterrorizaron a barrios enteros, impidiéndoles dormir. Cada ola de terror en una zona distinta de California trajo consigo un nuevo apodo: el Merodeador de Visalia, el Acosador Nocturno Original, el Violador de la Zona Este y, finalmente, el Asesino del Estado Dorado.\n\nDeAngelo asesinó al menos a 13 personas y violó a decenas más en las décadas de 1970 y 1980. En abril de 2018, casi cuatro décadas después de sus últimos crímenes conocidos, la policía, armada con pruebas de ADN, rodeó su casa en el tranquilo suburbio de Sacramento, Citrus Heights, y lo arrestó.\n\nVestido con una camiseta, bermudas cargo y calcetines altos, un sorprendido DeAngelo no opuso resistencia cuando los detectives irrumpieron en su casa tras entrar en su jardín. En un contraste estremecedor con la crueldad que una vez infligió, el depredador que había aterrorizado a los residentes de once condados no se defendió. Pero protestó con voz aguda: “¡Tengo un asado en el horno!”.\n\nUna vez dentro de la fría y desnuda sala de interrogatorios del Departamento del Sheriff del Condado de Sacramento, se dejó caer en una silla de plástico. Solo, se quedó mirando fijamente las paredes iluminadas con luz fluorescente durante casi dos horas, respirando profundamente.\n\nVista de la casa del acusado de violación y asesinato Joseph DeAngelo, el 24 de abril de 2018, en Citrus Heights, California. Justin Sullivan/Getty Images\n\n“Me recordaba a un abuelo desaliñado o a un tío alcohólico al que uno evitaba en la cena de Acción de Gracias. No parecía… particularmente amenazador”, escribe Thien Ho, el fiscal principal del caso, en su nuevo libro,“El pueblo contra el asesino del Estado Dorado ”. “Los monstruos de nuestra imaginación pueden verse y sentirse muy diferentes a la luz de la realidad”.\n\nLos detectives le ofrecieron a DeAngelo una lata de Dr Pepper, la misma bebida que había dejado en varias escenas del crimen. No la tocó ni la reconoció. Los investigadores creen que temía dejar su ADN en ella, sin saber que ya lo habían obtenido de su basura, declaró Ho, actual fiscal del distrito del condado de Sacramento.\n\nDeAngelo fue declarado culpable de múltiples asesinatos en agosto de 2020 y sentenciado a cadena perpetua sin posibilidad de libertad condicional.\n\nEl libro de Ho, publicado este mes, ofrece una mirada excepcional al interior de la investigación que llevó a la captura de uno de los asesinos más notorios de California.\n\n\"El pueblo contra el asesino del Estado Dorado\" se publicó este mes. Libros del Tercer Estado\n\nThien Ho habla durante una audiencia sobre el Asesino del Estado Dorado, el 29 de junio de 2020, en Sacramento, California. Fred Greaves/Reuters\n\nCNN entrevistó a Ho sobre las nuevas revelaciones de su libro. Esta entrevista ha sido editada por motivos de extensión y claridad.\n\n¿Por qué cree que DeAngelo se cerró en las horas posteriores a su arresto?\n\nEstaba actuando de forma calculadora y manipuladora. Mientras estuvo sentado en esa habitación durante esas dos horas, yo veía la grabación y pensé un par de veces que la imagen se había congelado, porque él estaba allí sentado, sin moverse en absoluto. Y después de que lo confrontaran por los asesinatos y las violaciones, empezó a murmurar para sí mismo, a hablar solo, diciendo: “No quería hacerlo. Jerry me obligó”. Intentaba presentar una defensa mental basada en un trastorno de personalidad múltiple… culpando a Jerry de haberlo controlado y, de alguna manera, de haberlo obligado a hacer esas cosas.\n\nNo se dio cuenta de que su defensa mental no funcionaba, porque no era la primera vez que la intentaba. En 1979, cuando lo arrestaron por robar repelente para perros y un martillo, lo detuvo la seguridad de la tienda y él fingía estar loco, murmurando para sí mismo y diciendo cosas incoherentes. Cuando llegó la policía, admitió que fingía estar loco, con la esperanza de que seguridad no los llamara. Ya había usado esta técnica de fingir locura, así que sabíamos que era falso.\n\nAl comienzo de su ola de crímenes, era policía e incluso formó parte de los grupos especiales que lo buscaban. ¿Le ayudó eso a evadir la captura?\n\nAsí fue. En la primera serie de crímenes, fue conocido como el Merodeador de Visalia, entre 1974 y 1975. Cometió 120 robos en un radio de tres millas cuadradas. Resultó que era policía en un pueblo cercano y formaba parte del grupo de trabajo encargado de encontrar al Merodeador de Visalia; él era el verdadero Merodeador. Abandonó Visalia, en el centro de California, y se trasladó a Sacramento, donde comenzó a cometer violaciones. Como policía, conocía a la perfección el funcionamiento del sistema, el tiempo de respuesta, la ubicación de los controles policiales y cómo sortearlos. Utilizó su experiencia policial para cometer los crímenes, encontrar a sus víctimas y escapar.\n\n¿Qué le impulsó a pasar del voyerismo y el robo a la violación y el asesinato?\n\nEra ese apetito insaciable de poder.\n\nCuando lo detuvimos, intenté reconstruir cada aspecto de su vida, desde su nacimiento en Bath, Nueva York, hasta su arresto. Descubrimos que, en su vida personal, sentía que no tenía control ni poder. Por ejemplo, cuando era niño, presenció cómo dos militares violaban a su hermana pequeña, que entonces tenía ocho o nueve años, y lo sujetaron para que lo viera. Sus padres lo golpeaban constantemente.\n\nLas autoridades procesan pruebas en la casa del asesino y violador Joseph DeAngelo, en Citrus Heights, California, el 25 de abril de 2018. Randall Benton/Sacramento Bee/Tribune News Service/Getty Images\n\nY… muchas de las víctimas comentaron lo pequeño que era su pene. Así que cuando lo arrestamos… obtuvimos una orden de registro para fotografiarlo, y resultó ser un micropene. Se sintió muy pequeño e impotente toda su vida.\n\nY cuando se hizo policía, esa era su manera de ejercer control y poder sobre los demás. Cuando entraba en sus casas, violaba y ataba a la gente, bebía su cerveza, comía su comida en sus hogares, profanaba sus matrimonios. Les quitaba un pendiente y dejaba el otro. Se llevaba el anillo de bodas. Y cuando los mataba a golpes… se creía Dios con sus vidas. Tenía poder y control sobre sus vidas, porque él no tenía ninguno en la suya.\n\nAlgunos de los supervivientes hicieron oír su voz en el tribunal. ¿Cómo los localizó décadas después y los preparó para testificar?\n\nTras su detención, nosotros (defensores de las víctimas, fuerzas del orden y fiscales) comenzamos a contactar con la gente para informarles de lo sucedido. Algunas personas se pusieron en contacto con nosotros al verlo en las noticias. Localizamos a personas por todo el país… viajamos al Medio Oeste y a distintas regiones para entrevistarlas.\n\nIntentamos que todo girara en torno a las víctimas: las pusimos en contacto con servicios de asesoramiento, nos reunimos con ellas para repasar sus testimonios y declaraciones anteriores, les explicamos cómo es un juicio y les mostramos la sala antes del mismo. Las preparamos lo mejor posible para afrontar ese proceso.\n\nSu libro se centra más en los supervivientes y los agentes del orden que en el propio asesino. ¿Cuál fue el motivo de ese enfoque?\n\nMuchas veces, los libros de crímenes reales se centran en el criminal y los delitos. Pero en este caso, quise centrarme en los agentes del orden que nunca abandonaron la búsqueda y en las víctimas. Hay un momento impactante en el caso que jamás olvidaré y que, de alguna manera, me llevó a escribir esto… en un caso penal, las víctimas tienen la oportunidad de leer su declaración de impacto. Una de ellas fue Jane Carson, coronel retirada de las Fuerzas Armadas. Ella escribió su propio libro sobre la violación que sufrió a manos de él.\n\nDurante su declaración de impacto, ella dice: “Hoy he traído conmigo a alguien que también fue víctima, y ​​se llama Bonnie”. Y Bonnie aparece. Resulta que Bonnie estuvo comprometida con DeAngelo hace unos 40 años, pero rompieron.\n\nBonnie Ueltzen mira a su exprometido Joseph DeAngelo, conocido como el Asesino del Estado Dorado, en el segundo día de declaraciones de impacto de las víctimas, el 19 de agosto de 2020, en el Tribunal del Condado de Sacramento en Sacramento, California. Santiago Mejía/Pool/Reuters\n\nY el Asesino del Estado Dorado solo piensa en el control, y ahí estaba Bonnie, a quien no podía controlar porque ella lo había dejado. Bonnie estaba allí de pie, y ambas lo miraban fijamente. Yo estaba a dos metros de él. Y este tipo solo piensa en el control y en mantenerlo. Está sentado allí, mirando al frente, sin reaccionar a nada, intentando mantener el control. Pero cuando llevaron a Bonnie a la sala del tribunal, lo miré y se quedó sin aliento.\n\nCarson también le dijo: “Ah, por cierto, DeAngelo, ¿te acuerdas del asado que estabas cocinando en el horno el día que te arrestaron?… El único asado que experimentarás será cuando te ases en el infierno, porque ahí es donde vas”.\n\nFue la víctima y Bonnie recuperando el control… se notaba que había una reacción. Fue un momento muy empoderador en la sala del tribunal.\n\nSus crímenes fueron horribles. ¿Hay algún superviviente en particular cuya historia te haya impactado?\n\nCuando pienso en el caso ahora, no pienso en él ni en los crímenes. Pienso en las sobrevivientes. Una de ellas, Phyllis Hennemann, fue la primera víctima de violación en Sacramento. Le diagnosticaron cáncer y, cuando llegó el momento del juicio, no pudo asistir porque estaba recibiendo quimioterapia. Pero cuando DeAngelo fue sentenciado, miré al otro lado de la sala y allí estaba Phyllis. Tenía un brillo especial en los ojos. Por primera vez en 40 años, se hizo justicia. Unos tres meses después, falleció de cáncer. Pienso mucho en ella… en que logramos que se hiciera justicia.\n\nTras cuatro décadas, ¿hubo algún momento en la investigación que marcara un punto de inflexión?\n\nLa tecnología del ADN cambió el rumbo de este caso. Tomamos muestras de ADN y semen de la víctima de violación de Ventura y las convertimos en un perfil genético que se utiliza en la base de datos genealógica. Luego, lo subimos a la base de datos. Descubrimos que tenía un pariente lejano, así que, a partir de ese pariente, creamos un árbol genealógico. Identificamos a sus hermanos, padres, tíos, abuelos y bisabuelos. Creamos un árbol genealógico enorme con más de mil nombres.\n\nA partir de ese árbol genealógico, investigamos a todos. ¿Cuántos eran hombres? ¿Cuántos eran blancos? ¿Cuántos eran policías o militares? ¿Cuántos vivían cerca de los lugares donde se cometieron los crímenes? Logramos reducir la búsqueda a tres personas. Y, efectivamente, él era uno de ellos. Recogimos su basura y encontramos un trozo de tejido que analizamos para obtener ADN, el cual coincidía con el del asesino de todos los demás lugares.\n\nLos fiscales Thien Ho y Amy Holliday leyeron una declaración en nombre de una víctima del condado de Alameda durante el segundo día de declaraciones de impacto de las víctimas en Sacramento, California. Santiago Mejía/Piscina/EPA-EFE/Shutterstock\n\nTras haber examinado las pruebas de cerca, ¿qué detalles le han resultado más impactantes?\n\nLa brutalidad de las escenas del crimen en el sur de California… En muchos de esos asesinatos, golpeó a las víctimas hasta la muerte con un objeto contundente. Un disparo alertaría a los vecinos… (así que) matarlas con un tronco, la base de una lámpara o un aspersor de latón le permitía observar la escena del crimen con calma antes de marcharse.\n\n¿Cree que haya más víctimas ahí fuera?\n\nSí. Su último delito conocido fue el asesinato de Janelle Cruz, en 1986, en el condado de Orange. La gente me pregunta: “¿Por qué dejó de delinquir en 1986?”. Y mi respuesta es: “¿Cómo saben que dejó de hacerlo en 1986?”.\n\nHay un período de tres años, de 1986 a 1989, mientras vivía en Los Ángeles, del que no sabemos con exactitud dónde estuvo ni qué hizo. Y ya estaba empezando a evolucionar como asesino. ¿Quién nos dice que no siguió matando a sus víctimas, pero que simplemente se deshizo de los cuerpos en algún lugar que nunca encontramos?\n\nUsted describe la justicia en este caso no solo como una victoria legal, sino como un momento personal que cierra un ciclo. ¿Por qué?\n\nEscapé de Vietnam en un barco pesquero y viví en un campo de refugiados. Cuando llegué a Estados Unidos, aprendí inglés viendo dibujos animados de Bugs Bunny. Veinte años después, me gradué en Derecho y me convertí en abogado.\n\nVengo de un país donde no existe el Estado de derecho… está gobernado, esencialmente, por una dictadura. Y venir a este país, devolver los derechos a las víctimas, ser parte de un sistema de justicia que funciona, significó todo para mí.\n\n¿Cómo es la vida de DeAngelo en prisión hoy en día?\n\nFue condenado a varias cadenas perpetuas sin posibilidad de libertad condicional y se encuentra en una prisión del Valle Central de California. Está en una unidad de protección, donde se ubica a los pederastas, los violadores, los delatores y aquellos que abandonan las pandillas porque otros presos quieren hacerles daño. No está con la población general. Y en esa unidad, vive constantemente alerta, temiendo que alguien lo ataque.\n\nAsí que está en su propia versión del infierno, donde pertenece.",
  "authors": [
    "Faith Karimi"
  ],
  "url": "https://cnnespanol.cnn.com/2025/11/20/eeuu/fiscal-nuevos-detalles-captura-asesino-en-serie-joseph-deangelo-trax"
}