{
  "title": "Sir Mick Jagger makes surprise visit to old school in Dartford",
  "text": "Mick Jagger makes surprise visit to his old school\n\n2 days ago Share Save Phil Harrison, in Dartford and Craig Buchan & Joshua Askew, South East Share Save\n\nPete Bresser The Rolling Stones frontman has visited The Mick Jagger Centre at his former school in Kent\n\nSir Mick Jagger has advised the next generation of musicians to \"work really hard and not give up\" during a surprise visit to his former school. The Rolling Stones frontman visited The Mick Jagger Centre at Dartford Grammar School in Kent on Wednesday to mark the facility's 25th anniversary. The 82-year-old thanked music teachers at the performing arts centre who \"inspired children and young people in their musical careers\". Sir Mick told the BBC that young people aiming for a music career needed \"a lot of luck\" and to \"work really hard at it and not give up\".\n\nHe said that \"music wasn't much of a career\" when he was growing up, but added: \"That all changed very, very quickly in the early 60s and I got on that bandwagon.\" He opened The Mick Jagger Centre, home to the Dartford Music School and Dartford Symphony Orchestra, in 2000. The centre launched a programme of events in October to mark its 25th anniversary.\n\nPhil Harrison/BBC The Mick Jagger Centre opened at Dartford Grammar School in 2000.\n\nSir Mick said that visiting his former school \"brings back a lot of memories and it's nice to see the kids seem happy\". According to The Mick Jagger Centre, the singer funds its Red Rooster project offering free music tuition, including in local primary schools. \"If you can express yourself through song, drama, art, dance – all these things are important,\" Sir Mick added. \"My involvement's been honestly pretty minimal in a real way, but I do feel connected to it, and I think all the people involved with it have done a really wonderful job.\"\n\nPete Bresser Sir Mick attended Dartford Grammar School as a teenager\n\nThe school's headmaster, Julian Metcalf, said Sir Mick's return visit was \"very special and the icing on the cake\". \"He completely proved wrong that old adage that you should never meet your heroes. What a genuinely lovely guy,\" he told BBC Radio Kent. Mr Metcalf said Sir Mick watched a pupil concert - which \"he loved\" - and later performed on stage with students. \"It was unbelievable to watch,\" said the headteacher. \"You can take the boy out of Dartford, but you can never take the Dartford out of the boy. He has kept a real interest in Kent, Dartford and what is going on in the school.\"\n\nPete Bresser Sir Mick met bandmate Keith Richards in Dartford\n\nSir Mick first met The Rolling Stones bandmate Keith Richards on a platform at Dartford station, forming a friendship that would lead to the band's formation in 1962. The town has several streets named after The Rolling Stones songs, including Little Red Walk, Angie Mews and Ruby Tuesday Drive.",
  "authors": [],
  "url": "https://www.bbc.com/news/articles/ce3k3wejkkvo"
}