{
  "title": "Mundial 2026: así quedaron los bombos para el sorteo del 5 de diciembre, según el ranking FIFA",
  "text": "CNN Español —\n\nEl 5 de diciembre es una fecha que 42 países tienen ya marcada a fuego. Ese día, en Suiza, la FIFA realizará el esperado sorteo del Mundial 2026, quedando definido el camino para casi todos los participantes del máximo evento futbolístico del año.\n\nSi bien aún hay que esperar poco más de dos semanas, la actualización del ranking que publicó la FIFA este miércoles, después del parate de selecciones, dejó definidos los cuatro bombos en que serán divididos todos los participantes.\n\nEl Mundial de 2026 tendrá por primera vez a 48 selecciones, que se repartirán en 12 grupos de cuatro integrantes cada uno. El método será bastante sencillo: los 42 participantes ya confirmados y los seis lugares reservados para los dos repechajes de marzo próximo quedarán divididos en cuatro bombos, utilizando el ranking FIFA de este miércoles para determinar en cual se ubican todos ellos. Las excepciones, claro, serán las selecciones que entren por repechaje y las tres organizadoras.\n\nCNN\n\nCanadá, Estados Unidos y México estarán el Bombo 1, sin importar su ranking, por ser las sedes del Mundial, como ya ha hecho costumbre la FIFA en cada edición del torneo.\n\nLos otros nueve lugares serán para las mejores nueve selecciones del listado (excluyendo a los locales). Allí están España (1°), Argentina (2°), Francia (3°), Inglaterra (4°), Brasil (5°), Portugal (6°), Países Bajos (7°), Bélgica (8°) y Alemania (9°). Los germanos fueron los grandes ganadores del ranking actualizado, ya que avanzaron un puesto, saliendo del 10°, que los hubiera metido en el Bombo 2, con un enfrentamiento casi asegurado ante una potencia en fase de grupos.\n\nEn el Bombo 2 empiezan las aclaraciones, ya que del puesto 10 al 21 están Estados Unidos y México, dos que no cuentan por estar en el Bombo 1, y también Italia, Dinamarca y Turquía, que, como jugarán un repechaje, también son obviados. Por eso, en este grupo quedaron: Croacia (10°), Marruecos (11°), Colombia (13°), Uruguay (16°), Suiza (17°), Japón (18°), Senegal (19°), Irán (20°), Corea del Sur (22°), Ecuador (23°), Austria (24°) y Australia (26°).\n\nNoruega (29°), Panamá (30°), Egipto (34°), Argelia (35°), Escocia (36°), Paraguay (39°), Túnez (40°), Costa de Marfil (42°), Uzbekistán (50°), Qatar (51°), Arabia Saudita (60°) y Sudáfrica (61°) estarán en el Bombo 3. Los saltos en los puestos del ranking que aparecen en ese grupo de selecciones obedecen a que en el medio están Canadá (otra anfitriona, ya en el Bombo 1), Ucrania, Polonia, Gales, Suecia, República Checa, Eslovaquia, Rumania, R.D. del Congo, Iraq, Irlanda (jugarán los repechajes de marzo) y otras como Serbia, Nigeria, Hungría, Grecia, Venezuela, Costa Rica, Perú, Chile, Malí, Eslovenia y Camerún (ya eliminadas). Incluso allí está Rusia, vetada por la FIFA por su invasión en Ucrania.\n\nEl Bombo 4 tendrá a Jordania (66°), Cabo Verde (68°), Ghana (72°), Curazao (82°), Haití (84°) y Nueva Zelandia (86°) como únicas seis selecciones confirmadas. Los otros seis cupos vendrán del repechaje intercontinental (dos plazas) y del de la UEFA (cuatro lugares), sin importar cual sea el ranking FIFA de las clasificadas. Ejemplo: si Italia logra un boleto en la repesca europea, será parte de este grupo, sin importar que esté 12° en el listado oficial.\n\nDeseos y pesadillas\n\nTeniendo en cuenta las reglas que normalmente decide la FIFA para el sorteo, como que no puede haber enfrentamiento de dos selecciones de la misma conferencia, excepto de Europa, donde máximo puede haber dos, es posible aventurar grupos más “accesibles” y otros más complicados para los ya clasificados.\n\nVideo Ad Feedback ¿Tienes boleto para el Mundial 2026? EE.UU. promete acelerar tu cita para la visa 01:31 • Fuente: CNN ¿Tienes boleto para el Mundial 2026? EE.UU. promete acelerar tu cita para la visa 01:31\n\nMéxico\n\nEl Tri, que no pasa un buen momento, podrá darse el lujo de ser cabeza de serie, por lo que evitará a varios gigantes en la fase de grupos. Podría enfrentar a cualquiera del Bombo 2, y allí aparecen Australia y Austria como las más accesibles en los papeles. Si salen las bolillas de Marruecos, una de las mejores selecciones de África, o Japón, una de las mejores de Asia, sería una mala noticia.\n\nDel Bombo 3 solo descartará a Panamá, y habiendo cinco selecciones africanas, tiene casi el 50 % de posibilidades de que le toque una de ellas.\n\nDel Bombo 4 no podrá medirse ante Curazao y Haití, por lo que tiene muchas posibilidades de tener de acompañante a un combinado nacional salido de los repechajes o a alguna de las debutantes, Cabo Verde o Jordania (Curazao no, porque también es de la Concacaf).\n\nUno más accesible:\n\nMéxico\n\nAustria\n\nQatar\n\nNueva Zelandia\n\nUno más complicado:\n\nMéxico\n\nMarruecos\n\nNoruega\n\nItalia (del repechaje)\n\nArgentina\n\nEl campeón defensor sabe que del Bombo 2 no podrá enfrentar a Colombia, Ecuador ni Uruguay, por lo que, de las opciones habilitadas, Australia y Austria aparecen, en las palabras, como las menos exigentes. Al igual que México, querrá evitar seguramente a Marruecos y Japón.\n\nEn el Bombo 3, la Noruega de Erling Haaland, que se clasificó con puntaje perfecto en las eliminatorias, es el rival que todos quieren evitar, mientras que Qatar, Uzbekistán y Panamá podrían tener menos potencial.\n\nUno más accesible:\n\nArgentina\n\nAustralia\n\nPanamá\n\nCabo Verde\n\nUno más complicado:\n\nArgentina\n\nMarruecos\n\nNoruega\n\nItalia (del repechaje)\n\nColombia\n\nLa selección cafetera está en el Bombo 2 y le tocará enfrentar sí o sí a una potencia, aunque no serán Argentina ni Brasil. Canadá o Estados Unidos serían las opciones más buscadas, mientras que España, Alemania o Francia los que menos querría ver.\n\nEn el Bombo 3, podría preferir a Qatar y Uzbekistán (Panamá no caería aquí si es que es el grupo de Canadá o Estados Unidos) y, de nuevo, los goles de Haaland serían el mayor problema.\n\nYa en el Bombo 4, cualquiera de las debutantes podría ser una buena noticia.\n\nUno más accesible:\n\nCanadá\n\nColombia\n\nUzbekistán\n\nCabo Verde\n\nUno más complicado:",
  "authors": [
    "Federico Leiva"
  ],
  "url": "https://cnnespanol.cnn.com/2025/11/19/deportes/mundial-2026-bombos-sorteo-repechaje-orix"
}