{
  "title": "Max Verstappen Answers F1 Driver Questions",
  "text": "Transcript\n\nI'm Max Verstappen,\n\nand today I'll be answering your questions\n\nfrom the internet.\n\nThis is F1 Driver Support.\n\n[upbeat music]\n\nSo, When is the best time to pit?\n\nIn our team, together with Oracle,\n\nwe run over 8 billion simulations\n\nbefore the race basically starts.\n\nSo it gives a lot of opportunities to make sure\n\nthat, you know, we have the right strategy out there\n\nand know when to pit basically.\n\nDo F1 drivers watch endless hours of tapes of each other,\n\nin-car film of other drivers, like football players do?\n\nI mean, we do look at on-boards\n\nof even other drivers, yourself.\n\nYou do look back sometimes on the years before.\n\nBut the thing is that also the F1 cars\n\nevery year they change\n\nand sometimes, with that, the balance changes.\n\nThe weather has a massive influence as well.\n\nThe wind direction has a big influence.\n\nSo, yes, you can learn a little bit of it sometimes\n\nor you can use it as a little bit of a reference to start,\n\nbut then it's very important to basically just go off\n\nwhat you learned throughout the weekend,\n\nand then just try and optimize it from there.\n\nWhat's your best advice\n\nto improve your overtaking ability?\n\nWell, practice a lot.\n\nI mean, practice makes perfect,\n\nthat's in the real world, virtual world.\n\nThe more you race, you know, the more\n\nyou come into these kind of situations\n\nwhere you have to either defend or overtake.\n\nAsking F1, which track statistically is the most exciting?\n\nOvertakes, accidents, flags, pits stops,\n\nweather, drama, and unexpected winners consistently.\n\nI guess Baku maybe.\n\nI think of the history of F1\n\nprobably is a bit unexpected with stuff.\n\nYou know, exactly, like, it's all spelled out there.\n\nA lot can happen there, good or bad.\n\nWet races are boring, cars are slow and there's no racing.\n\nThe only entertainment is driver mistakes.\n\nSir or ma'am, you are an idiot.\n\n[production crew laughing]\n\nWet races are not boring,\n\ncars are not slow, and there is racing most of the time.\n\nYeah, that's definitely not the only entertainment,\n\nthe driver mistakes,\n\nso I very heavily disagree.\n\nYou like them? I like them, yeah.\n\nI mean, I like wet races, dry races.\n\nIt also depends a lot on how much rain,\n\nwhen it comes in, start of the race, middle of the race,\n\nstuff like that.\n\nThey can be very entertaining.\n\nWhat's up with the new Formula 1 obsession in the USA?\n\nWhat's up with that?\n\nI guess, you know, having a series on Netflix helped a lot.\n\nAlso, throughout COVID, you know, people being more aware\n\nof what's going on,\n\nyou know, especially when you were mainly sitting at home,\n\nyou couldn't really do much.\n\nThat definitely helped a lot.\n\nAnd then, of course, I think also the ownership\n\nhas really pushed it, of course,\n\nto have three races in the US\n\nshowing more awareness for the sport here.\n\nSo I think all those things definitely help.\n\nWhat is the biggest difference\n\nbetween a good driver and a great one?\n\nI think the difference between a good one and a great one\n\nis to be, first of all, consistently performing well.\n\nEspecially when the pressure is on,\n\nyou know, to get the best out of yourself.\n\nYou know, these kind of moments really define,\n\nI think, the difference between a good and a great driver.\n\nWhat is Max Verstappen's biggest weakness,\n\nand in what way does it affect his performances, if at all?\n\nWell, I will never tell you. [laughs]\n\nNo, you would never say something like that about yourself.\n\nEven if you know what it is,\n\nyou try to work on it and that's it.\n\nWhy do F1 drivers need to be physically fit?\n\nWell, like in any other proper sport,\n\nif you're not fit, you can't perform at your very best.\n\nYou know, within those one and a half hours,\n\nas well, in the race,\n\nthere are a lot of forces on your body,\n\nand you need to make sure\n\nthat you're not busy trying to hold on to the car.\n\nAnd, basically, yeah, be fit enough to drive the car\n\nand be busy with other stuff as well.\n\nDoes anyone know about the mental preparations\n\nthe drivers do to stay on top of their game?\n\nIt depends on the driver.\n\nYou know, some do more than others.\n\nSome keep it very simple.\n\nSome need to do all different kind of prep\n\nbefore they jump in the car.\n\nI'm probably on the least side of things\n\nwhere, yeah, you do a bit of warmup for your muscles\n\nand stuff, some tiny reaction games.\n\nBut you can also easily just sit in the car and go.\n\nYou know how driving and sneezing at the same time\n\nis horrific for that split second,\n\nwhat do F1 drivers do?\n\nHow can they sneeze and drive?\n\nDoesn't really happen that often.\n\nI think for me it only happened really,\n\nI think when you're a bit ill, then it can happen.\n\nBut, yeah, you have to deal with it.\n\nI mean, it's like, what? Half a second, a second?\n\nIt's not nice, but it can happen.\n\nHow different is each Formula 1 car?\n\nWell, just looking at it already,\n\nmost of them, of course, look quite different,\n\nand that's, of course, from the things that you can see.\n\nMost of the things, of course, underneath\n\nare completely different or designed in a different way,\n\nand that's I think also what makes Formula 1 very special.\n\nYou know, you have all the teams racing,\n\nbut they all try to find it in their own way\n\nto be competitive.\n\nWhy do a F1 drivers\n\nall drink out of inordinately-long straws?\n\nCan't they just drink from normal bottles\n\nor reasonable-length straws like us mortals?\n\nI don't know what they exactly mean with that,\n\nbecause, for me, it's quite a short straw\n\nthat I have connected in my helmet.\n\nSo, at least for me, it's quite a normal straw.\n\nI don't what they've been looking at, to be honest.\n\nWhat is the benefit of eating ice?\n\nWhy do F1 drivers eat ice?\n\nLike an ice cream or what?\n\n[Production] I think pieces of ice.\n\nI don't eat that.\n\nDo Formula 1 drivers really lose weight\n\nfrom the sheer tension of a single race?\n\nI mean, I lose weight from sweating\n\nand my effort that I put in during the race,\n\nnot from the tension.\n\nBut everyone's different, I guess.\n\nHow do drivers usually get into Formula 1?\n\nWell, first of all, by being better than others.\n\nMost of the time, of course, you start racing in go-karting.\n\nAnd then, of course, you go up through the ranks,\n\nand that can go in many different ways, to be honest.\n\nA few categories out there,\n\nbut, yeah, it's more or less like other sports, right?\n\nYou move up the ranks throughout your career\n\nto get to the highest possible.\n\nWhat's a random F1 moment\n\nthat you remember or sticks with you?\n\nI mean, winning your first race,\n\nyou will always remember that.\n\nYour first title, stuff like that,\n\nthose are always very special moments.\n\nHow do F1 drivers take a leak?\n\nWell, you cannot during the race.\n\nI mean, there's no toilet in the car,\n\nso you have to try and make sure\n\nthat, yeah, you go before the race starts.\n\nOtherwise, it's a very long race to try and keep it in.\n\nHow would an '80s or '90s Formula 1 car do\n\nagainst the modern Formula 1 car?\n\nNot very good, I would say.\n\nThey're a bit slower.\n\nBut, I mean, it depends a lot\n\non the regulations as well, right?\n\nAnd the knowledge increases over the years,\n\nso it's normal.\n\nHow do F1 drivers reduce their reaction time?\n\nWell, you can do maybe some pre-racing warmup to help,\n\nthat might help a little bit.\n\nBut normally I think when you sit in the car,\n\nI think with the adrenaline also kicking in,\n\nyour reaction time naturally,\n\nlike, you're really fired up anyway.\n\nHow do you have F1 drivers see through the halo?\n\nWell, it's with your eyes, like, the 3D vision,\n\nlike, you kind of look around it.\n\nWe, also, most of the time, are not looking straight,\n\nlike, always looking left or right.\n\nWho is the all-time F1 GOAT?\n\nWell, I leave that up for the people themselves\n\nto judge that, right?\n\nEveryone has their own one,\n\nand I guess that's also what makes it nice, right?\n\nTo have fans having their favorite driver or not.\n\nThis might be a dumb question,\n\nbut how do F1 drivers train?\n\nLike, do they do practice races? Friendlies.\n\nUnfortunately, we can't really practice a lot in F1.\n\nYeah, we have a few test days,\n\nbut, like, throughout the year,\n\nwe cannot drive the F1 car a lot.\n\nSo we spend a lot of time on our simulator, so more virtual.\n\nIt's, of course, to reduce the cost as well.\n\nOtherwise, our teams go testing a lot,\n\nso that's the only way to try and make sure\n\nyou keep developing your Formula 1 car\n\nand try and get more performance out of it.\n\nPit stops, when to undercut/overcut?\n\nYeah, I mean it depends a bit\n\non the track layout, the tire deck.\n\nYou know, on some tracks,\n\nan undercut is, of course, very strong,\n\nbecause the wear on the tires is very high.\n\nSo when you're getting to the end of a stint,\n\nyou might be, let's say, two seconds slower\n\nthan when you put a new tire set on,\n\nso then it's very important to know when to undercut.\n\nBut, on some tracks, the tire deck is not very high,\n\nso basically every lap,\n\nof course, the fuel load is coming down,\n\nand that's actually giving you more lap time\n\nthan actually the wear is increasing,\n\nso then an overcut can sometimes work as well.\n\nLike Baku sometimes actually,\n\nbecause then the warmup with the tires also out of the box\n\ncan be quite tough,\n\nand especially between walls,\n\nyou always take a little bit more caution on the out-lap.\n\nSo a few tracks where overcuts work,\n\nbut mainly I would say undercuts are the way to go.\n\nOut of curiosity, how many hours does the driver\n\nactually spend in the car training and practicing,\n\nand how many do they spend training/practicing\n\non the in-house sim?\n\nToo many hours.\n\nThroughout the race weekend,\n\nI mean, you have the practice hours,\n\nthen you have qualifying in the race.\n\nSo well, what is it? Three hours of practice more or less.\n\nAnd then, How many hours do they spend training/practicing\n\non the in-house sim?\n\nI mean you do like, at least for me,\n\nlike 20, 25 days a year.\n\nI would say it's more like a 9-to-5 day.\n\nSo you do quite a lot throughout the year.\n\nAnd then, besides that,\n\nof course, you're constantly discussing a lot of things\n\nwith the team, you know, even when you're not sitting\n\nin the sim or the real car.\n\nWhat is the greatest Max Verstappen victory\n\nin your opinion?\n\nFor me, it's the 2019 Brazilian Grand Prix.\n\nHonestly, for me, it's difficult to pick one.\n\nLike I said before, probably winning your first one\n\nwas still, like, an amazing one.\n\nYeah, there've been some really good ones.\n\nI don't know, I cannot pick, to be honest.\n\nHow different will 2026 F1 cars be to drive?\n\nThey will be very different.\n\nThe engine is already completely different,\n\nso that will require a different kind of driving style.\n\nThe cars naturally as well.\n\nIt will be I think a big change\n\nfor everyone to get on top of these things.\n\nAnd, especially, I think the first-year races\n\nyou will see quite a big difference between the teams\n\nand understanding what to do.\n\nI don't think even we know\n\nfully what is exactly gonna happen.\n\nSo, yeah, try and not make it too complicated.\n\nWhat specific innovation or rule change in Formula 1\n\nover the past decade\n\nhas most genuinely improved the competitiveness\n\nor excitement of the race as well?\n\nI guess it's a bit of a love/hate relationship,\n\nbut I do think DRS has helped to race a bit more\n\nin some tracks.\n\nUnfortunately, with having so much stuff on the car,\n\nsometimes it's very hard to follow,\n\nand that's why, yeah, we need the DRS sometimes.\n\nSo opening the rear wing up on the straights\n\nto be able to fight on the straights\n\nand into the braking zones.\n\nOtherwise, I think you would've had a lot\n\nof boring races in some tracks.\n\nAll right, that's it.\n\nThank you for all the questions, and see you next time.\n\n[gentle music]",
  "authors": [
    "Condé Nast"
  ],
  "url": "https://www.wired.com/video/watch/tech-support-max-verstappen-answers-f1-driver-questions"
}