{
  "title": "Turkey set to host COP31 after reaching compromise with Australia",
  "text": "Turkey set to host COP31 after reaching compromise with Australia\n\n1 day ago Share Save Matt McGrath Environment correspondent, at COP30 in Belém, Brazil Share Save\n\nChris McGrath/Getty Images Turkey has proposed holding the 2026 climate talks in Antalya\n\nThe COP31 climate meeting is now expected to be held in Turkey after Australia dropped its bid to host the annual event. Under the UN rules, the right to host the COP in 2026 falls to a group of countries made up of Western Europe, Australia and others. A consensus must be reached but neither country had been willing to concede. Australia has now agreed to support the Turkish bid in return for their minister chairing the talks following negotiations at COP30, currently being held in Brazil. This unusual arrangement has taken observers by surprise. It is normal for a COP president to be from the host country and how this new partnership will work in practice remains to be seen.\n\nAustralian Prime Minister Anthony Albanese has called the compromise with Turkey an \"outstanding result\" in an interview with the Australian Broadcasting Corporation (ABC), noting Pacific issues would be \"front and centre\". He added that he had spoken to Papua New Guinea Prime Minister James Marape and Prime Minister Rabuka of Fiji. However, Papua New Guinea's Foreign Minister Justin Tkatchenko told the AFP news agency \"we are all not happy. And disappointed it's ended up like this\". Solomon Islands leader Jeremiah Manele earlier told the ABC he would be \"disappointed\" if Australia didn't secure the event. Despite this, there will be relief among countries currently meeting at COP30 in the Brazilian city of Belém that a compromise has been reached as the lack of agreement on the venue was becoming an embarrassment for the UN. Australia has pushed hard to have the climate summit in the city of Adelaide, arguing that they would co-host the meeting with Pacific island states who are seen as among the most vulnerable to climate change and rising sea levels. Turkey, which has proposed hosting COP31 in the city of Antalya, felt that they had a good claim to be the host country as they had stood aside in 2021 and allowed the UK to hold the meeting in Glasgow. If neither country was willing to compromise then the meeting would have been held in the German city of Bonn, the headquarters of the UN's climate body. As a result of discussions at COP30, a compromise appears to have been reached. This includes pre-COP meeting will be held on a Pacific island, while the main event is held in Turkey. Australia's climate minister Chris Bowen will be its president.\n\nAFP via Getty Images Australia's climate minister Chris Bowen will be the COP31 president",
  "authors": [],
  "url": "https://www.bbc.com/news/articles/cx242yj380no"
}