{
  "title": "'He could have been remarkable': The tragic murder of forgotten US President James Garfield",
  "text": "Getty Images Garfield's inauguration ceremony in March 1881; he set out as President with an ambitious agenda (Credit: Getty Images)\n\nMakowsky's crucial task was to sift through Millard's detailed dive into the history of the assassination and construct a narrative appealing to TV viewers. Destiny of the Republic includes sections on Republican Party factionalism, the antiseptics preferred by British surgeon Joseph Lister and Alexander Graham Bell's invention of an early metal detector, used eventually to search for the bullet in Garfield's body. Makowsky chose to focus on the contrasting journeys of Guiteau and Garfield. \"Both men cared very much about being known,\" he said. \"One propels himself to the highest office in the land, whereas the other courts greatness and never achieves it.\"\n\nThe killer's motivation\n\nBy turns Guiteau failed as a lawyer, a journalist and an evangelical preacher. He even flopped at the free love commune he joined; no woman would sleep with him, as Millard recounts. Yet he always believed God intended him for a grand purpose. Guiteau became obsessed with Garfield after the congressman's unlikely nomination, and travelled to New York in the summer of 1880, determined to play a crucial role ensuring his victory in the general election. Guiteau harassed the staff at Garfield's New York campaign office until he was allowed to give a single rambling speech endorsing the candidate.\n\nGarfield vocally opposed the spoils system of handing out lucrative posts to supporters, yet Guiteau believed in it fiercely. He expected that, in exchange for his backing, Garfield, now president, would give him a key post. Ambassador to France was his first choice. The deluded man travelled to Washington, and appeared at the White House every day with hordes of other insistent office seekers. Guiteau even came face to face with his hero once, in the president's office, where he handed Garfield a copy of his election speech, with \"Paris Consulship\" scrawled on it, and a line connecting those words to his name.\n\nGarfield, meanwhile, embarked on an ambitious agenda for his presidency, including upgrading the US Navy, aiming to expand trade with Latin America, and advocating for civil rights. He appointed the once-enslaved social reformer Frederick Douglass as recorder of deeds for the District of Columbia, the first African American to hold a prominent federal office. At the same time, Garfield also had to face down Roscoe Conkling, Republican senator from New York, arguably the most powerful politician in the nation, thanks to his indirect control of the lucrative customs revenue flowing into the port of New York. Conkling didn't like Garfield's progressive instincts nor his opposition to the spoils system. He'd already imposed on candidate Garfield his associate Chester A Arthur, to be vice president. Now Conkling sought to block Garfield's Cabinet picks.",
  "authors": [],
  "url": "https://www.bbc.com/culture/article/20251107-the-tragic-murder-of-forgotten-us-president-james-garfield"
}