{
  "title": "Teacher Answers Teacher Questions",
  "text": "Transcript\n\nI'm sitting in front of a room full of people,\n\nand I'm gonna ask them to give me their cell phones.\n\nSo if you would please, come up.\n\nTrick or treat, gimme your cell phones.\n\nThis is gonna be hard for them.\n\nPaul, I think I don't have your cell phone.\n\n[phone thudding]\n\nHi everybody.\n\nI'm Leslie Fox, I'm a math teacher.\n\nI'm here to answer your questions.\n\nThis is teacher support.\n\n[upbeat music]\n\nFirst question.\n\nThis is from JacobAn0808.\n\nDo teachers secretly have favorites?\n\nAm I allowed to answer that?\n\nThe answer is yes.\n\nHere's the thing,\n\nour favorites are the ones that come to us.\n\nIt's not like I'm gonna look around the room\n\nand say, Oh my God, you're my favorite.\n\nIt's the ones that come in and ask the questions\n\nand then they start sharing stuff with you.\n\nYes, those are my favorites okay?\n\nI have favorites.\n\nAre people gonna watch this?\n\nOkay, because I don't know that I want my students to know.\n\nFrom hopperlover40.\n\nShould we ban phones from schools?\n\nObviously, yes we should ban phones from schools.\n\nWhere I work,\n\nthey banned phones for the first time this year.\n\nYou cannot have a cell phone on your body.\n\nFor the first four to six weeks, kids were hiding it.\n\nWe had to remove them.\n\nSo if we saw a kid hiding in the bathroom,\n\nI'm not kidding you, behind a door,\n\nscrolling through their phone, I had to take it.\n\nIf they were in their back pocket, I had to confiscate it.\n\nIf it was on their desk, I had to take it.\n\nAnd they would get it back at the end of the year.\n\nAt the end of the day,\n\nto them, it felt like the end of the year.\n\nLet me tell you what happened.\n\nKids started doing crossword puzzles.\n\nKids started asking for board games.\n\nKids started talking to each other.\n\nThey even forgot that they had cell phones\n\nand it was like going to school in the eighties.\n\nThe next question is from oldwoolensweater.\n\nWhy can't teachers just not assign homework?\n\nI agree with that.\n\nYou know, I do think there are some teachers\n\nthat like to assign homework,\n\njust kind of for the sake of assigning it for busy work.\n\nI'm not really sure why.\n\nI don't know that it actually helps 'em\n\nbecause then they get into the mind frame\n\nof let's just get it done, let's just get it done.\n\nEspecially if you're a teacher that's grading homework,\n\nthe kid is not really learning it,\n\nlike as we nerds like to say, like really internalizing it.\n\nI think assign classwork,\n\nand then before the kid leaves class, you are checking that.\n\nThat is what is gonna get a kid to do their work.\n\nWhen they go home, they can just use AI.\n\nI'm a no homework teacher,\n\nbut you're gonna be working in my class, don't worry.\n\nTotally agree with you, oldwoodensweater.\n\nFrom Reddit, Teachers.\n\nAre most teachers nerds?\n\nYes, we are all nerds.\n\nWe like talking about math all day, every day.\n\nSo nerdy, even our tattoos show what we do.\n\nSo here's my pi tattoo and my dog's name is pi.\n\nEverything in my life has to do with math,\n\nand things that don't have to do with math\n\naren't really that important in my life.\n\nYes, we are nerds.\n\nThis one comes from Herpderbydoo, okay.\n\nTeachers of Reddit,\n\nwhat really goes on in the teacher's lounge?\n\nOh, I wish I could say it's all sexy and fun.\n\nBut what goes on in the teacher's lounge,\n\nis we are prepping for our classes.\n\nIt's a little bit boring if I'm being honest.\n\nWe're doing Xeroxes.\n\nWe are stuffing our faces with food,\n\nbut every once in a while we will talk about\n\nour own high school experiences\n\nand all the things that we don't want you to do.\n\nWe talk about the stuff that we do\n\nthat we don't want our students to know.\n\nThe truth is, teachers are just big kids\n\ndressed up like adults.\n\nAdults stuck in high school.\n\nSometimes we gossip about students.\n\nSometimes we gossip about other teachers.\n\nSometimes we gossip about administrators,\n\nand then we gossip about our families.\n\nYes, we gossip.\n\nAre you kidding me?\n\nOf course we gossip.\n\nWe do all the things that you guys do.\n\nOkay, next question, is from AlyksTheSage.\n\nTeachers and principals of Reddit,\n\nWhy do schools not teach things like how to cook, clean,\n\nor do taxes?\n\nYes! [Leslie claps]\n\nYes AlyksTheSage, I totally agree.\n\nWe do not teach our kids life skills.\n\nWhy?\n\nI have no idea.\n\nYou need to learn how to do taxes.\n\nYou need to learn, this is a really kind of a morbid one,\n\nbut when one of your parents dies,\n\nyou need to learn how to deal with all that stuff.\n\nYou do need to learn how to cook,\n\nyou do need to learn how to clean,\n\nhow to keep a house, how to pay your bills.\n\nI mean, there are all these things we don't teach you.\n\nBut instead, let me teach you the calculus.\n\nI don't know why we don't,\n\nbut yes, we should have a class like that.\n\nI'm really sorry, we have failed you.\n\nOkay, the next question is from sweatshirt_cigarette.\n\nIf I can pass your class with AI,\n\nthe problem isn't AI, it's your class.\n\nI totally agree, yes.\n\nIf you can pass my class with AI exclusively,\n\nthen I haven't made the assignments AI appropriate.\n\nI use AI in my classroom\n\nand I recommend all teachers use AI.\n\nSo just let me give you an example.\n\nSo if I make a bunch of questions up for my kids\n\nand I say, okay, answer these questions,\n\nand then they answer them and they're like,\n\noh, can we have some more questions?\n\nAnd I say, I want you to write them, have AI answer them,\n\nand find the mistakes that AI makes.\n\nAsk AI for questions, see if you can answer it and check it.\n\nSo yes, AI is a helpful tool.\n\nIt's gonna be everywhere.\n\nAnd as teachers, we expect that you know how to use it\n\nand that you do use it.\n\nSo, I hope you can pass my class with AI.\n\nTo check to see if kids use AI to cheat.\n\nFirst of all,\n\nkids don't have computers in the class anymore.\n\nThere's not really a way to cheat with AI in class,\n\nbecause you are doing your work\n\nwith a piece of paper and a pencil from the olden days.\n\nSo if a kid is using AI at home,\n\nlike to complete their homework, that's fine.\n\nThat's on you.\n\nI don't even grade your homework.\n\nSo, if you're gonna have AI\n\ncomplete all your homework, that's fine.\n\nWhen it comes time for the test,\n\nyou might not be able to answer the questions.\n\nI don't even collect homework.\n\nIt's obsolete.\n\nThe next question is from TheCouchPotato.\n\nHow much do high school grades really matter?\n\nOh my god, okay.\n\nHigh school grades, depends on what you wanna do.\n\nIf you wanna go to college,\n\nand you wanna get into competitive college,\n\nthat's what they look at.\n\nThey look at your grades.\n\nI'm curious though,\n\nhow much do you learn if you get good grades?\n\nI think that high school grades\n\nare a reflection of how much someone wanted to do well,\n\nrather than how intellectual you are,\n\nand how much you're learning.\n\nI think that kids that get good grades\n\nare all about looking at their future,\n\nof like, where am I gonna go to college?\n\nAnd then what?\n\nYou go to graduate school,\n\nI mean, the real thing is\n\nwhat do you wanna do with your life?\n\nIn the end,\n\nhigh school grades don't actually matter all that much,\n\nbut what might matter is doing something you love,\n\nfinding a hobby that you love\n\nbecause that's gonna be what your life is.\n\nI'm sitting in a room with probably eight people here,\n\nthat are all doing what they love.\n\nAnd if I ask them a question, what was your GPA?\n\nThey probably wouldn't even remember.\n\nI don't even care what college they go to,\n\nbut look at what they're doing now.\n\nThat's what I want kids to do in high school.\n\nFind what your passion is.\n\nIt actually has nothing to do with your grades.\n\nFrom JJ5thehuman.\n\nWhat's the most creative way you've seen someone cheat\n\nin an exam or test?\n\nOkay, this is actually a really good one, it's funny.\n\nSo, a kid had a cup, like one of these cups,\n\nimagine it empty,\n\nand it was a styrofoam cup.\n\nThey had it filled with all these formulas\n\nand so the kid is pretending to drink,\n\ntaking their test like this.\n\nAnd I looked over and I said,\n\nWhat's happening over there? [Leslie laughs]\n\nSo I had to take his cup away.\n\nThis is from MurphysMom08.\n\nTeaching is the best or worst job ever,\n\nand either way, you're not wrong.\n\n100% agree, it is the best job.\n\nBecause you get June, July, and August off.\n\nNo, it is the best job because you get to be with kids.\n\nIt is the worst job\n\nbecause you're paid peanuts for your work.\n\nAnd there are 100 things in between,\n\nbut it really is a lovely career.\n\nThis is from Reddit, Sat.\n\nWould you say the SAT is an intelligence test?\n\nSAT is supposed to test\n\nhow well you're going to achieve in the future in a college.\n\nCompletely disagree with that.\n\nBut if you have the funds, you can study for that test,\n\nspend a lot of money and figure out what kind of questions\n\nand do really well on it.\n\nIf you have a calculator, these are over a hundred dollars\n\nand you can buy this,\n\nthat will help you immensely on the test.\n\nHowever, it is not an intelligence test.\n\nLet's remember\n\nthat there are all different types of intelligence.\n\nThere's creative intelligence,\n\nthere's emotional intelligence, there's artistic,\n\nit just tests how well you can learn to take a test.\n\nAnd depending on the content that's on it,\n\nI can write an SAT test\n\nthat has nothing to do with math and English\n\nand then somebody will pass it with flying colors.\n\nBut the person who studied for the standardized SAT test\n\nwill do horribly.\n\nSo is it a test for intelligence?\n\nNo, no.\n\nNot even a little.\n\nI think something that would be better than an SAT test\n\nwould be,\n\nhow can you have a conversation with someone in real life?\n\nHow can you do what you love\n\nin a way that makes you feel happy?\n\nThat's the real intelligence test.\n\nEdwardBliss says,\n\nDo teachers still roll out that TV on wheels\n\nif they don't feel like teaching for an hour?\n\nSo for those of you that don't remember,\n\nif teachers didn't feel like teaching,\n\nthey would literally roll out a TV set\n\nand put it in front of the class,\n\nand say, okay, class, we're gonna watch a movie today,\n\nand all the kids would fall asleep.\n\nNo, we don't even have TVs in the classrooms anymore.\n\nBut we do have calculators that project\n\nand the answer's yes.\n\nWhen we don't feel like teaching, we will show a movie.\n\nYes, there are times when we don't get to do our homework\n\nor prepare a class.\n\nSo yes, we do roll out the TV so to speak.\n\nHowever, it's a little bit different now.\n\nWe often take a vote by the class of,\n\nwhat show do you wanna watch? [Leslie laughs]\n\nLet's see, what did I do last?\n\nI think we did Love on the Spectrum.\n\nYes, my kids watched Love on the Spectrum.\n\nOne day we all didn't wanna do work,\n\nand we watched it, and then we discussed it.\n\nSo it was actually a fun day, yeah.\n\nSo the next question is from,\n\nball-swinging-maniac.\n\nHow much of an expert are you really\n\nwithin the subject you teach?\n\nThat's the only thing I'm an expert in.\n\nOnly in high school math.\n\nIf you ask me to do history,\n\nI will look at you and say, Hmm, I have no clue.\n\nIf you wanna ask me about elementary school math,\n\nI won't even be able to help you.\n\nIf you wanna ask me even about college math,\n\nwon't even be able to help you.\n\nHigh school math, I'm your gal.\n\nAnd I do have kids challenge me, and I love when they do,\n\nbecause you have kids that will ask you questions beyond it.\n\nAnd so I have to look at them and say,\n\nI don't know the answer to that,\n\nbut I will get back to you.\n\nAnd then I have to go to my gurus, and ask them,\n\nI had this kid ask me this great question,\n\nand I don't know the answer.\n\nSo I am always learning, that is a true thing.\n\nYou are always learning.\n\nBecause the kids will challenge you and ask you stuff\n\noutside of my little slight field of knowledge that I know.\n\nThis is from blobbytheblobfish2.\n\nTeachers of Reddit,\n\nwhat is the funniest excuse for being late,\n\nnot doing homework, etc,\n\nyou've ever heard from a student?\n\nOkay, by the way, this does happen.\n\nAnd the stories that the kids make up,\n\nthe ones that are so good I think are actually true.\n\nI'm not kidding you.\n\nI have had kids say, my dog has eaten my homework,\n\nand I actually believe them because I have a dog.\n\nThe dogs do eat your homework.\n\nParticularly the kids who have two homes,\n\nsome of them from divorce,\n\nsome of them because of they have two homes\n\nthat's left in one home, and then their car broke down,\n\nand then they couldn't get to the home to get the homework,\n\nbut then they're gonna have someone deliver it for them.\n\nI don't even care about the homework.\n\nI [laughs] I don't even grade the homework.\n\nYou don't even have to turn the homework in.\n\nBut then I'll have kids that are constantly late,\n\nand it becomes a class joke.\n\nIt's no longer like, oh my gosh, Susie's late again.\n\nIt's like, wait, Susie, you're on time.\n\nWhat are you doing here, you're supposed to be late.\n\nThere's often no reason.\n\nAnd they're like, Oh yeah, I was at my locker.\n\nAnd then I'll often see Susie in the hallway,\n\nlike kind of staring into space.\n\nI'm like, Susie, don't you have class?\n\nOh yeah, I think I do have class.\n\nLike they just forget.\n\nSome of them that are late are always gonna be late,\n\nbut it doesn't matter in the end,\n\n'cause they're these people\n\nthat are doing wonderful things in life.\n\nSo if you're late, you're late.\n\nLike it's okay.\n\nIt's not gonna-\n\nIt's not gonna, whatever.\n\nOkay, this is from the homeschooling subreddit.\n\nHow do you create a curriculum?\n\nOh, it's a good question.\n\nOkay, I think what the question means,\n\n'cause you don't create curriculum.\n\nYou are mandated by the state to cover certain curriculum.\n\nAlgebra is algebra.\n\nYou have to get through, you know,\n\nquadratic equations and factoring,\n\nand line with slope and y intercept.\n\nI think maybe what the question is asking is,\n\nhow do you create pedagogy or how you teach the curriculum.\n\nSo this is the fun part about teaching.\n\nSo I take professional development classes\n\nand you learn all different modalities\n\nbecause everybody learns in a different way.\n\nSome kids are visual, and they're like wanna learn\n\nand see the graph on their calculator.\n\nSome kids are auditory,\n\nand so you have to talk it out with them.\n\nSome kids are kinesthetic so they have to actually do it.\n\nYou just keep practicing,\n\nand you go and visit other teachers,\n\nand you take professional development,\n\nand you try something and you fail,\n\nand you try something again and it works.\n\nAnd something that works with one kid\n\nwill fail with another kid.\n\nSo it's continually trying, and trying,\n\nand doing different iterations.\n\nOkay, this one is from jellyfish5729.\n\nThe question is, Where is all the money going?\n\nIt is not going in the teacher's pockets.\n\nThe money is going to the administrators,\n\nwho are earning, and earning, and earning,\n\nwhile we are in the trenches trying to do all the hard work.\n\nThe money is not going to the supplies\n\nbecause we the teachers are buying the kids the supplies.\n\nI don't know where the money is going,\n\nbut it is not going in our pockets.\n\nAzizarimsakov18 asks,\n\nHow long does it take you all to grade assignments?\n\nI have been teaching for many, many years.\n\nIn the beginning, it took me so long,\n\nbecause I had to learn to assign points to each thing,\n\nand then I would get nervous that I graded it wrong.\n\nYou know now what I do is,\n\nI grade all of page one, and all of page two,\n\nand all of page three so that I'm grading everybody evenly.\n\nSo it took me a long time in the beginning,\n\nbut now I have it down,\n\nso it doesn't take me a long time.\n\nI think it will always take English\n\nand history teachers a long time,\n\n'cause they are reading lots of papers.\n\nI'm just looking through and finding what I need.\n\nKindly_Sir_6050 asks, Armed security thoughts?\n\nCan you believe we have to think about that\n\nand actually it's so real.\n\nYes, armed security thoughts.\n\nI have a lot of thoughts on it.\n\nThe fact that we're having drills for active shooters,\n\nfor somebody on campus with a weapon.\n\nWe actually have armed security on campus.\n\nYes, we have that.\n\nKids do not have to walk through\n\na metal detector coming on campus.\n\nI think it's coming though at the school where I work.\n\nAs much as I hate to say this,\n\nand I'm not somebody who's all about weapons,\n\nbut I think armed security\n\nmakes me as a teacher feel better.\n\nI didn't know as a teacher\n\nI was gonna have to become a policeman.\n\nSo yeah, armed security, if it's not there, it's coming.\n\nThe next question is from WiscOrangy.\n\nOh, I love this question.\n\nIf you could give one piece of advice\n\nto a high school student, what would it be?\n\nI guess what I would like to say is, be your free self.\n\nJust be yourself, have confidence.\n\nI'd like to give you confidence to be free, be you,\n\nand do what you love,\n\nand try to block out the noise\n\nof what you worry that other people are gonna think of you.\n\nJust be your beautiful self.\n\nAll those societal norms of, oh, go and be a professor.\n\nGo and be a doctor, go and be a lawyer.\n\nNo, go and be what you love.\n\nIf you wanna be a photographer, work hard at it.\n\nGo and be a photographer.\n\nIf you wanna be an aesthetician,\n\ngo and be an aesthetician and work hard at it.\n\nAnd all that societal noise that comes from your teachers,\n\nthat comes from your parents, that comes from your siblings,\n\nblock that out and be your true self,\n\nand have confidence being your own self.\n\nThat's what I would say.\n\nIf I could give that advice to every single student,\n\nthat's what I would say.\n\nGo be you.\n\n@aMoral_Mistake.\n\nHow would you react\n\nwhen a student corrects you in class on something?\n\nOh, I love when a kid corrects me.\n\nFirst of all, they're paying attention.\n\nThank you, thank you all for paying attention.\n\nSecond of all, they're engaged,\n\nand they wanna challenge you.\n\nYes, correct me because I am not the be all end all, please.\n\nYou know that idea of the more you learn, the less you know,\n\nthat's what we teachers are.\n\nSo yes, please correct us, we love it.\n\nMost of mine are like clerical errors.\n\nSo for example, if I forget to carry the negative down,\n\nyou know, a kid will say,\n\nOh, Miss Fox forgot the negative.\n\nOr if I'm graphing and I look at the slope,\n\nand I'm doing a positive slope versus a negative slope,\n\nand they're like, Wait, shouldn't that go the other way?\n\nAnd they're often so cute.\n\nThe kids are like,\n\nthey don't wanna step all over your toes,\n\nbut I tell them, step all over my toes.\n\nYes, come in and tell me what I did wrong.\n\nSometimes we have a Goodwill Hunting situation.\n\nAll I can do is guide that kid where to go\n\nbecause that kid knows way more than I'll ever know.\n\nAnd so you just have to show them where to go.\n\nGo to the next step to, you know, try this, try that.\n\n'Cause they are, they know all their stuff,\n\nand those are fun kids to have and intimidating.\n\nThis one is from Abelmageto.\n\nWhat's the hardest part of teaching\n\nthat no one warns you about?\n\nOh my gosh, how much time do we have here?\n\nThe hardest part about teaching is,\n\nyou actually wear 400 hats.\n\nNot only are you trying to convey information,\n\noftentimes the people that don't really wanna learn it.\n\nAnd it's oftentimes a really difficult topic.\n\nThat's the part you signed up for.\n\nThe part you didn't sign up for,\n\nis all the emotions of adolescence\n\nthat a kid comes in, so-and-so's mad at them,\n\nbecause they looked at them the wrong way,\n\nor they talked to so-and-so's boyfriend's sister\n\nand you have to kind of breeze this over.\n\nOr somebody vomits in your class\n\nand you're like, okay, let me get you out of the classroom.\n\nOr somebody is in the middle of trying to finish a paper\n\nand they're flying off the hand.\n\nI mean, there's so many things,\n\nor they don't have their supplies,\n\nor they having a fight with their mom\n\nand so they were unable to complete their work.\n\nYou're making, seriously, 30 decisions in one minute.\n\nMy God, there are all these little things\n\nthat by the time you leave as a teacher\n\nand you get in your car,\n\nyou're comatose and you can't even talk.\n\nI get home and I say,\n\nNobody please, nobody talk to me, nobody look at me.\n\nYou just have to decompress.\n\nOh my gosh, you don't get to go to the bathroom,\n\nthat's the other thing.\n\nOr the prep way into the night or the grading.\n\nI guess that's to be expected.\n\nBut yeah, I love the job and it's a hard job.\n\nThis is from Calla.\n\nHigh Schools should offer 'a career explorations' class.\n\nOh my gosh, wouldn't that be fabulous?\n\nI think it's a great idea\n\nto offer a career explorations class.\n\nAnd I think a way to do it is,\n\nto have the parents come in, and talk about their careers,\n\nand even set it up almost like a festival,\n\nso that kids can just walk around\n\nfrom anybody who wants to talk about their career\n\nand talk about it in a sense of,\n\nlike the everyday, you know, not just the fun part,\n\nbut the parts that get hard,\n\nand so that the kids can see exactly what it is\n\nand even go so far as to maybe intern over the summer\n\nfor a couple weeks in each different career\n\nso you can get an idea.\n\nEven if it turns out\n\nthat you thought you wanted to do something\n\nand now you don't wanna do it,\n\nthat's also just as powerful.\n\nSo yes, we should definitely have\n\na career explorations class, or day, or couple of weeks.\n\nOkay, the next question is from Kathtb.\n\nIs this the worst time to become a teacher?\n\nGod, it is a really hard time to become a teacher, yes.\n\nI think the hardest time to be a first year teacher\n\nwas 2020.\n\nThat would've been a really hard time.\n\nImagine starting out your career on a camera.\n\nWhen you're tutoring with your students,\n\nyou cannot sit next to them anymore.\n\nAnd if you're alone with a kid in the classroom,\n\nthe door has to be open.\n\nIt is a very hard time to be a teacher.\n\nLast year we had a bomb threat.\n\nFor real, I'm not kidding you.\n\nWe had to evacuate the building\n\nand get as far away from where we thought the threat was.\n\nAnd then we had the bomb squad coming on campus\n\nand searching the entire campus.\n\nAnd then there was an active shooter,\n\nor somebody with a gun at a school down the street.\n\nSo again, we had to evacuate.\n\nThis happened three times last year.\n\nAnd I'm just talking about it like it's normal,\n\nlike we have drills for this.\n\nIn that sense, it is a very hard time.\n\nYes, AI has infiltrated, cell phones have infiltrated.\n\nSo if I were to become a teacher today,\n\nI wouldn't have lasted 30 years.\n\nWhen I started teaching, we didn't have these,\n\nwe did not have graphing calculators.\n\nSo if I wanted to teach my kids about a graph,\n\nwe had to draw it, we had to do everything by hand.\n\nI used the computer to project something on the board\n\nthat everybody can see.\n\nBefore, I'd have to write that all out.\n\nThat is a lot of work for a teacher.\n\nI know that I'm saying I want the computers out.\n\nIt is hard to find that balance.\n\nThere are a lot of things we've acquired,\n\nbut we, in my opinion, have gone over.\n\nWe've gone overboard,\n\nand we need to go back,\n\nback a little bit.\n\nI don't think it's the worst time.\n\nI think it's a hard time to become a teacher.\n\nFrom Unknown-Nerd6207.\n\nIf schools and colleges have zero tolerance,\n\nwhy is bullying so common?\n\nBy the way, it is.\n\nIt is common, it happens.\n\nIt's because the teachers, the administrators,\n\nwe don't see it.\n\nIt occurs online, it occurs through their text messages.\n\nIf it were occurring person to person, we would see it.\n\nThat's not how it's occurring now, it's so underneath.\n\nYet another reason, get rid of those cell phones.\n\nDon't be on social media.\n\nI mean, really, if I could give any advice to students,\n\nI would say get rid of your cell phones, smash it,\n\nand get off of social media.\n\nAnd I'm not kidding,\n\nlike I actually would say that.\n\nThe only way you can see it,\n\nyou can see it in a kid's body language.\n\nAnd when you see a kid\n\nwho's behaving a little bit differently,\n\nyou cannot say to them,\n\nHey Jimmy, I noticed you're really down.\n\nThat is the worst thing you can do to a kid.\n\nAdolescents do not want the light shown, shined on them,\n\nwhatever the proper grammar is.\n\nBecause it is very hard for a kid to be bullied\n\nand they feel like it's their fault.\n\nThat's one of the issues.\n\nWhat you can do, is you can take a little note,\n\nwrite a note saying,\n\nHey, is everything okay?\n\nDo you wanna talk?\n\nFold it up.\n\nJust walking along around the classroom,\n\ntalking to kids, and then, you know,\n\nyou just kind of put the note on their desk and walk away.\n\nAnd then Jimmy looks at it and is like,\n\noh, I can go and talk about it with her.\n\nIt's not usually that same day.\n\nThey'll slowly come in and talk to you\n\nand be like, Hey, so can I talk to you?\n\nOf course, come and sit down, talk to me.\n\nAnd so that's the only way that we can find out about it,\n\nis by directly asking them.\n\nThey will not come to you and tell it.\n\nSo, that's,\n\nthe sad truth.\n\nI had a student that was-\n\nSo awful,\n\nthat was bullied in a very uncomfortable way\n\nthrough a group text message.\n\nThe kid was on a group text,\n\nand was being bullied and targeted on the group text.\n\nAnd so,\n\nI had to report that,\n\nand then it gets a little messy\n\nand the kid never wants to be involved in that.\n\nSo, it was reported to the grade-level dean.\n\nThe grade-level dean just,\n\ndoes an initial to the entire class.\n\nLike if it's 10th grade and says,\n\nYou know, it's come to our attention\n\nthat there's some bullying going on,\n\nand we wanna remind you this is not how we like to present.\n\nAnd,\n\nif this continues\n\nthen we have ways of knowing that it's gonna continue.\n\nThere are gonna be consequences put into place.\n\nAnd if it continues,\n\nthen we do have to call in the perpetrator\n\nand they they have to be suspended.\n\nIt is really ugly, it's not pretty.\n\nAnd so, that happens.\n\nAnd that's the only way to find it though.\n\nIt's really hard to deal with.\n\nSo, yeah, that's a hard question.\n\nSo this is from brownpikachu.\n\nWhy do we associate apples with teachers?\n\nLemme just tell you, the apples with the teachers.\n\nPart of it is history.\n\nPart of it is because apples are available everywhere\n\nand part of it is a form of payment.\n\nSo, kids get apples to teachers as a form of thanks,\n\nas a form of payment.\n\nIt has a historic component.\n\nI'm not entirely sure,\n\nbut I can tell you, during the school year,\n\nI eat an apple every single day during nutrition,\n\nand I just eat it like this.\n\nI just, I don't even cut it.\n\nI eat the whole thing down to the core,\n\nand I don't know why I am a teacher and I do love an apple.\n\nThis is from the Teachers subreddit,\n\nPrivate or public - pros and cons?\n\nOkay, from the teacher's perspective.\n\nPrivate schools,\n\nsmall size classes, kids who are excited to learn.\n\nAnytime you need something,\n\nall you do is go to your administration,\n\nthey'll buy it for you.\n\nBeautiful teaching environment.\n\nPublic schools,\n\nyou get paid when you retire,\n\nyou get great benefits.\n\nYou have bigger classes,\n\nyou are paying for all your supplies.\n\nPrivate school, parents are all over you.\n\nYou are meeting with them constantly.\n\nPublic school, I don't even know if the kids have parents.\n\nSo, that's it from the teacher's side.\n\nSo this is from reuniteottomanempire.\n\nAnd the question reads,\n\nWhy did No Child Left Behind fail?\n\nSo the act, No Child Left Behind,\n\nwas put into place in 2002 by President Bush.\n\nAnd then in 2015 it was replaced by Every Student Succeeds.\n\nYeah, that's a tricky one,\n\nbecause if every child succeeds,\n\nor no child is left behind,\n\nthat means we are actually pulling along kids\n\nthat aren't really ready to go ahead.\n\nOur society expects every kid of the same age\n\nto be at the same place.\n\nReally?\n\nThat's ridiculous.\n\nEvery kid is at the place where they are supposed to be,\n\nwhat is right for them.\n\nIf it takes one kid two years to learn rather than one year,\n\nlet them take the two years.\n\nIf it takes one kid half a year to learn, let them learn.\n\nBecause every kid's brain is made differently,\n\nthis is why it has failed.\n\nI know there were good intentions behind it,\n\nbut it doesn't really work.\n\nThis is from Valuable_Programmer6.\n\nWhy are kids so misbehaved in school?\n\nOh my gosh, there's so many facets to this.\n\nOkay, number one, they could be bored,\n\nso they need to be active.\n\nAnd our education system is a very antiquated system,\n\nwhere kids are rewarded for sitting still\n\nand just taking notes.\n\nSo that's one issue.\n\nI also think that there are issues\n\nwith kids that have\n\njust different chemistries in their body,\n\ndifferent brain chemistry,\n\nand they are misbehaved\n\nbecause that's not what their body is meant to do.\n\nThey are meant to move around\n\nand they need activities to keep them busy.\n\nThey need teachers to be educated in how to help them.\n\nI don't even wanna call them misbehaved.\n\nThe kids are just being them,\n\nand the teachers might not like that,\n\nbecause it's not what they were trained to do.\n\nThe scrolling on the phone is just,\n\nthat does make me a little crazy.\n\nI do think that the cell phone has contributed\n\nbecause kids are so used to the constant entertainment,\n\nentertainment of switching so rapidly,\n\nI do think that overall kids' brains have changed.\n\nI'm not saying it's a bad thing,\n\nI'm just saying kids' brains have changed,\n\nand they like to see things quickly, quickly, quickly.\n\nI think we just have to, as teachers,\n\nif we change around what they're doing quickly,\n\nthey're not as misbehaved.\n\nI would love to see kids\n\nbe able to focus on something for longer.\n\nI do think that with time they will,\n\nbecause they'll get more accustomed to it.\n\nSo if we keep the cell phones out of the kids' hands,\n\nthen we will have\n\na little bit better of an outcome with that,\n\nas far as behavior.\n\nThe next question is from spankyourkopita.\n\nAs a teacher, do you really have less off hours,\n\nand downtime compared to other jobs?\n\nYou don't, eight o'clock in the morning,\n\nyou're in front of a classroom full of kids\n\nand you are trying to impart knowledge,\n\nuntil 2:30 or 3 o'clock.\n\nWhen am I preparing my classes?\n\nWhen am I grading my lessons?\n\nWhen am I learning more?\n\nAll of that is during your off hours,\n\nwhen you're not working.\n\nIf you have a doctor's appointment, too bad.\n\nYou cannot really leave easily,\n\nyou can't be sick, because if you're sick,\n\nit's twice as much work to prepare a lesson\n\nfor a substitute, so that you can go and be sick.\n\nWe get summers off, we get Christmas breaks off,\n\nspring breaks.\n\nSo we have those.\n\nI think of the summers as recovery time,\n\nbut my battery is so depleted\n\nthat I feel like I need the summers to get back on track.\n\nNext question.\n\nDishsoapbox asks,\n\nHow is dismantling the department of education\n\ngoing to affect teachers?\n\nOh my gosh, I have no idea.\n\nAll I can guess is, we'll get paid even less.\n\nObviously you all know,\n\nwe are not in it for the outcome of money.\n\nWe're in it for the outcome of the students.\n\nSo, dismantling the Department of Education,\n\nI'm not sure how it's gonna actually affect the teachers.\n\nI can't imagine it would be anything positive.\n\nWhat I'm fearing, teachers are gonna lose their jobs,\n\nclasses are gonna be become larger.\n\nThere are gonna be less resources for teachers.\n\nNothing good will come of that, let me be very clear.\n\nAnd it's actually kind of sad,\n\nbecause I do think teachers do a lot of work\n\nand there's so much behind the scenes work that we're doing\n\nthat it's just gonna become greater and greater.\n\nThe volume is going to increase,\n\nand I think that it's not just gonna affect the teachers,\n\nI think it's gonna affect the teaching\n\nand then the student's ability to absorb, it's not good.\n\nThis is not a good outcome.\n\nUniversityNo6511.\n\nChaperone for Prom What to wear?\n\nOkay, so chaperone for prom,\n\nI would wear like a gown, yeah.\n\nChaperoning for prom for teachers was really fun.\n\nGentlemen wear tux, women wear dresses,\n\nnon-binary, something appropriate,\n\nbut you're dressed up, it is a black tie affair.\n\nYou get to walk around and look at the kids all dressed up.\n\nSo that is a, it's a fun activity.\n\nI'll even get makeup done, or hair, nails, the full nine.\n\nDo the whole thing, it's very fun activity.\n\nAnd we go for free.\n\nSo this one is from Afalstein.\n\nGreat Curves: Yea or Nay?\n\nLet just explain what a curve is.\n\nOkay, so just think of a curve,\n\nwhere most of the kids lie in that very middle,\n\nthat's your average.\n\nThat would be considered a C.\n\nAnd then standard deviations are, I think 34% above.\n\nSo that is where your A's and B's will lie.\n\nAnd then in the opposite direction,\n\nthat's where your D's and F's will lie.\n\nSo if you wanna know how do you lie with your peers,\n\nthen yes, curve, there should be curves.\n\nIf you just want to make everybody feel good,\n\nand give them a good grade, then we don't need curves.\n\nThere is so much grade inflation,\n\nit doesn't matter whether we are curving,\n\nbut in my personal thought,\n\nyes, you should put curves in.\n\nIt just helps to distinguish which kids know\n\nwhat percentage of it, that's all it is.\n\nSo I'm kind of behind it, yeah, I am.\n\nDo I use it?\n\nNo, we're not allowed to.\n\nFrom Square-Dragonfruit76.\n\nDo you think that the timing and scheduling of school days\n\nneeds to be restructured?\n\nYes, I do.\n\nStudies have shown\n\nthat adolescents have a much later circadian rhythm than,\n\nsay, young children or older adults.\n\nTheir natural wake up time,\n\nleft to their own devices, is much later.\n\nSo if we have them wake up early, nine o'clock,\n\nand have classes start 9:30, 10, and go until later,\n\nthat would be much better for students.\n\nThe kids that I see,\n\nfirst thing in the morning, are still sleeping.\n\nIt is the equivalent of, me being up at four in the morning.\n\nThey're not awake yet.\n\nTheir brains aren't working yet.\n\nAnd so, yes, we do need to restructure that.\n\nI don't know why we haven't.\n\nI think lately we just made it to,\n\nat least in California,\n\nthe new start time can't be anything earlier than 8:30.\n\nThat's still too early for kids.\n\nIt needs to be at least 9:30 or 10 start time,\n\nand I think kids would actually be awake at that time.\n\nOkay, next question from, MrNoName_ishere.\n\nWhat should schools do\n\nto improve the mental health of their students?\n\nThank you, MrNoName_ishere, for asking that,\n\nbecause this is a serious question, and I do believe that,\n\nthat is the responsibility of the entire school,\n\nthe faculty, the staff,\n\nthe anybody you come into contact with,\n\nthe mental health is really, really, really important.\n\nHow can we improve it?\n\nI think if we can focus\n\na little bit less on the academics,\n\na little bit more on the social and emotional learning,\n\nspecifically, checking in every morning with your students,\n\nchecking in with each other,\n\nthe kids, checking in with each other,\n\nfaculty, checking in with each other,\n\nand being honest about it.\n\nIf you're having a bad day, name it, I'm having a bad day.\n\nSay why.\n\nIt becomes normalized where people are not saying,\n\nI'm doing terribly, and it becomes this whole thing.\n\nOh, tell me more.\n\nInstead of, oh my God, I'm so sorry.\n\nYou know, just normalize it,\n\nso that you can at least talk about it.\n\nAnd someone knows, oh yeah, he's having a bad day,\n\nshe's having a bad day, they're having a bad day.\n\nPut it out there, make it normal, is how I recommend it.\n\nI still think there's shame associated\n\nwith making an appointment, going to a therapist,\n\nsomething's wrong with me.\n\nAnd particularly for adolescents,\n\nI think it needs to be woven into the fabric of the school.\n\nSo, more like, you know, when you have homeroom,\n\nyou call it homeroom,\n\nbut it is like a real check-in of like,\n\nhow'd you sleep last night?\n\nHow do you feel?\n\nYou know, what are you looking forward to in the day?\n\nWhat's gonna be your hard part of the day?\n\nLet's open the class with an icebreaker question,\n\njust so that the kids can get talking to each other.\n\nSo that becomes a normal part.\n\nAnd this used to be normal.\n\nThis wasn't-\n\nAnd I do think a lot of it has to do with the cell phones.\n\nPeople are not socializing as much\n\nbecause they're on their phones,\n\nand it's harder for them to just strike up a conversation.\n\nSo, we need to get back to that.\n\nNext question, cactus319_1804.\n\nI'm in high school,\n\nhow much of life am I supposed to have figured out?\n\nNone of it.\n\nYou're not supposed to have any of it figured out.\n\nSo if you don't know anything, you're doing it right.\n\nYou're not supposed to have it figured out.\n\nAnd it's not linear.\n\nIt's all messy and all over the place.\n\nYou're gonna try something and love it,\n\nand then three months down the line you're gonna hate it.\n\nAnd then you're gonna be embarrassed\n\nabout your three-month old self from there.\n\nThat is just how it goes, it takes a while.\n\nI'm 57 and still figuring it out.\n\nYou're gonna always be figuring it out.\n\nDo what you like and keep going with it,\n\nuntil you don't like it and try something new.\n\nJust try to have the confidence to try the new things,\n\nbut you should have none of it figured out.\n\nAnd if you have it figured out, that is a little egregious.\n\nThis is from beaucepower.\n\nWe are still trapped in a K-12 public education system,\n\nwhich is preparing our youth for jobs that no longer exist.\n\nCritical thinking, how to prepare students\n\nfor a rapidly changing world?\n\nSo, so true.\n\nTraditional education, where the kids sit in a desk,\n\nand learn from a textbook is no longer useful.\n\nThat is, we can't do that anymore.\n\nCritical thinking is everything.\n\nYou have to expose kids to things they've never seen before,\n\nhave them struggle.\n\nYes, it's a struggle, life is struggling.\n\nYou're gonna have superfluous information in your questions\n\nand you're gonna be like, oh, I don't need to know this.\n\nNo you don't.\n\nOkay, so throw it out.\n\nYou have to figure out what you're gonna need,\n\nwhat you're not gonna need, and kind of go from there,\n\nand work with your friends, work with your peers.\n\nHey, I can't really figure this out.\n\nWhat do you think about this?\n\nAnd collaborating, talking to each other,\n\nthat's where you're gonna get your information.\n\nYes, you're right.\n\nThe traditional classroom setup is completely antiquated\n\nand it's not helping kids learn what they need to know\n\nfor the jobs that we don't even know exist yet.\n\nSo this is from the AskReddit sub-Reddit.\n\nTeachers and professors of Reddit,\n\nwhen you assign 7-10 page papers,\n\ndo you actually read the whole thing?\n\nI can't answer that as a math teacher.\n\nI can answer it as a college student, when I was in college.\n\nI took a chemistry lab class\n\nand we were doing this lab on tadpole eggs\n\nthat turned into tadpoles and then we watched them grow\n\nand we were doing these experiments,\n\nand I was writing this like 7 to 10 page paper.\n\nAnd I was wondering, does my teacher actually read it?\n\nAnd so then I said, while I was doing the lab,\n\nI got really hungry.\n\nI took some of the eggs, scrambled them up,\n\nand put some ketchup on 'em and ate 'em,\n\nand they were delicious.\n\nIt was like two sentences in the whole paper.\n\nShe took her pen, circled it,\n\nand put question mark, question mark by it.\n\nSo I guess maybe they do read it, so.\n\nFrom the ArtificialIntelligence subreddit.\n\nWhat should a high schooler study now?\n\nOh my gosh, that is such a good question.\n\nMs. Fox, when are we ever gonna use this?\n\nIs a question that every single kid has asked.\n\nAnd if you haven't asked, you should.\n\nEverything you're learning guys,\n\nyou're never gonna use again.\n\nI know, it's a horrible thing to say,\n\nhowever, it's actually true.\n\nThe reason why I think school is good,\n\nlike the one thing you do get out of school,\n\nis learning how to learn, learning how to be social,\n\nlearning how to interact with others,\n\nlearning how to collaborate.\n\nThose are the most important things\n\nthat you're gonna be learning.\n\nLearning how to ask questions.\n\nIf your kids aren't talking in class,\n\nyou need to change that.\n\nThe kids aren't gonna change that.\n\nAnd what you can do to change it\n\nis have them sitting together,\n\ngive them questions on cards,\n\nthat say, icebreaker questions.\n\nIf you're on a stranded island, and you only get one food,\n\nwhat are you going to eat?\n\nGet them talking about something\n\nthat's easy for them to answer.\n\nWhat's their favorite movie?\n\nAny kind of questions so that they can start to collaborate,\n\ntalk to each other, get to know each other,\n\nand then they can do the math, and have them disagree on it,\n\nand argue it and come up with different ways\n\nof solving a problem,\n\nand giving 'em problem solving skills\n\nand collaborative work.\n\nThey need to be able to work with each other\n\nand question authority.\n\nThose are the things that they're learning in school.\n\nIt's not so much about the actual curriculum of the topics.\n\nWhat you should be studying now\n\nis whatever brings you passion,\n\nand that's gonna be different for each person.\n\nIf what you love has to do with technology,\n\nstudy technology.\n\nIf what you love has to do with art, study art.\n\nAnd when I say study it,\n\nstudy it, get in there, be the nerd that you're gonna be,\n\nand it's very unlikely that you're gonna have a class\n\nthat is gonna be what you're gonna be.\n\nSo, you find what you love and go deep in it.\n\nThis is from ThrowAwayUseOnly.\n\nAs a public high school teacher,\n\nit shouldn't be my responsibility\n\nto care for my students' social and emotional wellbeing.\n\nOh my gosh, I disagree, okay?\n\nI'm gonna say ForThrowAwayUseOnly,\n\nI have to disagree with you.\n\nIt is totally my responsibility.\n\nI'm spending all the time with the kids.\n\nWhose responsibility is it gonna be?\n\nI love knowing what's going on with my kids.\n\nI wanna hear what's going on.\n\nI am most honored when a kid comes in during lunchtime\n\nor after school and says,\n\nI have this thing on my mind\n\nand I wanna share it with you.\n\nAnd has nothing to do with math.\n\nI want them to say, you know, I'm trans.\n\nAnd that is a piece of information I'm honored to hear.\n\nAnd I'm confused about it\n\nand I just wanna talk to someone who will listen.\n\nIt is absolutely our responsibility,\n\nand it is a gift and an honor\n\nto have someone share their stuff with you.\n\nSo, I disagree with you ForThrowAwayUseOnly.\n\nSo we can agree to disagree on that one.\n\nOkay, can we talk, is this okay?\n\nCan we chitchat, the whole group?\n\nI wanna know where are you guys at,\n\nwhat did you think of not having your phones?\n\nAnd be honest, was it hell not having your phone?\n\nJust be, I just wanna know. I'm fine.\n\n[participant laughs]\n\nWho struggled?\n\nThank you for playing the game.\n\nThank you teacher. You're welcome.\n\nDo you want an apple?\n\nThose are all the questions for today.\n\nThanks for watching Teacher Support.\n\nOkay, class, you can have your phones back now.\n\nHere you go.\n\nThank you for playing along.\n\nThat was really fun.\n\nThank you for letting me do this, I really enjoyed it.\n\n[bright music]",
  "authors": [
    "Condé Nast"
  ],
  "url": "https://www.wired.com/video/watch/tech-support-teacher-answers-teacher-questions"
}