{
  "title": "Wake Up Dead Man adds a delightfully dark twist to Knives Out",
  "text": "When director Rian Johnson introduced the new Knives Out film on the third day of TIFF 2025, he exclaimed: “we’re going back to church.”\n\nBy that he meant that Wake Up Dead Man, the latest Benoit Blanc mystery, would harken back to the origins of the whodunit, and in particular the gothic vibes of Edgar Allan Poe. And now that I’ve seen it, I have to say that Johnson pulled it off: the new movie has a darker and more spiritual feel than its predecessors, and yet it’s still distinctly Knives Out, which is to say twisting and hilarious. I gasped a few times, as did the rest of audience, at the many reveals. I’ll have a full review in the coming days, but you can read my initial thoughts below.\n\nIn addition to that, I managed to watch a tense German film about the dark side of being an influencer, a Saudi crime thriller with a deflating twist, a hilarious dark comedy about how terrible kids can be, and the best pure action flick I’ve seen in some time. It was a hectic and eclectic day to say the least. (Unfortunately most of these movies don’t currently have premiere dates for a wider audience, but I’ll let you know if that changes.)\n\nAnd if you missed them, you can read my previous dispatches from this year’s TIFF as well, covering films like Exit 8 and No Other Choice.\n\nWake Up Dead Man\n\nBenoit Blanc’s (Daniel Craig) third outing is the darkest and most complex yet. It covers a murder in a small church community in New York, as Blanc pairs up with a young priest (Josh O’Connor) and the local sheriff (Mila Kunis) to figure out what’s going on. Of course it’s not so simple; in fact, Blanc constantly calls the case “impossible.” But that complexity allows the film to build up an incredible cascade of twists and turns that seems to just keep going up until reaching a powerfully emotional crescendo. And don’t worry: even though the tone is more dire and serious at times, this also might be the funniest Knives Out has ever been\n\nIn select theaters on November 26th, before streaming on Netflix on December 12th.\n\nImage: XYZ Films\n\nThe Furious\n\nAn absolutely unrelenting and bone-crunching action movie starring Xie Miao and Joe Taslim as two men fighting to take down an underground child-trafficking ring. Each fight sequence is as brutal as it is balletic, and yet there’s an inventiveness and playfulness to it as well. Nearly everything can be part of the choreography, whether it’s duelling with bicycles as if they were swords, or downed foes becoming a human pyramid to climb. If you want an idea of how extra this movie can be, imagine a classic hallway fight just teeming with bad guys, and then add a motorcycle. The final sequence, between five men with different aims, is chaotic, exhausting, and impossible to look away from.\n\nNo word yet on a wider theatrical release.\n\nBabystar\n\nAs an only child, Luca (Maja Bons) is the centerpiece of a wildly successful influencer family. Nearly every important moment in her life has happened in front of a camera; she learned about periods from her mom on a podcast. She’s rich but alone, and when her parents move ahead with plans to have another child — spurred, it seems, primarily by the content opportunities — Luca starts to question the life she’s been forced into. Early on the movie feels suffocating in a good way, mirroring how Luca feels. But it never quite figures out how to direct that energy, and the story meanders to a conclusion while mostly wasting a subplot about Luca’s AI avatar.\n\nNo word yet on a wider theatrical release.\n\nImage: Pulse Films\n\nBad Apples\n\nIt really seems like everything would be OK for school teacher Maria (Saoirse Ronan) if she didn’t have to deal with the one problem child in her class. And then, one day he does really go away — I won’t spoil the why or how — and her life does get better, as does the rest of the class, who thrive once they have a teacher who isn’t stressed all day. But the unhinged twist in Bad Apples lingers, and the film becomes such a funny romp as Maria tries to balance doing the right thing with working towards the greater good.\n\nNo word yet on a wider theatrical release.\n\nImage: TIFF\n\nUnidentified\n\nThis movie starts out well, before blowing it with a twist that feels cheap and implausible. Nawal (Mila Alzahrani) is a receptionist for the police, but also a true crime addict, so when she’s asked to help out with a case of a murder girl, she becomes obsessed. The complications that arise from an unauthorized woman trying to solve a crime in Saudi Arabia add an interesting twist to the genre, and the mystery is enjoyable right up until the ending, which I won’t spoil, only to say that it undoes the goodwill the rest of the film creates.\n\nNo word yet on a wider theatrical release.",
  "authors": [
    "Andrew Webster"
  ],
  "url": "https://www.theverge.com/movie-reviews/773429/tiff-2025-wake-up-dead-man-bad-apples-review"
}