{
  "title": "Historian Answers Revolution Questions",
  "text": "Transcript\n\nHi, my name is Jack Goldstone.\n\nI'm a political scientist at George Mason University.\n\nLet's answer your questions from the internet.\n\nThis is Revolution Support.\n\n[upbeat music]\n\nGolden Kumquat asks, What is the difference\n\nbetween a rebellion, a revolution, and a civil war?\n\nVery few people are proud to say they've started a civil war\n\nor rebellion, but lots of people love to say,\n\nI started a revolution.\n\nCivil wars, rebellions, they're often part\n\nof revolutionary struggles,\n\nbut by themselves, they're just violent episodes.\n\nIt's the effort to change things for the better\n\nthat makes a revolution special.\n\nPhilip is asking, It's a little known fact,\n\nbut did you know the French Revolution was largely\n\nabout baguettes?\n\nWell, Philip means that humorously, no doubt,\n\nbut he is right that the French Revolution was largely about\n\nthe price of bread, shortages of grain,\n\nand escalating bread prices are one of the main factors\n\nthat brought French people into the streets of Paris,\n\nand this has been really true\n\nof revolutions throughout history.\n\nWe have seen price spikes\n\nas an important factor in the Arab uprisings,\n\nwhere bread prices reached\n\namong their highest level in the early 20th century, indeed,\n\ngovernments around the world worry\n\nabout escalating grain prices because they do know\n\nthat revolutions often start with the price of bread.\n\nLRSpiral asks,\n\nIs Nepal having a [beep] revolution right now?\n\nYes, Nepal is having a revolution.\n\nOne of these Gen Z revolutions have forced the ruler\n\nto flee, and a new ruler has been put in place\n\nwith a mandate to create a more constitutional\n\nand accountable government.\n\nThe reason young people are spearheading revolutions\n\nin places like Nepal, is that they are fed up.\n\nYoung people are protesting against the lack\n\nof basic services; electricity being shut off\n\nfor hours every day, absence of things like fresh water.\n\nThey know that there are better options available,\n\nand they're angry at governments\n\nthat have been enriching themselves while doing\n\nnothing for the population.\n\nKrisHolt1 says, Me: Who do you think has been\n\nthe most significant figure in China\n\nsince the Shanghai Revolution of 1911?\n\nMy cat: Mao.\n\nThe hero of the Shanghai Revolution was Sun Yat-sen.\n\nSeveral decades later, Mao came as the head\n\nof the Communist Party and created modern communist China\n\nand wanted to destroy anything in China\n\nthat didn't conform to his communist vision.\n\nSo Mao is the creator of the modern Chinese communist state,\n\nbut for me, the most important person in China\n\nsince the Shanghai Revolution is Mao's successor,\n\nDeng Xiaoping, the creator of China's modern economy.\n\nHe encouraged cities to sponsor local industries.\n\nHe encouraged farmers to improve their efficiency\n\nand farm for markets.\n\nThe reason that China today is the second largest economy\n\nin the world is because of Deng Xiaoping.\n\nHe set the framework for China's economy to grow and grow,\n\nand that, I think is what really changed\n\nChina's place in the world.\n\nJackC1126, Are there any revolutions\n\nthat are mostly considered to have been bad?\n\nRevolutions are the creation of human beings,\n\nand human beings are both virtuous and flawed.\n\nHowever, there may be some agreement that one\n\nof the worst revolutions was\n\nthe Khmer Rouge revolution in Cambodia.\n\nThat's where the communist dictator Pol Pot seized power,\n\nand he unleashed a terrible reign of terror,\n\nreally going after anyone who had any kind of relation\n\nto the western imperialist world.\n\nThe Khmer Rouge killed maybe one in four people in Cambodia\n\nduring their short reign,\n\nbut other people point to the millions of people\n\nkilled by Stalin or Mao's famine.\n\nThere are a number of competitors for that title\n\nof worst revolution ever.\n\nStalin's Revolution strengthened the Soviet Union\n\nto withstand Germany's invasion and helped defeat Nazism.\n\nAnd Mao's horrible famines were followed\n\nby China becoming the world's second\n\nstrongest economic power.\n\nSo again, revolutions have to be assessed carefully,\n\nseparate the good and the bad.\n\nThat's probably up to the people of each country to decide\n\nhow they look at their own past.\n\n5PugNeto asks a challenging question,\n\nWhat is the oldest recorded revolution?\n\nWe have records from the end\n\nof the Old Kingdom in Ancient Pharaonic Egypt,\n\nthat seemed to say there was something like a revolution\n\nthat brought down the last Pharaoh of the middle kingdom.\n\nOrdinary people were dressing themselves up in finery.\n\nThe rich were reduced to wearing rags\n\nand there was disorder and a change in rule.\n\nIt does seem that the rule of the pharaohs was ended\n\nfor a while and replaced by some kind of council\n\nof new rulers, that goes back over 4,000 years.\n\nBut if you wanna ask what is the oldest revolution\n\nof which we have a clear unambiguous record,\n\nthat would be the founding of the Roman Republic in 509 BC.\n\nRome was ruled for most\n\nof the sixth century by a series of Tarquin kings.\n\nThe kings got more and more tyrannical,\n\nand in 509 there was an uprising.\n\nWe call it a revolution\n\nbecause the Romans didn't just put their own kings\n\nin the place of the foreign ruler,\n\nthey created an entirely new government.\n\nThe Roman Republic led by senators\n\nand tribunes of the people.\n\nThe first real republic in Europe remained the model\n\nfor city republics.\n\nNECESolarGuy asks,\n\nAre today's conditions in the US similar\n\nto any historic revolutions?\n\nYes, to a surprising degree.\n\nA lot of the MAGA followers claim\n\nthat they're having a revolution, that they're going\n\nto transform America's government.\n\nThey want to create an America in which the President\n\nis the all-powerful embodiment of the national will,\n\nand in which the government ceases\n\nto be this large protected organization.\n\nWe talk about checks and balances to prevent\n\nany single person from gaining excessive power.\n\nThe institutions that we've had have largely failed\n\nfor a lot of Americans.\n\nI'm quite sympathetic to that.\n\nIt turns out that if you look at the real wages\n\nof non-college educated men,\n\nthey've fallen over the last 40 years.\n\nAnd so it's understandable\n\nthat people feel they're being left behind.\n\nDuring the COVID crisis,\n\nit seemed like the government couldn't speak with one voice.\n\nA million people died.\n\nAnd so again, people felt, The government's\n\nnot protecting us.\n\nSo many people have just come to believe\n\nthat America's democracy is just serving a small,\n\ncorrupt elite and is not looking out\n\nfor ordinary American men and women.\n\nNow, that is exactly the belief that gives rise\n\nto revolutionary situations.\n\nSo it doesn't surprise me\n\nthat we're seeing people mobilize against the government\n\ncalling for it to be dismantled, calling for Democrats\n\nto be seen as enemies,\n\nor for Democrats to say that Republicans are trying\n\nto dismantle and overthrow the government.\n\nWe're not in a revolution yet.\n\nThat is to say, I don't think America's political\n\ninstitutions have been completely or permanently changed,\n\nbut we're very much in a revolutionary situation.\n\nA question from the Anarchy 101 subreddit,\n\nCan there be a revolution without violence?\n\nYes, there can.\n\nNonviolent revolutions have become much more common\n\nin the last quarter century.\n\nThey need to persuade military officers\n\nand soldiers that the revolutionaries are a more virtuous\n\ngroup representing the country, while the government\n\nthat they are sworn to defend is actually a threat\n\nto the country and is really in it for itself.\n\nThe key is persuading the military\n\nto support the revolution.\n\nSo yes, nonviolent protests can succeed.\n\nThat said, it's hard to have a purely nonviolent revolution,\n\nsimply because human nature is such\n\nthat once emotions get stirred,\n\nsome people are likely to turn to throwing bricks\n\nor even burning government buildings.\n\nAnd of course, if government troops fire on crowds,\n\nyou're going to have some deaths as well.\n\nWhat's really critical is whether\n\nthat violence overwhelms the peaceful protest.\n\nOften if the violence becomes dominant,\n\nthat discredits the revolutionaries\n\nand the military may feel more impelled\n\nto defend the government.\n\nSo it's a bit of a delicate balance,\n\nand one of the tasks\n\nthat nonviolent revolutions face is keeping\n\nto the nonviolent path.\n\nApeandorgoblin, Where do you think the next world historic\n\nrevolution will happen?\n\nI think Brazil, the reconstituted party there\n\nis doing really stupendous work.\n\nI don't think Brazil will be the next\n\nworld changing revolution for the same reason,\n\nthat the American Revolution wasn't world changing.\n\nThat is, Brazil is not centrally positioned right now\n\nin the world's global economy or politics.\n\nIf there's a world changing revolution,\n\nI think it's gonna come in China,\n\nwhich is the last great communist power.\n\nXi Jinping is leading a country that's running\n\ninto economic and demographic problems.\n\nThe economy is weakening, growth is slowing.\n\nPeople are hardly having children,\n\nand that means China's workforce is going\n\nto decline quite a lot in the next 20 or 30 years.\n\nSo the combination of an increasingly\n\nkind of autocratic one-man rule,\n\nand an economy that is faltering\n\nand where people don't have faith in the future,\n\nthat's a combination that has often led\n\nto revolutionary rebellion.\n\nSometime in the next 10 years, it's possible\n\nthat the Chinese people will ask for a more accountable,\n\na more democratic government.\n\nAnd if that happens,\n\nthat would have probably the greatest implications\n\nfor the world of any revolution\n\nsince the Chinese revolution in 1949.\n\nForum Mod asks, Did anyone else remember Che Guevara shirts\n\nbeing big in the mid 2000s?\n\nChe became a symbol of revolution in the fifties\n\nand sixties because at that time, Fidel Castro,\n\nwho had created a communist revolution in Cuba,\n\nwas promoting his revolution\n\nas doing wonderful and great things.\n\nAnd because there was no outside news to really counter\n\nthat view, he was able to kind of cultivate an image\n\nthat the Cuban Revolution had stood up against\n\nthe imperialist Yankees in America,\n\nhad gotten rid of poverty and prostitution,\n\nthat it had spread healthcare and education.\n\nSome of that was true, but the economy\n\ndidn't do well under Castro.\n\nIn fact, Cuba, which had been the most advanced economy\n\nin Latin America, started to fall behind.\n\nSo Che Guevara,\n\nwho had been one of Castro's leading lieutenants,\n\nand was a great proselytizer for the virtues\n\nof the Cuban Revolution, became the face\n\nof the Cuban Revolution, along with Fidel.\n\nT-shirts with Fidel and with Che became common\n\namong college students in the 1960s\n\nbecause they were saying, Hey, we also want freedom,\n\nand we think Che is a symbol of\n\nhow we fight against capitalism and imperialism.\n\nBlacksmith Most asks, Is the Haitian Revolution\n\nreally the first successful slave rebellion?\n\nWhat about the Mameluks in Egypt?\n\nWell, that question shows a good knowledge of history.\n\nThe Mameluks were slaves,\n\nbut slavery in the ancient world didn't mean the same thing\n\nas African American plantation slavery.\n\nIn the Ottoman Empire, slaves could be prime ministers,\n\nskilled engineers, provincial governors.\n\nWhat made them slaves is they remained totally the property\n\nand totally loyal to the Sultan.\n\nNow, the Mameluks were military slaves put in charge\n\nof the Egyptian province under the Sultan, and they rose up\n\nand created an independent Mameluks dynasty in Egypt.\n\nThe Haitian Revolution was the first modern slave rebellion\n\nin which African plantation slaves\n\nrose up against their masters.\n\nAnd it was a really incredibly influential event.\n\nPeople are starting to look at the Haitian Revolution\n\nand say, Along with the American\n\nand the French Revolution, all three\n\nof these were really big pivotal events in world history.\n\nThe Haitian Revolution helped spur\n\nthe abolitionist movement in Europe.\n\nIt showed that former slaves like Toussaint Louverture\n\ncould lead armies, could lead countries.\n\nAnd so the Haitian Revolution gave new dignity\n\nand new respect among slaves\n\nand kicked off the discussion across Europe about\n\nwhat should the relationship be between slavery\n\nand democratic government?\n\nYodhajiva poses this question,\n\nDo all revolutions need a figurehead?\n\nI have to say revolutions need a leader.\n\nThey need someone to inspire people\n\nto leave their ordinary day-to-day lives\n\nand join protests, to take risks opposing a government.\n\nSometimes the leader can just be a quiet\n\nand powerful figure.\n\nGeorge Washington was known for his humble leadership,\n\nhis virtue, and his efforts to be a leader\n\nthat everyone could follow.\n\nIn other cases, you have revolutionary leaders like Mao\n\nwho try and inspire divisions.\n\nSo there are a number of different ways\n\nto lead a revolution,\n\nbut you don't get very far without leaders\n\nwho can galvanize people, maintain mobilization,\n\nand then build a new government.\n\nBoth Rops asked,\n\nWhy is the French Revolution considered the main catalyst\n\nfor global democracy and not the American Revolution?\n\nAmericans always like to say it was our revolution\n\nthat started global democracy, but the French like to say,\n\nBut our revolution transformed all of Europe.\n\nThe American Revolution started with a list\n\nof grievances against the British King George III\n\nand blamed him for being a tyrant.\n\nStill, the American revolutionaries were very aware\n\nthat by getting rid of a monarchy\n\nand its viceroys, they were embarked on a new path.\n\nThey were creating citizen government\n\nin which all the rulers would not have legal privileges,\n\nall citizens were equal before the law\n\nand where even the highest officials were accountable\n\nto elections by the people, and that was something new.\n\nSo the Americans knew they were doing something different.\n\nBut let's face it, in 1776,\n\nAmerica was a relatively small group\n\nof colonies on the far edge of European civilization.\n\nNow, France, that was the big power in Europe.\n\nCulturally, politically, militarily,\n\nFrench language was spoken all the way from Paris to Moscow.\n\nAnd when France had a revolution and the king\n\nand queen of France were paraded to the guillotine,\n\nthat couldn't be ignored in Europe, everyone had to sit up\n\nand say, Wow, even the greatest sun monarchy in Europe\n\ncan be overthrown and replaced by a citizen republic.\n\nCertainly it had its roots\n\nand influence in the American Revolution,\n\nbut you have to say the French Revolution\n\nhad a much bigger impact all across Europe\n\nthan the America's colonial war for independence.\n\nA Quora user is asking,\n\nWhy aren't Venezuelans revolting right now?\n\nThey have no food, electricity, water.\n\nPeople have started revolutions for less.\n\nWell, it's certainly true that people have started\n\nrevolutions for less.\n\nIn fact, one of the paradoxes of revolutions\n\nis that in many cases,\n\nrevolutions start when things are getting better\n\nrather than when they are at their worst.\n\nIn order to overthrow a government,\n\npeople have to come together, they have to organize.\n\nElites have to turn against the regime.\n\nWhen people are really desperate\n\nand impoverished, it's hard to sustain a protest.\n\nFor most of the people in Venezuela, survival has become\n\nso difficult that they are simply leaving in droves.\n\nMillions of Venezuelans have fled to Columbia,\n\nor have sought to enter the United States.\n\nAnd for its part,\n\nthe government in Venezuela is all too aware\n\nthat it is hated by the people.\n\nSo what the government has done\n\nin order to assure the loyalty\n\nof the military is it has engaged the military in narcotics\n\ntrafficking and other illegal activities.\n\nThis essentially forces the military\n\nto remain loyal to the government.\n\nNow, it's still possible that the bulk\n\nof ordinary soldiers might refuse to follow orders.\n\nThey might engage in protests joining the population.\n\nThat's how revolutions have often started in the past.\n\nBut at the moment, the military leadership is all too aware\n\nthat they need to keep their troops loyal.\n\nSo they are trying to give privileges\n\nto Venezuelan soldiers, helping them share in the fruits\n\nof these illegal activities,\n\nand that way protect their loyalty.\n\nNow, the question may come up, is there a breaking point?\n\nCan Venezuela become so impoverished\n\nthat the government can no longer support itself?\n\nI do think at some point in the future\n\nwe'll see ordinary soldiers joining popular protests\n\nand the Maduro dictatorship may come to an end.\n\nIndependent Fact 082,\n\nHey, no taxation without representation,\n\nbut what representation did the colonists want?\n\nThe colonists wanted the same rights as other Englishmen.\n\nEvery borough and province in England had some claim\n\nto be represented in the British Parliament,\n\nand no taxes could be levied throughout Britain\n\nwithout the consent of parliament.\n\nBut the British colonists in America didn't have that.\n\nThey had no representation in the British Parliament,\n\nand so the British monarchy felt they could levy whatever\n\ntaxes they wished, the colonists had no say.\n\nAnd so the colonists said, Hey, we want\n\nto have representation, we want our people to be able\n\nto vote just like other British citizens.\n\nAnd when King George said, No, no, you guys are far away,\n\nyou're colonists, we know what's better for you,\n\nthat started the colonies down the road toward revolution.\n\nThey didn't want to go there, but they really felt\n\nthat eventually Britain gave them no choice.\n\nThey said, We're being treated not like free people\n\nwho can control their own destiny,\n\nbut just like subjects of an empire.\n\nAnd that's why the rhetoric of the American Revolution\n\nstarted to become, give me liberty or give me death.\n\nSo that's the representation story,\n\nand that's why people in the US value their representation\n\nso very much to this day.\n\nJcdicksonCAN asks, Did the glorious revolution\n\nkickstart England's imperial age?\n\nIf so, why?\n\nEngland had one of the great empires in world history.\n\nAs they said, The sun never sets on the British empire.\n\nWhere did that all begin?\n\nIn 1640, England had a Puritan revolution.\n\nThe king was tried for treason, beheaded,\n\nand a commonwealth government under Oliver Cromwell took\n\npower and in a series of wars, defeated the Dutch\n\nand made Britain the leading power on the high seas.\n\nCromwell also took out his anger on Ireland.\n\nNot only did he defeat rebellions in Ireland,\n\nhe invited Scottish settlers to come\n\nand settle the Emerald Island.\n\nSo we have Cromwell to blame for the conflict\n\nbetween Protestant settlers and native Irish Catholics\n\nthat has created problems to this day.\n\nIn my view, that's really the beginning\n\nof Britain's imperial future.\n\nThe glorious revolution, which occurred in 1688,\n\nwas another episode in which the British rose up against\n\ntheir king because he was Catholic, James II,\n\nand they invited William, the leader of the Netherlands\n\nwho was a Protestant, to come\n\nand become the new king of England.\n\nThe Glorious Revolution was called glorious\n\nbecause the British felt\n\nthat they weren't really changing that much,\n\nthey were just setting things straight.\n\nAnd so inviting William and Mary to come and become king\n\nand queen of England, British saw that\n\nas a glorious restoration\n\nof the proper Protestant balance in their country.\n\nWhere did Britain's global imperial reign really start?\n\nI think we have to go back to Cromwell\n\nand the conquest of Ireland,\n\nand see that's the beginning of Britain\n\nas an imperial power.\n\nHarrison Joodeit says,\n\nWas January 6th an attempted revolution?\n\nIn some ways, I kind of see January 6th\n\nas being like the storming\n\nof the Bastille in the French Revolution.\n\nIn 1789, citizens in Paris were worried\n\nthat the government was going to let them down.\n\nSo the people of Paris organized themselves\n\nand said, We're gonna send a message.\n\nWe're going to storm this citadel,\n\nthe armory at the Bastille.\n\nAnd they stormed it, managed to knock down the doors\n\nand kill the people who were inside.\n\nNow, the people who protested on January 6th,\n\nthey shouted, Hang Mike Pence.\n\nWould they have actually done it if they had found him?\n\nWe don't know, but they were certainly shouting their intent\n\nto execute their enemies.\n\nIn many ways, January 6th, yes, it was kind\n\nof a revolutionary insurrection.\n\nBy itself that doesn't constitute a revolution.\n\nBut could it someday be seen as the opening stages\n\nor the opening blow of change in America's government?\n\nThat could certainly be.\n\nItzmy, poses this question,\n\nTo what extent did the cultural revolution\n\ndestroy Chinese culture?\n\nChina was really committed under Mao\n\nto really drive out any older or foreign influences.\n\nAnd so for a decade or more,\n\nChina's so-called futile past,\n\nthe Confucian and Buddhist eras were condemned,\n\nand communism was supposed to start a new day.\n\nMao tried to destroy all kinds of foreign elements,\n\nnot only the classical Chinese past,\n\nbut also elements of Western culture.\n\nDuring the cultural revolution,\n\nprofessors were beaten if they taught\n\nmodern Western physics or classical music.\n\nStudents were encouraged to attack their teachers,\n\nworkers to attack their managers.\n\nBut the result of all that was chaos.\n\nThe army eventually had to step in and stop it.\n\nSo even though Mao tried to create his ideal fantasy\n\nof a permanent revolution, it just didn't work in practice.\n\nWhat China went back to,\n\nespecially under Deng Xiaoping, was the business\n\nof making things, building an economy,\n\nand going back to traditional Chinese beliefs.\n\nBeliefs in a moral government, Confucian ideal\n\nof the importance of family,\n\nthose things were very deeply rooted in China,\n\nand Mao was not able to destroy them.\n\nAmericaPapaBear asks,\n\nSo was the Iranian revolution a product\n\nof the West invasion?\n\nThe West didn't really invade Iran.\n\nIt is true that in the 1950s, the CIA\n\nhelped overthrow the government\n\nof the Iranian Prime Minister Mosaddegh\n\nand install Reza Pahlavi as the Shah of Iran.\n\nThat CIA action did in the long run help contribute\n\nto the Iranian-Islamic revolution.\n\nNow, it did so because Mosaddegh was fairly popular,\n\nand he was standing up for Iran's right\n\nto control its oil revenues,\n\nwhich were being increasingly taken\n\nby American and British companies.\n\nBut of course, the Americans wanted to continue\n\nto benefit from that.\n\nSo they saw Mosaddegh and his nationalism as a threat,\n\nand they worked to undermine him\n\nand bring in the new Shah, the son of the previous ruler.\n\nHe ruled as a kind of pro-Western secular leader.\n\nHe managed to alienate almost everyone else in Iran.\n\nHe made enemies out of the Shia clergy.\n\nHe attacked the traditional merchants of the bazaar.\n\nHe fought with the unions of oil workers\n\nwho demanded higher wages.\n\nAnd he kind of neglected the large numbers of peasants\n\nthat were moving from the Iranian countryside to the cities\n\nwhere they were increasingly recruited\n\nand socialized by the mosques and religious leaders.\n\nNow, the Shah remained in control through most\n\nof the sixties and seventies,\n\nbut by the late seventies, he was growing ill.\n\nHe'd become a bit more arbitrary,\n\nhis children were acting more corruptly,\n\nand many people in Iran started to see the Shah\n\nas a source of more problems than benefits.\n\nThey saw him as responsible for really terrible inflation,\n\nfor excluding the professional middle class\n\nfrom the government and treating them more\n\nas subjects than as citizens.\n\nSo as the Shah became more\n\nand more out of touch with his own society,\n\nthe Ayatollahs were able to recruit more\n\nand more people into protesting, and they saw the Shah\n\nand his connections to the West as the enemy.\n\nSo I don't think you'd say the Iranian revolution\n\nas a result of Western invasion,\n\nbut certainly it was targeting Western influence,\n\nWestern meddling, corruption that was tolerated by the West.\n\nAnd all of those elements helped mobilize people\n\nand bring about the revolution.\n\nCollective1985 wants to know,\n\nWhat were the bloodiest revolutions in the history\n\nof mankind that everybody seemed to forget about?\n\nWell, most revolutions are pretty famous,\n\nbut there actually is one that's surprisingly unknown.\n\nThat's the Taiping rebellion\n\nthat took place in China from 1850 to 1864.\n\nThat uprising was led by a kind of delusional young man\n\nwho started reading the Christian Bible,\n\nand having dreams in which Jesus spoke to him\n\nand told him that he was destined\n\nto lead China into a new world in which men\n\nand women would be equal.\n\nNow you'd say, Wow, that's strange.\n\nHow could such a person lead a revolution\n\nin such a different culture as China?\n\nWell, by the middle of the 19th century, a lot\n\nof Chinese felt that the old imperial system\n\nhad become rickety and rotten.\n\nEventually, hundreds\n\nof millions across China joined the Taiping banner,\n\nand in the civil wars that ensued,\n\n20 or 30 million people were killed.\n\nIt was actually the bloodiest revolution of all time.\n\nAnd yet it's kind of unknown, because in the years\n\nthat followed, the Chinese Empire restored order.\n\nAnd so the revolution that we remember in China,\n\nthat's the communist revolution\n\nthat gave us the China we have today.\n\nGRadioRockstar asks, How did the Arab spring start again?\n\nWell, the Arab Spring, the series\n\nof rebellions in the major Arab countries of North Africa\n\nand the Middle East started in Tunisia,\n\nwhere the dictatorship\n\nof Ben Ali had become increasingly corrupt.\n\nOne fruit vendor was constantly shut down by the police.\n\nIn despair, he set himself on fire.\n\nHis action was caught on camera,\n\nand then seen all across Tunisia and the Middle East.\n\nAnd that act of despair and protest resonated with millions\n\nof people who were struggling.\n\nProtests started in Tunisia.\n\nThey spread from the countryside to the capital of Tunis.\n\nBen Ali fled, and thus the Tunisian\n\npeaceful popular revolution took over.\n\nNow, when that happened, a lot of people said, Oh, well,\n\nTunisia's unusual, you know, it's a small state.\n\nIt has an unusually large Westernized\n\nprofessional population.\n\nPeople in Egypt said, If Tunisia can do that,\n\nwhy can't we?\n\nAnd so a small protest that was planned\n\nfor police stay turned into\n\nan unexpectedly large citywide protest\n\nas tens and tens of thousands\n\nof people joined the protestors.\n\nThe government tried to suppress them, of course,\n\nand it was, you know, back and forth.\n\nBut then the Muslim Brotherhood,\n\na large underground protest organization,\n\nthey decided, Hey, this is our opportunity.\n\nWe should join the protestors.\n\nAnd at that point, everything came down to the military.\n\nWas Egypt's army, which was very large,\n\nvery professional, very effective,\n\nwere they going to be employed\n\nto put down the protests in the capital city of Cairo?\n\nWell, certainly the government ordered them to do so,\n\nbut they were reluctant.\n\nAnd so the Army felt, We have a special role to play here.\n\nAnd, you know, we're not crazy with\n\nhow Hosni Mubarak is running Egypt.\n\nSo the military stood aside.\n\nThey enabled the protests to go on, even at some point,\n\ndefending the protestors into rear square.\n\nEventually, Hosni Mubarak resigned,\n\nand so the Egyptian Revolution was also successful.\n\nUnfortunately, not everything went smoothly.\n\nIn Libya, the revolution devolved into civil war.\n\nSame thing happened in Yemen and Syria.\n\nThe Arab Spring began with a kind of common foundation\n\nof long lived, increasingly corrupt\n\nand distant rulers, populations\n\nwho were angry about unemployment,\n\nabout a lagging standard of living.\n\nAnd once protest was seen to be an effective way\n\nto create change, it spread from one country to the next.\n\nThis is everything for today, I hope you learned something.\n\nThis is Revolution Support.",
  "authors": [
    "Condé Nast"
  ],
  "url": "https://www.wired.com/video/watch/tech-support-political-scientist-answers-revolution-questions"
}