{
  "title": "Why some animals can eat poison and cheat death",
  "text": "Dobler suspects that proteins called ABCB transporters are involved: These sit in cell membranes and shunt waste and other unwanted products out of cells. She has found that certain hawk moths use ABCB transporter proteins situated around their nerve tissues to shuttle cardiac glycosides out of cells. Maybe the milkweed bug is doing something similar.\n\nDobler is also testing a hypothesis that many insects have ABCB transporters in the membranes of their guts, stopping toxic substances from getting into the body to begin with. That could explain how the bright red onion beetle, which feeds on glycoside-rich lily of the valley, is seemingly unfazed by the toxins and merely excretes them. The resulting faeces have the benefit of repelling predatory ants, Dobler reported in 2023.\n\nFor the royal ground snakes, the liver seems to be key. From cell culture experiments, Tarvin's team has evidence that something in snake liver extract protects against toxins of three-striped poison dart frogs. The team hypothesises that the snakes have enzymes that convert the deadly substances into nontoxic forms, much as human bodies do with alcohol and nicotine. Snake liver may also contain proteins that stick to toxins and render them unable to bind to their targets – mopping them up like sponges. Scientists have discovered such \"toxin sponge\" proteins in the blood of some poison frogs, enabling them to resist the deadly saxitoxin and alkaloid toxins they get from their diet.\n\nGetty Images The California ground squirrel has evolved an array of countermeasures to rattlesnake venom (Credit: Getty Images)\n\nCalifornia ground squirrels seem to use a similar trick to defend themselves against rattlesnake venom, a cocktail of dozens of toxins that destroy blood vessel walls, prevent blood from clotting and more. Ground squirrel blood contains proteins that block some of these toxins – like the proteins rattlesnakes use themselves for protection should venom escape their specialised venom glands. The composition of venom differs across snake populations, and evolutionary biologist Matthew Holding of the University of Michigan has evidence that the ground squirrels' antivenom mix is tailored to match local snakes.",
  "authors": [],
  "url": "https://www.bbc.com/future/article/20251117-the-animals-that-can-eat-poisons-and-not-die"
}