{
  "title": "This Trans Vietnamese Pop Star Is Competing At Miss Universe — A Middle Finger To Its Onetime Owner: Trump",
  "text": "Beauty pageants have always been a strange mirror of power. They’re one of the last strongholds of the cis-heteropatriarchy, stages where womanhood is defined, objectified, controlled and commodified. So it feels more than a little poetic that the Miss Universe stage once owned by Donald Trump, architect of so much anti-trans cruelty, is now home to trans royalty.\n\nVietnam’s contestant, Nguyễn Hương Giang, who is already a celebrity singer and reality TV star across Asia, will be the first trans woman from Asia to compete.\n\nThat’s right. The 2025 Miss Universe pageant, scheduled for Nov. 25, is now leading the pack in the fight for transgender representation around the globe. And while that might be an exaggeration fueled by my own excitement, it’s pretty cool that the most mainstream of mainstream pageantry seems nonplussed about trans inclusion.\n\nAdvertisement\n\nMiss Universe Vietnam doesn’t even mention the fact that Nguyễn is trans.\n\n“In every role, [Nguyễn] shines with a strong inner strength, creativity and pride, true to the image of a modern and strong Vietnamese woman,” they wrote on their official Instagram announcement (translated from Vietnamese). In the post, Nguyễn is characterized as a national treasure rather than a diversity hire.\n\nThere’s none of the half-hearted virtue signaling that, for me, characterizes how American organizations frame their “inclusivity,” like the NFL’s 2021 “Football is for everyone” campaign, which feels more like an attempt to sell T-shirts than actual allyship. Or Bud Light’s flaccid support of trans activist and influencer Dylan Mulvaney, who they chose as a spokesperson but refused to fight for when shit hit the fan.\n\nThe irony here is almost biblical. Trump spent years turning femininity into a weapon and women into brands, yet the empire he built to crown cis perfection now champions trans beauty and power. They make the spectacle subversive, using its own language of beauty and poise to expose how flimsy those definitions are.\n\nAdvertisement\n\nNguyễn will actually be the fourth transgender contestant in the Miss Universe franchise. Back in 2012, Jenna Talackova, a Canadian trans woman, successfully challenged the pageant after initially being disqualified. In 2018, Ángela Ponce from Spain competed as well, and more recently in 2023, Rikkie Kollé from the Netherlands made big queer waves in the competition.\n\nWeirdly, one of Talackova’s supporters back in the day was Donnie T. himself.\n\n“Jenna Talackova is free to compete in the 2012 Miss Universe Canada pageant,” said Michael Cohen, special counsel to Trump and executive vice president of his business group, to Reuters in 2012. He added that Talackova, “like all the other contestants, is wished the best of luck by Mr. Trump.”\n\nYeah, so the man who once rallied for trans rights now backs the idea of “making Miss Universe female again,” per The Heritage Foundation. Sure hope no one notices this massive contradiction.\n\nAdvertisement\n\nAt a time when the United States is discussing trans people as terrorists, our inclusion on the world stage matters. Not to prove we aren’t terrorists, or to reassure anyone that we’re beautiful — no thinking person needs that — but to remind us that the world is big, and that somewhere in it, we are crowned for our brilliance.\n\nPageants have always been a distorted misogynist measurement of women’s value and, other than doing away with them altogether, the only other option is recalibrating our ideas about feminine worth. This is a step in the right direction. In my heart, Nguyễn Hương Giang has already won.",
  "authors": [
    "Contributing Writer"
  ],
  "url": "https://www.huffpost.com/entry/nguyen-huong-giang-miss-universe-trans_n_68e69142e4b0d98d3e531c23"
}