{
  "title": "Spend limits and ‘anchoring’: how one meeting could reshape Premier League financial rules",
  "text": "What is happening on Friday?\n\nExecutives of the 20 Premier League clubs are meeting in London to discuss, and potentially decide on, new financial regulations that will determine the future direction of the competition. These measures have been under consideration in some form or another since October 2021, just as the game was emerging from the crisis of Covid.\n\nWhat are the new regulations?\n\nThree proposals are to be put in front of the league’s shareholders. The most straightforward looks to assess a club’s financial sustainability, adding tests that examine short-, medium- and long-term projections of a club’s finances and ensure clubs have sufficient resources to ensure any needs are met. These are similar to requirements soon to be asked of clubs by the new football regulator.\n\nSecond, there is the proposed squad-cost ratio (SCR) rule, which would replace the profitability and sustainability rules (PSR) of financial controls and limit clubs to spending no more than 85% of annual revenue on “football costs”, understood to take in everything from player wages to transfer fees and the cost of coaching staff. This measure is similar to Uefa’s for its competitions, where clubs must spend no more than 70% of revenues on football costs. Uefa’s rule applies to the nine English clubs competing in Europe this season.\n\nFinally, and most controversially, is the proposal to introduce what is called top-to-bottom anchoring (TBA). This would prevent any club from spending more than five times the money earned the previous season by the league’s last-placed side in central payments passed on by the league. That is the collective term for prize money, fees for appearing on TV and a commercial payment. In 2024-25, £109.2m went to the bottom club, Southampton. This would put a putative cap on football costs for any club at £550m (in one season).\n\nView image in fullscreen Richard Masters, chief executive of the Premier League, with the Premier League trophy. Photograph: Jon Super/AP\n\nWhy is TBA controversial?\n\nIn a one-two punch of public criticism in the past 10 days, first the players’ union then an alliance of some of the biggest player agencies have taken aim at TBA. For the Professional Footballers’ Association the argument goes that any cap on spending, however high, could affect their members’ wages, a process described by its chief executive, Maheta Molango, as “a clear restriction of trade”. The agencies CAA Stellar, CAA Base and Wasserman argued in a letter to the Premier League’s lawyers threatening possible action that TBA would be in contravention of section two of the UK’s Competition Act.\n\nThe complaints from the PFA and player agencies share the belief that there has been insufficient consultation over the anchoring proposals, something the Premier League disputes. But it appears the prospect of a hard limit on spending, as opposed to the relative cap imposed by SCR, has provoked the greatest concern.\n\nSixteen clubs are participating in a shadow trial run of TBA this season, with no penalties for a breach, after Manchester City, Manchester United and Aston Villa voted against (and Chelsea abstained). One of the arguments among clubs opposed to TBA is that it could stymie the biggest English clubs in their attempts to compete with European – and also Saudi Arabian – teams in transfer fees and the wages they could offer to the world’s best players. It is understood, however, that other clubs have come to think critically of TBA from the opposite perspective, a concern that anchoring in the Premier League could lead to the EFL adopting similar measures which could hamper the attempt of relegated clubs to return to the top flight. The EFL has been trialling a form of SCR in shadow in the Championship this season but not anchoring.\n\nskip past newsletter promotion Sign up to Football Daily Free daily newsletter Kick off your evenings with the Guardian's take on the world of football Enter your email address Sign up Privacy Notice: Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on theguardian.com to send you this newsletter. You can complete full registration at any time. For more information about how we use your data see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nWhat is the argument for anchoring?\n\nThe Premier League believe financial reform, and TBA specifically, is a necessary measure to preserve competitive balance in the future, with particular concern over the possible effect of revenues generated from international competitions. “It is [our] objective to maintain the Premier League’s value, competitive balance and ensure clubs operate in a financially sustainable way,” a spokesperson said last week.\n\nFor Christina Philippou, an associate professor in accounting and sport finance at Portsmouth University, TBA is a measure that, in the long term, could help preserve the Premier League’s dominance of broadcast rights. “Part of the reason why the Premier League is head and shoulders above the rest of the European leagues is because traditionally there has been more competitive balance,” she says. “If you end up with certain teams inevitably winning the Premier League every year, for the rest of time, then that becomes less exciting. As soon as that happens you get fewer people watching both online and in person, which in turn has a huge financial impact. Not just money from people watching but it decreases broadcast income, it decreases sponsorship income, it has a knock-on effect on all the finances. If you want long-term health, you want competitive balance, because otherwise people tune out.”\n\nWill the vote for anchoring pass?\n\nThat’s the question being asked. There has been no rush among clubs to update financial regulations, with discussions having gone on for more than four years. It had been hoped a vote would be taken on the measures at the most recent shareholders’ meeting, only for clubs to step back. Some clubs remain happy with PSR and would rather not change. League executives, however, are making noises that suggest they are determined to push forward and have notified clubs that a vote will be taken on Friday. The cost of losing would be damaging for the leadership and the chief executive, Richard Masters, particularly against the roiling backdrop of the pursuit of 134 charges of rule-breaking made against Manchester City. Win the vote, however, and the prospect of more expensive legal action looms into view.",
  "authors": [
    "Paul Macinnes"
  ],
  "url": "https://www.theguardian.com/football/2025/nov/20/spend-limits-anchoring-meeting-reshape-premier-league-financial-rules"
}