{
  "title": "超级富豪钟爱的纽约超高塔楼成“危楼”，谁之过？",
  "text": "收件人中包括WSP的结构工程师西尔维安·马库斯。这位曾参与打造曼哈顿下城弗兰克·盖里作品“云杉街8号”波浪形外立面的专家，此时正作为项目团队成员为公园大道432号大厦提供咨询。\n\n马库斯建议在混凝土中添加粉煤灰——这种燃煤副产品常用于提升混凝土的耐久性。\n\n“他们不会接受粉煤灰（颜色会过深），”时任WSP高级工程师的赫齐·梅纳在2012年12月的邮件中回复道。\n\n马库斯回信说，只有两个选择：“是要颜色，还是要裂缝。”\n\n位于中城的工地即将动工，时间已经所剩无几。马库斯在邮件中强调，团队此时不该还在试验配比。\n\n为追求所谓“绝对纯粹”的建筑理念，纽约知名开发商哈里·麦克洛拆除了原址上的豪华酒店——德雷克酒店，委托乌拉圭现代主义建筑大师拉斐尔·维诺里为地块设计了完全由直线构成的塔楼。 Todd Heisler/The New York Times\n\n“在确定有效配比前暂停浇筑，”马库斯在给梅纳和开发商的邮件里说。“否则未来将面临难以解决的严重问题和重大工期延误。”\n\n开发商后续聘请的多位顾问得出类似结论：混凝土的裂缝问题只会加剧，而持久的修复将代价高昂。\n\n顾问们建议采用弹性涂层，这是一种厚实、富有弹性的橡胶状膜层，可以封住裂缝，防止空气和水渗入外墙。但这种涂层会使建筑表面产生光泽，与开发商追求的视觉效果不符。\n\n开发商最终没有采纳顾问们关于使用橡胶状涂层的建议，而是采用了另一种方案——给整栋建筑喷涂透明的渗透型密封剂，并对最严重的裂缝进行局部修补。\n\n尽管采取了这些措施，两年后的2015年10月，当工程进入最后冲刺阶段时，混凝土外立面的问题依然存在。\n\n在2015年10月的一封邮件中，时任项目承建商兰德利斯高级项目经理的查尔斯·莱尔克斯对外墙发现的“孔隙”表示严重关切，要求必须“立即开展”修复工作。\n\n不到四个月后，纽约市建筑局的检查员安排了现场检查，并专门询问了有关裂缝的情况。\n\n“不存在结构安全问题，这些都是预期会出现的发丝裂缝，”莱尔克斯在2016年1月致一名建筑监理的邮件中写道。“完全在预料之中。”\n\n饱受压力的摩天楼\n\n公园大道432号大厦落成后，迅速成为了各路名流、国际商界领袖以及地产大亨的聚集地——这些买家大多通过隐秘的空壳公司完成购房交易。然而入住伊始，投诉便接踵而至。\n\n据私人邮件和法庭文件显示，夜晚的吱呀声让一些住户难以入睡，爆裂的水管造成了数百万美元的损失。故障频发的电梯曾将一位管委会成员的儿子困在电梯里近90分钟。\n\n2019年感恩节前一周，一起电气事故导致整栋楼停电。有一户公寓的晃动严重到不得不聘请工程公司前来处理的程度。\n\n开发商的代表表示，这些投诉被夸大了，指责背后有依靠管委会与开发商诉讼牟利的工程法律行业推波助澜。他们称，许多施工问题已经得到解决，并反指管委会未能履行部分外立面的维护和保养责任。\n\n2014年施工期间，从公园大道432号大厦76层俯瞰的景色。 Ruth Fremson/The New York Times\n\n但一些工程专家认为，诸多不便实为建筑设计问题的征兆。\n\n外立面裂缝会增加水分渗透至建筑结构的风险，这可能导致内部钢筋生锈并膨胀，进而引发更多裂缝。\n\n这种恶性循环会影响专家所称的建筑刚度，即抵抗风荷载的结构性能。专家指出，持续开裂可能加剧机械系统已有的问题，使建筑变得越来越脆弱。\n\n工程专家指出，如果这种应力循环持续下去，将引发严重后果。\n\n“混凝土块会脱落，窗户会开始松动，”结构工程师邦吉诺说道，这与《纽约时报》咨询的其他独立工程师的观点一致。“你无法乘坐电梯，机械系统开始失灵，管道接头会断裂，到处都会出现漏水。”\n\n“整栋建筑最终将变得无法居住，”他说，并指出这座塔楼至今尚未经历过持续性的飓风级风力考验。\n\n这栋摩天楼几年前就已经引起纽约市建筑局的注意。\n\n纽约市要求所有六层以上的约1.7万栋建筑的外立面每五年必须接受一次检查。\n\n纽约市建筑局发言人安德鲁·鲁丹斯基表示，该部门尚未发现任何安全隐患的证据。他说，建筑局外立面检查部门的检查员上次到这座大楼现场是在2023年2月。\n\n“目前没有任何相关方向建筑局提交能证明该建筑存在结构稳定性或生命安全隐患的新证据，”鲁丹斯基称。\n\n未参与相关诉讼的结构工程师邦吉诺指出，不断恶化的裂缝可能会增加行人面临的风险：“没有哪种人行道雨棚能抵挡从426米的高空坠落的混凝土块。”\n\n根据《纽约时报》获得的法院文件和电子邮件，公园大道432号的住户们对于修复方案存在分歧。\n\n在这座城市为了争夺“最高豪宅”的称号而重塑天际线十多年之后，公园大道432号大厦或许象征着新型摩天大楼技术的极限。 Vincent Alban/The New York Times\n\n最新修复方案包括填补裂缝、加固承重柱、加装防潮覆层系统，并在外墙涂覆弹性体涂层——也就是开发商最初拒绝采用的修复方案。\n\n据管委会聘请的顾问撰写的报告，外立面修复工程将持续三年，耗资逾1.6亿美元。\n\n大楼的物业管理方拒绝发表评论。在9月12日发给住户的一封信中，CIM公司表示，这份估算“完全脱离现实”。\n\n开发商指责管委会未能在大楼外立面重新涂覆保护性密封剂。但代表管委会参与两起诉讼的律师特伦斯·奥维德指出，这种修补根本无济于事。\n\n他说，住户们致力于确保他们的家是一处“世界级的住宅物业”。\n\n自上一个十年共管公寓热潮的高峰以来，超豪华房地产市场已经明显降温，而建筑问题的污名可能进一步损害住户的转售潜力。\n\n部分业主认为施工问题被夸大了，他们在法律费用上花得太多。还有一些业主质疑大楼管理水平。引发普遍不满的焦点之一是，业主专属餐厅的530万美元翻修工程被要求由业主共同承担。\n\n住户们就各类问题的根源相互指责：包括公摊费用的激增、员工破坏设施设备的指控，以及房地产投资人兼管委会成员杰奎琳·芬克尔斯坦-勒博那块13.5万美元地毯遭水渍损坏的原因——究竟该归咎于建筑问题，还是她安装在64楼公寓的地暖系统？\n\n大楼管理方拒绝置评。\n\n香港房地产投资人、前媒体高管王征表示，2019年他被公园大道432号的优雅设计深深吸引，以1500万美元购入了一套三居室公寓。\n\n但现在浴室门无法正常闭合，客卧空调失灵，泳池则经常关闭。\n\n王先生质疑管委会将资金用于针对白色混凝土外墙的诉讼，而他更关切的是管理失当问题，包括每月物业费暴涨两倍。\n\n他认为最严重的问题远未结束。\n\n“楼越高，”他叹息道，“投下的阴影便越长。”",
  "authors": [
    "Dionne Searcey Stefanos Chen Urvashi Uberoy"
  ],
  "url": "https://cn.nytimes.com/usa/20251030/432-park-avenue-condo-tower/"
}