{
  "title": "Trump’s Deployments Are Part of a Long History Of Silencing Us",
  "text": "In light of the ongoing ICE raids in Los Angeles, messages of community exhaustion and political grievance echo across the nation, particularly from Black and brown people. Some media organizations describe the city as lawless and violent. I believe the city is tired.\n\nThe protests against the raids began on Friday, June 6, in response to multiple U.S. Immigration and Customs Enforcement (ICE) raids across L.A., where I live. Specifically, ICE agents reportedly targeted day laborers within the city’s Fashion District, arresting over 40 immigrants at places like Home Depot and Ambiance Apparel.\n\nThe next day, Trump deployed 2,000 members of the National Guard to L.A. in an attempt to “liberate” the city despite opposition from Gov. Gavin Newsom and Mayor Karen Bass.\n\nAdvertisement\n\nFollowing what many believe was an unprecedented and unnecessary military response, Angelenos further clashed with troops, resulting in the utilization of tear gas, rubber bullets and flash-bang grenades against civilians and even journalists covering the protests. On Tuesday, June 10, Trump, yet again, mobilized 700 Marines to L.A. to fan the fire of social upheaval.\n\nTension leading up to the protests has risen due to reported incidents of ICE visiting “sensitive locations,” following Trump’s reversal of a Biden-era policy that prohibited agents from entering into schools, places of worship and health care facilities in January.\n\nLater in June, the Trump administration sought to eliminate birthright citizenship, but efforts were blocked in federal court. Now, the case has reached the Supreme Court as migrants nationwide are forced into a callous game of cat and mouse. Meanwhile, more protests continued across L.A., a notable sanctuary city with one of the largest immigrant populations in the U.S.\n\nAdvertisement\n\nDespite conservative media’s hyperfixation on extreme cases of civil unrest, this summer’s protests were mostly described as peaceful by participants and onlookers. But we all know that when communities of color — especially Black and brown organizers — are involved, protests are perceived as violent, aggressive and reckless. The infrequent acts of violence tend to overshadow the fundamental purpose of the demonstration. Throughout June, over 400 arrests have been made in L.A., as well as the “temporary detainment” of several protesters.\n\nFast forward to last Monday, Aug. 11, when Trump announced his plan to deploy 800 National Guard troops and Metropolitan police to Washington, D.C., to combat “criminal activity.” Ironically, the Department of Justice reported that D.C. crime is at a 30-year low earlier this year.\n\nTrump has insinuated that the cities of Los Angeles, Baltimore, Oakland, New York and Chicago could meet the same fate. These cities also just so happen to have Black mayors and a largely Democratic base.\n\nAdvertisement\n\nAs residents of D.C. reel from the influx of armed officers, I can’t help but wonder: Where was the National Guard deployment on Jan. 6, 2021, when a (mostly white) mob of Trumpers engaged in actual violence in and outside the Capitol?\n\nThis, of course, is unsurprising given the long history of racially biased policing — and it’s important to keep this reality at the forefront of conversation around protesting.\n\nHistory has shown us that a heightened police presence is more often displayed at protests for racial justice. During the 2020 George Floyd protests. Civilians exercising their First Amendment right to protest police brutality were met with physical force, mass arrests and chemical weaponry. That summer, police were 1.4 times more likely to make arrests at racial justice protests and 3.8 times more likely to use chemical weapons against protestors compared to other types of demonstrations, according to the Thurgood Marshall Institute.\n\nAdvertisement\n\nThe over-policing of Black and immigrant protesters has been prevalent and violent for ages. According to the 1967 Kerner Commission report, President Lyndon B. Johnson’s findings revealed how aggressive enforcement in BIPOC communities contributed to escalated tensions and civil distrust, citing the adverse outcome of the 1967 Long, Hot Summer riots. Additionally, many experts believe that over-policing has been, overall, counterproductive.\n\nAs the Trump administration exercises its ability to send troops to cities that oppose it, it raises the question of whether it has intentionally used that history of bias to test-run its power grab first against the communities of color who already feel the most pressure from state violence.\n\nStill, we resist. Yesterday concluded a three-day bench trial to decide whether Trump’s federalization of thousands of California’s National Guard in response to June’s protests was lawful (the hearing is later today). The city of D.C. is also suing to block Trump’s federal takeover of its police department.\n\nAdvertisement\n\nTo point out the other side, Black and brown communities often face delayed (or wholly counterproductive) responses from public safety officials in times of crisis, while law enforcement tends to respond swiftly and aggressively when perceived threats to white people arise.\n\nAs the 20th anniversary of Hurricane Katrina approaches, the failures of our government to support my community — I was born and raised in New Orleans — when we really needed it, feel like a stark mirror to their ability to hinder now. Widespread damage could have been prevented. Lives could have been saved.\n\nAs a result, the levees that protected New Orleans’ lower-income neighborhoods collapsed, despite scientists and journalists urging community leaders to stabilize the clay barriers. And where was the National Guard? Overwhelmed, as it’s reported. My community suffered. And while Katrina was a natural disaster, there’s a clear pattern of political regulation, and who bears the brunt of cultural trauma.\n\nAdvertisement",
  "authors": [
    "Contributing Writer"
  ],
  "url": "https://www.huffpost.com/entry/trump-national-guard-anti-ice-protest_n_689f41b6e4b0df16e32c4744?origin=top-ad-recirc"
}