{
  "title": "Perché il piano segreto di pace per l'Ucraina tra Stati Uniti e Russia spaventa Kyiv e l'Europa",
  "text": "L’amministrazione statunitense guidata dal presidente Donald Trump avrebbe sviluppato piano segreto di pace per l'Ucraina in 28 punti con l’obiettivo di porre fine al conflitto, elaborato in stretta consultazione con Mosca e senza coinvolgere né l’Ucraina né i Paesi europei. Il documento, rivelato martedì 19 novembre da Axios e confermato dal Financial Times, imporrebbe a Kyiv concessioni territoriali e militari che funzionari ucraini ed europei considerano inaccettabili.\n\nIl piano sarebbe stato elaborato da Steve Witkoff, inviato e mediatore scelto dall’amministrazione Trump, e da Kirill Dmitriev, alto funzionario russo a capo del fondo sovrano della Russia (Russian Direct Investment Fund), molto influente nella diplomazia economica e politica di Mosca, il quale ha dichiarato ad Axios che finalmente \"la posizione russa viene davvero ascoltata\". Secondo quanto riportato da Nbc News, ai colloqui – avvenuti a Miami tra il 24 e il 26 ottobre – avrebbero preso parte anche altre figure politiche e diplomatiche di spicco dell'amministrazione come il vicepresidente JD Vance, il segretario di stato Marco Rubio e Jared Kushner, uno degli artefici del fragile cessate il fuoco a Gaza. La Casa Bianca ci crede davvero, tanto che alcuni ufficiali del Pentagono guidati dal segretario dell’Esercito Dan Driscoll sono già arrivati in Ucraina mercoledì 19 novembre Per avviare la negoziazione formale con Kyiv. \"Il raggiungimento di una pace duratura richiederà che entrambe le parti accettino concessioni difficili ma necessarie\", ha scritto Rubio su X mercoledì.\n\nLe concessioni umilianti richieste a Kyiv\n\nLa proposta che la delegazione americana ha portato a Kyiv si articolerebbe su quattro macro-aree: le condizioni per cessare le ostilità, le garanzie di sicurezza, la nuova architettura di sicurezza europea e le future relazioni bilaterali tra Stati Uniti, Russia e Ucraina. Sul fronte territoriale, il piano prevederebbe che l'Ucraina ceda alla Russia il controllo completo delle regioni di Luhansk e Donetsk, nonostante le forze ucraine controllino ancora circa il 14,5% di questi territori secondo l'Institute for the study of war citato da Axios. Le aree evacuate verrebbero formalmente designate come zone demilitarizzate. Nelle regioni di Kherson e Zaporizhzhia, le attuali linee di controllo verrebbero congelate, lasciando alla Russia ampie porzioni di territorio ucraino.\n\nLe richieste americane andrebbero tuttavia ben oltre le questioni territoriali. Secondo quanto rivelato dal Financial Times, il documento richiederebbe all'Ucraina di ridurre le proprie forze armate della metà, portandole a circa 400mila effettivi. Il piano imporrebbe la rinuncia ai missili a lungo raggio come gli Atacms e prevederebbe una riduzione dell'assistenza militare americana. Ma c’è di più: le condizioni russe imporrebbero il riconoscimento del russo come lingua ufficiale di stato in Ucraina e la concessione dello status ufficiale alla locale Chiesa ortodossa russa. Sul fronte del riconoscimento internazionale, il piano prevederebbe che Stati Uniti e altri paesi riconoscano la Crimea e il Donbas come territori russi, anche se l'Ucraina non sarebbe tenuta a farlo pubblicamente. Il documento vieterebbe, inoltre, il dispiegamento di truppe straniere sul suolo ucraino, escluse forze di peacekeeping. In cambio, Washington offrirebbe garanzie di sicurezza non specificate, che però non prevederanno l'ingresso dell'Ucraina nella Nato.\n\nIl rifiuto di Kyiv e l'allarme europeo\n\nDi fronte a un piano segreto di pace per l'Ucraina così sbilanciato in favore di Mosca, la reazione ucraina è stata di \"ben poco entusiasmo\", dato che \"Washington sembra orientarsi verso un allineamento sulle richieste di Mosca\". Funzionari del governo di Kyiv hanno descritto il piano come conforme alle richieste del Cremlino e hanno fatto sapere che non verrà implementato senza modifiche radicali. Un funzionario ucraino citato da Nbc News ha confermato che Zelensky aveva autorizzato Rustem Umerov, consigliere per la sicurezza nazionale e diplomatico di alto livello del presidente ucraino, a ricevere informazioni sul piano durante un incontro a Miami. Tuttavia, si è trattato esclusivamente di un briefing orale: Umerov non ha ricevuto alcuna versione scritta del documento, e il funzionario ucraino citato ha chiarito che il consigliere non ha in alcun modo accettato i termini del piano.\n\nLa tensione diplomatica tra Usa e Ucraina è aumentata quando l'incontro previsto per mercoledì 19 novembre ad Ankara tra Witkoff e Zelensky è stato cancellato all'ultimo momento. Secondo Axios, Witkoff avrebbe rinviato il viaggio quando è emerso che Zelensky non sembrava interessato a discutere seriamente la proposta di Trump. Anche l'Europa ha reagito con allarme all'esclusione dal processo negoziale. L'alto rappresentante dell'Unione europea Kaja Kallas ha dichiarato giovedì 20 novembre a Bruxelles, secondo Bloomberg, che \"per far funzionare qualsiasi piano, servono gli ucraini e gli europei a bordo\", confermando di non essere stata informata del coinvolgimento europeo nella costruzione della proposta.",
  "authors": [
    "Riccardo Piccolo"
  ],
  "url": "https://www.wired.it/article/piano-segreto-pace-ucraina-russia-stati-uniti/"
}