{
  "title": "The best budget robot vacuums",
  "text": "is a senior reviewer with over twenty years of experience. She covers smart home, IoT, and connected tech, and has written previously for Wirecutter, Wired, Dwell, BBC, and US News.\n\nEditor’s note: Black Friday doesn’t officially take place until Friday, November 28th; however, if you want to shop ahead of time, we’ve rounded up the best early Black Friday deals you can already get.\n\nToday’s robot vacuums are becoming a bit like cars: with all the features, upgrades, and fancy trimmings available these days, it’s easy to forget that they can just be simple machines that get us from point A to point B. Yes, some bots blow hot air on their bums (mop pads), deftly navigate dog poop, and have arms to pick up your socks, but there are plenty of basic budget robot vacuums that just do a decent job of cleaning your floor autonomously — as long as you tidy up first.\n\nFancier models have obstacle recognition, and some even use AI-powered cameras to tell popcorn from poop and avoid the latter. If you want one of those, check out my best robot vacuum buying guide. But if you think you can manage the task of picking up after yourself (and your puppy), a budget bot will save you a lot of money and still do a good job cleaning your floor.\n\nWhat I’m looking for How I test robot vacuums Collapse To judge its vacuuming power, I run every robot vacuum through a series of tests on hardwood and carpet, including flour, kitty litter, oatmeal, and pet and human hair. I test obstacle avoidance using cables, shoes, socks, and bed skirts. I test mopping effectiveness on hardwood and tile floors using dried and moist messes. If the robot has an auto-empty dock, I test to see how well it empties the onboard bin, as well as any other features of the dock. I run the robot vacs around three different levels in my home to see how they handle different surfaces, room transitions, and edge sensing. I evaluate how long they run before needing to recharge and test each app, focusing on its mapping functions to see how simple they are to use and how reliable they are. I also examine each robot’s build quality and parts availability, and I totally judge them based on how much my cat Boone likes to play with them. Price Collapse Yes, there are sub-$200 robots out there. No, I do not recommend you buy them. With so many new models coming out almost daily, it’s better to look for a sale on an older model from a well-known company than buy a no-name budget bot. You can pick up a brand new Roborock with mapping and advanced navigation for half its original price. These gadgets should last for years, so it’s not like buying last season’s Prada slip-ons.That said, sales are hard to keep track of, so some of the prices listed here may seem high for a budget bot. If you see one that fits your needs, keep an eye on The Verge’s deals page for when they go on an even better sale. Cleaning prowess Collapse The cheaper the bot, the more important suction power is, as they tend to have fewer features that improve cleaning. Higher-end robots have things like better brushes, carpet boost mode, and dirt detection. At a minimum, look for 2,500Pa (if the manufacturer lists suction power; some don’t). I also much prefer rubber roller brushes or a rubber / bristle hybrid over just bristle brushes. Rubber rollers pick up more dirt and tangle less than bristles. A mop (or not) Collapse Bear in mind that most budget mopping bots don’t really mop — it’s more just using a damp cloth to pick up the fine dust the robot’s vacuum left behind, which is useful but not essential. Mop attachments with water reservoirs also take up space on a robot and mean a smaller bin. A big bin Collapse A big bin means you don’t need to empty it as often. Eight hundred milliliters is the largest I’ve seen, but anything over 450 ml is decent on a budget bot. With many bots now pulling double duty as mopping robots and the prevalence of auto-empty docks, it’s hard to find robots with big bins. But if you’re on a budget and don’t want to spend extra for the dock, a big bin will mean less hands-on time with your vacuum. Or an auto-empty option Collapse If you can swing it, I strongly recommend an auto-empty dock, and there are finally some cheaper versions out there. While it’s a nice-to-have rather than a must-have, delegating the chore of emptying the bin to the robot does mean your floors will be cleaner since a vacuum with a full bin won’t suck up dirt. Many standalone robots now have an auto-empty dock option you can add later if you want to wait and see, but buying them together is generally cheaper. Navigation / mapping Collapse We are starting to see true budget bots use the vSLAM (visual simultaneous localization and mapping) or lidar-powered navigation or mapping found on higher-end robots, albeit lower-level versions. Some, use the bump and roll technique, with more now adding a gyroscope function that at least makes them go in a straight line.Choosing an older version of a high-end robot will get you better navigation, but I’ve also included a few bump-and-roll bots with basic mapping capability, which makes the experience better all around. Non-mapping bots may miss entire sections of your home and, when they start again after charging, may go over the area they last cleaned. However, mapping is less important if you want a bot for a single room or a small apartment. Good battery life / long runtime Collapse While most bots can recharge and resume (go back to their charging base and refuel before going back out again), a bot that can go for at least two hours on one charge will get the job done more quickly and be less annoying. I look for at least 120 minutes of runtime (180 is the best). A decent app Collapse A lot of budget bots have barely usable apps; this is another reason why buying a lower-cost option from a company with higher-end models gets you a better experience, as the app is usually more polished.A good basic app, though, should have the ability to set multiple schedules to send the robot out, an option for a do-not-disturb period (so it doesn’t start up again at 2AM because it finally recharged), and a way to link to voice assistants and smart home platforms like Amazon Alexa, Google Home, and Apple’s Siri. Repairability Collapse Even at the budget end, you’ll be spending $200 to $300 on a robot vacuum, so repairability and the availability of replacement parts are a big bonus.\n\nBest budget robot vacuum\n\nSuction power: 5,300Pa / Dustbin capacity: 300ml / Self-empty dock option: Yes / Mopping option: Yes / Mapping: Yes, lidar / Keep-out zones: Yes, virtual / Runtime: 100 mins, 2,600mAh battery/ Brush style: Single rubber bristle hybrid / Works with: Matter\n\nFor around $300, the Tapo RV30 Max Plus is a very capable robot vacuum and mop with some key features typically found only on vacuums that are more than twice its price. These include room-specific cleaning, multiple suction and water levels, smart lidar-based navigation, and an auto-empty dock. With brands like Roborock, you’re often paying double for the privilege of not having to empty the bot’s bin.\n\nThe Tapo RV30 Max Plus includes a compact auto-empty charging dock.\n\nThanks to lidar navigation, the RV30 did an excellent job of navigating my house, cleaning the perimeters of the rooms, and then using a mesh grid to clean inside the rooms. I did have to tidy up before it ran, though, as there’s no camera on board or AI-powered obstacle detection — so cables and socks will trip it up.\n\nIts 5,200Pa suction power is impressive on a bot at this price, and ably sucked up Cheerios and dry oatmeal on hard flooring. It left some of the finer dust and debris, as its single bristle / rubber brush isn’t super effective. It fared less well on carpet. However, in the app, I could set it to clean a room three times for each job, after which it generally picked up all visible debris.\n\nMopping was better than average for a mop with no pressure or oscillation. It has a wide mop pad, and the bot has a big 300ml tank (which also incorporates a 300ml dustbin), so it applies enough water for a good surface clean.\n\nAnother unique feature for a budget robot is the ability to set customized cleaning for each room, choosing from five suction levels and three water levels as well as three rotations.\n\nThe Tapo app is very simple to use, with an easy-to-edit map that lets you add virtual walls and no-go zones, add furniture, and designate carpet areas. There’s no carpet sensing, so you need to tell it where carpets are if you don’t want it to mop them. You can also set the cleaning direction and build up to four maps — again, features usually only found on higher-end robots.\n\n5,200Pa suction power is impressive on a bot at this price\n\nIt’s also easy to start a clean from the app, and I really like that you can tap on the map to send the robot to that spot.\n\nThe biggest downside of the Tapo is its tiny battery, which is just 2,600mAh. That is half the size of most vacs, and it couldn’t clean my entire 800-square-foot downstairs without needing to go back and recharge. It also takes a while to charge and occasionally has trouble repositioning itself on its dock.\n\nYou can get the RV30 without the auto-empty dock for around $80 less if you prefer an even simpler robot vacuum setup. This way, it will fit under a couch or bed, but you’ll have to manually empty its bin.\n\nBest budget robot vacuum for pet hair\n\nSuction Power: 5,000Pa / Dustbin capacity: 770ml / Self-empty dock option: Yes / Mopping option: Yes / Mapping: Yes, lidar / Suction power: 5,500Pa / Keep-out zones: Yes, virtual / Runtime: 240 mins, 5,200mAh battery / Brush style: dual, rubber / Works with: Amazon Alexa, Google Home, Siri Shortcuts\n\nMy recommendation for families with pets who don’t want to spend a small fortune on an auto-empty robot vacuum is to buy a good bot with a big bin. These are getting harder to find now that every bot wants to be a multitasker and also mop (the water reservoir takes up valuable dustbin room). So, I’m very pleased with Roborock’s Q5 Pro with its 770ml dustbin.\n\nThis huge bin pairs with dual rubber roller brushes that are better at getting pet hair out of rugs than single brushes. The rubber is also less prone than bristles to getting tangled with hair, and combined with 5,500Pa suction power, this vacuum does a good job on very dirty floors. It does have a removable mopping pad with a small water tank built into it, too, which is useful for cleaning up the fine dust left behind by the vacuum, but it isn’t going to scrub your floors. It will, however, keep the pet hair at bay.\n\nDon’t confuse this with the cheaper Roborock Q5. That bot has a smaller bin, lower suction, shorter runtime, and only one roller brush. It’s worth spending the extra for the Pro.\n\nPrevious Next\n\n\n\n1 / 3 I like big bins and I cannot lie. The Q5’s 770ml bin is the biggest I’ve tested since self-empty docks became a thing.\n\nThe Q5 Pro Plus pairs the bot with the redesigned Roborock auto-empty dock if you really don’t like emptying the robot’s onboard bin, normally a hefty price bump, it’s often on sale at Amazon. The dock is relatively compact and lightweight compared to previous versions. However, considering the size of the Q5 Pro’s bin, you’d only have to empty it three times before the dock’s 2.5-liter bag is also full.\n\nThe Q5 Pro doesn’t have AI-powered obstacle avoidance, although it will dodge shoes and larger objects. It does have a huge 5,200mAh battery that will run for about four hours. It uses the excellent Roborock app and has all the same software features of the higher-end Roborock’s family, including lidar mapping and navigation, digital keep-out zones, room-specific cleaning, zone cleaning, and voice control.\n\nBest basic bump-and-roll bot\n\nSuction power: unknown / Dustbin capacity: 425ml / Runtime: 120 mins / Brush style: single bristle / rubber hybrid / Auto-empty dock option: no / Mapping: no / Keep-out zones: no / Works with: Amazon Alexa, Google Home\n\nThe Shark Ion’s big bin, simple app experience, decent battery life, repairability, and bullish nature make this an excellent bump-and-roll bot. It doesn’t map or have any special navigation features other than colliding with things and changing direction. It’s not fancy, but it gets the job done.\n\nIt’s a good one to stick under a bed or desk and set to run when you’re not home, as it’s loud and rattly and will bang into everything in its path. But its big wheels and 120-minute runtime mean it’s less prone to getting stuck or running out of juice than simpler $200 bots.\n\nUnlike many budget bots, it uses a hybrid roller brush that’s both bristle and plastic and doesn’t get as tangled as standard bristle brushes. Its short, squat side brushes are surprisingly effective at getting debris into the robot’s path, and because they’re short, they’re less prone to getting tangled in stray cords.\n\nThe Shark has big wheels and a hybrid brush that isn’t prone to tangles. Photo by Jennifer Pattison Tuohy / The Verge\n\nBut the best thing ‘bout this bot is its tank-like wheels that will roll right over anything in its path, including high transitions between rooms, obstacles like lounger chair legs, and other furniture traps that regularly stump other bots. That’s a good thing, as there’s no mapping, obstacle detection, or any way to set keep-out zones here. This bot just goes.\n\nAnother bonus: replacement parts are easily available, making it simple to repair and just keep going.\n\nShark doesn’t share suction power specs, but it ably handled all my tests, including the toughest: raw oatmeal. Those little flakes are hard to pick up; side brushes will spin them all over the floor. It did a good job on pet hair, too, although, like most robots I tested, it required at least two runs to get everything up effectively.\n\nThe app is super basic: just on / off, scheduling, and a choice of three power levels (all loud). Disappointingly, you can only schedule it once a day. Most robots can be programmed to do two to three passes, but in place of that, I like the option to schedule it to go out twice to make sure it gets the job done. I couldn’t do that with the Shark. Still, you can press its button or use the app to send it out again if needed.\n\nBest budget robot vacuum without Wi-Fi\n\nSuction power: 2,000Pa / Dustbin capacity: 600ml / Runtime: 100 mins / Brush style: single bristle / rubber hybrid / Auto-empty dock option: no / Mapping: no / Keep-out zones: no / Works with: n/a\n\nThe Eufy 11S Max is a rarity — a robot vacuum that doesn’t use Wi-Fi at all. There’s not even an app. Instead, you just press the button, and off it trundles. It also comes with a remote if you’d rather not get up off the couch, and you can use that to program it to clean at a specific time.\n\nThe 11S is super slim, 72.5mm high, with no lidar tower, so it will get under most couches. It has a big 600ml bin, and I was very impressed with how much it got up off my hardwood floors, even with its relatively small 2,000Pa of suction. There are three cleaning levels, and at the lowest, it registers around 55db, which is quiet enough to run in a home office.\n\nIt does have a smallish battery — only 100 minutes of runtime — but it will go back and recharge. For $200, this is the perfect budget bot for those wary of or who don’t want to deal with an app or Wi-Fi. It’s a bump-and-roll bot, meaning there are no real navigation skills. But it has plenty of replaceable parts, including the battery and wheels, so you can keep it going for a long time.\n\nWhat we’re currently testing and what’s coming next\n\n$319.99 Roomba 105 Combo and the In light of reports around iRobot’s uncertain future , we’ve removed the iRobot Roomba Combo i5 from our recommendations. While if the company goes out of business, Roombas should still work in offline mode, you may not be able to control them via the app or with voice commands. As for the company’s new budget robovacs — Roomba’s $169.99 Roomba 105 Combo and the $469.99 Roomba 205 DustCompactor Combo — we’re still in the testing phase, but so far aren’t impressed. While both models can vacuum and mop, boast 7,000Pa of suction, and include other useful features, each has already run into notable issues during testing. For example, the 205 we received — which features an onboard debris and dust compactor that iRobot says goes eight weeks before having to be emptied — arrived with battery problems.\n\nWe’re also in the process of testing the $379.99 $549.99 Roborock Q10 S5 Plus Robot Vacuum and Mop, and so far we’re fans. Along with 10,000Pa of suction power, it offers a 2.7-liter self-emptying base that can hold up to 70 days’ worth of debris. Its sonic mop lifts automatically when it detects carpet and can scrub floors 3,000 times per minute, and you can set specific rooms to clean, create no-go zones, and customize cleaning schedules.\n\n$299.99 , it’s a good option as you have more control of where it cleans, and it doesn’t miss areas. Shark has launched a new line of budget robots under its Navigator line. We’ve started testing the Shark Navigator RV2110 and, so far, we’re impressed with its basic lidar navigation, which allows it to map your home so it doesn’t need to bump n’ roll like the Ion. At the current sale price of $199.99, it’s a good option as you have more control of where it cleans, and it doesn’t miss areas.\n\n$499.99 , the RV2120AE is more expensive than the Tapo, even when you consider that you have to purchase bags for the latter. The Shark RV2110AE is cheaper at $348, but it has a smaller battery and only one side brush, so it won’t run as long between charges. One benefit of Shark vacuums to consider over the Tapo is that they’re very repairable — you can buy replacement parts for almost everything on the bot, which you can’t with the Tapo. The Shark RV2120AE is the same robot with an auto-empty dock, which, like all Shark auto-empty docks, doesn’t require replacement dust bags. However, at $299.99 ($150 off), the RV2120AE is more expensive than the Tapo, even when you consider that you have to purchase bags for the latter. The Shark RV2110AE is cheaper at $348, but it has a smaller battery and only one side brush, so it won’t run as long between charges. One benefit of Shark vacuums to consider over the Tapo is that they’re very repairable — you can buy replacement parts for almost everything on the bot, which you can’t with the Tapo.\n\nUpdate, November 12th: Adjusted pricing and availability. Removed the iRobot Roomba Combo i5 and noted the company’s financial difficulties, added some impressions of the Roomba 105 Combo and Roomba 205 DustCompactor Combo, and included a mention of the Roborock Q10 S5 Plus Robot Vacuum and Mop. Sheena Vasani also contributed to this post.",
  "authors": [
    "Jennifer Pattison Tuohy"
  ],
  "url": "https://www.theverge.com/23846479/best-budget-robot-vacuum-robot-mop"
}