{
  "title": "Garante della privacy, i lavoratori hanno chiesto al collegio di dimettersi. Lascia il segretario generale",
  "text": "Non si placa la bufera sul Garante della privacy. Giovedì 20 novembre l’assemblea del personale dell’Autorità garante per la protezione dei dati personali ha chiesto all’unanimità le dimissioni dell’intero collegio, guidato dal presidente Pasquale Stanzione. Lo apprende Wired da fonti riservate, secondo le quali la mattina del 20 novembre si è tenuta un’assemblea dei lavoratori in seguito alle polemiche sulla gestione dell'ente che nelle ultime settimane hanno tenuto banco sulla stampa e sui social network.\n\nIn serata ha fatto un passo indietro il segretario generale, Angelo Fanizza. In una nota l'ente informa che “Fanizza, ha rassegnato le proprie dimissioni. Il Collegio del Garante, nel prenderne atto, ringrazia il segretario generale per il lavoro svolto”.\n\nL'assemblea contro il collegio del Garante della privacy\n\nQueste hanno riguardato in particolare i costi dell’ente, il sospetto di un conflitto d’interessi in alcune delle decisioni assunte, e presunte aderenze di alcuni membri dello stesso collegio con Fratelli d’Italia, il partito della presidente del Consiglio, Giorgia Meloni, svelate da un’inchiesta di Report. Presieduto da Pasquale Stanzione, il collegio è composto anche da Ginevra Cerrina Feroni, Agostino Ghiglia e Guido Scorza. A quanto apprende Wired, alle ore 15 del 20 novembre, a poche ore dall'assemblea sindacale, è stata programmata una riunione del collegio. Contattati da Wired, alcuni membri dell’Autorità non hanno risposto a una richiesta di commento. In serata è stata diramata la nota relativa alle dimissioni di Fanizza, giunto al Garante a marzo 2025.\n\nSebbene non vincolante, la richiesta del personale mette in discussione l’intero funzionamento della macchina posta a protezione della privacy in Italia. Ed evidenzia il clima di sfiducia che ormai aleggia intorno all'istituzione. Proprio per effetto delle rivelazioni di Report e de Il Fatto Quotidiano, persino alcuni partiti politici si erano espressi in favore delle dimissioni del collegio. In particolare il Movimento 5 Stelle e il Partito Democratico - che erano al governo quando il quartetto è stato nominato, a luglio 2020 - e anche alcuni esponenti dell’attuale governo.\n\nTuttavia l’organo indipendente non può essere costretto alle dimissioni. Durante un’intervista al Tg1 dello scorso 11 novembre, Stanzione ha chiarito che il collegio “non presenterà le sue dimissioni”, sottolineando l’indipendenza dell’autorità dalla politica e dalle pressioni ricevute dai partiti. Il mandato del collegio è settennale e scadrebbe naturalmente a luglio 2027. È chiaro che, pur avendo resistito alle bordate della politica e della stampa, ben altra cosa è ignorare le richieste del personale, che fa andare avanti l’Autorità e che sembra aver messo in discussione la fiducia nel gruppo che ne è alla guida.\n\nLe contestazioni al collegio\n\nUno dei fatti contestati al Garante della privacy riguarda l’attacco informatico subito dalla Asl 1 Abruzzo del 3 maggio 2023, nel quale sarebbero stati trafugati dati sensibili tra i quali informazioni su pazienti con Hiv, orientamenti sessuali, interruzioni di gravidanza.",
  "authors": [
    "Raffaele Angius"
  ],
  "url": "https://www.wired.it/article/garante-della-privacy-dimissioni-assemblea-lavoratori/"
}