{
  "title": "Frida Kahlo self-portrait sells for $54.7 million, setting new record for female artists",
  "text": "A self-portrait by Mexican artist Frida Kahlo has become the most valuable work by a female artist sold at auction after selling for $54.7 million.\n\n“El sueño (La cama)” – “The Dream (The Bed)” – grabbed the title at Sotheby’s in New York, after it surpassed the existing record held by the late American artist Georgia O’Keeffe. Her “Jimson Weed/White Flower No.1,” which had previously hung in the White House, sold for $44.4 million in 2014.\n\nKahlo’s surrealist self portrait, which was sold by a private collector, had been valued at between $40 million and $60 million. Another of the Mexican artist’s self portraits “Diego y yo” (Diego and I) previously held the title for second most expensive artwork sold by a female artist after also being auctioned by Sotheby’s, New York, in 2021.\n\nWhen sold, that painting became the most expensive piece of Latin American art ever. It’s now been overtaken by Kahlo’s more recent sale, and drops down to second place – and third for the most valuable artwork by a woman.\n\nPrior to the auction, the painting, which had not been seen publicly for almost three decades, was shown in London, Abu Dhabi, Hong Kong, Paris and New York.\n\nIt sees Kahlo lying on a bed that floats against the backdrop of a pale blue sky. Curling green vines envelop her body, while a skeleton wired with dynamite and holding a bouquet of dried flowers lies above her.\n\nThe bed was a regular motif in Kahlo’s work. She was confined to her bed for long periods of time as she endured a life of chronic pain following a near-fatal bus accident and subsequent surgeries.\n\nDuring the long recovery after the accident, Kahlo’s family set up an adapted easel and fitted a mirror to the canopy of the bed so she could continue to paint while lying flat. “I am not dead and I have a reason to live. That reason is painting,” she wrote at the time.\n\nKahlo painted the piece in 1940, which was a turbulent time for the Mexican artist. It was the year that she remarried Diego Rivera after divorcing the fellow artist a year earlier, and was also the year that her former lover, the Russian revolutionary Leon Trosky, was assassinated.\n\nIn an email to CNN prior to the auction, Anna Di Stasi, Sotheby’s head of Latin American art, said “El sueño (La cama)” had been “one of very few works of this calibre still in private hands.”\n\n“Frida Kahlo occupies a completely singular place in art history. There’s an almost spiritual connection people have with her paintings, which are so deeply personal yet at the same time resonate universally. We’ve seen it this season while El sueño (La cama) has been on display around the world, with lines out the door,” she said.\n\n“This painting has all the hallmarks of a signature Frida: the self-portrait, a surrealist imagery, and most importantly, a psychological intensity and that sense of communion between artist and viewer.”\n\nThe painting formed part of the private collection auction “Exquisite Corpus.” It featured more than 80 surrealist paintings, drawings and sculptures, including pieces by René Magritte and Salvador Dali.",
  "authors": [
    "Lianne Kolirin"
  ],
  "url": "https://www.cnn.com/2025/11/20/style/frida-kahlo-portrait-record-woman-scli-intl"
}