{
  "title": "Jess Cartner-Morley on fashion: how to do the country look – without being a flat cap cliche",
  "text": "Once a decade or so, the urban-centric fashion world discovers this delightful concept called The Countryside. With the vanishingly scant levels of self-awareness that are fashion’s default setting, it then proceeds to immediately and loudly tell the world about it. There are so many trees! Don’t you just love trees? Especially at this time of year when the leaves are lovely tasteful colours, great for selfies, very flattering to the complexion. The pubs are absolutely charming. Sometimes they even have sourdough.\n\nThe Guardian’s journalism is independent. We will earn a commission if you buy something through an affiliate link. Learn more.\n\nHere we go again. It began with hiking boots, a couple of years ago. Last winter, the barn jacket was suddenly, inexplicably everywhere, and this season is wall-to-wall Fair Isle jumpers. Dressing like you are on a cosy mini-break is to autumn what dressing for a festival field is to summer: a version of countryside dressing conceived by someone who leaves the city for no more than 48 hours at a time. It is possibly not even a million miles from cultural appropriation. And at this point I need to hold my hands up and say: I’m as bad as any of them. I love the countryside but I, in my cold hard heart, am an urban creature, really.\n\nThe gravitational pull of this look is to do with our longing for wholesomeness\n\nI think – I hope? – it’s OK to wear country-coded clothes, so long as you accept that those people with the adorable accents in that sweet pub are slightly rolling their eyes behind your back. The gravitational pull of this look is to do with our longing for wholesomeness, for slowing down in an era when life feels relentlessly digital and the future looks intimidating. Clothes that signal a connection to nature – even if you bought your rugged corduroys online and are wearing them on the tube and the connection is, therefore, entirely symbolic – feel grounding. “Touching grass” is a modish gen Z phrase for getting offline and back to nature: this goes with that. A Fair Isle jumper suggests crunchy leaves, a barn jacket has a whiff of woodsmoke, and the reassuring tread of hiking boots evokes a vigorous footpath yomp.\n\nThe space the country-coded weekend wardrobe inhabits is where our tracksuits lived in the pandemic and just after. Sweatpants and a hoodie, once the badge of relaxed cool, is a look that has become trapped in its own cliches. A tracksuit looks a bit “airport fit” now. I’d rather look hedgerow-adjacent than Heathrow-adjacent.\n\nView image in fullscreen ‘Dressing like you are on a cosy mini-break is to autumn what dressing for a festival field is to summer.’ Photograph: Jeremy Moeller/Getty Images for Copenhagen Studios\n\nBest of all, these clothes are just damn functional. The simple, boxy shape of a barn jacket works over everything, and they tend to have excellent pockets for your phone and your gloves, while a soft collar feels good next to your skin as well as providing a little frisson of visual interest. Cord or wool-mix trousers are substantial enough to absorb damp air so that you stay warm. Chunky jumpers are comforting, easy to layer, and a simple way to inject a little personality. There is a reassuring rigour to the whole ensemble. You look like someone with useful skills, who could build a fire or read an actual map should such a thing be necessary. It would be good to be that person, right? So dressing the part is a good place to start.\n\nTry to avoid tipping over into looking like an extra in a Guy Ritchie film, which is a pitfall for urbanites who embrace the country look. You know the vibe: tweed, flat caps, branded wellies, too-shiny waxed jackets. Don’t be too literal: you’re not on a shooting weekend, so top-to-toe brown and green is a hard no. Autumnal reds and oranges, pops of camel and cream, are a good thing. It is also good to include one item that doesn’t track, so it’s not too off-the-rack-looking. So instead of wearing a flannel check shirt with corduroys, wear the shirt with barrel-leg jeans, or the cords with a sweatshirt.\n\nFashion is always part play-acting. It’s a good time of year to be outdoors, so why not look outdoorsy. The thing is, you don’t have to go to the actual countryside. It would be a shame to get your lovely new clothes muddy, babe.\n\nskip past newsletter promotion Sign up to Inside Saturday Free weekly newsletter The only way to get a look behind the scenes of the Saturday magazine. Sign up to get the inside story from our top writers as well as all the must-read articles and columns, delivered to your inbox every weekend. Enter your email address Sign up Privacy Notice: Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on theguardian.com to send you this newsletter. You can complete full registration at any time. For more information about how we use your data see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nModel: Kentha at Milk. Stylist’s assistant: Charlotte Gornall. Hair and makeup: Sophie Higginson using Davines and Kosas. Waxed duffle coat, £279, Barbour. Ribbed wool vest with collar, £75, Arket. Fair Isle jumper, £36, and jeans, £30, both M&S. Boots, £365, Grenson. Earrings, £125, Dower and Hall. Sunglasses, £158, Ray-Ban",
  "authors": [
    "Jess Cartner-Morley"
  ],
  "url": "https://www.theguardian.com/fashion/2025/nov/19/jess-cartner-morley-on-fashion-how-to-do-the-country-look-without-being-a-flat-cap-cliche#comments"
}