{
  "title": "What to Do in San Francisco If You're Here for Business (2025)",
  "text": "You’ve probably read plenty of recent news stories about how San Francisco is a failed city. Our infrastructure is crumbling, our streets are scary, our social fabric is torn and frayed. Most of that stuff is false. Yes, San Francisco has issues, but they’re the same problems nearly all US cities are facing as they struggle to reorient themselves to our new, post-pandemic economic reality. The “doom loop” narrative that’s often repeated in the national press is a gross exaggeration.\n\nThe truth is that San Francisco is thriving. We are at the epicenter of the machine intelligence revolution, as the forces of change draw tech wizards, entrepreneurs, and VC megabucks into our city like a neodymium magnet. Our counterculture roots are still sprouting, and the reigning ethos is one that encourages free thinkers to blaze their own trail.\n\nThe city is small and walkable—just 49 square miles, surrounded by water on three sides—and rich with natural green spaces. It’s diverse, with thriving Asian, Pacific Islander, and Latin American communities. It’s also a mecca for queer folks and a sanctuary for trans and nonbinary young people. It will spoil you with culture, mild weather, and positively killer views from the tops of the famously abundant hills.\n\nIf you’re coming to town for a job interview, a conference, a VC pitch tour, a new job, or if you’re just here to soak up the vibes, this is where to go, what to do, and how to find your people.\n\nWhere to Stay\n\nUnion Square Hotels\n\nCourtesy of Palisociety\n\n417 Stockton Street, (415) 400-0500\n\nYou’ll find this entry in the Palisociety hotel chain on the edge of Union Square, tucked between the mouth of the Stockton tunnel and SF’s massive flagship Apple store. The recently renovated historic building is brimming with old-timey charm (including the 110-year-old Otis elevator, one of the oldest in the city) but has modern conveniences, like the fact that concierge requests are made and resolved over text message. The Pali is also affordable; a single queen room is rarely over $150. On the second floor is the spacious and chill Bar Maritime, which features a knockout menu of nautical-themed craft cocktails and small plates. The full-service Maritime Boat Club restaurant in the back, with a seafood-focused (but vegetarian-friendly) seasonal menu, also shouldn’t be missed. Top destinations in nearby neighborhoods—the bustling restaurants of Chinatown and the lively bars and nightclubs of North Beach—are 10 to 20 minutes away on foot. A short walk in the other direction leads you to the Moscone Convention Center and the corporate offices south of Market street in the SOMA district.\n\nCourtesy of Z Hotels San Francisco\n\n545 Post St, (415) 563-0303\n\nOn the opposite side of Union Square, you’ll find this boutique hotel that takes its inspiration from San Francisco’s history as a rock music hub. Yeah sure, Led Zeppelin is British, but you’ll find plenty of Janis, Jerry, Sly, and Carlos on the walls and in the overhead speakers here. On-site amenities are abundant—24-hour game room; decent burgers in the bar; solid fitness center; and goodie bags for pets, who are welcome—and the location is close to the Mid-Market district that Uber, Reddit, and countless tech companies call home. The Moscone Center and the Salesforce tower are each a 20-minute walk. A wide selection of rooms are available, from simple queens for around $200 to deluxe suites at $350 and up, but even the queen rooms are spacious and funky … in a Summer of Love-via-Urban Outfitters sort of way.\n\nNearby: Union Square is filled with big-name retailers, but San Francisco’s theater district unrolls just steps to the west. There you’ll find traditional Broadway-style musicals, as well as the Warfield Theater, which hosts national headliners like TV on the Radio, Garbage, and Earl Sweatshirt. There’s good food on every block, but highlights are Hinodeya Ramen on O’Farrell Street, the Sudanese Arabic menu at Z Zoul Cafe, and two-Michelin-starred fine dining at Sons & Daughters. Try for a walk-in seat at the bar at Kin Khao, currently in the running for the best Thai food in SF with a cocktail menu that will make you lose feeling in your extremities. Get your Guiness on at Johnny Foley’s, one of the nicer Irish pubs in the city. And in addition to that giant Apple store, the five-story Macy’s, and all the high-end boutiques ringing Union Square, the city’s first Nintendo store just opened on the same corner Tippi Hedren walks across in the opening shot of The Birds.\n\nSouth of Market Hotels\n\nPhotograph: Smith Collection/Getty Images\n\n181 3rd Street, (415) 777-5300\n\nThis high-rise is a favorite of visiting tech execs and conference attendees, as it’s right across the street from the sprawling Moscone Center, where the Dreamforce, Workday Rising, and Microsoft Ignite conferences all take place. Rooms are well appointed with accessible workspaces, calming views of the afternoon fog creeping over Twin Peaks, and prices at around $350 to $550 most weeknights. (Prices go up the weeks of the big conferences.) The gym looks like something out of a Paul Verhoeven movie but has plenty of cardio machines. This branch of Marriott’s W chain is a popular venue for corporate meetings, with 17 large event rooms on the lower floors, including a breezy indoor-outdoor terrace.\n\nNearby: If you’re looking for a more luxurious stay, try the St. Regis Hotel just two blocks up 3rd Street toward downtown. Rooms there start around $700. This corner of SOMA is rich with cultural institutions; the SFMOMA and Yerba Buena Center for the Arts are on the same block of 3rd Street as both hotels. Food is also abundant: Try Lao Table for Southeast Asian fare and Delarosa Downtown for solid pizza and pasta. The Grove is a good spot for a straightforward soup-salad-sandwich lunch, and also the best spot in the area for grab-and-go breakfast. For cocktails, try the subterranean Local Edition, the library-like Novela, and the charmingly old-school House of Shields.\n\n12 4th Street, (415) 348-1111\n\nStaying in SOMA but venturing a little further west, we recommend this handsome hotel at the corner of 4th and Market streets, right across the street from the boarding zone for the world-famous Powell Street cable car. Zelos has a chic and fashionable vibe, with large and bold artwork on display everywhere, even the rooms. Pets are welcome, and the fitness center has Peloton bikes. Rooms with king beds start at a little over $300 a night. The hotel’s restaurant, Dirty Habit, serves a sort of maximalist take on California cuisine, but the real draw is the 640-plus-bottle selection of whiskies. If you can’t decide which tipple to sip, go for one of the curated whiskey flights.\n\nNearby: Other hotels in the area we’d recommend are the InterContinental and the Marriott Marquis. Both are comparable in price to the Zelos. Food is abundant around here. Meatheads need to try the burger at Marlowe, a 15-minute stroll down 4th Street. We wouldn’t recommend venturing further west than 7th street—things get dicey after dark—but if you head toward 6th, you’ll find fantastic Vietnamese food. Tin Vietnamese is modern and fresh, and Miss Saigon is some greasy, flavorful goodness with an atmosphere that can be best described as Santa’s Electric Acid Garden. For happy hour, go to The Harlequin in Mint Plaza or try Press Club, one of the better wine bars in downtown SF. The Powell Street cable car will take you on a fairy-tale ride up and over Russian Hill (right past OpenAI CEO Sam Altman’s megamansion) and all the way to Fisherman’s Wharf, where you can watch the sea lions, watch the tourists, and watch your wallet.\n\nCoworking and Meeting Spaces\n\nSan Francisco is awash in coworking spaces; it’s the land of the startup, after all. There are plenty of WeWorks and established coworking brands—especially downtown and in Mid Market—but here are some spots we recommend you try first.\n\nCourtesy of Noisebridge\n\n272 Capp Street\n\nThis isn’t your typical desks-and-chairs coworking space. Noisebridge is a community of makers, hackers, DIY advocates, and hands-on tinkerers of all stripes. To get in, go to the door on a side street in the Mission District, ring the bell, then wait a few minutes (really, maybe several minutes) for one of the volunteer members to welcome you. Inside you’ll find desks, workbenches, Wi-Fi, tools, and fabrication equipment, all free to use. If you’re looking for a place to hone your 3-D printed prototype, breadboard a circuit for your next hardware demo, or sew some LEDs into your Burning Man outfit, Noisebridge is the place. Queer-friendly, scrappy, and a little punk rock, it’s the spot where you’ll find your inspiration.\n\n595 Pacific Avenue, plus two more locations\n\nIf you’re sticking around for a week or two, check out one of the three Canopy spaces in the city. They’re very comfy, with office furniture by Herman Miller and August, and the perks are plentiful. Canopy’s business model is geared toward longer stays; you pay by the month, either for your own desk ($1,100) or for a space at the community table ($700). If you’re just in town for a week or two, the best deal is the Hybrid membership: $445 for any 10 days per month. Small conference rooms and boardrooms are also available.\n\n1540 Market Street, (415) 463-3998\n\nThis brightly appointed, quiet-but-lively space in SF’s Mid Market neighborhood is the best spot to go if you just need a desk for a day or two. Memberships for longer stays are available, but a day pass is just $25, and you get a discount if you buy a three-day pass. Anchor has a tidy kitchen, private phone booths, free printing, and even a podcast studio.\n\nFerry Building, 1, Suite 201\n\nAscend to the top floor of SF’s historic waterfront Ferry Building to find Shack15. Expansive, exclusive, and always bustling, the space is just as much of a social hub as it is a coworking space. There are two large rooms, one is quiet and filled with desks, the other is more social. Evening events range from book readings to DJ sets to yoga sound baths. It’s a members-only club, but you can apply for a day pass or ask a member to bring you as a guest for a day. The crowd is generally well connected and well funded by VC cash; keep your pitch deck handy.\n\nBest Cafés and Coffices\n\nThe city’s café culture isn’t as robust as New York or Portland, but we do have excellent coffee and comfortable spots where you can work all day. Just know, some coffee shops purposely eschew Wi-Fi and disable their electrical conduits to keep remote workers from lingering. Most, however, will welcome you with open arms as long as you keep buying refills—and keep tipping generously.\n\nPhotograph: San Francisco Chronicle/Getty Images\n\n181 Fremont Street, 7th Floor (415) 375-5984\n\nThis café is nestled in a building right next to Salesforce Park, a funky urban green space on the roof of the city’s big bus terminal next to the city’s tallest skyscraper, the Salesforce Tower. It sounds odd, but the vibe is more “verdant sun-dappled oasis” than “roof deck with coffee shop.” Andytown is a local roaster with several locations around the city, and the coffee drinks here are excellent. This location has plenty of indoor seating, some outdoor seating, and good Wi-Fi.\n\n3049 20th Street\n\nSituated in the heart of the neighborhood where all of the city’s AI companies have set up camp, Atlas has been around since well before the Web 1.0 boom. Low-key and spacious with indoor tables and a covered patio, the café serves breakfast, lunch, and dinner, so it’s open until the early evening—an anomaly in a city where coffee shops close at 3 pm. The food is tasty; try the grilled Cubano, the smoked trout sandwich, or one of the many vegan options.\n\n375 Valencia St., (415) 935-0604\n\nIf you just need a clean, well-lighted place to work and you don’t need Wi-Fi, visit Four Barrel, one of our many roastery-cafés, and among the best in SF. The coffee drinks are supplemented by delicious pastries, and the tasting bar near the front door often pours rare single-origin roasts. The parklet out on Valencia street, with ebikes and driverless robotaxis whizzing by, is a popular spot for informal two-person meetings.",
  "authors": [
    "Michael Calore"
  ],
  "url": "https://www.wired.com/story/the-wired-guide-to-san-francisco-for-business-travelers/"
}