{
  "title": "Falls, feuds and fury: Miss Universe crowned after chaotic – and controversial – pageant",
  "text": "As contestants prepared to walk the runway for the 74th Miss Universe competition on Friday, the pageant’s organisers were in damage control.\n\n“In light of recent public statements and social media posts, the Miss Universe Organization considers it necessary to clarify certain inaccuracies,” a statement by the organisation began. It was addressing allegations of vote rigging – but it could just have easily been referring to a myriad of other scandals the event has seen over recent weeks.\n\nBefore Friday’s polished finale there had been a chaotic run-up, with the competition – styled as a celebration of all cultures, backgrounds and religions in a safe space for women – facing judges resigning, denying allegations of vote rigging, mock drug use, stage falls and dramatic walkouts.\n\nAt the beginning of November Miss Mexico, Fatima Bosch, claimed that she had faced a public dressing down from the pageant’s Thai director, Nawat Itsaragrisil, who allegedly called her a “dumbhead”. She walked out, followed by several fellow contestants, a moment that was caught in a livestream.\n\nLater, Bosch told reporters the way she was treated lacked respect and that “the world needs to see this”.\n\n“This is about women’s rights,” reigning Miss Universe, Victoria Theilvig, said in defence of Bosch. “To trash another girl, it’s beyond disrespectful, and it’s nothing I’ve ever done. That’s why I’m taking my coat and I’m going.”\n\nView image in fullscreen Fatima Bosch, Miss Mexico, walks on stage during the national costume presentation. Photograph: Lillian Suwanrumpha/AFP/Getty Images\n\nThe Mexican president, Claudia Sheinbaum, called Bosch an “example of how we women should speak out”.\n\nNawat later apologised and claimed he had been misunderstood, wiping tears away as he fronted the media – at what appeared to be an official event.\n\nThe drama continued this week, when on Tuesday, Omar Harfouch quit as one of the eight judges, with the French-Lebanese musician claiming a “secret vote” had been arranged to pre-select 30 contestants out of the 136 two days before the final.\n\n“I could not stand before the public and television cameras, pretending to legitimize a vote I never took part in. Some of the countries eliminated through this process could be at war, discriminated against, or geopolitically sensitive”, he said via Instagram.\n\nOn the same day, the French footballer Claude Makelele announced he, too, had made the “difficult decision” to quit as a judge for “unforeseen personal reasons”.\n\nThe organisation responded with a statement regarding what it said were Harfouch’s “inaccuracies”, suggesting his “confusion” was over the pageant’s social impact initiative, which operates separately from the Miss Universe competition and its judging panel.\n\nView image in fullscreen Miss Great Britain, Danielle Latimer, falls on stage during the national costume competition. Photograph: Rungroj Yongrit/EPA\n\n“The Miss Universe Organization firmly clarifies that no impromptu jury has been created, that no external group has been authorized to evaluate delegates or select finalists,” it said.\n\nThen, on Wednesday evening, Miss Jamaica, Gabrielle Henry, fell from the main stage during the preliminary competition’s evening gown round, an accident that landed her in hospital. That same day Miss Great Britain, Danielle Latimer, tripped and fell flat on the stage while wearing an outfit inspired by the cockney character Eliza Doolittle. She later claimed the fall was choreographed.\n\nConflict in the Middle East couldn’t be kept away from the proceedings, with the inaugural Miss Palestine, Nadeen Ayoub, wearing a gown emblazoned with an image of the Dome of the Rock – the holiest Muslim site in Jerusalem. Miss Israel claimed to have received death threats after purportedly giving her side-eye – something that Melanie Shiraz said was down to misleading editing.\n\nView image in fullscreen Nadeen Ayoub of Palestine takes part in the national costume show during the 74th Miss Universe pageant in Bangkok. Photograph: Athit Perawongmetha/Reuters\n\nIt goes on. The Chilean Miss Universe, Inna Moll, apologised after mimicking snorting white powder from her arm in a before-and-after makeup video filmed in Bangkok and posted to TikTok. And on the sidelines of the pageant, the the winner of Miss Teen Cambodia used her speech to accuse Thailand of starting ongoing violent border clashes.\n\nBut by Friday afternoon, however, the weeks of chaos was forgotten when Miss Mexico was crowned the 74th Miss Universe, beating crowd favourite Miss Thailand. Despite the dramatic start to her competition, Bosch seemingly made good on her promise to show the world a more appealing side to the pageant.",
  "authors": [
    "Daisy Dumas"
  ],
  "url": "https://www.theguardian.com/world/2025/nov/21/miss-universe-2025-controversial-pageant-mexico-fatima-bosch-crowned"
}