{
  "title": "These Street Dancers Have Flawlessly Blended Style And Strength",
  "text": "Summer nights in San Francisco are known for being chilly, but on an August evening at SVN West—a sprawling venue in the heart of the city—the air felt like the inside of an oven. Despite the heat, a massive audience lingered to witness a mesmerizing, high-stakes dance battle, roaring as street dancers took turns freestyling on a circular stage. Spectators waved wristbands that glowed in various hues to decide who stayed in the fight and who’d be sent home.\n\nThis competition — the Red Bull Dance Your Style National Final — wasn’t just about adrenaline; it was a vehicle for artistry, culture and identity. While shamelessly voting for all the women, I was struck not only by each dancer’s brilliance, but also by the unexpected grace unfolding between the sweat and swagger. In a scene often dominated by men, women stomped in baggy ’fits—but with waist-length braids, elaborate nail art, and mile-long lashes that wouldn’t budge under stage lights.\n\nThese women’s style wasn’t secondary to their movement. It was emblematic of the battle itself.\n\nOnstage, the host, Emmy-nominated choreographer Charm La’Donna (along with her co-host, Sway Calloway), set the tone. Known for working with Kendrick Lamar, Beyoncé and Dua Lipa, La’Donna commanded the mic with the warmth of a true dancer’s dancer. She was encouraging, celebratory, and appreciative of what made each performer unique, whether they fit neatly into a specific genre or not.\n\nAdvertisement\n\n“I love to see how people interpret music,” La’Donna tells me. “When you become truly engulfed in your own art, it’s hard to define. It’s just expression.”\n\nThat spirit radiated from four of the female contenders that night, each one showcasing strength and vulnerability, masculinity and femininity in their own way.\n\n\n\nJreamz\n\nFor Jreamz, beauty isn’t about appeasing outside expectations but about readiness. Photo: Red Bull Content Pool / Little Shao\n\nAdvertisement\n\n\n\nSeventeen-year-old Jossette “Jreamz” Sanaphay battled with a raw krump style that felt like an eruption of power. The Phoenix-based dancer discovered krumping a year ago and was hooked by its intensity.\n\n“It’s not like any other genre,” she says. “When you’re in that moment, in that community, it’s very different from a regular battle.”\n\nJreamz danced up in sweatpants and a tee — but never competes without lashes. “I’ll put on baggy clothes, but I’ll have my full makeup done ’cause that’s what my style is,” she tells me, pointing out one of many contradictions she’s able to embrace when she dances.\n\nAdvertisement\n\nFor Jreamz, beauty isn’t about appeasing outside expectations but about readiness.\n\n“I do my makeup before the battle so I can feel my best,” she explains. With her long hair tied back, nude lip gloss locked in and sneakers laced up, her nerves melt away and all she’s left with is excitement. “I focus on being myself—because there’s not really more you can do than that.”\n\nDaisy ‘VMZ’ Vazquez\n\nClassically trained in ballet and jazz, Vázquez shifted into hip-hop at 15 and fell in love with “polyswagg,” a high-energy style blending hip-hop, voguing and sass. Credit: Red Bull Pool / Priscilla Rodriguez\n\nIf Jreamz is the future, 20-year-old Daisy “VMZ” Vázquez is the hometown hero. A Bay Area native, she lit up the stage in San Francisco, darting across the circle with explosive flips and rapid-fire moves.\n\nAdvertisement\n\nClassically trained in ballet and jazz, Vázquez shifted into hip-hop at 15 and fell in love with “polyswagg,” a high-energy style blending hip-hop, voguing, and sass. When she entered her first battles, she noticed immediately: “There’s not a lot of girls here.” She recalls critics dismissing her as “too much” for her aggressive facial expressions or hitting moves with the same intensity as her male opponents. But instead of toning it down, she doubled down. “I used it as motivation to go even harder,” she says.\n\nHer look onstage conveys a bit of that defiance. She favors oversized jeans, graphic tees, and — unexpectedly — Uggs, paired with full glam.\n\n“I love dressing really baggy, but best believe my makeup will be beat, my nails will be done.” The beauty elements she incorporates are inseparable from her presence onstage. “Once you add that essence of femininity, it brings more power throughout your rounds,” Vázquez says.\n\nAdvertisement\n\n\n\nMarlee Hightower\n\nAt the battle, Hightower competed in loose-fitting sweats paired with long, cascading braids that punctuated every move. Photo: Red Bull Content Pool / Little Shao\n\n\n\nMarlee Hightower, 25, has been immersed in street dance since she was 6. By 10, she and her Orlando-based crew were performing on America’s Got Talent and touring 26 cities.\n\nHightower describes her movement as rooted in traditional hip-hop and incorporates its old-school, combat-like posturing into her performance style. “The genre is masculine in how you dress and carry yourself, but I love that. I always felt connected to that side of who I was,” she says.\n\nAdvertisement\n\nAt the battle, Hightower competed in loose-fitting sweats paired with long, cascading braids that punctuated every move. She believes the dance floor offers liberation that society doesn’t always allow.\n\n“I can be masculine and that doesn’t take away from my femininity, and vice versa,” she tells me. “That’s given me confidence where I don’t have to conform to anything.”\n\nIvy Mugler\n\nOften performing in combat boots and goth-inspired costumes, Mugler expresses herself through “dramatic performance,” a style that can serve as an emotional release. Photo: Red Bull Content Pool / Little Shao\n\nAdvertisement\n\n\n\nWhile Hightower embraces tradition, New York City-based vogue dancer Ivy Mugler pushes her genre in surprising directions. Often performing in combat boots and goth-inspired costumes, Mugler expresses herself through “dramatic performance,” a style that can serve as an emotional release. “I had a lot of rage from the life I was living,” she says. “Voguing became how I let it out.”\n\nIn a world where feats like 360 spins that pancake onto the floor, hair flips and acrobatics are usually associated with men, Mugler became known for “hair control,” treating her long hair like an extra limb. But this year, she chopped it off, a move she calls “subversive.”\n\nWith her new short cut, Mugler feels freer. “It emphasizes my line, it emphasizes my technique,” she says. “It took away the expectations that I have to be feminine in a certain way. Now I feel like I’m on the same playing field. People don’t know what to do with me, and I love that.”\n\nAdvertisement\n\nBy the end of the night in San Francisco, the crowd was louder than ever, and the last battles squeezed every last ounce of energy out of each dancer. None of the women made it to the final round — that came down to Sean Lew and SonLam — but their impact was undeniable. Each made their mark on the stage, unapologetically leaning into their authentic selves with every song, every beat.\n\nAs La’Donna says, what matters most isn’t fitting into someone else’s vision of dance, but showcasing your own. “It’s just allowing the art and allowing yourself to be free in that space,” she stresses. “And that is the most important thing: the confidence.”\n\nStreet dance, I realized, is more than a competitive expression of movement. It’s an overlooked space for beauty and gender expression, where lashes and braids carry as much weight as footwork and freezes. And in the hands of these women, it’s a reminder that power and femininity can look like anything they want.\n\nAdvertisement",
  "authors": [
    "Founder",
    "Beautycism.Com",
    "Beauty Writer"
  ],
  "url": "https://www.huffpost.com/entry/women-street-dancers-red-bull-competition_n_691e0529e4b0b763ab8d2ec8"
}