{
  "title": "‘Friends’ Spinoff ‘Joey’: Unaired Episodes Released",
  "text": "LOADING ERROR LOADING\n\nAfter nearly two decades, a long-forgotten chapter of “Friends” is finally seeing the light of day ― just in time for Thanksgiving, fittingly.\n\nBoth seasons of the “Friends” spin-off series “Joey,” centered on Matt LeBlanc’s Joey Tribbiani, were officially made available to stream on YouTube this week for the first time. The release includes Season 2’s final eight episodes, which NBC never broadcast after the show was officially canceled in 2006.\n\nAdvertisement\n\n“Joey” was created by Shana Goldberg-Meehan and Scott Silveri, both of whom worked on the original “Friends” over the course of that series’ record-smashing 10-season run.\n\nThe show followed Joey Tribbiani after he relocated from New York to Los Angeles to focus on his acting career, and also starred “Sopranos” actor Drea de Matteo as Joey’s sister, Gina, and Jennifer Coolidge as Hollywood agent Bobbie Morganstern.\n\nThe cast of NBC's \"Joey,\" which ran from 2004 to 2006, included Jennifer Coolidge, Miguel A. Nuñez Jr., Paulo Costanzo, Andrea Anders, Matt LeBlanc and Drea de Matteo. NBC via Getty Images\n\nAdvertisement\n\nCritical reception to “Joey” at the time of its debut was mixed. “Let’s be honest: ‘Joey’ is no ‘Friends,’” Newsweek wrote, before praising LeBlanc’s “adorably dense” portrayal of the title character. Variety, meanwhile, called it a “polished and likable half-hour.”\n\nThough “Joey” premiered to respectable ratings in 2004, it failed to capture the zeitgeist like its predecessor, and was canceled amid its second season, with its final eight episodes left unaired in the U.S.\n\nThe first two episodes of “Joey” were uploaded to the official “Friends” YouTube page in March, with the remaining 46 finally appearing online Wednesday.\n\nAdvertisement\n\nSpeaking to The Hollywood Reporter in 2014, LeBlanc recalled how the failure of “Joey” prompted him to take an extended break from Hollywood. Following the show’s 2006 cancellation, he didn’t return to television until 2011, when he played a fictionalized version of himself on the Showtime series “Episodes.”\n\n“I did ‘Joey’ for two years, and that wasn’t received with the same success as ‘Friends’ was. The pressure was incredible,” he explained. “There was just no way, it couldn’t perform like ‘Friends’ did. So when that was over, I said, ‘I’m going to take at least a year and not do anything,’ and that turned into six years. I was enjoying myself ... I really didn’t think about work at all.”",
  "authors": [
    "Senior Culture Reporter"
  ],
  "url": "https://www.huffpost.com/entry/joey-matt-leblanc-series-unaired-episodes_n_691f709ee4b047290e294c0d?origin=top-ad-recirc"
}