{
  "title": "Need Vegan Thanksgiving Dishes? These Will Wow Everyone.",
  "text": "Advertisement\n\nNeed Vegan Thanksgiving Dishes? These Will Wow Everyone. Seasonal vegetables become even more delicious with simple touches like citrus zest, fresh herbs and crunchy toppings. When vegetables dishes taste this good, they are the feast. Credit... Ryan Liebe for The New York Times. Food Stylist: Barrett Washburne. Prop Stylist: Megan Hedgpeth.\n\nMy early Thanksgivings were a cross-cultural hodgepodge: boxed stuffing and canned cranberries sat on the table alongside pav bhaji and lemon rice. My Indian immigrant parents didn’t want us to miss out on American celebrations, but they also couldn’t wrap their heads around eating so much beige food devoid of spice.\n\nBy the time I was 16 years old, though, I had fallen in love with cooking thanks to a daily after-school dose of the Food Network, so I eagerly volunteered to cook a “traditional” feast for my family and my best friend’s family. They lived a street away and though they weren’t related to us by blood, we called each other’s mothers “auntie” and we always celebrated special occasions together.\n\nCredit... The New York Times Cooking\n\nWhen my friend and I took over the menu, we added every decadent dish our adolescent brains could dream of, from marshmallow sweet potatoes to triple-dairy mashed potatoes. After spending 12 hours in our mothers’ aprons, we lined up our masterpieces on her family’s kitchen counter, giddily drinking in the oohs and aahs of our siblings and parents.\n\nWhen I went vegan in my late 20s, I assumed these indulgent feasts would be a thing of the past. But as I looked back on my favorite dishes — green beans with caramelized shallots, warm roasted vegetable salad, butternut squash gratin — I realized the most delicious things on the table were always vegetables.\n\nWhen vegetables are treated with care, they don’t need to be in a supporting role. They are the feast. Over the last decade, I’ve learned a few more tricks to make vegetables dazzle, all without using dairy or meat.\n\nThe recipes below bring the abundance of Thanksgiving to the wide world of vegetables and offer tricks that apply to any produce you want to prepare for the big day. The only thing you need to add to this mix of warming richness and bright freshness are the people you love the most.\n\nAdvertisement\n\nOnion-infused oat milk soaks bread to a custard softness and complements the aroma of caramelized leeks. Credit... Ryan Liebe for The New York Times. Food Stylist: Barrett Washburne. Prop Stylist: Megan Hedgpeth.\n\nGolden at the edges, custardy soft in the middle, this savory bread pudding pairs herbs with maple-caramelized leeks for an irresistible alternative to stuffing. Plus, it can be assembled ahead of time for a stress-free showstopper.\n\nTakeaway Technique: Cooking vegetables down until they’re meltingly sweet is always a winning method.\n\nLemony and a little spicy, this pistachio pesto also works well as a dip for crackers and crudités. Credit... Ryan Liebe for The New York Times. Food Stylist: Barrett Washburne. Prop Stylist: Megan Hedgpeth.\n\nSweet-salty roasted squash and crispy chickpeas atop a bed of tangy, Middle Eastern-inspired mint pesto create a holiday-worthy platter full of texture and color. It’s elegant yet surprisingly easy to make.\n\nTakeaway Technique: Crisp toppings make any dish more satisfying. Roasting chickpeas and toasting nuts are simple ways to add crunch.\n\nSearing then simmering fennel wedges in orange juice softens their tough fibers to tenderness. Credit... Ryan Liebe for The New York Times. Food Stylist: Barrett Washburne. Prop Stylist: Megan Hedgpeth.\n\nThis stovetop braise transforms fibrous fennel into meltingly tender silkiness. Layering it with zippy orange, creamy beans, briny olives and earthy walnuts makes for a surprisingly hearty dish. With only seven ingredients, it delivers restaurant-quality complexity without taking up precious oven space.\n\nTakeaway Technique: Small touches like citrus zest, fresh herbs and olives can make vegetables shine without much effort.\n\nFollow New York Times Cooking on Instagram, Facebook, YouTube, TikTok and Pinterest. Get regular updates from New York Times Cooking, with recipe suggestions, cooking tips and shopping advice.",
  "authors": [
    "Nisha Vora",
    "Nisha Vora Is A Recipe Developer Who Specializes In Plant-Based Recipes. She Is The Author Of The Cookbook",
    "Big Vegan Flavor",
    "Hosts Videos On Her Youtube Channel",
    "Rainbow Plant Life."
  ],
  "url": "https://cooking.nytimes.com/article/vegan-thanksgiving-menu"
}