{
  "title": "NWSL Championship: key battles to decide Washington Spirit v Gotham FC final",
  "text": "At the close of quintessential NWSL playoffs rife with last-minute goals and upsets, the eighth-placed underdogs Gotham FC will face second-placed Washington Spirit for the trophy. Both teams have won the NWSL Championship once before: the Spirit in 2021 and Gotham two years later. Washington are the likely favourites, but Gotham’s talent cannot be discounted.\n\nAs we look forward to Saturday night in San Jose, here are a few key battles that could decide the game.\n\nAnn-Katrin Berger (Gotham) v Aubrey Kingsbury (Spirit)\n\nUnless we find ourselves in a penalty shootout and either keeper takes one, these two won’t face strikes from one another. But their battle could be the most decisive of all.\n\nBoth made player-of-the-match-worthy performances in the first round. Gotham upset the record-setting, first-place Shield winners, Kansas City, thanks to a massive seven-save performance from NWSL’s 2024 Goalkeeper of the Year, Berger. In Washington, Kingsbury saw the Spirit to a narrow victory against the post-season debutantes Racing Louisville with seven saves of her own across 120 minutes, then two more to secure the win in a penalty shootout.\n\nIn the semi-finals, the pair faced fewer shots on target, but were called on to make highlight reel-worthy saves to send their teams to the final. An elite performance from either keeper could decide the championship.\n\nEmily Sonnett v Washington’s attacking depth\n\nBerger is the reigning goalkeeper of the year and is deservedly nominated again for 2025. But the fact that Gotham conceded the second-fewest goals (25) this season and claimed the second-most clean sheets is because their defence has been superb. Hats off to the veteran centre-back Emily Sonnett, who has had a superb year for club and country.\n\nThe Spirit have an impressive cadre of players who are threats in front of goal; and Sonnett needs to coordinate their containment. With injuries limiting starts for some (such as Croix Bethune and Trinity Rodman, the latter of whom is still returning to full fitness and came off the bench late in the semis) Washington have five players with four or more goals this season (Gotham have three), while collectively accruing 42 in total – second only to Kansas City. Sonnett’s backline performance will need to be top notch to limit them, with the help of key players around her such as fellow centre-back Jess Carter.\n\nView image in fullscreen Gotham’s Emily Sonnett focuses on defending a cross in the match against Houston Dash. Photograph: Icon Sportswire/Getty Images\n\nTara McKeown (Spirit) v Esther González (Gotham)\n\nThe Gotham coach, Juan Carlos Amorós, listed his top scorer, Esther González, as questionable in last week’s availability report, then started her in a 1-0 win against Orlando. The Spain striker (whose four goals at the Euros made her the tournament top scorer) finished second behind Temwa Chawinga in this year’s Golden Boot race, with 13 goals in 23 games. Sunday’s semi-final was her first game in more than a month as she returns from injury, but the typically incisive striker hit a dry patch before that and hasn’t scored in her past five appearances. That said, González loves a trophy-winning goal. She scored the team’s deciding goal in their Concacaf W Champions Cup victory as well as in their 2-1 Championship win over Seattle in 2023. Washington’s Defender of the Year finalist, the USWNT centerback Tara McKeown, will need to be at peak performance to keep González at bay – not to mention Gotham’s other in-form goalscorers Jaedyn Shaw or Rose Lavelle.\n\nGift Monday and Rose Kouassi (Spirit) v Lily Reale (Gotham)\n\nThis final sets up riveting tests along both flanks. One to watch pits the Rookie of the Year finalist Lily Reale against Spirit’s top scorer, Gift Monday, and the free-flowing Ivorian forward Rose Kouassi. Kouassi will be attacking from the right, where the young USWNT left-back has impressed this year for club and country. With the left centre-back Jess Carter also key to the equation, Reale will need to help limit Kouassi’s creative bursts that have been key to Gift Monday’s effectiveness in front of goal.\n\nKouassi and Monday combined for two of the Spirit’s three post-season goals, with Kouassi (who clocked four goals and four assists in the regular season) providing the assist both times. According to Opta, Kouassi has set up Monday for six goals in 2025, which is the most since the dynamic duo of Yuki Nagasato and Sam Kerr in 2019. It’ll be a team effort to stop them but Reale’s effort on the left flank could be key to limiting that link-up.\n\nskip past newsletter promotion Sign up to Moving the Goalposts Free weekly newsletter No topic is too small or too big for us to cover as we deliver a twice-weekly roundup of the wonderful world of women’s football Enter your email address Sign up Privacy Notice: Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on theguardian.com to send you this newsletter. You can complete full registration at any time. For more information about how we use your data see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nView image in fullscreen Washington Spirit’s Rose Kouassi (left) and Gift Monday (right) pressurise Sam Hiatt of Portland Thorns. Photograph: Scott Taetsch/NWSL/Getty Images\n\nCroix Bethune (Spirit) v Jaelin Howell (Gotham)\n\nThe midfield battle between these two teams makes for fascinating viewing. Croix Bethune was named NWSL’s 2024 Rookie of the Year and 2024 Midfielder of the Year after tying Tobin Heath’s single-season assists record with five goals and 10 assists. She dealt with an injury earlier in the year, but has hit her stride in the latter half of the season, proving consequential with her elite vision and creative instinct and scoring the second of two goals in the team’s 2-0 victory last weekend. For Gotham, Jaelin Howell’s defensive presence can be formidable, while also providing an attacking threat of her own with four goals and an assist (making her Gotham’s third-highest scorer behind González and Lavelle). A big game from either player will have a huge impact in the middle of the pitch, with Howell’s ability to block Bethune’s progress into the final third a key contest.\n\nJaedyn Shaw (Gotham) v Sceptics\n\nThe 20-year-old Frisco talent Jaedyn Shaw has had some ups and downs over the past few years for club and country. But the versatile midfielder/forward is hitting top form at the right moment for Gotham after joining the 2023 champions this summer. Amorós has used her in multiple positions across the post-season, and she has been key to both victories. Shaw scored the first of two goals against Kansas City as well as the stoppage-time winner against Orlando. The Spirit will have an eye on her, as Shaw seeks further vindication of her post-match comments after toppling Kansas City: “Underdog, my ass.”\n\nGet in touch\n\nIf you have any questions or comments about any of our newsletters please email moving.goalposts@theguardian.com.",
  "authors": [
    "Megan Swanick"
  ],
  "url": "https://www.theguardian.com/football/2025/nov/20/nwsl-championship-key-battles-that-will-decide-washington-spirit-v-gotham-fc-final-moving-the-goalposts"
}