{
  "title": "World Cup playoff draw: Wales face Bosnia, Northern Ireland head to Italy, Ireland go to Prague",
  "text": "Wales and Northern Ireland will do battle for a place at the 2026 World Cup if they navigate playoff semi-finals of differing toughness in March.\n\nThe pair would fight it out in Cardiff for a ticket to next year’s showpiece if Wales win a home tie against Bosnia and Herzegovina and Northern Ireland prevail in a fiendish trip to Italy, who are out of form but will be strongly favoured. It is a particularly appetising draw for Craig Bellamy’s Wales, who are flying after defeating North Macedonia 7-1 on Tuesday and are two home victories from a return to the most exalted stage.\n\nThe Republic of Ireland, fresh from an extraordinary week in which Troy Parrott scored all five goals in their wins over Portugal and Hungary, will feel quietly confident of a first finals spot since 2002. They must travel to face Czech Republic in the semi-finals but, should they muster further heroics in Prague, a home final against Denmark or North Macedonia lies in wait.\n\nEurope will send four teams to the World Cup through the playoffs, whose semi-finals will take place on 26 March before the finals five days later. Wales and the Republic of Ireland had been drawn from pot three after finishing second in their qualifying groups; Northern Ireland reached the playoffs via the Nations League and always looked destined for a more difficult semi-final from pot four.\n\nThe other two pathways also produced enticing match-ups. Ukraine will face Graham Potter’s Sweden, the winners hosting whoever prevails in a semi-final between Poland and Albania. Slovakia or Kosovo will stage the fourth final against Turkey or Romania.\n\nThe European draw was preceded by the one for the inter-confederation playoffs, which pit non-Uefa nations against one another. Jamaica will scent a chance to reach their first World Cup finals since 1998 after being matched with outsiders New Caledonia in the semi-finals, the winner of that tie facing top-seeded Democratic Republic of the Congo. Jamaica will compete under a new manager after Steve McClaren resigned this week.\n\nskip past newsletter promotion Sign up to Football Daily Free daily newsletter Kick off your evenings with the Guardian's take on the world of football Enter your email address Sign up Privacy Notice: Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on theguardian.com to send you this newsletter. You can complete full registration at any time. For more information about how we use your data see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nIn the other pathway Bolivia and Suriname will play off for a final against Iraq. The inter-confederation ties, also to be held during the March international break, will take place in the Mexican cities Monterrey and Guadalajara.",
  "authors": [
    "Nick Ames"
  ],
  "url": "https://www.theguardian.com/football/2025/nov/20/world-cup-playoff-draw-wales-bosnia-northern-ireland-italy-ireland-czech-republic"
}