{
  "title": "Trump, Vance Not Invited To Dick Cheney's Funeral: Reports",
  "text": "LOADING ERROR LOADING\n\nNeither President Donald Trump nor Vice President JD Vance was invited to the funeral of former Vice President Dick Cheney, which took place on Thursday in Washington, D.C., according to multiple reports.\n\nCheney, who served as vice president under George W. Bush, “died due to complications of pneumonia and cardiac and vascular disease,” on Nov. 3, his family said.\n\nAdvertisement\n\nCNN reported that many notable guests attended, including former Presidents Bush and Joe Biden, accompanied by former first ladies Laura Bush and Jill Biden. Joining them at the front of the service at Washington’s National Cathedral were four former vice presidents: Kamala Harris, Dan Quayle, Al Gore and Mike Pence.\n\nPolitical tension between Trump and Cheney wasn’t uncommon toward the end of the former vice president’s life. In 2024, Cheney broke from his party and announced his support of Harris over Trump in the presidential election.\n\n“Dick Cheney is an irrelevant RINO, along with his daughter, who lost by the largest margin in the History of Congressional Races!” Trump wrote on Truth Social in response.\n\nAdvertisement\n\nFormer U.S. President George W. Bush, former first lady Laura Bush, former Vice President Al Gore, former President Joe Biden, former first lady Jill Biden, former Vice President Kamala Harris and former Vice President Mike Pence attend the funeral service of former Vice President Dick Cheney at the National Cathedral on Nov. 20 in Washington, D.C. Andrew Harnik via Getty Images\n\nIn a 2022 campaign video for his daughter Liz Cheney’s House reelection in Wyoming, the late politician called Trump a “coward.”\n\n“In our nation’s 246-year history, there has never been an individual who is a greater threat to our republic than Donald Trump,” Dick Cheney stated. “He tried to steal the last election using lies and violence to keep himself in power after the voters had rejected him.”\n\nAdvertisement\n\nTrump did not publicly comment on Cheney’s death; press secretary Karoline Leavitt noted during a press briefing that the president was “aware” of it.\n\n“Obviously, there are some political disagreements there, but he was a guy who served his country. We certainly wish his family all the best in this moment of grieving,” Vance said on Thursday during a Breitbart event, per People.\n\nCheney’s family said in their statement following his death that he was a “good man who taught his children and grandchildren to love our country, and to live lives of courage, honor, love, kindness, and fly fishing.”",
  "authors": [],
  "url": "https://www.huffpost.com/entry/trump-vance-not-invited-cheney-funeral_n_691f6ed4e4b047290e294add?origin=home-zone-c-unit"
}