{
  "title": "Ian Wright believes Jude Bellingham’s critics not ready for a ‘black superstar’",
  "text": "The former England striker Ian Wright has defended Jude Bellingham, insisting some people are not “ready for a black superstar”.\n\nBellingham has come in for criticism in some quarters for his reaction to being substituted during England’s World Cup qualifying win in Albania on Sunday, amid some suggestions he is a disruptive influence in the squad. However, Wright says some people are “frightened” of Bellingham’s success.\n\n“They cannot get to this guy. He is an achiever, he’s a winner, he goes out and does it,” Wright said on the Stick to Football podcast. “They are trying to build something because England have qualified so easily. They need to have something else to pile on, on top of the narrative. I don’t think they’re ready for a black superstar who can move like Jude [Bellingham] is moving. They can’t touch him.\n\n“He goes out there, he performs, he does what he does. It’s too uppity for these people.\n\n“They all love N’Golo Kanté. He’s a humble black man, gets on with what he’s doing. But if you get a [Paul] Pogba or a Bellingham, and you get that kind of energy, that does not sit well with people. Someone like Jude frightens these people because of his capability and the inspiration he can give.\n\n“Because if you are outspoken, black and playing to that level and not caring, that frightens certain people. It’s a tiring exercise to speak about.”\n\nView image in fullscreen Ian Wright has revealed that he got in touch with Jude Bellingham after the midfielder’s recall to the England squad. Photograph: Michael Regan/The FA/Getty Images\n\nBellingham was recalled to Thomas Tuchel’s squad for games against Serbia and Albania having been left out of October’s squad.\n\nAmid discussions about Bellingham’s place in the squad, Wright revealed that he messaged the former Birmingham player before he joined up with the group to warn him of what could happen.\n\n“I sent a message to Jude saying: ‘Be ready.’ Something was coming. It’s like a tsunami. Unless you play well and do something, it comes back.\n\n“He said: ‘What’s coming?’ and I told him: ‘Be ready for it’ – and it’s here.”",
  "authors": [],
  "url": "https://www.theguardian.com/football/2025/nov/20/ian-wright-believes-jude-bellingham-critics-not-ready-for-black-superstar"
}