{
  "title": "Marcelo Bielsa en la selección de Uruguay: grandes triunfos, la polémica con Luis Suárez y una humillante derrota",
  "text": "CNN Español —\n\nCuando Marcelo Bielsa llegó a la selección de Uruguay en mayo de 2023, parecía una combinación perfecta.\n\nUn estratega intenso en formas y fondo, que saca el jugo de sus dirigidos, llegaba para dirigir a una generación que había sido semifinalista del Mundial Sub-20 de 2017, con futbolistas que parecían encajar casi de forma perfecta en su ideario.\n\nPero, tras algunos éxitos puntuales y lograr una clasificación que se daba casi por descontada a la Copa del Mundo de 2026, al estratega argentino le ha tocado un camino más espinoso del que cualquiera se habría imaginado en su tránsito por la celeste.\n\nLa luna de miel\n\nCon Bielsa, Uruguay logró dos triunfos resonantes al principio de las eliminatorias de la Conmebol, que daban cuenta de que algo interesante se estaba gestando.\n\nVenció con claridad a Brasil en el estadio Centenario de Montevideo, para luego visitar Buenos Aires e imponerse a una crecida Argentina, campeona del mundo, en La Bombonera.\n\nEl fútbol de esa etapa era deslumbrante. Dinámico, veloz. Uruguay se presentaba como serio candidato para ganar la Copa América de 2024, pero allí comenzaron los problemas.\n\nBielsa ha sido severamente cuestionado tras la derrota por 5 a 1 de Uruguay ante Estados Unidos en Tampa. Getty Images\n\nLa turbulencia\n\nEn el torneo continental, Bielsa y su selección mostraron baches en su juego, que sus rivales terminaron aprovechando para evidenciar algunas falencias. Así fue como se estrelló en una peleada (literal y metafóricamente hablando) semifinal que terminó en derrota y en una reyerta donde suspendieron a 12 jugadores. Sin embargo, la gran polémica todavía estaba por llegar.\n\nLuis Suárez decidió dejar la selección al retomar las eliminatorias en septiembre de 2024, enfrentado de manera directa con el entrenador. El ariete acusó al técnico de enrarecer el ambiente de la selección, con jugadores que, según él, no disfrutaban estar allí por la forma en la que el estratega trataba a los futbolistas y sus sesiones de entrenamiento.\n\nDe allí en más, Uruguay comenzó una crisis de resultados, y también rendimientos. Empates ante Venezuela (que pudo ser una derrota) y Bolivia (que también pudo perder sobre la hora) dejaron tocado el crédito del entrenador, quién después de 35 partidos disputados en dos años y medio con la celeste tiene un saldo de 16 victorias, 12 empates y siete derrotas.\n\nRumores de fin de ciclo\n\nLa caída en el último amistoso de Uruguay por 5 a 1 ante Estados Unidos evidenció un problema. “Esto es una señal de que algo no estamos haciendo bien”, aseguró en la rueda de prensa posterior al partido. “Mi propuesta fue insuficiente”, añadió.\n\nAficionados y prensa de Uruguay cargaron con un sinfín de críticas contra el entrenador, apuntando como principal responsable del crítico momento, a poco más de medio año del comienzo del Mundial 2026. Sin embargo, Bielsa confirmó este jueves que no va a renunciar, aceptando su responsabilidad en el mal momento.\n\nEl maridaje perfecto entre entrenador y jugadores le ha costado más de lo esperado a los celestes. Solo el tiempo dirá lo que el ciclo de Marcelo Bielsa deja en Uruguay.",
  "authors": [
    "Pabloantonio Garciaescorihuela",
    "Por Pablo A. García Escorihuela",
    "Cnn En Español"
  ],
  "url": "https://cnnespanol.cnn.com/2025/11/20/deportes/bielsa-seleccion-uruguay-derrota-polemica-orix"
}