{
  "title": "The Rise of Embedded Payments: Turning Every Software Company Into a Fintech",
  "text": "For years—no, decades—SaaS companies were all about having subscriptions as their primary growth engine.\n\nHowever, this is starting to shift with the continued rise of embedded payments. As software and finance converge, embedded payments (and fintech monetization more broadly) are set to become the new drivers of revenue and growth in SaaS. According to recent data from Stax Payments, 91% of ISVs expect embedded payments to play a larger role in their growth strategy over the next 12 months.\n\nAnd other industry data backs this up: according to Bain & Company, financial services embedded into ecommerce and software platforms already accounted for $2.6 trillion in U.S. transactions in 2021, nearly 5% of the total. By 2026, that figure is expected to more than double, surpassing $7 trillion.\n\nWhy more SaaS companies are turning to embedded payments\n\nEmbedded finance is opening new doors for software companies, and payments are often the first step. For many SaaS companies, payments serve as the gateway to broader embedded finance because they’re the most natural extension of how customers already use software to run their businesses.\n\nNot to mention, embedding payments into your software offers a host of benefits that boost everything from revenue to user experience. Consider the following:\n\nUnlock more revenue streams – In SaaS, embedded payments let you move beyond your existing revenue streams. Depending on how you’ve set up your payment offerings, you may earn revenue through transaction fees, revenue-share percentages, added subscription tiers, or premium features tied to payment functionality.\n\n– In SaaS, embedded payments let you move beyond your existing revenue streams. Depending on how you’ve set up your payment offerings, you may earn revenue through transaction fees, revenue-share percentages, added subscription tiers, or premium features tied to payment functionality. Offer better UX – Embedded payments cut friction by eliminating redirects and third-party checkouts. Your users (and even their customers) can complete transactions without leaving the platform, driving higher conversion rates and stickier adoption.\n\n– Embedded payments cut friction by eliminating redirects and third-party checkouts. Your users (and even their customers) can complete transactions without leaving the platform, driving higher conversion rates and stickier adoption. Lower churn rates – When payments are integrated into daily workflows, switching platforms becomes costly and inconvenient. This stickiness reduces churn and lengthens customer lifetimes, directly improving LTV:CAC ratios.\n\n– When payments are integrated into daily workflows, switching platforms becomes costly and inconvenient. This stickiness reduces churn and lengthens customer lifetimes, directly improving LTV:CAC ratios. Gain a competitive advantage and market differentiator – Being a provider with embedded payments positions your software as an all-in-one solution. That not only deepens customer trust but also sets you apart from competitors still relying on external processors.\n\nEmbedding payments into your software: how to get it right\n\nDone right, embedded payments can help you deliver tremendous value to your users and strengthen your bottom line. Just remember that while payments are powerful, the real value shows up only if they’re built seamlessly into your platform and are backed by a solid GTM plan.\n\nHere are some best practices that’ll help you unlock true payments-led growth.\n\nIt starts with buy-in\n\nBefore you roll out embedded payments, you need everyone on board. Executive leaders must champion payments as a growth strategy; product teams need to integrate it seamlessly; and sales and marketing should be prepared to clearly communicate its value.\n\nWhen every level of your organization is aligned, payments stop being “just another feature” and become a core part of your SaaS growth story.\n\nGetting buy-in also ensures that payments don’t live in a silo. Instead, they’re truly embedded, not just from a technical perspective, but from a strategic standpoint across your organization.\n\nBuild a strong team\n\nYour embedded payments strategy is only as strong as the team behind it. Consider appointing a dedicated payments leader to guide your payments program. That person shouldn’t carry the load alone, though—they’ll need support from product, engineering, sales, and marketing to bring payments to life.\n\nFor best results, look for people who are adaptable and willing to learn the ins and outs of a fast-moving industry. Even if they’re not payment veterans, the right mindset and focus will ensure your program can grow and scale over time.\n\nChoose the right payments partner\n\nUnless you’re building fintech capabilities in-house, you will likely need a partner who can bring your payments program to life. Of course, not all payment tech providers are created equal, and you need to assess whether or not they’re the best fit for your SaaS company.\n\nHere are some questions to ask the providers you’re considering for embedded payments:\n\nHow flexible is the API? – Can the API support multiple payment methods, scale with transaction volume, and offer white-label capabilities so you can fully own the customer experience?\n\nCan the API support multiple payment methods, scale with transaction volume, and offer white-label capabilities so you can fully own the customer experience? What revenue models do they offer? – Does the partner support referral, reseller, and PayFac models—and can they show you how each impacts margins and scalability?\n\nDoes the partner support referral, reseller, and PayFac models—and can they show you how each impacts margins and scalability? How will they help you monetize (not just process) payments? – The right partner should go beyond transaction facilitation and help you build a true revenue engine. Look for a team-based growth model that includes co-selling support, activation playbooks, and ongoing merchant success programs. They should also define clear KPIs (e.g., attachment rate, time-to-first-transaction, and margin lift) and back it up with proven results from platforms similar to yours.\n\nThe right partner should go beyond transaction facilitation and help you build a true revenue engine. Look for a team-based growth model that includes co-selling support, activation playbooks, and ongoing merchant success programs. They should also define clear KPIs (e.g., attachment rate, time-to-first-transaction, and margin lift) and back it up with proven results from platforms similar to yours. What support is available beyond documentation? – Strong documentation is essential, but you’ll also want dedicated implementation managers and solution engineers who can walk your team through the integration.\n\nStrong documentation is essential, but you’ll also want dedicated implementation managers and solution engineers who can walk your team through the integration. Can the program grow with you? – Look for flexible partnership structures that let you start lean and scale up as payments adoption accelerates.\n\nLook for flexible partnership structures that let you start lean and scale up as payments adoption accelerates. How do they handle compliance and risk? – Your provider should manage underwriting, fraud, and regulatory requirements so you can stay focused on building software.\n\nYour provider should manage underwriting, fraud, and regulatory requirements so you can stay focused on building software. What’s the long-term revenue potential? – Ask how the provider helps you maximize payments-led growth with pricing strategies, surcharging tools, and adoption support.\n\nMarket and sell your payment offerings\n\nOnce you have your payments program off the ground, the next step is to expand adoption and ensure that your offerings continue to drive revenue growth. Here are some strategies to ensure your payments program doesn’t just launch—it thrives.\n\nHave a strong value proposition – Tailor your program to your customers’ industries, workflows, and biggest pain points. Clearly articulate why your payments solution saves them time, money, or hassle. The more specific your value proposition, the more compelling your offering will be.\n\nSell it as an all-in-one solution – Instead of presenting payments as an added extra, position them as a core part of your platform. When customers see your software as an end-to-end solution that helps them operate and get paid in one place, adoption rises. Pro tip: Align your sales incentives so payment success is part of every win.\n\nSet up your sales team for success – Speaking of sales, your team needs the tools, training, and confidence to attach payments to every deal. Consider creating playbooks and incentives to boost adoption. In some cases, your payment technology partner can also assist with sales and marketing. Stax Connect, for example, can co-create tailored sales enablement and offer boot camps to help SaaS teams sell payments effectively from day one.\n\nMaking sure embedded payments drive value over the long term\n\nWhen it comes to embedded payments, the most successful SaaS companies ensure that their offerings continue to deliver revenue and customer value as your business scales. Here’s how to do just that.\n\nMonitor your margins – Profitability can erode if you’re not paying attention. Card network fees and market dynamics shift constantly, so revisit your pricing strategy on a regular basis. If you set your go-to-market rates and leave them untouched for years, you risk margin compression over time.\n\nKeep a close eye on churn – Payment friction is one of the fastest ways to lose customers. Failed transactions, limited payment options, or clunky billing can drive users straight to competitors. Keep tabs on churn metrics and even your support ticket volume. Rising complaints may signal it’s time to optimize your processes, systems, or partner strategy.\n\nEvolve along with the industry – Payments aren’t a set-it-and-forget-it feature. Regulations shift, new technologies emerge, and customer expectations rise. To stay competitive, revisit your payments program regularly. Ensure your team, processes, and partners can adapt to new trends and compliance requirements so your payments offering grows stronger over time.\n\nBringing it all together\n\nEmbedded payments can truly transform SaaS companies. Done right, payments aren’t just a feature; they’re a growth strategy that paves the way for higher revenue, reduced churn, and better customer relationships.\n\nReady to see how payments-led growth can fuel your business? Stax Connect combines flexible technology, growth strategies, and payment expertise to help SaaS companies turn payments into scalable revenue.Learn more about Stax Connect or connect with the team today.",
  "authors": [
    "Cindy Zackney",
    "Kirsten Korosec",
    "Jagmeet Singh",
    "Sean O'Kane"
  ],
  "url": "https://techcrunch.com/sponsor/stax/the-rise-of-embedded-payments-turning-every-software-company-into-a-fintech/"
}