{
  "title": "‘A fashion and art moment’: how mediums mix at Frieze art fair",
  "text": "“When you are at the art fair, you push the fashion to be bold and experiment – no black allowed,” says Belma Gaudio, at the opening of Frieze art fair in London.\n\nGaudio is the founder of fashion boutique Koibird and an art collector, and carries a bright green Hermès bag, and her own knitted co-ords with pictures of insects to make her point.\n\nFashion and art are familiar bedfellows but the relevance of fashion at Frieze, where more than 300 galleries and artists ranging from Lauren Halsey to Gilbert & George display works, has grown over the last decade.\n\nCrucially, unlike fashion week where an invite is essential, anyone can go along to Frieze – if they pay about £60 for a ticket. This “real people” factor is catnip for fashion street style.\n\nAt the fair this October, the crowd mixed neutrals with pops of colour. The art crowd are often well-heeled, so the signs of the super-rich – Birkin bags, discreet cosmetic surgery and even fur coats – were in evidence, alongside a stylish, creative crowd. Attention-grabbing outfits mixed with fashion-literate but more low-key looks.\n\nView image in fullscreen Belma Gaudio: ‘I tend to wear something that is comfortable but a little bit standout, with an affinity towards the art.’ Photograph: Sarah Lee/The Guardian\n\nCharlene Prempeh, the founder of creative agency A Vibe Called Tech, is wearing all-black – but the sculptural shapes ensure her outfit fits in. “There’s very few occasions where you can get dressed up for a day event,” she says. “That’s what the fair facilitates.”\n\nToo many overt blue-chip symbols turn some of the crowd off. Osman Ahmed, a writer wearing a Prada skirt and Alaïa bag, says he tones his look down at Frieze: “When there’s so much wealth and status signifiers in the room, I don’t want to be associated with that.”\n\nFashion brands, however, perhaps see an opportunity. Dunhill, Stone Island, Loewe and Nanushka are partners, meaning their branding will appear at the fair.\n\nTalking to the Financial Times, both Dunhill and department store Dover Street Market said they often saw increased footfall during Frieze week.\n\n“[It] is both a fashion and art moment,” says Gaudio. Koibird launched a collection from artist James Shaw in store this week.\n\nPrada is perhaps the artiest of fashion brands. Last year, co-creative director Raf Simons told Vogue that “my interest in art is much bigger than my interest in fashion.”\n\nFor Frieze week, it has opened Prada Mode, a space in King’s Cross.\n\nIt features an installation by the Danish-Norwegian contemporary art duo, Elmgreen & Dragset, entitled The Audience.\n\nVisitors will walk into a “cinema” to watch an intentionally blurred film. Along with other people, they will share the space with five hyper-real sculptures sitting in the seats. One, of course, is wearing Prada.\n\nIt’s a full circle moment for the artists. Twenty years ago, they erected Prada Marfa, a replica of a Prada store, in the Texas desert. The project, originally a comment on the pomposity of land art, has since become an Instagram spot – Beyoncé and Solange posted selfies in 2012 – and it was in The Simpsons in 2019.\n\nAlthough it wasn’t a collaboration with the brand, Prada gave permission for the artists to use the logo, and provided Prada designs to fill the store.\n\nView image in fullscreen Osman Ahmed: ‘I always think what would Miuccia Prada wear? There a discreet, chic vibe that I want to go for.’ Photograph: Sarah Lee/The Guardian\n\n“In an informal way, that was our first collaboration,” says Michael Elmgreen. “It’s the [autumn/winter] 2005 collection, which happened to be in very desert-friendly coloured tones. They fit tremendously well in the desert landscape.”\n\nTwo decades on from Prada Marfa, JW Anderson had two paintings by Jean Siméon Chardin on the walls of the venue for his Dior show in June, Roksanda Ilinčić was inspired by Barbara Hepworth for her latest collection, and a sculpture by Kwangho Lee was on the catwalk at Bottega Veneta.\n\nArtists are also inspired by fashion. Naomi Lulendo, exhibiting at the fair for the first time and wearing a striking outfit of a striped Kenzo shirt and flowing skirt, uses fabric and clothes in her work.\n\n“Clothing is projecting something,” she says, “and since everybody’s projecting something on to you, you have a kind of control … I like people to see me in a way I want to be seen.”\n\nLondon-based designer Bianca Saunders also makes artwork. This October, she collaborated with the Tate on designs that use the work of William Blake.\n\nArt is central to her practice. “Whenever I feel blocked, I’m just like: ‘Let me do my rounds at the galleries,’” she says.\n\nThe artistic world is also inspiring. “When I first [started], I was like: ‘I want to see [people] walking around Frieze wearing the brand.’ That’s the customer that I want – for them to be observers of art.”\n\nView image in fullscreen Naomi Lulendo: ‘It’s finding the balance between comfortable and also a bit classy and sassy and chic.’ Photograph: Sarah Lee/The Guardian\n\nElmgreen agrees that outfits are now part of the experience of Frieze.\n\n“You can say it’s a fair for common people [because anyone can buy a ticket]. It’s not only for the selected few who have the money to buy the art … I think the fashion world is interested in a group of people that they can reach through the art.\n\n“And the artist is definitely also interested in a group of people they can reach through the fashion world.”",
  "authors": [
    "Lauren Cochrane"
  ],
  "url": "https://www.theguardian.com/artanddesign/2025/oct/17/a-fashion-and-art-moment-how-mediums-mix-at-frieze-art-fair"
}