{
  "title": "Washington permanece en vilo ante los próximos pasos en el caso Epstein",
  "text": "CNN —\n\n¿Y ahora qué?\n\nEl drama, la emoción y la conmoción provocados por la repentina exigencia de transparencia del Congreso sobre el caso Jeffrey Epstein han dado paso a la incertidumbre y la sospecha de que el presidente Donald Trump intentará eludir su responsabilidad política.\n\nLas víctimas de Epstein, acusado de tráfico sexual, ya habían visto cómo se postergaba la justicia en otras ocasiones. Tras la revuelta republicana sin precedentes contra Trump el martes, advirtieron rápidamente que aquello era solo un paso más en su larga lucha por la reivindicación. Su sensatez quedó patente una vez que la euforia de su triunfo comenzó a disiparse.\n\nWashington esperó todo el miércoles para saber que Trump había firmado el proyecto de ley aprobado con una mayoría de 427-1 en la Cámara de Representantes y sancionado por unanimidad en el Senado, que no deseaba verse involucrado en la crisis política que el propio presidente había provocado.\n\nLa medida exige al Departamento de Justicia que divulgue todos los archivos de investigación, documentos y demás materiales relacionados con Epstein, con algunas excepciones, en un plazo de 30 días a partir de su entrada en vigor.\n\nNo sorprende que Trump no se apresurara a firmarla, ya que, a pesar de su apoyo tardío a la legislación, esta rechazaba su intento, que se prolongó durante semanas, de mantener las pruebas en secreto.\n\nTrump estaba entre la espada y la pared. Cualquier veto presidencial probablemente sería anulado, a juzgar por las mayorías en el Congreso a favor del proyecto de ley. Pero ahora su Departamento de Justicia —al menos en teoría— está obligado a implementarlo.\n\nCualquier dilación u obstrucción sin duda empeoraría la ya desastrosa desaprobación pública de su gestión del asunto y solo alimentaría la pregunta que lo metió en este lío: ¿qué está tratando de ocultar?\n\nLa sombra del presidente Donald Trump se proyecta sobre una bandera estadounidense en Miami, el 5 de noviembre. Carl Juste/Miami Herald/TNS/Getty Images\n\nLa batalla política que se avecina\n\nLos supervivientes de Epstein y los críticos de Trump se centran ahora en la siguiente fase de la batalla política por los documentos, pero casi no hay claridad sobre si saldrán a la luz pruebas, cuándo lo harán y cuántas habrá.\n\nLos legisladores que respaldaron el proyecto de ley parecían no tener claro qué sucedería si Trump simplemente lo ignoraba. Y la secretaria de Justicia de Trump, Pam Bondi, ofreció una actuación pública nerviosa que generó poca confianza en que obedecería al Congreso o en que la administración tuviera un plan político coherente.\n\nVideo Ad Feedback ¿Qué podemos esperar de la apertura de los archivos del caso Epstein? 06:38 • Fuente: CNN ¿Qué podemos esperar de la apertura de los archivos del caso Epstein? 06:38\n\nTambién surgieron nuevos indicios de la profundidad del atolladero bipartidista en torno a Epstein y de la probabilidad de que la publicación de los archivos del Departamento de Justicia pudiera causar una profunda vergüenza a muchos líderes empresariales y políticos prominentes, estrellas del entretenimiento e incluso miembros de la realeza que se relacionaron con él.\n\nLarry Summers, exsecretario del Tesoro y alto funcionario de la Casa Blanca durante administraciones demócratas, renunció a la junta directiva de OpenAI tras la publicación de correos electrónicos que revelaron su correspondencia amistosa con Epstein.\n\nSummers tampoco terminará el semestre como profesor en la Universidad de Harvard, según confirmó un portavoz de la institución el miércoles.\n\nY Stacey Plaskett, demócrata que representa a las Islas Vírgenes de Estados Unidos en el Congreso como delegada sin voto, tuvo dificultades para dar una explicación convincente de por qué intercambió mensajes de texto con Epstein durante una audiencia en el Congreso en 2019.\n\nNadie puede predecir el rumbo que tomará este extraordinario escándalo con consecuencias de gran alcance. Pero una cosa es clara: está perjudicando profundamente a Trump, tanto en la opinión pública en general como por la división sin precedentes que ha provocado en el movimiento MAGA.\n\nUna encuesta reciente de la Universidad de Marquette —realizada del 5 al 12 de noviembre, antes de muchos de los últimos acontecimientos de la saga— reveló que el 74 % de los adultos desaprobaba la gestión de Trump del caso Epstein. Solo el 43 % de los republicanos la aprobaba.\n\nLa pregunta de Marquette, en la que se pedía a los estadounidenses que eligieran su principal preocupación, no incluía a Epstein en la lista.\n\nSin embargo, la encuesta reveló que a los estadounidenses les preocupaba profundamente la economía y el costo de vida, aspectos en los que otorgaron a Trump una calificación abrumadoramente negativa.\n\nVideo Ad Feedback ¿Cuán transparente será la divulgación de los documentos en el caso de Jeffrey Epstein? 02:33 • Fuente: CNN ¿Cuán transparente será la divulgación de los documentos en el caso de Jeffrey Epstein? 02:33\n\nEl Departamento de Justicia aún no ha revelado sus cartas\n\nTal es la reputación del Departamento de Justicia de Trump —una rama totalmente cooptada de su maquinaria política— que pocos observadores en Washington esperan que Bondi siga al pie de la letra la ley recién establecida por el Congreso.\n\nEl líder de la minoría demócrata en el Senado, Chuck Schumer, advirtió que su partido estaría listo para exigirle cuentas a Trump.\n\nEsto demuestra que los demócratas creen que la exposición de Trump al escándalo Epstein tendrá mayor peso que cualquier vergüenza que las revelaciones pudieran acarrear a otros demócratas prominentes.\n\n“Donald Trump no debe hacer ningún tipo de trampa”, dijo Schumer. “Este proyecto de ley le exige al presidente total transparencia, total honestidad y que sea completamente sincero con el pueblo estadounidense, incluso si no quiere serlo”.\n\nSchumer mencionó la posibilidad de que el Departamento de Justicia intentara sortear la ley. Podría citar las investigaciones sobre destacados demócratas y Epstein, ordenadas por Trump la semana pasada, para oponerse a la divulgación de pruebas.\n\nOtra posibilidad es que las pruebas se divulguen, pero censuradas de tal manera que resulten prácticamente inútiles, bajo el pretexto de que las autoridades protegen a víctimas, testigos o personas inocentes.\n\nEl líder de la minoría demócrata en el Senado, Chuck Schumer, durante una conferencia de prensa en el Capitolio, el miércoles. Tom Williams/CQ-Roll Call, Inc/Getty Images\n\nAlgunos demócratas temen que el Departamento de Justicia elimine cualquier referencia al propio presidente en los archivos.\n\nNo ha habido pruebas de que Trump haya cometido delito alguno en relación con Epstein. Sin embargo, correos electrónicos publicados por el Congreso revelaron múltiples menciones de él por parte de Epstein y su socia encarcelada, Ghislaine Maxwell.\n\nEl senador demócrata por Connecticut, Richard Blumenthal, declaró el miércoles a John Berman de CNN que no tenía “ninguna confianza, absolutamente ninguna, en que el Departamento de Justicia actuara con imparcialidad al divulgar estos archivos”.\n\nAñadió: “Nos corresponderá a nosotros, en el Congreso, y esperamos que sea con un esfuerzo bipartidista, examinar y supervisar este proceso”.\n\nLa rebelión republicana contra Trump por los archivos de Epstein —un tema que obsesiona a parte de la base conservadora— es un hecho. Pero no está claro si los legisladores republicanos se arriesgarían a una supervisión tan rigurosa como la que nunca le han aplicado a Trump para obligarlo a cumplir con la ley. La presión de las víctimas de Epstein podría ser importante en este sentido.\n\nVarios senadores expresaron el miércoles su esperanza de que el Gobierno actuará de buena fe.\n\nEl senador republicano por Missouri, Josh Hawley, afirmó que le sorprendería mucho que el Departamento de Justicia se negara a divulgar toda la información requerida, dado el amplio apoyo bipartidista a la medida.\n\nEl otro integrante de la Cámara Alta por Missouri, Eric Schmitt, declaró que debería divulgarse toda la información creíble que se pueda publicar. Y el miembro del Senado demócrata Dick Durbin, de Illinois, declaró a Manu Raju, de CNN, que esperaba que Trump no desobedeciera la ley del Congreso.\n\nA Bondi le preguntaron en el Departamento de Justicia por qué había accedido a la exigencia de Trump de investigar a los demócratas por Epstein —lo que los críticos consideran una maniobra política ostentosa— después de haber argumentado a principios de año que las pruebas sugerían que no eran necesarias nuevas investigaciones.\n\n“Información. Información. Hay información, información nueva, información adicional”, afirmó Bondi, sin ofrecer ninguna aclaración sobre la situación. Y repitió ante los periodistas: “Cumpliremos la ley, seguiremos cumpliéndola, protegiendo a las víctimas y ofreciendo la máxima transparencia”.\n\nEsto no hizo más que subrayar la gran incertidumbre sobre lo que sucederá a continuación.\n\nDado el extraordinario desarrollo de esta saga hasta el momento, parece imposible creer que los archivos no saldrán a la luz, de una forma u otra, tarde o temprano. Si la administración dilata el proceso u obstruye la investigación, es posible que surjan denunciantes del Departamento de Justicia.\n\nVideo Ad Feedback Sobrevivientes de Epstein dan su testimonio antes de la votación clave en el Congreso 01:00 • Fuente: CNN Sobrevivientes de Epstein dan su testimonio antes de la votación clave en el Congreso 01:00\n\nLos legisladores republicanos deseosos de distanciarse de Trump en este tema antes de las elecciones de mitad de mandato podrían encontrar un incentivo político para unirse a colegas como la representante de Georgia, Marjorie Taylor Greene, en su exigencia de transparencia.\n\nEl representante republicano Thomas Massie, de Kentucky, advirtió que estaría dispuesto a incorporar al acta de la Cámara aspectos de las pruebas relacionadas con Epstein.\n\nAdemás, una demora podría permitir a los demócratas instrumentalizar el tema de cara a las elecciones de mitad de mandato.\n\nLos supervivientes estarán esperando.\n\n“Espero que hagan lo correcto y lo publiquen todo”, declaró a Audie Cornish de CNN Sharlene Rochard, víctima de los abusos de Epstein. “Solo queremos pruebas de que esto nos sucedió… Y queremos ayudar a otras chicas para que esto no vuelva a ocurrir”.",
  "authors": [
    "Stephen Collinson",
    "Análisis Por"
  ],
  "url": "https://cnnespanol.cnn.com/2025/11/20/eeuu/analisis-trump-epstein-bill-larry-summers-congreso-trax"
}