{
  "title": "Travelers without a REAL ID could be charged $18 by TSA under proposed rule",
  "text": "The Transportation Security Administration is proposing an $18 fee for travelers without a REAL ID to pass through airport checkpoints.\n\nThe fee would cover costs associated with new technology needed to verify the passenger’s identity, TSA said in a Thursday notice.\n\nREAL ID – a driver’s license or identification card that meets federal security standards – became required for all air travel in the United States on May 7 after years of the deadline being pushed back.\n\nThe REAL ID Act, which was passed by Congress in 2005, enacted the 9/11 Commission’s recommendation that the federal government enhance security standards for identification.\n\nUnder the newly proposed rule, travelers without a REAL ID would be able to pay the fee and use a new biometric kiosk that could allow them access to TSA checkpoints for 10 days, according to the notice in the Federal Register.\n\nBut paying to use the new “modernized alternative identity verification program” doesn’t guarantee access, according to the notice.\n\nWhen someone chooses to use the program and provides the required information, “TSA will use the individual’s biographic and/or biometric information to verify identity and match the individual to their Secure Flight watch list result.”\n\n“Individuals who verify their identity using TSA’s alternative identity verification process also may be subject to additional screening or experience delays,” the notice read.\n\nPassports are still an acceptable form of identification for both domestic and international air travel, and non-REAL ID compliant licenses are still valid for driving and other identification purposes outside of the federal requirements.\n\nThe $18 fee per person is non-refundable, the notice reads.\n\n“This notice serves as a next step in the process in REAL ID compliance, which was signed into law more than 20 years ago and finally implemented by Secretary Noem as of May 2025,” a TSA spokesperson told CNN. “TSA is working with stakeholders and partners to ensure both security and efficiency at our checkpoints. Additional guidance will be announced in the coming days.”\n\nCNN has reached out to TSA for additional information on when this proposed rule could take effect.",
  "authors": [
    "Devon M. Sayers",
    "Alexandra Skores"
  ],
  "url": "https://www.cnn.com/2025/11/20/travel/real-id-tsa-fee"
}