{
  "title": "Así quedó el sorteo del repechaje intercontinental y el de la UEFA para el Mundial 2026: resumen del 20 de noviembre",
  "text": "Canadá, Estados Unidos y México estarán el Bombo 1, sin importar su ranking, por ser las sedes del Mundial, como ya ha hecho costumbre la FIFA en cada edición del torneo.\n\nLos otros nueve lugares serán para las mejores nueve selecciones del listado de la FIFA (excluyendo a los locales). Allí están España (1°), Argentina (2°), Francia (3°), Inglaterra (4°), Brasil (5°), Portugal (6°), Países Bajos (7°), Bélgica (8°) y Alemania (9°). Los germanos fueron los grandes ganadores del ranking actualizado, ya que avanzaron un puesto, saliendo del 10°, que los hubiera metido en el Bombo 2, con un enfrentamiento casi asegurado ante una potencia en fase de grupos.\n\nEn el Bombo 2 empiezan las aclaraciones, ya que del puesto 10 al 21 de la clasificación de la FIFA están Estados Unidos y México, dos que no cuentan por estar en el Bombo 1, y también Italia, Dinamarca y Turquía, que, como jugarán un repechaje, también son obviados. Por eso, en este grupo quedaron: Croacia (10°), Marruecos (11°), Colombia (13°), Uruguay (16°), Suiza (17°), Japón (18°), Senegal (19°), Irán (20°), Corea del Sur (22°), Ecuador (23°), Austria (24°) y Australia (26°).\n\nNoruega (29°), Panamá (30°), Egipto (34°), Argelia (35°), Escocia (36°), Paraguay (39°), Túnez (40°), Costa de Marfil (42°), Uzbekistán (50°), Qatar (51°), Arabia Saudita (60°) y Sudáfrica (61°) estarán en el Bombo 3. Los saltos en los puestos del ranking que aparecen en ese grupo de selecciones obedecen a que en el medio están Canadá (otra anfitriona, ya en el Bombo 1), Ucrania, Polonia, Gales, Suecia, República Checa, Eslovaquia, Rumania, R.D. del Congo, Iraq, Irlanda (jugarán los repechajes de marzo) y otras como Serbia, Nigeria, Hungría, Grecia, Venezuela, Costa Rica, Perú, Chile, Malí, Eslovenia y Camerún (ya eliminadas). Incluso allí está Rusia, vetada por la FIFA por su invasión en Ucrania.\n\nEl Bombo 4 tendrá a Jordania (66°), Cabo Verde (68°), Ghana (72°), Curazao (82°), Haití (84°) y Nueva Zelandia (86°) como únicas seis selecciones confirmadas. Los otros seis cupos vendrán del repechaje intercontinental (dos plazas) y del de la UEFA (cuatro lugares), sin importar cual sea el ranking FIFA de las clasificadas. Ejemplo: si Italia logra un boleto en la repesca europea, será parte de este grupo, sin importar que esté 12° en el listado oficial.",
  "authors": [
    "Cnn Español",
    "Por Federico Leiva"
  ],
  "url": "https://cnnespanol.cnn.com/deportes/live-news/sorteo-repechaje-mundial-en-vivo-orix"
}