{
  "title": "These Women Are Writing Emails Like A Man And It's Hilarious",
  "text": "TikTok On TikTok and Instagram lately, a number of women are joking about adopting a more curt, man-like email style.\n\nIf you’re guilty of putting too much thought into how many exclamation points you include in your work emails, you’re hardly alone.\n\nOn TikTok and Instagram, a number of women are imagining what might happen if they threw out the niceties and started writing emails like a man.\n\nAdvertisement\n\n“It’s 2024 - no more courtesy phrases, babes,” Kay Bray, a career coach, jokes in one viral clip that has over 210,000 views on TikTok. Reworking her email in the clip, she takes out the “No rush — just looking to stay in the loop,” and opts not to include the obligatory “Thanks so much!”\n\nMaedeh Davami, a sixth year medical student, also made an “emailing like a man” TikTok video which went viral.\n\nAdvertisement\n\n“I created the video because, honestly, we’ve all been there,” she told HuffPost.\n\n“You know, rewriting an email five times just to make sure you sound ‘polite enough’ but not overly enthusiastic like you’re writing to your grandma.”\n\nDavami’s biggest “you’re doing too much” tendency? “Definitely writing ‘no worries’ when clearly there were some worries involved.”\n\nAdvertisement\n\nKristel Cocoli, a software developer and tech content creator, created a similar video back in 2022.\n\n“I’ve noticed how overly polite and padded my emails could get, especially compared to the short, straight-to-the-point emails I get from my colleagues and collaborators,” she told HuffPost. “I thought, ‘What if I just edited out all the fluff and sounded more like them?’”\n\nThe video was “a lighthearted experiment to see how it’d feel if I ditched the exclamation points and endless ‘no worries!’ vibes.”\n\nAdvertisement\n\nThe videos are all in good fun, but what isn’t fun is how women are unfairly judged for writing emails that are viewed as overly congenial.\n\nA study published in the Journal of Computer-Mediated Communication in 2006 found that “when elements of speech and writing are associated with female communication style, they tend to be described in negative terms.”\n\nFor instance, the researchers wrote, exclamation points, which tend to be used more by women than men in emails and texts, are seen as ’’markers of excitability:” a phrase that “implies instability and emotional randomness.”\n\nAdvertisement\n\nAs unfair as it is, “There are different rules for men and women when it comes to any workplace interaction,” said Lois Frankel, the author of “Nice Girls Don’t Get the Corner Office” and an executive coach of three decades.\n\n“Whereas a guy can use two lines and get away with it, in our society we expect women — even self-confident, assertive women — to round off the rough edges just a little or risk being put in the ‘bitchy’ category,” she said.\n\nThat said, the goal is not to write more like a man, she said, but to be more confident and get to the point so you’re not wasting your own time. Frankel’s recommendation is skip the fluff and instead start with a quick personal touch, give the reason you’re writing, and then no more than three to four sentences of bullet points.\n\nAdvertisement\n\nHer example email?\n\nDoug, I hope you had a productive trip to Dallas. I wanted to touch base about the proposal we discussed earlier this month which you said you’d have to me no later than this morning. I haven’t seen it and need it by EOD today so that I can complete the analysis on time. I appreciate your making it a priority and getting it to me by then. Regards, Judith\n\nMarnie Lemonik, a career coach in Austin, Texas, thinks sometimes women add niceties out of fear of coming across as too demanding. She reminds her clients that you’re not annoying or “asking for too much” by simply trying to fulfill the duties of your role.\n\n“And actually, the shorter the email, the easier you make it for the receiver of the email to actually take action upon the request,” she told HuffPost. “By making your request more simple, the core of what is actually needed can shine through more clearly.”\n\nAdvertisement\n\nOf course, you don’t have to forgo all friendlessness, reminds Cocoli, one of the women behind a viral TikTok video above.\n\n“I catch myself sometimes going, ‘Do I really need to add this long sentence that can be just three words?’ But I’m still me, so I’m not about to completely ditch the friendliness or the way I respond in my emails,” she said. “The point isn’t to sound warm or cold ― it’s just about knowing we don’t have to overdo it.”",
  "authors": [
    "Senior Lifestyle Reporter"
  ],
  "url": "https://www.huffpost.com/entry/these-women-are-writing-emails-like-a-man-and-its-hilarious_l_672121d4e4b0b049cc423ec7?origin=life-feed"
}