{
  "title": "“El sueño (La cama)” de Frida Kahlo se subasta por US$ 54,7 millones y se convierte en la obra más cara creada por una mujer",
  "text": "CNN Español —\n\nUna de las pinturas más enigmáticas de Frida Kahlo alcanzó un récord histórico al venderse por US$ 54,7 millones en la subasta de arte surrealista de Sotheby’s en Manhattan, Nueva York. La obra, que retrata a la artista dormida bajo el dosel de una cama mientras un esqueleto flota sobre la estructura, fue adjudicada en minutos durante la puja.\n\nTitulado “El sueño (La cama)”, el autorretrato fue pintado en 1940, un año tumultuoso en la vida de Kahlo marcado por el dolor físico, la inestabilidad de su matrimonio con Diego Rivera y su constante reflexión sobre la vida y la muerte. La pintura refleja su fascinación por el mundo de los sueños y la fragilidad de la existencia, un tema recurrente en su obra, según la nota de catálogo de Sotheby’s.\n\n“El esqueleto suspendido a menudo se interpreta como una visualización de su ansiedad por morir mientras dormía, un miedo muy plausible para una artista cuya existencia diaria estuvo marcada por el dolor crónico y traumas pasados”, dice la casa de subastas.\n\nLa cama fue un motivo recurrente en la obra de Kahlo porque durante años estuvo confinada a ella, mientras lidiaba con dolores crónicos, tras el accidente de autobús que casi le cuesta la vida y las numerosas cirugías que le siguieron. Durante su larga recuperación, su familia instaló un caballete adaptado y colocó un espejo en el dosel para que pudiera seguir pintando acostada.\n\nPara muchos, Kahlo es considerada una artista adelantada a su tiempo, una visionaria e incluso una rebelde que revolucionó la cultura no solo a través de su pintura, sino también con su incursión a la política, su libertad sexual, y la transgresión desde su cuerpo y enfermedades. La fama de la artista creció aún más con la película de 2002 protagonizada por Salma Hayek, que dio a conocer su vida y su legado a nuevas generaciones.\n\nPersonas observan el último autorretrato de busto de Frida Kahlo, “Diego y yo”, en Sotheby's el 5 de noviembre de 2021 en la ciudad de Nueva York. ANGELA WEISS/AFP/Getty Images\n\n“Su personalidad ha sido adoptada como una de las banderas del feminismo, de la discapacidad, de la libertad sexual y de la cultura mexicana”, dice una semblanza suya del Museo de Frida Kahlo.\n\nCon esta venta, “El sueño (La cama)” se convierte en la obra más cara de una mujer artista, superando el récord previo de Georgia O’Keeffe. Kahlo ya tenía otro récord en subastas con “Diego y yo”, un autorretrato de 1949 que alcanzó $34,9 millones en 2021.\n\nLa pintura viajará próximamente a varias exposiciones internacionales, entre ellas “Frida y Diego: El último sueño” en el MoMA de Nueva York (2026), “Frida: La construcción de un ícono” en la Tate Modern de Londres (2026-2027) y muestras en Basilea, Bonn y Helsinki hasta 2028.",
  "authors": [
    "Rocío Muñoz-Ledo"
  ],
  "url": "https://cnnespanol.cnn.com/2025/11/20/cultura/frida-kahlo-subasta-sothebys-orix"
}