{
  "title": "Make Your Most Beautiful Thanksgiving Yet",
  "text": "Credit... Bobbi Lin for The New York Times. Food Stylist: Rebecca Jurkevich. Prop Stylist: Megan Hedgpeth. Make Your Most Beautiful Thanksgiving Yet Andy Baraghani’s bright, brilliant menu is a feast for the eyes, too.\n\nAndy Baraghani’s bright, brilliant menu is a feast for the eyes, too.\n\nEvery year, I tell myself I’m going to keep Thanksgiving simple, and every year, I fail. Not in the frantic way, but in that way where “simple” quickly turns into “well, maybe just one more dish.”\n\nSo I’ve stopped fighting it. The cooking part is the best part. (I mean, I love my family, but I see them all the time.) It’s the one day that still feels deeply analog — everyone crowded in the kitchen, things bubbling, the air heavy with butter, thyme and my husband Keith’s ’90s-filled playlist. And as a food writer and recipe creator, cooking is what I do for a living — and how I find calm, even when I’m doing it for a crowd.\n\nThis year’s menu channels that desire for abundance. It’s in every way more — fresher, more colorful and full of texture, a table that enlivens rather than lulls — but it’s also manageable, whether you make one dish or all of them.\n\nCredit... Jonathan Bang\n\nThis isn’t a reinvention of Thanksgiving, but it is a reminder that the meal doesn’t have to feel like a rerun. The dishes are familiar, but they’ve been lightened, brightened, given a pulse. The turkey gets a sweet-tart pomegranate glaze that looks like lacquered mahogany. The mashed potatoes are tinted gold with turmeric and sharp Cheddar. Even the cranberry sauce, normally an afterthought, is finished with a drizzle of tahini that, you have to trust me, will make it the dish everyone’s talking about. It’s a mix of dishes that look good, taste even better and make the whole day feel like something worth celebrating rather than something to get through.\n\nAdvertisement\n\nThis year, I’ll be hosting in my new home in New York City, which adds a layer of stress, but mostly excitement. Keith is in charge of the table, flowers and most important, keeping me calm. My mother will be my right-hand in the kitchen. My in-laws will bring the wine and some boisterous New Jersey energy. If the turkey takes longer than expected, who cares! If the whipped cream’s too stiff, no one will notice. All the small things, they’re forgettable. There’s something bigger around this table that we’re here for, and that part is hard to mess up.\n\nThe Menu: Bright and Bold\n\nWhipped together, feta and yogurt turn impossibly light and pale green, before being finished with olive oil, pistachios and Aleppo chile, the perfect way to welcome guests.\n\nA glaze of reduced pomegranate juice, soy sauce, honey, herbs and garlic gives this bird its shine, and the browned-butter gravy, full of shallots and black pepper, can easily be made ahead.\n\nAdvertisement\n\nAt least one orange side is essential at Thanksgiving. Here, squash wedges are simply roasted, then layered over citrusy yogurt and finished with a chile crisp that hits sweet, salty and spicy all at once.\n\nThese mashed potatoes glow. Turmeric gives them their golden hue. Cheddar adds sharpness, and buttermilk keeps them bright and light.\n\nEqual parts vegetable and gratin, this dish of charred sprouts, lemony cream and a golden breadcrumb crust just feels right.\n\nAdvertisement\n\nWe’re swapping the stuffing out for rice, a Thanksgiving staple for my family (and maybe yours, too?). Long-grain rice is gently steamed with fresh chiles, ginger, garlic, shallots and coconut milk. It’s camouflaged with crispy kale chips and cilantro for a big green finish.\n\nJammy, garnet-red and scented with cardamom, this version relies on tahini to soften the tartness and beckon you back for another spoonful.\n\nA cake this good makes a strong argument for its presence next to the pies. Deeply spiced but not heavy, olive-oil rich but fluffy, and finished with salted maple cream that you can dollop into your post-dinner coffee, too.\n\n“This isn’t a reinvention of Thanksgiving, but it is a reminder that the meal doesn’t have to feel like a rerun,” Andy Baraghani writes.\n\nThe Plan: Calm and Strategic\n\nEven though I’ve hosted countless times, I know there will be stressful moments, but the entire holiday doesn’t have to be overwhelming. Give yourself time (and maybe dabble in some meditation). If you don’t have four days (totally understandable), watch our video on how to do it all in two.\n\nAdvertisement\n\nFour Days Before Thanksgiving\n\nYou’re in the honeymoon phase: hopeful, organized, slightly naïve. Go to the store while the markets are still calm (mornings!), grab the prettiest herbs you can find and clear your fridge.\n\nShop for all ingredients; organize produce, herbs and pantry staples.\n\nIf your turkey is frozen, begin thawing in the refrigerator.\n\nWash and prep kale and herbs; wrap in damp towels and refrigerate.\n\nIf you haven’t delegated wine and cocktail duty (you should), place a wine order or pick some up today.\n\nThree Days Before\n\nYou’re not doing much cooking yet. Relish it. This is a good night for takeout, going to dinner or seeing a movie.\n\nMake the green feta dip (keeps perfectly for three days).\n\nMake the chile crisp (without citrus zest) for the roasted squash.\n\nTwo Days Before\n\nThis is when things start to smell good while the kitchen gets slowly demolished.\n\nDry-brine the turkey and refrigerate uncovered.\n\nMake the honeyed cranberries (leaving the tahini off until just before serving).\n\nMake the pomegranate glaze.\n\nBake the olive oil pumpkin cake. Cool it completely, then wrap it tightly in plastic and store it at room temperature. (You’ll make the salted whipped cream on Thanksgiving Day.)\n\nAdvertisement\n\nOne Day Before\n\nThis is a highly productive day, but if you pace yourself, it’s also highly satisfying. You’ll wake up to a fridge full of promise and go to bed feeling like someone who has their life together.\n\nRoast the squash and refrigerate.\n\nMake the kale chips for the coconut pilaf and store in an airtight container.\n\nCook the brussels sprouts with the leeks and cream, then transfer to a baking dish, scatter the breadcrumb topping over (don’t bake yet), and refrigerate.\n\nPrep the vegetables for crudité (wash, cut, and chill).\n\nSet the table and organize linens, servingware and florals.\n\nMake the brown butter gravy for the turkey. Cover and refrigerate.\n\nThe Day Of\n\nAssuming you’re serving between 1:30 to 2 p.m.\n\n7 a.m.: Have a proper breakfast, that second cup of coffee or tea, and get the playlist going.\n\n8 a.m.: Make the mashed potatoes (without the chives). Keep covered in the pot to rewarm later over very low heat.\n\n9 a.m.: Cook the coconut pilaf. Keep covered in the pot to rewarm later over very low heat.\n\n10 a.m.: Take the turkey out of the fridge to come to room temperature. Drizzle tahini over the cooled cranberries, make the citrus yogurt for the squash and add the citrus zest to the chile crisp. Whip the salted maple cream in a stand mixer or by hand. Cover and chill until you are ready to top the cake.\n\n10:30 to 11 a.m.: Heat the oven for the turkey. Tidy the kitchen and reset your work space. Double-check platters, serving utensils and hot pads.\n\n11 a.m.: Put the turkey in the oven, and start roasting and glazing. Taste the green feta dip and adjust with a little lemon if needed, then set out for snacking, along with the crudité. Take five minutes to sit down before guests arrive.\n\nNoon: Guests arrive around now.\n\n12:30 to 12:55 p.m. The turkey should be done around now. Use tongs to tilt it slightly over the pan to let any juices run off before transferring to a cutting board and letting it rest (uncovered) for 30 to 45 minutes.\n\nRewarm the mashed potatoes and brown butter gravy on the stovetop over very low heat, stirring occasionally. Rewarm the coconut pilaf (covered) over very low heat.\n\n12:55 p.m. Transfer the brussels sprouts to the oven and bake until bubbling and golden. Spoon the citrus yogurt on a platter, layer the squash on top and finish with the chile crisp. Reheat the roasted squash in the oven for about 10 minutes or until warmed through.\n\n1:05 to 1:30 p.m.: Transfer the coconut pilaf to a serving dish, and scatter the kale chips and cilantro over. Transfer the warmed mashed potatoes to a serving dish and top with more butter, pepper and the chives.\n\n1:30 p.m.: Top off drinks, call everyone to the table and eat.\n\nWhenever: Top the pumpkin cake with the whipped cream, and finish with maple drizzle and flaky salt. Put a pot of coffee or tea on, and serve dessert.\n\nYou know what to do from here: Let someone else do the dishes.\n\nFollow New York Times Cooking on Instagram, Facebook, YouTube, TikTok and Pinterest. Get regular updates from New York Times Cooking, with recipe suggestions, cooking tips and shopping advice.",
  "authors": [
    "Andy Baraghani",
    "Bobbi Lin",
    "Rebecca Jurkevich",
    "Megan Hedgpeth"
  ],
  "url": "https://cooking.nytimes.com/article/andy-baraghani-thanksgiving-menu"
}