{
  "title": "Trump re-nominates billionaire Jared Isaacman to lead NASA",
  "text": "Posts from this author will be added to your daily email digest and your homepage feed.\n\nPresident Donald Trump has once again picked tech billionaire Jared Isaacman to be the next NASA Administrator, five months after pulling the initial nomination he made last year. Isaacman, an Elon Musk ally and commercial astronaut who has travelled into orbit twice as a civilian aboard SpaceX rockets, was reportedly withdrawn from consideration over previous political donations to Democrats, a day after Musk stepped away from the White House in May.\n\n“I am pleased to nominate Jared Isaacman, an accomplished business leader, philanthropist, pilot, and astronaut, as Administrator of NASA,” Trump announced on Truth Social. “Jared’s passion for Space, astronaut experience, and dedication to pushing the boundaries of exploration, unlocking the mysteries of the universe, and advancing the new Space economy, make him ideally suited to lead NASA into a bold new Era.”\n\nThe President did not acknowledge his former nomination of Isaacman, but did praise US Transportation Secretary Sean Duffy for his work serving as interim NASA chief since July. Likewise, Isaacman also doesn’t reference his previous consideration in his X post thanking Trump, saying it “will be an honor to serve my country under your leadership.”\n\n“The support from the space-loving community has been overwhelming,” said Isaacman. “I am not sure how I earned the trust of so many, but I will do everything I can to live up to those expectations.”\n\nIsaacman has donated more than $1 million to pro-Trump organizations in recent weeks, and Bloomberg reports that he has met with the President several times in person to discuss leadership plans for NASA. If Isaacman’s latest nomination is confirmed, he’ll assume command over a diminished version of the space agency, which has lost thousands of employees since July and faces enormous budget cuts that threaten to terminate two planned Mars missions.",
  "authors": [
    "Jess Weatherbed"
  ],
  "url": "https://www.theverge.com/news/814035/donald-trump-jared-isaacman-nasa-nomination"
}