{
  "title": "How To Talk To Your Children About Violence In Gaza",
  "text": "As the violence in Palestine continues to intensify, the images of war that have been perhaps the most challenging to process during the last couple of weeks are of the tiny, emaciated bodies of children who are struggling to survive. The death toll of children in Gaza is now believed to be over 18,000 since October of 2023.\n\nRegardless of where your politics fall, images like these are a jarring reality. Some of us, feeling both helpless and hopeless, cling to a grim hypothesis of how it all got this devastating. We attempt to help in ways that we’re able, one of those being spreading awareness and sending aid however possible. And to cope with what we see and read, we have therapists, friends and community members whose values align — whom we can feel the darkness with and process our feelings enough to function.\n\nBut what happens when our kids — specifically young people who scroll constantly — consume these images of children in Gaza? Receiving these images without much context is intense and overwhelming. Providing them support, though, can be a perplexing task for parents.\n\nAdvertisement\n\nHow, as a parent, do you even begin to explain why this is happening?\n\n“This is such a thorny question,” says Juli Fraga, a San Francisco-based clinical psychologist who specializes in loss, grief, and supporting parents in creating a safe environment to experience all emotions. “We want to be honest with our kids, but we don’t want to overwhelm them. Even an answer like ‘War is devastating, and it doesn’t make much sense why it happens’ might work, depending on your child’s age.”\n\nTo dig in a little deeper, find out what your child has consumed already. Tapping into their emotions is the best way to begin supporting them. “Children may not be able to put language onto emotions; if that’s the case, ask what they notice in their body,” Fraga tells me. “Tension in the shoulders or a stomach ache may be signs of anxiety, a rapid heartbeat and an impulse to run may indicate fear, and heaviness in the heart can be a sign of sadness.”\n\nHonor their feelings and validate them, she adds. Don’t shy away from the truth, but don’t overwhelm them. War is devastating, and it impacts everyone so remind them that it’s OK to feel sad, angry and scared.\n\nAdvertisement\n\nAnd when those feelings come up, it’s important to check in with yourself as a parent in order to be the best support system to your kid. “It’s also important for parents to honor their own emotions. When we’re not in a calm place, our distress can affect our kids,” Fraga says. “Our feelings matter, and it’s okay to feel sad, angry, or fearful. Distress puts the body on high alert, and calming the body with some deep belly breaths or a walk outside can be a great way to elicit relaxation, which helps us regulate tough emotions.”\n\nIt’s also wise to give yourself and your kids permission to take a media break. And if a child’s fear, anxiety or depression begins to affect their day-to-day life, seek additional support in the form of a school counselor or pediatrician.\n\nEspecially for young adults, channeling their strong feelings into something productive can help them feel less helpless. Research shows that we can harness the power of our anger to take action in helpful ways. Find charities to donate to, or a family in your community that’s affected and could benefit from support.\n\nAdvertisement\n\nFraga also suggests volunteering for a worthy cause or participating in peaceful protests. “Tweens and teens may also have opportunities to help at school — this probably depends on the school, especially right now — but some schools have affinity groups and spaces where kids can talk and come together to work on a project that propels change,” she adds.\n\nThrough it all, Fraga urges you to remember that your and your family’s feelings matter, and they’re absolutely valid, given the circumstances. “We can experience secondary trauma from witnessing so much suffering. We can also feel out-of-control,” she says. Find support in the form of mental health resources, school or spiritual communities. “We can’t suffer alone. We need each other.”",
  "authors": [
    "Huffpost Director Of Voices"
  ],
  "url": "https://www.huffpost.com/entry/talk-to-children-about-violence-gaza-war_n_689cd809e4b0185e88482fc6?origin=top-ad-recirc"
}