{
  "title": "‘It’s time for it to end’: the stars of Stranger Things open up about their final, epic season",
  "text": "How do you finish one of the biggest and most popular TV series of the last decade? Three years after season four came out, the fifth and final season of Stranger Things is about to make its way into the world. Millions of viewers are getting ready to find out what happens to the Upside Down and whether the plucky teens of Hawkins, Indiana can fight off Vecna for good, but it is early November 2025, and its creators Matt and Ross Duffer are finding it difficult to talk about. It’s not just because they’re feeling the pressure, or because the risk of spoilers and leaks is so dangerously high. It’s because the identical twin brothers from North Carolina are just not ready. “It makes me sad,” says Ross. “Because it’s easier to not think about the show actually ending.”\n\nA decade ago, hardly anyone knew what the Upside Down was. Few had heard of Vecna, Mind Flayers or Demogorgons. In 2015, the brothers – self-professed nerds and movie obsessives – were about to begin shooting their first ever TV series. Stranger Things was to be a supernatural adventure steeped in 80s nostalgia, paying tribute to Steven Spielberg and Stephen King. Part of their pitch to Netflix was that it would be “John Carpenter mashed up with ET”. Winona Ryder and Matthew Modine were in it, so it wasn’t exactly low-key, but it was by no means a dead-cert for success, not least because it was led by a cast of young unknowns. The first season came out in the summer of 2016, smashed Netflix viewing records, and almost immediately established itself as a bona fide TV phenomenon.\n\nA “would you rather” question for the brothers, then: would you rather have the demands of launching a brand new sci-fi series that nobody knows anything about, or would you prefer to try to stick the landing of a massive hit beloved by millions of viewers, knowing that every detail, every dollar spent, every character arc, will be scrutinised by an army of superfans?\n\nView image in fullscreen Facing up … (from left) Noah Schnapp and Jamie Campbell Bower in season five of Stranger Things. Photograph: Netflix\n\n“I would rather have the pressure of trying to stick the landing,” says Matt, after some consideration. In 2015, he and Ross had released their first and, to date only, feature film, a creepy, claustrophobic horror called Hidden. To their disappointment, it went straight to video-on-demand. “You can’t even watch it high definition right now,” says Matt. “So Stranger Things felt like we had been given this second chance, which a lot of people don’t get.” If that second chance hadn’t worked out, that would have been that. Now, he says, they are more secure. “Even if people don’t love the final season, I know that Ross and I will continue to be allowed to make things.”\n\nOn the other hand, he admits that it was fun to be the underdog. Ross agrees. “When we started, Netflix was an underdog, we were an underdog, and everyone loves a good underdog story,” he adds. “So it is a strange thing, 10 years later, to be the opposite of that. It’s a little surreal.”\n\n“We almost prefer to be uncool,” says Matt. “I don’t know how cool we are.” He laughs. “We’re still not cool.”\n\nIn Stranger Things, being uncool is the whole point. With it, the brothers have taken nerd culture fully into the mainstream. Dungeons & Dragons, which features heavily in the show, has experienced a huge growth in revenue since 2019 and a popularity not seen since its 1980s heyday. “I hope we made some of this nerdy stuff cooler,” says Ross. “You know, the show is ultimately about outsiders. When Matt and I were young, especially in high school, we were just making little movies, and we were in drama club, and we had trouble fitting in. We just felt very separate from everyone else, and it was a very scary time for us. So part of the goal of the show was just to go, no, there are people out there like you, and your differences are what make you cool.” Matt says that one character sums up that ethos in particular: Eddie Munson, season four’s metal-loving leader of the Dungeons & Dragons-playing Hellfire Club. “In many ways, we think of the show itself as Eddie, because Eddie is the person I wish had existed in high school, but did not exist.”\n\nSeason four, which came out in 2022, had a sizeable impact on pop culture. Running Up That Hill (A Deal With God) soundtracks a pivotal scene, when Max (Sadie Sink) finally escapes from the villainous Vecna in the Upside Down by using the song as a kind of anchor. The subsequent exposure gave Kate Bush her first UK No 1 single since 1978. “We had no idea it would go viral in the way that it did. We were surprised, and Kate was surprised, by how much it connected with younger people. Kate thought that was really cool,” says Ross. There is even more Running Up That Hill in season five.\n\nView image in fullscreen “She’s kind of scary”… Linda Hamilton as Dr Kay in season five of Stranger Things. Photograph: Netflix\n\n“Again, she’s been so great about it,” says Matt. Did she send a cake or flowers, to say thank you? “We did get a gift from Kate Bush, but it was way cooler than flowers,” says Ross. “It was this gilded bird cage with animatronic birds inside it, and you wind it up, and the birds chirp a little song. It’s very cool, very unique and very Kate Bush. Only Kate Bush would give this present.”\n\nHaving played no small part in celebrating the careers of 80s icons such as Ryder and Modine, the brothers recruited yet another movie legend for the final stretch: Linda Hamilton, AKA The Terminator’s Sarah Connor. Hamilton plays Dr Kay, a steely military scientist in charge of another mysterious laboratory. “We needed to sort our Dr Brenner replacement,” explains Ross (the evil government scientist met his end in the Nevada desert, as season four drew to a close). “And because this was the final season, we wanted someone intimidating, but in a very different way than Modine.” Hamilton is “super-highly intelligent”, so she is believable as the scientist, “but at the same time, Linda can shoot a gun, she can get in a fight, she’s tough, and that toughness was perfect for the final season”.\n\n“She’s kind of scary,” agrees Hamilton, calling from her home in New Orleans. Hamilton is famous for the physicality of her roles; as Sarah Connor, she is one of the all-time-greatest action heroines in movie history. Is there more action in Stranger Things? “There are a couple of real fightin’ moments,” she laughs. “I mean, I do walk into every stunt rehearsal and go: ‘I’m 68 years old! When do I get to not have stunt rehearsal?’” She has a stunt double, who was also her double on the last Terminator film. “But I’m carrying my own there. Doing at least half of it.”\n\nWhen Stranger Things came calling, Hamilton had been talking to her agent about retiring from acting altogether. “I had a hip injury, and I was in pain, and limping, and I couldn’t get an injection until I was getting ready to do a job,” she says. She told him she didn’t think she could do another TV show. “I just got really defeated there for a minute. And then he called me months later and said: ‘Stranger Things just called and asked if you’re free from June to June, and I said yes.’” She laughs. “We know each other so well. I did not hesitate to say, yes, let’s talk.”\n\nShe already loved Stranger Things, and admits to being a fangirl. Walking on set for the first time was “very overwhelming, quite frankly. I didn’t have a lot of time with the Duffer brothers. Everything is so overly large in that show, and they didn’t coddle. They trusted me to put a character together that was going to come alive on camera, but you don’t know if you’ve done the right thing until you’re halfway through that first day and go, yeah, yeah, yeah, I’m finding it.”\n\nView image in fullscreen Emotional rescue … Caleb McLaughlin and Sadie Sink in season five of Stranger Things. Photograph: Netflix\n\nDuring the bumper-length season four finale, a weakened Vecna managed to open another gate to the Upside Down, collapsing the barriers between the regular world and the shadow dimension and setting the scene for an ultimate showdown between good and evil. Season five sees the residents of Hawkins under military quarantine, jumping forward in time a little to November 1987. The show has always faithfully recreated the 80s, from the cars to the technology, right down to the food packaging. “A time that I’ve lived through!” says Hamilton. “My God, the 80s. My joke has always been that when a young actress comes up to me and says: ‘Knowing everything you know, what’s the most important thing for a young actress?’ I say: ‘Never go on film in the 80s.’” She laughs. “I know that a lot of people are enchanted by the 80s, but the 80s was not, to me, the greatest. So it’s really funny that here I am, at my age, playing someone back then, in that look.” The hair is large in the show. “The hair is very large.”\n\nThe trouble for Hamilton, now, is that she never watches herself on screen. As a fan, surely she will have to watch the final season to see how it ends? “No, I’m afraid not,” she says, a little sadly. “It’s terrible, but I don’t think I’ve ever seen anything I’ve done and wished I couldn’t do it again, and do a little bit more.” She refuses to put herself through it. “But I did get to read it, and be in the rooms with the actors during the readings and totally feel it.” She had the live-action experience? “Yes. It was amazing to be in that room for the final two episodes. Just, a blob of crying twentysomethings. It was really, really powerful to be part of that. Just a crying blob of children.”\n\n(I ask the Duffers if they feel good about ruining the ending of Hamilton’s favourite show by making it impossible for her to watch. “That’s what she’s saying,” says Ross. “She’s gonna watch the show! I know other actors who are in the show and watch it, but fast-forward through their scenes. I’ll try to convince her, because she has to watch it.”)\n\nskip past newsletter promotion Sign up to What's On Free weekly newsletter Get the best TV reviews, news and features in your inbox every Monday Enter your email address Sign up Privacy Notice: Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on theguardian.com to send you this newsletter. You can complete full registration at any time. For more information about how we use your data see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nView image in fullscreen End of days … Millie Bobby Brown and Finn Wolfhard in season five of Stranger Things. Photograph: Netflix\n\nBack in the present day, a considerable portion of that crying blob of twentysomethings are sharing breakfast. Caleb McLaughlin (Lucas), Gaten Matarazzo (Dustin), Finn Wolfhard (Mike) and Noah Schnapp (Will) are picking at fruit plates, discussing what it feels like to become a Halloween costume. On set, says Schnapp, he would entertain himself by trying to guess which scenes might eventually show up as costumes.\n\n“Like when we did the stuff in season four, where we dressed up in the ghillie suits, and I was wearing your bandana,” says Matarazzo, turning to McLaughlin. At the end of season four, the gang wears military gear to battle in the Upside Down. Look closely, and you’ll see Dustin with Lucas’ famous bandana over the top of his hoodie.\n\n“You were wearing my bandana?” says McLaughlin, sceptically.\n\n“Yeah!”\n\n“No you weren’t.”\n\n“Yes I was!”\n\nThey bicker like a family. The boys – though to call them boys is to tie them to the youth of their characters, as in real life they now range from 21 (Schnapp) to 24 (McLaughlin) – share the relatively rare experience of having grown up, on screen, in public, together. They were barely in double digits when they started work on Stranger Things. “When you’re younger, you tend to normalise weird situations around you,” says Matarazzo. “It’s not something you recognise as being peculiar until you’re a little older.” When they weren’t filming, Matarazzo attended a normal school in south Jersey where he grew up, which kept life steady for him. “It made a difference later on, but really, I always felt the most normal when I was with these guys. Even though it is a very weird environment, it was normal to me. It was normal to us. I felt the most comfortable when I was with them.”\n\nIt must be strange for them that Stranger Things is about to come to a close, having taken up almost half of their lives. “Playing these characters has been amazing, and I think their storylines have come full circle, and it’s time for that to end, right?” says McLaughlin. “But growing up with these guys, and having the family that we’ve built, is something I won’t get again. I’m gonna miss that a lot.”\n\nWolfhard is more introspective. He says they haven’t even seen the second half of season five, which will arrive in two further instalments, on Boxing Day and New Year’s Day. Any answers they give to my questions might change when they have. “So it feels weird to come up with surface answers, because the hard part, for me, is that it is a lot to process, and it is really emotional. There’s a lot of layers to it.”\n\nOn the last ever day of filming, Wolfhard says, everyone was there. “We can’t officially say what we shot, but yeah, we were all together on the last day.” This is not typical – on most series or films, actors finish their scenes at different times or even different days, and leave gradually. This was not the case on Stranger Things, says Matarazzo. “It was important to all of us that we were there for each other. There were people who had wrapped a few days or maybe even a week prior, who decided to stay and make sure that everybody was there for that last day. That was a very necessary experience. It’s been 10 years.”\n\nThe Duffer brothers had long known what the final scene of Stranger Things was going to be. When they began to work with writers on season five, they spent weeks and weeks on those last 30 minutes. “That’s where we started, because we knew that if we didn’t get those 30 minutes right, then it didn’t matter how much time and effort and quality was put into what preceded that. It wouldn’t matter,” says Matt. It was the first time they had worked that way, and when they were happy with the ending, they got started on the rest. “We were able to design it so that it would be building towards those last 30 minutes,” he explains.\n\nThen, for a split second, he echoes the many millions of fans who are all waiting patiently for its conclusion: “Hopefully, it works.”\n\nStranger Things 5 part one is released at 1am on 27 November, followed by three episodes on Boxing Day and the finale on New Year’s Day.",
  "authors": [
    "Rebecca Nicholson"
  ],
  "url": "https://www.theguardian.com/tv-and-radio/2025/nov/14/stranger-things-final-season-cast-interviews#comments"
}