{
  "title": "Button that dogs can push allows them control home appliances",
  "text": "Dog friendly button lets pets control appliances\n\n5 days ago Share Save Bev Rimmer Milton Keynes Share Save\n\nOpen University Kara the husky has been learning how to use a Dogosophy button\n\nA university has designed a switch that can be operated by dogs to control household appliances. The Dogosophy Button, developed by a team at the Open University in Milton Keynes, uses wireless technology and responds to pushing by a dog's nose or paw. The institute's Animal-Computer Interaction (ACI) Laboratory has tailored the device to suit a dog's perceptual characteristics. Its large blue press pad is easier for them to see, and the textured surface is suitable for a paw or snout to grip.\n\nThe device was originally developed so assistance dogs could switch on lights or kettles for their owners, but the button is now going on sale to the public. It means pets could learn to use the button for their own comfort, for example, to switch on a fan on a hot day.\n\nOpen University Prof Clara Mancini, pictured with Kara, is behind the development of Dogosophy\n\nProf Clara Mancini, who led on the product's design and research, said: \"Dogs, particularly those trained to support people, are asked to interface with an environment that is not constructed for them. \"We wanted to rethink this in a way in that would help dogs, so we studied how they interact with the world around them. \"They see blue well, so that's the colour of the button, and we put white casing around it to create contrast. \"It also needed to be wireless so it could be positioned where it would be most accessible for the dog to reach.\" Prof Mancini has trained her own dog, a husky named Kara, to use the Dogosophy Button. She said: \"The challenge with huskies is that they're not very biddable, whereas something like a Labrador is easier to train. \"If you catch a husky's interest, they will engage - otherwise, they won't.\"\n\nThe Dogosophy Button is on the market for £96, which includes VAT. Prof Mancini added: \"Humans have designed a world measured on themselves - we are taking over and pushing all other species out. \"We wanted to have something that was a bit of a statement to give dogs a bit of control over an environment that we haven't designed for them. \"It puts them a little bit more on par with us.\"\n\nFollow Beds, Herts and Bucks news on BBC Sounds, Facebook, Instagram and X.",
  "authors": [],
  "url": "https://www.bbc.com/news/articles/cdx40veg5kdo"
}