{
  "title": "Hands on with Ursa, a new keycap option for Topre keyboards",
  "text": "Posts from this author will be added to your daily email digest and your homepage feed.\n\nYour Happy Hacking Keyboard can finally get fresh caps.\n\nWhile regular keyboards have an embarrassment of keycap options, Topre boards like the HHKB or Realforce R3 don’t. They’ve more or less been relegated to OEM-profile PBT keycaps with dye-sublimated legends, in light grey, charcoal, white, or (recently) a few more colorful options. Something as basic as black keycaps with white legends just didn’t exist for unmodified Topre boards. Until now.\n\nRelated Your Happy Hacking Keyboard deserves some fresh caps\n\nUrsa is a new style of keycap for Topre electrocapacitive switches. I first wrote about them in April 2024, during the group buy, which was originally expected to ship in early 2025. Well, here we are, and here Ursa is, fashionably late but worth it. Preorders are shipping in November and extras go on sale at 5am Eastern time on October 30th.\n\nWhite-on-black spherical caps never go out of style. (The red and blue keycaps top right are not part of the set) Photo by Nathan Edwards / The Verge\n\nI’ve been typing on a near-final set of white-on-black Ursa caps for a couple of weeks now, and they’re as close to a must-buy for Topre users as any completely optional purchase can be. The scooped spherical caps are comfortable to type on, and the edges are well-defined without being too sharp. There’s just a bit of texture to the typing surface. The centered legends are crisp and well-aligned, and reminiscent of classic SA and DSA keycaps without being identical. The stems on my sample set don’t twist like other aftermarket caps I’ve tried. The bottom row is fully convex, like the space bar; it’s unusually comfortable and as far as I can tell it’s unique among keyboard profiles in that respect. It’s all just very well executed.\n\nThe Ursa caps are taller than the Leopold’s OEM keycaps, and their typing surfaces are spherical rather than cylindrical. The bottom-row modifiers are convex, not concave. Photo by Nathan Edwards / The Verge\n\nI’ve been using them on my Leopold FC660C because that’s what I have; you can see them on the more common Happy Hacking Keyboard over at Lightning Keyboards. The legends on the white-on-black keycaps will be slightly brighter than the ones on my samples, according to FKCaps’ Simon Tarchichi, but they’re otherwise identical to the final versions, which I’ll get when my preorder arrives.\n\nThe Ursa keycaps are available in cream-and-grey, in black with white legends (with optional red or blue modifier keys), and in a limited-edition retro-inspired brown, green, and cream. There are also blank versions of the classic and black colors.\n\nA pre-production render of the white-on-black caps. The final version looks nearly identical. The Classic color option (pre-production render). The limited-edition Minicom color (pre-production render). Black alphas and red modifiers (pre-production render).\n\nPricing for the extras is the same as during the group buy. It’ll cost $80 to cover an HHKB, or $120 for a tenkeyless or full-sized board. (You can get a full-sized set of blanks for $60 if you don’t need the legends.) There’s also a new $8 accent kit, in red or blue, with just an Escape and Enter key. The Minicom color is a limited edition, and Tarchichi tells me it won’t be restocked, but the company plans to keep the other colors available, and release new variants in the future, so don’t worry if you miss out on extras.\n\nI’m a big fan of Topre boards, and it’s great to have an affordable, high-quality keycap option that doesn’t involve taking your keyboard apart to make it MX-compatible. (Although that’s also getting better and less expensive in the very near future). As I said when the group buy launched, I’m not going to tell you to buy these keycaps. But I did.\n\nAnd I’d do it again.",
  "authors": [
    "Nathan Edwards"
  ],
  "url": "https://www.theverge.com/tech/809659/ursa-topre-keycap-hands-on-extras-sale"
}