{
  "title": "Fifty years after Bruce Haigh resisted apartheid, South Africa honours fearless Australian diplomat",
  "text": "The former Australian diplomat Bruce Haigh would rightly be proud of his inclusion on South Africa’s Wall of Names at the country’s Freedom Park, honouring those who resisted apartheid.\n\nBut the many who knew and loved Haigh, one of Australia’s least conventional but more effective and fearless diplomats, suspect he might also have been somewhat bemused that his name was being added to the wall on Friday at the same time as those of the former prime ministers Bob Hawke and Malcolm Fraser.\n\nFor Haigh, who died in 2023, held an abiding suspicion of most Australian prime ministers from Menzies to the incumbent, Anthony Albanese, and in his post-diplomatic life he used an acerbic pen as a commentator to enunciate countless reasons why.\n\nThat Albanese will be at the dedication service in Pretoria on Friday (he is attending the G20 summit) might also have brought a trademark luminous smile to Haigh’s face.\n\n“Instead of thinking through and independently acting in Australia’s best interests on the big issues, Albo has outsourced defence and foreign policy to the US and in so doing is doggedly and dumbly following in the footsteps of his discredited predecessors,” Haigh wrote a couple of weeks before his death.\n\nSign up: AU Breaking News email\n\nIt was never invective that impelled Haigh, but passion and a fearless quest for justice for the oppressed and less fortunate. Those qualities marked his service in South Africa as second secretary in the Australian mission from 1976 to 1979 and which are being memorialised by his inclusion on the Wall of Names.\n\nHaigh was quick to form a close relationship with the Black Consciousness movement. He was the first foreign diplomat to meet its leader, Steve Biko, a “banned person’’ under apartheid’s racist laws, who was beaten to death in a prison cell in 1977.\n\nIn his confidential cabling to Australia, Haigh assiduously outlined the racism underpinning apartheid. But he later told many friends and confidants he was perpetually frustrated at the blind eye with which his diplomatic seniors and political masters too often responded. (The same went for his later time in Jakarta and Canberra, when he reported tirelessly on Indonesian atrocities in East Timor.)\n\nHaigh used his diplomatic immunity to help activists opposed to apartheid – including the Biko family’s lawyer Sun Chetty – escape South Africa.\n\n“I was able to take messages around South Africa [for anti-apartheid activists]. I was able to shift people who were banned from one spot to another to meet with each other. I was able to take people across the border,” he later said.\n\nView image in fullscreen The Wall of Names at South Afirca’s Freedom Park. Bruce Haigh’s name is being added to the wall on Friday. Photograph: View Pictures/Universal Images Group/Getty Images\n\nThe prominent journalist and anti-apartheid activist Donald Woods was declared a banned person and committed to house arrest after criticising the regime in the wake of Biko’s killing. Haigh smuggled Woods across the border to Lesotho.\n\nA character based on Haigh was played by John Hargreaves in Richard Attenborough’s movie Cry Freedom.\n\nThe South African surveillance state naturally observed Haigh’s contact with the Black Consciousness movement. It tried to discredit him, including by planting a story in a malleable newspaper that Haigh had been seen at the home of Biko’s one-time partner Mamphela Ramphele wearing pyjamas.\n\nskip past newsletter promotion Sign up to Breaking News US Free newsletter Get the most important news as it breaks Enter your email address Sign up Privacy Notice: Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on theguardian.com to send you this newsletter. You can complete full registration at any time. For more information about how we use your data see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nHaigh apparently responded: “I never wear pyjamas.”\n\nHaigh’s superiors had no idea what he was up to and would not have condoned his actions.\n\nBut retrospect, after almost 50 years, brings clearer perspective – it is the Australian High Commission in Pretoria that nominated Haigh for the Wall of Names.\n\nThe commission wrote to his family: “Australia is proud of the courage, resilience and empathy Mr Haigh demonstrated. His legacy, including through ensuring the safety of struggle art he collected and donated to form the Ifa Lethu Foundation collection will live on.”\n\nAhead of Friday’s dedication service, Albanese said Hawke, Fraser and Haigh “displayed the best of who we are as Australians”.\n\n“They stood up for what was right and fought for equality and dignity.\n\n“Their belief that racial discrimination has no place in society, and courage to speak out on the world stage, helped contribute to the end of apartheid in South Africa.”\n\nOther names on the wall include liberation heroes Biko, Oliver Tambo, Helen Joseph, Albert Luthuli and Bram Fischer.",
  "authors": [
    "Paul Daley"
  ],
  "url": "https://www.theguardian.com/australia-news/2025/nov/21/bruce-haigh-australian-diplomat-apartheid-south-africa-honoured-wall-of-names-freedom-park"
}