{
  "title": "Carolina del Norte es el centro de la ofensiva migratoria de Trump. ¿Cuántos latinos hay, de dónde vienen, por quién votaron?",
  "text": "CNN Español —\n\nLa ofensiva del Gobierno de Donald Trump contra la inmigración ilegal no para en las grandes ciudades de Estados Unidos. Primero fue Los Ángeles, en el estado de California, y luego Chicago, en Illinois. Esta vez el objetivo del Departamento de Seguridad Nacional (DHS, por sus siglas en inglés) es Carolina del Norte.\n\nDesde el sábado, la administración de Trump comenzó la ofensiva migratoria en Charlotte, la ciudad más grande del estado, y este martes agentes federales de inmigración se encuentran en Raleigh, la capital de Carolina del Norte.\n\nEl Gobierno estadounidense dice que tiene “como objetivo a los inmigrantes ilegales delincuentes que acudieron en masa al estado de Carolina del Norte”. Más de 200 personas han sido detenidas en los primeros días de ofensiva en el estado. Sin embargo, según cifras del DHS, la mayoría es gente sin antecedentes penales.\n\nNegocios han cerrado. Los residentes viven con miedo. Y, como en otros casos más, la población latina es la más afectada, pues representan la comunidad extranjera más numerosa del estado.\n\nLa población latina en Carolina del Norte, en la mira\n\nSi bien el objetivo del Gobierno de Trump han sido los inmigrantes indocumentados —con y sin antecedentes penales—, los ciudadanos estadounidenses también han estado en la mira de la reciente ofensiva migratoria en Carolina del Norte.\n\nWilly Aceituno, ciudadano estadounidense de 46 años nacido en Honduras, iba camino al trabajo el sábado cuando vio “a muchos latinos corriendo”, perseguidos por “muchos agentes de la Patrulla Fronteriza”.\n\nAceituno dijo que él mismo fue detenido —dos veces— por agentes de la Patrulla Fronteriza. Durante el segundo encuentro, lo obligaron a salir de su vehículo tras romper la ventana y lo tiraron al suelo.\n\n“Les dije, ‘soy ciudadano estadounidense’”, contó a la agencia de noticias Associated Press. “Querían saber dónde nací, o no creían que fuera ciudadano estadounidense”.\n\nDespués de ser llevado por la fuerza a un vehículo de la Patrulla Fronteriza, Aceituno dijo que finalmente fue liberado tras mostrar documentos que probaban su ciudadanía. Tuvo que caminar cierta distancia de regreso a su auto y luego presentó un informe policial por el vidrio roto.\n\nVideo Ad Feedback Jardineros colgaban luces de Navidad cuando fueron abordados por agentes de inmigración en Carolina del Norte 02:42 • Fuente: CNN Jardineros colgaban luces de Navidad cuando fueron abordados por agentes de inmigración en Carolina del Norte 02:42\n\n¿Cuántos latinos hay en Carolina del Norte y de dónde vienen?\n\nCarolina del Norte es un estado que tiene una población estimada de poco más de 11 millones de personas, según datos de la American Community Survey 2024 de la Oficina del Censo de EE.UU.\n\nDe ese total, se estima que alrededor del 12 % de la población del estado (1.324.570 personas) es de origen hispano o latino. En pocas palabras, más 1 de cada 10 personas en Carolina del Norte es latina.\n\nLa nacionalidad que más prevalece en ese segmento de la población es la mexicana: más de 620.000 personas son originarias de México. En un lejano segundo lugar se encuentra la población de origen puertorriqueño, cuya población suma más de 150.000 personas en Carolina del Norte; en tanto, el tercer lugar lo ocupa la población originaria de Honduras, con casi 96.000 personas.\n\nEstas nacionalidades son las que más proliferan en el estado, pero hay miles de personas más de El Salvador, Guatemala, Colombia, República Dominicana, Cuba, Venezuela, Nicaragua. En el siguiente mapa puedes ver las cifras a detalle:\n\nPor otra parte, el Censo de EE.UU. estima que, de las 1.324.570 personas que conforman la población latina en Carolina del Norte, 1.093.166 nacieron en el extranjero (es decir, nacieron en sus países de origen y luego llegaron a Estados Unidos).\n\nDe ese total de latinos que nacieron en su país de origen y luego llegaron a EE.UU., unas 460.803 personas son ciudadanas estadounidenses, mientras que 632.363 latinos en el estado no son ciudadanos del país.\n\n¿Qué hay de Charlotte y Raleigh?\n\nLa población total de la ciudad de Charlotte —la más grande de Carolina del Norte— se estima en 943.474 personas, de acuerdo con el Censo de EE.UU. De ellas, unas 173.814 tienen origen hispano o latino.\n\nLo anterior quiere decir que alrededor de 2 de cada 10 habitantes en la ciudad son latinos, el doble que a nivel estatal.\n\nLas cinco principales nacionalidades de origen en Charlotte son:\n\nMexicana: 55.000 personas\n\nHondureña: 28.797\n\nSalvadoreña: 15.773\n\nPuertorriqueña: 12.499\n\nColombiana: 9.643\n\nPor su parte, Raleigh —capital de Carolina del Norte y epicentro educativo del estado— tiene una población total estimada de 499.637 personas, de las cuales 64.747 son de origen hispano o latino.\n\nEsto quiere decir que en Raleigh alrededor del 13 % de la población es latina, una tendencia similar a lo observado a nivel estatal.\n\nLas cinco principales nacionalidades de origen dentro de la población latina de la ciudad son:\n\nMexicana: 18.541 personas\n\nHondureña: 11.179\n\nPuertorriqueña: 10.356\n\nDominicana: 5.153\n\nGuatemalteca: 3.773\n\nVideo Ad Feedback \"Faltó la mitad de mis estudiantes [en clase]\", dice maestra que participa en protesta por redadas inmigratorias en Charlotte 02:14 • Fuente: CNN \"Faltó la mitad de mis estudiantes [en clase]\", dice maestra que participa en protesta por redadas inmigratorias en Charlotte 02:14\n\n¿Por quién votó la población latina en las elecciones de 2024?\n\nCarolina del Norte era uno de los estados clave para las aspiraciones presidenciales de los entonces candidatos Donald Trump (republicano) y Kamala Harris (demócrata).\n\nLuego de las elecciones de noviembre de 2024, Carolina del Norte se inclinó por Trump con el 50,9 % de los votos en el estado, mientras que Harris perdió la contienda con 47,6 % de los votos.\n\nLas encuestas de salida de CNN mostraron que la elección fue mucho más cerrada entre la población latina de Carolina del Norte: 50 % prefirió a Trump y 49 % a Harris.\n\nNo obstante, en cuestión de género, las mujeres latinas prefirieron ampliamente a Harris (60 % contra 30 % que se decantó por Trump), mientras que los hombres latinos se inclinaron de forma mayoritaria por Trump (62 % frente al 37 % de Harris en este sector de la población latina).\n\nLa anterior es una tendencia que se reflejó también a nivel nacional en las elecciones presidenciales del año pasado, cuando Trump logró afianzar el apoyo de la comunidad latina, sobre todo de los hombres.\n\nAunque el estado se pintó de rojo en la carrera presidencial, en las elecciones por la gubernatura el resultado siguió el mismo resultado de las últimas dos contiendas electorales: victoria para el Partido Demócrata. Jhon Stein ganó las elecciones con el 54,9 % de los votos frente al 40,1 % del republicano Mark Robinson.\n\nLas encuestas de salida de CNN indicaron que la comunidad latina prefirió mayoritariamente a Stein, sobre todo las mujeres.",
  "authors": [
    "Uriel Blanco"
  ],
  "url": "https://cnnespanol.cnn.com/2025/11/19/eeuu/carolina-norte-ofensiva-migratoria-trump-cuantos-latinos-charlotte-orix"
}