{
  "title": "Target may have hit rock bottom",
  "text": "New York —\n\nTarget’s problems are intensifying.\n\nIn the latest signal of trouble, the company reported sales dropped during its latest quarter, and Target cut its full-year profit guidance Wednesday. The company’s sales have stagnated for about four years, and Target said last month that it would cut 1,000 corporate employees, roughly 8% of its global workforce.\n\nTarget is betting that a new CEO and investments can spark a turnaround at the company. But Wednesday’s quarterly financial report showed there’s no quick fix to Target’s challenges.\n\nTarget has proven over and over that it is poorly positioned to succeed in this uneven economy, selling the wrong mix of items for an increasingly frugal customer. Target specializes in cheap chic clothing and home decorations, but fewer customers believe they can find the best prices and deals there.\n\nShoppers, strained by inflation, have shifted their spending to essentials and value items. They’ve switched to Walmart, Amazon, TJ Maxx and other chains instead.\n\nTarget’s stock slipped 1% during pre-market trading Wednesday. Shares have tumbled roughly 35% this year.\n\n“Target is really struggling and does not seem to be able to climb out of the hole it has dug itself into,” Neil Saunders, an analyst at GlobalData Retail, said in a note Wednesday.\n\nThe company has also faced intense customer backlash for its retreat on some diversity initiatives.\n\nEarlier this year, the company ended some of its DEI programs. The decision angered supporters of diversity and inclusion policies, who felt blindsided by Target. Customers online protested Target’s decision, and Target acknowledged its move hurt its sales.\n\nStore remodels and OpenAI partnership\n\nIn August, Target CEO Brian Cornell announced he was stepping down after 11 years at the retailer.\n\nSome industry analysts believed Target should bring in an outside voice to lead the company, but it opted for an internal candidate. Cornell will be replaced next year by Michael Fiddelke, Target’s current chief operating officer.\n\nHeading into the holiday season, Target said it dropped prices on 3,000 everyday products and foods, and it plans to have double the number of new items in its holiday product assortment than last year.\n\nOn Wednesday, the company said it will increase spending by 25%, to $5 billion, next year to remodel stores. Target also announced a partnership with OpenAI to let customers shop on Target in ChatGPT.\n\n“We’re acting with urgency to make the changes and investments to position Target for sustainable and profitable growth,” Fiddelke said on a call with analysts Wednesday.",
  "authors": [
    "Nathaniel Meyersohn"
  ],
  "url": "https://www.cnn.com/2025/11/19/business/target-stock-economy"
}