{
  "title": "French club Montpellier deny ‘particularly serious’ Mary Fowler racism claims",
  "text": "Montpellier have rejected allegations by Mary Fowler she received racist treatment while playing at the French club, denying she ever received bananas and reiterating their commitment to combating discrimination.\n\nThe Australian wrote in her memoir Bloom that in 2022 while other players leaving the club had received flowers, she and another black teammate received nothing, and they were subsequently given bananas by a teammate in the dressing room.\n\nMontpellier issued a statement in French saying they were shocked to hear of the accusations, some of which were “particularly serious” and “the resulting oversimplification, which portrays the club as a racist entity, is unacceptable”.\n\nThe club provided its own account of the matters in question, which they described as “unambiguous”.\n\n“On June 1, 2022, the women’s team played their final home match against Bordeaux. At the end of the match, as had been the custom for several seasons, two players whose contracts had expired and who had just worn the club’s colours for the last time were honoured with a bouquet of flowers.\n\n“This is neither the situation of Mary Fowler nor that of the teammate mentioned in her book, both of whom were still under contract with the club until 30/06/2023 and to whom it would therefore have been rather insensitive for the club to offer a ‘farewell gift’.”\n\nIn her book, Fowler said it was “quite well known” that she and her teammate would be leaving. “It wasn’t a secret that we weren’t happy there, so if anything it would’ve shocked people if we had re-signed,” she wrote.\n\nThe club also investigated the alleged incident that occurred in the dressing room. It said after consulting with people who were present that day, no evidence was found to corroborate Fowler’s claims.\n\n“Had such incidents been reported and substantiated, the club would have taken all necessary measures immediately upon being notified,” Montpellier said.\n\nskip past newsletter promotion Sign up to Sport in Focus Free weekly newsletter Sign up to Sport in Focus Enter your email address Sign up Privacy Notice: Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on theguardian.com to send you this newsletter. You can complete full registration at any time. For more information about how we use your data see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\n“Racism is a serious issue that cannot be exploited. The club wishes to reiterate its ongoing commitment to combatting all forms of discrimination.”",
  "authors": [
    "Jack Snape"
  ],
  "url": "https://www.theguardian.com/football/2025/nov/21/mary-fowler-montpellier-denies-racism-claims"
}