{
  "title": "Russell Tovey on pride, sexual power and politics: ‘The Green party slogan – make hope normal again – is what we need’",
  "text": "Russell Tovey’s best characters often seem to have it all together, typically as a barrier to further interrogation. Take his recent projects: in surreal BBC sitcom Juice, Tovey plays Guy, a buttoned-up therapist with a seemingly perfect life, hobbled by an aversion to recklessness. Then there’s the closeted Andrew Waters in award-winning American indie film Plainclothes, a well-respected married man of faith who secretly cruises New York shopping mall toilets. Even in the forthcoming Doctor Who spin-off, The War Between the Land and the Sea, Tovey’s character, Barclay, is an ordinary office clerk who is swept up into a planet-saving mission while trying to keep his family from falling apart. In each performance, Tovey anchors his characters with a beguiling mix of strength, empathy and vulnerability.\n\nIn interviews, the immaculately put together Tovey, 44, often seems similarly well-adjusted, speaking eloquently about his acting, his passion for art (he co-hosts the successful podcast Talk Art and has co-written three books on the subject) and his advocacy for the LGBTQ+ community. Flaws, if there are any, are carefully stage-managed.\n\nSo it’s mildly exciting to hear that ahead of our meeting in a central London restaurant, sequestered away in a maze-like confluence of newly constructed buildings, Tovey is apparently completely lost. A small dent in the armour, perhaps? While his PR goes outside to call him, I make a note of this slip-up in my phone. Minutes later, Tovey appears, smart-casual in a navy jumper, light blue shirt and intriguingly patterned trousers. His salt and pepper hair is cropped short and his matching facial topiary has been trimmed into a rakish goatee.\n\nView image in fullscreen Tovey in Doctor Who spin-off The War Between The Land And The Sea. Photograph: BBC Studios/Bad Wolf/Alistair Heap\n\n“I wasn’t lost,” he says, reading my phone – which is, to my horror, open right in front of him. The sprawling venue, he explains, has two entrances. Ah. I start amending the note. “No, it’s fine, you can say I was lost if you want to.”\n\nToday, Tovey is tired. His 13-year-old French bulldog, Rocky, woke him at 4.30am. “He had a seizure,” Tovey says, matter-of-factly. “He’s fine,” he adds, dampening my concern, before listing Rocky’s other maladies: “He’s completely deaf now. He’s got one eye. He’s in a [dog] pushchair. He has a little diaper.” Until recently, Rocky was part of a family unit that included Tovey’s fiance, Steve Brockman, one to which Tovey had said he was keen to add a child. The pair split in 2023. A baby, he says, is still an option “at some point. It’s just me and Rocky at the moment.”\n\nRocky has witnessed his owner’s career go stratospheric here in the UK and in the US. In 2022, Tovey landed a lead role in Ryan Murphy’s American Horror Story: NYC, before being cast by Murphy again in last year’s campy Feud: Capote vs the Swans. Earlier this year, Tovey played Brian Paddick, the former deputy assistant commissioner for the Metropolitan police, in the critically acclaimed drama Suspect: The Shooting of Jean Charles de Menezes, which laid out the police blunders that led to the killing of the innocent Brazilian in a London tube station.\n\nView image in fullscreen With Mawaan Rizwan in BBC sitcom Juice. Photograph: Liam Daniel/BBC/Various Artists Limited\n\n“I think I read somewhere that the best way of mastering a career is big, small, small,” Tovey says. “So you go big, punchy, and then you do these smaller, quieter things. You do films, and then you do something else, and it’s about that balance.”\n\nEarly in his career, which was kickstarted in 2004 playing Rudge in Alan Bennett’s The History Boys at the National Theatre, alongside James Corden and Dominic Cooper, Tovey was less selective. “When you’re a younger actor, you sort of go, ‘What am I doing next? Am I doing that? I’m doing that!’”\n\nWhat he was very clear about, however, was being visible as a gay man. He talked openly about his shame while growing up under section 28 (the Margaret Thatcher-era law that prohibited the “promotion of homosexuality”), and playing gay characters in shows such as HBO’s Looking and on stage in Angels in America. It’s why he’s so proud of Plainclothes, a film set in 1990s upstate New York at a time of undercover police entrapment of gay men.\n\nTovey is keen to point out the film’s relevance to 2025; shortly after its New York premiere a story emerged about US police using an app to catch men at Penn Station bathrooms. “Two hundred men have been arrested,” Tovey says, “and a proportion of those have been sent straight to ICE facilities with no trial. So something that felt like a historical document was suddenly highly contemporary, which was just bizarre. What this film is doing is humanising what people are trying to demonise, and that feels important.”\n\nView image in fullscreen With Tom Blyth in Plainclothes (2025), directed by Carmen Emmi. Photograph: Courtesy of Curzon\n\nWe talk about Plainclothes’s sweaty, car-based sex scene, which caused an online kerfuffle after Tovey was interviewed about it by his friend, Pedro Pascal (“Russell Tovey and Pedro Pascal agree that being ‘vers is the best’,” read one headline]). In the scene, the older, more experienced Andrew and younger police officer Lucas (played by Tom Blyth) ignore the binary of top and bottom and take on both roles. Tovey resists attempts to discuss online discourse around gay actors and the danger of them becoming neutered by endless memes and online infantilising (see the reaction to Jonathan Bailey in Jurassic World: Rebirth and the focus on his “whimsical” and “boyish” specs, quickly dubbed “slutty little glasses” by the internet). He is much more interested in the work.\n\n“The scene was so important to me because you’ve got power dynamics,” he says. “I was adamant that this had to be a wholesome interaction, it had to be safe sex, you have to see condoms – you know, it was 97. I said I want Lucas to go away from this interaction not feeling fucked up, not feeling damaged.”\n\nIn the film, Andrew is clear with the closeted Lucas that the sex is a one-off. “They’ve got this intense connection and it’s like an all-you-can-eat buffet,” Tovey says. “You go: I’ve got to pile my plate up with everything because they’re closing in 20 minutes.” Like the Harvester salad cart, I say. “Exactly! When you’d just get all the bacon bits back in the day, lettuce, blue cheese dressing, and you’re shovelling it on before they start wheeling everything away.”\n\nTovey clearly takes his responsibility as a visible gay man seriously. A few days before we meet, he accepted the man of the year gong at the annual Attitude awards, and gave a rousing acceptance speech that touched on transphobia within the LGBTQ+ community and the rise of Reform. “As a community, we really attack our own,” he says now, “and that’s deeply upsetting because united we stand, divided we fall. We look outside ourselves to go, ‘You need to be doing something,’ when actually within it we’re fractured. And that’s what they want.”\n\nHe offers an example. Earlier this year, in Los Angeles, Tovey was curating an exhibition by the German photographer Peter Berlin around the same time as Trump’s administration scratched three characters from the Stonewall monument in New York. “So it wasn’t celebrating LGBTQ+, it was just celebrating LGB,” Tovey says. Some older gay men, while talking about the queer community at the LA exhibition, parroted the shortened acronym. “I said, ‘Well, hang on a minute, you’ve missed a few letters off there,’” Tovey says. “I just thought how quickly people go: ‘Oh great, so they’ve gone, now it’s us.’” He sighs. “As a community, we have to kick outwards instead of punching inwards.”\n\nView image in fullscreen ‘Everyone should have therapy when they leave school’ … Russell Tovey. Photograph: David Levene/The Guardian\n\nHe says the general rise in transphobia, which he sees as the latest iteration of homophobia, is cyclical. “There’s this scapegoating that needs to happen. It feels like it’s the worst time in history for trans people right now.”\n\nAs for the threat of Reform – and twice-married, now separated Nigel Farage’s attack on the stability of gay marriage (“the most stable relationships tend to be between men and women”, Farage said earlier this year) – Tovey is suitably worried, but his concerns are broader. “I think all communities need to be prepared [for a possible Reform government],” he says. “I hope to God it doesn’t happen.” He has little faith in Labour stopping them and recently joined the Green party. “Their slogan – make hope normal again – is what we need,” he says. “It’s like Harvey Milk saying, ‘You’ve got to give them hope.’ We have to have hope. We’re on this really horrific curve but we will come out the other side eventually. We’ve just got to ride this out.”\n\nHe’s no politician, but you could imagine Tovey riling up a backbencher on Question Time. “I just care about people and my community,” he says, eschewing the label of role model in favour of “possibility model”, a term coined by Orange Is the New Black actor Laverne Cox. He likens people like Cox to lighthouses: “These beacons, that are shining a light going, ‘This way!’ Things are fucking rocky [so let’s] build more lighthouses and be that fucking light that shines out, so people can find you through this dark, cold water that we’re being plunged into.”\n\nView image in fullscreen As Brian Paddick in Suspect: The Shooting of Jean Charles de Menezes. Photograph: Stefania Rosini/Disney+\n\nStanding out comes with pressure, and there have been slip-ups. A decade ago, Tovey was criticised for perpetuating gay stereotypes after suggesting drama school students “prance around” being “effeminate”.\n\n“I don’t feel any pressure on it because I don’t think I’m a horrible person,” he says. “I just try to put out empathy and be as honest and authentic as I can be, and hope that connects.” His roles playing more masculine, straight-passing gay men – in Juice, Looking and the 2016 crime thriller Quantico – are not chosen with any specific intention, he says. “I’m just trying to find the truth of every character. I don’t consider how they present themselves in that capacity.”\n\nGrowing up in the 1980s, in the era of section 28 and the sex-equals-death rhetoric of the Aids crisis, Tovey was desperate for his own possibility model. As a kid growing up in Billericay, Essex, he covertly read magazines like Attitude – hidden at the time on the newsagents’ top shelves alongside “all the wank mags” – poring over stories that hinted at a queer joy a million miles away from his own shame.\n\nTovey came out at 18 and, like many young gay people, his identity was hurled at him like an insult. He’s ecstatic that a new generation of gay kids, growing up with shows like Heartstopper, with its depiction of young queer love, can at least see there’s hope. “They don’t consider death whenever they meet someone and go to bed with them,” he says. “It just doesn’t enter their mind and that, to me, just seems so healthy. I’ve been so mixed up with it for so long, for so many years.” Did he have therapy? “Yeah. Yeah, yeah, yeah,” he repeats. “I think everyone should have therapy when they leave school.”\n\nHis passion for acting emerged after gorging himself on films like The Goonies, Stand By Me and Home Alone one summer at the end of junior school. At a gymnastics class – “I was good at flips and cartwheels” – he happened upon a meet-and-greet with a local young actor starring in Grange Hill. “I could see a conduit to the dream,” he smiles. “So I switched from gymnastics to drama. I’d be at drama club every night, every weekend, going to drama camps. I was obsessed!” From there he got an agent and worked so much it interfered with school. After leaving at 16, he acted in local theatres before being cast in Howard Katz at the National Theatre in London, followed by his star-making turn in The History Boys on stage and in the 2006 film adaptation.\n\nView image in fullscreen With Jamie Parker, Dominic Cooper and Samuel Barnett in The History Boys (2006). Photograph: Tristram Kenton/The Guardian\n\nIt’s while discussing his early stage roles that Tovey finally reveals the dark truth beneath that put-together, gym-buffed exterior: he’s a massive nerd. All the plays he starred in at the start of his career, he tells me unprovoked, began with the letter H – Henry V, His Dark Materials, His Girl Friday, History Boys – and all the characters he played had names beginning with R. He rattles through it all with an infectious enthusiasm, eyes wide like saucers. “My life changed when I came out, but my life also changed when I came out as a geek and a nerd,” he smiles. “Everything, the whole world, the whole universe, was open to me.” Growing up he collected rocks and minerals, a few fossils. He owned a metal detector. “I was interested in all that, but would I tell anyone? Would I fuck!”\n\nHe now collects art, and talks enthusiastically about ceramics, rattling off names such as Lucie Rie, Florian Gadsby and Edmund de Waal. Does he make art himself? “I wanted to be Wolfgang Tillmans for a bit, so I bought an SLR camera and started taking pictures of my underwear hanging over a radiator, or socks on the stairs.” The results, he says, were “shit”. But that’s not the point for Tovey, whose default overview leans towards optimism. “That’s the pressure we put on ourselves – like, if I’m not brilliant at this, why am I bothering? But you can do anything you want if you enjoy it. You haven’t got to be great at it.”\n\nTovey, now slumped into the restaurant’s cream banquette, starts to wander back towards his favourite role as dog dad. Rocky is at home with the BBC World Service playing despite him being deaf, blissfully unaware of the world’s various storms. “He’s been my best friend in the world,” Tovey smiles, “and he’s seen me through so much. He’s just been there.” Like Tovey’s own unique lighthouse.",
  "authors": [
    "Michael Cragg"
  ],
  "url": "https://www.theguardian.com/tv-and-radio/2025/nov/17/russell-tovey-pride-sexual-power-politics-green-party-interview"
}