{
  "title": "‘Art can be a release’: how Black Girls in Art Spaces is bridging cultural gaps",
  "text": "On a warm Saturday evening in Jackson, Mississippi, about 30 people gathered at the Mississippi Museum of Art for the inaugural meeting of the Jackson chapter of Black Girls in Art Spaces. The intergenerational group enjoyed a tour of the exhibition Of Salt and Spirit: Black Quilters in the American South, which featured more than 50 quilts, made by Black, southern women, led by the exhibit curator, Sharbreon Plummer.\n\n“It was so timely that this show was up at the same time that they were planning this,” Plummer told the Guardian. “I thought there were so many ways that the show would resonate with people, in particular Black women, so it just felt like a beautiful way to bridge this inaugural moment with the histories and the legacies that were already here.”\n\nWhile the Jackson chapter met, other chapters of Black Girls in Art Spaces (BGIAS) met across the US, including in Birmingham, Alabama, San Francisco, California, and Richmond, Virginia. The organization was born in 2022, when Kaci Merriwether-Hawkins saw the importance of cultivating spaces in which Black women and girls could enjoy art. BGIAS hosts art-centric meetups and partners and collaborates with different organizations – most recently BlackStar film festival, AIGA Indianapolis, CreativeMornings Indianapolis, Afro Air festival and Dance Theatre of Harlem – to help participants attend various programming.\n\nNow, the organization has chapters across the country and world.\n\nAfter the tour, Plummer and Jasmine Williams, the co-curator of the Jackson chapter, engaged the women in a question-and-answer session, during which attenders had the opportunity to share their thoughts about the exhibit and the experience, and to listen as Williams asked Plummer specific questions about the work.\n\n“Sharbreon has created a space that is a homecoming and is about gathering and is about love,” Williams, who curated the Jackson event along with Maleah Briggs, said. “We’re carrying on that legacy. Even though we aren’t quilting, we are stitching together our lives and our experiences by sharing space.”\n\n\n\n\n\nView image in fullscreen BGIAS DMV chapter meetup in collaboration with Black Girl in Archives and curator Asha Abdul-Mujeeb at Langston Golf Course in 2025. Photograph: Jazmin Marshall\n\nWith new chapters regularly popping up – since the Jackson chapter was founded in April, BGIAS has expanded to Memphis, Tennessee – BGIAS is working to make arts scenes, which, for some, can be daunting spaces, more accessible. People who attend meetups or workshops hosted by the organization have the opportunity to gather with like-minded folks, in sessions led by people they may even know.\n\n“I understood what it was like to be Black in a predominantly white art space – I’ve experienced that as a consumer and a creator myself,” Merriwether-Hawkins said. “I was like, ‘It’s not enough to just show people where the art is, let’s help them get there, and, when they get there, let’s make sure that they’re comfortable while they’re there.’”\n\n‘Art can be a release’\n\nWhen Merriwether-Hawkins moved from Columbia, South Carolina, her home town, to Dallas, Texas, she would go to different art events and share her experiences online. Whenever she looked at the comments, there would inevitably be people saying things like: “How are you finding that?” or “I didn’t know this was in my city.”\n\nShe decided to begin creating “directory-like” content to help people find different places where Black art was highlighted. Making that type of content had an audience, Merriwether-Hawkins found, but it felt empty. She wanted to do more for herself and for the growing community she was cultivating.\n\nShe prayed about what she should do, and divine inspiration struck one night when Merriwether-Hawkins dreamed about Black Girls in Art Spaces. Initially, BGIAS started relatively small, with Merriwether-Hawkins pulling people together online who shared a common interest for arts and culture. In October 2022 , the organization hosted their first event at the Daisha Board Gallery in Dallas.\n\nAlmost immediately, people were interested in starting chapters elsewhere, Merriwether-Hawkins said. She created Instagram and TikTok pages for the organization. When the accounts would share images from various events, people would ask when BGIAS would host an event in their city or country.\n\n“Not only were we able to branch out to different cities in the US, but we were able to have meetups in places like Seoul, Korea, and London and Nairobi,” Merriwether-Hawkins said. “It was really just putting the word out there and allowing people to naturally gravitate towards it – I couldn’t ignore the call.”\n\nEach BGIAS meetup looks slightly different, as they are hosted by and crafted by local people for a local audience. But at their core, the meetups are spaces for Black women and girls to engage with art and feel comfortable in galleries which might sometimes feel like spaces in which they are not welcome.\n\nMerriwether-Hawkins likens BGIAS, which now has nearly 40 chapters, to a community cultivating a garden: she may have been the one to plant the seed, but other people are continuously pouring into it.\n\nAnd the need for such an organization is everywhere.\n\n“Art can be a release and just a time to find joy and some respite,” Williams said. “I think of this being an alternative space where we can just come together and see each other and feel each other and hold each other.”\n\nEvery chapter puts its own spin on what the events will look like, Merriwether-Hawkins said.\n\nIn New York, in partnership with the Dance Theatre of Harlem, BGIAS offered 20 tickets to an 11 April performance for community members. Birmingham’s chapter hosted Poetry at the Museum, during which attenders enjoyed pop-up poetry and a tour of the museum. The global BGIAS community was able to virtually attend Giving Flowers: A Floral Tribute to Black Women in Art, during which people participated in a guided floral arrangement workshop to honor Alma Thomas, the late abstract artist and teacher.\n\n“Our goal is to champion Black artistry wherever it’s being showcased, so if there’s an event, a showcase, a studio visit that we can attend, a performance, we want to be there,” Merriwether-Hawkins said. “We have been able to really go outside of the box of what people think art is, and we’ve been able to showcase all of the different facets and avenues that the art world has.”\n\nThis expansive view of art and experiencing art is key for BGIAS, she said.\n\n“I want to continue to build bridges between Black women and the art world, of course, but I also want to continue to help Black women find their people and to be able to find comfort in these spaces,” she said.",
  "authors": [
    "Adria R Walker"
  ],
  "url": "https://www.theguardian.com/artanddesign/2025/jul/22/art-black-women-bgias-events"
}