{
  "title": "Hyper-competitive people with time and money to spend: Why professional athletes love to gamble",
  "text": "With per diem money burning a hole in their pockets, they’d hop on charter flights, head to the back of the plane and start shuffling the cards. Usually, they’d play poker, sometimes bourré but almost always some sort of card game for money.\n\n“And by the time the plane hit the ground,’’ chuckles one former NBA player who still works in the league and asked not to be identified, “your per diem would be gone. God forbid it was a 10-day trip.”\n\nTo understand how professional athletes are getting caught in the crosshairs of illegal gambling activity, it helps to understand their culture. Theirs is a world consumed by competition and hyper-competitive people who have disposable income and time on their hands.\n\n“It is,’’ said an NBA scout who asked not to be identified, “a perfect storm.’’\n\nMany fans shook their heads when details about two alleged gambling schemes broke in recent weeks. The first resulted in the arrest of a current NBA coach – Chauncey Billups, a Hall of Famer – and current player Terry Rozier. Billups is accused of allegedly conspiring with noted New York crime families to rig poker games and fleece unsuspecting participants out of thousands of dollars. Rozier allegedly intentionally tipped bettors off about his game participation, allowing them to profit off of prop bets that involved him.\n\nThe second involved Cleveland Guardians pitchers Luis Ortiz and Emmanuel Clase. Both men are accused of allegedly working with co-conspirators to throw specific pitches in Major League Baseball games, coordinating with corrupt bettors to rig prop bets. The bets are alleged to have won $400,000 for bettors and Ortiz received $12,000 and Clase at least $60,000 for their roles in the scheme, according to the federal indictment.\n\nWhy would players making hundreds of thousands of dollars, if not millions, take part in an alleged gambling scheme that only amounted up to a fraction of their salary? Why take that risk?\n\n“The game fixing, the integrity of the game, that part makes no sense to me. None of it does,’’ one scout tells CNN Sports. “And Chauncey Billups, he’s got millions. But I guess maybe he needs the action? That’s the thing. It’s kind of who they are, and now there are just so many outlets.’’\n\nAthletes’ hard wiring – their need to win at everything – is what makes them better than the rest of us mere mortals. Yet that same compulsion to compete, that adrenaline rush, is also what makes gambling so alluring.\n\nRutgers University’s Center for Gambling Studies recently cross referenced 56 studies done on gambling and discovered that 78.9% of those studies concluded athletes gambled at higher rates than non athletes and 75% found that athletes were more likely to gamble than their non-athletic peers.\n\n“I can stop gambling,’’ Michael Jordan told Connie Chung in a 1993 interview, when his own casino escapades came under scrutiny. “I have a competition problem, a competitive problem.’’\n\nThis is not to say that all – or even most – athletes slip into the shady underworld uncovered in recent federal indictments or worse, shave points or fix games. Nor is it to excuse the behavior of those who have been accused.\n\nBut for those who can’t comprehend how such a thing could occur, it helps to see just where the slippery slope might start.\n\n“These guys, they’re not going to sit around and read a f**king book,’’ the former scout said. “The game fixing? That surprises me, but the poker stuff? Not at all. You’re at a pre-game shootaround and someone says, ‘$100 I can make this shot.’ And they start at halfcourt, or three-quarters court. And they all get in.’’\n\nCards and culture\n\nCard games have long been the pastime of the people who play America’s pastimes. Tony Kubek once told the Record of New Jersey about the 36-hour train rides he took with the New York Yankees in his MLB rookie season.\n\n“You talk about poker games – $100 bills on the table and this was in an era when the good players were making $25,000,” he told the paper.\n\nKubek made his debut in 1957.\n\nMore than 20 years ago, long-time friends Charles Oakley and Tyrone Hill got into a beef over a gambling debt owed by Hill to Oakley, reportedly in the tens of thousands of dollars. Frustrated that he hadn’t been paid, Oakley, then with the Raptors, leveled a ball at Hill’s head during a pre-game shootaround between Toronto and the Philadelphia 76ers. Oakley got slapped with a $10,000 fine.\n\n“Hey you borrow money from the bank, they charge taxes,’’ Oakley later told GQ about the incident. “You don’t pay the IRS, they come and get you. So I had to come get him.’’\n\nOakley and Hill’s spat went public; the bad blood stemming from the seemingly innocuous games was not, however, limited to just that pair. More than a few coaches, in fact, grew tired of the infighting and stopped the games – or the ones they knew about.\n\n“You don’t really see them so much anymore,’’ a former NBA executive told CNN Sports.\n\nCleveland Guardians pitcher Luis Ortiz departs the US District Court for the Eastern District of New York after his arraignment hearing on November 12 in Brooklyn. Michael M. Santiago/Getty Images\n\n‘They drop $20,000 and think nothing of it’\n\nBut it is impossible to stop gambling. It is, for starters, legal for people older than 21 and permissible in every state save Utah and Hawaii. Sports gambling is permissible now in 38 states. All four major professional sports – the NHL, NFL, MLB and NBA – have strict rules on betting on their own sports but only the NFL prohibits players from gambling while on the road in team hotels and from entering a sportsbook during the season. League rules also stipulate that coaches, staff and personnel cannot bet on any sports.\n\nAnd gambling is everywhere. Of the 27 cities that sponsor NBA franchises, 17 have casinos in or near their city’s downtown.\n\n“You ask any security guard,’’ the scout said. “Some of these guys, they go over to the casino and they drop $20,000 and think nothing of it. Because it’s not a lot to them. It’s not about the money. It’s about winning.’’\n\nThe NBA Summer League is held in Las Vegas where it’s not unusual, the former exec says, to see players frequent the blackjack or craps tables on the Strip.\n\n“And we’re not talking the $10 tables,’’ he says. “We’re talking the big-money tables.’’\n\nOf course, the advent of online betting means no one even needs to leave their rooms.\n\n“Gambling, with DraftKings and FanDuel, it’s everywhere now,’’ says former Major League outfielder Jayson Werth. “It really is part of the culture.’’\n\nThe hook of horse racing for a retired star\n\nA self-described “competitive junkie’’ who had to win in backyard Wiffleball games and pickup hoops, Werth felt the void of competition hit like a gut punch when he retired in 2018. Though he is quick to point out that he cannot comprehend how any professional athlete would engage in fixing games – “To try and lose? That isn’t even in the realm of possibility. You’re trying your best to win,’’ he told CNN Sports – he does understand what it’s like to feed the need to win.\n\nWerth tried the post-career life of leisure, signing up for pro-am golf tourneys. He dabbled in quirky investments, including organic racing, but nothing quite worked. He wasn’t lost but slightly unmoored.\n\nAnd then he went down to Tampa to visit a friend, Rich Averill. The two went to Tampa Downs to watch a race involving a horse that Averill owned. Standing on the rails, a very familiar adrenaline rush coursed through Werth.\n\n“I was hooked,’’ he said.\n\nHe could have done it the easy way – studied the racing form and hit the windows – but Werth realized the difference was ownership. Being all in on the horse as a financial investor meant being personally invested.\n\nHe partnered with some friends to form Two Eight Racing (he wore number 28 in his pro career) and set up immersing himself in the business of horse racing. He learned about bloodstocks, researched trainers and showed up regularly at the barn to meet and greet his own horses.\n\nHe admittedly got a little lucky – his first big horse, Dornoch, won the Belmont Stakes and his second, Flying Mohawk, made last year’s Kentucky Derby field – but he realized he didn’t need to win to feel what he needed to feel.\n\nThat led him to branch out to form Icon Racing, a horse racing syndicate that allows partial owners to experience full-time ownership. It’s open to everyone but Werth has personally tried to lure his fellow athletes.\n\n“I get it,’’ he said. “We need something. I played with guys who would bet you $100 if a penny was going to land on heads or tails. You’re raised to compete your whole life so that’s what you do. You compete.\n\n“But when it’s gone? It’s gone. I don’t think I realized how much of an itch that was until I couldn’t scratch it.”",
  "authors": [
    "Dana O Neil"
  ],
  "url": "https://www.cnn.com/2025/11/18/sport/sports-gambling-professional-athletes"
}