{
  "title": "Felipe Massa’s £64m claim over Crashgate can go to trial, rules judge",
  "text": "Felipe Massa’s £64m claim against Formula One, its governing body, the FIA, and Bernie Ecclestone over Lewis Hamilton’s first F1 world championship in 2008 can go to trial, a high court judge has ruled.\n\nMassa claims he is the rightful champion as the Brazilian eventually lost by a single point after Nelson Piquet Jr had deliberately crashed at the Singapore Grand Prix. Ecclestone, who was F1’s impresario for four decades before he was deposed in 2017, suggested in 2023 that the sport’s executives were aware of the cover-up – which became known as Crashgate – before the 2008 campaign concluded. The 95-year-old Ecclestone, the FIA and Formula One Management are defending the claims.\n\nLast month, they asked the court in London to throw out the case, saying that Massa performed poorly at the 2008 Singapore Grand Prix, ultimately leading to him losing the championship, and arguing that the claim had been brought too late.\n\nIn a written judgment handed down on Thursday, Mr Justice Jay said the case could go ahead. He said that Massa had “no real prospect of establishing that the FIA’s duties were owed to him”, but that “he does have a real prospect of proving at trial all the components of his unlawful means conspiracy”. “The same analysis applies to the inducement claim,” Jay said.\n\nIn the ruling, he dismissed part of Massa’s claim, saying he had “reached the firm conclusion that it is clear that declaratory relief would not be granted in this case”.\n\n\n\nAt a hearing in October, the court heard that as part of his claim, Massa was also seeking various declarations regarding the FIA’s conduct. Jay said: “In my judgment, Mr Massa is not entitled to claim declaratory relief for reputational or publicity reasons.\n\n“The present claim cannot, of course, rewrite the outcome of the 2008 drivers’ world championship, but if declaratory relief along the lines sought were granted that is how Mr Massa would present his victory to the world and it is also how it would be perceived by the public.\n\n“The second declaration is in the terms that were it not for the FIA’s breaches of duty, Mr Massa would have won the championship: in other words, that he should have won the championship. The FIA, as an international sporting body outside the reach of this court, could and would simply ignore any such declaration.\n\nView image in fullscreen Ferrari’s Felipe Massa celebrates claiming pole position at the Marina Bay Circuit Park in Singapore in 2008. Photograph: David Davies/PA\n\n“That underscores its lack of practical utility, but the declaration comes too close in my view to impinging on the right of the FIA to govern its own affairs.”\n\nAt the 2008 Singapore Grand Prix, Renault staged a win for Fernando Alonso by ordering Piquet to crash, which brought out a safety car and meant Massa, who was leading the race for Ferrari, finished in 13th after his strategy was compromised. The following season, Piquet revealed he had been under instruction by his bosses to crash deliberately.\n\nMassa’s lawyers claim Ecclestone knew the crash was deliberate and that he and the FIA failed to investigate it. At the October hearing, Nick De Marco KC, for Massa, said in written submissions that the defendants could not “establish that Mr Massa’s claims have no real prospect of success”.\n\nQuick Guide Toto Wolff sells part of Mercedes stake for £230m Show Mercedes boss Toto Wolff has sold his 15 per cent stake in the Formula One team to American billionaire George Krutz. Wolff, who owns one third of Mercedes, will remain as CEO and team principal, and is in Las Vegas for this weekend's race. The 53-year-old Austrian is set to earn close to £230million from the sale in a deal which values Mercedes at £4.57bn - a record for an F1 team. Krutz, the 55-year-old CEO and founder of cybersecurity company Crowdstrike - which currently sponsors Mercedes - becomes a co-owner of the team through his acquisition of Wolff's minority interest making his share five per cent. Kurtz also joins the team's strategic steering committee alongside Mercedes group chairman Olla Kallenius and Ineos chief Sir Jim Ratcliffe. Wolff, who oversaw six of Lewis Hamilton's record-equalling seven world championships said: \"George's background is unusual in its breadth: he's a racer, a loyal sporting ambassador for Mercedes-AMG, and an exceptional entrepreneur. \"He understands both the demands of racing and the realities of building and scaling technology businesses. That combination brings specific insight that is increasingly relevant to the future of Formula One.\" Mercedes won eight consecutive constructors' world championships between 2014 and 2021. They are second in the standings with three rounds remaining. George Russell has won two races so far this year. PA Media Was this helpful? Thank you for your feedback.\n\nAdding that Massa had “a real prospect of succeeding on all of the grounds”, he said the matter should go to a full trial.\n\nDavid Quest KC, for Ecclestone, said Massa’s claims were “a misguided attempt to reopen the results of the 2008 F1 drivers’ championship”. John Mehrzad KC, for the FIA, said Massa’s claim is “torturous as it is overly ambitious” and “conspicuously overlooks a catalogue of his own errors”. Anneliese Day KC, for Formula One Management, said in written submissions that the claim would “fail”.",
  "authors": [],
  "url": "https://www.theguardian.com/sport/2025/nov/20/felipe-massa-claim-2008-f1-title-trial-formula-one"
}