{
  "title": "Exclusive: Iran open to resuming nuclear talks with the US but won’t shift conditions, supreme leader’s adviser says",
  "text": "Tehran, Iran —\n\nIran is willing to resume nuclear talks with the United States if they are conducted respectfully, a senior Iranian official told CNN on Tuesday, while insisting Tehran will not move from the position it held before the US and Israel attacked it in June.\n\n“They have to make the first move to show that they are ready to engage with us on the conditions that we put… it has to be based on equal footing and mutual respect,” said Kamal Kharrazi, foreign policy adviser to Supreme Leader Ayatollah Ali Khamenei, in an exclusive interview with CNN from Tehran. “The agenda would be prepared in advance to ensure the clarity of substance and the process of discussions.”\n\n“Unfortunately, President (Donald) Trump does not believe in diplomatic engagement but rather prefers to use force to achieve his objectives,” he added.\n\nLater on Tuesday, Trump said that Iran is “very much” signaling interest in striking a deal with the US over its nuclear program.\n\n“They’d like very much to make a deal with us, and they call us, and we’ll end up probably doing that, that’s Iran,” Trump said in a room filled with high-profile guests at a White House dinner honoring Saudi Crown Prince Mohammed bin Salman.\n\nThe president’s comments echoed remarks he made earlier in the day, when he indicated he was open to pursuing negotiations.\n\nUS President Donald Trump addresses the nation, alongside Vice President JD Vance, left, Secretary of State Marco Rubio and Secretary of Defense Pete Hegseth, from the White House on June 21, following the announcement that the US bombed nuclear sites in Iran. Carlos Barria/Pool/AFP/Getty Images/File\n\nKharrazi indicated that Iran’s conditions for a rapprochement with Washington have not changed since the US and Israel struck its nuclear facilities in June, adding that uranium enrichment will continue because the country needs the fuel for its power plants and for medical purposes. Tehran’s ballistic missile program, which he said is expanding, will also be off the negotiating table. “It is only the nuclear issue we will discuss with the United States,” he said.\n\nThe Trump administration and Iran were in the middle of talks to settle their dispute in June when Israel launched a surprise attack on Iran, eventually drawing in Washington, which carried out strikes on three Iranian nuclear facilities, the first direct US attack inside Iran.\n\nAlmost five months on, the damage to Iran’s nuclear facilities has yet to be assessed, Kharrazi said.\n\nOn Sunday, Iran’s Deputy Foreign Minister Saeed Khatibzadeh told CNN that despite serious damage to “infrastructure, machineries” and “buildings,” the country’s nuclear program remained “intact.” On the same day, Foreign Minister Abbas Araghchi said that no uranium enrichment was taking place “right now” because the country’s facilities had been attacked.\n\nDuring the Iran-US talks in the summer, Washington had insisted that Iran stop enriching uranium altogether, while Tehran was adamant about continuing domestic enrichment to a purity that cannot be used to build nuclear bombs. Highly enriched uranium is a key component of a nuclear weapon.\n\nKharrazi said the “degree of enrichment,” not enrichment itself, would be the focus of potential negotiations with the US.\n\nAsked if he is concerned about another military confrontation with the US or Israel, he said: “Everything is possible. But we are ready for that.”\n\nCNN reported in June that Washington had made a proposal for a nuclear deal under which the US would invest in Iran’s civilian nuclear power program and join a consortium that would oversee the enrichment of low-level uranium inside Iran for an unspecified amount of time. That potential consortium would be expected to include Middle Eastern nations and the UN’s nuclear watchdog, the International Atomic Energy Agency (IAEA).\n\nAt the time, Iranian officials repeatedly said they are open to the idea of an enrichment consortium but insisted Iran must be able to keep control of its own enrichment capabilities.\n\nAsked by CNN if there is room to reach an understanding with the US on Iran’s nuclear program, including on a potential consortium, Kharrazi said, “I think so.”\n\n“If there would be genuine negotiations between Iran and the United States, there are ways and means (of) how to ensure that Iran can continue its enrichment and at the same time assure the others that it’s not going to look for nuclear weapons.”\n\nKharrazi also had a message for Trump.\n\n“Start with a positive approach with Iran. If it will be positive, certainly it will be reciprocated. But for that, they (the US) have to refrain from any force against Iran,” he said. “They have tried that and they now understand that it’s not acceptable and it’s not workable.”",
  "authors": [
    "Frederik Pleitgen",
    "Abbas Al Lawati"
  ],
  "url": "https://www.cnn.com/2025/11/19/middleeast/iran-us-nuclear-talks-intw-intl"
}