{
  "title": "The Black Swan review – the nail-biting exposé that tore an entire country apart",
  "text": "As film-maker Mads Brügger explains at the outset of this four-part documentary series, a black swan is the name given to an event so extraordinary that you could never have seen it coming. In this case, Brügger’s black swan isn’t an event so much as a person: a lawyer named Amira Smajic, a “once in a lifetime” source for a journalist and the person who – he says – could “force us to rethink Danish society”. Smajic has spent years acting on behalf of some of the country’s most infamous criminal gangs, and is now exposing their activities as part of this major investigation for the state-owned broadcaster TV 2. Crucially, it’s not just the criminal underworld that Smajic is laying bare, but also their white-collar accomplices – the seemingly respectable businesspeople and lawyers unfazed by escapades involving dirty money and fraudulent invoices. It’s a co-dependent arrangement – one section of society “is feeding the other, and vice versa”, says Smajic.\n\nIt would be an understatement to say that The Black Swan made an impact on Danish viewers. Half of all Danes watched it when it aired in 2024, and it sparked a string of police investigations, as well as a tightening of laws around money laundering and gang activity. It has also turned the country’s almost prelapsarian vision of itself on its head. Brügger – a steely, often sandpaper-dry compere who has previously gone undercover in North Korea for the film The Red Chapel – claims making The Black Swan has shown him that the country could be “grim and dark”. Simply put: something was rotten in the state of Denmark.\n\nIt’s easy to see why the series has had such an impact. As well as the huge revelations it uncovers, the way The Black Swan unfolds often seems to go beyond the work of even some of the best Nordic noir dramatists. Our anti-heroine, Smajic, arrived in Denmark as a child refugee amid the Bosnian war. A legitimate career gave way to working with the mob, and she would go on to be dubbed the “ice queen” by her associates for her ruthless practices. And yet, as the series unfolds, Smajic uses those same practices to obtain a huge cache of evidence for Brügger and his team, often putting herself in seemingly imminent danger as she documents all manner of nefarious activities from a Copenhagen office rigged with hidden mics and cameras. While the production has arranged safety measures for Smajic during her six-month stint as their inside woman, it is still risky business. But as she explains, this could be her only way out of a life of crime that has become so innate to her being, and which she likens to being addicted to drugs.\n\nMany of the scenes that unfold defy belief, not least those that involve Fasar Abrar Raja, a Rasputin-esque former member of the Bandidos biker club whose rap sheet includes convictions for assault, possession of firearms and drug smuggling. His braggadocio and insolence slowly turn to something darker. By episode three, broadcast next week, he threatens to “crush [Smajic] with my bare hands”.\n\nEven where her clients are less outwardly menacing, many scenes are still unbelievable. Martin Malm – a man Brügger describes as “beyond a cliche of the Danish upper class”, with a taste for the high life and a love of naff Christmas jumpers – says openly that obfuscating his business affairs is like finding a cheat code for a video game.\n\nskip past newsletter promotion Sign up to What's On Free weekly newsletter Get the best TV reviews, news and features in your inbox every Monday Enter your email address Sign up Privacy Notice: Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on theguardian.com to send you this newsletter. You can complete full registration at any time. For more information about how we use your data see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nThe Black Swan can feel a little protracted; indeed, by the end of the first two episodes, we are still only a fraction of the way into the story. However, while episode three is also slow and meticulous, episode four is a heart-stopper of a finale that sees Brügger baffled by what is unfolding around him, as the team considers the possibility that the entire operation has become compromised. Without ever becoming too insider-y, it offers a glimpse into journalistic ethics at a crucial point in an investigation, and a masterclass in finishing a story that is spinning out of control.\n\n“It’s like being in a bad movie,” says Smajic, as she finds herself in an ever more precarious situation. Luckily, this bad movie makes for a nail-biting series, and one that emphasises the real-world impact that television can make.",
  "authors": [
    "Hannah J Davies"
  ],
  "url": "https://www.theguardian.com/tv-and-radio/2025/nov/18/the-black-swan-review-denmark-bbc-one-iplayer"
}