{
  "title": "El primer vistazo a “The Hunger Games: Sunrise on the Reaping” ya promete ser una locura",
  "text": "CNN —\n\nEn sus marcas, listos y… a esperar un año para que comience la acción de la nueva película de “Hunger Games”.\n\nLionsgate lanzó el teaser de “The Hunger Games: Sunrise on the Reaping” este jueves, y ofreció un vistazo a la historia de origen de Haymitch Abernathy, personaje interpretado en las películas anteriores por Woody Harrelson.\n\nJoseph Zada interpreta a una versión joven de Haymitch en esta precuela, que se sitúa veinticuatro años antes de los eventos de “The Hunger Games”.\n\nLa nueva cinta inicia la mañana de la cosecha de los 50° Juegos del Hambre, también conocidos como el Segundo Vasallaje de los Veinticinco, y la acción es intensa casi desde el principio.\n\nThe Hunger Games: Sunrise on the Reaping (2026) Official Teaser – Joseph Zada\n\nBasada en la querida serie de libros de Suzanne Collins, la franquicia cinematográfica se ha vuelto enormemente popular a nivel mundial.\n\nAdemás de Zada, la nueva película cuenta con las actuaciones de Whitney Peak, Mckenna Grace, Jesse Plemons, Kelvin Harrison Jr., Maya Hawke, Elle Fanning, Kieran Culkin, Glenn Close y Billy Porter, entre otros.\n\nRalph Fiennes interpretará al presidente Coriolanus Snow. Tom Blyth dio vida a una versión más joven del personaje en 2023 en “The Hunger Games: The Ballad of Songbirds & Snakes” y el fallecido Donald Sutherland originó el papel en “The Hunger Games” en 2012. Sutherland continuó interpretando al personaje en “The Hunger Games: Catching Fire” (2013), “The Hunger Games: Mockingjay – Part 1” (2014) y “Part 2” (2015).\n\nSutherland falleció en junio de 2024 tras una larga enfermedad. Tenía 88 años.\n\nDirigida por Francis Lawrence, “The Hunger Games: Sunrise on the Reaping” llegará a los cines el 20 de noviembre de 2026.",
  "authors": [
    "Lisa Respers France"
  ],
  "url": "https://cnnespanol.cnn.com/2025/11/20/entretenimiento/primer-vistazo-hunger-games-sunrise-on-the-reaping-trax"
}