{
  "title": "Ukraine banned from Nato, Russia readmitted to the G8 and territory ceded: what’s in Trump’s draft plan",
  "text": "Donald Trump’s latest plan for ending the war in Ukraine would see territory ceded to Russia, Russia readmitted to the G8 and Ukraine banned from joining Nato, according to drafts of the proposal seen by Axios, AFP and the Associated Press.\n\nUkrainian president Volodymyr Zelenskyy said he expected to discuss the plan with Trump “in coming days,” adding any deal must bring a “dignified peace” with “respect for our independence, our sovereignty.”\n\nThe cautious response from Ukraine’s presidential administration stood in contrast to the outrage at the plan from some Ukrainian officials who called it “absurd” “capitulation” and the effective end of its existence as an independent country\n\nThe plan appears to repeat Moscow’s maximalist demands and violate numerous Ukrainian red lines and would require an about-turn from Zelenskyy, who has said giving up territory would be unacceptable. It would also probably be deemed unacceptable by Ukraine’s European allies, who have long insisted that they should be given a role in the peace talks given the broader implications of the settlement for the continent’s security, particularly on Nato’s eastern flank.\n\nThe plan was reportedly drafted by Russian and US officials, including the influential head of Russia’s sovereign wealth fund, Kirill Dmitriev, who has been involved in previous talks on Ukraine and is known to be in touch with the US special envoy Steve Witkoff.\n\nOn Thursday White House press secretary Karoline Leavitt told reporters, “the president supports this plan. It’s a good plan for both Russia and Ukraine.”\n\nWitkoff and US secretary of state Marco Rubio had been “quietly” working on the plan with both Russia and Ukraine for around a month, Leavitt said. She rejected concerns that the plan echoes many of Moscow’s maximalist demands.\n\nSo what is in the 28-point plan?\n\nTerritory\n\nUkraine would give up the Donbas region to Russia, according to the draft seen by a number of outlets, which corresponds to Moscow’s previous demands.\n\n“Crimea, Luhansk and Donetsk will be recognised as de facto Russian, including by the United States,” the plan reads. Kyiv still partly holds Luhansk and Donetsk, which together make up the Donbas industrial belt on the frontline of the war. Crimea was annexed by Russia in 2014.\n\nAreas from which Ukraine has withdrawn in Donetsk would be deemed a demilitarised zone which Russian forces will not enter, according to the plan.\n\nThe southern regions of Kherson and Zaporizhzhia – which Russia falsely claims to have annexed – will be “frozen along the line of contact,” it said. The plan for Donbas, Kherson and Zaporizhzhia corresponds to Moscow’s previous demands.\n\nUkraine’s Zaporizhzhia nuclear plant, occupied by Russian forces since March 2022, would be supervised by the International Atomic Energy Agency (IAEA) and the electricity it produces be shared between Russia and Ukraine, the plan reportedly says.\n\nSecurity\n\nThe US-backed plan calls for Ukraine to reduce its army to 600,000 personnel, according to the draft seen by multiple outlets, a reduction of hundreds of thousands compared to its current size.\n\nNato would agree not to station troops in Ukraine – dashing Kyiv’s hopes for a European peacekeeping force – and the country would be barred from joining Nato. That fits with previous Russian demands that have been made public and goes against Ukraine’s previous demands.\n\nUkraine would receive “reliable security guarantees,” the plan says without specifying. But European jets would be stationed in neighbouring Poland.\n\nDiplomacy\n\nUnder the proposed deal, Russia would be “reintegrated into the global economy” after nearly four years of tough sanctions and be allowed back into the G8.\n\n“It is expected that Russia will not invade neighboring countries and NATO will not expand further,” the document says, according to multiple media outlets.\n\nBut all sanctions would snap back if Russia invades Ukraine again – “in addition to a decisive coordinated military response.”\n\nIn addition, $100bn in frozen Russian assets would be dedicated to rebuilding Ukraine, but others would be invested in a separate US-Russian investment fund “aimed at strengthening relations and increasing common interests to create a strong incentive not to return to conflict.”\n\nThe plan states that Ukraine would hold elections within 100 days, and both Ukraine and Russia would implement “educational programs in schools and society aimed at promoting understanding and tolerance of different cultures and eliminating racism and prejudice.”\n\nWith Agence France-Presse and the Associated Press",
  "authors": [],
  "url": "https://www.theguardian.com/world/2025/nov/21/trump-ukraine-peace-plan-zelenskyy-territory-ceded-nato-russia-g8"
}