{
  "title": "A ‘Family Stone’ sequel is in the works, says writer-director Thomas Bezucha",
  "text": "Christmas is coming early for those who love spending the holidays with the Stone family.\n\nThomas Bezucha, the writer-director behind the 2005 perennial yuletide favorite “The Family Stone,” is working on a sequel to the movie, he tells CNN.\n\nBezucha shared the news during an interview about working with the late Diane Keaton, who played matriarch Sybil Stone in the original movie.\n\nThe filmmaker said that he had been thinking about and working on the script for a followup to “The Family Stone” – which follows Sybil’s family at Christmas as they grapple with the news that she is terminally ill – when he learned of Keaton’s untimely death last month at the age of 79.\n\n“I’ve been haunted by the loss of Sybil for months now while I worked on it, and so this was a blow on a tender bruise already,” Bezucha said. “Mentally, I’ve been spending time in that house where I’ve been missing her for a while already.”\n\nRachel McAdams, Diane Keaton and Sarah Jessica Parker in a scene from \"The Family Stone.\" 20th Century Fox/Everett Collection\n\nBezucha said the news of Keaton’s passing made it all the more important for him to get it right and “do a good job by the rest of the cast.” Now, he wants to “honor her even more,” he said.\n\n“The Family Stone” was produced by 20th Century Fox, which has since been acquired by Disney. CNN reached out to a representative for Disney and is awaiting response.\n\n“The Family Stone” costarred Sarah Jessica Parker, Dermot Mulroney, Luke Wilson, Claire Danes, Rachel McAdams, Elizabeth Reaser and Craig T. Nelson, and told the story of a family’s very awkward holiday visit where an ill-matched partner ends up doing something of a switcheroo between two Stone siblings.\n\nThe film’s cringey and hilarious moments – mixed with deeply touching dramatic notes – have cemented its place among must-see annual holiday movies.\n\nBezucha said that when he first had an idea for the sequel, he contacted his producer and said he was only interested in pursuing it and embarking on a script if the principal cast was interested.\n\n“I’m not interested in the Brady family reunion without the original Jan,” he said.\n\nHe added that they proceeded to reach out to everyone and received unanimously positive responses. No one has officially signed on and the film has not yet been officially greenlit, but cast members have acknowledged the project.\n\nWhen contacted by CNN for the Keaton retrospective last week, Nelson mentioned that a sequel was in the works, and Mulroney told the New York Post earlier this month that there had been “discussion about making a follow-up.”\n\nBezucha did stipulate that he still needs to work on delivering a final version of the new script.\n\nAccording to Box Office Mojo, the first “Family Stone” film grossed almost $93 million worldwide on a budget of $18 million.",
  "authors": [
    "Dan Heching"
  ],
  "url": "https://www.cnn.com/2025/11/19/entertainment/family-stone-sequel-thomas-bezucha-diane-keaton"
}