{
  "title": "Doja Cat responds to Ma Vie World Tour complaints from fans",
  "text": "Doja Cat brushes off tour complaints from fans\n\n19 hours ago Share Save Jasmine Sandhar BBC Newsbeat Share Save\n\nGetty Images Before starting her Ma Vie World Tour, Doja Cat last performed for the Rock & Roll Hall of Fame\n\nPeople were quick to point out the show lacked visuals, structure and outfits, after the Ma Vie World Tour kicked off on Tuesday in Auckland, New Zealand. Yesterday, the US rapper clapped back at some of the complaints, saying \"I make music for people who enjoy music. I'm not a Broadway act.\" It's not the first time the 30-year-old has clashed with fans online, having previously deactivated her Instagram account over negative messages.\n\nNo longer 'painting the town red'?\n\nDoja Cat last went on tour in 2023 in support of her fourth studio album Scarlet, which featured hit songs including Paint The Town Red and Agora Hills. Fans on X mentioned similarities between the Grammy-winning artist's tours, with one posting: \"No shade the Vie tour just gives scarlet with different outfits.\" Joining the thread, another fan added: \"Hopefully she listens to the criticism.\" In response, Doja said: \"I won't and I don't need you.\" Other fans weren't impressed with the Gorgeous singer's wardrobe, as one asked: \"No outfit changes this era too...?\" Writing back, Doja answered the question with: \"I'm singing my MUSIC for the people who want to hear me SING.\"\n\nGetty Images The US rapper last toured the world in 2023 with her fourth studio album, Scarlet\n\nSome fans were supportive of the so-called queen of pop-rap, saying her \"dance break was breathtaking\" and describing her as \"one of the greatest performers ever\". And despite replying directly to several fans on X, Doja doesn't seem to be too bothered by the complaints. The singer encouraged one fan to \"keep your... opinion to yourself\" and said she makes a back-breaking effort on each night of the tour. \"You are not the artist you are the watcher,\" she wrote.\n\nA testy relationship\n\nDoja is known for having a testy relationship with both social media and her fans. In 2022, she threatened to quit music, changing her username on X to 'I quit', after being criticised by fans in Paraguay over a cancelled performance. And she reportedly lost over 180,000 Instagram followers after telling her fan base, known as Kittenz, to \"get a job\" in 2023. Earlier this year, a clip of the singer meeting a fan went viral when she said afterwards she had felt uncomfortable with him \"touching me and kissing me without asking permission\". According to the New Zealand show setlist, Doja performed 27 tracks, including early hits like Say So and her newer chart-topper Jealous Type. Her next performance is due on Saturday in Perth, Australia. She's then set to hit South America in 2026 and head to Europe in May and June, before returning to the US for the final leg of the tour.",
  "authors": [],
  "url": "https://www.bbc.com/news/articles/cp8e8z38d2po"
}