{
  "title": "Dal lavoro con Israele al sostegno alle espulsioni di massa di Trump, il capo di Palantir non si pente di niente",
  "text": "Ho intervistato Alex Karp in occasione di un evento annuale dedicato ai clienti aziendali di Palantir. La manifestazione era pervasa dall'atmosfera euforica di un summit di marketing multilivello. I clienti della società con cui ho parlato, da giganti come American Airlines ad aziende familiari relativamente modeste, mi hanno spiegato che i sistemi basati sull'intelligenza artificiale di Palantir sono costosi ma valgono il prezzo.\n\nAll'evento però non erano presenti i clienti che rappresentano la fetta più consistente del business di Palantir: il governo degli Stati Uniti e i suoi alleati (l’azienda non ha rapporti con Russia e Cina).\n\nPalantir è stata fondata con l'obiettivo di portare l'innovazione della Silicon Valley nelle tecnologie per la difesa e in quelle governative. Insieme al palantiriano Nicholas Zamiska, Karp ha esposto la sua filosofia in un libro uscito all'inizio di quest'anno, The Technological Republic, un j’accuse sorprendentemente scorrevole che critica la Silicon Valley per il suo scarso patriottismo. Secondo Karp, il tono anti-establishment nel marketing adottato da Apple per il Macintosh è il peccato originale di una cultura tech che celebra un individualismo indulgente e trascura le preoccupazioni di interesse nazionale. Alla conferenza, Karp, in maglietta bianca e jeans, ha esordito dicendo: \"Siamo un corpo estraneo alla Silicon Valley sin dalla nostra nascita, 20 anni fa\". Nel 2020, il dirigente ha spostato la sede di Palantir da Palo Alto a Denver, dove la società è diventata la più ricca dello stato.\n\nAlcuni vedono Karp come un supercattivo distopico. Lui risponde a queste critiche in modo aggressivo, senza mezzi termini e senza un briciolo di rimorso. Dopo anni di contratti pubblici, l'azienda ha dimostrato che i suoi strumenti possono sfruttare efficacemente le informazioni sul campo di battaglia e le operazioni di intelligence, per la soddisfazione del governo americano. Palantir si è aggiudicata un appalto multimilionario con l'Ice per aiutare l'agenzia a individuare le persone da espellere dagli Stati Uniti. In Ucraina, Karp spiega con orgoglio che i prodotti dell'azienda hanno contribuito a fornire i dati alla base di scelte letali.\n\nPalantir ha un codice di condotta che in teoria la vincola, tra le altre cose, a \"proteggere la privacy e le libertà civili\", \"tutelare i soggetti vulnerabili\", \"rispettare la dignità umana\" e \"preservare e promuovere la democrazia\". In una lettera aperta dello scorso maggio, 13 ex dipendenti hanno accusato la dirigenza di Palantir di aver abbandonato i suoi valori fondanti e di essere complice della \"normalizzazione dell'autoritarismo travestito da 'rivoluzione' guidata da oligarchi\". Karp ha rivelato che altri membri del personale hanno lasciato l'azienda per via dei suoi rapporti con l'esercito israeliano. La sua replica? Se non crei attrito, probabilmente stai facendo qualcosa di sbagliato.",
  "authors": [
    "Steven Levy"
  ],
  "url": "https://www.wired.it/article/alex-karp-palantir-intervista-israele-ice-donald-trump/"
}