{
  "title": "Building The Biggest Telescope You Can Buy",
  "text": "Transcript\n\n[drums beating]\n\nWhat do you get when you combine\n\ncutting-edge space optics technology\n\nwith a price tag big enough to buy a house,\n\nthe PlaneWave CDK1000.\n\n[majestic music]\n\nWelcome to Snow King Mountain in Jackson Hole, Wyoming,\n\na playground where billionaires go to ski\n\nand now it's also for those into serious star gazing.\n\nToday we're getting hands-on with this astronomical beast\n\nto uncover what makes it such a star among telescopes\n\nand by the end we'll give it a Desired rating\n\nto see if it lives up to the hype,\n\nor if it's a stellar money pit.\n\nThis is, Desired.\n\nThe telescope I'm about to see\n\nis worth an eye-watering $600,000,\n\nwhich is a pricey entry point for a hobby\n\nand significantly more\n\nthan anything you'll find at your local scope store.\n\nHowever, astonishingly, this piece of kit\n\nclaims to actually be good value for money\n\nwith the company that makes it, PlaneWave,\n\nable to deliver in around two months\n\nand install in a single day,\n\nsomething never thought possible before.\n\nI'm heading up to meet Joe Zator,\n\nDirector of the Snow King Observatory,\n\nto get a look at the cutting-edge facility.\n\nBut before we get ahead of ourselves,\n\nI'm gonna show you just what goes into\n\nmaking the CDK1000 back where it's manufactured\n\nin Adrian, Michigan.\n\nHey, how ya doing, Rick? Hey.\n\nKevin, nice to meet you. Nice to meet you.\n\nGreat to have you. Thanks so much\n\nfor having us.\n\nSo this is what we've come to see,\n\nthis is the CDK1000. CDK1000, yeah.\n\nYeah, so this is a one-meter telescope\n\nand what that means is the main mirror,\n\nthat gathers all the light,\n\nis one meter in diameter.\n\nSo that's the 1000? That's the 1000,\n\n1000 millimeters. Right.\n\nThe light comes in the front here,\n\nhits a main mirror down here,\n\ngoes up, hits that mirror there, called the secondary,\n\ncomes down here, hits another mirror,\n\nthat's at a diagonal,\n\nand sends the light out this port here.\n\n[Jeremy] You do your mirrors in-house?\n\nCould you not get them\n\nmade elsewhere? We could not\n\nget them made elsewhere.\n\nWe decided we had this design,\n\nwith this lightweight mirror,\n\nwhich means the whole telescope gets to be lighter weight,\n\nhigher tech, and we get to use\n\nall the most modern technology,\n\nand materials and everything.\n\nAnd we went to companies and they just, they couldn't do it.\n\nOkay. They said,\n\nWell, it's gonna be a bunch of money\n\nand it might take a year, two years to make one mirror.\n\nSo we experimented in-house and within about six months\n\nwe were able to make our own mirror.\n\nI noticed there is a USB port here,\n\ncan I charge my iPhone on that?\n\nYou could. Yes.\n\nAbsolutely. [all laughing]\n\n[Jeremy] What can it do, how far can it see?\n\nHow far something can see is always the first question\n\nand we've had one of our customers\n\ntake a 17-inch telescope, much smaller than this,\n\nand try and image a quasar\n\nthat was 12.9 billion light years away,\n\nwhich is almost to the edge of the observable universe.\n\nAnd we jokingly say,\n\nhow far can you see in these telescopes,\n\nwe say all the way.\n\nFor people who don't know this field,\n\nhow is this different?\n\nSo when we came into the market,\n\nin the one-meter market,\n\nyou know it could be $2 million, 1.8,\n\nsometimes you can get $1.2 million.\n\nThis telescope weighs 3500 pounds,\n\nthey weigh, you know, like 9,000 pounds,\n\n10,000 pounds. You're joking.\n\n[Kevin] It'd take you five years\n\nto get one. Yeah.\n\nReally? 'Cause they're custom made,\n\nevery single one.\n\n[Jeremy] And how quickly can you build them?\n\nReally we can deliver usually in about two months.\n\nWe ship them to our customer,\n\nwe go out and install 'em,\n\nand they're installed in one day.\n\n[Jeremy] Now whilst all that sounds very impressive,\n\nwe're still talking huge amounts of money here.\n\nRick assured me that their new CDK,\n\nand direct-drive technology,\n\njustifies the cost.\n\nCDK stands for Corrected Dall-Kirkham.\n\nDall-Kirkham is an older design\n\nso we modified that design and added corrector lenses\n\nand made a much more high-functioning telescope\n\nand since it's easier to make, it's also a lower price.\n\nRight, okay. This is a CCD chip,\n\nthis is 52 millimeters on the diagonal\n\nand you can see the star in the center,\n\nand a star at the edge, are identical,\n\nand there's not many telescopes that can do that.\n\nBut then the other part of that is the direct-drive.\n\nThis is probably like\n\na bunch of five-minute images added together.\n\nSo you're tracking the sky for five minutes,\n\nyou're correcting for the fact the Earth is rotating,\n\nstaying centered on the object,\n\nand any deviation will make these stars look elongated.\n\nSo it's one thing to have an optical design\n\nthat gives you points,\n\nbut you've got to track well enough.\n\n[Jeremy] Back at Snow King,\n\nJoe took me to the planetarium\n\nto see some rendered images from the CDK1000.\n\nHere we have the Orion Nebula, which is Messier Object 42.\n\n[Jeremy] Wow, and that was taken with this telescope,\n\nthe CDK1000 that you've got on the roof?\n\nCorrect, yes.\n\nThat's one of the things that I think\n\nis just so amazing about a telescope like this,\n\nis it's something that's available\n\nthat for the people in the general public,\n\nwhere you don't have to have three doctorates\n\nto be able to use it.\n\nIt's allowing us, not just to take\n\npeople's breath away and allow them to see\n\nthe beauty that's out there in the cosmos\n\nthat we wanna study,\n\nbut it also can get those younger generations\n\nexcited to say, oh wow, that's beautiful,\n\nbut really what's the physics behind that,\n\nwhat's going on there?\n\nAnd they'd maybe be interested in studying cosmology,\n\ninterested in studying astrophysics,\n\nand really propel that next generation of humanity forward\n\nto bring us out to the stars\n\nand learn more about what we can,\n\nwhich also helps learn more about us, who we are.\n\nOver at PlaneWave, Rick was excited to introduce me\n\nto Dan Roelker, the Co-Founder and CEO of OurSky,\n\na platform that connects multiple telescopes\n\nfrom around the world,\n\nproviding real-time observational data and analysis\n\nof objects and activities in space.\n\nNow, they're merging with PlaneWave\n\nto create a new company called, Observable Space.\n\nThis industry has really had kind of a gap\n\nbetween the hardware itself,\n\nand the actual software that leverages the hardware\n\nand processes the data.\n\nSo that's kind of where\n\nthe idea of Observable Space came from,\n\nwhere combining PlaneWave and OurSky,\n\nfor the software side, to build that product\n\nthat's really never been built before in this industry.\n\nThis is live data, is it? Yeah, yeah.\n\nLive data, so it's tracking\n\na satellite here? Yeah, this is just\n\nkind of a live view of some of the telescopes\n\nwe have around the world\n\nthat are tracking different satellites.\n\nWhat you're seeing here is all these different streaks\n\nin the image, are stars.\n\nBecause what's happening is the telescope is tracking\n\na specific object in space,\n\nthat object is basically the box right here,\n\nwith the dot. Yeah.\n\nIn order to understand where an object is in space,\n\nwhen we're tracking it this way,\n\nyou solve for the midpoint\n\nfor each of the streaks on those stars.\n\nAnd once you have the midpoint of all of those streaks,\n\nyou can then compare it against star maps that we have\n\nto understand where it's pointing\n\nand then it can basically say this is,\n\nat this very kind of nanosecond precision of time,\n\nthis is where this object was in space.\n\nAnd that is useful information because?\n\nIt's useful information for anyone\n\nthat needs to maneuver, plan maneuvers,\n\nor operate any spacecraft that's in orbit.\n\n[Jeremy] You don't wanna hit anything.\n\nYou don't wanna hit anything\n\nand you also just wanna know where things are at.\n\nEven though you might have a equation that says, you know,\n\nfive minutes from now this object should be here,\n\nwhen there's a lot of uncertainty\n\nbased in with like solar pressure,\n\natmospheric conditions, things like that,\n\nit actually might not be where you thought it should be\n\nin five minutes, so you need to be able\n\nto track these objects to understand where that's at.\n\n[Jeremy] These telescopes can perform laser communication,\n\ncan't they? Yeah, so laser comms\n\nreally like the next gen for space communications.\n\nIt's 10 to a hundred times faster\n\nthan RF frequencies. RF being radio?\n\nRadio, yeah radio frequencies.\n\nIt's very low power for spacecraft\n\nand the further away from Earth you get\n\nthe more beneficial laser communication becomes.\n\nSo it's kind of a holy grail, if you will,\n\nfor kind of building out that next kind of level\n\nof communication for the space industry.\n\nNASA and JPL recently just did\n\nthe longest optical link and laser communication\n\nwith their Psyche Spacecraft.\n\nWhat they ended up getting with,\n\nwhen they closed that link,\n\nI think it was like six point some megabits per second,\n\nand it was about maybe 255 million miles from Earth,\n\nor something like that.\n\nAnd generally like when you have spacecraft\n\nthat far from Earth,\n\nyou're really looking at like bits per second [chuckling].\n\nSo with RF it would be? Yeah, bits\n\nto maybe kilobits per second. Kilobits per second.\n\nUp to, but with Lasercom it was around\n\n6.5 megabits per second. Which is not,\n\nsometimes it's actually some people's\n\nhome Wi-Fi. Yeah, totally,\n\nit might be a little bit faster, yeah.\n\nThat was like the first test, right,\n\nso even getting even greater speeds\n\nis definitely in the cards for the future.\n\nSo just to be clear then,\n\neverything you're talking about,\n\nthe integration of the software,\n\nbut also this idea of of the laser communication,\n\nand everything else, that's all possible\n\nwith the CDK1000, yes? Absolutely.\n\nIt's definitely multifunctional\n\nso they're not just for one specific thing.\n\nSo if you wanted to do astrophotography\n\nand kind of explore the cosmos for a little bit,\n\nwith our flagship you can do it,\n\nand then the next, you know, five minutes later,\n\nyou could be receiving laser communications.\n\nFrom the sounds of it,\n\nRick and Dan are trying to grow\n\nnot only a better global system for studying space,\n\nbut also drastically lower the entry point\n\non who can access a cutting-edge telescope,\n\nlike the CDK1000.\n\nAnd I loved the idea of democratizing\n\nand sharing access to a worldwide network of telescopes\n\nlike the one at Snow King.\n\nIt feels like a genuinely positive step\n\nin encouraging a new generation of space explorers.\n\nAs night fell, on Snow King Mountain,\n\nand with clouds ominously rolling in\n\nafter clear skies all day,\n\nmy time had finally come to see what all the fuss was about.\n\nThis is Jupiter we're about\n\nto look at here? That's correct.\n\nAnd it's moons. You can see\n\nsome of the cloud-band patterns,\n\nand the other bright spots around it,\n\nare the Galilean moons. That's amazing.\n\n[Rick] We've even seen some of the colors of it too,\n\nand some of those clouds are different ammonia compounds,\n\ndifferent hydrogen compounds.\n\nGosh it doesn't quite\n\nlook real. [Rick chuckling]\n\nYou don't expect to see the colors,\n\nthe cloud bands,\n\neverything like that. Yeah, that's actually\n\none of the comments we get from a lot of people\n\nin particular with Saturn's rings,\n\nwhen they're looking at that,\n\nis they think it's just like, how can this be real?\n\nYou guys have gotta,\n\nyou gotta have a look at this\n\nreally while you're here,\n\nyou need to.\n\nIt is exciting. Yeah, I think so too,\n\nit's amazing, and you know in some ways, like you said,\n\nit makes you feel small in the immensity of the cosmos,\n\nor even just our solar system,\n\nand to me a lot of times it also makes you feel\n\nvery large and a part of the cosmos.\n\nBecause we're looking out at another planet\n\nand you get that light reflecting off of it from the sun,\n\nand coming back to your eyeball,\n\nand it just kind of makes you think about\n\nwhat other things are out there to discover.\n\nImagine having a really nice glass of whiskey,\n\ngoing out onto your back porch where you've got\n\nyour own little dome- Yes.\n\nYou know like that,\n\nand a CDK1000 stuck out there and go,\n\nI'm just gonna go out, have a little drink,\n\nand I'm gonna look at the planets for a bit.\n\n[lively piano music]\n\nSo we've come to the end\n\nof our voyage of discovery, really.\n\nThis CDK1000 by PlaneWave,\n\nI mean what's impressive about it\n\nis that you can put it in your backyard,\n\nif you've got one big enough,\n\nbut you can also then contribute\n\nto genuine scientific research\n\nand it's also democratizing science in this field.\n\nYou don't normally get to say that with super expensive kit,\n\nbut you cannot get away from the fact\n\nthat what we've discovered with this thing\n\nis that this used to cost millions and millions\n\nand through innovation,\n\nand through trying to use new technologies,\n\nand new software,\n\nthey've tried to make something here,\n\nPlaneWave, that anyone can use and it can do things\n\nthat weren't possible only a few years ago.\n\nI love it.\n\nThis gets a 9/10.\n\nI wasn't prepared for how exciting it is\n\nto see something that's in our own solar system\n\nso it's not really stretching\n\nthe abilities of this telescope at all.\n\nYet, I'm still looking at something\n\nthat's half a billion miles away\n\nand I've never seen it like that before.\n\nWith Desired, we've looked at things\n\nthat are just for you,\n\nsuper high-end speakers, driving simulators,\n\nthis isn't that, this is for the greater good,\n\nthis is for everybody,\n\nand that's what really makes it special.\n\n[lively orchestral music]",
  "authors": [
    "Condé Nast"
  ],
  "url": "https://www.wired.com/video/watch/wired-desired-building-the-biggest-telescope-you-can-buy"
}