{
  "title": "Best Mattress 2025: We’ve Tested 100-Plus So You Can Sleep Soundly",
  "text": "Compare Our Top Picks\n\nMattress Mattress Type Materials Sizes Available Firmness Options Add-ons Available Shipping Costs Delivery Options Trial Period Warranty Financing Options Compatible with adjustable frames? Helix Midnight Luxe Hybrid Tencel cover, memory foams, pocketed coils Twin, twin XL, full, queen, king, California king, short queen, RV king Medium GlacioTex cooling cover, CoolForce Layer, ErgoAlign Contour Layer Free for customers in the contiguous US Delivered in six to 10 days in a box; setup handled by customer 120 nights; 30-day break-in period required before initiating return Limited lifetime Financing available with Affirm Yes Leesa Sapira Chill Hybrid Phase change cooling cover, cooling memory foams, pocketed coils Twin, twin XL, full, queen, king, California king Plush, medium firm, firm GlacioTex cooling cover Free for customers in the contiguous US -Arrives in a box in three to seven business days; white glove delivery available within contiguous US (mattress setup and old bed removal) for $199 120 nights; 30-0day break in period required before initiating return. Customers in Alaska, Hawaii, and Canada will have $100 return fees Limited lifetime Financing available with Affirm or PayPal Credit Yes Bear Elite Hybrid Hybrid Phase change material (PCM) cooling cover, copper-infused memory foam, dynamic memory foam, pocketed coils Twin, twin XL, full, queen, king, California king, split king Soft, medium, firm Celliant-infused cooling cover Free for customers in the contiguous US Arrives in a box within three to seven business days; white-glove delivery service available. Setup is $100, setup and old bed removal is $200 120 nights; 30-day break-in period required before initiating return Limited lifetime Financing available with Affirm Yes Nolah Evolution Hybrid Organic cotton or GlacioTex cover, AirFoam Luxe memory foams, gel memory foam, AirBreath border gusset, pocketed coils Twin, twin XL, full, queen, king, California king, split king Plush, luxury firm, firm GlacioTex cooling cover Free for customers in the contiguous US Arrives in a box as part of standard shipping; white-glove delivery available (mattress setup and old bed removal) for $225 120 nights; 30-day break in period required before initiating return ($99 shipping fee) Limited lifetime Financing available with Affirm Yes Birch Luxe Natural Hybrid Organic cotton cover, wool, organic latex, pocketed coils Twin, twin XL, full, queen, king, California king Medium Birch CoolForce Layer Free via FedEx Arrives in a box as part of standard shipping; white-glove delivery available for $199 120 nights; 30 day break in period required before initiating return that incurs $99 shipping fee Limited lifetime Financing available with Affirm Yes Avocado Green Hybrid Hybrid Organic cotton cover, organic latex, organic wool, pocketed coils Twin, twin XL, full, queen, king, California king Firm, medium, plush Additional fees are applied for medium or plush firmnesses, since they involve either a pillow- and box-top Free for customers in the contiguous US Arrives in a box as part of standard shipping; white-glove delivery available starting at $249 1 year; 30-day break in period required before initiating return that incurs $99 shipping fee 25-year limited Financing available with Affirm Yes Saatva Rx Hybrid Organic cotton cover, plant-based fire barrier, gel memory foam, graphite- and phase change material-infused foam, high density memory foam, micro coils, pocketed coils Twin, twin XL, full, queen, king, California king, split king Supportive plush Accessories only White glove delivery for customers in the contiguous US “In-room” mattress delivery and setup included, as well as old mattress and frame removal 365 nights, $99 shipping fee Limited lifetime Financing available with Affirm Yes Naturepedic EOS Hybrid Organic cotton cover, plant-based PLA layer, organic wool batting, organic latex, organic cotton batting, organic cotton fill and fabric, pocketed coils Twin, twin XL, full, queen, king, California king Plush, medium, cushion firm, firm, extra firm (each side can have different firmnesses) N/A Free for customers in the contiguous US Arrives in a box as part of standard shipping. For contiguous US shoppers, mattress setup for $299, or mattress setup, old bed removal for $349 100 nights; 30 day break-in period required before initiating return 25 year limited Financing available with Affirm Yes Plank Firm Foam Quilted fabric and foam, high-density foam, Supreme Response foam Twin, twin XL, full, queen, king, California king, split king Firm, extra firm GlacioTex cooling cover Free for customers in the contiguous US Arrives in a box as part of standard shipping 120 nights; 30-day break-in period required before initiating return Limited lifetime Financing available with Affirm Yes Airweave Takumi 2.0 Polyethlyene string Temperature regulating cover, inner cover, Airfiber blocks, polyethylene Twin XL, queen, king, California king Soft, medium soft, medium, medium firm, firm, extra firm N/A Free for customers in the contiguous US Arrives in a box as part of standard shipping; white glove delivery available (mattress delivery and set up) for $275 60 nights; 14-day day break in period required before initiating return 10-year limited Financing available with Shop Pay No BedGear H Performance Hybrid Ver-Tex cooling cover, React memory foam, suspended pocketed coil unit, Air-X mesh, air vents Twin, twin XL, full, queen, king, split head queen, split head king, split head California king Medium firm (H4), medium plush (H6) N/A Free for customers in the contiguous US Arrives in a box as part of standard shipping 30 nights 10-year limited Financing available with Affirm Yes Wolf 12-Inch Hybrid Medium Firm Hybrid Cooling cover, gel memory foam, support foam, pocketed coils Twin, twin XL, full, queen, king, California king, split king Medium firm N/A Free for customers in the contiguous US but does not ship to Hawaii or Alaska Arrives in a box as part of standard shipping 101 nights; 30-day break in period required before initiating return Limited lifetime Financing available with Affirm Yes Tiami Luxury Hybrid Hybrid Organic cotton cover, Energex foam, foam-capped pocketed coils Twin XL, full, queen, king, California king Medium firm N/A Free Arrives in a box as part of standard shipping; white-glove delivery available for $299 100 nights; 30-day break in period required before initiating return 10 years Financing availablewith Flex Yes Sleep Number p6 Smart Bed Smart bed Soft cover, dual air chambers Queen, king, split king, FlexTop king, California king, split California king, FlexTop California king Adjustable on scale of one to 100 N/A Comfort Service℠ Home Delivery (white glove delivery) fee depending on price of bed Delivered by Sleep Number representative for a fee 100 nights; 30-day break in period required before initiating return 15-year limited Financing available with Affirm Yes\n\nHonorable Mentions\n\nWe have tested 100+ mattresses over the years and have removed many that are out-of-stock or out-of-date. Here are a few more products that are still available, which we liked but didn't love as much as the ones above.\n\nPuffy Cloud for $949: This enhanced all-foam mattress offers profound pressure relief without feeling too soft, despite the name “Cloud” being in its name. The Puffy Cloud has a thinner profile and would most likely be too soft for bigger bodies. However, for lightweight and average builds, it really comes through to support the lower back and hug around pressure points. The thinness also didn't compromise its motion isolation, which meant little to no shaking when my dogs jumped in and out of bed.—Julia Forbes. $449 to $1,298\n\nThe Saatva Contour5 for $2,999: The Contour5 is a new offering from Saatva, replacing the popular Loom & Leaf in the company's lineup. Like other Saatva mattresses, but unlike most others on this list, it is not roll-packed and comes delivered on a moving truck. The Contour5 has two firmness options and updated cooling tech that uses airflow channels in its gel foam layer, which is thinner than its predecessor, meaning it retains less heat. In my two weeks of testing, I found the Contour 5 was very good at remaining cool through summer nights, which is extra impressive given that it uses very dense 5-pound-weight memory foam. The Contour5 is soft enough for side sleeping without feeling like a saggy hammock and has excellent build quality, which is impressive for an all-foam mattress without springs. I prefer a hybrid with microcoils, but Saatva is popular for a reason, and as all-foam mattresses go, it has a true luxury feel. —Martin Cizmar. $1,899 to $3,599\n\nThe Big Fig Classic for $1,899: The Big Fig is designed for larger body frames. Being a bit overweight myself, I was eager to see how well this mattress, which is advertised as comfortably handling 550 pounds per sleeper, performed. It is a well-built mattress with an effective gel cooling layer; however, the aggressive edge support created a hammock-like feel despite the sturdy springs and three layers of high-density foam in the middle of the mattress. This was true both on my back and on my side. Others may appreciate the effect of sinking a bit into the center of the bed more than I do. —Martin Cizmar. $1,499 to $2,699\n\nThe Boring Hybrid Mattress for $799: Boring Mattress is a new company founded by two alums from Tuft & Needle. Simplicity is the company's selling point. There is just one option: the Boring Hybrid Mattress. (You are allowed to pick a size.) This 10-inch hybrid has four layers of both foam and springs. I’m very sensitive to joint pain, and certain beds tend to make it worse, which is why pressure relief is super important for me. Having slept on a variety of different mattresses throughout the years, I was doubtful that this one would work. But I’ve slept on the hybrid mattress for months now and have yet to feel any pain at all. It strikes an excellent balance between firmness and support that my very particular self hasn’t been able to find with other options on the market. It’s worth noting, however, that its layers come equipped with an open-cell design that’s designed to move heat from your body while sleeping. I’m usually cold, so this feature isn’t that important to me. But on nights when I’ve cranked the heat up in my room and woken up sweating a bit, I can’t say it worked all that well for me. This isn’t a deal breaker, but I wouldn’t buy it solely for that. —Brenda Stolyar. $599 to $999\n\nCasper The One for $799: Casper was a leader in the first wave of bed-in-a-box makers in 2014. The company has changed ownership and design a few times over the past decade but last year's launch of The One finds the company keeping pace with competitors. This is an all-foam mattress that stands 11 inches tall. Because it's all foam, it’s on the light side, with a queen weighing an easily movable 66 pounds. One of the main issues with all-foam beds is that they get too hot, but Casper’s The One uses an open-cell foam layer called Breathe Flex Foam on the top, which makes it both pleasantly squishy and breathable. Two more layers of foam add up to a medium-firm feel, with the middle layer designed to cradle your hips, and the base layer designed to provide support. —Martin Cizmar. $749 to $1,698\n\nThe Winkbed for $1,499: WIRED reviewer Julian Chokkattu slept on the luxury firm version of the WinkBed for almost two years and he was quite happy in that time. His favorite perk? The edge support is fantastic, so his partner never wakes when he slips into bed late at night. The plush pillowtop also adds a luxe, hotel-like feel to a relatively firm bed. —Martin Cizmar. $1,149 to $2,049\n\nSilk and Snow S&S Organic for $1,000: I wouldn't expect this to feel silky-soft, but the latex is supportive for sleep. I love how responsive (read: bouncy) this bed is, especially as someone who tosses and turns often. It's able to move with me so I never feel unsupported, or overheated for that matter. Latex and coils are breathable, as are the organic cotton cover and wool fire barrier. —Julia Forbes. $800 to $1,300\n\nNest Bedding Quail for $1,299: When it comes to all-foam mattresses from classic bed-in-a-box brands, I prefer the Casper above, but the Quail by Nest is a nice option if you want an all-foam bed that's a little firmer and you're willing to pay a little more. My biggest issue with the Nest was that despite its claimed cooling system—the foam is infused with minerals and designed with an airflow layer—I did sleep a little hot on it during my week of testing. —Martin Cizmar. $849 to $1,499\n\nCourtesy of Helix\n\nHelix Sunset Elite for $3,749: Our top pick, Helix, also has an Elite collection that consists of seven mattresses along a spectrum of softness. At 15 inches high, the Sunset Elite is \"the tallest mattress on the internet,\" and comes shipped in two separate boxes, each heavy enough to max out FedEx requirements. The firmness is dictated by the foam density of the upper layer, which zips into a larger support system. This makes the mattress adjustable if you end up regretting your order. The bottom section has a separate layer of microcoils. I spent a month sleeping on the softest model from the Elite line, dubbed the Sunset, and appreciated the deep cradling effect. Helix offers a 100-day trial period on all of its mattresses. —Martin Cizmar. $2,499 to $4,499\n\nDreamCloud Hybrid for $1,698: Don't be turned off by that price just yet. This is one mattress that my husband begged me to keep, because the support and pressure relief set the bar so high. It's been one of the most consistently performing mattresses I've tested over the years. And that seemingly high price? DreamCloud runs sales often, so expect to slash that in half. —Julia Forbes. $1,148 to $2,562\n\nWayfair Sleep 14-Inch Plush Cooling Gel Hybrid Mattress for $410: This plush mattress has a top layer of cooling gel that conforms to your body for comfort and has classic pocket coils below for structure and support, with layers of memory foams with varying thickness surrounding the coils for extra support (the coils and memory foam mixture helps with low motion transfer, too). The top knit cover and sides help with breathability and the overall cooling effect. The mattress is also compatible with an adjustable bed base, has solid edge support, is CertiPUR-US and Oeko-Tex Certified (ensuring no harmful toxins), and has a 10-year warranty. This bed is super comfy if you like a more plush mattress. —Molly Higgins. $400 to $700\n\nMattresses to Avoid\n\nThere are some models you should avoid. Many of these beds are extremely affordable, and if you aren't picky, they may feel fine. In other cases, the mattress is decent but the price is not.\n\nTempur-Pedic Tempur-Adapt for $2,199: Tempur-Pedic is one of the country's best-known and loved mattress brands, but two separate WIRED reviewers (Martin Cizmar and Nena Farrell) have both disliked different mattresses from the company over the past two years. Nena found the Tempur-Adapt totally lacking in support, and felt like she was sinking into a void when she lay on it. Her spine and muscles both ached after sleeping on it so she gave it to her sister who also hated it, describing it as like sleeping on a leaky air mattress. —Martin Cizmar. $1,699 to $3,398\n\nMagniflex Magnistretch 12 for $4,399: This mattress is Italian-made and advertises itself as stretching the spine. It’s endorsed by retired Italian soccer player Giorgio Chiellini and current pro basketballer Stefano Tonut, who plays for the Italian equivalent of the Boston Celtics. Well, the Magniflex definitely does something to the spine, though I found it very unwelcome. (It's worth noting that I am not the same Martin Cizmar who played a little pro soccer in Slovakia.) I lasted only two nights on the Magnistretch before crying uncle and limping over to my next tester. The morning-after sensation was as if I'd slept on a hammock made of chainlink fence, and my lower back was left feeling weak and creaky—very possibly it was stretched, and if so, it turns out I don't like having my back stretched. —Martin Cizmar. $3,699 to $5,299\n\nSleep Number Climate360 Smart Bed for $10,249: This bed can be temperature-controlled, which is amazing. The adjustable base means you can be comfortable when watching TV, reading, or sleeping. Unfortunately, the price tag has too many digits, and sleep experts recommend avoiding electronic usage before bed—advice the Sleep IQ app defies. Did we mention it costs as much as a used Buick and the weight is not far behind? —Martin Cizmar. $10,249 to $14,449\n\nAmazon Basics mattress for $170 (Twin): This one is made of cheap foam that isn't dense enough, causing too much sinkage. —Martin Cizmar. $170 to $436\n\nParachute Eco Comfort Mattress for $2,650: This mattress just doesn't live up to its extravagant price. The model we tested didn't have enough proper padding above its coils. —Martin Cizmar. $1,550 to $2,850\n\nFrequently Asked Questions How We Test Mattresses AccordionItemContainerButton LargeChevron WIRED has tested mattresses since 2019. The very first version of our buying guide was made by sourcing two dozen beds and having our staff lay on them in a conference room to pick a favorite. But anyone who has bought a few beds in person from a mattress store can tell you the mattress you prefer when lounging in a well-lit store at 4 pm may not be the mattress you want while trying to get a few last winks at 4 am. We subsequently learned that there is no substitute for actually sleeping on tester mattresses in our own homes. We don't rely on surveys of random shoppers or labs with falling bowling balls to make our recommendations. We bring each bed into our homes for at least seven nights of real-life testing. Only after a week of good, restful sleep—as our lead reviewer, I have personally tested 40-plus beds in the past two years—will we recommend a product. Everything we test gets at least a few nights to make a positive impression, but when we decide we hate a product we will stop short of testing it for seven nights and get ourselves some better sleep. How Firm or Soft Should Your Mattress Be? AccordionItemContainerButton LargeChevron The biggest decision in every mattress purchase is how firm to go. Generally, heavier people and back sleepers or stomach sleepers will do better with firmer beds, while lighter people and side sleepers enjoy softer. Temperature is also an issue: Softer mattresses sleep warmer since your body is sinking into a layer of fabric and foam. Keep in mind that all mattresses have a break-in period, and the way the mattress feels on your first night won't be how it feels after a week or two. It's also worth considering that if you buy a firmer mattress and want to soften it up, a mattress topper is a great option—we've got a full guide to the best—but it's much harder to make a soft mattress firmer. Should You Wait for a Sale? AccordionItemContainerButton LargeChevron Mattresses go on sale often—Presidents’ Day has somehow become the biggest sale day of the year, as famously mentioned on Nate Bargatze's Saturday Night Live skit. Labor Day and Memorial Day also somehow become mattress sale holidays. Additionally, online mattresses are often advertised as being on sale perennially. There's a strong chance you can save hundreds of dollars by waiting for the next big sale event. WIRED covers all of these sales and carefully tracks prices throughout the year so we can alert you to the best actual deals as opposed to “sales” that are not much different than the normal asking price. Can You Set Up a Bed-in-a-Box by Yourself? AccordionItemContainerButton LargeChevron Take it from someone who has dealt with dozens over the past year: Bed-in-a-box mattresses delivered by FedEx are relatively easy to deal with. Most of these mattresses are delivered vacuum-sealed and rolled up. Some are pretty heavy—up to 150 pounds—and if you're ordering one of those, be sure someone is there to help you. After you unroll your bed-in-a-box mattress and cut the vacuum bag open, it'll immediately begin to inflate, so unbox it on your bed frame or near it. We have a helpful guide on how to set up the mattress you bought online with more tips. The mattresses are usually ready to go in a few hours, but most manufacturers recommend giving them two days to reach their normal state. What if You Don't Like the Mattress You Bought Online? AccordionItemContainerButton LargeChevron Most of the picks we've tested and recommend have at least a 100-night testing period and a 10-year warranty. Before you buy, be sure to look at the company's policy as you may be on the hook for a nominal return fee. Set yourself a reminder a few days before the return deadline to make a final assessment. Should You Buy a Hybrid or an All-Foam? AccordionItemContainerButton LargeChevron Old school mattresses were made of springs with thin layers of foam and cloth and usually sat on a box spring. Bed-in-a-box mattresses, on the other hand, are either foam or hybrids that layer foam with built-in springs. (I have never tested one that required a box spring.) We tend to recommend hybrids because they are more stable and supportive, and they usually stay cooler because the springs leave room for airflow. Hybrids are often slightly pricier. Foam mattresses tend to be softer, lighter, and cheaper. What Size Mattress Should You Buy? AccordionItemContainerButton LargeChevron The prices in our guide are based on the queen size, which is the most popular size in the US. But everything we've included comes in various standard sizes, usually standard twin, twin XL, full, queen, king, and California king. You'll want to buy based on the size of your bed frame. Are Online Mattresses Safe? AccordionItemContainerButton LargeChevron Mattresses sold in the US are subject to consumer protection rules on things like flammability and have requirements for tags that show when and where they were made (you remember the verbiage that says you can't remove tags under penalty of law, which has inspired generations of comedians). Any mattress you buy online should be safe, but it's always better to do business with reputable companies. How Does WIRED Acquire the Mattresses to Test? AccordionItemContainerButton LargeChevron WIRED's Reviews team is always testing new mattresses, cycling through about 50 in a year. Dedicated sleep writer Julia Forbes is charged with keeping the team on pace with these testing needs.Most of the mattresses reviewed in this guide were provided as samples to WIRED by the company, with no obligation to cover or promises of what that coverage would look like. A few mattresses were also purchased and expensed, such as the Wayfair and Amazon Basics models. What Does WIRED Do With the Mattresses After Testing Them? AccordionItemContainerButton LargeChevron The majority of mattress are considered samples and are provided by companies. Sometimes we send them back after testing, but given that mattress companies cannot resell used mattresses and shipping is expensive, our team typically passes them on to the community without personal benefit. We also purchase (and expense) some mattresses we want to test. We won't ever say we like something we don't based on the commission rate. What Should You Look for When Buying a Mattress? AccordionItemContainerButton LargeChevron Choosing a mattress is a highly subjective process, but before we get down to details, ask yourself what you really, truly want out of a bed. If you're say, over 6 feet tall and want something that resembles a slightly softer board of wood, we'd immediately refer you to the Plank above. Point is, there really is something for everyone, and that's on taste alone. From the perspective of support and finding a mattress that truly fulfills that, you'll need to consider the following factors: your body type and weight, sleeping position(s) of choice, and materials you want. Not to mention, there other checklist items to take into account, like budget, space in your bedroom, and how many sleepers will be feasibly using this mattress. Rule of thumb is that side sleepers and those with more petite statures do best with soft to medium-firm beds. This helps maintain softness for pressure relief, but not overly so where spine alignment is lost. What stomach sleepers and heavier bodies have in common is the need for very firm back support. Sleepers with this body type may have experienced sinking too far into a mattress, which is a lost cause for a good night's sleep. Similarly, if stomach sleepers are on a softer bed, it could lead to back pain from not keeping the spine in alignment. That's a lot, so to help you out, we have guides (with more coming soon!) on our favorite beds in each scenario, like the best mattresses for side sleepers and the best ones for dealing with back pain. What Are Mattress Certifications? AccordionItemContainerButton LargeChevron We have an article outlining the various certifications associated with different mattress materials. In a nutshell, these are the baseline qualifications ensured by a third-party evaluation so that there is no sway. Qualifications ensure materials don't contain chemicals that could harm you, or that questionable substances aren't present in a finished mattress. For example, the most common and widespread memory foam certification you'll see if CertiPur-US. If a memory foam mattress has this certification, it ensures you're not sleeping on a finalized product that contains traces of things like mercury and formaldehyde. When it comes to organic products, we're used to seeing USDA organic for things like produce. But for mattresses, it can include things on a much grander scale, such as GOLS (Global Organic Latex Standard), which shows the latex in your bed is legitamite and manufactured to the highest standards.\n\nPower up with unlimited access to WIRED. Get best-in-class reporting and exclusive subscriber content that's too important to ignore. Subscribe Today.",
  "authors": [
    "Martin Cizmar",
    "Julia Forbes"
  ],
  "url": "https://www.wired.com/gallery/best-mattresses/"
}