{
  "title": "Democrats are debating how to approach the new Marjorie Taylor Greene",
  "text": "Democratic Rep. Jasmine Crockett watched GOP Rep. Marjorie Taylor Greene apologize on national television for her role in perpetuating divisive rhetoric and immediately instructed her staff to see if the Georgia Republican wanted to work with her on a bill addressing lawmaker safety.\n\nCrockett had reached out to Greene on the issue shortly after Charlie Kirk’s assassination in September, without response. But now, with Greene’s public rebuke of President Donald Trump and her own party, Crockett sees even more potential in teaming up.\n\n“If you can put Marjorie and myself as co-leads on anything, it automatically gets attention, and it also reveals to the American public that we can bridge these gaps if we just decided that we want to,” Crockett told CNN.\n\nThe pair don’t necessarily have a friendly history. Often seen trading insults during House Oversight Committee meetings, Crockett has dismissed Greene as racist and once referred to the congresswoman as a “bleach blonde, bad built, butch body.” No, Crockett said, she wouldn’t consider Greene a “Democratic bestie,” but she hopes they can develop a new working relationship.\n\nCrockett’s attempts to find common ground with Greene reflect a broader discussion in the Democratic Party about whether they should embrace Greene or if the congresswoman’s history of offensive, at times violent, rhetoric and conspiracy theories – often directed at Democrats – makes the idea just too unpalatable.\n\nIn conversations with over a dozen Democratic lawmakers and aides, the proverbial scars from Greene’s incendiary past statements cut deep and, as a result, there’s no clear consensus on how to best work with her in the future.\n\nGreene’s office declined to comment for this story, but she called for unity in her recent interview with CNN’s “State of the Union.”\n\n“I think America needs to come together and end all the toxic, dangerous rhetoric and divide. And I’m leading the way with my own example, and I hope that President Trump can do the same,” Greene told CNN’s Dana Bash.\n\nSome Democrats see opportunity\n\nIn their pursuit of circumventing House GOP leadership to force a vote on the release of the Jeffrey Epstein files, Democrats found an unlikely ally in Greene.\n\nEven though virtually all Republicans ended up voting for the measure, Greene was one of only four Republicans to buck their party and sign onto the petition that made Tuesday’s vote possible. It culminated in a shared embrace with Democratic Rep. Ro Khanna, a key Democratic backer of the effort, at a high-profile press conference on Capitol Hill (once strangers, the pair now texts) and laid the groundwork for some Democrats to start to see an opening.\n\nAnother area Democrats see as an opportunity to work together: The issue of rising health care costs and affordability.\n\nDuring the government shutdown, Greene openly vented about how health care prices for her family would double due to the expiring enhanced Affordable Care Act subsidies that were central to Democrats’ shutdown argument.\n\n“Not a single Republican in leadership talked to us about this or has given us a plan to help Americans deal with their health insurance premiums DOUBLING!!!” Greene wrote on X in October.\n\nHer criticisms reached the upper echelon of the House Democratic caucus.\n\nThe second highest Democrat in the House, Minority Whip Rep. Katherine Clark, said she was open to working with Greene on lowering the cost of health care and cost of living.\n\n“Our hand is always extended in bipartisanship, and we will work with anyone that is going to prioritize the economic needs of families at home and reduce their costs,” Clark said.\n\nGreene’s criticism of Israel in the war with Hamas has also brought her closer to some unexpected allies.\n\nMinnesota Democratic Rep. Ilhan Omar said that despite the pair’s charged history (Greene tried to censure Omar last year), she approached Greene on the House floor even prior to Greene’s apparent political breakup with Trump to thank her for speaking out on Gaza.\n\n“In regards to her stances and addressing the genocide, I have actually personally gone to thank her for that. I think it is important when somebody is doing a principled thing that we thank them for what they are doing,” Omar said of her conversation with Greene a few months ago.\n\nDemocratic Rep. Pramila Jayapal has even gone through the trouble of tracking down Greene’s cell phone number to thank her for being outspoken against Trump and the Republican Party and wants to suggest teaming up on the progressive priority of “Medicare for All.” It wasn’t something she ever thought she’d do.\n\n“But I also have worked with a lot of people that I disagree with on a lot of things,” Jayapal told CNN.\n\nDistrust remains\n\nNot all Democrats are quick to trust when it comes to the Georgia Republican, and some questioned the influence she has within her party to draw other Republicans to the table.\n\nMembers of the progressive group known as “the Squad” who were often the subject of Greene’s most vile attacks said they needed to see evidence that Greene’s arc was real and not just a publicity stunt.\n\nDemocratic Rep. Alexandria Ocasio-Cortez said she needs to see Greene’s words followed up by action and that it’s on Greene to reach out to make amends.\n\n“I personally believe that you never close the door to a person who wants to have changes in their life and in their heart, but they have to be genuine and they have to be authentic,” the New York congresswoman said. “It is incumbent upon her to repair the harm that she has done to people. It is not on the people she has harmed.”\n\nAs a candidate in 2020, Greene posted on her candidate Facebook page an image of herself holding a gun alongside images of Ocasio-Cortez, Omar and Rep. Rashida Tlaib and encouraged going on the “offense against these socialists.” Facebook took down the photo at the time.\n\nRep. Ayanna Pressley remembers that photo, but says she would be willing to work with Greene if the Republican show true change.\n\n“I am a Christian woman of deep faith, so I certainly believe in the capacity of people to evolve, to atone, and to redeem themselves. And if she is on a path to do that, that is extraordinary. And I need to see action that supports what she’s saying,” the Massachusetts Democrat said.\n\n“I never want to cause any harm or anything bad for anyone,” Greene told Bash on Sunday, saying she’d previously addressed her hateful comments.\n\nIn 2021, Greene also apologized for her offensive comments comparing Capitol Hill mask-wearing rules to the Holocaust after visiting the US Holocaust Memorial Museum in Washington.\n\nDemocratic Rep. Becca Balint who put forward a resolution censuring Greene in 2023, arguing she’s “fanned the flames of racism, antisemitism, LGBTQ hate speech, Islamophobia, anti-Asian hate, xenophobia, and other forms of hatred,” said Greene will need to be proactive if she is serious about making a change.\n\n“We all know politics always makes for strange bedfellows. In this instance, though, it has been truly remarkable and shocking to see her change of heart regarding nasty rhetoric. The only way for this to be anything other than just platitudes is for her to truly make amends to all the colleagues she’s hurt and put in danger,” Balint said.\n\nIf Greene were serious about showing her evolution many Democrats argued a great place for her to start would be supporting a congressional memorial to honor law enforcement caught in the January 6, 2021, attack on the US Capitol.\n\nDemocratic Caucus Chair Pete Aguilar, who formerly served on the January 6 select committee, said Greene having dismissed the violence that day and refused to accept Joe Biden as the rightful winner of the 2020 election make it hard for him to conceive of working directly with her.\n\n“Her positions on January 6th and supporting the ‘Big Lie,’ you know, would continue to be an issue. It’s not someone I choose to cosponsor legislation with,” Aguilar said. “But I appreciate that people evolve on certain issues and if she wants to work with us on health care issues, then I welcome that.”\n\nRelationships after Trump\n\nPart of the calculus for Democrats is that they want to show the capacity to forgive Republicans who are starting to grapple with what the future of their party looks like in a world where Trump will no longer be the ballot.\n\nDemocratic Rep. Jamie Raskin of Maryland went as far as to say the Democratic Party has a big enough tent that Greene could one day be a part of.\n\n“Obviously, Marjorie Taylor Greene would have a lot of political transformation to go through before she could come to the Democratic Party, but I do want to make the serious point that we have to be open to a lot of people who are refugees from the political corruption and authoritarianism of the Republican Party,” Raskin told CNN. “I hear from Republicans every day who say, ‘I can’t take it anymore.’”\n\nA senior House Democratic aide, pressed on the idea of Greene one day becoming a Democrat, quipped that “converts are the most devout.”\n\nBut even the Democrats who see the capacity for forgiveness acknowledge that it’s a long road ahead.\n\n“She’s got to do her own work. She’s on her own life journey,” Ocasio-Cortez said.",
  "authors": [
    "Annie Grayer"
  ],
  "url": "https://www.cnn.com/2025/11/20/politics/marjorie-taylor-greene-democrats"
}