{
  "title": "Historian Answers Latin American History Questions",
  "text": "Transcript\n\nI'm historian, Alex Avina.\n\nLet's answer your questions from the internet.\n\nThis is Latin America support.\n\n[upbeat music]\n\nConcerned dad asks, How many Latinos live in the US?\n\nMore than 65 million Latinos live in the United States\n\nas of our last Census report.\n\nIt is the single largest minority group\n\nin the United States.\n\n@Paulg9483 asks, I'm working on a timeline\n\nof Latin American history for my class.\n\nI'm going to start in 1492 with the Fall of Granada.\n\nWhat other five events I should include?\n\nWell, I guess Paul's asking me\n\nto do some of his work for him, which I will gladly do.\n\nSo let's follow Paul's plan,\n\nbecause 1492 is important for a variety of reasons.\n\nIn addition to the fall of Granada\n\nwe have October of 1492\n\nwhen Christopher Columbus stumbled\n\nonto what is now Latin America.\n\nIn the early 1700s the Bourbons take over the Spanish throne\n\ninstituting gradually a series of reforms\n\nthroughout the 1700s that will eventually trigger\n\na mass uprising throughout the region.\n\nI would say the third one would be the Haitian Revolution\n\nwhere a slave revolt led to the creation\n\nof a modern black state in the Americas.\n\nIt was an anti-capitalist, anti-racist,\n\nand anti-slavery revolution,\n\nfeared by all colonial powers around the world.\n\nSo revolutionary Haiti was extremely important\n\n'cause it helped inspire revolutionary efforts\n\nthroughout the Americas.\n\nNow this brings us to our fourth event that I would pick,\n\nLatin American Independence.\n\nNapoleon Bonaparte invaded Spain in the early 1800s\n\nand triggered a crisis of rule in Spain's American colonies\n\nwhere people on the ground did not know\n\nwho they were subject to,\n\nthis French installed government in Spain,\n\nor if they should start thinking about\n\nindependence themselves,\n\nwhich is what started happening\n\nin some of the major Latin American cities.\n\nSo by the mid to late 1820s, most of Latin America\n\nare independent from Spanish colonial power.\n\nOur next event is a Mexican American war,\n\nwhich is really important for\n\nthe country that my parents are from\n\nand the country that we're living in today.\n\nThe US invasion of Mexico in 1846\n\nresulted in the continental expansion of the United States\n\nfrom the Atlantic Ocean to the Pacific Ocean,\n\nbecause the United States took between a half to a third\n\nof Mexico's national territory.\n\nThis was the first time really, that the US invaded\n\none of its Latin American neighbors.\n\nBut you had really strong resistance in the US,\n\npeople from Frederick Douglass to Abraham Lincoln.\n\nThe final event that I would pick occurred in 1910,\n\nand we're talking about the 1910 Mexican Revolution,\n\nthe first great social peasant led revolution\n\nof the 20th century,\n\na phenomenon that would characterize\n\nthe 20th century globally from Mexico to Cuba,\n\nto China, to Nicaragua, to Iran.\n\nAnd we cannot forget the Russian revolution.\n\nAnd as we now know, thanks to recent research,\n\nFranklin Delano Roosevelt,\n\nthe New Deal in part was largely inspired\n\nby the Mexican revolution\n\nand its ideas of economic nationalism and social democracy.\n\n@ScrapIronLiver asks,\n\nNext door neighbors got all moved out yesterday\n\nand today there are approximately 15 people with jackhammers\n\nripping up all the tile and Mexican music at volume 11,\n\nand why does it sound exactly like Polka?\n\nThe reason Mexican regional music from the North,\n\nbanda music, norteno music sounds a lot like polka\n\nis because it has a lot of polka influence,\n\nand that's because you had European immigrants\n\nin the mid to late 19th century arrive in northern Mexico.\n\nHere's an example of banda music.\n\n[banda music]\n\nNow here's an example of polka music.\n\n[polka music]\n\nSounds similar, right?\n\nThe flow, the sound.\n\nLatin America is the crossroads of the world,\n\nand this one very particular musical form\n\nfrom northern Mexico shows how\n\nEuropean immigrants brought their sound,\n\nbrought their instruments, melded with local forms\n\nand produced something new, something popular,\n\nand in my opinion, something really enjoyable.\n\nEscape_Force asks, Where is El Dorado?\n\nEl Dorado the supposed city of gold and untold riches\n\nexisted in the minds of the Spanish colonizers\n\nand conquistadors.\n\nWhat fundamentally drove the myth of El Dorado\n\nwas how to become wealthy quickly\n\nthrough the acquisition of rich mineral resources,\n\nwhich then would allow them to become nobles.\n\nEven though El Dorado was a myth,\n\nit did drive actual expedition\n\nand travels from Spanish conquistadors\n\nfrom the Caribbean or from what is now Mexico North\n\ninto what is now North America to Florida,\n\nto what is now New Mexico.\n\nPeople like Coronado, like De Soto, like Ponce De Leon,\n\nwho had conquistadors experience\n\nand other parts of what is now Latin America,\n\nthey went on these searches for cities of gold\n\nand fountains of youth.\n\nThey failed to find those things,\n\nbut what they did accomplish\n\nwas to extend Spanish imperial power\n\ninto areas of what is now the United States,\n\nthat way precedes the arrival of the pilgrims\n\nand other English colonists.\n\nAnd this is one of the reasons why the language of Spanish\n\nhas existed in the United States longer\n\nthan the United States itself.\n\nThe next question comes from the subreddit\n\nHistoriansAnswered,\n\nWhat are the origins of the Day of the Dead\n\nand why did it emerge in Latin America uniquely?\n\nI would say that it didn't develop uniquely\n\nwithin Latin America,\n\nit developed in certain parts of Western\n\nand Southern Mexico.\n\nThere's still a debate between historians\n\nand anthropologists about the sources\n\nand the roots of this holiday\n\nthat is celebrated usually on November 1st and November 2nd.\n\nA lot of what we think are Day of the Dead celebrations\n\nthat have been long held for centuries\n\nare actually more recent interventions.\n\nActually, there had never been\n\na day of the dead celebration in Mexico City\n\nuntil a James Bond movie called Spectre\n\nwas filmed there in 2015,\n\nand they organized that day of the dead parade\n\nfor the sake of the movie.\n\nBecause it ended up being so popular,\n\nthe city government decided to make it a yearly event\n\nthat started in 2016.\n\nI'm sure we've all seen the movie Coco,\n\nthe symbol of the skeleton,\n\nthe symbol [speaking Spanish]\n\nthe spirit animals that are supposed to guide the dead\n\ninto the realm of the dead.\n\nAgain, all these things are facets and symbols\n\nthat have been incorporated\n\ninto the idea of day of the dead\n\nthat may have not existed for centuries,\n\nbut are actually been in existence only for decades.\n\nIamTaralee asks,\n\nSo Mexicans don't really celebrate Cinco de Mayo.\n\nI wonder why it's so big in America?\n\nThat's a really good point.\n\nIn Mexico, it's only celebrated\n\nin one really particular city, the city of Puebla,\n\nwhere this famous battle occurred in the 1860s\n\nbetween a poorly armed Mexican army that managed to defeat\n\none of the most powerful armies in the world.\n\nThe French under Napoleon III decided to invade Mexico,\n\npartly to get Mexico to pay back\n\nsome of the debts that they owed.\n\nOn the way to Mexico City,\n\nthey stumbled upon this ragtag Mexican army\n\nwhere on Cinco de Mayo, 1862,\n\nthe Mexicans managed to defeat this powerful French army.\n\nThe Mexican commanders who led the resistance\n\nat the city of Puebla\n\nwere loyal to then President Benito Juarez,\n\nMexico's first and only indigenous president.\n\nHe remained the steadfast leader of Mexico in resisting\n\nboth the French invasion and the puppet Habsburg Prince,\n\nNapoleon III had installed as the monarch of Mexico.\n\nIn the 1860s, Cinco de Mayo,\n\nbecomes a way for Mexicans living in the United States\n\nto affirm their Mexican identity\n\nto the point where some Mexicans\n\nactually traveled back to Mexico\n\nto fight against the French.\n\nIn the last 20 to 30 years, US companies in the US\n\nrealized that there was a big Mexican American market,\n\nso they started to commodify the idea of Cinco de Mayo\n\nso they could sell things like beer.\n\nThis went beyond the confines\n\nof the Mexican American community\n\nto the point where Cinco de Mayo has become\n\nreally an American holiday to have a good time.\n\n@BlackCaptain Queeg,\n\nDo you know where the term cowboy came from?\n\nWho were the original cowboys?\n\nThe original cowboys were vaqueros\n\nfrom Spanish-ruled Mexico.\n\nSpain, or the Iberian Peninsula\n\nwas ruled by different Islamic kingdoms\n\nfor at least seven centuries.\n\nSo the idea of a vaquero\n\nthat encapsulated also Islamic Arabic traditions.\n\nAlongside actual Spanish conquistadors and colonizers,\n\nwe had horses, we had sheep, we had pigs,\n\nwe had cattle who accompanied them,\n\nand that's where you get the vaquero emerging\n\nas the prominent livestock handler\n\nin the 16, 17, 1800s.\n\nSo by the time we get the American cowboy\n\nin the mid 19th century,\n\nthey were building and learning from\n\nlong held traditions of Spanish\n\nand Mexican vaqueros who had been around for a long time,\n\nwho were drawing from traditions\n\nthat went all the way back to Islamic-ruled Spain.\n\n@Normanlite7 asks,\n\nIs Brazil considered a part of Latin America?\n\n'Cause somebody told me it wasn't\n\nbecause they speak, I think Portuguese.\n\nBrazil is considered part of Latin America\n\nregardless of the linguistic differences.\n\nNow Brazil does follow a very unique historical trajectory.\n\nIt gains independence in a way different from\n\nSpain's colonies in the Americas.\n\nIt will have a monarchy up until the late 19th century.\n\nIt will be the last nation in the Western hemisphere\n\nto abolish slavery in the late 1880s.\n\nIt's also useful to remember that at different moments,\n\nthe Portuguese throne and the Spanish throne were one,\n\nthat's just one more reason to think about why\n\nBrazil is fundamentally part of Latin America.\n\n@adamgrubb15 asks, What do you say to Mexicans who say,\n\n'we didn't cross the border, the border crossed us'?\n\nHistorically they're right.\n\nIn 1826, this is what Mexico looked like.\n\nIt included a huge portion\n\nof what is now the Western United States.\n\nSo to really push through this point,\n\nI'll draw the old border on this current map\n\nof the United States and Mexico.\n\nThe old border used to start contemporary Oregon,\n\nwork its way down all the way to the border between\n\nTexas and Louisiana.\n\nThis used to be Mexico\n\nafter it achieved independence from Spain.\n\nIn 1835, we have the outbreak of a rebellion in Texas\n\nagainst the central government in Mexico,\n\nthis will lead to the battle of the Alamo.\n\nThis will lead to Texan independence\n\nfrom 1836 up until 1845.\n\nWhat we now recognize as the US-Mexico border\n\nemerges as a consequence of the US Mexico war\n\nfrom 1846 to 1848.\n\nUnited States sent a force marching through Texas,\n\nthat force eventually becomes\n\nbogged down in a lot of fighting\n\nin what is now the north of Mexico.\n\nPart of the reason why they get bogged down\n\nis because hundreds of mostly immigrants\n\nwho are fighting for the US Army\n\ndecided to defect over to the Mexican side.\n\nThey formed something called the St. Patrick's Battalion\n\nLos San Patricios,\n\nand they formed the light artillery unit of the Mexican army\n\nand they fought against the Americans\n\nand put up pretty stiff resistance.\n\nThe United States sent a different force from New Orleans\n\nand they eventually make it to Mexico City\n\nafter a series of really important battles.\n\nBy September October of 1847,\n\nthe American flag will be flying over the Zocalo\n\nof Mexico City.\n\nHere's a question from the AskLatin America subreddit.\n\nHow would you group Latin American countries together\n\ninto regional cultural groupings?\n\nLatin America is an extremely diverse place.\n\nIt includes more than 650 million people,\n\nmore than 30 countries, more than a hundred languages,\n\nincluding European-based languages and indigenous languages.\n\nWe can think about Spanish-speaking countries,\n\nPortuguese being spoken in Brazil.\n\nWe can talk about French\n\nand English being spoken in some Caribbean basin nations.\n\nHistorically, we can think about Latin America before 1492.\n\nWe have power centers\n\nin particularly in what is now central Mexico\n\nwith the Mexica, or more commonly known as the Aztecs.\n\nWe still have groups in Oaxaca,\n\nthe Zapotec or the Mixtec.\n\nWe have the famous Mayans\n\nthat lived in Southern Mexico and Central America.\n\nMesoamerica was a rich, diverse area.\n\nThere were certain cultural traits that shared\n\nspiritual and religious deities.\n\nOne interesting thing to think about is the ball game\n\nplayed by two indigenous teams,\n\nthat ball game stretched all the way\n\nfrom what is now Florida to Central America.\n\nIf we work our way down to South America,\n\nwe have different Andean civilizations\n\nthat had been there for thousands of years.\n\nBefore 1492 we have the powerful Inca Empire.\n\nIn the Caribbean region we have the Taino peoples as well\n\nwho spread throughout different Caribbean islands.\n\nThe Amazon basin was also a powerful indigenous center\n\nof cultural and economic practices.\n\nAnother way to group this area is to think about\n\nthe type of imperial influences\n\nin the 19th and early 20th century\n\nand how that imperial influence\n\nmanifested itself culturally.\n\nSo for instance, in South America,\n\nsoccer is a big national pastime.\n\nIn a place like Argentina, it's basically the religion.\n\nDiego Armando Maradona has his own church.\n\nA lot of these soccer teams in Argentina have English names.\n\nWhy? Because it was the British who took soccer there\n\nin the 19th century\n\nwhen Britain was really the commercial imperial power\n\nover South America.\n\nBut we work our way North to the Caribbean,\n\nto Northern Mexico there the most popular sport is baseball.\n\nWherever baseball is the most popular national sport\n\nthat reflects a past history of US influence\n\nand intervention in that place, including Cuba,\n\nwhere Fidel Castro was an avid baseball player and fan.\n\n@Blairwaldorfyan asks, Can someone explain to me\n\nwhy Frida Kahlo is treated as such a legend\n\nwhen she was emotionally a slave to an ugly man?\n\nSome might find Diego Rivera handsome, some might not.\n\nFrida did develop a very strong emotional relationship\n\nthat they maintained throughout the duration of her life\n\nuntil she died in the 1950s,\n\nthat kept them together despite the Diego Rivera's inability\n\nto remain a monogamous partner.\n\nFrida also maintained her own liaisons\n\nand relationships with people.\n\nOne of the alleged liaisons\n\nwas with Russian revolutionary Leon Trotsky,\n\nwho arrived in Mexico in the 1930s\n\nseeking safe haven from the Soviet Union.\n\nI think she's fundamentally a legend\n\nbecause of her talent as an artist,\n\nbecause of her honesty and her rawness as an artist\n\nwho was able to convey the emotional\n\nand physical pain that she experienced on a daily basis.\n\nFrida Kahlo suffered an accident\n\nwhen she was a young woman in a streetcar\n\nin which essentially a pole broke and pierced her body.\n\nShe had to go through multiple medical treatments,\n\nshe was in constant pain.\n\nBeyond her amazing paintings and her artwork,\n\nshe was also an ardent committed political activist\n\nin 1920s, 1930s Mexico.\n\nShe was a committed Marxist\n\nwho supported communist causes around the world.\n\nDiego Rivera also an impressively talented,\n\ninfluential Mexican muralist.\n\nSo they also shared a very strong political connection.\n\nIf you've looked at Diego Rivera's murals,\n\nthe common theme is that it's the everyday people of Mexico,\n\nthe workers and the peasants who have made that country\n\nand made that country's history.\n\nSometimes when Frida comes up\n\nin more mainstream popular conversations,\n\nshe's deprived or drained\n\nof the really radical political commitments\n\nthat she believed in and she practiced when she was alive.\n\nI think about how during her funeral\n\nthere was a flag placed on top of her coffin,\n\nthe flag of the hammer and sickle.\n\nSo Frida remained a radical left wing activist and painter\n\nuntil the moment she died.\n\nSo here's a question from Quora.\n\nWho is the coolest historical figure\n\nyou never learned about in school?\n\nSo many.\n\nSo, so many.\n\nMicaela Bastidas, who was a military indigenous leader\n\nduring the Tupac Amaru Rebellion in the Andes\n\nin the late 1700s.\n\nShe was married to Tupac Amaru II.\n\nShe was a very important figure in that movement\n\nthat almost managed to overthrow Spanish colonial rule\n\nin what is now Peru and Bolivia.\n\nThe coolest figure that folks may have heard about\n\nis Simon Bolivar of South America.\n\n@Livvyonce asks, Who the [beep] is Simon Bolivar?\n\nHe's the independence hero of Latin America,\n\nkind of like the George Washington.\n\nHe helped liberate South America from Spain in the 1820s.\n\nHe did a interesting pincer movement\n\nwhere he liberated the North and moved his way South.\n\nHis compatriot and revolutionary partner,\n\nJose De San Martin based in Argentina,\n\nliberated the South of South America\n\nand moved their way North.\n\nHe is a complicated figure.\n\nHe had a grand vision of uniting\n\nat least the North of South America\n\ninto one big entity called La Gran Colombia,\n\nwhich would include the current day, Venezuela,\n\nColombia, and Ecuador.\n\nIt lasted for a few years after independence in the 1820.\n\nOne of the tragedies of Simon Bolivar is that\n\nhe dies in 1830, embittered, very authoritarian.\n\nYou know, one way that he thought\n\nthat he could keep La Gran Colombia together\n\nwas by demanding that he be made President for life,\n\nwhich was rejected by people in Venezuela,\n\nColombia, and Ecuador.\n\nGabriel Garcia Marquez, a great Colombian novelist,\n\nhas a great novel that captures the end\n\nof Bolivar's life called The General in His Labyrinth\n\nthat I highly recommend.\n\nYou have countries named after him,\n\nso when we think about Bolivia,\n\nthis is a testament to the lasting impact\n\nof someone like Simon Bolivar.\n\n@Cub527 asks, How accurate is the Netflix show 'Narcos'?\n\nI get this question a lot from my students.\n\nIt's undeniable that there was a lot of drugs\n\ncoming into the United States in the 1970s, in the 1980s.\n\nCocaine changed the dynamic of the global drug trade\n\nin a variety of different ways.\n\nOne of the things that's problematic\n\nabout the Colombian Narco series\n\nis that the only perspective we get\n\nis that from DEA agents who were sent into Colombia\n\nto fight the Medellin cartel led by Pablo Escobar,\n\nand that leads to a lot of historical distortions\n\nin terms of Colombian history,\n\nin terms of Colombian political systems.\n\nThe Mexico one is more interesting\n\nbecause the producers and the directors\n\ndo try to provide other perspectives.\n\nNow in the Mexican Narcos\n\nwhen the ruling PRI party was on the brink of losing power\n\nover the President for the first time in seven decades,\n\nthey were facing the challenge of Cuauhtemoc Cardenas,\n\nthe son of Mexico's most beloved president\n\nof the 20th century.\n\nThe day that their votes were being counted,\n\nthe computers that were used to tally the votes\n\nmysteriously crashed.\n\nThis led to one of the most infamous quotes\n\nin recent Mexican history\n\nwere one of the government ministers came out\n\nand said, [speaking Spanish], the system broke down.\n\nAt that point, we think, I think we're pretty sure,\n\nthat Cuauhtemoc Cardenas,\n\nthe opposition candidate was winning,\n\nwas ahead in the vote count.\n\nWhen they restarted the computers\n\nmiraculously the PRI candidate,\n\nCarlos Salinas de Gortari wins the election,\n\nwins, and wins the presidency.\n\n@Watercloset, How did the United States come to be\n\nin possession of Guantanamo Bay?\n\nCuba had fought for its independence against Spain\n\nnumerous times over the course of the 19th century,\n\nthe last effort began in 1895.\n\nAnd in 1898 when it seemed to be heading closer\n\nto gaining its independence from Spain,\n\nthe US intervened militarily.\n\nWhen the battleship Maine sailed into Havana Harbor\n\nand mysteriously blew up,\n\nthe United States used that as an excuse\n\nto intervene in the Cuban War of Independence,\n\nat which point it became the Spanish American War,\n\na war between the United States and Spain.\n\nIt was a very short war,\n\none American government official\n\nreferred to it as a splendid little war.\n\nThe United States after signing a peace treaty with Spain\n\nobtained Puerto Rico as a colony,\n\nthe Philippine Islands as a colony, Guam as a colony.\n\nIn that same peace treaty,\n\nCuba was to be granted independence,\n\nbut the United States remained.\n\nPart of that negotiation also involved\n\nthe perpetual leasing of Guantanamo\n\nfor the purposes of creating a US naval station.\n\nEvery year to this day,\n\nthe US deposits money into an account\n\nthat is supposed to be paying for the lease of Guantanamo.\n\nSince at least the early 1960s,\n\nthe Cubans refuse to cash the American check for Guantanamo.\n\nUlteriorkid324 asks,\n\nWhy did Cuba become a pain in ass to the United States\n\nfor more than half a century?\n\nNow, obviously, this guy is the representation\n\nof Cuba being a pain in the ass in the United States,\n\nFidel Castro, who outlived\n\na series of different US presidents.\n\nBut we really have to go back all the way back\n\nto the 1898 Spanish American War\n\nin which Cuba was granted independence from Spain.\n\nThe reason why I put up air quotes\n\nis because Cuba essentially became a sugar colony\n\nfor the United States well into the 1930s.\n\nThis created all sorts of political\n\nand socioeconomic consequences in Cuba,\n\nit led to the rise of a dictator Fulgencio Batista\n\nin the early 1950s.\n\nA motley crew of rebels,\n\nof students, of campesinos, of activists,\n\nand one Argentine medic by the name of Che Guevara,\n\nthey launched a rebellion against Batista in 1956,\n\nand after a few years of combat,\n\nthey managed to ous Batista on January 1st, 1959.\n\nFrom the very beginning, there was tensions\n\nwith the United States,\n\nby the middle to end of 1959,\n\nwe have US declassified documents that are talking about,\n\nyou know, we don't like what this Fidel Castro guy\n\nis doing in Cuba,\n\nwe should think about removing them from power.\n\nThis leads to an attempt to invade Cuba,\n\norganized by the United States\n\nbut carried out by Cuban exiles\n\nwho are opposition to the M26 movement,\n\nthis is called the Bay of Pigs, this occurs in 1961.\n\nThe revolutionary Cuban government\n\nmanages to stave off the invasion,\n\nand in that Cold War era, Cuba is looking for allies,\n\nso they looked for that other big power\n\nin the world at that time, which was the Soviet Union.\n\nThat's really the moment when Cuba becomes\n\na big pain in the ass to the United States.\n\nFundamentally, it has represented a big middle finger\n\nto what the US tries to do in the region,\n\nand this is one of the reasons why\n\nthis blockade embargo that the US has instituted\n\nagainst the island since the early 1960s\n\ncontinues in place and actually has been intensified\n\nand worsened in the last 10 years.\n\nMexicanSoda asks, I was told that the Mexican revolution\n\nof 1910 was a unique one in that\n\nas opposed to most other revolutions,\n\nit was actually led by the poor masses.\n\nHow true is this?\n\nWell, it's complicated.\n\nIt was a unique, authentic social revolution\n\nin that the peasant masses of Mexico\n\ndid force it initially\n\nagainst the three decade long dictatorial rule\n\nof someone named Porfirio Diaz.\n\nHe allied himself with landed elites, foreign interests,\n\nwho collectively work to take away the communal lands\n\nof different Mexican peasant communities\n\nover the course of two decades.\n\nThat's what really triggers the Mexican revolution in 1910.\n\nLed by Francisco Madero, a wealthy landowner\n\nwho had been left out of the Mexican political system\n\nwho helps launch a revolution in 1910,\n\nthey overthrow Porfirio Diaz relatively quickly,\n\nand by 1911 Madero is president of Mexico.\n\nHe will then soon come into conflict\n\nwith radical peasant leaders like Emiliano Zapata,\n\nthe leader of the most radical peasant movement\n\nof the South,\n\nand this is Pancho Villa of the North.\n\nThey would take the defeat\n\nof radical peasant leaders like Zapata and Villa\n\non the battlefield, before middle class revolutionaries\n\ncould then incorporate some of these demands\n\ninto the 1917 Constitution,\n\nwhich remains to this day with some modifications,\n\nthe constitution of Mexico.\n\nSo by the way, the figure of Pancho Villa\n\nends up becoming extremely important,\n\nnot just within Mexico but outside of it.\n\nNow, Pancho Villa was a darling of US media and film.\n\nHe had us film crews accompanying him\n\non his battles 1914, 1915,\n\nbut then he became the ultimate villain,\n\nbecause in 1916,\n\nafter having lost militarily on the battleground,\n\nhe's left with only a few hundred fighters\n\nso Pancho Villa came up with this idea,\n\nwhy don't I invade the United States?\n\nAnd he did.\n\nHe invaded Columbus, New Mexico in 1916.\n\nFrom MoonSpecter, Why did Pancho Villa attack\n\nColumbus, New Mexico?\n\nHe wanted to trigger a US invasion of Mexico\n\nto create a quagmire on the one hand for the United States,\n\nbut on the other hand,\n\nto make the current revolutionary leaders of Mexico\n\nled by a man named Venustiano Carranza,\n\nlook like they were selling out the country,\n\nand thereby allowing him the opportunity to capture\n\nhis military and political stature.\n\nPancho Villa led La Division del Norte,\n\nthe Division of the North.\n\nIt was a peasant army of more than 40,000 troops.\n\nThey had hundreds of railways and trains.\n\nThey even had their own air force\n\nwith mercenary foreign pilots.\n\nAll that ended after his defeats in 1915.\n\nThe invasion of Columbus, New Mexico,\n\nhe thought would be his opportunity to reclaim the mantle\n\nof anti-imperialist, anti-US leader.\n\nAnd it almost worked\n\nbecause the US did invade Mexico in return.\n\nThis led to the punitive expedition\n\nled by General Jack Pershing,\n\nwhere for months he traveled around,\n\nhim and his American troops,\n\nincluding troops from the Buffalo Soldier Regiment,\n\nincluding the indigenous scouts.\n\nFor months, they scoured the Northern Mexican countryside\n\ntrying to locate Pancho Villa.\n\nThey could never capture him.\n\nPancho Villa used to put the shoes on his horses\n\nin the wrong way so it looked like\n\nhe was going in one direction\n\nwhen he was actually going in the opposite direction.\n\nThere's an anecdote\n\nwhere supposedly Pancho Villa is up on a hill\n\nwatching the Americans withdraw from Mexico,\n\nand he's purported to have said,\n\nThey came like eagles and they left like wet hens.\n\n@QueenRoyce15 asks, Why telenovelas\n\ngot to be so damn dramatic?\n\nIt's like one disastrous decision event after another.\n\nY'all be really salado AF in life.\n\nGo to a spiritualist para que te lipien.\n\nI love this question.\n\nTelenovelas are Latin American soap operas.\n\nIn the late 19th century, early 20th century,\n\ntheir version of the telenovela was a novel form\n\nthat always followed the same kind of plot and guidelines,\n\nthat poor, racialized, working class woman strikes it rich\n\nbecause she managed to fall in love\n\nwith a wider, upper class, wealthier man,\n\nand in them coming together and having kids\n\nthat representing some form of national unity.\n\nWithin these Latin American countries,\n\nthis plot is a fantastical one.\n\nIn a place like Mexico where you still have racial\n\nand class considerations to take into account,\n\nwhen we think about class mobility.\n\nIn the Mexican soap operas\n\nthat I was forced to watch growing up,\n\nthere was a phenomenon of mostly\n\nwhite Mexican actors and actresses\n\nessentially playing brown face, Mexican face,\n\nwhen they played the role\n\nof the poor working class woman.\n\nSo obviously there's a fantasy\n\nand then there's a reality in Mexico\n\nwhere poverty still looks, let's say,\n\ndarker skinned than some of the displays of this\n\nin telenovelas.\n\nYellowLemonBikini asks,\n\nFavorite films to represent Latin American culture?\n\nOne notable film would be\n\nthe classic three part documentary series\n\nby Patricio Guzman about Chile called [speaking Spanish]\n\nThe Battle of Chile,\n\na documentary that captures\n\nthe Chilean attempt to wage a peaceful revolution\n\nin the early 1970s led by President Salvador Allende.\n\nPatricia Guzman filmed this documentary series\n\nduring the overthrow of Allende\n\nled by Chilean General Augusto Pinochet.\n\nThis was the one attempt in Latin America\n\nto achieve socialism through peaceful,\n\nlegalistic constitutional methods.\n\nSalvador Allende, a self-declared Marxist doctor\n\nwas elected to be president of Chile.\n\nThis unleashed ferocious reaction\n\nfrom the Chilean right wing\n\nthat culminated in the coup d'état on September 11th, 1973.\n\nThe US didn't play a direct role,\n\nit did play an indirect role\n\nin helping foment the conditions for a civil war in Chile\n\nby essentially launching\n\nan economic blockade of this country for three years.\n\nPresident Richard Nixon said that he wanted to make\n\nthe Chilean economy scream.\n\nNow we have an infamous quote from Henry Kissinger,\n\nthen National Security Advisor,\n\nin which he said something to the extent of,\n\nwhy should we let a country go communist\n\ndue to the irresponsibility of its own people?\n\nAnd that quote captures so much of the relationship\n\nbetween Latin America and the United States\n\nduring the Cold War.\n\nThe next question is from Quora,\n\nHow did the Che Guevara t-shirt become popular?\n\nChe Guevara had a significant historical role\n\nin Latin America, particularly during the Cold War era.\n\nChe Guevara Came from Argentina.\n\nHe studied to be a medical doctor.\n\nHe traveled throughout Latin America in the 1940s and '50s\n\nwhere he discovered and encountered\n\nfor the first time really, social, economic\n\nand racial inequality in the region,\n\nit started to radicalize him politically.\n\nThat process eventually took him to Mexico,\n\nwhere he met, one, Fidel Castro,\n\nand he joined the M26 movements\n\nattempt to overthrow a dictator in Cuba,\n\nand this leads us to the Cuban Revolution\n\nwhere Che Guevara an international symbol\n\nof revolution, of Marxism, of rebellion.\n\nChe Guevara was an internationalist.\n\nHe believed in spreading revolution\n\nthroughout what we now refer to as the global south.\n\nHe attempted to wage revolution in Africa.\n\nAfter that episode,\n\nhe went and tried to start a revolution in South America.\n\nHis idea was to spread a revolution from Bolivia\n\nto the rest of South America,\n\nincluding his own home country of Argentina.\n\nIn Bolivia is where he met his end in October of 1967.\n\nThe next question is from TheAskLatinAmerica subreddit.\n\nHow do you feel about people calling Miami\n\nthe capital of Latin America?\n\nMiami is a really interesting case.\n\nIt has a very recent Cold War history\n\nthat witnesses generation after generation\n\nof Latin American migration to the city\n\nas a consequence of different revolutionary processes\n\nthat happen in Latin America during the Cold War.\n\nPopulations who saw themselves as losers\n\nof a particular political or revolutionary process\n\nwould then go to Miami.\n\nSo we have Cubans,\n\nwe have Nicaraguans who fled the 1979 Sandinista Revolution.\n\nWe had Venezuelans who left during the presidencies\n\nof Hugo Chavez and Nicolas Maduro.\n\nYou have different Colombian generations\n\nand Brazilian generations as well.\n\nThis history of constant migrant and refugee flows to Miami\n\nallow us to think about Miami\n\nas not the capital of Latin America,\n\nbut as one capital of Latin America.\n\nSo those are all the questions for today.\n\nThanks for watching Latin America Support.\n\n[upbeat music]",
  "authors": [
    "Condé Nast"
  ],
  "url": "https://www.wired.com/video/watch/tech-support-historian-answers-latin-american-history-questions"
}