{
  "title": "Opinion | Jeffrey Epstein’s Victims Are the Real Story",
  "text": "If you’ve been reading the Jeffrey Epstein emails or following the discussions about them, there are names you’re probably seeing: Michael Wolff, Peter Thiel, Larry Summers, Noam Chomsky, the commoner formerly known as Prince Andrew, Peggy Siegal, Kathryn Ruemmler, Deepak Chopra. Politicians and celebrities, business leaders and academics, friends and frenemies — a boldfaced roster of the famous and the infamous who corresponded with the convicted sex offender, attended his dinner parties or sought his counsel.\n\nThere are other names you might not be seeing at all: Courtney Wild, Rachel Benavidez, Michelle Licata, Maria Farmer, Annie Farmer, Liz Stein, Jess Michaels, Marina Lacerda, Danielle Bensky, Anouska De Georgiou, Shawna Rivera. Those are some of Jeffrey Epstein’s victims, scores of whom have come forward and accused Mr. Epstein of sexually abusing them.\n\nThe women’s names have been redacted from the 20,000 pages of documents that Congress released last week. But often no redaction was necessary, because there’s no name to be covered up. In Mr. Epstein’s world, and in his gossipy, elliptical, frequently misspelled correspondence, women were often described by categories: “hawain tropic girl,” “my 20 year old girlfriend in 93,, that after two years i gave to donald,” “girls in bikinis” or, simply, “the girls,” as in, Donald Trump “knew about the girls.” In her memoir, Virginia Roberts Giuffre, the best known of Mr. Epstein’s survivors, wrote that he “liked to tell friends that women were merely ‘a life-support system for a vagina.’” Twenty years after Mr. Trump mused about grabbing women by the genitals, Mr. Epstein’s emails are an unwelcome reminder of how some powerful men think and talk about women.\n\nMr. Trump’s base spent more than a year calling for the government to release its files on Mr. Epstein, in large part because the base thought they would expose powerful Democrats. Now Democrats are picking through the tranche looking for something damning about Mr. Trump.",
  "authors": [
    "Jennifer Weiner"
  ],
  "url": "https://www.nytimes.com/2025/11/19/opinion/epstein-files-victims.html"
}