{
  "title": "Bronze Age to Elphaba: The centuries-old origins of the witch's hat",
  "text": "As Wicked: For Good is released, what are the historic meanings of conical headwear, and how has it evolved – from its origins in the ancient world, the Middle Ages and the Spanish Inquisition, to the empowered Elphaba?\n\nWhat's the first image you associate with the witch? Might it be the broomstick, which was first linked to sorcery and heresy in 1342 when Irishwoman Lady Alice Kyteler was accused of witchcraft? An investigator, on searching her home, found the offending item, \"upon which she ambled and galloped through thick and thin\". Or perhaps it's the cauldron, where potions were brewed in William Shakespeare's The Tragedy of Macbeth \"Double, double toil and trouble; Fire burn and cauldron bubble\" was the witches' now iconic incantation.\n\nGetty Images Tall pointy hats – otherwise known as capirotes or corozas – were used in history as a tool of persecution (Credit: Getty Images)\n\nBut perhaps the most enduring image of the witch is the conical hat, seen in Frank L Baum's 1900 classic children's novel, The Wonderful Wizard of Oz; in 1939 film The Wizard of Oz and the Wicked Witch of the West's frightening depiction by Margaret Hamilton; in the opening cartoon credits of 1960s sitcom Bewitched; in the Harry Potter films; and of course Cynthia Erivo's portrayal of Elphaba in the Wicked film adaptation, set to defy gravity once again when the concluding instalment, Wicked: For Good lands in theatres on 21 November.\n\nSome of the earliest examples of conical hats are majestic, gold, tapered headpieces decorated with astronomical symbols from the Bronze Age, when it was said that the priests who likely wore them had divine knowledge and power. Pointy hats were found on the heads of Chinese mummies from the 4th to 2nd Centuries BC, earning them the modern nickname \"The Witches of Subeshi\" when their graves were unearthed in 1978.",
  "authors": [],
  "url": "https://www.bbc.com/culture/article/20251119-the-5000-year-old-origins-of-the-witchs-hat"
}