{
  "title": "Letterboxd to launch new movie rental feature in December",
  "text": "Social film discovery platform Letterboxd is set to launch a new digital video store in early December, allowing users to rent movies directly on the platform. The company first announced the feature in March during the Cannes Film Festival but didn’t provide a specific launch date at the time.\n\nIn a recent blog post, the company shared further details about “Video Store,” which will feature a range of films. The selection will include “festival standouts” that haven’t yet been widely distributed, films that have been largely unavailable but frequently watchlisted by users, recent restorations, and other special limited-time releases.\n\nLaunching a video store feels like a natural evolution for Letterboxd, allowing users to rent movies instantly without having to navigate away from the platform. One of the key advantages of renting from Letterboxd, compared to other established platforms like Apple or Amazon, is its social discoverability features. If you notice a friend has logged a movie, you can check out their review and decide to rent it right then and there.\n\nThe movie selection will also be based on what members actually want to watch, using data from the platform’s watchlists and activity. Rather than offering a random mix like some streaming services, the selection will feel more curated.\n\nLetterboxd has not yet announced the initial lineup of films or rental prices, but the company said users can expect rental availability and costs to vary by location. Notably, the platform won’t operate on a subscription model, and there won’t be late fees.\n\nThe new feature will be compatible with iOS and Android devices, as well as Apple TV, Android TV, Chromecast, and AirPlay, with additional smart TV apps coming later.\n\nSince its acquisition by Canadian firm Tiny for around $50 million in 2023, Letterboxd has been actively updating its platform to improve discovery for movie buffs. Recently, it introduced “Featured Lists,” which helps users discover movie collections organized by genre, studio, and themes like female directors. Last year, the company also upgraded its search functionality to be more advanced, capable of understanding acronyms, and even correcting misspellings.",
  "authors": [
    "Lauren Forristal",
    "Sarah Perez",
    "Julie Bort",
    "Lorenzo Franceschi-Bicchierai",
    "Ram Iyer",
    "Connie Loizos",
    "Anthony Ha",
    "Rebecca Bellan",
    "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var",
    "Media"
  ],
  "url": "https://techcrunch.com/2025/11/20/letterboxd-to-launch-new-movie-rental-feature-in-december/"
}