{
  "title": "How to Get Through the School Year as a Transgender Parent",
  "text": "There aren’t many parents like me in the world. I’m a transgender woman, and I’m so lucky to be able to watch this small human, who is the embodiment of the love my partner and I share, grow up. Getting to be a parent is, by far, my greatest accomplishment.\n\nBut it’s also a lonely journey. I’m a rarity, so I’m often seen as an oddity. Because of this, I’ve always dreaded my child becoming old enough to go to school. Around the country, schools have been unfair, even cruel, to transgender people. Both transgender students and parents have been under attack, and even my hyper-liberal New York City school district is not immune to that.\n\nBut we will persist, not just for ourselves but so we can be completely and wholeheartedly present for our kids. And because we need each other’s support, here is my advice to other transgender parents and their supportive allies for getting through the school year.\n\nAdvertisement\n\nBe prepared for questions (and answer them authentically).\n\nIn my neighborhood, people either know me as Lara or as “Maddy” (a mash-up of mommy plus daddy). Maddy is the name I wanted my child to associate me with since they were born. As a trans person, I’m not limited by the gender hang-ups that many other parents have, and this name was part of my path to expressing that openness to my child and everyone else.\n\nIn my kid’s school, the name caught on quick. Anytime I would take them to the park or visit the school, I’d hear cheers of “Maddy! Maddy is here!” It made me feel like a celebrity with thousands of tiny fans.\n\nEvery once in a while it would get complicated. One day I overheard one of the kids at the playground misgender me to my child. “Your Maddy is a daddy,” she said. I immediately began to move through my feelings of dysphoria as I approached them in the sandbox. But I didn’t correct them, bring up pronouns or start a Trans 101 class. There was no need to. We simply played café together under the shade of the playground equipment. I’m a feminine person with an AMAB body. I’m a Maddy living as a mommy, born with the body of a daddy. If they ask, I’m happy to talk about it, but kids rarely overcomplicate it. Adults do enough of that for everyone.\n\nAdvertisement\n\nSchools are full of young people gaining information, building their personality and learning who they are. It’s inevitable that they’ll be curious about transgender people. “Are you a he or a she?” “Why are you dressed like that?” These types of questions take a great deal of confidence and patience to navigate. It’s a good idea to consider them before the questions are asked and your child is standing beside you, listening.\n\nFight without fighting.\n\nIt was around the time my wife was pregnant that the Republican Party launched a wave of anti-transgender legislation and the right-wing “grooming” conspiracy gained traction — targeting the transgender community and my family. I thought New York City was safe from this until I heard stories from transgender friends about being attacked on the subways and being called pedophiles because of their identity. Soon afterward, Resolution 248 was introduced in my child’s school district, which would ban transgender girls from competing in sports. Most of the parents in the school were outraged and joined me in tearing off anti-transgender stickers and posters that were plastered around the neighborhood.\n\nAnti-transgender propaganda unearthed bigots all over the country, including a few in my progressive city. All the parents in my child’s class were supportive of my family, except one. This parent and I used to speak every morning. We went to coffee together — I even once escorted her to a dental surgery.\n\nAdvertisement\n\nSuddenly she stopped responding to my texts and would look away when I waved good morning. After the anti-transgender wave of bigotry hit my neighborhood, she never spoke to me again. I can’t help but assume what this distance was about. I’d see her almost every morning, in front of the school, for drop-off. We stood next to each other, and she pretended I wasn’t there. When her child would reach out to my child, one of her best friends, her mother pulled her away.\n\nI teach self-defense classes for marginalized groups, and I encourage people, in conflict, to fight without fighting. I believe that it’s always better to passively redirect than to have conflict in which you appear aggressive. The police and authority figures may not have your side — especially if you’re a person of color. Sadly, I had to apply this teaching in this situation.\n\nParents will do anything to protect their children from whatever they deem to be a threat. The danger comes when they see you as a threat because of your identity. It hurt seeing a person I thought was my friend begin to see me as a threat. I thought of the many times I had made her kid laugh or saved her from falling at the playground. Now suddenly I had become a pariah. If I had confronted her, I could have compromised my own safety. So I stood there — a few feet next to her, for half of the school year ― in silence.\n\nAdvertisement\n\nShe’s not the only person I had potential confrontations with, and I’m sure she won’t be the last. Instead of wasting time and energy trying to address her change in behavior, I spend my time volunteering with the PTA and organizing school events. I will happily spend my energy being the opposite of whatever monster they believe me to be.\n\nStay as informed as possible.\n\nDo you know the laws related to your identity in your state? It’s a heartbreaking question to ask and a devastating topic to have to research. The way a person was born should never be the basis of whether they get to live a normal life.\n\nFor transgender parents, it’s vital to be informed about the laws that are enforced, as well as about the officials who represent your area. Not only will you know whether or not you can take your child to the bathroom, but you will also have a better idea of the political climate where you live. I find that you’ll get a solid idea of who will be accepting of transgender families by figuring out the percentage of people who vote red or blue in an area.\n\nAdvertisement\n\nI’m optimistic that we live in a compassionate world whose laws are mostly governed by fearful people. And compassion will overcome fear. But for now, we have to be careful. There are maps tracking anti-transgender bills that can help keep you informed.\n\nFind your allies.\n\nAt my school, there was a drama teacher named George who identified as a cisgender man. Every day, George would teach the children to sing, dance and express their feelings in a fun way. For the first half of the school year, George wore a big fluffy skirt on top of his khaki pants and polo shirt. Some days the skirt would be rainbow and other days it would be pink. The kids would say, “George is a princess!”\n\nGeorge would respond by saying, “Anyone can be a princess.” Then he would spin around and flourish the skirt with his hands. Needless to say, I’m thankful for George.\n\nAdvertisement\n\nMy experience would have been much different if I lived in the South, where I grew up. In places like that, people like George are prayed for, denounced and punished until they conform to binary gender. Still, even in the most restrictive places, you can always find a compassionate person who will stand up for you. Are there teachers sneaking Pride flags on the walls? Is there an LGBTQ support group in the area?\n\nFinding allies may mean searching for that one person in the school who gets it and making gradual change for the next generation of students. Or it could mean leaving for your own safety and mental well-being. Parenting takes a village, and you have to make sure your village has your best interest in mind. Your safety could depend on it.\n\nKnow your worth.\n\nAny child with a transgender parent is lucky. Their childhood is a gift that most children will never experience. They get to live with a person whose experience encompasses a life without boundaries. Breaking through the gender binary leads to breaking through other unnecessary rules. The child of a transgender person will be armed with concepts that most other children may never grasp.\n\nAdvertisement\n\nI carry valuable insight that came from overcoming the difficulties of my experience as a transgender woman in the military and in the South. These are gifts I pass on to the people in my life, whether they’re cisgender or not. I rarely meet someone, of any age, cisgender or trans, who hasn’t been able to gain some important insight into their own problems from my experience. And I rarely meet another trans person who doesn’t teach me something about myself.\n\nBecause of the constant barrage of anti-transgender propaganda that I and everyone else is exposed to, I have to constantly remind myself of how important my existence is. You will have to remind yourself how valuable you are, too.",
  "authors": [
    "Contributing Writer"
  ],
  "url": "https://www.huffpost.com/entry/transgender-parent-get-through-school-year_n_66ba653ee4b04b3eb2520010"
}