{
  "title": "Federal judge dismisses charges against Chicago woman shot after being accused of ramming car at law enforcement vehicle",
  "text": "A federal judge on Thursday dismissed federal charges against a woman shot by a Customs and Border Protection agent in Chicago after allegedly ramming into his car.\n\nThe ruling from US District Judge Georgia Alexakis came hours after prosecutors filed a motion to dismiss the charges in a striking reversal by the US government, court documents show.\n\nMarimar Martinez, a 30-year-old American citizen, and her co-defendant, Anthony Ruiz – who was driving a different vehicle – had entered not guilty pleas to a federal charge of assaulting, resisting or impeding federal officers.\n\nThe unprecedented move marks the latest development in a high-profile case that garnered public scrutiny and left a federal judge skeptical of how the investigation was handled.\n\nAfter the hearing Thursday, Ruiz was seen outside the courtroom hugging a crying loved one as a smiling Martinez told reporters, “I’m just blessed. I’m happy.”\n\n“It’s been hard,” she said. “I can’t sleep, but now I’m gonna go sleep.”\n\nMartinez had been accused of closely pursuing Customs and Border Protection agent Charles Exum and hitting his car on October 4. But Martinez’s defense attorney, Christopher Parente, alleged the opposite, saying it was actually the agent who sideswiped Martinez. Parente said, “This case was going to be a winner at trial regardless.”\n\n“These agents were lying about what happened,” he added following the dismissal. “Miss Martinez never rammed anybody. These agents hit Miss Martinez. These agents jumped out and shot Miss Martinez, a US citizen whose only crime was warning her fellow community members that ICE was in the neighborhood.”\n\nProsecutors had alleged Martinez and Ruiz “aggressively and erratically” followed and then rammed into Exum and other agents inside his vehicle who were on security detail in Chicago.\n\nJoseph Fitzpatrick, spokesperson and assistant US attorney for the Northern District of Illinois, said in a statement Thursday his office is “constantly evaluating new facts and information relating to cases and investigations arising out of Operation Midway Blitz, the largest ever law enforcement surge in the Northern District of Illinois.”\n\n“This continuous review process applies to all matters — whether charged or under investigation,” Fitzpatrick said. “It helps ensure that the interests of justice are served in each and every case, and that those cases that are charged are appropriately adjudicated through our federal court system.”\n\nWhen reached by CNN for comment on the judge dismissing charges against Martinez, Department of Homeland Security Assistant Secretary Tricia McLaughlin restated previous claims that Martinez was one of the drivers who rammed agents and referred questions on the charges to the Justice Department.\n\nImages show text messages sent by Customs and Border Protection agent Charles Exum that were displayed in court. US District Court Northern District of Illinois Eastern Division\n\nAfter the collision last month, Exum stepped out of his vehicle and fired his weapon five times at Martinez, according to the charging complaint. Martinez suffered five gunshot wounds, Parente previously told CNN. McLaughlin called the shots “defensive.”\n\nText messages and the federal vehicle were key in the court case\n\nText messages from Exum were displayed in court earlier this month as Parente sought to prove his claim the government potentially destroyed evidence that may have supported the defense when it released Exum’s damaged vehicle and allowed the agent to drive it more than 1,000 miles to his home state of Maine.\n\nExum texted an article from The Guardian on October 7 to a group of other agents, which quoted Parente saying Martinez had “seven holes in her body from five shots from this agent.”\n\n“Read it. 5 shots, 7 holes,” Exum wrote in the next text message.\n\nAnother message to the group read, “I have a MOF amendment to add to my story. I fired 5 rounds, and she had 7 holes. Put that in your book boys.”\n\nExum explained to the judge an “MOF” is a “Miserable Old F**ker” who is always trying to one-up someone wherever possible.\n\nPortions of these images has been obscured by CNN due to profanity. US District Court Northern District of Illinois Eastern Division\n\nIt’s not clear what exactly Exum was responding to, because the text conversations were redacted when presented to the court.\n\nWhen asked to explain the text message, Exum said, “That means illegal actions have legal consequences.”\n\nExum defended his use of force against Martinez, saying his life was at risk and “I did what I had to do.”\n\nReferencing the messages, Parente said, “He’s going to pay for those shots, and he’s not going to be as proud and as arrogant as he was when he testified in this courthouse a few weeks ago.”\n\nAlexakis said she was skeptical about why the cars of Martinez and Ruiz were kept in Chicago as evidence, while the Border Patrol agent’s car was released and allowed to travel normally.\n\n“What gives me great pause is the fact the cars have been treated differently,” Alexakis said previously.\n\nGovernment attorneys defended federal agents’ decisions, saying the FBI had preserved any evidence they believed was relevant before releasing the car back onto the street.\n\nThis story has been updated with additional information.\n\nCNN’s Whitney Wild, Omar Jimenez and Elizabeth Wolfe contributed to this report.",
  "authors": [
    "Nicquel Terry Ellis",
    "Bill Kirkos"
  ],
  "url": "https://www.cnn.com/2025/11/20/us/chicago-marimar-martinez-shooting-charges"
}