{
  "title": "Wicked: For Good review: This 'emotionally soaring' sequel is 'more captivating' than the first film",
  "text": "The musical adaptation's second and final instalment isn't likely to win any sceptics over – but it's consistently enjoyable, and sees Ariana Grande, in particular, \"really shine\".\n\nA heart-tugging theme, earworm songs and relentless marketing – that alchemy helped make Wicked in its many forms the pop-culture phenomenon it is today. The tangled friendship between the witches of Oz – Glinda, the princess-y one in pink, and Elphaba, the green-skinned outsider – created a cultlike fandom the minute the Broadway show opened 22 years ago. Prom queens and rebels alike could identify. The screen version has broken the show in half, over two films. Last year's Wicked, the first, came with inescapable publicity that included its stars, Ariana Grande and Cynthia Erivo, tearily holding hands in interviews and declaring life-long friendship. It made $750m (£660m) at the box office and is now awash in merch. But the film wouldn't have become a sensation if it hadn't also touched a chord with the public. Wicked: For Good, the emotionally soaring second and final film, carries that momentum forward and makes the journey feel complete.\n\nLet's be clear: the Wicked films are the definition of preaching to the choir. They aren't likely to win over anyone sceptical of candy-coloured spectacle and overt sentimentality presented in Broadway show-stopping fashion. Wicked is what it is. But if you're fine with that, this latest instalment is more captivating than the last and enjoyable to watch throughout.\n\nAriana Grande really gets her moments to shine in this instalment and makes the most of them\n\nPart One always felt like a first act before intermission. For Good has more life-and-death drama and is even more of a musical, with nearly back-to-back singing-dancing set pieces. But most of all it leans even more fiercely into the friendship between the two women, who separated at the end of the last film when Elphaba picked up her broom and flew away from Oz. The director, Jon M Chu, milks every tear-jerking moment – the camera swirls, the music swells! – but there is no denying the force of Erivo's powerful voice and vehement presence as Elphaba, Grande's perfectly light-handed and lyrical performance as Glinda, and the warm-hearted resonance of the saga.\n\nElphaba, after discovering that the Wizard is a fraud, now lives in a dense, dark forest, hunted by his soldiers, led by Prince Fiyero (Jonathan Bailey). Although he still has feelings for Elphaba, Fiyero is engaged to Glinda, who lives in a spacious, pink and marble Art Deco apartment in Oz. She and her home are images of goodness and light. The bubble she travels in looks magical but is mechanically powered. As with the Wizard, in Oz image is all that matters.",
  "authors": [],
  "url": "https://www.bbc.com/culture/article/20251118-wicked-for-good-review"
}