{
  "title": "What does my love for impossibly difficult video games say about me?",
  "text": "Most people who really love video games have the capacity to be obsessive. Losing weeks of your life to Civilization, World of Warcraft or Football Manager is something so many of us have experienced. Sometimes, it’s the numbers-go-up dopamine hit that hooks people: playing something such as Diablo or Destiny and gradually improving your character while picking up shiny loot at perfectly timed intervals can send some people into an obsessional trance. Notoriously compulsive games such as Animal Crossing and Stardew Valley, meanwhile, suck up hours with peaceful, comforting repetition of rewarding tasks.\n\nWhat triggers obsession in me, though, is a challenge. If a game tells me I can’t do something, I become determined to do it, sometimes to my own detriment. Grinding repetition bores me, but challenges hijack my brain.\n\nThe first games I got obsessed with like this were music games, when I was a teenager. I played Amplitude, where you are a space DJ blasting notes from your sonic spaceship; Gitaroo Man, a comic-book-style story about a guitar-wielding superhero; and, of course, Guitar Hero with its plastic axe – I was compelled to master every song on expert difficulty. Guitar Hero is ostensibly a party game, but I mostly played it folded over in the cupboard under the stairs of my rubbish flat in Bournemouth (I couldn’t play it in the living room because it annoyed my housemates too much), practising More Than a Feeling 30 times in a row until I was note-perfect.\n\nA few years later, I discovered FromSoftware’s Demon’s Souls when I was living in Japan, a game so impenetrable it seemed designed to make you walk away. You’d take three paces into any of its levels and get immediately murdered by a skeleton swordsman or poison-swamp creature. But I sensed something interesting behind all the punishment, and there very much was. Demon’s Souls ended up birthing a genre of massively popular and famously challenging games with its sequel, Dark Souls. You could only discover what was so incredible about these games if you were prepared to invest time and energy in mastering them. It didn’t matter how skilled you were – you had to share knowledge and band together with other players to stand a chance.\n\nMy tenacity has mostly been useful in my life, because I’ve been able to direct it well. There are plenty of life and career challenges where an inability to give up is handy. I have applied ridiculous determination to learning complicated fingerpicking patterns for a particular guitar song, and to writing books. When it comes to games, though, I sometimes get stuck playing them when I really ought to be doing something else.\n\nView image in fullscreen Obstinately difficult and painfully funny … Baby Steps. Photograph: Devolver Digital\n\nThe latest example of this for me was Baby Steps, an obstinately difficult and painfully funny game about trying to walk the world’s biggest loser up a mountain. There are so many places in this game where putting a single foot wrong can cost you an hour of painstaking progress. I was trapped inside a sandcastle for four hours one evening, sliding down the same sandy spiral slope over and over and over again. My children kept walking into the room and groaning to see me still playing it and failing to get anywhere. It was 1am before I finally marched triumphantly out of that sand trap, hours after everyone else in my house had gone to bed. My adrenaline was so high that I couldn’t fall asleep for another hour.\n\nThe sane thing to do would have been to simply put the controller down. Baby Steps is always teasing you with this. It’s daring you to give up. Its most infamous challenge, a winding path up a sheer rock face, is called the Manbreaker, and there’s a spiral staircase right next to it.\n\nThe other game I’ve spent most time with this year is Hollow Knight: Silksong, an exquisite explorative action game whose difficulty walks the line between playfully mean and just outright cruel. There are notoriously difficult bosses that you just cannot avoid, each requiring perhaps hours of practice. One of them, the Last Judge, wields a flaming thurible that generates pillars of damaging flames. If that isn’t bad enough, the path back to its chamber is full of danger: flying drill-headed bugs, perilous drops, aggressive guards. Your nerves are frayed by the time the Last Judge battle even begins. But all of this just made me even more determined to beat it.\n\nChallenge is a fine balance to strike for game developers: conventional wisdom says that you want players to be entertained, not discouraged. For a long time, the prevailing fashion was moving away from difficulty and towards eminently conquerable open-world games that never put a wall in the way of your progress. It was Dark Souls that proved there was still a huge market for people like me for whom the challenge is kind of the point. I am inexorably drawn towards mastery of objectively pointless things.\n\nMaybe the mastery is the point. You can’t master life. Things will always happen that you can’t control. Difficulties come at you out of nowhere, and you don’t always know how to deal with them. In video games, at least you can anticipate the challenge. And if you try very hard and refuse to give up, you can always, always overcome it.\n\nWhat to play\n\nView image in fullscreen A combat-focused game … Hyrule Warriors: Age of Imprisonment. Photograph: Nintendo/Koei Tecmo\n\nI am thoroughly surprised by how much I’m enjoying Hyrule Warriors: Age of Imprisonment, a spin-off of Zelda: Tears of the Kingdom that follows what Princess Zelda was up to when she was time travelling through Hyrule’s past. Turns out, she was beating up hundreds and hundreds of dudes. It’s a combat-focused game where you run around the battlefields of ancient Hyrule, or the pitch-black Depths with its many monsters, dispatching everything you see with screen-filling flashy attacks from Zelda’s light magic to scientist Mineru’s automatons. It doesn’t feel like Zelda at all; instead it’s more of a cinematic action game featuring Tears of the Kingdom’s familiar iconography and mechanical gadgets, and a story that fills in some gaps in Hyrule’s history and gives the princess more of a starring role.\n\nAvailable on: Nintendo Switch 2\n\nEstimated playtime: 15 hours\n\nskip past newsletter promotion Sign up to Pushing Buttons Free weekly newsletter Keza MacDonald's weekly look at the world of gaming Enter your email address Sign up Privacy Notice: Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on theguardian.com to send you this newsletter. You can complete full registration at any time. For more information about how we use your data see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nWhat to read\n\nView image in fullscreen Delayed again … Grand Theft Auto VI. Photograph: Chris Delmas/AFP/Getty Images\n\nGrand Theft Auto VI has been delayed again, from May to next November. Last time this happened, the games industry was scrambling to avoid its impact, so we may find an odd dearth of games towards the end of next year – and the release dates of some games may be pulled forward.\n\nIn a leaked presentation to staff (via Game File), Ubisoft’s CEO Yves Guillemot supposedly confronted the haters of Assassin’s Creed Shadows . The game was drawn into a culture war spat because it starred a black samurai and a female ninja. Rather than backing down, Guillemot said: “We had to stop focusing on those who hated us. We had to start firing up our allies.”\n\nThe Game Awards, run every year by omnipresent gaming hypeman Geoff Keighley, has shut down its Future Class programme, which selected a group of developers every year to represent the “bright, bold and inclusive future” of games. Now former inductees are speaking out on how they feel the programme failed them: “Don’t gather some of the most brilliant activists in the industry, treat us like crap, and then expect us to do nothing about it.”\n\nWhat to click\n\nSend us your favourite games of 2025\n\nIt’s that time again: end-of-year list season is approaching and I have been reflecting on the games I found most fun and edifying over the course of 2025, while trying to find time to play the ones I missed. We’ll be running a Pushing Buttons readers’ games of the year special in December. Please write in with a few sentences on your favourite game(s) of 2025 by simply hitting reply to this email. I’ll be gathering responses between now and early December.\n\n\n\nAnd as ever, if you have a question about anything video-game-related, or anything to say about the newsletter, get in touch via pushingbuttons@theguardian.com.",
  "authors": [
    "Keza Macdonald"
  ],
  "url": "https://www.theguardian.com/games/2025/nov/12/what-does-my-love-for-impossibly-difficult-video-games-say-about-me"
}