{
  "title": "Antico Caffè Greco: Why Rome’s oldest coffee shop has turned into an empty eyesore",
  "text": "Rome —\n\nFor more than two centuries, the Antico Caffè Greco has been part of the cultural landscape of Rome. Authors and artists, movie stars and princesses — even cowboys — have all made the pilgrimage to Via dei Condotti, at the foot of the Spanish Steps, to soak up the storied atmosphere of the Italian capital’s oldest coffee house.\n\nLast month, that all changed. The café, a favorite for Romans and tourists, shut its doors. Portraits of former clientele — including Wild West sharpshooter Buffalo Bill — were stripped from its walls; plush red velvet chairs, seating booths and bar stools removed; gilded porcelain tableware carried away.\n\nThe venue, as popular among Rome’s 19th-century bourgeoisie as it was with the 1960s “La Dolce Vita” in-crowd, became an empty shell.\n\nAntico Caffè Greco’s sudden demise was the result of a long-running rent dispute between its proprietors, Carlo Pellegrini and Flavia Iozzi, and their landlord, the Israelite Hospital of Rome. The hospital is a private institution that also provides healthcare to patients through Italy’s national health service.\n\nIt began in September 2017 when an 80-year lease expired and the Israelite Hospital raised the monthly rent from 17,000 euros to 120,000 euros — a leap from about $20,000 to $140,000. The move, it said, was in line with other properties on the street, which is home to stores that include Gucci, Versace and Dior.\n\nHigh commercial rents have pushed many small businesses out of the center of Rome in recent years, especially since the Covid pandemic when lockdowns fueled the rise of home delivery and online shopping.\n\n“We would be ready to pay more rent to keep the café open but not six times the amount we’re paying now,” Pellegrini said when the Antico lease expired eight years ago. “I feel very angry, but we will fight this.”\n\nCasanova’s café ‘tryst’\n\nThe walls of the cafe are covered in artwork and portraits of some of its famous clientele. Raimund Kutter/imageBROKER/Shutterstock\n\nThat fight was dealt a decisive blow in 2024, when the hospital finally won a court battle to remove the café’s occupants. It’s aim is to reopen the venue with a new tenant.\n\nUntil last month, portraits on the walls reflected the café’s past, including the day in 1890 when Buffalo Bill took his morning coffee there with some fellow cowboys. It was a favorite haunt of Charles Dickens, Henry James and John Keats in the 19th century. Later, Orson Welles, Audrey Hepburn and Sophia Loren all spent time there.\n\nNotorious 18th-century seducer Giacomo Casanova even mentioned a “tryst” at the café in his memoir. The sofa in the back where it was said to have taken place became popular with lovers over the centuries since.\n\nDespite above-average prices, customers always seemed to think sipping a cappuccino or hot chocolate from the same cups as Pablo Picasso or Princess Diana was worth paying extra.\n\nPellegrini and Iozzi were formally evicted in October after losing five appeals and retrials.\n\nThe café was shuttered with the help of the military police. The locks were changed and the heavy wooden doors closed for the last time. Lawyers for the hospital removed a temporary “closed for vacation” sign that had been taped to the doors since September.\n\nThe court stipulated that the hospital must preserve the historical integrity of the property, but departing staff told CNN through their lawyer that they removed the café’s artwork in September, which included portraits, sculptures and memorabilia said to be worth around 8 million euros, fearing damage from a leaking pipe.\n\nAntonio Maria Leozappa, special commissioner for the Israelite Hospital, told CNN the removed works and furnishings have since been seized by authorities and are now being protected by Italy’s Culture Ministry until new tenants can be found. It is unclear whether the hospital will seek backpayment from Pellegrini for an annual 100,000 euros rent shortfall since the legal battle began eight years ago.\n\n“The Israelite Hospital is a public health asset, and the revenue generated by its properties has always been and will always be used by the Israelite Hospital, an institution affiliated with the National Health System, for the sole purpose of improving healthcare,” the hospital said in a statement in 2023 after having won one of many court battles. It said the rent increase was an attempt to improve healthcare “for the benefit of all citizens.”\n\n‘A tragedy’\n\nBarbie Latza Nadeau/CNN\n\nLeozappa said the café will open again once work is done in the building. “It is a historic café, it is one of the first in Italy, it dates back to the late 18th century,” he told CNN.\n\nUnder a new owner, the Antico Caffè Greco will “continue to enjoy a long history, respecting tradition and the established regulations, and the historic character of the place will be preserved,” he added. ”The city, Romans, and tourists will continue to enjoy their coffee at the Antico Caffè Greco for centuries to come.”\n\nPellegrini isn’t ready to give up the battle just yet. “The matter cannot be closed like this,” his lawyer, Alessandro Ciciarelli, said when the locks were changed.\n\nWhatever happens next, the once-grand space is now an eyesore on one of the most prestigious streets in the city center — one of many empty storefronts, some of which sit vacant for years, that have appeared as a result of soaring commercial and residential prices.\n\nThe Antico Caffè Greco’s wooden outdoor terrace now has signs that its empty planters are not garbage bins.” Curious tourists peer through the windows into the empty space. Inside, the lights are on, but no one is making coffee.\n\n“I came here every day for almost 15 years,” Manuel Capponi, an elderly local who lives at the top of the Spanish Steps, told CNN. “It is a tragedy that it had to close this way, the fights, the anger. But this café — and this city — have weathered worse storms. There will be another café and I’m sure the prices will reflect the higher rent.”\n\nCorrection: An earlier version of this story misstated the Israelite Hospital's position on rent backpayments.",
  "authors": [
    "Barbie Latza Nadeau"
  ],
  "url": "https://www.cnn.com/2025/11/19/travel/antico-caffe-greco-rome-coffee-shop-dispute"
}