{
  "title": "How To Bake A Pie At The Last Minute",
  "text": "LOADING ERROR LOADING\n\nIt’s the Wednesday just before Thanksgiving, and at a corner storefront in Chicago’s Roscoe Village neighborhood, people are arriving at the baking school Give Me Some Sugar. Their objective is mission-critical for the festive table the next day.\n\nThe class they’re attending, I Forgot To Make a Pie, is one of the quickest to sell out, and no wonder — each attendee leaves with three 9-inch pies they baked themselves, aided with insight and encouragement from the school’s owner and executive chef, Jerry Korab.\n\nAdvertisement\n\n“People do get intimidated by pie,” Korab said. “I think they fear the crust, mostly. But I’ve had many previous ‘pie-phobes’ who return to tell me they make them all the time now that they’ve taken the class. It’s heartening, because pie is really pretty simple and not all that time-consuming.”\n\nGMVozd via Getty Images Yes, you can even make one from scratch.\n\nWhen the Thanksgiving deadline approaches, home bakers need to get those pies rolled, filled, baked and cooled by the time everyone sits down on the big day, and for that, they need to have shopped, planned and worked well in advance.\n\nAdvertisement\n\nIf you’re in a similar situation right now, take heart. While those classes in Chicago sold out long ago, we found pastry chefs who have plenty of smart ideas for getting your pie baking back on schedule. And they even threw in some brilliant pie-adjacent options for when you’ve truly run out of time.\n\nWhy is pie so important on Thanksgiving, anyway?\n\n“Thanksgiving is almost synonymous with pie,” said Erin Jeanne McDowell, author and host of Happy Baking on YouTube. “I often refer to it as my Super Bowl. Because it’s served in one large portion, it calls for a few people to be present to eat it, so it’s associated with gathering times like holiday feasts.”\n\n“At Thanksgiving, pie is more than dessert,” said chef, TV personality and author Andrew Zimmern. “It’s ritualized memory, the edible archive of family history and immigrant adaptation. The turkey may take the headlines, but it’s pie that delivers the sermon. Without pie, Thanksgiving feels unfinished, like a story that stops before the moral. Because in the end, pie isn’t just food, it’s closure.”\n\nAdvertisement\n\nMichael Galindo, executive pastry chef at Indaco in Greenville, South Carolina, calls pie the “finale” of a Thanksgiving meal. “It’s not just dessert, it’s the closing chapter of the story, a well-deserved and ceremonious reward,” he said.\n\nChef Robert Irvine put it succinctly: “To have a Thanksgiving with no pie does let some of the air out of the holiday’s balloon.”\n\nTry this Wednesday afternoon timetable.\n\nThe day before Thanksgiving, you’re probably wishing you had done a little more planning. But the night before is actually a great time to start. Don’t get hung up on the idea that you need to pull a pie straight from the oven at dessert time — that’s not only unnecessary, but can result in what chefs call “pie soup.”\n\nAdvertisement\n\n“Many pastries actually benefit from being made ahead,” said Culinary Institute of America pastry chef instructor Daniel Keehner. “A pie made the day before will be just as great, and sometimes even better, because it can amalgamate and become one homogenous piece. Also, spoiler alert — most bakeries are baking the day before, too.”\n\nGMVozd via Getty Images You can either make your own dough from scratch or buy one pre-made.\n\nChef Franklin Becker of New York’s Point Seven Restaurant also suggests making the flaky dessert the night before, “as your oven will be busy with the turkey on Thursday.”\n\nAdvertisement\n\n“I’ve made pies on Thanksgiving morning, but it’s so stressful,” said Rose Hattabaugh, senior recipe developer at Milk Street. “Aim to finish pie baking Wednesday night, so they have time to chill and cool properly.”\n\nDepending on the type of pie, you really need that overnight rest. “For a custard pie, like pumpkin, you absolutely must start on Wednesday night,” said Bridget Vickers, senior chef-instructor at the Institute of Culinary Education’s Los Angeles campus. “Those custard pies require significant chill time, often overnight, to set and become fully sliceable.”\n\nSo now it’s Wednesday night and all your pies are baked. Where should they sit until the big meal? “If you’re baking a fruit or pecan pie, they can be left out overnight, which means they won’t crowd a fridge that’s already holding turkey and sides,” said Robin Selden, managing partner and executive chef at Marcia Selden Catering and Naked Fig Catering. Pies with meringue or cream filling should go in the refrigerator, she added.\n\nAdvertisement\n\nOr attempt this Thursday morning timetable.\n\n“You can make a pie from start to finish and have it ready to eat in about five to six hours, so in theory it can be baked early in the morning and be ready for Thanksgiving dinner,” said Kenzie Ross, pastry chef at Four Seasons Hotel Minneapolis. “But if you’re baking on a time crunch, remember to let it rest at least two to three hours. If you’re lucky enough to live in a snowy state and the fridge is packed, pop the pie outside in the snow.”\n\nVickers laid out an ambitious crack of dawn prep timetable. “I recommend starting no later than 6 a.m. on Thursday,” she said. Here’s her “panic pie” plan for a double-crust apple or pecan pie. Don’t forget to set your alarm, because we ride (and roll) at dawn:\n\n\n\n\n\n6 to 6:30 a.m.: Make the dough\n\n\n\n\n\n6:30 to 7 a.m.: Make the filling (apples, spices, etc.)\n\n\n\n\n\n7 to 7:30 a.m.: Assemble\n\n\n\n\n\n7:30 to 8:45 a.m.: Bake (times vary, so check your recipe)\n\n\n\n\n\n8:45 a.m. to 1 p.m. (or longer): “Cooling is critical,” she said. “The pie needs several hours for the filling to set up fully and for the crust to achieve its final flaky texture. If you rush this, the slice will slump, which is one of the most common mistakes home bakers make.”\n\n(Caveat: Of course, not all pies are created equal. Some need to be chilled, some need to just rest at room temperature, some require a blind-baked crust ahead of time, etc. Always be sure to read your recipe in advance.)\n\nIf that all-important setting hasn’t happened, there’s a way to manage that, said Lisa Steele, author and host of PBS’s “Welcome to My Farm.” “I’ve had apple pies come out of the oven around noon and served them for dessert that evening, but it really isn’t enough time for the pie to completely set,” she said. “Since pies that aren’t completely cooled and set can be hard to cut neatly, plan on serving slices in a shallow bowl with a dollop of whipped cream or a scoop of ice cream, to disguise a less-than-perfect slicing job.”\n\nFeeling totally frazzled? Forget pie altogether.\n\nChefs do have empathy for last-minute dessert emergencies. Of course there are frozen pies and crusts at the grocery, and bakeries might still have a few options for sale, if you act in time.\n\nAdvertisement\n\nIf you’d like to serve something festive that isn’t the dreaded “p” word, they have lots of ideas:\n\nZimmern said: “Make a crumble. Put fruit, sugar and a little cornstarch in a dish, then cover with torn pieces of supermarket sugar cookie dough.”\n\nEven better, from Zimmern: “Best baking tip you’ll ever receive — I almost always tell guests to bring desserts.”\n\nMcDowell talked up easy-to-assemble pandowdies and trifles.\n\nChef Ana Sofía Pino, executive pastry chef of Lutèce in Washington, D.C., said: “I always have ice cream in my freezer for emergencies.”\n\nPino’s other tactic is total, brutal honesty: “Grab your family’s favorite ice cream, cookies, or bars of chocolate and be honest. Tell them things really got away from you and that it’s been a wild year. Tell them how you really poured your focus into some other element of the meal. Enjoy your treats, and maybe recruit your favorite cousin to handle dessert next year.”\n\nHere’s what to do to avoid getting into this jam for next Thanksgiving.\n\nPastry chef and author Stella Parks of BraveTart admitted, “I’m a planner, and I’m all about the long game. The best shortcut is making your pie crust weeks in advance and popping it in the freezer.”\n\nAdvertisement\n\nParks wasn’t the only pastry chef we talked to who reported having a freezer full of premade pie crusts ready to go by Veterans Day. That’s not really the sort of thing that’s going to help you at the last minute, but we just wanted to put that out there for next year. (Calendar notice for Nov. 1, 2026: Make and freeze pie crust.)\n\nOne chef even goes the full distance to make life easier on the big day. New York City-based caterer The Raging Skillet’s chef and author Chef Rossi does it all well in advance. “Life got profoundly easier when I realized that pumpkin, berry or apple pie can be fully made, baked, cooled and then frozen for a month or even longer,” she said. “I pull my pie from the freezer the day before, let it thaw in the fridge overnight and then warm it in the oven before serving. Nobody can tell that it was frozen. I always say, ‘To pie is human, to make it easy on your nerves is divine.’”",
  "authors": [
    "On Assignment For Huffpost"
  ],
  "url": "https://www.huffpost.com/entry/how-fast-can-you-bake-a-pie_l_69091f3be4b0c4a0f50a7f38?origin=life-feed"
}