{
  "title": "The 21 Best Movies on Amazon Prime Right Now",
  "text": "In Recent years, Netflix and Apple TV+ have been duking it out to have the most prestigious film offerings, but some of the best movies are on Amazon Prime Video. The streamer was one of the first to go around picking up film festival darlings and other lovable favorites, and those movies are all still there in the library, so if they flew under your radar the first time, now is the perfect time to catch up.\n\nOur picks for the best movies on Amazon Prime are below. All the films in our guide are included in your Prime subscription—no renting here. Once you’ve watched your fill, check out our lists for the best shows on Netflix and best movies on Disney+ if you’re looking for something else to watch. We also have a guide to the best shows on Amazon, if that’s what you’re in the mood for.\n\nIf you buy something using links in our stories, we may earn a commission. This helps support our journalism. Learn more.\n\nMerry Little Batman\n\nJingle bells, Batman smells, Robin … takes over protecting Gotham City solo on a cold Christmas Eve, when the Caped Crusader is away on Justice League business. Focusing on the Damian Wayne incarnation of Robin—here taking on the mantle of “Little Batman”—Merry Little Batman finds Damian taking on the likes of the Penguin, Bane, and Mr. Freeze, desperate to prove he's ready to join the family business permanently by saving Christmas from the Joker's evil plans. Proof Batman stories don't always have to be grim sojourns into Bruce Wayne's tortured psyche, this festive animated treat is a delight, crammed with loving details for fans of the comics while serving as a fantastic entry point for newcomers. Art director Guillaume Fesquet's unique approach, based on the style of Ronald Searle, offers one of the most distinctive takes on the Dynamic Duo in their eight decades of existence, too.\n\nNosferatu\n\nMore than a century after F. W. Murnau brought vampires to the silent screen with Nosferatu: A Symphony of Horrors—liberally and infamously “inspired” by Bram Stoker’s Dracula—Robert Eggers reimagines cinema’s first blood-sucker. The story will be familiar to anyone acquainted with Murnau’s or Stoker’s works: Ambitious young estate agent Thomas Hutter (Nicholas Hoult) is sent to Transylvania to finalize a property deal with the enigmatic Count Orlok (Bill Skarsgård), who becomes obsessed with Hutter’s new bride, Ellen (Lily-Rose Depp). But Eggers presents the trail of blood, plague, and terror that follows in a morbidly fascinating new light. Every frame is gorgeously shot, and Skarsgård brings the rapacious Orlok to demonic un-life with an utterly heart-stopping performance.\n\nKnives Out\n\nThe debut outing of Benoit Blanc (Daniel Craig) finds the master detective investigating the suspicious death of famed crime novelist Harlan Thrombey (Christopher Plummer). It's a case complicated by the deceased’s expansive, dysfunctional family, all of whom appear to have a motive for killing their supposedly beloved patriarch. Boasting a murderers' row of acting talent, including Chris Evans, Jamie Lee Curtis, Toni Collette, LaKeith Stanfield, and Ana de Armas as Thrombey’s attentive nurse Marta—director Rian Johnson’s Knives Out remains a masterful modern updating of the classic whodunit, packed full of meta twists that almost single-handedly reenergized the genre.\n\nAir\n\nSure, nowadays Michael Jordan is a bona fide sports god, and Nike Air Jordans are still arguably the cool sneaker—but that wasn’t the case back in 1984. Jordan was a rookie, and Nike was about to close down its basketball shoe division. Enter Sonny Vaccaro (Matt Damon), a talent scout for the footwear maker who’s spotted a rising star in North Carolina who could turn everything around—he just needs to convince everyone else that Jordan is worth betting the company on. We all know how that panned out, so thankfully Air is more than a two-hour advert for gym shoes. Damon, Jason Bateman, Chris Tucker, and director Ben Affleck all deliver strong performances—only to be utterly eclipsed by Viola Davis in a magnetic and powerful, if somewhat under-utilized, turn as matriarch Deloris Jordan—while Alex Convery’s script keeps the drama on the people and personalities involved, rather than the boardroom. In an age of franchises and endless blockbusters, Air is the sort of character-focused film that rarely gets made anymore, and is all the more enjoyable for it.\n\nHeads of State\n\nGrumpy British prime minister Sam Clarke (Idris Elba) and action-movie star turned US President Will Derringer (John Cena) can't stand each other—so teaming up to survive after Air Force One is shot down over the Belarusian wilderness is going to put a real strain on the Special Relationship. Luckily for viewers, though, it also makes for one of the most hilarious and brilliantly choreographed action comedies in years. Priyanka Chopra Jonas is astounding as hard-nosed senior MI6 agent Noel Bisset, out to protect the combative world leaders from each other as much as a mounting terrorist threat, but it's the spiky chemistry between the leads that really carries the film. Cena is so perfectly obnoxious throughout that you can't help but feel Elba might actually hate him. A throwback of an action flick in the best way.\n\nDeep Cover\n\nWhen London police detective Billings (Sean Bean) hits a brick wall infiltrating criminal organizations, he turns to the only people he can trust: struggling improv actors. This ludicrous concept is played for maximum laughs by Bryce Dallas Howard as Kat, a comedian desperate for her big break, and Orlando Bloom as the intractably method-acting Marlon. But it's Ted Lasso's Nick Mohammed who steals every scene as meek and awkward Hugh—an IT nerd who can't act but “yes, ands … ” every increasingly farcical scenario the trio find themselves in. A bizarre blend of slapstick and Guy Ritchie-esque grit, Deep Cover fully commits.\n\nThe Adventures of Buckaroo Banzai Across the 8th Dimension\n\nOne of the absolute wildest films you've probably never seen, 1984's The Adventures of Buckaroo Banzai is … almost impossible to describe. Centered on Peter Weller's Dr. Buckaroo Banzai—a super-genius physicist, skilled neurosurgeon, high-flying test pilot, and beloved rock star—the film follows his battle with the evil Dr. Emilio Lizardo (John Lithgow) over the advanced \"oscillation overthruster\" that allows travel between dimensions. It's so much stranger than that though. Expect alien invaders, identical twins of long-lost lovers, Orville Welles, and mid-1980s nuclear war paranoia, and that's just scratching the surface. The highest of high concept sci-fi flicks, it absolutely bombed on release (despite a phenomenal cast including Jeff Goldblum and Christopher Lloyd) but has since more than earned its standing as a cult favorite. Even Weller himself can't explain the film, but it is undeniably an experience.\n\nConclave\n\nArriving on Prime Video with divine timing, this parable of the election of a new pope makes for powerful viewing. When the pope passes, Cardinal Thomas Lawrence (Ralph Fiennes) starts the process of hosting the papal conclave to choose his successor—but given that the supreme pontiff is one of the most powerful positions on Earth, the election makes for anything but dry Catholic procedure. As the choice narrows to four candidates, and no one is allowed in or out until a new pope is elected, tension mounts while power plays, blackmail, and long-buried secrets rock the Holy See. Based on the novel by Robert Harris and directed by Edward Berger (2022's All Quiet on the Western Front), Conclave is a meticulously researched and exquisitely shot drama, driven by magnetic performances from a cast including Stanley Tucci, John Lithgow, and Isabella Rossellini.\n\nEvangelion 3.0+1.0: Thrice Upon a Time\n\nFair warning: As the culmination of 15 years of work for creator and director Hideaki Anno, and serving as a follow-up to his classic 1995 TV anime Neon Genesis Evangelion, this is hardly what you'd call a jumping on point for the notoriously complex mecha franchise. (Thankfully, Prime Video has the whole movie saga available, starting with Evangelion 1.11.) Nevertheless, snagging the international rights for this long-awaited film from Japan's Studio Khara was a genuine coup for Amazon. Thrice Upon a Time brings to a close the decades-long tale of traumatized teenage robot pilots forced to fight biblically accurate angels—and worse, the twisted machinations of lead character Shinji's abusive father, Gendo. With bewilderingly beautiful animation, plenty of emotional clout, and an ending that surprised even longtime fans, this is a textbook example of how to send a series out with a bang.\n\nChallengers\n\nDirected by Luca Guadagnino (Call Me by Your Name), Challengers follows the complicated three-way relationship between tennis aces Tashi (Zendaya), Patrick (Josh O'Connor), and Art (Mike Faist). Told nonlinearly, it volleys between the trio's disaffected present and their more optimistic, exciting past. It's an energetic and inventively shot sports movie, but the real match tension is in how the promise of Grand Slam glory (and no shortage of raging hormones—it is a Guadagnino film, after all) in the trio's youth lead to choices that ricochet into the present. Tashi has been forced to abandon the court after a horrific injury, her now-husband Art is stuck in a competitive rut, and Patrick hustles low-stakes games to get by—but none of them have really moved on.\n\nMy Old Ass\n\nThe unstoppable rise of Aubrey Plaza continues in this smart, modern take on the coming-of-age dramedy. Written and directed by The Fallout’s Megan Park, My Old Ass follows 18-year old Elliott (Maisy Stella) who, on the cusp of college and major life changes, celebrates her birthday by taking mushrooms with her friends. Mid-trip, she meets … Elliott, age 39 (Plaza). It’s when she’s sobered up that things get really trippy, though. Elliott starts receiving text messages from the future—warning her to avoid a boy named Chad. Equal parts hopeful and melancholic, and with powerful performances from both actors playing an Elliott, this film beautifully captures the messy, joyful potential of youth and the nagging, wistful “what ifs?” that come with age. A delight however old you are.\n\nSaltburn\n\nOxford student Oliver Quick (Barry Keoghan) is having trouble fitting in at the prestigious British university—until he befriends the popular Felix Catton (Jacob Elordi). Handsome, rich, and born to the landed gentry, Felix brings the awkward, socially invisible Oliver into his circle, eventually inviting him to spend summer at the family estate, Saltburn. But as Oliver works his way into the family's graces, his obsession with Felix takes increasingly dark and deranged turns. Oscillating between black comedy and psychological thriller, writer and director Emerald Fennel (Promising Young Woman) frames the film in 4:3 aspect ratio for a tighter, almost voyeuristic viewing experience that makes its frequently unsettling moments even more uncomfortable. Having attracted plenty of debate since its 2023 release—not least for how it questionably navigates its themes of class and social inclusion—Saltburn was one of the year's most divisive films, but one that demands your attention.\n\nThe Burial\n\nCourtroom dramas are rarely laugh riots, but this tale of funeral home director Jeremiah O'Keefe (Tommy Lee Jones) and his flashy lawyer Willie Gary (Jamie Foxx) taking on a major player in America's \"death care\" system brings a dark sense of humor to already grim proceedings. This is no comedy though. Based on true events, director Maggie Betts' (The Novitiate) latest drama retells a real-life legal case that exposed massive inequality in funereal care and the way Black communities were being regularly overcharged. Foxx and Jones are in top form throughout, but it's Jurnee Smollett as Mame Downes, Gary's rival attorney who threatens to outpace him at every turn, whose performance threatens to steal the whole movie. For a film about death, The Burial proves warmly life-affirming.\n\nA Million Miles Away\n\nCharting the life of José Hernández, this biopic—based on Hernández's own book—mixes the aspirational with the inspirational as it follows its central figure's rise from, in his own words, migrant farm worker to the first Mexican-American astronaut. Michael Peña is in fine form as Hernández, painting a picture of a man almost myopically driven to reach space, no matter the cost, while Rosa Salazar impresses as his wife Adela, refusing to fade into the background even as she puts her own dreams on pause for José to chase the stars. In lesser hands, this could all be cloying—a twee tale of hard work and achieving the American Dream, with a dash of NASA promo material on the side, but director Alejandra Márquez Abella has her lens as focused on the small beauties of life here on Earth as the splendor and sheer potential of space. A rare delight.\n\nShin Masked Rider\n\nIf you’re sick of cookie-cutter Hollywood superhero movies, then this ground-up reboot of one of Japan’s most beloved heroes deserves your attention. Helmed by Hideaki Anno (Evangelion, Shin Godzilla, Shin Ultraman—“shin” meaning “new” or “true” in Japanese), this revamps the 1971 TV series Kamen Rider. Like that show, it follows motorcyclist Takeshi Hongo (Sosuke Ikematsu). Kidnapped by the terrorist organization S.H.O.C.K.E.R. and forcibly converted into a powerful cyborg, Hongo escapes before being reprogrammed as an agent of the group, instead using his newfound powers to take down its forces. However, unlike the original, Anno’s approach taps into the body horror of the core concept, while also challenging his characters—and audience—to hang onto their intrinsic humanity in the face of a world trying to dehumanize them. It’s more violent than you’d probably expect, often showing the grisly outcome of regular people getting punched by superpowered cyborgs and monsters, but never gratuitous. While those with some understanding of the source material will get more out of Shin Masked Rider, it’s an exciting outing for anyone looking for something a bit fresher from their hero movies.\n\nNanny\n\nAisha (Anna Diop) is a Senegalese woman working as a nanny for a rich couple in New York City, hoping to earn enough to bring her son and cousin to join her in America. However, her future is at the mercy of her employers, who seem content to leave Aisha to raise their daughter, Rose, while often withholding her pay. As the stress of the power imbalance weighs on her, Aisha begins having strange dreams of drowning, worsened by her fears of abandoning her own child. The feature debut of director Nikyatu Jusu, Nanny contrasts the horror of the immigrant experience in modern America with something darker, while swapping the expected tropes of hope and opportunity for a palpable sadness for culture and community left behind. Nanny takes a slow-burn, psychological approach to its scares, but Diop is phenomenal throughout, and the meticulous pacing and gorgeous cinematography means every frame lingers.\n\nComing 2 America\n\nRelying on nostalgia to carry new entries in long-dormant series can be risky business, but Eddie Murphy’s return to the role of Prince—now King—Akeem of Zamunda more than three decades after 1988’s Coming to America shows how to do it right. Drawn back to the US in search of a son he never knew he had, Akeem—and the audience—gets to reunite with familiar faces from the first film, before director Craig Brewer (Hustle and Flow) reverses the formula and tests the American characters with a trip to Zamunda. With a sharper, smarter, and more globally aware script than the original, Coming 2 America defies the odds to be a comedy sequel that stands up to the reputation of its predecessor.\n\nThirteen Lives\n\nDirector Ron Howard’s latest gathers a top-notch cast—including Viggo Mortensen, Colin Farrell, and Joel Edgerton—for a dramatization of the 2018 Tham Luang cave rescue, where a Thai junior soccer team and their assistant coach were trapped in the flooded cave system. As an international effort mounts to save the children, the challenges of navigating miles of underwater caverns become ever more dangerous, and Howard masterfully captures every perilously claustrophobic moment of it. A nail-bitingly tense movie with some ingeniously shot aquatic scenes, Thirteen Lives is a testament to one of the most difficult rescues ever performed.\n\nOne Night in Miami …\n\nBased on the play of same name, One Night in Miami follows four icons of culture, music, and sports—Malcolm X, Jim Brown, Sam Cooke, and Muhammad Ali—at the height of the Civil Rights Movement, a converging and pivotal point in their lives and careers. Meeting in a motel room in the wake of Ali’s—then still Cassius Clay—heavyweight victory over Sonny Liston in 1964, the four men discuss their roles in the movement and society as a whole, all while the audience knows the weight of history is bearing down on them. The close confines of much of the film reflect its theatrical roots, but this feature directorial debut from Regina King perfectly portrays the larger-than-life personalities of its cast. Kingsley Ben-Adir is on fire as Malcolm X, with Aldis Hodge, Leslie Odom Jr., and Eli Goree—as Brown, Cooke, and Ali—all utterly magnetic.\n\nThe Report\n\nProduced by Amazon, The Report is an engrossing depiction of the US Senate's investigation into the CIA's “enhanced interrogation” program—how it came to be, who knew about it, and how the CIA massaged the facts to support its efficacy. Adam Driver stars as Daniel Jones, the lead investigator who plowed an increasingly lonely path to the truth, battling against political resistance and CIA interference all the way. Driver is, as is his habit these days, superb, and the film's 82 percent “fresh” rating on Rotten Tomatoes is well earned.\n\nSound of Metal\n\nPunk-rock drummer and recovering addict Ruben starts experiencing hearing loss, and it threatens to upend his entire life. Faced with an impossible choice between giving up his hearing or giving up his career, Ruben begins to spiral, until his girlfriend Lou checks him into a rehab center for the deaf, forcing him to confront his own behavior as much as the future he faces. Riz Ahmed is in spectacular form as the troubled Ruben, while Olivia Cooke’s turn as Lou, who suffers with her own demons, including self-harm, is riveting. Fittingly enough, Sound of Metal also features incredibly nuanced use of sound—and its absence—as director Darius Marder crafts one of the finest dramas in recent years.",
  "authors": [
    "Matt Kamen",
    "Wired Staff"
  ],
  "url": "https://www.wired.com/story/best-amazon-prime-movies/"
}