{
  "title": "Inside the Multimillion-Dollar Plan to Make Mobile Voting Happen",
  "text": "Joe Kiniry, a security expert specializing in elections, was attending an annual conference on voting technology in Washington, DC, when a woman approached him with an unusual offer. She said she represented a wealthy client interested in funding voting systems that would encourage bigger turnouts. Did he have any ideas? “I told her you should stay away from internet voting, because it’s really, really hard,” he says.\n\nLater he learned who had sent her. It was Bradley Tusk, a New York City political consultant and fixer for companies like Uber fending off regulation. He’d made a fortune doing that (early Uber stock helped a lot), and he was eager to spend a good chunk of it pursuing online voting technology. Tusk convinced Kiniry to work with him. At the very least, Kiniry thought, it would be a valuable research project.\n\nToday Tusk is showing off the fruits of that collaboration. His Mobile Voting Foundation is releasing VoteSecure, a cryptography-based protocol that seeks to help people securely cast their votes on iPhones and Androids. The protocol is open source and available on GitHub for anyone to test, improve upon, and build out. Two election technology vendors have already committed to using it—perhaps as early as 2026. Tusk claims that mobile voting will save our democracy. But getting it accepted by legislators and the public will be the really, really hard part.\n\nPrimary Numbers\n\nTusk has been obsessed with mobile voting for a while. Around 2017, he began taking serious action, funding small elections that used existing technology to allow deployed military or disabled people to vote. He estimates he’s dropped $20 million so far and plans to keep shoveling cash into the effort. When I ask why, he explains that working with the government has given him a panoramic view of its failures. Tusk believes there is a single pressure point that could fix a number of mismatches between what the public deserves and what they get: more people using the ballot box. “We get lousy, or corrupt, government because so few people vote, especially in off-year elections and primaries, where the turnout is dismal,” he says. “If primary turnout is 37 percent instead of 9 percent, the underlying political incentives for an elected official to change—it pushes them to the middle, and they’re not rewarded for screaming and pointing fingers.”\n\nTo Tusk, mobile voting is a no-brainer: We already do banking, commerce, and private messages on our phones, so why not cast a ballot? “If I don’t do it, who is going to do it?” he asks. Furthermore, he says, “if it doesn’t happen, I don’t think we’re one country in 20 years, because if you are unable to solve any single problem that matters to people, eventually they decide not to keep going.”\n\nTusk had Kiniry evaluate existing online voting platforms—including some that Tusk himself had paid for. “Joe is considered the absolute expert on electronic voting,” says Tusk. So when Kiniry deemed those systems insufficient, Tusk decided that the best way forward was to start from scratch. He hired Kiniry’s company, Free & Fair, to develop VoteSecure. It’s not a turnkey solution but a backend part of a system that will require a user interface and other pieces to be operable. The protocol includes a means for voters to check the accuracy of their ballots and verify that their vote has been received by the election board and transferred to a paper ballot.\n\nTusk says his next step is to “run legislation” in a few cities to allow mobile voting. “Start small—city council, school board, maybe mayor,” he says. “Prove the thesis. The odds of Vladimir Putin hacking the Queensborough election seems pretty remote to me.” (Next spring some local election elections in Alaska will offer the option of mobile-phone voting with software developed by Tusk’s foundation.) Kiniry agrees it’s way too soon to use mobile voting in national elections, but Tusk is betting that eventually the systems become familiar, to the point where people trust them much more than traditional paper ballots. “Once the genie’s out of the bottle, they can’t put it back, right?” he says. “That’s been true for every tech I’ve worked on.” But first the genie has to get out of the bottle. That’s no cinch.\n\nCrypto Foes\n\nThe loudest objections against mobile or internet voting come from cryptographers and security experts, who believe that the safety risks are insurmountable. Take two people who were at the 2017 conference with Kiniry. Ron Rivest is the legendary “R” in the RSA protocol that protects the internet, a winner of the coveted Turing Award, and a former professor at MIT. His view: Mobile voting is far from ready for prime time. “What you can do with mobile phones is interesting, but we’re not there yet, and I haven’t seen anything to make me think otherwise,” he says, “Tusk is driven by trying to make this stuff happen in the real world, which is not the right way to do it. They need to go through the process of writing a peer-reviewed paper. Putting up code doesn’t cut it.”\n\nComputer scientist and voting expert David Jefferson is also unimpressed. Though he acknowledges that Kiniry is one of the country’s top voting system experts, he sees Tusk’s effort as doomed. “I’m willing to concede rock-solid cryptography, but it does not weaken the argument about how insecure online voting systems are in general. Open source and perfect cryptography do not address the most serious vulnerabilities.”",
  "authors": [
    "Steven Levy"
  ],
  "url": "https://www.wired.com/story/bradley-tusk-mobile-voting-protocol/"
}