{
  "title": "Taunton Brewhouse gets five-ear funding deal to secure future",
  "text": "Five-year cash deal to secure future of theatre\n\n2 days ago Share Save Charlie Taylor, BBC Radio Somerset and Chris Lockyer, Somerset Share Save\n\nBBC Taunton Brewhouse will receive £105,000 a year from Taunton Town Council\n\nA theatre which is almost 50 years old has secured more than half a million pounds in new funding. Taunton Town Council has said it will pay £105,000 a year for the next five years to the Taunton Brewhouse to secure its future and help with ongoing maintenance and repairs. The council stepped in after Somerset Council, the building's owner, said \"it was no longer financially sustainable\" to continue funding the venue's repairs. Vickie Robbins, executive director of the theatre said: \"The £105,000 every year will go towards making improvements to the building so that it stands for another 50 years.\"\n\nMs Robbins said: \"We have worked very, very hard to become a fairly self-sustaining organisation but subsequent to that we also now have to take on the repairing and maintaining responsibilities for the building.\" Taunton Theatre Association (TTA), the charity which operates Taunton Brewhouse, leases the building from Somerset Council on the basis significant repairs are undertaken by the landlord, not the tenant. However, the council indicated that from 2026 future repairs and maintenance responsibilities will transfer to the tenant.\n\nThe theatre's executive director Vickie Robbins says the funding will go towards making improvements\n\nThe deputy leader of Taunton Town Council said there would not be an immediate rise to council tax bills as a result of the funding. Amber Packer-Hughes said: \"There is going to be no increase next year on the precept on the back of this agreement.\" She added: \"It's about more than funding, it is about safeguarding a space that really brings people together, it enriches lives and it strengthens the local economy. \"The Brewhouse puts on so many amazing events for all different sectors of society, whether it's touring ballet companies, comedians that come in, local pantomime groups, you name it, they serve absolutely everybody - It's such an important institution,\" she added. In a statement, Somerset Council said: \"It's really positive news Taunton Town Council will be supporting the Brewhouse going forward. \"The longer lease term should enable TTA to apply for other external grant funding and the council will support in identifying potential streams,\" it added.",
  "authors": [],
  "url": "https://www.bbc.com/news/articles/cq50vv53nj4o"
}