{
  "title": "Samsung Galaxy XR hands-on: It’s like a cheaper Apple Vision Pro and launches today",
  "text": "is a senior reporter and author of the Optimizer newsletter. She has more than 13 years of experience reporting on wearables, health tech, and more. Before coming to The Verge, she worked for Gizmodo and PC Magazine.\n\nPosts from this author will be added to your daily email digest and your homepage feed.\n\nWatching the first few minutes of KPop Demon Hunters on Samsung’s Galaxy XR headset, I think Apple’s Vision Pro might be cooked.\n\nIt’s not because the Galaxy XR — which Samsung formerly teased as Project Moohan — is that much better than the Vision Pro. It’s that the experience is comparable, but you get so much more bang for your buck. Specifically, Galaxy XR costs $1,799 compared to the Vision Pro’s astronomical $3,499. The headset launches in the US and Korea today, and to lure in more customers, Samsung and Google are offering an “explorer pack” with each headset that includes a free year of Google AI Pro, Google Play Pass, and YouTube Premium, YouTube TV for $1 a month for three months, and a free season of NBA League Pass.\n\nDid I mention it’s also significantly lighter and more comfortable than the Vision Pro?\n\nOh, and it comes with a native Netflix app. Who is going to get a Vision Pro now? Well, probably folks who need Mac power for work and are truly embedded in Apple’s ecosystem. But a lot of other people are probably going to want this instead.\n\nThese were the thoughts running through my head while I got my second official demo of Samsung’s headset ahead of today’s announcement. I’d gotten a demo of a Moohan prototype last December, but this was the final iteration of that product. There are a few notable changes. The front piece is more cushioned than I remembered from my last demo, and I finally got to try the removable bottom light seal. But otherwise, not much has changed.\n\nThe hardware still looks like a Vision Pro mixed with a Meta Quest 3. There aren’t creepy eyes on the front screen, though there is still a glass panel that houses several cameras to capture your surroundings and hand gestures. There are micro-OLEDs inside that support 4K resolution and up to 90Hz refresh rates, which should make scrolling and games look smooth. Samsung promises up to 2.5 hours of battery life, right on a par with the Vision Pro.\n\nIt sure looks like a Vision Pro. Image: Owen Grove, The Verge\n\nThere’s no removable strap — it’s all a lightweight plastic with a cushioned back piece and a dial that you use to adjust tightness. The materials don’t feel as premium as the Vision Pro. But plastic is easier to clean than fabric, and when I slip it onto my head, it’s significantly lighter, and the weight is distributed more evenly. (The first Vision Pro was extremely front-heavy, but a new strap helps a lot with that.) It took until the end of the 30-minute demo for me to start feeling some tension.\n\nSo much of the experience inside the headset is similar to the Vision Pro that I can imagine Apple’s lawyers bristling. There’s a high-resolution passthrough, though I wouldn’t call it crystal clear. The headset tracks what you’re looking at, and you pinch your fingers to select. One difference is that there’s a Quest-like cursor when you point at menus and XR elements, making it a smidge easier to tell if the correct thing is highlighted. Otherwise, the interface is a Google-flavored version of what you’ll find in a Vision Pro.\n\nThey look like Vision Pros, but are much easier to wear. Photo by Victoria Song / The Verge\n\nFeature-wise, there’s everything from spatial photos and immersive environments to blowing up multiple browser windows for maximum productivity. There’s also automatic spatialization for existing 2D content. As in, when I go to YouTube to watch a recent Vergecast episode, a 3D version of my colleague David Pierce leaps forward from the video.\n\nGoogle and Samsung are keen to point out that this Android XR headset has Gemini. In fact, at a small keynote speech for the press, executives from both companies emphasized that this device has “AI at the core.”\n\nThe button that turns the device on and also cues Gemini. Image: Owen Grove, The Verge\n\nThat means that if, for some cockamamie reason, you decide to read a physical magazine with this headset on, you can Circle to Search any interesting products you happen upon and view them in virtual Chrome. When viewing an immersive 3D map in the Google Maps app, you can ask Gemini questions about your surroundings. If you’re viewing a photo or YouTube video, you can start a Gemini Live session, share your screen with the AI, and ask it questions. While looking at a photo of a fuzzy quadruped at Machu Picchu, Gemini told me that I was, in fact, looking at a llama and not an alpaca. It then proceeded to tell me llama facts. In the middle of watching a 3D YouTube video of an Icelandic volcano erupting. Gemini mistakenly identified it as a volcano in Hawaii. So, you know, there are limitations.\n\nSamsung’s large demo screen shows a bit of what you see from inside. Image: Owen Grove, The Verge\n\nI’m not convinced that the average person will ever want these expensive, high-tech XR headsets. You could argue Galaxy XR is also dead on arrival, especially since the zeitgeist seems to be shifting heavily toward smart glasses. But for those who do want headsets? On paper, the Galaxy XR headset is the much better value. You’re getting a similar consumption experience. It’s nearly half the price. (Heck, it costs less than a Z Fold 7!) It’s much easier to wear for a longer period of time.\n\nThere’s a wide swath of content, and you get access to Google apps like YouTube and Maps, among others. If you think AI is a selling point, Gemini is integrated into this headset far more effectively than Siri is in the Vision Pro. And, compared to gadgets like phones, tablets, and computers, these headsets are much easier to use as standalone devices. But the most popular use case we’ve seen so far for these headsets is using them as your own personal theater. The Galaxy XR may lack some of the Vision Pro’s premium polish — and what amounts to the power of a full-fledged Mac — but, immersive content-wise, it’s good enough.\n\nPlus, if you want to use it for productivity, you can cast a Samsung Galaxy Book laptop screen to the headset (though it’s unclear how this compares to casting a Mac to a Vision Pro), answer calls from it, or share files between the headset and other devices.\n\nIn addition to hand gestures, the Galaxy XR can also be controlled with handheld controllers (sold separately.) Image: Owen Grove, The Verge\n\nI’ll caveat all this with a reminder that demos are not the same as living with a device. When we get a Galaxy XR headset in for testing, it’s possible we’ll find things that tilt the balance back in the Vision Pro’s favor. I’m curious to see how the M5 Vision Pro — which goes on sale October 22nd — will fare. But if the Galaxy XR holds up as well in real-life testing as it has in demos, then there’s even less reason to buy a Vision Pro.\n\nCorrection, October 22nd: The headset uses micro-OLED, not mini-LED as originally stated.",
  "authors": [
    "Victoria Song"
  ],
  "url": "https://www.theverge.com/tech/802299/samsung-galaxy-xr-hands-on-price-release-date"
}