{
  "title": "Film Historian Answers Old Hollywood Questions",
  "text": "Transcript\n\nI'm Tony Maietta, I'm a Hollywood historian.\n\nLet's answer some questions from the internet.\n\nThis is Old Hollywood support.\n\nSaint-Francis asks alright, Mr. DeMille,\n\nI'm ready for my closeup.\n\nWhere is this iconic line from?\n\nIt is from a 1950 classic film called Sunset Boulevard,\n\nspoken by Gloria Swanson as Norma Desmond,\n\nand it's one of the great last lines in movie history,\n\ndirected by Billy Wilder about an aging silent film star\n\nwho believes she's ready for a comeback.\n\nAnd Mr. DeMille is Cecil B. DeMille,\n\nwho was a legendary director both in the silent era\n\nand throughout classic Hollywood\n\nand he worked frequently with Gloria Swanson.\n\nSo there's kind of meta moments here with this iconic line,\n\nwhich is probably one of the most famous last lines\n\nin cinema history.\n\nI hear it all the time.\n\nR/AskHistorians asks, how did the US film industry\n\ncome to be centered in Los Angeles?\n\nWhen the film industry came here,\n\nit didn't start out in Los Angeles.\n\nIt started out on the East coast in a beautiful little town\n\ncalled West Orange, New Jersey,\n\nbecause that's where Thomas Edison was.\n\nThomas Edison was not only the father\n\nof many, many inventions,\n\nsuch as the light bulb and the phonograph.\n\nHe was also famously litigious and he patented everything.\n\nNow, this wasn't a problem\n\nfor the larger film companies in New York, such as Biograph.\n\nThey created their own cameras\n\nand they didn't have any need for Edison.\n\nBut for the smaller independents, they found that they had\n\nto pay Edison every time they wanted\n\nto use one of his cameras.\n\nWell, this could be quite expensive,\n\nand they tried to get around it.\n\nBut Edison had what we we'd like to think of\n\nas the patents men, they were basically henchmen\n\nand they would find these independents\n\nand they would shoot up their cameras\n\nso they couldn't make the movie or they would beat 'em up,\n\nor it was a, it was a real wild west situation.\n\nThe best thing to do was to get as far away\n\nfrom Edison as possible.\n\nSo they went to the very edge\n\nof the United States to California.\n\nBut when they got to Southern California,\n\nthey realized, wow, this is even better\n\nthan East Orange, New Jersey.\n\nThis is even better than Fort Lee\n\nbecause we have about 260 days of sunshine,\n\nand within a day's travel, you have everything.\n\nYou have the desert, you have the ocean,\n\nyou have the mountains, you have the city.\n\nI mean, it was an incredible array\n\nof things at their disposal.\n\nSo that's really why the film industry\n\nended up in Los Angeles and in Hollywood.\n\nColette, @BurberrySkirt, I like that name,\n\nasks what year do you guys consider to be the beginning\n\nof Hollywood's golden age?\n\nI was thinking either 1927, the arrival of sound,\n\nor 1934, the end of pre-code.\n\nMost people agree, it's probably about the beginning\n\nof the advent of sound,\n\nalthough silent films certainly qualifies\n\nfor some wonderful golden age films up until the end\n\nof the studio system, which is sometime\n\nin the mid to late 60s\n\nis pretty much the golden age that we think of.\n\nBut there was also a second golden age, not quite as famous,\n\nbut just as interesting that happened after that\n\nfrom about '68 when the production code was gone.\n\nAnd these incredible filmmakers like Martin Scorsese,\n\nFrancis Ford Coppola, like Alan Pakula,\n\nwere making really groundbreaking films\n\nlike The Godfather Saga, like Rosemary's Baby,\n\nlike What's Up Doc with Peter Bogdanovich\n\nall the way up to about Chinatown with Polanski.\n\nSo that was kind of the second golden age,\n\nwhich ended in about '75.\n\nYou referenced the end of pre-codes.\n\nThe pre-code era was about four\n\nor five years from about 1929 to 1934\n\nin which films were really crazy, lascivious, salacious\n\nbecause there was a production code,\n\nwhich was basically a list of do's and don'ts\n\nthat was created in order to prevent censorship.\n\nHollywood was self-censoring at this time.\n\nThey didn't want other people, the government certainly,\n\nto come in and censor their film.\n\nSo pre-code really is a misnomer\n\nbecause there was a code of do's and don'ts and be carefuls\n\nand don't do this and don't do that,\n\nand make sure that kiss isn't longer than five seconds.\n\nIt wasn't enforced until 1934\n\nwhen the Catholic church got involved.\n\nPriests would tell their congregations from the pulpit,\n\nyou can go to hell if you watch this film.\n\nAnd that really scared filmmakers.\n\nSo they finally started paying attention\n\nand said, okay, okay, okay, we'll follow the code.\n\nA Reddit user asks, do studios in Hollywood\n\nstill own their actors the same way\n\nthey did in the 20th century?\n\nThey sure as hell don't.\n\nBut the studio system ended pretty much in the 60s.\n\nUniversal held onto some of their contract players\n\nthroughout the 60s.\n\nOne of the great things about the studio system\n\nwas that this was a great training ground for people.\n\nPeople like Lucille Ball who came to Hollywood as a showgirl\n\nand learned her craft while she was getting paid\n\nfor a studio and then became Lucille Ball.\n\nI mean, this was a wonderful, wonderful training round\n\nfor these actors and actresses.\n\nYes, it was very constrictive and yes,\n\nyou could feel like you were being owned.\n\nHowever, many people kind of wish that that system\n\nwas still around\n\n'cause it was guaranteed employment if anything.\n\nPageTurner627 asks, was the Mid-Atlantic accent\n\nreally just a made up accent used by actors?\n\nYes, it was.\n\nIt wasn't made up by actors,\n\nbut yeah, there's no such thing as a Mid-Atlantic accent.\n\nThere had to be a standardization of speech\n\nin order for people, the audiences to understand actors,\n\nand remember, sound was brand new.\n\nTalkies were brand new, so they needed every break\n\nthey could get.\n\nMid-Atlantic really is a mixture\n\nof East coast upper class dialects, Atlantic Coast,\n\nthat's where the Mid-Atlantic comes from,\n\nand stage talk, stage speech, if you will.\n\nIt's kind of that blend.\n\nAnd that's why actors\n\nand actresses in films from the 30s and 40s\n\nand up until the 50s don't talk like anybody else.\n\nThey don't talk like us.\n\nBy the 50s when films were becoming a little more,\n\nthere was a realism movement after the war,\n\nmostly from foreign films.\n\nYou didn't see that as much.\n\nThe Mid-Atlantic accent kind of died away.\n\n@BigThuggga asks this, what is so legendary\n\nabout Marilyn Monroe, not even being funny.\n\nWas she really a good actress?\n\nMarilyn, one of the most iconic actresses\n\nin the history of cinema.\n\nHere's the thing about Marilyn.\n\nMarilyn had what one of her directors, Billy Wilder,\n\ncalled flesh impact.\n\nAnd what he meant by that was the effect\n\nof seeing Marilyn on screen to audiences was visceral.\n\nYou could feel her.\n\nShe had that kind of force,\n\nand all you gotta do is watch some of her films,\n\nGentlemen Prefer Blondes, How to Marry a Millionaire,\n\nyou get that.\n\nYour eye goes immediately too,\n\nwhere you cannot look at anybody else\n\nwhen Marilyn Monroe's on screen.\n\nMarilyn was a natural comedian.\n\nWatch Gentlemen Prefer Blondes.\n\nWatch How to Marry a Millionaire.\n\nShe's very funny, but it's not overdone, she's very subtle.\n\nWhen she was the biggest star in the world,\n\nshe stopped for a year and went to New York\n\nand joined the actor studio and took classes\n\non how to become a really good actress from Lee Strasberg.\n\nNow, this is unheard of.\n\nShe was already a huge star, but she stopped\n\nbecause she wanted to get better, and she did.\n\nShe, some of her later performances,\n\nparticularly in the Prince and the Showgirl\n\nwith Sir Lawrence Olivier,\n\nwho was no slouch, she pretty much wipes him off the screen.\n\nShe was sublime.\n\nUnfortunately, she died at age 36,\n\nso we never really had the opportunity to find out\n\nwhat her later career would've been like.\n\nBut I have no doubt that she would've been\n\none of the greatest stars.\n\n@Ahgahwa asks, my roommate told me she doesn't know\n\nwho Elizabeth Taylor is, and I almost had a stroke.\n\nElizabeth Taylor, the biggest star of the 50s and 60s.\n\nI mean, Taylor and Burton, not ringing a bell for you?\n\nThey call Elizabeth Taylor the last movie star,\n\nbecause she was one of the last of the generation\n\nthat was completely, totally raised at a studio.\n\nShe began working in films as a very young child\n\nall up until almost to her death.\n\nI mean, she was trained by the studio, mostly MGM.\n\nShe was certainly one of the most beautiful women\n\nin the world.\n\nShe famously had violet eyes.\n\nShe and her husband, Richard Burton, who she married twice,\n\nwere probably the very...\n\nThey weren't the first celebrity couple,\n\nbut they were one of the biggest celebrity couples\n\nin the 60s.\n\nThey met on the set of Cleopatra when she was married\n\nto someone else, and there was a scandal.\n\nThe Vatican condemned her.\n\nShe was a brilliant actress, she won two Academy awards.\n\nDownload Elizabeth Taylor,\n\nbecause you're going to be stunned\n\nat some of the things she does\n\nand how beautiful this woman really was,\n\nand what a great humanitarian she was.\n\nElizabeth Taylor said the word AIDS\n\nbefore anybody else would\n\nbecause she had so many friends who were dying.\n\nSo we owe a great debt to Elizabeth Taylor for that alone.\n\nIstobri asks, what caused the decline\n\nof the classic Hollywood musical film, 1930s to 1940s era?\n\nMusicals were very expensive to make.\n\nYou not only had to pay actors, you had to pay musicians,\n\nyou had to pay songwriters, you had to pay choreographers.\n\nThere were a lot of people on the musical payroll.\n\nSecond of all, after the war,\n\nthe mood in the country shifted.\n\nThere was a sense of innocence about musicals,\n\nbecause you have to suspend your disbelief\n\nbecause I mean when you think about it,\n\nhow many times have you seen in your daily life\n\nsomebody having a normal conversation,\n\nthen suddenly bursting into song\n\nor suddenly dancing around the room?\n\nIt doesn't happen that often.\n\nAfter the war, people got a lot more cynical.\n\nThere was a great realism movement in films after the wars.\n\nBut beyond that, in the 1950s,\n\nthere was this little invention called television,\n\nwhich began peeling away movie audiences by the millions.\n\nMovie studios had to start divesting themselves\n\nof this great pool of talent that they had under contract.\n\nSo they didn't have this pool of talent at the ready cheaply\n\nto make these musicals, which were incredibly expensive.\n\n@Himedzhosh14141 asks, so question for film oomfies,\n\nwhy is Gone With The Wind\n\nstill considered a classic despite everything?\n\nThey're talking about the attitude of the filmmakers\n\ntowards a very shameful time in our history,\n\nslavery and the Civil War.\n\nHere's the thing about Gone With the Wind.\n\nIt's an incredibly made film.\n\nIt was a technical feat when it came out.\n\nIt stunned everyone\n\nand blew everyone away by its scope, by its size,\n\nby its grandeur, by its subject matter.\n\nIt is difficult for audiences to watch today,\n\nbut it is still a huge achievement in filmmaking.\n\nYou have to put yourself in the mindset, perhaps,\n\nof 1939, 1940, when these attitudes\n\nwere much different than they are today\n\nand then hopefully you can enjoy the film for what it is.\n\nPrevious-Stickk asks, does anyone have any salacious,\n\nscandalous, shocking tea about old Hollywood stars?\n\nLet's see, Clark Gable was alleged to be a gay hustler\n\nin Los Angeles early in his career,\n\nand actually hooked up with George Cukor,\n\nwho later directed him for a time and Gone with the Wind.\n\nOh, Loretta Young, Loretta Young's great.\n\nSo Loretta Young was a very, very famous actress\n\nin the golden age,\n\nand she was also very, very Catholic.\n\nBut she was on a film opposite Clark Gable, her co-star,\n\nand they had an affair.\n\nThe film was called Call of the Wild,\n\nand at the end of the affair,\n\nLoretta Young became very, very pregnant.\n\nWell, what are you gonna do?\n\nClark Gable was married.\n\nThere was no possibility of getting married.\n\nSo Loretta Young left Hollywood for a few months,\n\nhad her baby, put the baby in an orphanage,\n\ncame back to Hollywood, waited a few more months,\n\nand then adopted that baby, named her Judy,\n\nand raised her as her adopted child\n\nfor the rest of her life.\n\nAs Judy got older, she started to look more\n\nand more like Clark Gable and Loretta Young,\n\nto the point where she had the Gable ears\n\nthat her mother had to have pinned back.\n\nSo eventually, after hearing these rumors her entire life,\n\nJudy Lewis confronted her mother\n\nnear the end of her mother's life\n\nand asked her if it was true.\n\nAnd finally, Loretta confessed yes, it is true.\n\nYou are a walking mortal sin, Loretta Young.\n\nPurpleLenora asks, when was\n\nthe first Academy Award ceremony held?\n\nThe first Academy Awards were held in May of 1929,\n\nand they were held at the Hollywood Roosevelt Hotel.\n\nThe tickets cost $5,\n\nand the ceremony was 15 minutes long.\n\nThe Academy of Motion Picture Arts and Sciences\n\ndeveloped this award as kind of like, oh,\n\nand let's give this award out every year.\n\nThey really started to gain steam in the late 30s\n\nand into the 40s.\n\nOnce television came in\n\nand they started to be televised in the 50s,\n\nthey truly became the the appointment television\n\nthat we think of today.\n\nWhy is this called an Oscar?\n\nIt's one of these legends that no one's really sure\n\nwhat the real truth is.\n\nMy favorite story and the legend that I like the best\n\nis that it was named by Betty Davis because the backside\n\nof Oscar reminded Betty Davis of her first husband,\n\nOscar Nelson, and she allegedly said, that's an Oscar.\n\nThat may not be true, but it's my favorite story.\n\nMacMac360 asks, what happened the night\n\nNatalie Wood died?\n\nThere was a lot of speculation.\n\nIt happened Thanksgiving weekend in 1981 on a boat\n\ncalled The Splendor, which was Natalie Wood\n\nand RJ Wagner's boat named after Splendor in the Grass,\n\none of Natalie Wood's great films.\n\nShe and RJ Wagner, Robert Wagner,\n\nand Christopher Walken went out to Catalina for a very cold\n\nand very wet Thanksgiving weekend,\n\nand Natalie Wood ended up Sunday morning\n\nfloating in Catalina Harbor.\n\nNo one really knows what happened.\n\nThe theory that is most accepted\n\nand I think makes the most sense\n\nis that the dinghy was attached to the side of the boat\n\nand it was banging and it was keeping her awake.\n\nAnd her husband and Christopher Walken were up above\n\nhaving drinks and she was in the bedroom.\n\nSo she went outside in her nightgown and parka\n\nand socks to retie the dinghy,\n\nslipped on the step,\n\nhit her head and fell in the water.\n\nAnd unfortunately because her parka filled with water\n\nand kept her weight down,\n\nshe couldn't get back up into the boat.\n\nAnd that's usually what people cite as the cause of death\n\nwas the fact that she drowned.\n\nDamIts_Andy asks, were there gay bisexual stars\n\nin the 50s and 60s?\n\nYes, there have always been gay and bisexual stars.\n\nThe difference is, is that they weren't out.\n\nYou couldn't be out in the 50s and 60s\n\nwhen you could be arrested for being gay or bisexual\n\nand acting on it in the 50s and 60s.\n\nYou could be thrown into a mental hospital,\n\nyou could get a lobotomy, lots of horrible things.\n\nSome of the ones who were a little more honest\n\nabout who they were were Farley Granger.\n\nTo a certain extent, Montgomery Cliff.\n\nCertainly he wasn't out,\n\nbut we know now, certainly Rock Hudson, Tab Hunter.\n\nThey were afraid that if the public knew\n\nthat a star was gay,\n\nthat suddenly he wouldn't have the romantic peel.\n\nBut if you watch some films of that era,\n\nsuch as Pillow Talk,\n\nthere's some wonderful little sly illusions\n\nto the real sexuality of Rock Hudson\n\nbecause everybody knew in the film industry,\n\nthey just didn't know in Peoria.\n\nThey just didn't know in Des Moines.\n\nIt's a struggle, it's still a struggle.\n\nThere's a lot more gay actors in Hollywood\n\nthan are out gay actors in Hollywood.\n\nBut we're making progress slowly but surely.\n\nThePixelPaint asks, why was it so hard for so many actors\n\nto make the transition from silent films to the talkies?\n\nWas it just a matter of voiced acting being more difficult,\n\nor were there other factors at play?\n\nSilent film is a completely different art than talking film.\n\nI think that's what people don't realize.\n\nThey think silent films were just films without talking.\n\nNo, they were an entirely different art form.\n\nA lot of actors in Hollywood,\n\nparticularly big silent film stars, had very heavy accents.\n\nDidn't matter because you weren't talking.\n\nSo there were some great silent film stars who just left.\n\nThey weren't even gonna try to learn\n\nhow to speak this mangled new, a Mid-Atlantic accent there.\n\nAlso, a big factor was the fact\n\nthat many silent film stars had...\n\nTheir personas didn't match their voice.\n\nThis happened primarily with an actor named John Gilbert,\n\nwho was probably the most famous victim of talkies.\n\nHe was the he man, he was romantic,\n\nand he kind of had a light tenor voice, it didn't match.\n\nSo that was really one of the big problems\n\nwas the persona didn't necessarily match the voice.\n\nThere was also a shift in the culture at this time.\n\nDon't forget, not only was there a shift in Hollywood\n\nwith sound and talkies, but the Depression happened.\n\nWall Street fell.\n\nSuddenly, the kind of heroes that were in silent film\n\nwere not really relevant in this tough new world we were in.\n\nBaronDestructo asks, how many cigarettes per day\n\nwas 16-year-old Judy Garland encouraged to smoke\n\nin order to keep her weight down\n\nduring the filming of The Wizard of Oz in 1939?\n\nI wish it was only cigarettes.\n\nSmoking was just what sophisticated adults did.\n\nSo MGM had no hand in Judy Garland's cigarette habit.\n\nHowever, they had a big hand in her drug addiction.\n\nThey did encourage her to take pills, amphetamines.\n\nAn easy way to lose weight back in the day\n\nwas to take amphetamines.\n\nThe problem with amphetamines was that it hyped her up.\n\nAnd so she couldn't sleep at night.\n\nSo they then had to give her sleeping pills\n\nto get her to sleep because she had to be up at 5:00 AM\n\nand sparkle, Judy, sparkle.\n\nIt became a very, very, very bad habit.\n\nOne thing fed the other.\n\nNow, MGM and all the studios\n\ndidn't just do this with Judy Garland,\n\nthey did it with a lot of stars.\n\n@CalBoDan asks, Shirley Temple is a real person,\n\nthought it was just a drink.\n\nYes, Shirley Temple was a real person.\n\nShe was the biggest box office star in the world\n\nfor four years beginning when she was six years old.\n\nShe saved 20th century Fox from bankruptcy\n\nbecause this was the Depression.\n\nSo this little girl, all of six years old,\n\nheld a studio on her back.\n\nShe was later an ambassador in the 80s.\n\nSo she had quite a career, and the drink was indeed\n\nnamed after her because it has no alcohol,\n\nand she was a child.\n\nBlueJester12 asks, when did\n\nthe old Hollywood system go away?\n\nWell, I would probably say in the late 60s,\n\nbecause what happened was, was that the studios were forced\n\nby the Supreme Court to divest themselves\n\nof their theater chains.\n\nNow, back in the 20s and 30s and 40s,\n\nstudios owned theaters.\n\nThat was really the point for many of these moguls\n\nwas they really were more in the real estate business.\n\nThey had more theaters,\n\nand then they created these studios\n\nto put product into these theaters.\n\nSo there were paramount theaters,\n\nthere were Warner Brothers theaters.\n\nMGM had Lowe's, it was decided that this was a monopoly.\n\nIt's called vertical integration.\n\nAnd the studios were forced to divest themselves\n\nof their theater chains.\n\nSo they lost an outlet for their product.\n\nThey had to drastically cut back on staff,\n\ndrastically cut back on the number of films they could make.\n\nAnd there was this little thing happening\n\nabout the same time called television,\n\nwhich was also eating away at their audience.\n\nAnd by the 60s, many studios just couldn't survive\n\nas they had during the golden age.\n\nSo they had to let go of their contract players,\n\nthey had to let go of their contract writers,\n\nall these people that were under contract.\n\nWhen the studio system really died down,\n\nI think is what most people think of\n\nas the end of Old Hollywood, the end of the studio system.\n\nBrandonMaI asks, worst thing about film school\n\nwas having to sit through boring ass black and white movies.\n\nIt's a knife in my heart, but no, I'm glad you asked this\n\nbecause all I can tell you is is that watch a film\n\nfrom 1933 called Babyface,\n\nwhich is one of these pre-code films\n\nin black and white.\n\nAnd I guarantee you,\n\nthere ain't nothing boring ass about it.\n\nIt is one of the most salacious, lascivious.\n\nBarbara Stanwick plays a woman\n\nwho literally fucks her way to the top.\n\nIt's unfortunate that because these films are not presented\n\nin a way that we're used to, that they get this reputation\n\nof being boring.\n\nYou just have to realize it was a different time,\n\nand it might seem a little slow to us\n\nin our instant gratification world,\n\nbut sit with it for a while, I guarantee you,\n\nand it'll get interesting.\n\nA Reddit user asks\n\nwhat movies were the first in their genres,\n\nthe real trendsetters of filmmaking?\n\nWhen you think about screwball comedies,\n\nprobably the first screwball comedy,\n\none of the most famous\n\nis it happened one night starring Clark Gable\n\nand Claudette Colbert.\n\nThey both won Oscars for it.\n\nThat was definitely the first screwball comedy.\n\nIt started the entire screwball comedy genre.\n\nMusicals had been around since talkies.\n\nThe Broadway melody of 1929 was not the first musical,\n\nbut it's probably one of the very first\n\nand one of the most famous that won the Academy Award.\n\nIt was the first musical to do that.\n\nI mean, there were films in the silent era\n\nthat you could term horror films.\n\nThe big one, the one that really set the horror genre\n\nin motion was Dracula starring Bella Lagosi.\n\nIt was a tremendous hit in the early 30s\n\nand started this whole cycle\n\nof horror films from Universal Studios mostly\n\nsuch as Frankenstein,\n\nsuch as the Bride of Frankenstein,\n\nsuch as The Invisible Man.\n\nSo you can really point to Dracula\n\nas being probably the very first of those.\n\nThere was a silent film star named Harold Lloyd,\n\nwho was one of the big three.\n\nChaplain, Keaton and Lloyd,\n\nthe big three comic superstars in silent film.\n\nHarold Lloyd did romantic comedies.\n\nWe don't think of romantic comedies necessarily\n\nin silent film,\n\nbut he really was a romantic comedy star of his era.\n\nGangster films were big in the 1930s\n\nbecause of the Depression,\n\nbecause of the fact that people were so desperate\n\nand they wanted to see people giving the finger\n\nto this government and this society,\n\nwhich put us in such dire straits.\n\nSomeone from Quora asks, in what major ways\n\ndid Charlie Chaplin impact cinema?\n\nAside from the fact that he was probably the biggest star\n\nin the world during the silent era,\n\nhis impact as a filmmaker can be felt.\n\nHe was singular in the fact that for the majority\n\nof his great career was his own boss.\n\nHe had his own studio.\n\nHe financed his own films, he wrote his own scripts,\n\nhe cast his films.\n\nCharlie Chaplin was a force in Hollywood.\n\nHe was a force in filmmaking.\n\nAnd Charlie Chaplin was also the last star\n\nto leave silent film and go into talkies.\n\nWhen you're talking about titans of film history,\n\nCharlie Chaplin is right up there at the top.\n\nOne of the amazing things about Chaplain too,\n\nif you ever watch a Chaplain film,\n\nis Chaplain had such incredible control over his body.\n\nHe was such an athlete.\n\nHe did his own stunts, so did Douglas Fairbanks.\n\nThese people did their own stunts.\n\nThere was no CGI, there was no manipulation of the camera.\n\nWhat you see up there, he actually did.\n\nSame thing with Buster Keaton, another great athlete,\n\nsilent comic, one of the big three.\n\nThese people all did their own stunts.\n\nMany of them directed their own films,\n\nwrote their own films.\n\nThey were true auteurs\n\nbefore the word auteur ever came to existence.\n\n@RadSeed asks, did silent film stars\n\nreally bother learning their lines?\n\nThere weren't scripts in silent films, there were scenarios.\n\nAnd very frequently,\n\nespecially when you're talking about some of the greats\n\nlike Chaplain and like Harold Lloyd and Buster Keaton,\n\nthey created as they went along.\n\nSo when you see a silent film\n\nand you see actors mouthing words, yes,\n\nthey're kind of getting the general idea\n\nof what the scene is trying to convey,\n\nbut it's not like they had to memorize lines.\n\nThere's a very famous story about a silent film star\n\nwho would actually curse while they were filming\n\nbecause he didn't think anybody would notice.\n\nWell, there happened to be lip readers in the audience\n\nwho could see exactly what he was saying.\n\nYou'll see a stray son of a bitch,\n\nor you'll see a stray what the hell are you doing here?\n\n@ORRY111 asks, why everyone's so obsessed with Citizen Kane,\n\nwhy not Citizen Orry?\n\nA Citizen Kane is kind of universally accepted\n\nas the greatest film of all time.\n\nIt's kind of a David and Goliath situation\n\nbetween Orson Welles and William Randolph Hearst.\n\nCitizen Kane is remarkable for many reasons.\n\nThe technology in particular, the cinematographer,\n\nGreg Toland, created something called deep focus,\n\nwhich had never been done before\n\nand basically what that means is, is the foreground,\n\nthe middle ground and the background are all in sharp focus.\n\nThe fact that the moguls got together\n\non the behest of William Randolph Hearst\n\nand tried to stop the film, tried to squash it.\n\nAnd so there's a real rebellious spirit behind Citizen Kane,\n\nwhich I think people admire.\n\nI think people certainly admire the genius\n\nthat was Orson Welles.\n\nThis film, though it's heralded as a great achievement,\n\nwas not a big hit when it was released\n\nbecause it rarely played anywhere\n\nbecause there were so many people against it.\n\nSo it's certainly grown in stature\n\nand as I said, many people consider it\n\nthe greatest film of all time.\n\nThose are all the questions.\n\nThanks for watching Old Hollywood Support.",
  "authors": [
    "Condé Nast"
  ],
  "url": "https://www.wired.com/video/watch/tech-support-film-historian-answers-old-hollywood-questions"
}