{
  "title": "Maggi Hambling and Sarah Lucas: Ooo La La review – from the sublime to the ridiculous",
  "text": "Thirty-five years ago the Young British Artists crashed into Britain’s senescent art world and dumped two fried eggs and a kebab on its top table. Or at least that was the myth. Now Sarah Lucas, toughest of the YBAs, is 63, her fried eggs and kebab are art history, and she’s besties with Maggi Hambling, 80, one of the last of the old-school painters. Lucas admires Hambling not just as an artist but a woman, and in Maggi the Maggi, she has created a loving, heroic image of Hambling’s face made entirely of cigarettes. Hambling returns the compliment with Sarah at Work which, like all her paintings here, is a slapdash mess. But it’s hard to pay much attention to Hambling’s daubs when your eyes are full of balloon breasts (by which I mean boobs moulded on party balloons), shiny red bums thrust in the air, floppy phallic ears and spindly pipe cleaner legs wearing shoes Lucas must have bought in bulk from a fetish shop.\n\nIn the latest iteration of her Bunny sculptures, laughable yet tragic creatures that render the Playboy Bunny absurdly literal, Sarah Lucas creates orgiastic hilarity and aesthetic mayhem. Limbs, eyes, nipples are everywhere as these poor things pose on concrete chairs in a style you might find in an exclusive sex club, or a male fantasy of some such place. It’s the stuff of the manosphere’s wildest dreams, a lurid monument to hyped-up internet-driven porn. Yet furious feminist satire is just one dimension to Lucas’s extraordinary works.\n\nView image in fullscreen A dollop of moody marks … Wall of Water, Sunset by Maggi Hambling. Photograph: © Maggi Hambling\n\nShe and Hambling met, we’re told, at the Colony Room in Soho. But while it’s Hambling who was friends with its most famous frequenter Francis Bacon, it is Lucas who deserves comparison with him. Her splayed anatomically explicit bodies of the Bunnies are as desperate and universal as his eviscerated people in claustrophobic interiors. This prison of porn becomes an image of hell as startling as any Bacon painted: you laugh then you cry at these saucy horrors. A Cycoplean girl curled up in a corner peers pitiably at you from her collaged eye, a cigarette in a stumpy paw.\n\nBut I would be lying if I said I spent this exhibition in soul-searching despair at the male mind. Instead I was thrilled by Lucas’ creativity. Once she mocked the proprieties of sculpture with readymades such as Au Naturel, that signified male and female with two oranges and a cucumber next to a tin bucket and a pair of melons. Now she makes complex, technically difficult sculptural masterpieces, such as Ooh La La that thrusts itself into your face as soon as you walk into Sadie Coles HQ.\n\nCrouched on a hard cold chair, glistening in shades of crimson, this outrageous erotic statue with shades of Allen Jones looks like it’s made of latex. In fact it’s cast in bronze, lacquered and painted – a sophisticated, crafty way to create something just as raw and vital as her early readymades. Where some of her generation have turned away from conceptual art or become self-parodies, Lucas has grown without betraying her roots: she combines art and truth in ever more stunning ways, with physical extremes, spectacular gyrations. One Bunny, collapsed on a chair with arms thrown all over the shop and two sets of balloons – which could be breasts or eyes – makes you see how she matches Picasso, eye-nipple for nipple-eye. In fact this appears to be a parody of his most furiously misogynistic painting, the 1929 Large Nude in a Red Armchair in the Musée Picasso. Lucas translates the howl of this raging image of Picasso’s wife Olga into three dimensions and 21st-century sleaze. The two artists meet as fellow connoisseurs of the perverse and true. And Lucas is very funny, did I mention that?\n\nView image in fullscreen Sarah Lucas and Maggi Hambling. Photograph: Steven Hatton\n\nThere is a gulf between her and Hambling and it is not generational. Lucas is precise, witty and intelligent. Hambling’s works are none of those things. The first big canvas by her is, at first, impressively wild and turbulent – a semi-abstract dollop of moody marks – but somehow it curdles and slumps as you look, its freedom turns out to be mere mess, a pretence of energy. It was done in 2012, years before the well-publicised accident in which she lost a finger. And that sagging sense of futility only worsens. Hambling even shows her sculptures, which are as floppy and false as her paintings. It’s like an art fair where you might see art of wildly incompatible kinds and qualities lumped together – except here it’s not commerce but an emotional connection between the artists that has created this ludicrous juxtaposition. But if this friendship has helped to sustain the roll of artistic brilliance that Lucas is on, who am I to question it?",
  "authors": [
    "Jonathan Jones"
  ],
  "url": "https://www.theguardian.com/artanddesign/2025/nov/20/maggi-hambling-and-sarah-lucas-ooo-la-la-review-sadie-coles-hq-london"
}