{
  "title": "Premier League: 10 things to look out for this weekend",
  "text": "1 Garnacho and Walker lock horns again\n\nA Mancunian reunion of sorts is on the cards should Kyle Walker of Burnley face Alejandro Garnacho on Chelsea’s left at Turf Moor. The winger has started to settle at Stamford Bridge after his summer move from Manchester United and showcased his range against Wolves before the international break. His assist for Pedro Neto combined wicked pace with a perfect ball along the carpet. His setup for Malo Gusto involved shifting on to his right foot before a dinked cross to the far post. His celebration with Neto, replicating his sitting embrace with Kobbie Mainoo and Rasmund Højlund, was a reminder of how quickly things change. The last time Garnacho took on Walker? When the former scored for United in their FA Cup final win over Manchester City. Taha Hashim\n\nBurnley v Chelsea, Saturday 12.30pm (all times GMT)\n\n2 Semenyo key to ending Cherries’ slide\n\nAntoine Semenyo is getting the full rumour-mill treatment amid a reported £65m release clause for a possible January departure, the gossip columns preparing him for graduation from the Premier League’s middle class. It is to be expected for a winger who has six goals and three assists and is joyous to watch. Nonetheless, his side are in an awkward spot, having engaged in a body swap: it is the relegation battlers West Ham who enter with successive wins, while Bournemouth are down 7-1 on aggregate over their past two fixtures after an impressive start to the season. Semenyo was denied from the spot by Emi Martínez in the 4-0 defeat by Aston Villa but taking on a defence without a clean sheet since August could be the perfect tonic. TH\n\nBournemouth v West Ham, Saturday 3pm\n\n3 Welbeck a left-field shout for England\n\nIt was interesting to hear Thomas Tuchel name-drop Danny Welbeck on more than one occasion during the international break even though the Brighton striker turns 35 next week. “Even without knowing him, I know what he can give me. Do I really need to see this in November?” said the England manager. “He can be a back-up for Harry [Kane] in a very orthodox No 9 role.” Having won the last of his 42 caps in 2018, there is every chance that Welbeck could be on the plane to the World Cup if he can maintain his goalscoring feats. The former Manchester United and Arsenal striker has more goals than any other English player in the Premier League this season with six and will be eager to add to that tally when Brighton host Brentford on Saturday. Ed Aarons\n\nBrighton v Brentford, Saturday 3pm\n\n4 Sessegnon needed as creator and scorer\n\nThe Ryan Sessegnon tale has brought some warmth to Fulham’s bumpy beginning. The 25-year-old, who rejoined his boyhood club in 2024 after five difficult years at Tottenham, has become a regular starter, driving down the left in the absence of the injured Antonee Robinson. The worry? With two goals, he’s also their joint-top scorer in the league alongside Harry Wilson. Raúl Jiménez, their leading man last season, has netted once while Rodrigo Muniz is out until 2026 owing to hamstring surgery. Sessegnon is also having to step up as a creator in place of Robinson, who provided 10 assists last time round. Fulham’s next four games take in three of the top five plus Crystal Palace, who have conceded only nine goals in the league this season. Danger looms for a side that have developed a reputation for mid-table stability. TH\n\nFulham v Sunderland, Saturday 3pm\n\nView image in fullscreen Ryan Sessegnon scores against Wolves. He is Fulham’s joint-top scorer – with two. Photograph: Dan Istitene/Getty Images\n\n5 Time for Isak to deliver for Liverpool\n\nThe controversy surrounding Virgil van Dijk’s disallowed goal against Manchester City did not camouflage Liverpool’s inferiority on the day as they succumbed to a seventh defeat in 10 games. Arne Slot’s side need a sustained recovery to muscle into the title race from this position, along with a dramatic improvement in form, and opportunity presents itself with seven of their next 10 league games against teams currently in the bottom half of the table. The threat is clear from Nottingham Forest, the only team to inflict a home league defeat on the champions last season, but it is not only Liverpool’s performance against long balls and counterattacks that will be under the spotlight. It is time for Alexander Isak to show up inl a Liverpool shirt too. The £125m striker has not featured at club level for a month having sustained a groin injury when making his second start in four days in the Champions League win at Eintracht Frankfurt. Isak returned as a substitute in Sweden’s defeat by Switzerland but sat out Tuesday’s dead rubber against Slovenia to ensure his availability for next year’s World Cup playoffs. A booking on Tuesday would have ruled him out. Isak may be short of match sharpness but Slot needs the 26-year-old to deliver. Andy Hunter\n\nLiverpool v Nottingham Forest, Saturday 3pm\n\n6 Edwards needs swift impact at Wolves\n\nRob Edwards has walked into a world of problems at Wolves, the last remaining winless club in the top seven tiers of English football. If their new head coach is to have any hope of retaining the team’s Premier League status then the former defender will need to improve the back line, the leakiest in the division. Wolves have conceded 15 goals in their past five matches in all competitions and not kept a clean sheet in the league since April. Yerson Mosquera was an unused substitute in defeat at Chelsea last time out but among those who stayed training with his club during the international break. David Møller Wolfe, who together with his clubmate Jørgen Strand Larsen helped Norway qualify for the World Cup, has also been used sparingly, the left-back and Mosquera making only two league starts each this season. Edwards will seek to put his imprint on things against Crystal Palace. Ben Fisher\n\n\n\nWolves v Crystal Palace, Saturday 3pm\n\n7 Newcastle still feel absence of Wissa\n\nEddie Howe invariably speaks admiringly of Pep Guardiola but Manchester City’s manager is one of the last people he could do with meeting on Saturday evening. With Newcastle heading into the weekend in 14th position and a renascent City travelling to Tyneside in second place, this is hardly an ideal preamble to Howe’s Tuesday assignment, away to Marseille in the Champions League. Although Newcastle have impressed in Europe lately, their draining high-intensity game seems unsuited to two high-stakes matches a week. It also does not help that Yoane Wissa has not kicked a ball for Howe’s side since his £55m summer deadline-day move from Brentford. The knee injury Wissa sustained playing for DR Congo in early September is now almost fully healed but he will again be sidelined against City, leaving the £69m Germany forward Nick Woltemade to lead the line. As wonderfully gifted as Woltemade is, he is more of a No 10 than a No 9 and lacks Wissa’s ability to stretch and run in behind defences. Until the two Ws are able to work in tandem Newcastle’s league struggles could continue. Louise Taylor\n\nNewcastle v Manchester City, Saturday 5.30pm\n\nView image in fullscreen Nick Woltemade, pictured holding off Aitor Paredes of Athletic Bilbao, is more a No 10 than the No 9 Newcastle need at the moment. Photograph: Allstar Picture Library Ltd/Ed Sykes/Apl/Sportsphoto\n\n8 Farke at risk of pressure mounting up\n\nDaniel Farke and Unai Emery confront each other for the first time as Aston Villa visit Elland Road for a game that could help shape Farke’s future at Leeds. Although the German maintains “no one is panicking”, his team have lost four of their past five league games and sit 16th, one point above the relegation zone. While 11 points from 11 matches is hardly disastrous for a promoted side, December looks a potentially dangerous month in West Yorkshire with Chelsea and Liverpool visiting Elland Road. Leeds also have to make a tricky trip to Manchester City before November is out. Lose those and Farke knows his position would, perhaps unfairly, come under serious scrutiny. How a toothless Leeds could do with reprising their last win against Villa, a 3-0 triumph at Villa Park in October 2020. It featured a Patrick Bamford hat-trick but with injuries subsequently disrupting Bamford’s career the former Leeds No 9 is now on a short-term deal at Sheffield United and Farke has struggled to find an incisive, elite-level replacement. LT\n\nLeeds v Aston Villa, Sunday 2pm\n\n9 Arsenal and Spurs rue injury troubles\n\nThe first north London derby of the season is an enticing prospect given that Tottenham head to the Emirates with the best away record in the Premier League and Arsenal have won all but one of their home matches so far. Yet while the thigh injury sustained by Gabriel Magalhães on international duty left Mikel Arteta with a big hole to fill in his central defence as he also sweats on the fitness of several key attackers including the £64m striker Viktor Gyökeres, his Spurs counterpart, Thomas Frank, could be without 10 players on Sunday as the ailments mount up. Both clubs are feeling the effects of punishing schedules that are a result of having to play twice a week owing to their Champions League commitments. But with the next international break not until March, the games are going to come thick and fast over the next few weeks. Arsenal are hopeful that their captain, Martin Ødegaard, could play some part against Spurs in a period that will be crucial to their chances of staying clear of the chasing pack. EA\n\nArsenal v Tottenham, Sunday 4.30pm\n\nView image in fullscreen Viktor Gyökeres’s participation in the north London derby is uncertain. Photograph: Tom Jenkins/The Guardian\n\n10 Amad pivotal to United revival continuing\n\nAmad Diallo has been key to Manchester United’s five-match unbeaten run, a thumping equaliser against Nottingham Forest followed by a perfect cross against Tottenham, Bryan Mbeumo’s forehead doing the rest. But where the Ivorian best fits remains unclear. Against Spurs he moved from his right wing-back role into the right No 10 position and stayed lively, though it meant displacing Mbeumo to the left. Benjamin Sesko’s knee injury means Ruben Amorim could persist with the same template against Everton, Matheus Cunha continuing at centre-forward. Whatever the configuration, Amorim will have to squeeze as much as he can from Amad and Mbeumo before they depart for the Africa Cup of Nations next month. TH\n\nManchester United v Everton, Monday 8pm",
  "authors": [
    "Guardian Sport"
  ],
  "url": "https://www.theguardian.com/football/2025/nov/21/premier-league-10-things-to-look-out-for-this-weekend#comments"
}