{
  "title": "Joy Crookes says UK and Ireland in ‘dark time’ amid rise of far-right politics",
  "text": "The UK and Ireland are entering a “dark time”, according to the singer Joy Crookes, who said the influence of far-right ideology on mainstream politics was comparable to the 1970s when the National Front was at its peak.\n\nCrookes, who has just played two sold-out shows at the O2 Academy in Brixton, said the recent wave of nationalism and the far-right march through central London in September made her feel unsafe in the UK.\n\n“I’m not blind to the political kind of landscape that we’re living in right now and I myself am a child of immigrants,” she said. “I travelled to central London to go shopping and ran into a bunch of St George’s flags. It doesn’t make me feel safe.”\n\nThe singer said that when she was shooting her debut acting role in the coming-of-age story Ish, in Luton, the mostly black and brown crew and cast became worried after rumours of a Tommy Robinson rally in the town.\n\n“We were wondering on one of the days whether it was safe to go into work because we heard that there would be mass protests in Luton with Tommy Robinson and his mates,” she said.\n\nWhen asked if the current situation was comparable to the 1970s when the National Front regularly held marches in immigrant areas, she said: “In my opinion it’s completely comparable. It’s terrifying … I am really, really concerned. It feels like we are entering a dark time.”\n\nCrookes’ Brixton performances went viral after a clip of her playing a cover of Sinéad O’Connor’s anti-racism anthem Black Boys on Mopeds surfaced online.\n\nView image in fullscreen Sinéad O’Connor died in 2023. Photograph: Jane Bown/The Observer\n\nO’Connor wrote the song after the deaths of Nicholas Bramble, who was killed while being pursued by the police on a moped they assumed he’d stolen, and Colin Roach, a black teenager who died under suspicious circumstances while inside Stoke Newington police station.\n\nThe inside sleeve of O’Connor’s hit album I Do Not Want What I Haven’t Got, which the song was on, also featured an image of Colin Roach’s parents protesting, alongside the caption: “God’s place is the world but the world is not God’s place.”\n\nWhile the song referenced police violence and racism, it also spoke to what O’Connor saw as the hypocrisy of political leaders, including Margaret Thatcher who was referenced in the song and had been accused of flirting with extreme-right rhetoric during her rise to power.\n\nWhile introducing the song on stage in Brixton, Crookes said: “I don’t want to sing this song, but 35 years ago, Sinead wrote this and it’s still relevant and I feel like it’s probably necessary.”\n\nCrookes, who has Irish and Bangladeshi heritage, said the idea to play O’Connor’s song came after driving around Dublin with her cousins and seeing dozens of Irish tricolour flags, which are part of a nationalist, anti-immigrant movement.\n\n“I realised at that moment that this is an issue that’s happening in the west and it’s becoming more and more rife because of the big F, fascism, and the rise of the right,” she said.\n\nAfter the Dublin concert, where the song received an ovation, her team said she should play the song on every leg of her tour because it was “relevant everywhere in the UK”.\n\nCrookes said she was playing the song to encourage “solidarity” between communities directly affected by far-right rhetoric but also as a reminder to musicians to use their voices.\n\n“Maybe I’m singing that song as a small nod to my community to say we also have to take some responsibility and speak out,” she said. “I think my peers are definitely willing to talk about Palestine but when it comes to the big R word [racism], it’s a bit scary.”",
  "authors": [
    "Lanre Bakare"
  ],
  "url": "https://www.theguardian.com/music/2025/nov/20/joy-crookes-says-uk-and-ireland-in-dark-times-amid-rise-of-far-right-politics"
}