{
  "title": "Sydney Sweeney’s American Eagle Ad Is A Dark Distraction",
  "text": "Over the past week or so, everyone online has been engaged in the discussion about Sydney Sweeney’s “good genes,” including me.\n\nBut if we get caught up in arguing about whether or not a clothing ad that obviously plays on racial hierarchy is related to eugenics, we might wind up distracted from some other kind of important things going on in the country. Namely, policies and practices being enforced right now that actually bolster white supremacy more than a single denim ad ever could. And maybe that’s the point.\n\nThe dog-whistle of eugenics is clearly present in the American Eagle ad — and it hits different as white supremacist movements are on the rise right now. There’s been an onslaught of articles this week from right-leaning organizations such as Fox News that insist there is nothing wrong with the ad, even going so far as to accuse those of us with media literacy and a basic understanding of U.S. and world history of being too sensitive, too “woke,” and that we’re somehow reaching.\n\nAdvertisement\n\nIn their steadfast insistence that we ignore the “great jeans” pun that invokes attitudes of Aryan-inspired supremacy — whiteness, blonde hair and Sweeney’s crystal blue eyes — they give the game up. By attempting to convince us that we’re not seeing what we think we’re seeing, they are attempting to distract us. And it’s not going to work.\n\nIn a college keynote, author Toni Morrison once said, “The very serious function of racism is distraction. It keeps you from doing your work. It keeps you explaining, over and over again, your reason for being.”\n\nThe concept of “better genes” has historically been communicated through Eurocentric beauty standards, marketing and media, and Sydney Sweeney specifically has been held up as an example of white nationalist beauty for years now. This context matters.\n\nAdvertisement\n\nHowever, instead of engaging in a battle through social media comments or in person as to whether or not the messaging oozes deliberate genetic hierarchy vibes, I urge everyone to focus more on what the people excusing eugenics in marketing don’t want to focus on.\n\nAnd what’s going on is heavily tied to eugenics: Masked immigration agents disappearing mostly brown people off the streets. New cuts to health care that are projected to result in the preventable deaths of thousands of low-income people who are disproportionately people of color due to racial capitalism. The bombing and starvation of Palestinians in Gaza.\n\nAt the core of each of these movements is the idea that some people deserve to be American and some people don’t. Some people have great genes and some people don’t. Some people deserve health care and some people don’t. Some people deserve to live and some people don’t.\n\nAdvertisement\n\nThe reason why companies such as American Eagle feel so comfortable salaciously hinting at eugenics in 2025 is because we’ve always had a eugenics problem — and it’s back on the rise.\n\nThe message that “Sydney Sweeney has great genes/jeans” paired with close-up shots of her blonde hair and blue eyes in the context of today’s far right political atmosphere just isn’t setting off alarm bells for some people like it should. The people who don’t think this ad is a problem probably don’t think white nationalism is a problem.\n\nSo yes, let’s acknowledge the barely veiled racial pseudo-science in marketing, but not even for a second lose sight of the bigger picture when we get gaslit.",
  "authors": [
    "Contributing Writer"
  ],
  "url": "https://www.huffpost.com/entry/sydney-sweeney-american-eagle-ad-racism-distraction-eugenics_n_688b9423e4b0f5c3b7c998b7?origin=top-ad-recirc"
}