{
  "title": "Más estadounidenses que nunca, tan latinos como siempre: la diversidad de la inmensa comunidad hispana en EE.UU.",
  "text": "CNN Español —\n\nMuy lejos del concepto de “gigante dormido” que le era atribuido, de un bloque monolítico o una estadística fija, la comunidad latina en Estados Unidos es un río de historias, idiomas y generaciones que crece con fuerza. Hoy, con el 20 % de la población estadounidense, los latinos moldean el rostro cultural y económico del país, dinamizan ciudades emergentes y reclaman su lugar en la historia colectiva. ¿Quiénes son, de dónde vienen, cómo viven —y hacia dónde van— estas millones de voces que transforman el mapa de la nación?\n\nMuchos hispanos se sienten más conectados a Estados Unidos, pero siguen unidos a las tradiciones de su país de origen: la comida, el idioma y las festividades son algunas de las costumbres que conservan, según las respuestas a un cuestionario de CNN que respondieron más de 120 lectores, latinos residentes en EE.UU.\n\n“Amo Estados Unidos porque aquí me formé y se me han abierto las puertas para progresar”. Sara Sánchez, originaria de El Salvador\n\nSara Sánchez dice que sigue disfrutando de la comida salvadoreña como las pupusas y en diciembre celebra la Nochebuena el 24 de diciembre y la Navidad al día siguiente con platillos y música tradicionales de su tierra natal.\n\nLas arepas, por ejemplo, aún son la comida preferida de muchos colombianos y venezolanos a lo largo y ancho de Estados Unidos. Los mexicanos comen pozole, tacos o frijoles en un día ordinario y los nicaragüenses disfrutan del gallo pinto, un plato tradicional que contiene arroz, frijoles, chile y cebolla.\n\nEl Día de la Independencia de México o el Día de Muertos son celebrados por personas que trazan su origen en México, algunos colombianos mantienen celebraciones religiosas como el Día de las Velitas o las fiestas navideñas tradicionales de Colombia con sus respectivos platillos tradicionales. Y la música venezolana, especialmente las gaitas en diciembre, está presente en hogares y reuniones.\n\nDiversidad de origen\n\nLa creciente comunidad latina en Estados Unidos alcanzó un récord de más de 68 millones en 2024, según cifras de la Oficina del Censo, Esto significa que su población es más grande que la de países como España, Canadá y cualquier otro de América Latina, excepto Brasil (más de 211 millones) y México (130 millones).\n\nHistóricamente, la población mexicana ha sido el mayor grupo hispano en Estados Unidos. En 2024, sumaron 38,9 millones (11,5 %), un importante aumento comparado con los 35,9 millones contabilizados en 2020, según los datos del Censo.\n\nEn segundo lugar están los puertorriqueños, con 6,1 millones (1,8 %); les siguen los cubanos con 2,9 millones (0,9 %), salvadoreños con 2,7 millones y dominicanos con 2,5 millones hasta el año pasado.\n\nPuerto Rico es un territorio no incorporado a Estados Unidos. Por esta razón, los puertorriqueños son ciudadanos estadounidenses por nacimiento desde 1917, pero no gozan de los mismos derechos que otros ciudadanos del país: no pueden votar en las elecciones presidenciales y no tienen representación en el Congreso. Son considerados como parte de la comunidad latina debido a que el Gobierno de EE.UU. define a este grupo como la población que habla español o desciende de latinoamericanos o españoles.\n\nLas personas con raíces en Centroamérica y Sudamérica han registrado un incremento importante, con dos poblaciones que, por primera vez desde 2010, superaron la marca del millón de personas: Colombia y Honduras, mientras que la población venezolana reportó el crecimiento más acelerado de los grupos hispanos, con un aumento del 181 % del 2010 a 2020, según el Censo.\n\nLa población mexicana es el mayor grupo hispano en 40 estados, pero se ha asentado principalmente en California, estado que registra más de 12,2 millones de mexicanos hasta 2020, según el Censo, seguido de Texas (9 millones) y Arizona (1,8 millones). Su presencia y alcance en el país ha sido tal que en la década de 1960 nació el movimiento chicano con el objetivo de empoderar a la población estadounidense de ascendencia mexicana y se concentró en el suroeste de Estados Unidos.\n\nLos murales chicanos, por ejemplo, resaltan en barrios de California, Texas y Arizona como una mirada a la lucha obrera, la justicia social, la Independencia de México, la migración, personajes históricos, símbolos prehispánicos y la vida cotidiana. En Sacramento, California, se encuentra uno de los murales chicanos más antiguos del país llamado “El surgimiento de la lucha social chicana en una sociedad bicultural”. Estas obras, creadas por artistas locales, son un símbolo de resistencia y orgullo para la comunidad latina.\n\nEl sur de EE.UU. alberga el mayor número de latinos\n\nGeográficamente, California, Texas y Florida son los estados que concentran mayor población latina, pero este grupo ha tenido una expansión más allá de los enclaves tradicionales, instalándose en áreas del medio oeste y el sur, donde la población latina era históricamente escasa.\n\nEstos tres estados son una clara muestra del establecimiento y expansión de la comunidad latina. Hasta 2024, la población total de California sumaba más de 39,4 millones de personas, de las cuales más de 16 millones eran latinos (40 %) y más de 10 millones eran inmigrantes (27 %), según datos del Instituto de Políticas Públicas de California.\n\nEn Texas, un estado con más de 31,2 millones de habitantes, residen 12,6 millones de hispanos (40 %), ubicándose por encima de la población blanca (39,8 %), según los datos del Censo. Esto significa que la comunidad latina es el mayor grupo demográfico en el segundo estado más grande del país.\n\nMientras que Florida alberga 6,7 millones de hispanos (28,7 %) entre sus más de 23,3 millones de residentes. La comunidad latina también es el segundo grupo étnico más grande del llamado estado del Sol.\n\nCostumbres que perduran\n\nMe siento más unida a Estados Unidos, pero también soy muy cercana a mis raíces mexicanas. Me gusta vivir en una comunidad latina, que mi mamá me enseñara español, ir a México a visitar a mi familia y comer comida mexicana”. Carla Rodríguez, llegó a EE.UU. hace 30 años.\n\nRodríguez vive en una comunidad latina en San Francisco, California, un estado donde los hispanos de origen mexicano representan más del 12 % de la población, que –dice– le recuerda mucho a México. “Aquí hay mucho vendedor ambulante en las calles y venden comida de todo tipo, especialmente los fines de semana, encuentras de todo: hay pupusas, tamales, tacos, cualquier cosa. No es algo que se vea en otros lugares de Estados Unidos, pero me recuerda mucho a México”, detalla.\n\nLa gastronomía es uno de los ámbitos en los que los latinos de origen mexicano han marcado una fuerte presencia. Según datos de Pew Research Center, uno de cada diez restaurantes de Estados Unidos sirve comida mexicana y el 85 % de los condados de todo el país tiene al menos un restaurante mexicano.\n\nClemente López respondió sentirse más unido a Estados Unidos, pero prefiere la comida de Honduras, su país de origen, así como la música y el fútbol.\n\nPaola Acosta, originaria de Colombia y residente de Florida, llegó a EE.UU. 15 años atrás en busca del llamado sueño americano. Para ella, la unión con su país de origen es mayor y se refleja en su alimentación tradicional: las arepas, el sancocho y el arroz están en su mesa día con día.\n\nUn vendedor ambulante vende tamales en Nueva York en noviembre de 2019. Bryan R. Smith/AFP/Getty Images\n\nY para Marabeth Márquez, las tradiciones religiosas de Venezuela siguen presentes en su vida en Estados Unidos con celebraciones como la Nochebuena el 24 de diciembre, seguir la cuaresma y ayunar en Semana Santa, además de no haber adoptado festividades como Halloween.\n\nUno de cada cinco habitantes en Estados Unidos es latino (20 %) lo que convierte a este grupo en la minoría racial más numerosa del país. Aunque la inmigración ha sido un factor histórico determinante en este incremento, ahora los nacimientos de personas de origen latino han tomado el primer lugar: solo entre 2022 y 2023, se registraron 722.000 nacimientos, comparados con los 437.000 migrantes que llegaron al país, según las cifras oficiales.\n\nLa comunidad latina continúa creciendo y, ahora mismo, el aumento de nuestra comunidad se debe a los latinos que están naciendo en Estados Unidos. La edad media es 30 años, frente a los 39 años de la población general”. Frankie Miranda, presidente de Hispanic Federation, una organización sin fines de lucro que lucha por la defensa de la comunidad latina en EE.UU.\n\nGina López es un claro ejemplo: nació en Nueva York, pero se siente más identificada con las tradiciones de Colombia, el país de origen de sus padres. Ahora vive en Florida.\n\nLa gente participa en un desfile por el Día de la Independencia de México, con el tema «Orgullo y poder: nuestra fuerza, nuestro legado», en Chicago el 14 de septiembre de 2025, en medio de una nueva operación de control migratorio puesta en marcha por la administración Trump el 8 de septiembre. KAMIL KRZACZYNSKI/AFP/AFP via Getty Images\n\nFútbol que conecta raíces\n\nSin importar su bandera de procedencia, los latinos en Estados Unidos prefieren el fútbol por encima de otros deportes por ser una extensión de su identidad nacional que los une a sus raíces. Este deporte, predilecto en América Latina, se ha expandido y ha ganado popularidad en el país.\n\nMientras en 1997, el soccer empataba en último lugar en la lista de deportes favoritos junto con el patinaje artístico, para 2023, había escalado al cuarto lugar, solo por detrás del fútbol americano, el béisbol y el baloncesto, según una encuesta de Gallup. Los televidentes hispanos en la nación norteamericana representaron la gran mayoría de la audiencia del fútbol en 2017 con un 68 % de los espectadores ese año, de acuerdo con otro estudio de Nielsen.\n\nHablar de este deporte entre la población hispana tiene otro matiz importante: los latinos que prefieren el fútbol lo hacen por equipos fuera de Estados Unidos. Según un informe de 2024 de la empresa de marketing y medios For Soccer, el 32 % de los hispanos considera a la selección masculina de fútbol de EE.UU. como su favorita, mientras que el 21 % prefiere la selección femenina del país. Sin embargo, entre los mexicoamericanos —el grupo hispano más grande en Estados Unidos— solo el 40 % tiene a alguno de estos equipos estadounidenses como su favorito, lo que significa que la mayoría de ellos prefiere a otros equipos, posiblemente de México u otros países.\n\nEl fútbol se ha convertido en un punto de encuentro cultural y un lenguaje en común de muchos colombianos, mexicanos, ecuatorianos, salvadoreños y venezolanos, principalmente en estados como Florida, California y Texas, según los latinos que respondieron al cuestionario de CNN. Una muestra de esto es que los estados que albergan más equipos de la MLS –la liga de fútbol profesional estadounidense– son California, Texas y Florida, que son también los de mayor población latina.\n\nPaola Acosta, residente de Florida, señaló que además de que el fútbol es su deporte favorito, es aficionada de la selección Colombia, su país de origen. Y John Jauregui, quien nació en California y traza su origen como mexicano, prefiere el fútbol por encima de otros deportes.\n\nAhora bien, el fútbol americano y el béisbol también se han instalado en la vida de muchos latinos en Estados Unidos. Según la NFL, hasta principios de 2025 había 39 millones de aficionados latinos en EE.UU. y, según datos de Nielsen, el porcentaje de espectadores hispanos del Super Bowl aumentó del 10 % en 2016 al 14 % en 2024. Mientras que el porcentaje de la Serie Mundial pasó del 10 % en 2016 al 15 % en 2023.\n\nVideo Ad Feedback Los jugadores latinos que dejaron su huella en la historia de la MLS 01:11 • Fuente: CNN Los jugadores latinos que dejaron su huella en la historia de la MLS 01:11\n\nIdioma español, importante en la identidad\n\nLos latinos aún conservan el español para comunicarse en sus casas y con sus familiares y amigos cercanos, además de considerarlo parte importante de su identidad y tradiciones. De hecho, Estados Unidos es ya el segundo país con más hablantes de español en el mundo, según el informe “El español: una lengua viva 2024”, con poco más de 57,4 millones de hispanohablantes, solo por detrás de México.\n\nPero a medida que la población hispana se conforma cada vez más de individuos nacidos en EE.UU., la proporción de latinos que hablan inglés con fluidez está creciendo. En 2022, el 72 % de los latinos de 5 años o más hablaba el idioma de manera fluida, frente al 59 % en 2000, según Pew Research Center.\n\nAdemás, la proporción de latinos que hablan español en casa disminuyó del 78 % en 2000 al 68 % en 2022, una cifra impulsada principalmente entre los nacidos en Estados Unidos.\n\nVideo Ad Feedback Resaltan la contribución de los latinos a la economía de EE.UU. 08:06 • Fuente: CNN Resaltan la contribución de los latinos a la economía de EE.UU. 08:06\n\nLatinos, un motor de la economía\n\nLos hispanos son una pieza clave y motor en el desarrollo económico de Estados Unidos y cobrarán aún mayor relevancia a medida que el resto de la población envejezca en las próximas décadas, según un análisis de Latino Donor Collaborative y la Universidad Estatal de Arizona.\n\nEl Producto Interno Bruto (PIB) latino en Estados Unidos pasó de los US$ 2,1 billones en 2015 a US$ 4 billones en 2023, según el reporte, lo que equivale a ser la quinta economía más grande del mundo, solo por detrás de EE.UU., China, Alemania y Japón y por encima de Reino Unido, Francia e Italia.\n\n“La magia y el poder secreto, el superpoder de la comunidad latina es la habilidad de ser tan diversos, de provenir de diferentes países de Latinoamérica y de España, pero a la misma vez tener ciertas características que también nos unen como el gran sentido empresarial y la manera en que nuestra comunidad continúa contribuyendo a todos los aspectos de la vida y de la sociedad estadounidense”, dijo Frankie Miranda, de Hispanic Federation.\n\n“Me siento muy unida a EE.UU., gracias a este país he podido ayudar a mi familia y hacerme ciudadana. Pero quisiera que Estados Unidos evaluara más a fondo el gran aporte que somos (los latinos) y den oportunidad a quienes están aquí haciendo todo legal y bien”. Ninoska Sandoval, originaria de Venezuela.\n\nLos latinos en Estados Unidos son mucho más que una estadística: se trata de una fuerza que transforma al país, impulsa su economía y renueva su cultura. Cada vez son más estadounidenses, pero su identidad se refuerza en tradiciones y orgullo, y son claves para el futuro de la nación: un futuro que también se conjuga en español.",
  "authors": [
    "Karen Esquivel",
    "Jhasua Razo",
    "Reportaje Especial De"
  ],
  "url": "https://cnnespanol.cnn.com/2025/11/18/eeuu/latinos-diversidad-identidad-comunidad-hispana-orix"
}