{
  "title": "8BitDo’s wireless remake of the Nintendo 64 controller is now available",
  "text": "is a senior reporter who’s been covering and reviewing the latest gadgets and tech since 2006, but has loved all things electronic since he was a kid.\n\nAnalogue’s 4K remake of the Nintendo 64 has been delayed again and again due to the US tariff situation. But at least you can get 8BitDo’s updated take on the N64 controller, which was announced alongside the Analogue 3D, while you wait. You can get one through Amazon in white or black for $39.99 and while it’s one of 8BitDo’s more budget-friendly controllers, its functionality is limited.\n\nThe Nintendo 64, which launched in 1996, had an unusual three-prong controller design, with a single analog joystick in the center of the gamepad above the middle grip. The 8BitDo 64 offers the same buttons as the N64’s controller in a more traditional layout, but while it’s easier to hold, the lack of a second joystick limits its compatibility with modern games, which generally expect two. The 8BitDo 64 is compatible with the Switch, Switch 2 (after updating the controller’s firmware), Windows, and Android devices and connects to consoles, PCs, and mobile devices using either a Bluetooth connection or a USB cable.\n\nThe 8BitDo 64 is available in black or white and works with the Switch, Switch 2, Windows, and Android devices. Image: 8BitDo\n\nIt also features more durable Hall effect joysticks and shoulder buttons which should help prevent it from developing stick drift over time. But if you’re not planning to use it with the Analogue 3D (someday), the controller will potentially only be useful for playing classic N64 games through an emulator or the Nintendo Switch Online service but your GoldenEye 007 muscle memory may not perfectly transfer over to the updated button layout. Nintendo’s own wireless N64 controller is a more accurate reproduction, but you still need to be a Nintendo Switch Online subscriber to buy one.",
  "authors": [
    "Andrew Liszewski"
  ],
  "url": "https://www.theverge.com/news/716292/8bitdo-64-wireless-controller-nintendo-analogue-3d"
}