{
  "title": "U.S. Employers Added Surprisingly Solid 119,000 Jobs In September, Government Says In Delayed Report",
  "text": "LOADING ERROR LOADING\n\nWASHINGTON (AP) — U.S. employers added a surprisingly solid 119,000 jobs in September, the government said, issuing a key economic report that had been delayed for seven weeks by the federal government shutdown.\n\nThe unemployment rate rose to 4.4% from 4.3% in August, the Labor Department said Thursday.\n\nThe increase in payrolls was more than double the 50,000 economists had forecast. But Labor Department revisions showed that the economy lost 4,000 jobs in August instead of gaining 22,000 as originally reported.\n\nAdvertisement\n\nDuring the 43-day U.S. government shutdown, investors, businesses, policymakers and the Federal Reserve were groping in the dark for clues about the health of the American job market because federal workers had been furloughed and couldn’t collect the data.\n\nThe report comes at a time of considerable uncertainty about the economy. The job market has been strained by the lingering effects of high interest rates and uncertainty around Trump’s erratic campaign to slap taxes on imports from almost every country on earth. But economic growth at midyear was resilient.\n\nThe Federal Reserve policymakers are divided over whether to cut interest rates for the third time this year when they meet next month.\n\nAdvertisement\n\nEconomists expected to see a continuation of what was happening in the spring and summer: weak hiring but few layoffs, an awkward pairing that means Americans who have work mostly enjoy job security – but those who don’t often struggle to find employment.\n\nFILE - In this May 7, 2020, file photo, the entrance to the Labor Department is seen near the Capitol in Washington. (AP Photo/J. Scott Applewhite, File) via Associated Press\n\nThe job market has been strained this year by the lingering effects of high interest rates engineered to fight a 2021-2022 spike in inflation and uncertainty around Trump’s campaign to slap taxes on imports from almost every country on earth and on specific products — from copper to foreign films.\n\nAdvertisement\n\nLabor Department revisions in September showed that the economy created 911,000 fewer jobs than originally reported in the year that ended in March. That meant that employers added an average of just 71,000 new jobs a month over that period, not the 147,000 first reported.\n\nSince March, job creation has slowed even more — to an average 53,000 a month. During the 2021-2023 hiring boom that followed COVID-19 lockdowns, by contrast, the economy was creating 400,000 jobs a month.\n\nPresident Donald Trump’s crackdown on illegal immigration is expected to reduce the number of people looking for work, which means that the economy can create fewer jobs without sending the unemployment rate higher.\n\nAdvertisement\n\nWith September numbers out, businesses, investors, policymakers and the Fed will have to wait awhile to get another good look at the numbers behind the American labor market.\n\nThe Labor Department said Wednesday that it won’t won’t release a full jobs report for October because it couldn’t calculate the unemployment rate during the government shutdown.\n\nInstead, it will release some of the October jobs data — including the number of jobs that employers created last month — along with the full November jobs report on Dec. 16, a couple of weeks late.\n\nAdvertisement\n\nThat puts an even more intense focus on September jobs numbers released Thursday. They are the last full measurement of hiring and unemployment that Fed policymakers will see before they meet Dec. 9-10 to decide whether to cut their benchmark interest rate for the third time this year.\n\n____",
  "authors": [
    "Paul Wiseman"
  ],
  "url": "https://www.huffpost.com/entry/ap-us-economy-jobs-report-september_n_691f1c54e4b0b763ab8e3070?origin=home-zone-d-unit"
}