{
  "title": "Is All's Fair really the 'worst TV drama ever'?",
  "text": "Created by super-producer Ryan Murphy and with an all-star cast led by Kim Kardashian, legal series All's Fair has had savage reviews. But viewers have been celebrating its mix of high-camp, statement fashion and spotless interiors.\n\nSince it debuted on Hulu on Tuesday, the glossy new legal drama All's Fair has been roundly savaged by critics. In the UK, The Times opined that it \"may be the worst TV drama ever\", while The Guardian branded it \"fascinatingly, existentially terrible\"; both newspapers awarded it zero stars out of five. All's Fair currently holds a rare 0% fresh rating on Rotten Tomatoes, which indicates universally negative reviews. It's certainly the most slated show of the year so far. So surely this nine-part series from Ryan Murphy, the Emmy-winning mastermind behind Glee and American Horror Story, is now dead on arrival?\n\nPerhaps not, because All's Fair is showing early signs of being a hit, at least on social media. On X, fans have called it \"gloriously silly\", \"my type of nonsense camp show\" and, perhaps most insightfully of all, a show that's \"very fun\" to watch because it \"isn't afraid to be bad\". The exceptionally terrible reviews combined with the show's high-profile cast – Kim Kardashian, in her first lead role, is at the centre of an ensemble that includes Glenn Close, Naomi Watts, Niecy Nash-Betts, Sarah Paulson and Teyana Taylor – have made it an instant object of fascination. It helps that the three episodes that premiered on Tuesday contain plenty of jaw-droppingly awful standalone scenes that are just begging to be shared on social media. One clip that has already gone viral shows Close's character Dina Standish asking Paulson's Carrington Lane about her mother's decision to eschew birth control in shockingly vulgar terms.From an actor of Close's stature – eight Oscar nominations, three Emmys, three Tonys – it's high camp.\n\nHigh camp is probably what creators Ryan Murphy, Jon Robin Baitz and Joe Baken were going for, at least in part. It's presumably no accident that Paulson's character shares part of her name with Alexis Carrington Colby, Joan Collins' arch villainess from the ludicrously entertaining 1980s primetime soap Dynasty. All's Fair has some of that show's alpha female energy, but adds a procedural element to the mix. It centres on Grant, Ronson and Green, a mercifully fictional Los Angeles law firm founded by Kardashian's Allura Grant, Watts' Liberty Ronson and Nash-Betts' Emerald Greene (yes, that is her actual character name). The firm specialises in securing hefty divorce settlements for wronged wealthy women, but the founders are also locked in a perpetual battle with Paulson's rival lawyer, Carrington Lane.\n\nIn the first episode's prologue, set 10 years in the past, we see Lane spitting feathers when she isn't asked to join their all-female firm. This sets the scene, sort of, for the frenzied revenge she's after today. So far, Lane hasn't been pushed into a lily pond, a fate that befell her namesake on Dynasty, but she has she has lobbed a particularly imaginative expletive at Kardashian's character.\n\nPaulson is one of the show's 17 executive producers – as are Close, Kardashian, Nash-Betts and Watts. At times, it feels as though they're all directing themselves, too, because these central performances are rarely complementary. Close seems to be enjoying herself and Nash-Betts manages to sell some painfully leaden dialogue, but Watts never looks comfortable, and Paulson is ferociously over-the-top. In fairness, when you're asked to deliver a line featuring three F-bombs in five words, you may as well commit fully to it.",
  "authors": [],
  "url": "https://www.bbc.com/culture/article/20251105-alls-fair-why-the-worst-tv-drama-ever-could-be-a-hit"
}