{
  "title": "Pese a la presión de EE.UU. sobre Milei, China sobrepasa a Brasil como socio comercial de Argentina",
  "text": "CNN Español —\n\nCorrían las horas más febriles del gobierno del presidente de Argentina, Javier Milei. Estados Unidos acababa de anunciar un plan de rescate financiero, en medio de una presión sobre el valor del dólar que no encontraba sosiego. Se acercaban las elecciones de mitad de mandato del 26 de octubre, tras la derrota que había sufrido el oficialismo el 7 de septiembre en los comicios en la provincia de Buenos Aires. Un nuevo fracaso electoral ponía al gobierno en un escenario de consecuencias desconocidas.\n\nFue en ese contexto en que el secretario del Tesoro de EE.UU., Scott Bessent, confirmó a la cadena Fox News que la asistencia concedida implicaba al menos una retribución. “Sacamos mucho provecho del acuerdo. Argentina es un faro en América Latina, y el presidente Milei está haciendo lo correcto, tratando de terminar un mal ciclo de 100 años en su país. Es un gran aliado de Estados Unidos y está comprometido con sacar a China de Argentina y de toda América Latina”, dijo.\n\nMilei nunca se pronunció sobre ese supuesto compromiso, aunque algunos miembros de su Gobierno le bajaron el tono a esa posibilidad y pusieron en duda que sea efectivamente parte necesaria del acuerdo.\n\nMientras tanto, la embajada de China en Argentina emitió un comunicado en el que acusó a Bessent de moverse con un ánimo de confrontación e intervencionismo en asuntos soberanos más propio de la Guerra Fría. Y sentenció: “Scott Bessen y Estados Unidos deben entender que América Latina y el Caribe no es el patio trasero de nadie. Los países de la región tienen el derecho de elegir quiénes son sus socios en materia de cooperación”.\n\nEn el caso de Argentina, esa asociación tambaleó al comienzo del gobierno de Milei. Durante su campaña para llegar a la presidencia, se mostró contrario a cualquier tipo de relación con China. “No sólo no voy a hacer negocios con China, no voy a hacer negocios con ningún comunista. Yo soy un defensor de la libertad, de la paz y de la democracia. Los comunistas no entran ahí. Los chinos no entran ahí”, señaló durante una entrevista con el periodista Tucker Carlson.\n\nMás allá de la voluntad de Milei, la realidad se impuso diferente. Las relaciones comerciales con China nunca perdieron vigor en lo que va de su gobierno, a excepción de alguna baja circunstancial durante unos pocos meses de 2024. Es más: en septiembre, China se convirtió en el primer socio comercial de Argentina, superando a Brasil, líder histórico, de acuerdo con datos oficiales. Fue la primera vez desde 2020 y representa un contraste con los intereses de Estados Unidos de alejar a China de la región.\n\nUn buque de carga parte del puerto de Qingdao, en China, el 13 de octubre. -/AFP/AFP via Getty Images\n\nEs cierto que en septiembre, las exportaciones hacia el gigante asiático se vieron estimuladas por una política económica del Gobierno de Argentina. Acuciado por la necesidad de conseguir dólares, se creó un régimen especial temporario de eliminación de retenciones (un impuesto porcentual para transacciones de comercio exterior) que generó un incremento del 201,7 % interanual de las exportaciones a China. Esta iniciativa provocó incluso una polémica puertas adentro de Estados Unidos, porque una parte de la demanda se orientó a la soja argentina, desplazando a los productores norteamericanos que no tardaron en hacer oír sus críticas. La Asociación Estadounidense de la Soja le reclamó al presidente Trump algún entendimiento con China para encauzar la situación.\n\nEl Gobierno de Argentina liquidó en 48 horas la posibilidad de exportar sin retenciones en septiembre y eso suponía un límite al avance chino. Sin embargo, en octubre la tendencia se ha consolidado. China volvió a ser el principal socio comercial del país, con exportaciones por U$S 1166 millones (+241,4 % interanual) e importaciones por un total de U$S 1862 millones (+33,7 % interanual). Estados Unidos quedó relegado al cuarto puesto en el mismo período, superado además por Brasil y la Unión Europea.\n\nExiste además una gran asimetría entre lo que Argentina logra vender a China y lo que le compra. Mientras que los chinos demandan mayormente productos primarios, su inserción en la economía argentina se da a través de la venta de bienes de capital y bienes intermedios, es decir, productos con un mayor valor agregado. Es el mismo esquema comercial que mantiene Estados Unidos, comprar insumos y vender productos terminados, lo que fortalece una relación dispar.\n\nVideo Ad Feedback \"Argentina ha dado un paso muy importante en términos económicos\", dice expresidente del Banco Central 01:09 • Fuente: CNN \"Argentina ha dado un paso muy importante en términos económicos\", dice expresidente del Banco Central 01:09\n\n¿Puede Milei eliminar a China en este contexto?\n\nPara la directora ejecutiva de la Cámara Argentino-China, Alejandra Conconi, esa posibilidad “no es tan seriamente tenida en cuenta. Nuestro país es federal en términos de inversiones y los gobernadores de todas las provincias se han manifestado en contra de los dichos de Estados Unidos”. Y sobre las decisiones de inversión de China en Argentina, aseguró que múltiples factores inciden al momento de tomarlas. “Nadie viene a invertir en litio pensando en irse tan rápido”, dijo. Aunque no le restó mérito a que los posicionamientos de los gobiernos pueden provocar el congelamiento de algunas inversiones o la detención de ciertas propuestas.\n\nUn campo productivo en Argentina. Clipped From Video\n\nLas relaciones entre ambos países no se reducen al comercio. Los principales intereses de China en Argentina se encuentran en sectores como minería, energía, alimentos, infraestructura, tecnología y telecomunicaciones, además del desarrollo de una estación espacial ya operativa en el sur del país.\n\nEl economista, Gustavo Girado, observa que a China le interesa hacerse de socios de largo plazo, que sean proveedores de materias primas e insumos energéticos y que sean confiables. Mientras que el ex embajador de Argentina en China, Diego Guelar, aprecia que la tendencia de un fuerte crecimiento del comercio con ese país se expande por toda la región, lo cual representa un problema más amplio para Estados Unidos.\n\nUn obstáculo más para eliminar a China es la característica de las economías de los países. Así lo aprecia el especialista en comercio exterior, Miguel Ponce: “casi la mitad de nuestras exportaciones compiten con la producción de los Estados Unidos”. Y esto también genera dudas sobre el reciente anuncio de un acuerdo de comercio e inversiones entre ambas naciones. ¿Cómo podrían beneficiarse mutuamente dos economías que compiten en diferentes mercados?, ¿cómo sacar de la cancha a China para darle ventajas a un competidor? Preguntas que necesitan respuestas.\n\nPor todo esto, Ponce sostiene que Argentina no debería privilegiar cuestiones ideológicas a intereses concretos. “Es muy difícil que podamos desplazar a China de nuestros socios comerciales. Existe una necesidad de desideologizar nuestros vínculos diplomáticos, para no seguir perjudicando nuestros vínculos comerciales y económicos”, asegura.\n\nEn ese juego de ideologías, la cercanía de Milei con Trump está conduciendo a entendimientos entre sus países, aunque las estadísticas sigan marcando un horizonte distinto, que ninguno de los dos ha podido evitar hasta el momento.",
  "authors": [
    "Por Emiliano Giménez"
  ],
  "url": "https://cnnespanol.cnn.com/2025/11/20/argentina/china-socio-comercial-argentina-eeuu-orix"
}