{
  "title": "Welcome to the new and improved Verge Deals newsletter",
  "text": "Posts from this author will be added to your daily email digest and your homepage feed.\n\nHey, folks! Every week for the past four years, the team behind Verge Deals has combed the web, looking for the best deals and discounts on the tech we love most at The Verge. We pride ourselves in having tried and tested every product we recommend — well, almost every product — and we continue to share those deals with our readers via our daily deal coverage and Verge Deals newsletter. That being said, everyone could use a little change every now and again.\n\nNo, Verge Deals is not going away — quite the contrary, actually. We’ve given our newsletter a fresh coat of virtual paint to reflect our new(ish) colors and design language, and we plan to continue to deliver a fresh batch of deals to your inbox every Friday afternoon. This time, though, we’re incorporating guest dispatches from the larger Verge staff, more personal gift recommendations, and more subscriber exclusives.\n\nWe’ll still highlight steep price drops on Verge-approved favorites like the latest 13-inch MacBook Pro and Sony’s WH-1000MX5 headphones, as well as other recs culled from our expert reviews and buying guides. We’ll even tell you how you can land limited-edition tech that’s likely to sell out — including Sony’s forthcoming PlayStation 5 Pro.\n\nIf you don’t already subscribe to Verge Deals, you can sign up for free using the box below. We’re going to keep the weekly cadence (for now), but you can expect bimonthly special sends in the run-up to Amazon’s next Prime Day event, Black Friday, and the holiday shopping season.\n\nKeep an eye on your inbox this afternoon for the first issue of the new and improved Verge Deals, and if you’re curious about The Verge’s full slate of both free and premium newsletters, head over to our newsletter hub to sign up for Command Line, Installer, and Notepad. We’re excited about the changes in the coming months. We hope you are, too.\n\nVerge Deals Sign up for Verge Deals to get deals on products we’ve tested sent to your inbox weekly. Email (required) Sign Up By submitting your email, you agree to our Terms and Privacy Notice . This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.",
  "authors": [
    "Brandon Widder"
  ],
  "url": "https://www.theverge.com/2024/9/20/24249294/verge-deals-newsletter-subscribe-tech-discounts"
}