{
  "title": "Alfonso Cuarón Examines The Language of Cinema & Television",
  "text": "Transcript\n\nOnce that I finish a film, I never see it again.\n\nTelevision is about killing time.\n\nIt's like you're doing a film, but it's just very long.\n\nIf I hold the shot, people watching the show\n\nare going to check their messages.\n\n[Samanth laughing]\n\nWired sat down with the Oscar winning director,\n\nAlfonso Cuaron, to talk about the language of cinema and TV\n\nand how they intersect.\n\nThis is The Big Interview.\n\n[camera clicking]\n\n[upbeat music]\n\nEvery time I've seen a movie of yours,\n\nI've associated with this feeling\n\nof claustrophobia, I guess,\n\nand whether it's a physical kind of claustrophobia,\n\nlike you moving the camera into Sandra Bullock's helmet\n\nin Gravity, or if it's emotional kind of claustrophobia,\n\nthe world closing in around you, like in Disclaimer.\n\nAnd I was wondering if that's a feeling you try to chase\n\nin your projects.\n\nFirst of all, I apologize for making you feel like that.\n\nIt is kind of a dramatic device that's very effective.\n\nOh, I'm glad.\n\nI'm glad, I guess, but, you know,\n\nit's the first time I even think\n\nI've been confronted with this, so.\n\nRight, right.\n\nMaybe it's a byproduct of what I do, or I did,\n\nbut it was not like a conscious decision.\n\nMm hmm.\n\nOnce that I finish a film, I never see it again,\n\nso it's up to the audiences to make a meaning of it.\n\nIs there something uniting all these projects that you.\n\nThat I don't know,\n\nbut more than anything that's a limitation, I guess.\n\nOh!\n\n[Alfonso] Yeah, I would think so.\n\nWhy would you say that?\n\nMaybe a problem I have\n\nis that I have very eclectic taste in cinema.\n\n[Samanth] Mm hmm.\n\nI grew up loving Poseidon Adventure\n\nor Planet of the Apes or Soylent Green.\n\n[Samanth] All great movies.\n\nI know, they're great, but, same time, I love Bergman,\n\nand I love Tarkovsky, and I love Sokurov.\n\nMost of these filmmakers, what they have in common is\n\nthis kind of one same kind of idea\n\nthat they keep on developing.\n\nAnd keep on developing film after film.\n\nYou can see everything that unifies Bergman or Fellini,\n\nor even Kurosawa with how diverse his oeuvre is.\n\nAnd I haven't been able to do that.\n\nI feel, you know, once that I finish a film,\n\nI just want to explore different realms.\n\nThat's really interesting that you say\n\nyou haven't been able to, because have you tried?\n\nI mean, is it something-\n\nNo, I've not even tried? [laughing]\n\n[Samanth] Is it something you even seek?\n\nNo, I haven't even tried.\n\n[Samanth] Yeah, exactly.\n\nNo, it's, er...\n\nSome films you do because you make conscious choices.\n\n[Samanth] Yeah, yeah.\n\nSome films you...\n\nYou do to survive.\n\nRight.\n\nOthers, they, like, come out and save your life.\n\nI have to wait for films to come to me.\n\nAnd anytime that I've been trying to seriously plan\n\nto do a specific film I end up not doing that film\n\nand end up doing something else.\n\nAnd it's interesting that you mentioned Soylent Green\n\nand Planet of the Apes on the one hand\n\nand Tarkovsky and Bergman on the other, because I think,\n\nthis is one of my other theories about you,\n\nis that there's something you do\n\nwhere you kind of marry the cinematic aesthetic\n\nof Bergman and Tarkovsky,\n\nbut you do it with adaptations of material\n\nthat might be called mass market almost.\n\nSo like, Disclaimer is an interesting case.\n\nIt's like a summer beach read, you know,\n\nit's like a thriller.\n\nChildren of Men is a PD James book.\n\nHarry Potter is Harry Potter.\n\nThe case of PD James.\n\nIt was just a one page outline of what the book was about.\n\nAnd I thought, wow, this is brilliant,\n\nbut I already have a film that I wanted to do in my head.\n\nSo, in that case, I made the conscious decision\n\nof not reading the book.\n\n[Samanth] Yeah.\n\nBecause I didn't want it to sidetrack\n\nfrom what I was thinking.\n\nAnd then I've been tempted later on to read the book,\n\n'cause people around me they tell me it's great.\n\nThey say it's quite different, but it's really great.\n\nWhen I did Children of Men, I wanted to understand\n\nthe things that were going to form our 21st century.\n\nI mean, everything in Children of Men\n\nseems to be a little relevant these days.\n\nThose things were happening then.\n\n[Samanth] Yeah.\n\nThe thing is that we were living\n\nin this kind of bubble before.\n\n[Samanth] Right.\n\nWow, what happened in Children of Men now is happening.\n\nNo, it was happening before.\n\nDifference now is that it's coming closer to our backyard.\n\n[camera clicking]\n\nSo you mentioned these interesting ways\n\nin which these projects come into your life.\n\nSo tell me about Disclaimer.\n\nHow did Disclaimer enter your life?\n\nLong time ago, I mean,\n\nI think it's when Renee Knight published it.\n\nShe sent me.\n\nI didn't know her, she sent me the manuscript.\n\nI saw a possibility,\n\nbut I didn't know how to make it happen as a film.\n\nSo time passed and she got in touch saying,\n\nhey, you know, in case you're interested,\n\nthe rights are available.\n\nThere was a moment that I've been very intrigued about\n\nexploring the long format.\n\nAnd Episodic TV gives you that opportunity.\n\nI enjoy series.\n\nMany, many, many series.\n\nAnd all the series that I enjoy have amazing writing,\n\nand amazing acting.\n\nBut only a few have kind of a cinematic approach.\n\nBut what do you mean here by a cinematic approach?\n\nI'm curious to explore that.\n\nWell, in the worst case,\n\nseries are shows that you can watch with your eyes closed.\n\nOkay.\n\nAnd, by the way, you have a great time.\n\nYou can actually be doing things\n\nwhile you're watching your show.\n\nAnd that's the value and the amazing strength\n\nthat series have taken in terms of the narrative, you know?\n\nAnd I have to say narratively,\n\nthey start doing way more interesting things\n\nthan most mainstream American films.\n\nAnd I was very intrigued.\n\nI wanted to because I have never done anything\n\novertly narrative.\n\nYeah, 'cause I've noticed that even in Gravity\n\nor Children of Men there's no tendency to give\n\nwhat they call exposition, you know?\n\nTo explain, for example, why the human race is infertile,\n\nor what happens in zero gravity.\n\nI mean, you just let, I guess, the emotion lead first.\n\nIs that what you mean by sort of overtly narrative?\n\n[Alfonso] Yes. Okay.\n\nThe principle of film is time.\n\nHow those images flow in time and what they convey\n\nand all the emotions that they convey in time.\n\nIn order to do that, you have to surrender to that.\n\nAnd certain films, when you spend time,\n\nit's all about the experience itself of time\n\nand the silence of it, you know,\n\nand the space between time.\n\nIn Hitchcock is the perfect example, is the suspense.\n\nYou know, you are so aware of time,\n\nbecause of the ticking clock that is going on.\n\nMm hmm.\n\nHitchcock says, I don't care about the content.\n\nYou know, I really don't care.\n\nI care about the form and the style.\n\nThat's Hitchcock's point of view, you know,\n\nbut I'm just saying that to exemplify\n\nhow the language in cinema has a greater value\n\nand a greater weight\n\nin the end experience of a film.\n\nYeah, yeah. You know?\n\nTelevision, on the other hand, is about killing time.\n\nAnd I'm not saying all of them,\n\nbut many series they need to keep on moving\n\njust the narrative forward, you know, constantly.\n\nBut even doing this show, I learned,\n\nthere were moments in which I realized, wow,\n\nif this was a film I probably couldn't get away with this.\n\n[Samanth] Mm hmm, mm hmm.\n\nBut I just know that if I hold the shot here,\n\npeople watching this show are going to check their messages.\n\n[Samanth laughing]\n\nYou know what I mean?\n\nRight, right.\n\nIn many ways, conventional narrative,\n\nit's all about...\n\nIt's like the enemy of time.\n\nKeep the flow, don't even be aware of time.\n\n[Samanth] Right.\n\nIf it's a good story, good narrative sentence,\n\none hour pass and you didn't realize that.\n\n[Samanth] Yeah.\n\nYou know, that it was over.\n\nYeah.\n\nI never done anything that this narrative.\n\nYou know, like a strong narrative impulse.\n\nAnd I was very intrigued about doing it.\n\nI find it a big challenge.\n\n[camera clicking]\n\nThere was this moment in Y Tu Mama Tambien\n\nwhen the camera moves out of the car,\n\nwhere the three people are there,\n\nand there's some kind of police and crime activity,\n\nand you kind of pan to that and you come back into the car,\n\njust to show, though,\n\nthat there's a much richer world out there.\n\nThe important thing in most of the films that I do,\n\nI'm very concerned about the relationship\n\nbetween the character and the environment.\n\n[Samanth] Right.\n\nYou know, it's always the clash between the two.\n\nIn Y Tu Mama Tambien it was a byproduct of that as well.\n\nYou know, it's like, well, these guys\n\nare in their little stupid drama.\n\nThe bubble, yeah.\n\nAnd they're cruising through a greater reality\n\nthat is around them that they're oblivious.\n\nThere are other filmmakers, they do that in an amazing way,\n\nbecause the characters may leave\n\nand the camera just stays there with the environment,\n\nfor you to experience that environment without any action.\n\nYou know, in Y Tu Mama Tambien that example,\n\nthere's an action going on.\n\n[Samanth] Yes, that's right.\n\nAnd many times there's no action,\n\nyou just partake with the environment.\n\n[Samanth] That's so Perfect Days.\n\nMm hmm!\n\nWhich is Wim Wenders, and that happens a lot.\n\nI mean, the main character\n\ndrifts out of the scene a little bit, but the camera stays,\n\nsometimes in an empty house, room.\n\nAnd it's just like a couple of beats,\n\nbut it's just enough and it's very quiet,\n\nbut it's a great device.\n\nThat expanded time of Wenders\n\nis not fighting with narrative,\n\nit's just another measurement of time.\n\nYeah.\n\nIn TV, you know, there are examples\n\nthat you can see that they have done it.\n\nBergman did it with Scenes from a Marriage\n\nThe Kingdom Lars Von Trier.\n\nFassbinder with Alexanderplatz.\n\nDavid Lynch with his Twin Peaks.\n\n[Samanth] Twin Peaks, yeah.\n\nBruno Dumont with Le P'tit Quinquin\n\nAnd, by the way, don't get me wrong, so many of the shows,\n\nthey have amazing cinematic moments.\n\nRight.\n\nBut they are not consistent throughout the whole.\n\nIt's hard to have a strong, direct point of view\n\nfrom A to Z.\n\nMm hmm!\n\nPart of the nature of most shows is that you have\n\ndifferent directors doing different episodes.\n\nThe great shows, they know how to do very well.\n\nI think The Bear has amazing examples of that as well.\n\nOr Barry.\n\n[Samanth] Yeah. Yeah.\n\nThey establish a style and then different filmmakers come\n\nto honor that style.\n\n[Samanth] Right.\n\nThroughout the whole thing.\n\nAnd the thing is that when you're directing,\n\nin the case of the irresponsible action that I took\n\nto direct seven episodes, it's like you're doing a film,\n\nbut it's just very long.\n\nAnd what happens is, when you're doing a film,\n\nevery decision, you're doing the first frame.\n\n[Samanth] Yeah.\n\nYou start thinking about the repercussion\n\nthat it's going to have in these other moments.\n\nMm hmm.\n\nYou know?\n\nYou great showrunners do that,\n\nbecause they're very conscientious\n\nthat you have to give a follow up.\n\nAlfonso, it's been such a pleasure to speak to you.\n\nThank you so much.\n\nAnd I can't wait to watch Disclaimer.\n\nMy pleasure, it's been a good conversation.\n\nThank you so much.\n\nThank you.\n\n[camera clicking]\n\n[upbeat music]\n\n[gentle ambient music]",
  "authors": [
    "Condé Nast"
  ],
  "url": "https://www.wired.com/video/watch/big-interview-the-big-interview-alfonso-cuaron"
}