{
  "title": "Judge halts Trump’s deployment of national guard in Washington, DC",
  "text": "President Donald Trump and the Defense Department illegally deployed the National Guard in Washington, DC, a federal judge ruled Thursday.\n\nWashington, DC’s attorney general’s office had sued the Trump administration in early September over the National Guard’s deployment in the city, which came as Trump surged federal law enforcement in the capital.\n\nThe administration “exceeded the bounds of their authority” in how they deployed National Guard troops in the city, and “acted contrary to law” when they deployed the DC National Guard “for non-military, crime-deterrence missions in the absence of a request from the city’s civil authorities,” federal District Judge Jia Cobb wrote.\n\nCobb, however, delayed her order that would require the National Guard to leave the district, allowing the Trump administration 21 days to file an appeal.\n\nAdditionally, Cobb found that the Trump administration also “lack statutory authority” in bringing out-of-state National Guard members.\n\n“The Court finds that the District’s exercise of sovereign powers within its jurisdiction is irreparably harmed by Defendants’ actions in deploying the Guards,” Cobb wrote in her order.\n\nTrump and others in his administration have long touted the deployment of the National Guard and federal surge of officers in Washington, something they would later do in several cities throughout the country, many of which have also faced lawsuits. The administration has claimed that the National Guards presence added significant preventative measure that helped decrease crime in the district.\n\n“President Trump is well within his lawful authority to deploy the National Guard in Washington, DC, to protect federal assets and assist law enforcement with specific tasks,” White House spokeswoman Abigail Jackson said in response to the ruling. “This lawsuit is nothing more than another attempt — at the detriment of DC residents — to undermine the President’s highly successful operations to stop violent crime in DC.”\n\nIn her ruling, Cobb, an appointee of former President Joe Biden, acknowledged the complexities of the case given “the unique constitutional position of the District of Columbia.”\n\nCobb, however, said that “at its core, Congress has given the District rights to govern itself. Those rights are infringed upon when Defendants approve, in excess of their statutory authority, the deployment of National Guard troops to the District.”\n\n“From the beginning, we made clear that the U.S. military should not be policing American citizens on American soil,” DC Attorney General Brian Schwalb said in a statement following the decision.\n\n“This unprecedented federal overreach is not normal, or legal,” he added. “It is long past time to let the National Guard go home – to their everyday lives, their regular jobs, their families, and their children.”\n\nCobb found that “the deployments at issue entail the day-to-day presence of more than 2,000 National Guard troops,” which the judge noted is about two-thirds the size of the local police force.\n\n“The Court finds no authority in Title 49 of the D.C. Code that supports the President’s ability to call out the (DC National Guard) to patrol the District under these circumstances,” Cobb wrote.\n\n“There is also the risk that this incursion may become permanent, or at least enduring, given the creation of a (DC National Guard) unit specifically established to conduct law enforcement in the District,” which the judge notes runs contrary to the statutes that govern their deployment.\n\nThis story has been updated with additional developments and comment.",
  "authors": [
    "Holmes Lybrand"
  ],
  "url": "https://www.cnn.com/2025/11/20/politics/national-guard-washington-dc-trump-ruling"
}