{
  "title": "Trump’s 'affordability' efforts are a mess of absurdity and magical thinking | Steven Greenhouse",
  "text": "When running for president last year, Donald Trump wooed and wowed voters by vowing to reduce prices “starting on day one”. But once he was inaugurated, he seemed to pay precious little attention to prices and affordability.\n\nAll that changed, however, when inflation-weary voters thrashed Trump and the GOP on election day this month – within days, the Trump administration launched a slapdash effort to focus on affordability. Unfortunately, the campaign is a hot mess: a pile of absurdity, contradictions, magical thinking, scapegoating and good ol’ Trumpian dishonesty, with Trump repeatedly blaring that “prices are down”.\n\nTwo days after election day, Trump got his administration’s affordability drive off to a disastrous start when he said, “Our groceries are way down. Everything is way down … So I don’t want to hear about the affordability.”\n\nWith those words, billionaire Trump – who spends a lot of time palling around with fellow billionaires – showed utter contempt for the millions of Americans who struggle with affordability every time they go the grocery store. Trump told them they got it all wrong. He told them that they shouldn’t bother him about the trivial issue of affordability when he has bigger things to worry about, such as, perhaps, his obsession with winning the Nobel peace prize. Trump in effect said: I don’t feel your pain.\n\nTrump’s statement about everything being “way down” was absurdly obtuse and dishonest. How in the world could every price be way down when his cherished tariffs were pushing up prices? Banana prices are up 6.9% over the past year, beef is up 14.7% and coffee up 18.9% (in part because of the huge, punitive tariffs Trump placed on Brazil’s coffee and beef). Between January and September, prices rose in five of the six main grocery groups tracked in the Consumer Price Index, including meats, poultry and fish (up 4.5%); non-alcoholic beverages (up 2.8%); and fruits and vegetables (up 1.3%).\n\nDespite these numbers, Trump keeps pushing his big lie about affordability. Since election day, he has said there’s “virtually no inflation”, “prices are way down” and “it is far less expensive under Trump than it was under sleepy Joe Biden”. Trump said all this even though prices overall have unarguably risen since Biden left office. Right now, inflation is running at a 3% annual clip, which is 50% higher than the Federal Reserve’s 2% goal. In another falsehood, Trump boasted that gas prices have fallen to nearly $2 a gallon, even though his Department of Energy says they average $3.19.\n\nHit in the head by reality (and declining opinion polls), some Trump aides evidently told the Maga king that his “prices are down” rhetoric made him sound dangerously out of touch with typical Americans, many of whom are angry about prices continuing to climb after Trump promised to bring them down. Trump’s advisers seized on one quick fix to reduce some prices: roll back some of Trump’s beloved tariffs. That sensible idea contradicted Trump’s absurd assertion that new tariffs wouldn’t raise prices for US consumers.\n\nWith some tariffs being rolled back on coffee, beef, tomatoes and bananas along with other tropical fruit, Trump will no doubt trumpet to the world that he’s cut prices as soon as those foods start declining in price. That would be like an arsonist boasting that he put out a fire that he had started.\n\nWhen Trump spoke last Monday to a “summit” of McDonald’s executives and franchisees, he once again showed that he’s out of touch – with typical Americans and the truth. He said, “This is … the golden age of America because we are doing better than we’ve ever done as a country.” He sought to calm angry consumers by adding: “Prices are coming down and all of that stuff.” That’s easy for a billionaire to say, but it’s hard for millions of Americans not to fret about prices “and all of that stuff” and not just because 42 million Americans faced having their food stamps cut off and 24 million face having their health premiums soar, often by over $1,500 a year, because Trump and the Republican-led Congress will not extend Obamacare subsidies.\n\nSorry, Mr President, but Americans strongly disagree with your claim that it’s a golden age. According to a Pew poll in October, 74% of Americans think economic conditions are fair or poor, while just 26% think they are good or excellent. What’s more, according to a CNN poll last month, 61% of Americans say Trump’s policies have “worsened economic conditions in this country”.\n\nScott Bessent, Trump’s treasury secretary, recently contradicted Trump’s boasts of a golden age. Bessent said that far from booming, some parts of the US economy “are in recession”. The manufacturing sector that Trump vowed to save appears to have contracted eight months in a row and lost about 33,000 jobs since January. Pointing to this economic weakness, Bessent called on the Federal Reserve to cut interest rates – a move that would help affordability.\n\nSeeing the huge public dismay about affordability, Trump has resorted to one of the oldest tricks in the book. He promised to, in effect, buy off disgruntled Americans, in this case, with “a dividend of at least $2,000 a person (not including high income people!)”. For many struggling Americans, that must sound like manna from heaven, but it’s unlikely that Congress, already alarmed about huge budget deficits, will enact that idea.\n\nTrump’s statement that the $2,000 won’t go to “high-income people!” feels like a confession that his “big, beautiful bill” gave far too much in tax cuts to the rich and too little to everyone else. It also shows that the public’s complaints are hitting home that Trump has become the president by, for and of the billionaires.\n\nIn a recent speech, Bessent said that the administration is “improving affordability” by holding down spending, noting that this helps hold down interest rates. But Trump’s proposed $2,000-a-person payment would undercut all that. It would increase federal spending and thereby push up interest rates and probably inflation, too, by putting more money in consumers’ pockets.\n\nIn another supposed fix for affordability, Trump put forward the hare-brained idea of creating 50-year mortgages, with the notion that this would help reduce monthly mortgage payments. But the truth is that 50-year mortgages, compared with 30-year mortgages, would do little to lower monthly mortgage payments. They would often reduce payments by just $100 or $200 a month. The bad news is that 50-year mortgages would, as David Dayen has written, often more than double the already huge amount of interest that homeowners pay and would greatly slow their accumulation of equity.\n\nIn their affordability campaign, Trump and his truth-challenged crew are yet again blaming Biden for the country’s economic problems, including rising prices. JD Vance said: “We inherited a disaster from Joe Biden,” while Kush Desai, a White House spokesperson, said, “Cleaning up Joe Biden’s inflation and economic disaster has been a top focus for President Trump since day 1.”\n\nThis is absurd, untruthful rubbish. As I’ve written, Biden handed Trump a very strong economy, with inflation way down, economic growth strong and unemployment low. But Trump’s policies, especially his tariffs, have created an economic mess, pushing up prices and slowing GDP growth.\n\nMark Zandi, chief economist at Moody’s Analytics, says that 22 states are already in recession, with their economies damaged by Trump’s tariffs. Zandi fears that if big states like California and New York tumble into recession, the US could slide into a broad economic slump. During recessions, consumers overall have less money to spend, and inflation typically declines. Unfortunately, with Trump’s much-ballyhooed affordability campaign likely to do little to hold down prices, his most effective “tool” in achieving increased affordability could prove to be pushing the nation into recession.\n\nThat’s something that struggling Americans really can’t afford.",
  "authors": [
    "Steven Greenhouse"
  ],
  "url": "https://www.theguardian.com/commentisfree/2025/nov/20/trump-affordability-mess-republicans#comments"
}