{
  "title": "The Espresso Pro portable monitor is a revolution for remote work",
  "text": "is a deputy editor and Verge co-founder with a passion for human-centric cities, e-bikes, and life as a digital nomad. He’s been a tech journalist for 20 years.\n\nPosts from this author will be added to your daily email digest and your homepage feed.\n\nMost gadgets are iterative in the value they bring to our lives. The 15.6-inch Espresso Pro portable monitor is different, having utterly transformed the way I work remotely over the last month of testing.\n\nSee, I spend a lot of time working from my van, which makes me miss my dual-monitor setup at home — it’s hard to adapt to a single 14-inch laptop display after regularly working on a pair of 27-inch monitors. Espresso lets me approximate that setup in tight spaces with a display that’s thinner and much lighter than the Mac or Windows laptop it enhances. And it connects over a single USB-C cable.\n\nI’m writing this from my van’s “office,” where Espresso’s 4K (3840 x 2160) LCD touchscreen with 1.07 billion colors (100 percent Adobe RGB) hovers above my MacBook Pro perched on a small table — photos processing on one display as I type these words on another. At night, I can swap the MacBook for my iPhone 15 Pro (or Android phone) to create a relatively big, shareable screen for watching films in bed.\n\nAt $699 / €799 it ain’t cheap, but after my laptop and Starlink Mini internet connection, the Espresso Pro is the gadget I find myself relying upon most to work remotely.\n\nBut then again, I don’t own an iPad.\n\nThe Espresso Pro 15 is surprisingly lightweight for its size. It measures 360 x 225 x 9mm and weighs 800g. (It’s also available in a larger 17-inch model for $799.) The aluminum-wrapped display feels somewhat hollow, flexing as you squeeze it between the fingers, as if it could still shed a few millimeters. Nevertheless, it has survived weeks of abuse that include tipping over onto the screen, being dropped onto a carpeted floor, and hours of jostling in its case from driving on gravel roads.\n\nAs a companion device, it draws 13 watts at its maximum brightness of 550 nits, or around 9 watts when dimmed to 300 nits. That’s nothing compared to a traditional monitor, but enough to cut my laptop’s battery life roughly in half. Fortunately, the Espresso Pro has two USB-C ports that support pass-through charging, so running a second USB-C cable from Apple’s wall charger to the monitor also charges my MacBook’s battery.\n\nThe Espresso Pro comes with a solid little Stand+ mount that’s tall enough to lift the monitor above an open laptop, yet folds up super small. The versatile little stand nearly justifies the price premium you pay for Espresso monitors. It attaches to the Espresso Pro magnetically and fairly securely. It’s fine for most desks, but with two people and a dog moving about the inside of my van, I needed a solution that can’t be knocked off a table by accident. So, I had to get creative.\n\nUsing the Espresso display in portrait mode in the “office.” It’s mounted on the Kuxiu iPad stand I hacked together. It’ll work in landscape with my iPhone, but I have to supply power to the display’s second USB-C port (using a power bank, in this example). The included Stand+ mount is tall enough to lift the portable monitor above my 14-inch MacBook Pro. Here you can see the Stand+. Reflections are similar to Apple’s own display.\n\nI bought this magnetic table mount for iPads from Kuxiu. But since its magnets were misaligned for the Espresso Pro, I ended up gluing Espresso’s $49 VESA adapter to the iPad mounting plate. It’s a little inelegant, but it lets me securely mount and view the display from a variety of angles inside and outside my van. It’s also stable enough to leave attached to the table when driving.\n\nI also installed the EspressoFlow app on my Mac to make the setup a little easier. It helps with window snapping and arrangement on Mac and Windows, but isn’t required.\n\nI don’t find Espresso Pro’s touchscreen capabilities particularly useful with macOS. In fact, the touchscreen proved more annoying than helpful when handling the display. Then again, I didn’t test it with Espresso’s Pen accessory.\n\nUsing the Espresso Pro with my iPhone was great for watching Netflix, Plex, and YouTube videos on a bigger display, but it has some limitations.\n\nFirst, my iPhone 15 Pro isn’t powerful enough to drive the Espresso Pro Display without a second USB-C cable attached for power. Espresso also doesn’t support rotating the display vertically with my phone, so it’s not great for viewing social videos on TikTok or Instagram. I also wish the two downward-firing speakers in the Espresso Pro were louder to make shared viewing more enjoyable, and I found apps like DAZN — which is generally buggy, anyway — refuse to stream NFL games when connected. The on-screen controls for brightness, contrast, and volume are finicky, requiring multiple frustrating swipes to activate.\n\nOverall, I’m super impressed by the 15.6-inch Espresso Pro’s ability to augment my laptop’s puny display. Having a second screen that I can set up literally anywhere is a game-changer for my type of remote work.\n\nPrevious Next\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n1 / 12 The Espresso display is so portable it can be taken anywhere you take your laptop.\n\nHere’s the rub: Why should anyone buy the 15.6-inch Espresso Pro when, for $100 more, you could own a new $799 13-inch iPad Air – a price that drops to about $639 if you’re willing to live with an Apple refurbished model? You give up a little screen but get a far more capable device that can be used as a second monitor with Apple Sidecar, or Duet Display or Luna Display for Windows PCs and older Macs.\n\nOn the other hand, it’s nice to have a purpose-built device that does one thing well, without any distractions. I can read e-books on my iPhone, for example, but it’s a much nicer experience on a Kindle. Espresso also sells a 15.6-inch display for just $299 if you can live with a dimmer 1080p monitor, but $699 is a lot to ask when similarly specced 4K displays can be had for $250 or less.\n\nUsing the Espresso monitor inside my tiny rolling office for the last three weeks has been transformative, improving not only my own workflow but also my wife’s. Each morning, we present our case for who needs to use it most, leaving one of us sad and one clear winner: the Espresso Pro 15.\n\nPhotography by Thomas Ricker / The Verge",
  "authors": [
    "Thomas Ricker"
  ],
  "url": "https://www.theverge.com/reviews/805112/the-espresso-pro-portable-monitor-is-a-revolution-for-remote-work"
}