{
  "title": "Harvard Professor Answers Middle East Questions",
  "text": "Transcript\n\nI'm Tarik Massou from Harvard University.\n\nLet's answer your questions from the internet.\n\nThis is Middle East Support.\n\n[upbeat music]\n\nAlright, let's look at the first question.\n\nHere's a question from @PatrioticMommy1.\n\nAnyone know what Middle East countries are saying\n\nabout the US bombing nuclear sites in Iran?\n\nLot of Arabs in particular don't like the idea\n\nof the United States bombing a Muslim country\n\nin conjunction with Israel.\n\nThat's a very powerful strain of public discourse\n\nin the Arab and indeed Muslim world.\n\nBut on the flip side, a lot of Arab countries\n\nare afraid of Iran.\n\nThey're particularly worried\n\nthat the Iranians will use the strength\n\nthat they derive from a nuclear weapon\n\nto assert their dominance over the region,\n\nand so they're not necessarily that opposed\n\nto the United States using its military power\n\nto thwart Iranian nuclear ambition.\n\nHere's a question from Quora.\n\nIf you had to make a timeline of major events in the history\n\nof the modern Middle East until today,\n\nwhat events would you put on the timeline?\n\nThe modern world begins in the 15th century\n\naccording to most historians.\n\nSo you're asking me to pick six events over\n\nthe last 500 years?\n\nThat's really hard to do.\n\nThe first is 1453, when Mohammed II conquers Constantinople\n\nrenaming it Istanbul, and that really is the beginning\n\nof the Ottomans rise to power.\n\nThey conquer the entirety of the Arab world\n\nand it remains under their control for the next 500 years.\n\nThe second point I would put there is in 1492,\n\nthe Spanish Reconquista.\n\nThe Spaniards force out the Arabs\n\nwho had been controlling Spain since the seven hundreds.\n\nThen I'd come to 1744, a local tribal leader\n\nin Central Arabia, Muhammad Al Saud forges an alliance\n\nwith a local religious leader\n\nnamed Muhammad Ibn Abdul-Wahhaab,\n\nand that gives rise to the kingdom of Saudi Arabia\n\nwhose leaders are the descendants of Al-Saud.\n\nThe other thing it gives rise to\n\nis very puritanical understanding of Islam\n\nthat we call Wahhabism, the radical ideology\n\nthat eventually finds expression\n\nin organizations like Alqaeda.\n\nThen I'd come to 1798, Napoleon invades Egypt,\n\none of the beginnings of Western colonialism\n\nin the Arab world.\n\nThe next date I'd come to is 1897,\n\nand that is the date of the first Zionist Congress\n\nthat decided that the way to cope with the scourge\n\nof antisemitism in Europe was for the Jewish people\n\nto have a homeland in Palestine,\n\nwhich in the Bible is the ancestral homeland of the Jews.\n\nThat sets in motion the very tragic struggle\n\nthat we're through today between Palestinians and Israelis.\n\nThen we come to 1908, and that is when they discover\n\nin the Middle East the commodity that makes it so vital\n\nto the world, and that is black gold or oil.\n\nThe Middle East is the world's largest producer.\n\nThe last date, I'm gonna say the end of World War I.\n\nIt's really when the modern Middle Eastern state system\n\ncomes into being.\n\nThe British and the French and the allies take over\n\nthis part of the world, and they draw the borders\n\nthat today are the source of so much conflict.\n\nLet's take another question.\n\nDill_Chips asks, it's been a bit more than six months\n\nsince the Assad regime fell.\n\nHave things improved in Syria?\n\nIt really depends on who you ask.\n\nThis is the current president of Syria, Ahmed de Sharaa.\n\nHe was the leader of the militia\n\nthat ultimately forced Assad out of Syria,\n\nand his militia is actually an offshoot\n\nof an organization known as Al kigh-duh\n\nor as Americans call it Al-Qaeda.\n\nIt's a measure of how terrible things were in Syria\n\nunder Assad, that this man Sharaa could be viewed\n\nby the majority of Syrians as a savior.\n\nThough Sharaa has made a lot of the right noises\n\nabout wanting to establish a democracy,\n\nabout not wanting to see conflict with Syria's neighbors,\n\nmost notably Israel.\n\nHe has been pretty brutal internally.\n\nSo, there was a crackdown against Alawites,\n\nit's a religious minority from which Bashar Assad came.\n\nAnother religious minority that's located in the South,\n\nthe Druze are also coming under violence\n\nfrom militias associated with Sharaa's government.\n\nAre things in Syria better than they were\n\nwhen Bashar was around?\n\nIf you ask this handsome gentleman, things are great.\n\nLet's take another question.\n\n@FulhamFrenchy asks, is Turkey part of the Middle East?\n\nThe Middle East starts in the west in Morocco\n\nand ends at its Eastern most extent either in Iran\n\nor depending on who you ask in Afghanistan.\n\nSome people say that actually the Middle East\n\nis just this part,\n\nand we should refer to this as North Africa.\n\nSo some people will say the Middle East and North Africa.\n\nRegardless of which definition you want to use,\n\nTurkey is of course in the Middle East,\n\nbut a little part of it right here is actually in Europe.\n\nTurkey has been torn between two camps,\n\none camp that says Turkey is absolutely part\n\nof the Middle East.\n\nIt is one of the biggest and most powerful\n\nand historically consequential Muslim majority countries,\n\nand another camp that says Turkey is European\n\nand it needs to become more like Europe.\n\nThe founder of modern Turkey,\n\na guy named Mustafa Kemal Ataturk said, look, World War I,\n\nwe were totally defeated by the Allies\n\nbecause the Turks were on the side of the Germans.\n\nThe way we can never let that happen again\n\nis to become like the Europeans who defeated us,\n\nAtaturk instituted all kinds of reforms\n\nto make Turkey more European.\n\nOne of the big things he did,\n\nin Turkey, people used to wear a hat that looked like this.\n\nIt was called a fez.\n\nThe reason that lots of Turks wore it is because\n\nit's a hat that you could wear and still pray\n\nbecause it didn't have a brim.\n\nAnd Muslims touch their forehead to the ground\n\nwhen they pray.\n\nAtaturk was so keen on making his country European\n\nthat he banned that headgear\n\nand said people needed to wear fedoras and hats with Brims\n\nin order to become more like Europeans.\n\nThat struggle between Ataturk's vision of Turkey\n\nand a more traditional Middle Eastern Muslim version\n\nof Turkey exists to this day.\n\nBigedcactushead asks, why has the US Navy failed\n\nto stop the rag-tag Houthis from attacking ships\n\nand protecting the shipping lanes?\n\nThat's a good question, Bigedcactushead.\n\nTo answer it, it would be helpful\n\nto look at a topographical map of the Arabian Peninsula.\n\nSo the Houthis are located here in Yemen.\n\nIt's very mountainous terrain.\n\nIt's sort of ideal terrain for a militia\n\nthat wants to hide from its enemies.\n\nIt's very difficult for the Saudis or the Emiratis\n\nor for the United States to actually hit the Houthis.\n\nThe only way that you could actually guarantee\n\nthat you would stop the Houthis would be a ground invasion,\n\nand this terrain is very difficult.\n\nHere's a question for Quora.\n\nWhy hasn't democracy been working in the Middle East\n\nso far in so many countries?\n\nThe only democracy that exists right now in the Middle East\n\nis the state of Israel.\n\nLots of people argue that even the state of Israel\n\nisn't a perfect democracy\n\nbecause it occupies several million Palestinians\n\nwho don't get a vote, and it's an important question\n\nas to why that is the case.\n\nSome people point out the United States hasn't necessarily\n\nbeen friendly to democracy in the Middle East.\n\nWe've got all kinds of alliances with Arab leaders\n\nwho are not democratic and who are not friendly\n\nto democracy, and that suits us just fine\n\nbecause we sometimes worry that if there was democracy\n\nin the region, it would bring to power a kind of populace\n\nand nationalists who are not terribly friendly to the West.\n\nSo another set of arguments says,\n\nIslam itself is not necessarily friendly to democracy.\n\nAfter all, remember the prophet Muhammad,\n\nthe founder of Islam,\n\nwas actually not just a religious leader.\n\nHe was the ruler of the Muslims\n\nand last time anybody checked,\n\nhe didn't subject himself to a vote.\n\nAnd then the third set of answers\n\nhas to do with the nature of Middle Eastern economies.\n\nMany of them are heavily dependent on oil,\n\nand when you've got oil,\n\nit means you basically pull your wealth out of the ground\n\nand sell it to foreigners.\n\nAnd what it means is you don't have to tax.\n\nRemember no taxation without representation.\n\nSo in the Middle East you have the kind of the opposite,\n\nno demands for representation without taxation.\n\nThis one is from Smexyrexytitan.\n\nIt's what is happening in Gaza, truly a genocide.\n\nHere's what is incontrovertible.\n\nThere is a humanitarian crisis in Gaza\n\nof massive proportions.\n\nPeople argue about the exact number\n\nof people who have been killed.\n\nIs it 50,000?\n\nIs it more?\n\nIs it less?\n\nThey argue about whether there's actually a famine going on\n\nin Gaza or just the beginnings of a famine.\n\nBut the fact of the matter is that Gaza is today one\n\nof the most grim places on the planet.\n\nThe death and destruction that have been meted out\n\non that very small territory,\n\non those very long suffering people is just extraordinary\n\nand there is nobody with a heart\n\nwho cannot feel extraordinary pain and grief\n\nupon looking at the pictures of what's coming out of Gaza.\n\nThe question though of whether what is happening in Gaza\n\nis a genocide is actually a kind of technical question\n\nof international law.\n\nSo there's a case right now before\n\nthe International Court of Justice,\n\naccusing the Netanyahu government of committing genocide\n\nagainst the Palestinians.\n\nAnd the International Court of Justice hasn't yet ruled\n\non that, but they have determined\n\nthat there is enough evidence to allow the case\n\nto go forward.\n\nIn other words, they've concluded\n\nthat there's merit to the claim.\n\nSome of the merit to the claim they say is found\n\nin the statements of Israeli leaders.\n\nCan look at the statements\n\nof Prime Minister Binyamin Netanyahu in one early speech,\n\nanalogized Palestinians to Amalekites,\n\nwhich is a group in the Bible that fought the Jews\n\nand had to be defeated.\n\nThere's Israeli security officials who have referred\n\nto the Palestinians as human animals.\n\nEven the president of Israel has said there's no such thing\n\nas an innocent Palestinian\n\nbecause they voted for Hamas 20 years ago.\n\nOn the flip side, Israelis will point to almost every one\n\nof those statements and say they weren't meant to apply\n\nto Palestinians at large.\n\nThey were meant to apply to Hamas.\n\nThey say, Palestinians, we don't think Palestinians need\n\nto be eradicated.\n\nWe think Hamas needs to be eradicated.\n\nOn the one hand,\n\nthis feels almost like a technical question, you know,\n\nlet the courts decide what is genocide.\n\nBut if you look at how this question has really torn apart\n\nso many Americans on college campuses, et cetera,\n\nit's because on both sides of this question,\n\nare normal good well-meaning people\n\nwho each have deep attachments to one side\n\nor another of this conflict.\n\nSo this is probably hardest question you could ask.\n\nOttersintuxedos asks,\n\nwhy is there so much oil in the Middle East?\n\nYou really have to go back millions of years.\n\nWhat is now the Arabian Peninsula\n\nwas actually a kind of warm and shallow sea\n\nthat was full of plant life.\n\nThat plant life ultimately gets sedimented\n\nlayer upon layer, subject to tremendous heat and pressure,\n\nand turns into the hydrocarbons that you know and love.\n\nAnd what's particularly unique about the Middle East\n\nis not just that there's a lot of oil,\n\nbut it is very easy to access.\n\nSo it's very close to the surface.\n\nIt's not as simple as sticking a straw on the ground\n\nand sucking, but it's close.\n\nSo it's very cheap to extract\n\nand that's why the Middle East is really\n\nthe gas station of the world.\n\nHere's a question from the NoStupidQuestion subreddit\n\nasked by ulteriorkid32,4.\n\nThe United Arab Emirates has the lowest crime rate\n\nand the most influx of millionaires.\n\nWhat is their secret?\n\nThe United Arab Emirates secret really comes down\n\nto what I call the three Ls.\n\nLocation, law, and lubrication.\n\nWith location, this is where the UAE is located\n\nin the Arabian Peninsula.\n\nIt really is at the crossroads of a lot of global trade.\n\nThe leaders of the UAE recognized this in the 1970s\n\nand eighties and they doubled down on turning their country\n\ninto a global trade and logistics hub.\n\nThey built one of the world's great airlines.\n\nIf you wanna fly from New York to anywhere in Asia\n\nor South Asia, odds are you're gonna fly through Dubai.\n\nSo the United Arab Emirates\n\nhas some of the most business friendly laws in the world\n\nand they enforce them.\n\nIf you go to the UAE now and you, for example,\n\nsign a contract with somebody in the Emirates,\n\nthat contract is gonna be enforced.\n\nThen we come to the third ingredient in the UAE success\n\nand that's lubrication.\n\nAnd by this I mean oil, the UAE is oil rich\n\nand they use that oil money\n\nto make their country into the kind of place\n\nthat would attract millionaires and foreign investors\n\nand turn it into one of the most exciting parts\n\nof the Middle East.\n\n@Ryann57429 asks, what's the origin of the conflict\n\nbetween Israel and Palestine?\n\nSo, let's look at a map of this conflict.\n\nWhen we talk about Palestine,\n\nwe're generally talking about this territory,\n\nthe West Bank of the Jordan River,\n\nand this territory here,\n\nthe Gaza Strip on the shores of the Mediterranean Sea.\n\nWhen people talk about the land from the river to the sea,\n\nthis is what they're talking about.\n\nJordan River, Mediterranean Sea.\n\nThe basic reason for this conflict is\n\nthat you have two peoples who are both indigenous\n\nto this land between the river and the sea,\n\nand who cannot agree on whether to share the land\n\nor divide it or how share it or how to divide it.\n\nOne of the complications here is that\n\nfor most of the last 2000 years,\n\nthere's only a very small Jewish presence there.\n\nThe majority of Jews having been expelled\n\nabout 2000 years ago after the destruction\n\nof the second temple in Jerusalem.\n\nThe Jews scatter throughout Europe,\n\nand we all know the history of the Jewish people in Europe,\n\nwhich is one of great tragedy and triumph.\n\nBut ultimately, by the 19th century,\n\nthe Jewish people have been experiencing\n\nso much antisemitism in Europe,\n\nthat a powerful movement emerges to resettle\n\nthe land of Palestine.\n\nAnd so Jews start returning in large numbers\n\nin the latter half of the 19th century,\n\nand they invariably start to bump up against the Arabs\n\nwho had been living there.\n\nIn the very beginning,\n\nwhen Jewish immigrants from Europe show up,\n\nthey have pretty good relations with the Arabs\n\nbecause the Arabs find in them source of employment.\n\nArabs were agricultural workers, farmers,\n\nand so they would work on the lands purchased by the Jews.\n\nA little bit later on, some of the Jews who immigrate\n\nto Palestine have a different idea\n\nabout how they wanna live.\n\nThey say, we don't wanna depend on Arab labor.\n\nWe wanna become self-sufficient.\n\nAnd if you're an Arab faced with this new kind\n\nof Jewish pioneer, you are gonna be upset\n\nbecause they're actually boycotting your labor.\n\nAnother driver of the conflict between the Arabs and Jews,\n\nis that a lot of the Arab land was actually owned\n\nby wealthy landowners who didn't live in Palestine.\n\nThey lived in more cosmopolitan parts of the Ottoman Empire.\n\nAnd so when Jewish immigrants showed up\n\nand wanted to buy land, absentee Arab landowners were happy\n\nto sell it to them, selling the land out from under\n\nthe native Palestinian Arab farmers who were working on it.\n\nSo this was almost a perfect storm guaranteed\n\nto create a very durable conflict.\n\nMad_Season_1994 asks, What is it about Dubai\n\nthat so many dudes find appealing\n\nand always wanna go there?\n\nOne of the ways that Dubai\n\nhas attracted so much global talent\n\nis by making the country really fun.\n\nSo if you were to go to Dubai, you'd really find it\n\nto be the playground of the Middle East,\n\nsome of the world's greatest restaurants,\n\nhotels and dance clubs and other entertainments.\n\nI, for example, went to SeaWorld in Abu Dhabi\n\nand it was amazing.\n\nThere's the tallest building in the world, the Burj Khalifa.\n\nReally crazy building projects\n\nlike this development that's made out up\n\nof reclaimed land in the Persian Gulf.\n\nYou can't exactly reenact the plot\n\nof The Hangover movies there,\n\nbut it is a very open society.\n\nBut there is of course, a less appealing side to it.\n\nIf you are, for example, an Indian guest worker\n\nwho's been brought in to Dubai\n\nor to any of the cities in the Arabian Gulf\n\nfrom Doha to Riyadh\n\nto build some of these gleaming skyscrapers,\n\nyou're not having such a good time.\n\nYou're making money to send back to your family,\n\nbut you may be living in conditions that are not humane.\n\nIt's not all fancy nightclubs\n\nand Michelin starred meals\n\nfor all of the young men who are in Dubai.\n\nThis one is from the IsraelPalestine subreddit.\n\nHow would a two-state solution even work?\n\nThat's a great question.\n\nWhen we talk about a two-state solution,\n\nwe're generally talking about a Palestinian state\n\nin the West Bank and Gaza.\n\nRight off the bat, there's two big problems that emerge.\n\nThis Palestinian state would be non-contiguous.\n\nGot a part here and a part here,\n\nand they're separated by Israel.\n\nHow do you deal with that?\n\nHow do you actually have free passage of Palestinians\n\nfrom this part of their territory\n\nto this part of their territory without the Israelis feeling\n\nthat having a bunch of Palestinians pass\n\nwithin Israel proper is a security threat?\n\nAnother problem that jumps right off the bat,\n\nthe Israelis say, If we also give away the West Bank\n\nand we have no security presence in the West Bank,\n\nthen the entire state of Israel is vulnerable,\n\nbecause there's lots of high lands here in the West Bank.\n\nIsraelis say, Whoa, we're gonna seed the highlands\n\nso that the Palestinians can just launch rockets\n\nin artillery against us,\n\nbut that's not even the half of it.\n\nAnother problem is that this map is a little bit misleading\n\nbecause if we look at a detailed map of the West Bank,\n\nthis is not one undifferentiated mass of Palestinians.\n\nThe Israelis have since 1967, been settling\n\nthe Palestinian territory of the West Bank\n\nwith Jewish settlers,\n\nand there are now about 750,000 Jewish settlers\n\nin the West Bank.\n\nHow would it work?\n\nWould you have to expel the Jewish settlers?\n\nCan they remain in a Palestinian state and be safe?\n\nThere's a lot of technical details\n\nthat have to be worked out.\n\nAnd so when you ask how would\n\na two-state solution even work?\n\nI'd say today in 2025, my answer is, I don't know.\n\nI also don't know of any other solution to this problem.\n\nHere's a question from NateNandos21.\n\nWhy does the Middle East have so many wars?\n\nIf you were to look at a map of the Middle East,\n\nyou would see that the borders\n\nbetween Arab countries look like straight lines.\n\nYou can almost see the British\n\nor French colonial officials standing there\n\nwith a ruler and a pen drawing these borders.\n\nAnd that looks very different from the borders\n\nbetween European countries,\n\nwhich tend to follow natural formations\n\nlike mountains or rivers.\n\nThat leads to two kinds of conflict.\n\nThe first is conflict between states,\n\ncountries that don't necessarily like\n\nwhere the border was drawn when Iraq invaded Kuwait in 1990.\n\nIn part that was because they didn't like\n\nwhere the British drew the border,\n\nand then it also to conflict within states.\n\nIf you're a Kurd,\n\nand you are included in this entity called Syria\n\nthat the colonial powers drew,\n\nyou may be thinking, this is not real.\n\nI'm not really a Syrian.\n\nWe could have drawn this border in another way\n\nthat would've given me an independent state of Kurdistan.\n\n@tarianrd asks, What is the difference\n\nbetween Sunni Muslims and Shia Muslims?\n\nThe main difference between Sunni\n\nand Shia Muslims really goes back\n\nto the early days of Islam.\n\nThe religion,\n\nwhich today counts 1.8 billion people among its followers,\n\nwas started in the early seventh century\n\nby a man named Mohammed,\n\nwho is revered by Muslims as a prophet.\n\nWhen Mohammed died, the Muslim community\n\nwas divided about who would lead them.\n\nSome people said,\n\nOh, the prophet Mohammed has this good buddy\n\nand father-in-law named Abu Bakr.\n\nHe should be the one to lead the Muslim community.\n\nWhereas others said,\n\nWell, the Prophet Mohammed's cousin, Ali ibn Abi Talib,\n\nis more suitable for leadership.\n\nThere was civil war, and the Shias today\n\nare basically the descendants of those who supported Ali.\n\nThey were called Shiat Ali, the partisans of Ali.\n\nAnd today they make up about 10%\n\nof Muslims concentrated in Iran and Iraq\n\nwith large populations in Lebanon,\n\nlarge population in South Asia.\n\nThere's definitely conflict between Sunnis and Shias.\n\nFor example, Iran and Iraq fought a war\n\nthrough the 1970s and early '80s,\n\nbut of course, there's lots of Shias in Iraq\n\nwho fought against Iran.\n\nSo the idea that the conflict between Iran\n\nand other countries is about Iran being Shia\n\nand the other Arab countries being Sunni,\n\nthat's a very contested idea.\n\nHere's a question from @zenith_6_nil.\n\nWhy is Islam always linked to terrorism?\n\nOne of the arguments that you might hear\n\nfrom other scholars of the Middle East\n\nis that Muslims are often linked to terrorism\n\nbecause Western commentators\n\nhave some prejudice against Islam,\n\nand that's why they're much more likely\n\nto call violence by Muslim's terrorism\n\nand not apply the same name\n\nto violence committed by any other religious group.\n\nOthers will point out\n\nthat in the last a hundred years or so,\n\ninhabitants of Muslim lands have had a lot of reason\n\nto meet out violence against Westerners.\n\nAfter all, the Middle East was subject after World War I\n\nto a series of occupations by western countries,\n\nand there's still a very strong Western presence\n\nin the Middle East that a lot of Arabs chafe under.\n\nWe saw this expressed most clearly\n\non September 11th, 2001,\n\nwhen Al Qaeda attacked the World Trade Center.\n\nTheir argument for why they did it\n\nwas that this was in retaliation\n\nfor oppression and violence against Muslims.\n\nBut there's another group of scholars\n\nwho say that the root of the Islamic connection\n\nwith terrorism really goes back\n\nto the essence of the religion.\n\nAnd they'll point to chapters in the Holy Text of Islam,\n\nthis beautiful book, the Quran,\n\nwhich exhort Muslims to engage in Jihad\n\nor Holy War on behalf of the Muslim community.\n\nSome people say that Jihad really here needs\n\nto be understood metaphorically\n\nas a struggle against your inner demons.\n\nBut others say that, No, when the Quran talks about Jihad,\n\nthey are talking about fighting wars\n\nin order to spread the religion of Islam\n\nor to rid Islam of the domination\n\nor oppression of non-Muslims.\n\nHere's a question from the AskHistorians subreddit.\n\nWhy did the US really invade Iraq in 2003?\n\nWhat's the real reasons behind the war?\n\nSo remember, the Iraq War of 2003 was brought to us\n\nby this gentleman, George W. Bush,\n\nand it was to unseat Saddam Hussein,\n\nwho was the dictator of Iraq.\n\nThere were a couple of big reasons offered\n\nfor why the United States needed to invade Iraq.\n\nThe first was that Saddam Hussein\n\nwas somehow implicated in 9/11.\n\nThere was also an associated fear\n\nthat Saddam Hussein was developing weapons\n\nof mass destruction, most critically nuclear weapons.\n\nOne of the reasons people think\n\nthat the war in Iraq was fought\n\nfor other than its stated reasons,\n\nafter the invasion,\n\nwe found Iraq didn't have any weapons of mass destruction.\n\nSo clearly there was something else going on here.\n\nCritics of the war, of course, make a third argument\n\nthat it was all about that oil.\n\nAnd if you ask a second question, which is, did it pan out?\n\nYou'd have to conclude that on almost every metric,\n\nthe Iraq War was a failure.\n\nWe didn't get any oil.\n\nWe got rid of Saddam Hussein who was an enemy\n\nof the Iranians and basically empowered allies\n\nof the Iranian regime.\n\nAnd the collapse of Iraq gave rise to all kinds\n\nof terrorist groups that continued to wreak havoc in Iraq\n\nand in Syria in particular, even to this day.\n\nThis one's from Lotuswongtko.\n\nI heard Iran was really very rich in the 1960s.\n\nWas it true?\n\nIran was rich in the 1960s and it's still rich today.\n\nRemember, it's a major oil producer.\n\nOne of the other things you'll hear about Iran in the 1960s\n\nwas that it was very liberal.\n\nYou'll see people share photos\n\nof women in Iran in the 1960s wearing mini skirts\n\nand having beautiful finely-coifed hairstyles,\n\nand contrasting that to today\n\nwhere women in Iran are kept under very tight restrictions\n\nwith respect to how they can dress in public.\n\nAnd that really is a result of what happens in Iran,\n\nI would say starting in the 1950s.\n\nSo in 1953, Iran is actually a constitutional monarchy.\n\nThere's an Iranian leader named Mohammad Mosaddegh\n\nwho decides to nationalize the Anglo-Iranian Oil Company.\n\nThis is the major oil company that's producing Iranian oil\n\nand it's owned by the British.\n\nAmerica decides to cooperate with the British\n\nand overthrow him, and we do.\n\nBut what happens as a result of that\n\nis that America invests very heavily\n\nin an authoritarian regime led by the king\n\nwho called himself the Shah,\n\nand that was a very restrictive regime.\n\nThey were pro-Western, they were modern,\n\nbut they also did not brook any descent.\n\nAnd it all explodes in the 1979 Iranian Revolution led\n\nby this man, Ayatollah Ruhollah Khomeini.\n\nAnd this guy was a religious scholar who believed\n\nthat the proper form of government\n\nis for religious scholars to rule,\n\nand he set himself up as Iran's supreme leader,\n\nand inaugurates what is now known\n\nas the Islamic Republic of Iran,\n\na country that is run on their understanding of Islamic law.\n\nThis is from @Salenophile48.\n\nWhy are there American bases in Qatar?\n\nBecause look at where Qatar is.\n\nIt is in such a strategically important territory.\n\nYou've got Iran here, you've got the oil of the Persian Gulf\n\nthat flows through here.\n\nSo it's very important for the United States,\n\nwhich wants to ensure the free flow of oil\n\nand the security of its allies from Iranian adventurism\n\nto have a military presence there\n\nto keep the oil flowing and to keep the peace.\n\nSocraticTiger asks,\n\nWhy did America become pro-Israel in the 1960s?\n\nSo if you're to ask a lot of Palestinians,\n\nthey would find that to be a weird question.\n\nThey would say America has been pro-Israel\n\nfrom the very beginning.\n\nAfter all, the UN vote that results\n\nin the international global recognition\n\nof the state of Israel,\n\nthe US played an important role in lining up the votes\n\nfor the state of Israel.\n\nThe US is one of the first countries\n\nto recognize the state of Israel.\n\nThe question is right,\n\nthat something does change in the 1960s\n\nwhere the alliance between the United States and Israel\n\nbecomes much stronger.\n\nAnd I would say a big part of that is the Cold War.\n\nDuring the Cold War where the US\n\nis locked in the struggle with the Russians,\n\nwe're looking for allies around the world.\n\nAnd in that point in time,\n\nthe Arab countries didn't look like great allies.\n\nThe oil-producing countries\n\nof the Persian Gulf were definitely pro-American.\n\nBut then you had countries like Egypt, Syria, Iraq,\n\nwhere they were much more naturally-aligned\n\nwith the Soviet Union,\n\nboth because they were kind of leftist in their orientation,\n\nbut also because they saw the United States\n\nas the successor to the former imperial powers,\n\nwhereas the Soviets talked about ending colonialism\n\nand liberating the peoples of the global South.\n\nIsrael, in contrast,\n\nlooks like a natural ally of the United States.\n\nCulturally, there are similarities\n\nbecause so many Jewish people came from the West.\n\nThere's a large Jewish community in the United States,\n\nand the state of Israel at that time,\n\nunlike any of the Arab countries, was a liberal democracy.\n\nHere's a question from the AskMiddleEast subreddit.\n\nWhat is Israel's main goal with invading other countries?\n\nWould the Middle East be more peaceful without them?\n\nThe Israelis actually fight for wars against the Arabs.\n\nThe first is the War of Independence in 1948,\n\nwhich the Palestinians called the Nakba or the catastrophe.\n\nThe end of that war results in the map\n\nof Israel looking like this.\n\nThe Jewish state has captured all\n\nof the green territories except for this actually,\n\nthis is the Golan Heights,\n\nand this territory here, the Gaza Strip is controlled\n\nby Egypt and this territory here\n\nat the West Bank of the Jordan River, including Jerusalem,\n\nis captured by the kingdom of Jordan.\n\nThen there was a war in 1956\n\nin which Gamal Abdel Nasser,\n\nNasser as he's called in America,\n\nhe nationalized the Suez Canal.\n\nAnd so the British and the French,\n\nwith the connivance of the Israelis, attack Egypt.\n\nThey are eventually pushed out\n\nbecause the United States sides with the Egyptians.\n\nThen in 1967, Israel launches a preemptive war\n\nagainst its Arab neighbors,\n\nand that's because Nasser,\n\nthat dictator in Egypt was saber-rattling.\n\nHis rhetoric was always very bellicose.\n\nHe talked about throwing the Jews into the sea.\n\nSo the Israelis would say in 1967,\n\nthe reason we quote, Invaded other countries\n\nis because we were facing a threat\n\nfrom those other countries.\n\nAt the end of that war,\n\nthey had captured not just the Gaza Strip,\n\nthey captured the entire Sinai Peninsula from Egypt.\n\nThey captured the West Bank from Jordan,\n\nand they captured the Golan Heights from Syria.\n\nIt wasn't until 1973 when the Egyptians launch\n\nan attack on the Israelis\n\nin order to recapture the Sinai Peninsula,\n\nthat the Israelis lose Sinai ultimately\n\nas a result of a peace deal\n\nthat they make with the Egyptians.\n\n1982, the Israelis invade Lebanon\n\nbecause the Palestinian resistance movement\n\nhad relocated to Lebanon,\n\nand was launching cross border raids against Israel.\n\nThe general rationale\n\nthat Israeli security analysts will give you\n\nis that all of these cross-border conflicts\n\nthat Israel is involved in are in order to fend off attacks,\n\nthat even includes the war in Gaza.\n\nHamas uses their control of Gaza\n\nto launch rockets in Israel,\n\nand then when October 7th happened,\n\nthat too is another reason\n\nwhy the Israelis say they have to wage this war.\n\nThere's lots of people who point to the conflict\n\nbetween Arabs and Israel\n\nas the main source of conflict in the region.\n\nIt's a major source of conflict,\n\nbut it's not the only conflict in the Middle East.\n\nAnd you ask this question,\n\nwould the Middle East be more peaceful without them?\n\nThe natural answer to is to say,\n\nwell, why stop at the Israelis?\n\nThe Middle East could be a lot more peaceful,\n\nthe world could be a lot more peaceful\n\nif there weren't any people.\n\nWhere you have people, you have conflict.\n\nHere's a question from Playful_Interview753.\n\nWhy the heck are the Saudis building a futuristic city\n\nin the middle of the desert?\n\nThe question is referring to a city\n\nthat the Saudis are building that is called NEOM.\n\nThis is supposed to be a futuristic city\n\nwith beaches that have glow-in-the-dark sand,\n\na hundred mile long linear skyscraper.\n\nOne of the ambitions that the Saudis have\n\nis to really establish their country\n\njust like their neighbors in the Emirates did\n\nas an attractor for global talent.\n\nThe Saudi Arabia that I grew up in\n\nwas a very conservative society.\n\nSo when I was growing up in Saudi Arabia in the 1980s,\n\nwomen weren't allowed to drive.\n\nWomen had to wear concealing black garments\n\nwhen they went outside.\n\nAnd if you were unlucky enough to be caught outside\n\nduring prayer time and you didn't go to the mosque,\n\nthere would be religious police who would strongly suggest\n\nthat you go and pray in the mosque.\n\nThe current crown prince of Saudi Arabia,\n\nMohammed bin Salman, is trying to change this.\n\nAnd so this project of building this big glitzy city\n\nis an attempt to signal very powerfully\n\nthat Saudi Arabia has changed\n\nand the new Saudi Arabia has arrived.\n\nHere's a question from the Afghanistan subreddit.\n\nWhy does the Taliban wanna stop women from doing anything?\n\nSo the Taliban are the religious fanatics\n\nwho currently run Afghanistan.\n\nThey adhere to a particularly puritanical brand of Islam\n\nthat believes that women's place is in the home\n\nand not experiencing equal status with men.\n\nThis is a problem most acute in Afghanistan,\n\nbut we see it to greater and lesser extent\n\nthroughout the Middle East\n\nand indeed throughout the Muslim world.\n\nLots of people will point out\n\nthat in most commonly-accepted understandings\n\nof Islamic law, women are recorded a subordinate status.\n\nThey may not be as extreme as the Taliban,\n\nbut for example, one aspect of Islamic law says\n\nthat women should get less inheritance than men.\n\nThe testimony of women in court\n\nis worth less than the testimony of a man.\n\nI personally don't feel that there's anything within Islam\n\nthat is inimical to equality for women,\n\nbut lots of conservative Muslims don't think that way.\n\nThis is from the Explainlikeimfive subreddit.\n\nExplain like I'm five,\n\nthe difference between kosher and halal.\n\nKosher is the dietary regulation followed\n\nby adherent Jews,\n\nand halal is a set of dietary regulations followed\n\nby Muslims.\n\nThere's lots of similarities between the two.\n\nKosher, you don't eat anything that has to do with a pig.\n\nThe same in Halal.\n\nThere's some areas where halal goes further than kosher.\n\nSo for example, in Islam,\n\nit is not halal to consume alcohol,\n\nwhereas it is kosher to consume alcohol for Jews.\n\nAnd there are other areas\n\nwhere kosher goes a lot further than halal.\n\nSo for example, in kosher dietary laws,\n\nyou're not allowed to mix meat and milk.\n\nIn Islam, there's no such restriction.\n\nSo a Muslim can have a cheeseburger, an adherent Jew cannot.\n\nIn Judaism, for example,\n\nyou're not allowed to eat shellfish.\n\nMost Muslims think eating shellfish is totally fine.\n\nOne of the reasons they overlap is because Islam,\n\nlike Christianity, descends from Judaism.\n\nThere's all kinds of ways\n\nin which you can observe\n\nthe practice of contemporary Muslims,\n\nand see how it's so similar\n\nto the practice of contemporary Jews.\n\nFor so many hundreds of years,\n\nIslam and Judaism develop together.\n\nWhen the Muslims dominated Spain,\n\nJews and Arabs created their individual religious laws\n\nin conversation with each other.\n\nAnd that period of cooperation\n\nand that common genealogy is what makes\n\nthe conflict between Muslims and Jews today\n\nso much more tragic,\n\nbut it's also what gives me a little bit of hope\n\nthat one day they'll be able to transcend it.\n\nI gotta say, those are some\n\nof the toughest questions I've ever faced.\n\nThat's probably tougher than the toughest Harvard classroom.\n\nThank you for watching Middle East Support.\n\n[logo chiming]",
  "authors": [
    "Condé Nast"
  ],
  "url": "https://www.wired.com/video/watch/tech-support-harvard-professor-answers-middle-east-questions"
}