{
  "title": "All's Fair to Stranger Things: 10 of the best TV shows to watch this November",
  "text": "2. All's Fair\n\nKim Kardashian stars in producer Ryan Murphy's latest series as a divorce lawyer who leaves a male-dominated firm to start her own all-female company. In reality, Kardashian recently completed a law-school alternative course of study. So far so meta. This wouldn't be a Murphy series without a lot more glamour and melodrama than real life, though, and All's Fair seems a lot like his Feud franchise, full of backbiting and delicious snark. Murphy has called on an all-star cast, many along with Kardashian (American Horror Story) familiar from his other shows, including Naomi Watts (Feud: Capote vs the Swans) and Sarah Paulson (another American Horror Story). Glenn Close and Niecy Nash-Betts play members of the new firm, and Brooke Shields and Jennifer Jason-Leigh guest star as clients. The characters have soap-opera-ready names like Allura, Liberty, Emerald and Carrington, and the most striking wardrobes and longest nails in the legal profession. Murphy really knows how to work his formula: the show's trailer has had more than 44 million hits on YouTube in just a few weeks.\n\nAll's Fair premieres 4 November on Hulu in the US and Disney+ in the UK\n\nPeacock (Credit: Peacock)\n\n3. All Her Fault\n\nSarah Snook, far from her role as the conniving Shiv in Succession, plays Marissa Irvine, the successful owner of a finance company and mother of a five-year-old. She arrives to pick him up from a play date, but she seems to have been given a wrong address, and little Milo is nowhere to be seen. That is the start of this mysterious series, which has enough fault, guilt and suspicion to cover its many characters. Jake Lacy plays Marissa's husband, Peter, and Abby Elliott (The Bear) and Daniel Monks are his siblings. Dakota Fanning plays the mother who supposedly set up the play date but says she never did, and Jay Ellis is Marissa's business partner. This is not the kind of show that questions Marissa's sanity. Instead, episode by episode, a different member of this close-knit circle stands out as suspicious. Michael Peña plays a detective on the case, who in an enticing early flash-forward looks at photographs of the whole group and says, \"I honestly didn't see this coming. These nice people killing each other.\"\n\nAll Her Fault premieres 6 November on Peacock in the US, and on 7 November on Sky and NOW in the UK",
  "authors": [],
  "url": "https://www.bbc.com/culture/article/20251027-10-of-the-best-tv-shows-to-watch-this-november"
}