{
  "title": "‘Harlem has always been evolving’: inside the Studio Museum’s $160m new home",
  "text": "Call it the second Harlem renaissance. On Manhattan’s 125th Street, where a statue of Adam Clayton Powell Jr strides onwards and upwards, and a sign marks the spot where a freed Nelson Mandela dropped by, there is bustle and buzz.\n\nThe celebrated Apollo Theater is in the midst of a major renovation. The National Black Theatre is preparing to move into a $80m arts complex spanning a city block. In September the National Urban League opened a $250m building containing its headquarters, affordable housing and retail space with New York’s first civil rights museum to come.\n\nAnd a flag flies high above the pavement of 125th Street. It is the Stars and Stripes, reimagined by the conceptual artist David Hammons in black, red and green, inspired by the Pan-African flag adopted by Marcus Garvey in the 1920s. The installation welcomes visitors to the charcoal, grey and glass facade of the reborn Studio Museum in Harlem.\n\nOn Saturday the museum – which owns more than 9,000 objects by over 800 artists of African descent – will inaugurate a purpose-built $160m home. Designed by Adjaye Associates with Cooper Robertson as executive architect, the 82,000-sq-ft, seven-floor facility is the first building created expressly for the institution’s mission and almost doubles its exhibition and programme space.\n\nIts arrival feels pointed in the first year of Donald Trump’s second presidency with diversity, equity and inclusion initiatives, Smithsonian Institution museums and the way Black history is told all under attack. New York has just elected a mayor who personifies the city’s cultural diversity and Harlem has a gift for making renaissance look like resistance.\n\n“This building says to the world: Harlem matters; Black art matters; Black institutions matter,” Raymond J McGuire, chairman of the board of trustees, said at a media preview last week. “It will stand as a lighthouse on 125th Street, a space where creativity and community meet, where young people can see themselves reflected and artists of African descent can continue to shape our history.”\n\nView image in fullscreen Photograph: Albert Vecerka/Esto\n\nThe Studio Museum was founded by artists, activists, philanthropists and local residents to “be a place where art happens” and address the systemic exclusion of Black artists from mainstream institutions. It opened in a rented loft above an off-licence on upper Fifth Avenue in 1968, a traumatic year of assassinations, uprisings and social change.\n\nMcGuire reflected: “This moment feels like what it must have felt like when it all began. The museum was born in a world of flux. The country was divided. People were marching. Artists were demanding to be seen and heard. There was tension but there was also vision.\n\n“Out of that vision came the Studio Museum in Harlem, built by artists and activists who believed that art could be a force for justice, for connection, for our humanity itself. Now, more than a half a century later, we find ourselves in another pivotal time, one that echoes the same mix of uncertainty and determination. The issues are different in form but not in substance.”\n\nThe Studio Museum’s former home was a 1914 bank building, acquired in 1979 and reopened in 1982. While beloved, it was a classic example of “adaptive reuse” – a structure never truly intended to be a museum. Its physical constraints directly hampered the institution’s work.\n\nThere was no loading dock, forcing priceless artworks to be unloaded on the busy street. There was no big elevator, making the movement of large-scale pieces a daunting logistical challenge. Crucially, public access was restricted, with less than half of the building open to visitors.\n\nDespite producing historically significant programmes for decades, the museum was working within a space that could not contain its aspirations. Building a new one was a 14-year project. The new structure, said long-serving director and chief curator Thelma Golden, allows the institution to exist within “a full expression of our ambition and aspirations as a museum”.\n\nView image in fullscreen The Studio Museum in Harlem. Photograph: Albert Vecerka/Albert Vecerka/Esto\n\nGolden led a fundraising effort that netted more than $300m from individuals, corporations, foundations and the City of New York. But construction was hampered by the coronavirus pandemic and dragged on for seven years. Further complications arose when a scandal engulfed the museum’s star architect, Sir David Adjaye, prompting his quiet withdrawal from the project and leaving curators and the remaining design team to step up.\n\nIt is worth the wait. The facility includes galleries, an expansive lobby, flexible programme spaces, a dedicated education workshop, a cafe and shop and a rooftop terrace with panoramic city views. A monumental stair, clad in terrazzo, occupies the central vertical gallery, connecting the lower level to the fourth floor and offering lookout points. The design, including engineered wood and polished concrete, echoes the masonry-framed windows of local apartment buildings and the top-lit interiors of neighbourhood churches.\n\nPascale Sablan, chief executive of Adjaye Associates New York, described the vision for the new building as a “re-imagining of Harlem’s own vernacular architecture”. This is achieved through a “reverse stoop”, which inverts the signature feature of Harlem’s brownstone houses to create a grand, tiered public common for gathering; the “sanctuary”, evoked in the soaring, arched ceilings of a gallery; and the entire building conceived as a “stage” for elevating the work of Black artists.\n\nThe inaugural programming reflects the museum’s past, present and future with four major exhibitions. One is the first institutional career survey of Tom Lloyd, the pioneering artist whose electronic light sculptures appeared in the museum’s inaugural 1968 exhibition, Electronic Refractions II.\n\nThere is a rotating exhibition drawn from the museum’s permanent collection. The opening installation features nearly 200 works spanning from the 19th century to the present. Over the course of the year, more than 300 will be displayed.\n\nHighlights range from the historic to the contemporary. William T Williams’s 1969 abstract Trane pays homage to John Coltrane, while Kerry James Marshall’s Silence Is Golden (1986) confronts invisibility and Black representation in art. Malvin Gray Johnson’s Harlem Renaissance-era Swing Low, Sweet Chariot (1928-29) and Barkley L Hendricks’s Lawdy Mama (1969) showcase how Black artists blended European modernism with African American cultural narratives.\n\nView image in fullscreen From Now: A Collection in Context (installation view), 2025. Photograph: Kris Graves\n\nJean-Michel Basquiat’s Bayou (1984) is a white canvas overlaid with vigorous marks, fragments of collage, schematic diagrams, handwritten notations and bold colour accents. Faith Ringgold’s first story quilt, Echoes of Harlem (1980), captures her neighbourhood in both celebratory and elegiac tones.\n\nUpstairs, thematic galleries explore city life, abstraction and spirituality, featuring works from Jacob Lawrence, Jordan Casteel, Lorraine O’Grady, Betye Saar and Rosana Paulino among others.\n\nThe museum also celebrates its influential artist-in-residence programme with an alumni show including Renée Green, Kehinde Wiley, Mickalene Thomas and Titus Kaphar. The display combines new commissions with historical pieces from Valerie Maynard’s 1973 print 3 A.M. 125th Street to contemporary woven self-portraits by Qualeasha Wood.\n\nAmong new commissions are Camille Norment’s Untitled (heliotrope), a monumental sonic and sculptural installation on the terrace staircase, composed of handwoven brass wires and tubes and featuring a chorus of voices.\n\nChristopher Myers’s Harlem Is a Myth is a wall-mounted, metal-based installation that depicts an intergenerational community of fantastical figures from Harlem’s history, including a centaur Kareem Abdul-Jabbar and winged jazz legends Thelonious Monk and Count Basie.\n\nAnd seven bronze time capsules created by Houston Conwill that contain confidential testaments by seven distinguished Black Americans, originally buried in the museum’s sculpture garden in 1984, are now on display. The capsules will be opened in September 2034, 50 years after their creation.\n\nView image in fullscreen Houston E Conwill – The Joyful Mysteries (1984) (installation view), 2025. Photograph: Albert Vecerka/Esto\n\nVisitors will find an archival presentation of photographs and ephemera that documents the museum’s history through its exhibitions, events and programmes over nearly six decades.\n\nIt is a rich history that includes a visit by the monarch of the Ashanti of Ghana in 1984, a performance in the sculpture garden by choreographer Bill T Jones in 1993 and a newspaper report from 1978 that laments a faulty boiler: “If you walk into the Studio Museum in Harlem and find the staff all bundled up in hats and coats, mufflers and gloves, it’s not because they’re ready to walk out. It’s because there is no heat and they are cold.”\n\nIn an interview in museum offices, Golden, who began her career in 1987 as an intern at the Studio Museum and became director in 2005, said its founders were not only responding to the urgency of their time but consciously looking back to the Harlem Renaissance, seeking to tie the new institution to that profound legacy.\n\n“Harlem has always been evolving,” she said. “This is a neighbourhood that has been evolving since it was established right here as upper Manhattan, as a place people began to live. But Harlem has also been a neighbourhood where Black culture has thrived.”",
  "authors": [
    "David Smith"
  ],
  "url": "https://www.theguardian.com/culture/2025/nov/11/harlem-studio-museum-new-home"
}