{
  "title": "New images show engine flying off before UPS cargo plane crash",
  "text": "New images show engine flying off before UPS cargo plane crash\n\nThe plane never got more than 30ft (9.1m) above ground, the report said, narrowly clearing the runway before parts of it hit the roof of a nearby UPS warehouse.\n\nThe plane was departing Louisville, Kentucky and headed towards Hawaii before it crashed, leaving 14 people dead and 23 others injured on 4 November.\n\nThe frame-by-frame images released by the National Transportation Safety Board in its report show the engine flying off and appearing to smash into the fuselage as the aircraft lifts off the ground.\n\nThe engine of a UPS cargo plane came off its wing before exploding into flames during takeoff, newly released photos from a federal investigation into the deadly crash earlier this month show.\n\nThe NTSB's preliminary report noted \"fatigue cracks in addition to areas of overstress failure\" around one of the plane's engine mounts on the left wing.\n\nThe bearing that helps secure the connection was also found to have suffered a fracture, the report added.\n\nAt the time of the accident, the plane had accumulated a total time of about 92,992 hours and 21,043 cycles, the report said.\n\nA special detailed inspection of the plane's mounts and other parts would have been due at 29,200 cycles, but airplane records showed the \"tasks had not been accomplished\".\n\nThe plane was carrying tens-of-thousands of gallons of fuel when it crashed, making it appear as if it was \"raining oil\", one local official said.\n\nAs a result, an initial shelter-in-place order was issued for within five miles of the airport over concerns of further explosions and air pollution.\n\nAmong the 14 dead, three were crew members aboard the airplane and 11 were people on the ground.\n\nKentucky Governor Andy Beshear declared a state of emergency at the time, calling on the help of the Kentucky National Guard.\n\nAn investigation remains ongoing, officials said, including examinations of the recovered cockpit flight recorder and the flight data recorder, known as the black box, which has been removed to a secure facility.",
  "authors": [],
  "url": "https://www.bbc.com/news/articles/cvg7gy4rp9mo"
}