{
  "title": "The Saragossa Manuscript review – cult Polish period-costume comedy is outrageous head-spinner",
  "text": "This epic picaresque comedy from 1965 is a head-spinning period-costume adventure of 18th-century Spain from Polish film-maker Wojciech Has. It is a surrealist film whose surrealism resides not merely in the bizarre parched landscape of the Sierra Morena mountain range with its bleached skulls, hanged bandits, crows and mysterious inns in which seductive encounters are to be had, but also simply in the bewildering juxtaposition of individual tales and anecdotes, stories which grow out of each other. The surrealist effect (and the comedy) is in the jolt from one micro-narrative to the other, and the realisation that the overall story is thwarted and undermined.\n\nThe premise is that in the Spanish town of Saragossa during the Napoleonic wars, one officer tries to arrest another, who is apparently reading an old book – but is then distracted by the fact that this book is about his own grandfather, the nobleman Alfonse Van Worden. (Later we discover that the passages about this grandfather have been added by hand, in pen-and-ink, hence Saragossa Manuscript.) Then we flash back to this preening aristocrat-soldier himself, played by prominent Polish actor Zbigniew Cybulski.\n\nWhile travelling on horseback through the wilderness in the blazing heat, Alfonse encounters a grim gallows with two dead men, and has an erotic interlude with two Muslim princesses who require him to convert. Is it a dream? We get another flashback showing the life of Alfonse’s father, a proud blueblood and insatiable duellist, Alfonse is later arrested by the Spanish Inquisition – which he didn’t expect – and encounters a hermit, a scholar of the occult and a mathematician, tale-tellers and raconteurs all, and a stylish Gypsy in whose own reams of garrulous stories Alfonse’s father is to reappear.\n\nIt is pure narrative chaos, a kaleidoscope in which meaning and resolution always appear to be just around the corner or just over the horizon. The Saragossa Manuscript is like Cervantes or Borges, but also very much like Alejandro Jodorowsky (those hanged men and princess are like the tarot cards beloved by Jodorowsky) and Terry Gilliam. The farcical encounters could be sketches by Monty Python or even plays by Mr Ernie Wise. And it is all shot on crisp, clean monochrome which makes watching it feel like binging on dozens of episodes of some cult countercultural TV comedy from 1960s Poland.\n\n“I no longer know where reality ends and fantasy begins,” whimpers Alfonse at one point. The thing to be savoured about The Saragossa Manuscript is its lack of irony and self-awareness; there is a kind of innocence and even refinement in the drama, even as it outrageously swerves off the beaten track of conventional storytelling.",
  "authors": [
    "Peter Bradshaw"
  ],
  "url": "https://www.theguardian.com/film/2025/nov/19/the-saragossa-manuscript-review-cult-polish-period-costume-comedy-is-outrageous-head-spinner"
}