{
  "title": "Come le proboscidi delle zanzare della febbre gialla sono diventate mini-ugelli per la stampa 3d di tessuti biologici",
  "text": "Persino le zanzare sembrano avere qualche aspetto positivo. Sono fastidiose – è vero – e le malattie che trasmettono uccidono ogni anno quasi un milione di persone. Ma in futuro potrebbero aiutare a salvare vite, creando organi e tessuti per i trapianti, e molto altro. Merito della loro proboscide: un apparato sottilissimo specializzato per succhiare il sangue, ma perfetto anche come ugello per una nuova, rivoluzionaria, tecnica di bio-stampa 3D, appena descritta da uno studio pubblicato su Science Advances.\n\nA sviluppare la nuova stampante ibrida è stato un team di ricercatori guidati dall’ingegnere meccanico Changhong Cao, della McGuill University di Montreal. Tutto nasce – spiegano – dal desiderio di realizzare una stampante capace di lavorare su strutture microscopiche. Gli ugelli commercialmente disponibili non scendono sotto un diametro di stampa di 35 micrometri, e hanno costi esorbitanti (oltre 80 dollari a ugello). Per questo, i ricercatori canadesi hanno deciso di volgere l’attenzione al mondo naturale, un approccio definito “ingegneria bioibrida”, che consiste nell’integrare strutture biologiche in apparati altrimenti artificiali.\n\nUno dei ricercatori più giovani, lo studente Justin Puma, è stato incaricato di studiare il mondo animale alla ricerca di una struttura adatta. E dopo aver scartabellato per settimane tra pungiglioni di scorpione, zanne di serprente, e una miriade di altre appendici cave sviluppate dall’evoluzione, ha trovato quello che cercava: la proboscide delle femmine di Aedes aegypti, zanzare originarie dell’Africa e vettore di malattie come Dengue, Zika, febbre gialla e chikungunya.\n\nLe dimensioni ridotte della proboscide, e la struttura particolarmente rigida sviluppata da questa specie, permettono di sfruttarla come ugello di stampa con un dettaglio che raggiunge i 20 micrometri. Lavorando alla loro nuova tecnica di biostampa, i ricercatori sono arrivati a produrre sei ugelli-proboscide l’ora, per un costo di circa un dollaro l’uno.\n\nLe proboscidi sono quindi state integrate in un normale apparecchio per la stampa 3d, e hanno dimostrato di funzionare perfettamente come ugelli, e di possedere anche una notevole resistenza: nei test dei ricercatori canadesi, in due settimane di utilizzo si guasta appena il 30% delle proboscidi utilizzate. La stampante è stata sperimentata con un bio-inchiostro noto come Ploronic F-127, con cui è possibile stampare strutture biologiche da utilizzare come impalcature per creare vasi sanguigni e altri tessuti del nostro organismo. E per questo, la nuova tecnica di stampa – battezzata dai suoi inventori “necrostampa” – potrebbe aiutare in futuro a ottenere tessuti e organi biologici artificiali, da utilizzare per i trapianti e per altre applicazioni di medicina rigenerativa.",
  "authors": [
    "Simone Valesini"
  ],
  "url": "https://www.wired.it/article/zanzare-aedes-aegypti-proboscidi-mini-ugelli-stampa-3d-tessuti-biologici/"
}