{
  "title": "Erin Jackson On Eczema & Beauty Expectations For Athletes",
  "text": "When Erin Jackson steps into the rink, she’s both fierce and joyful, all but melting the ice with her sunny disposition. The professional speed skater and Olympic gold medalist is magic to watch in action — but it’s her ability to shift the narrative around female athletes and perfection that’s worth paying attention to.\n\nJackson might not be who you’d expect to see in the elite speed skating space, even in 2025. Born in Ocala, Florida, Jackson tried her hand at figure skating when she was young but quickly pivoted after discovering her love of speed. She went on to compete in roller derby, a sport where only 11% of participants identified as people of color, before setting her sights on an Olympic medal.\n\nCompeting at this level is only half the battle for many female athletes, who are held to an array of unreasonable standards. There are respectability politics; Black women athletes, in particular, are expected to be gracious and restrained even when the situation calls for big reaction. There’s also their continuous fight for fair compensation.\n\nAdvertisement\n\nAnd then there are the unreasonable physical expectations female athletes face. They’re either not strong enough or so strong that they’re called “masculine” (as a flaw, of course). They’re expected to be attractive to everyone, with a beaming white smile, toned and tight muscles, and skin so smooth that it’s poreless in HD.\n\nThis expectation of perfection is a cloud that even Jackson, who has an incredibly positive attitude, can’t escape. Jackson manages eczema, also known as atopic dermatitis, a common yet chronic skin care condition characterized by itchy, inflamed and dry skin. And while the condition affects 3% to 10% of adults (it’s even more prevalent in Black Americans), managing it as a person who is in the public eye can be challenging.\n\n“It can be tricky sometimes because it’s a physical thing,” Jackson explains. “You can feel it, you can see it, other people can see it.”\n\nAdvertisement\n\nDespite the unwanted visibility of it all, managing eczema has taught Jackson about how to listen to and care for her body more intentionally. It’s also instilled a renewed resilience and sense of control, both on and off the ice.\n\n“I can shut off things, whether physical or not, that I’m dealing with when it’s time for me to perform,” she explains, when I sit down to chat with her at a press event hosted by partner Eli Lilly. “I do it every day. But as I’ve gotten more treatment and guidance from my doctors, it’s been something that I can learn from and grow from.”\n\nWhen she was first diagnosed, Jackson struggled to find relief, especially because some of her practice gear irritated her skin further. “It was a journey, speaking with my doctors and trying to figure out a solution for it,” she says. “I’ve been a lot more diligent about keeping my skin hydrated.”\n\nAdvertisement\n\nFor Jackson, the condition goes more than skin deep. It’s a means of connection to those who may be struggling without a support system, feeling self-conscious or perhaps guilty that they might be to blame for having eczema — which is a hurtful misconception.\n\nAnd so, she talks about her struggle publicly so others, especially Black women, with eczema can feel less stigmatized. It’s a responsibility Jackson takes seriously and perceives positively, she tells me. “It doesn’t feel like a burden. If I’m able to get the word out, whether about my sport or my skin condition, I’m very willing and ready to help point people in the right direction and let them know it’s a common thing,” she says.\n\nEczema can be exacerbated by high stress, to which Jackson can attest. After initially not qualifying at the U.S. Olympic trials, Jackson credits fellow speed skater Brittany Bowe for giving up her spot so she could compete. It was well deserved, as Bowe noted, as the sport has a stark disparity in Black participants as compared with their white counterparts. For many, the pressure could easily cause a crack in the gentle ice that is the human ego, but for Jackson it only makes her stronger.\n\nAdvertisement\n\nThere will always be stress. There will always be unrealistic expectations of how women present themselves when they’re showcasing their extraordinary talents on the court, field or ice rink. But Jackson tells me she can take the pressure.\n\nAnd she wants to encourage others like her to bet on themselves, stay strong in who they are, and treat their “flaws” as just another part of their identities. “I understand that it’s a physical and uncomfortable and nerve-wracking thing for people, but I don’t put too much weight on it,” she explains. “I just try to focus on my skating, my training and hope it doesn’t slow me down too much.”",
  "authors": [
    "Contributing Writer"
  ],
  "url": "https://www.huffpost.com/entry/erin-jackson-speed-skater-eczema-beauty-expectations_n_69138e69e4b0c374cf51485b"
}