{
  "title": "The WIRED Reviews Team’s Amazon Prime Day Picks",
  "text": "Transcript\n\nMy Amazon Prime Day pick is the Ultimate Ears Boom 4.\n\nThis near indestructible Bluetooth speaker feels like a\n\nsteal at $50 off its $150 regular price point.\n\nIt's not quite as punchy as the JBL Flip 7,\n\nbut it's got a wider sound stage and smoother sound overall.\n\nGreat battery life, plenty of features\n\nand impressive Bluetooth range to round things out\n\nfor a sweet portable package.\n\nSo my Amazon Prime Day pick is a simple one.\n\nIt's this, the M4 MacBook Air,\n\nthe one that came out earlier this year,\n\nand a big reason for that is the price.\n\nIt's consistently on sale.\n\nRight now, you can buy it for just $850,\n\nand that makes it one of the best laptops\n\nto ever be sold at that price.\n\nI mean, don't get me wrong, there are other Windows laptops\n\nout there right now that serve as good alternatives,\n\nbut when you compare them side by side,\n\nthe M4 MacBook Air really is the best laptop\n\nyou can buy right now.\n\nIf you don't already have one, go pick one up.\n\nMy top pick would be the Bedsure Bamboo Cooling Sheets.\n\nI bought these on a whim on Amazon one day,\n\nand it's one of the best purchases I've\n\never made on the site, full stop.\n\nThey're on par with much more expensive sheets\n\nthat I've tried, but for much less.\n\nPlus, they're silky, cooling and pretty durable.\n\nMy Amazon Prime Day pick is the Echo Spot.\n\nThis adorable little speaker sits right in\n\nbetween being a smart display\n\nand a smart speaker with a two inch screen\n\nthat can show a fun clock face, plus things like icons\n\nfor the weather, your calendar,\n\nand even the name of the song you're currently playing.\n\nIt's perfect for folks who don't want all the bells\n\nand whistles of a full smart display.\n\nI really like it as a bedside clock,\n\nbut it's great on a desk or anywhere else too.\n\nThe Petlibro Granary Smart Camera Feeder is our\n\npersonal favorite feeder.\n\nIt's reliable, tech savvy\n\nand highly customizable.\n\nIt's controlled via an app and dispenses food,\n\nbased on the feeding schedules that you create.",
  "authors": [
    "Condé Nast"
  ],
  "url": "https://www.wired.com/video/watch/the-wired-reviews-teams-amazon-prime-day-picks"
}