{
  "title": "24 Easy and Cheap(ish) Date Night Recipes That Are Fancy and Fun",
  "text": "Advertisement\n\n24 Easy and Cheap(ish) Date Night Recipes That Are Fancy and Fun Make shrimp scampi, mushroom risotto, chocolate lava cake and more restaurant-worthy dishes at home. Credit... Christopher Testani for The New York Times. Food Stylist: Simon Andrews.\n\nDate night doesn’t have to mean reservations, crowded restaurants and a huge bill. You can make a night at home feel special with some mood lighting (dimmers! candles!) and delicious food. These easy recipes come together in an hour or less, and are guaranteed to impress without spending a fortune.\n\nCredit... David Malosh for The New York Times. Food Stylist: Simon Andrews.\n\nGarlic, white wine, butter and shrimp make fast friends in Melissa Clark’s five-star megahit (the recipe has over 17,000 ratings and counting). It comes together in 15 minutes, meaning less time in the kitchen and more time enjoying each other’s company.\n\nRecipe: Classic Shrimp Scampi\n\nAdvertisement\n\nCredit... Armando Rafael for The New York Times. Food Stylist: Brett Regot.\n\nI mean … what a recipe title! Eric Kim’s 30-minute take on marry me chicken is the cozy weeknight fish you cook to say “I love you.” Crisp-skinned salmon sits atop a creamy sun-dried tomato sauce with crushed red pepper and dried oregano. Serve with crusty bread or your favorite pasta to sop up that dreamy pink sauce.\n\nRecipe: Marry Me Salmon\n\nCredit... Armando Rafael for The New York Times. Food Stylist: Brett Regot.\n\nMake this cozy French bistro dish at home for a fraction of the price. Alexa Weibel’s recipe begins with a piece of beef that is crusted in crushed peppercorns and ends with a glossy, peppery Cognac pan sauce. Instead of two individual fillets, she calls for one large rib-eye steak which is more affordable, more flavorful and easier to cook.\n\nRecipe: Steak au Poivre for Two\n\nCredit... Ryan Liebe for The New York Times. Food Stylist: Simon Andrews.\n\n“So scrumptious! Easy and quick to prep. Had fun making it together just before we sat down to Valentine’s dinner. 40 years married. Cooking fun meals keeps it interesting!” one reader wrote about Yossy Arefi’s 25-minute gooey chocolate cake.\n\nRecipe: Chocolate Lava Cake for Two\n\nAdvertisement\n\nCredit... Christopher Simpson for The New York Times. Food Stylist: Simon Andrews.\n\nThere are all kinds of date nights, and one of the best is the sweatpants-on-the-couch-and-watch-a-movie date night. Enter: Pati Jinich’s incredible nachos featuring bricklayer-style beef, or puntas al albañil, a traditional Mexican taco filling made of beef, bacon and chorizo in a chunky fire-roasted salsa. Nothing says romance like fighting over the last chip.\n\nRecipe: Bricklayer-Style Nachos\n\nCredit... Michael Graydon & Nikole Herriott for The New York Times. Prop Stylist: Kalen Kaminski.\n\nAlison Roman’s quick lamb ragù comes together in 45 minutes using pantry staples and ground lamb (you could use pork or beef, too). The sauce is the warm, luxurious sauce you want paired with a long, thin pasta noodle or a bowl of polenta, and a glass of red wine. Whatever you decide, don’t skip the anchovies — they add a depth of flavor you’d otherwise get from a long simmer.\n\nRecipe: Quick Lamb Ragù\n\nCredit... Armando Rafael for The New York Times. Food Stylist: Cyd Raftus McDowell.\n\nThis 30-minute dish from Zainab Shah is perfect for when you want a sumptuous, meatless meal. Traditionally, roasted and crushed cashews are puréed with cooked onions and tomatoes, but this recipe offers a shortcut: cashew butter, which saves time and adds another layer of silky nuttiness to the dish. Serve with rice or roti.\n\nRecipe: Butter Paneer\n\nAdvertisement\n\nCredit... Rachel Vanni for The New York Times. Food Stylist: Spencer Richards.\n\nSamin Nosrat’s sherry-shallot vinaigrette, inspired by the dressing used on Via Carota’s insalata verde, is good on everything. Keep some stocked in the fridge at all times, and you can make any salad or vegetable instantly feel date-night fancy. It’s also great over roast chicken. (For more salad dressing wisdom from Samin, watch her Cooking 101 video!)\n\nRecipe: House Dressing\n\nCredit... Christopher Testani for The New York Times. Food Stylist: Simon Andrews.\n\nRisotto feels like one of those fancy dishes you eat only when dining out, but it doesn’t have to be! “I recently ate a good one at a high-end restaurant and wanted to see if I could make it. Oh yes, yes I can, and mine was even better than the restaurant,” one reader wrote about Martha Rose Shulman’s recipe. This is a satisfying, elegant meal that will have you and your date scooping up seconds.\n\nRecipe: Mushroom Risotto With Peas\n\nCredit... Christopher Testani for The New York Times. Food Stylist: Simon Andrews.\n\nCold, salty and effortlessly classy, a dirty martini is the perfect date night drink. Instead of using vodka or gin, Rebekah Peppler calls for a 50-50 mix of the two (as well as some vermouth and brine) for a fresher, crisper taste. Keep the drink classic with olive brine, or get creative with cornichon, pickled jalapeño, pickled tomato or preserved lemon.\n\nRecipe: Dirty Martini\n\nAdvertisement\n\nCredit... Linda Xiao for The New York Times. Food Stylist: Maggie Ruggiero. Prop Stylist: Andie McMahon.\n\nFun, inventive appetizers are part of what make dining out so exciting, but you can capture that same chef energy at home. This recipe from Raquel Villanueva Dang, the chef at Baby’s Kusina and Market in Philadelphia, is a great place to start. Grapes roasted with fresh thyme and salt are plated over whipped ricotta that’s drizzled with a salty-sweet glaze of balsamic vinegar, honey and fish sauce. Toast some sourdough bread and dig in.\n\nRecipe: Ricotta Toast With Roasted Grapes\n\nCredit... Craig Lee for The New York Times\n\nWith just five simple ingredients you probably already have on hand — cream, vanilla, salt, eggs and sugar — you can make your own silky custard with a crackly sugar top. While most recipes call for a propane torch, Mark Bittman’s version offers an easier solution: your oven’s broiler. If you really like your date, let them crack into it first.\n\nRecipe: Vanilla Crème Brûlée\n\nCredit... David Malosh for The New York Times. Food Stylist: Simon Andrews.\n\nWhen you want something warming and delicious, look no further than this mushroom soup from Sue Li. The broth is full of deep umami flavor, thanks to four powerful ingredients: soy sauce, sesame oil, scallions and shiitakes. Poached eggs — which always feel fancy but are easier than you think — add a lovely richness.\n\nRecipe: Somen Noodle Soup With Mushrooms\n\nAdvertisement\n\nCredit... David Malosh for The New York Times. Food Stylist: Simon Andrews.\n\nIf you’re celebrating something special, like a birthday or anniversary, consider splurging on a half-pound of scallops for Christian Reynoso’s five-star recipe, which pairs them with a crunchy, vibrant and herby bread-crumb salsa. The dish comes together in 30 minutes and feels weeknight easy, but looks and tastes fancy.\n\nRecipe: Scallops With Bread-Crumb Salsa Verde\n\nCredit... David Malosh for The New York Times. Food Stylist: Simon Andrews.\n\nAli Slagle’s 25-minute take on the Italian American classic uses lemon two ways: slices that are caramelized with the chicken, and a good squeeze of juice at the end for a zap of brightness. The buttery pan sauce with shallots, capers and the star citrus is neither too rich, nor too puckery. Serve with pasta or rice and something green, like kale salad or roasted broccoli.\n\nRecipe: Chicken Piccata\n\nCredit... Linda Xiao for The New York Times. Food Stylist: Barrett Washburne.\n\nEric Kim says that shichimi togarashi — a Japanese seven-spice blend featuring ground red chiles, roasted orange peel, black and white sesame seeds, sansho pepper, seaweed and often ginger — makes everything taste better. This 25-minute recipe proves that. Lime juice and a touch of soy sauce accentuate the citrusy, savory spice that gets reduced in a maple syrup pan sauce for pork chops.\n\nRecipe: Maple-Soy Pork Chops With Shichimi Togarashi\n\nAdvertisement\n\nA side shot of chocolate mousse in a blue teacup with a spoon resting on top. Credit... Sarah Anne Ward for The New York Times. Food Stylist: Maggie Ruggiero. Prop Stylist: Pamela Duncan Silver.\n\nWhip up restaurant-quality chocolate mousse in minutes with the help of a blender. This genius recipe from Monica Stolbach cooks the eggs and melts the chocolate at the same time: Crack eggs into the blender, add chopped dark chocolate, then pour in hot sugar syrup with the motor running. Once the mixture is smooth, let it cool and fold it into softly whipped cream. C’est magique!\n\nRecipe: Blender Chocolate Mousse\n\nCredit... Christopher Testani for The New York Times. Food Stylist: Cyd Raftus McDowell.\n\n“My wife loved it, and it strikes me as the perfect single guy meal to make for a date as it’s hard to mess up, but seems more complex than it is,” one reader wrote about Ali Slagle’s 25-minute one-pot pasta. Crisp prosciutto, sweet peas and cheese tortellini are bathed in a silky lemon cream sauce.\n\nRecipe: One-Pot Tortellini with Prosciutto and Peas\n\nCredit... Christopher Testani for The New York Times. Food Stylist: Simon Andrews.\n\nYou can still have a fun and flirty beverage, even if you’re not drinking alcohol. Take Rebekah Peppler’s NA dirty lemon tonic, which leans salty-sour thanks to preserved lemon muddled with fresh lemon and sugar. (If you’d like to make this nonalcoholic drink alcoholic, add a splash of vodka, gin or even limoncello.)\n\nRecipe: Nonalcoholic Dirty Lemon Tonic\n\nAdvertisement\n\nCredit... Christopher Testani for The New York Times. Food Stylist: Simon Andrews.\n\nCraving something a bit more elegant than baked potatoes? Try Lidey Heuck’s creamy, melt-in-your mouth fondant potatoes. (They’re French!) Seared in a hot pan, basted and then baked, Yukon Gold potatoes become creamy and fall-apart tender. They are precisely the showstopping side your dinner plate needs.\n\nRecipe: Fondant Potatoes\n\nCredit... Armando Rafael for The New York Times. Food Stylist: Cyd Raftus McDowell.\n\nTossed in thyme-infused brown butter, this cozy dish is the perfect balance of ease and elegance — ideal for a date night in. Carolina Gelen’s free-form dumplings call for just a handful of ingredients: a can of pumpkin purée, eggs, flour, Parmesan and grated nutmeg. There’s no kneading or resting required. You can go from cooking to eating to curling up on the couch together in under an hour.\n\nRecipe: Pumpkin Dumplings With Brown Butter and Parmesan\n\nCredit... Andrew Purcell for The New York Times. Food Stylist: Carrie Purcell.\n\nThis tender cake from Jerrelle Guy is worth adding to your date night rotation. The batter comes together with minimal effort — basic pantry ingredients and a handful of frozen or fresh berries — making it a year-round winning dessert. The final result is so jammy and gooey it’s best to serve the whole thing with a spoon. It’s also best to serve with ice cream. But you probably knew that already.\n\nRecipe: Strawberry Spoon Cake\n\nAdvertisement\n\nCredit... Ryan Liebe for The New York Times. Food Stylist: Victoria Granof.\n\nNaz Deravian’s 40-minute pasta can turn an ordinary night into something memorable. The addition of roasted artichoke hearts adds texture and pairs wonderfully with a zippy, silky five-ingredient sauce made of lemon zest, lemon juice, Parmesan, butter and basil. Canned or frozen artichokes are less work than whole fresh ones, and they roast beautifully.\n\nRecipe: Lemon Spaghetti With Roasted Artichokes\n\nCredit... Bryan Gardner for The New York Times. Food Stylist: Barrett Washburne.\n\nIn this 20-minute recipe, Melissa Clark offers another way to savor that garlicky broth left at the bottom of the bowl: canned white beans. First, the beans are braised in olive oil, garlic, rosemary and crushed red pepper until tender. Mussels are then added to the pot, releasing their briny liquid, which the beans soak up. Lemon zest and herbs are thrown in at the end for brightness. Serve with toasted bread.\n\nRecipe: Mussels With White Beans, Garlic and Rosemary\n\nFollow New York Times Cooking on Instagram, Facebook, YouTube, TikTok and Pinterest. Get regular updates from New York Times Cooking, with recipe suggestions, cooking tips and shopping advice.",
  "authors": [
    "Sharon Attia"
  ],
  "url": "https://cooking.nytimes.com/article/easy-date-night-ideas"
}