{
  "title": "Another fire breaks out at aluminum plant that supplies Ford",
  "text": "Another fire has broken out at the Novelis aluminum plant in Oswego, New York that supplies sheet metal for Ford’s trucks, including its all-electric F-150 Lightning.\n\nThe four-alarm fire started Thursday morning but is still burning. “Everyone who was working at the plant was safely evacuated,” Novelis told TechCrunch. “The fire is under control but crews are on site to make sure it’s fully extinguished.” Local news outlet CNY Central was the first to report the new blaze.\n\nThe Novelis plant suffered a major fire in September that stopped operations, and Ford has said the disruption would likely cost the automaker around $2 billion. Despite a second, smaller fire in October, the aluminum supplier had planned to restart production at the New York facility in December. (Stellantis and Nissan have also taken smaller hits to production as a result of the September fire.)\n\nFord had to scale back production of essentially all of its F-150 trucks following the September fire, as they have used aluminum body panels for years now. The automaker slowly started building those trucks again in October. But it was prioritizing the gas and hybrid versions over the F-150 Lightning, which executives are reportedly discussing discontinuing.\n\nIt’s not clear what impact the new fire will have on Ford’s plans. The company did not immediately respond to a request for comment. The Oswego Fire Department also did not immediately return requests for comment.\n\nThis story has been updated with new information from Novelis.",
  "authors": [
    "Sean O'Kane",
    "Sr. Reporter",
    "Sarah Perez",
    "Julie Bort",
    "Lorenzo Franceschi-Bicchierai",
    "Ram Iyer",
    "Connie Loizos",
    "Anthony Ha",
    "Rebecca Bellan",
    "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var"
  ],
  "url": "https://techcrunch.com/2025/11/20/another-fire-breaks-out-at-aluminum-plant-that-supplies-ford/"
}