{
  "title": "Memoirs, myths and Midnight’s Children: Salman Rushdie’s 10 best books – ranked!",
  "text": "“It makes me want to hide behind the furniture,” Rushdie now says of his debut. It’s a science fiction story, more or less, but also indicative of the sort of writer Rushdie would become: garrulous, playful, energetic. The tale of an immortal Indian who travels to a mysterious island, it’s messy but charming, and the sense of writing as performance is already here. (Rushdie’s first choice of career was acting, and he honed his skill in snappy lines when working in an advertising agency.) Not a great book, but one that shows a great writer finding his voice, and a fascinating beginning to a stellar career.\n\nRushdie’s love for pop culture – he was inspired to write his first story, aged nine, after watching The Wizard of Oz – was never more evident than in this rompy rewrite of Don Quixote that references Back to the Future, Disney’s Pinocchio, Beavis and Butt-Head, Starsky & Hutch and more. The eponymous character is driven mad by watching too much TV – but his story is itself being written by a washed-up spy novelist. In its layers within layers it’s as hyperactive as Grimus, but a bit more controlled. And even if Rushdie in this book is half-charming raconteur, half pub-bore, the energy will keep you bouncing merrily along.\n\nRushdie’s first novel for adults after The Satanic Verses prompted the supreme leader of Iran to issue a fatwa against him in 1989 was a dam bursting open to release all the pent-up ideas, characters and jokes of the previous six years. It’s the story of “Moor” Zogoiby, the ousted heir to a crooked spice dynasty and the youngest of four siblings: “Ina, Minnie, Mynah, Moor”. You can infer references to Rushdie’s ordeal (“Here I stand. Couldn’t’ve done it differently”), but mostly this is supreme, nutritious entertainment. It was shortlisted for the Booker prize and, because of Rushdie’s security needs, this meant – according to that year’s winner, Pat Barker – “lots of men with bulging armpits standing round”.\n\nComing soon after his great epic Midnight’s Children, Shame is overshadowed but one of Rushdie’s best. It’s shorter, tighter and somewhat darker than its predecessor. Set in “not quite Pakistan”, it delivers a satire of the country that is both over the top and deadly serious. Here, a diet of “honour” above all else leads to brutal killings, – “Shame is like everything else: live with it long enough and it becomes part of the furniture” – but there is typically glorious comedy too. Shame won a major prize in Iran for best translated novel of the year – so Rushdie had no inkling of the way the country’s leadership would respond to his next novel: The Satanic Verses.\n\nRushdie’s second memoir is about his attempted murder on stage in New York in 2022. “So it’s you,” he recalls thinking as a man in black rushed towards him. “Here you are.” Knife offers a sometimes gruelling account of his recovery – his wife wouldn’t let him look in the mirror, in case realising how serious his injuries were sapped his spirit – but it’s also peppered with Rushdie’s usual humour. Losing four stone, he “no longer had to worry about being overweight”. It also displays a rare softness, with beautiful praise for his wife, his late friend Martin Amis and others. It’s a book where “hatred is answered, and finally overcome, by love”.\n\nRushdie was ready to give up writing after The Satanic Verses, but “the thing that saved me as a writer was having promised my son a book”. Haroun, then, is a story for children and adults that distils Rushdie’s greatest qualities – storytelling, comedy, imagination – into a fable about a storyteller doomed to silence. It’s a good entry point for those in what Rushdie calls his “page 15 club of readers” – people who can’t get through his sometimes dense prose. And it’s not hard to see his own experiences in the book: “Stories are fun,” says hero Haroun; “Stories make trouble,” insists the despotic dictator Khattam-Shud. With a joyous blend of wordplay, fantasy and “P2C2Es” (Processes too Complicated to Explain), Haroun is Rushdie’s lightest, brightest achievement.\n\nRushdie’s best novel of the 21st century is about the murder of an American ambassador to India by a Kashmiri named Shalimar the Clown. It’s a book about “the crimes of the 14th century [being] avenged in the 20th” and the horrors of political violence: “It all made the new, senseless kind of sense.” Addressing Rushdie’s perennial theme of worlds in collision, it also becomes a page-turning thriller and a powerfully moving tragedy. Even Rushdie was overwhelmed, occasionally crying as he wrote. “What am I doing?” he asked himself. “This is somebody I’ve made up.” That, of course, is the power of great writing.\n\nRushdie’s memoir of his time under the Ayatollah’s death threat gives a powerful report on the anguish he and his family felt. More surprisingly, it is a comic masterpiece. Rushdie, writing in the third person, drops names shamelessly, whether biting back at Roald Dahl, who had criticised Rushdie during the fatwa affair (Dahl was “a long, unpleasant man with huge strangler’s hands”); or revealing how not to tell Bernardo Bertolucci you hate his new film (“he put his hand on his heart and said, ‘Bernardo … I can’t talk about it’”); or sharing perhaps the greatest suffering during his time undercover: having Harold Pinter fax him his terrible poems.\n\nThe extra-literary reaction to this book has blotted out its brilliance as a novel. In helter-skelter style, The Satanic Verses opens with two actors, Gibreel and Saladin, falling through the air over England after their plane is blown up by Sikh terrorists. “What an entrance, yaar. I swear: splat.” But they survive, each undergoing a metamorphosis – Gibreel becomes an angel, Saladin grows devil’s horns – and this is just the first act of their troubles. Especially evergreen is the book’s take on the immigrant experience in Britain, and how the demonisation of others leads in only one direction. It is a model for the freedom for literature to say whatever it wants to, as loud as it can.\n\nAfter Grimus took a “critical beating”, Rushdie knew he had to pull out all the stops with his second novel. His peers – Amis, Ian McEwan – were outpacing him. He created the story of Saleem Sinai, born on the moment of Indian independence from British rule, which makes a virtue of its eclectic style drawing on multiple cultures. It creates a flood of language teeming “fastfast” down the page and pulling the reader helplessly along. Midnight’s Children won not only the Booker prize in 1981 but also the Booker of Bookers in 1993, and the Best of the Booker in 2008. It is not only an incredible achievement on its own terms: it opened a door to the next generation of writers. It was, in the words of Anita Desai, “the voice of a new age”. It is a book with room for everything and everyone.\n\nTo browse all titles by Salman Rushdie, visit the guardianbookshop.com. Delivery charges may apply.",
  "authors": [
    "John Self"
  ],
  "url": "https://www.theguardian.com/culture/2025/nov/17/memoirs-myths-and-midnights-children-salman-rushdies-10-best-books-ranked"
}