{
  "title": "p(doom)=?, but p(doom for cancer)>0.5",
  "text": "By: Dr. Forest White, Professor of Biological Engineering, MIT and Distinguished Scientist at Astrin Biosciences and Dr. Justin Drake, Associate Professor, University of Minnesota and Chief Science Officer at Astrin Biosciences\n\nP(doom for cancer) is arriving.\n\nWhen engineers and scientists sit down to work on a new algorithm or AI model, p(doom) — the probability of AI causing a catastrophic event — is a term that is top of mind. However, the truth is, incorporating AI models is one of the best paths forward for helping us “cure” cancer.\n\nFor many years now, early detection has been the promise for that cure. Over 90% of cancers are solid tumors. When these tumors are identified at their earliest stages, survival rates can rise above 90%, outperforming even the most effective therapies on the market.\n\n\n\nHowever, cancer is elusive. It shapeshifts and presents itself as an ever changing current in a sea of everything that prevents detection. To catch cancer at its earliest stages – even stage zero – we need the best technology available. We believe AI can make a major contribution towards the early detection of cancer.\n\n​ P(doom) may yet be a catastrophe for the world, but here is how it will be catastrophic for cancer.\n\nMisconceptions and Truths: How Cancer Grows and Spreads\n\n​Despite having impacted nearly everyone, cancer remains difficult to outsmart. What we know as “cancer” is actually hundreds of different diseases that affect the body in countless ways. It’s not one massive opponent, but a range of smaller, constantly evolving adversaries. For example, two people with breast cancer may have very different tumor biologies requiring unique approaches to diagnosis and care. Even two cancer cells extracted at the same time from the same person aren’t identical. This heterogeneity is what makes cancer so fascinating, but also highly elusive.\n\nFor years, there has been a general dogma around how cancer grows and spreads within our bodies: It starts locally, then invades regionally, and finally it metastasizes to distant organ sites. An example would be that cancer would start in a patient’s breast tissue, then it would travel to nearby lymph nodes, before spreading to other areas of the body. This is the basis for how we stage and categorize different cancers. If a small, local tumor is present in breast tissue, that is most likely Stage 1 breast cancer. If there is a large tumor in the lungs that has active cancer cells moving to other areas of the body, that could be considered Stage 4, metastasized lung cancer.\n\nHowever, one of the most surprising (and consequential) recent discoveries is that cancer cells may enter our bloodstream before a tumor is even at the earliest stages of tumor formation. Because cancer cells can even be present in the bloodstream before a tumor is detectable, it should be possible to detect cancer at Stage 0.\n\nUnlike cells that have metastasized, circulating early-stage cancer cells in our blood are often dormant, hiding in plain sight but mostly undetectable in regular blood tests. This has been the locked door that researchers often struggle to open.\n\nAt Astrin, we have taken on the challenge of unlocking that door, opening up a world of new possibilities for cancer detection. Here is what we found.\n\nMalware in a Noisy Network\n\nImagine a vast computer network. Data is rapidly firing off every which way, carrying various messages throughout the computer system. Most of the data helps the programs and networks run smoothly, but somewhere amongst the chaos of information, there is malware looking to hijack the system.\n\nLike all computers, this one has a built-in security system that looks for signs of rogue code throughout the network. The problem is that most of these signs are locked up in small packets of data—tiny bundles of information—that blend in with normal network traffic.\n\nThis is essentially what our immune system faces as dormant cancer cells traverse through our bloodstream. With current technology, the security system won’t be able to detect the malware until it has hijacked the system, making it a bigger problem and much harder to eliminate.\n\nLuckily, this malware isn’t silent. It communicates with other rogue software in the network to better avoid the security system. So our goal is to open the data packets to find the messages the malware is attempting to send to one another. But that communication is ultimately the malware’s biggest weakness.\n\nIn other words, protein signals released by cancer cells are working together to enable tumor growth and avoid detection from our immune system. Finding these tiny signals has been a dream for researchers. If we can reliably find these messages, we can use deep proteomics that leverages nanotechnology, biochemistry, robotics, and optics to identify these signals.\n\nThis is where AI comes in.\n\nArtificial Intelligence: The New Security System\n\nIn addition to our computer’s built-in security system, we’re now adding a new one.\n\nThis one is specifically designed to find the malware we’re looking for with high accuracy. Through this new system, messages from the malware are able to be picked up quickly, accurately, and with the ability to decode the malware’s messages.\n\nEven better, the new security system doesn’t just track the malware — it also monitors how our built-in system is responding. It can see where the malware is slipping through firewalls, how it’s outsmarting antivirus programs, and where the security protocols are breaking down. This insight is crucial in helping us understand the weaknesses in the network’s defense. With that knowledge, we can strengthen the system, reinforce the vulnerable points, and ultimately stop future attacks before they start. We’ve essentially built an intelligent surveillance layer that not only identifies the threat but also learns from the battle itself.\n\nThis is what we’re doing for cancer. In other words, the AI that Astrin has developed is able to detect anomalies and locate cancer signals from proteins to reveal how the cancer cells communicate and how our immune system responds. Beyond that, this AI isn’t just looking for cancer. The depth and precision here will lead to creating a model that is capable of recognizing the onset, progression, recurrence, and eventual fatality of cancer.\n\nThis is more than early detection. This is understanding how aggressive a cancer will be, if it will be better to monitor or treat certain tumors, how likely a cancer is to come back after remission, and more.\n\n​AI vs. The World vs. Cancer\n\nAI will certainly remain in our daily lives as a controversial topic for years to come, but ultimately, what matters is creating a smarter, better technology to save lives. A recent tweet from psychologist and AI researcher Gary Marcus sums this up well. While mourning the loss of a friend, Gary shared his new litmus test for impactful AI: “when it makes a significant dent on cancer.”\n\nThe time is now.\n\nP(doom) for the world may or may not be zero, but p(doom for cancer) is trending to one.\n\nAstrin Biosciences is a cancer intelligence company built to push the boundaries of technology — accelerating early cancer detection and advancing cancer care through analyzing over 9,000 proteins to reveal what most blood tests miss: the earliest molecular signals of cancer development. Learn more here.",
  "authors": [
    "Cindy Zackney"
  ],
  "url": "https://techcrunch.com/sponsor/astrin/pdoom-but-pdoom-for-cancer0-5/"
}