{
  "title": "Harold Offeh: Mmm Gotta Try a Little Harder, It Could Be Sweet review – desire, despondency and disco divas",
  "text": "Mmmm ... Mm-mm. Mmmmmwwwwwmmm. MMM. Sometimes sexy and sometimes sleepy, sometimes like a kid making airplane noises or doing an impression of a creaking door or maybe a whale, the sound of Harold Offeh humming and ummming fills the lobby of Kettle’s Yard in Cambridge. Mmm, he goes, mmm-mm-mm. He up-speaks and mumbles and wrings a whole world of feeling out of this disembodied overture. The title of Offeh’s show, including that Mmm, is a quote, from a song on Portishead’s 1994 album Dummy. “Gotta try a little harder / It could be sweet,” runs the lyric, which is also printed in big gloopy lettering on the gallery walls, behind Offeh’s video screens, his photographs and other graphic interventions. The show blares and jostles with life, with song and dance, with skits and routines, with public moments and private performances on the loo and in the bathroom.\n\nFor more than two decades Offeh has been a moving target. Here’s the Ghanaian-born Offeh as Haroldinho, in Rio de Janeiro in 2003, shuffling samba steps and wearing typical, Brazilian blue worker’s overalls, his adopted name appliqued on the back. Dancing in the streets and on the beach, he sways and smiles, an object of mild curiosity to passersby. In Rio, people often assumed he was Brazilian. Here he is again, now on the streets and shopping centres of Walsall, Oxford, Liverpool and Chester, in Stockholm and Banff, in the shadow of the Canadian Rockies, wearing a Victorian-era magnifying lens in front of his face, which distorts and exaggerates his features. Given the suspicious looks he gets on the British streets, you worry for his safety.\n\nView image in fullscreen ‘The artist as reclining soul singer’ … Harold Offeh’s Lounging. Photograph: © Harold Offeh\n\nSometimes a smile will see you through. A closeup of Offeh’s face, maintaining a sardonic rictus-like grin fills the screen. He’s listening, over and over again, to Nat King Cole and the Nelson Riddle Orchestra’s 1954 version of the Charlie Chaplin-composed Smile. Made in 2001, when Offeh was still a student, Smile is the earliest work here. He went on to mimic the exaggerated facial expressions and closeup reaction-shots of black actor Hattie McDaniel in her role as Mammy, the enslaved house servant in the 1939 movie Gone With the Wind. Subjected to racism and discrimination throughout her life as a blues singer and the first Black recipient of an Oscar in 1939 (as best supporting actor in the same movie), McDaniel becomes Offeh’s model as he runs the gamut of her on-screen performance. Hair done-up in a white scarf, eye-rolling, eyebrow-raising, lip-curling and cheek-blowing for the camera, Offeh mimics her racially stereotyped performance.\n\nI laughed out loud, in the way that you laugh at a bleak moment in a Samuel Beckett play\n\nHere he is again, wearing an “I LIKE BOYS” T-shirt and then in drag and snapping his fingers like a disco diva, flaming to Armando’s 100% of Disin’ You. Now he’s lounging in stilled, silent emulation of singer Teddy Pendergrass, posing with his hands together in a lewd gesture. This is the artist as reclining soul singer, comfortable in his studied masculinity. Offeh went on to perform drag impersonations of Black R&B and disco stars in Covers, in which he adopts their record-sleeve postures. Wearing a black leotard he performs Marlena Shaw’s stylised pose on Take a Bite, Millie Jackson’s Get Out and Get Some, Amii Stewart’s Knock on Wood. Getting into position in different parts of his house, he does Melba Moore’s Hot and Tasty in his cluttered loft, and for his rendition of Grace Jones’s Slave to the Rhythm he gets naked in the bathroom, slathering himself up in oil to attempt Jones’s anatomically impossible montaged pose from the cover of her Island Life album, originally designed by John-Paul Goude.\n\nThere’s parody, vulnerability, homage and critique and more than a hint of desire at play in Covers, which Offeh has also re-performed in a series of staged photographs.\n\nIn 2020, Offeh tried to re-enact the contorted poses of Henri Gaudier-Brzeska’s early modernist sculptures in the Kettle’s Yard collection. If he tried any harder, he’d do himself a mischief. Offeh is compelling to watch, even when he is lying in the bath or just standing on the pavement, the world swirling round him. He is happy to objectify himself, I think, even as he questions what it means to be a queer, Black body. That vulnerability and curiosity are also present in his early, 2002 Four Ways to Feel Amazing, in which we find the artist listening to self-help advice. Naked in his bath, looking like a lost little boy with a half-drowned toy as his only friend, he is advised to nurture himself. Standing on a street and looking schlumpy and alone he’s told to stop comparing himself with others (while being the solitary Black person among the milling shoppers); on the lavatory with his trousers down, he’s told that he is sitting on top of the world. In the last of these vignettes, he is alone in a bare room, staring at a digital clock as he is asked to live in the moment and to feel “the Now”. As the numbers flip on the clock, there’s a crushing sense of futility and stalled time. I laughed out loud, in the way that you laugh at a bleak moment in a Samuel Beckett play. Behind the evident joyfulness of his early work, there is an underlying pain. You feel it in Offeh’s comic timing, the eye-to-camera moments, the beat and the pause.\n\nView image in fullscreen Harold Offeh’s Covers: After Grace Jones, Island Life, 1985 (Graceful Arabesque). Photograph: Courtesy the artist\n\nOffeh performs less nowadays and his body is no longer centre stage. All the graphic razzmatazz, and an increasing installational complexity (some of which is influenced by Afrofuturism and Brazilian Tropicália, particularly the work of Hélio Oiticica) keeps the energy up even as the tempo and tenor of his art slows. On the evidence here, Offeh’s focus has shifted of late more towards community-based projects that, to my mind, are less compelling as art works themselves than as social inquiry. He has worked with young people on a project for the London Underground, and on a playground whose design was influenced by Sun Ra and George Benson. His video documentation of a workshop at Charleston in Sussex, the country retreat of the Bloomsbury Group, during an exhibition of the erotic works of Duncan Grant, and in which participants discuss queer sex, love and desire, is a dull watch. The interviews with immigrants and members of the local LGTBQ+ community in a small town in Japan, where Offeh undertook a residency in 2019, or the archival interviews about queer life in Toronto, from the 1950s to the present, might be compelling fragments of storytelling, but Offeh here is playing the role of witness and documentarian rather than artist. But he probably sees the role of artist in terms of his usefulness nowadays.\n\nIn the gallery, there’s a sign hanging overhead. It says PLAY. This participatory, social turn in Offeh’s work has its own rewards, but to make art, maybe you gotta try a little less. It could be sweet.",
  "authors": [
    "Adrian Searle"
  ],
  "url": "https://www.theguardian.com/artanddesign/2025/nov/19/harold-offeh-mmm-gotta-try-a-little-harder-it-could-be-sweet-review-desire-despondency-and-disco-divas"
}