{
  "title": "Designing the Future: A Conversation with Dylan Field",
  "text": "Transcript\n\nSo I'm really delighted to welcome Dylan Field\n\nto The Big Interview stage.\n\nHe's the co-founder and CEO of Figma.\n\nAs a student of Brown University,\n\nhe and his co-founder Evan Wallace began experimenting\n\nwith design tools built on and for the web,\n\nand with funding from a Teal fellowship,\n\nmaybe we'll talk about that, they began Figma.\n\nHis previous jobs were internships,\n\nincluding at LinkedIn.\n\nFigma has millions of users,\n\nthey run a big developer conference called Config,\n\nand lightly they've been very creative in integrating\n\nAI into their product.\n\nLike you had a choice, right?\n\nAnd welcome Dylan Field.\n\n[audience applauding]\n\nSteven, WIRED, Thank you for having me.\n\nAnd also really great to be back here at Config,\n\nour first Config,\n\nwhich was just weeks before the pandemic,\n\nwas actually here at the Midway.\n\nAnd so it's very exciting to be back and good energy.\n\nWell, great to have you back, though.\n\nI have to say, I've got a comment on what you're wearing.\n\nYou are the CEO of a multi-billion dollar company.\n\nWhy are you wearing an Enron hoodie?\n\nAll right, well, first of all,\n\none thing that people don't know enough of is\n\nthat the Enron logo was designed by Paul Rand,\n\nwhich I'm sure some of us know.\n\nPaul Rand was an amazing brand designer responsible\n\nfor many different corporate entities,\n\nincluding IBM, the NeXT Cube,\n\nand his last one actually was the Enron logo,\n\nand it was the final project he worked on.\n\nIt was released after his death.\n\nAnd you might say it had a short shelf life.\n\nIt went from what I think actually is a quite timeless logo\n\nto being called the crooked E.\n\nAnd one thing that happened yesterday,\n\nwhich I thought I got a real kick out of,\n\nwas somebody actually acquired the right to the Enron brand,\n\nand they did a relaunch on the anniversary\n\nof the bankruptcy.\n\nAnd to me, I kind of think this is fascinating\n\nbecause it brings up all sorts of questions\n\nfor a new generation\n\nthat didn't necessarily have all the associations\n\nwith Enron as others did,\n\ncan you actually make a new brand,\n\na new company out of that material?\n\nAnd for me, I was,\n\nI think it was 2001 when Enron went bankrupt.\n\nI was nine years old, I was reading the newspaper\n\naware that there's like really bad stuff happening,\n\naware that there are brownouts,\n\nbut I definitely don't have those same associations\n\nas a lot of others do.\n\nAnd I find the whole thing very fascinating.\n\nSo that's why I'm wearing the sweatshirt.\n\nSo in other words,\n\nyou're not getting the negative implications,\n\nof which there are some of Enron,\n\nbut it's just like a kind of a cool gangster thing,\n\nthat aspect of it.\n\nAttached to a logo which you bonded to there,\n\nis this always an appreciation of that stuff you had,\n\nbecause you were in college,\n\nyou were doing math and science.\n\nThen you get this fellowship\n\nthat basically tells people get out of college,\n\nbuild something.\n\nAnd you gravitate towards design.\n\nIs this something you were always interested in,\n\nor would you just see that as a gap, an opportunity?\n\nYeah, I was always interested in design.\n\nNot always very good at design\n\nbecause are two different things,\n\nyour taste versus your ability.\n\nThere's a lot of good famous quotes about that.\n\nBut for me, I mean,\n\nI was always fascinated with how things worked,\n\nthe user experience of things,\n\nand also graphics and how you actually could use interfaces\n\nonline and the web as well as desktop software.\n\nI grew up playing things like Incredible Tune Machine,\n\nthen eventually things like Neopets\n\nwere big influences for me in my childhood.\n\nAnd the design aspects of those\n\nand how they worked were endlessly fascinating.\n\nBut yeah, it took a while to get to Figma.\n\nI started the company because my co-founder\n\nand I were excited about WebGL.\n\nAnd we thought that that was definitely an opportunity,\n\nthe ability to use the GPU in your computer in the browser.\n\nAnd if we could start to do that, what could you make?\n\nWe thought there's really two things\n\nthat could be interesting.\n\nOne is games and the other might be tools.\n\nAnd we thought, okay, games is a hit-based business\n\nthat is incredibly hard to do the right way.\n\nWe're not gonna go there.\n\nInstead we said, Let's go explore the space of tools.\n\nAnd we started to explore,\n\nI'd actually just been a design intern at Flipboard,\n\nand they had an incredible design team there,\n\nand were really ahead of their time in terms\n\nof the premium they put on design.\n\nThey thought about design as part of something\n\nthat everyone in the company contributed to\n\nand was the reason that they stood out as a business.\n\nAnd despite that, it still took a while for us\n\nto get back to design because we thought\n\nit was a tiny market.\n\nAnd it turned out that the more we learned about it,\n\nthe more we looked into it,\n\nwe started to realize\n\nthat this was an exponential trend of not only\n\nhow much software is created in the world,\n\nbut also the importance of design in that context.\n\nAnd that design was the way that you stand out.\n\nAnd what's interesting now\n\nI think in this age of AI\n\nthat we find ourselves in is that it feels like\n\nthat's even more true than ever.\n\nBoth the exponential trend of software,\n\nI mean it's going straight vertical now,\n\nbut also this idea that craft of design being the way\n\nthat companies will stand out in this age of software,\n\nI think is more important than it's ever been too.\n\nAnd also the ratios, I think that when we started Figma,\n\nthe ratio of designers to engineers\n\nwere sort of off the charts.\n\nAnd that was much better than it had been 10 years prior.\n\nAnd we started to see improvements in those ratios\n\neven over the first five years of Figma.\n\nI think if you look to the future,\n\nit might be that the ratio flips even,\n\nthat there's more people\n\nthat are doing things that look like design\n\nthan people that are actually building the code.\n\nAnd so I'm fascinated to see\n\nwhat that'll look like in the future.\n\nWell, one of the pillars of Figma is\n\nthere's this paradigm of collaboration in design.\n\nNow Paul Rand, who you idolize,\n\nhe didn't have to collaborate with anyone.\n\nWhen Steve Jobs tried to stick his nose in\n\nto the process when he was doing the NeXT design,\n\nhe said, Get out of here.\n\nHe said, It's either take it or leave it.\n\nIf you don't like it,\n\nI'll take my $100,000 and go home.\n\nDid you have trouble pitching that\n\nto generations of designers who are used\n\nto that kind of data attitude?\n\nYeah, absolutely.\n\nThere's I think this mindset that agencies had\n\nwhere it was sort of,\n\nthere's a grand reveal and a black box\n\nthat the process is in.\n\nAnd when we launched Figma,\n\nI remember the comments were something like,\n\nIf this is the future of design, I'm changing careers.\n\nThat was one comment we got.\n\nAnother comment that always stuck with me was,\n\nA camel is a horse designed by committee.\n\nAnd what we've found is\n\nbecause design is so central to how a business works,\n\nand also if you win or lose,\n\nnot only does everyone have an opinion,\n\nand you could say, the more opinions, the worse it gets.\n\nBut I actually find that if you're able to make it so\n\nthat everyone can come together and see the best ideas\n\nand you can visualize them quickly,\n\nwhich I think will become more possible in the age of AI,\n\nthen you're able to kind of create a level playing field.\n\nAnd maybe for brand and marks\n\nlike Paul Rand created\n\nwhere you have to really be so strongly opinionated,\n\nthat's a different sort of beast altogether.\n\nBut when it comes to thinking through user flows,\n\nthinking through how a product experience should work\n\nand how a business should win,\n\noftentimes that really helps the strategy.\n\nSo what you said before\n\nlinks to something else that you've said,\n\nbecause creativity is the new productivity, right?\n\nCan you explain that?\n\nMy sense is that people are trying\n\nto visually express themselves much more than before.\n\nAnd also that there's a new paradigm possible\n\nwhen you've got an infinite visual canvas.\n\nAnd with an infinite visual canvas,\n\nwhether it's in a whiteboard tool,\n\nwe offer something called FigJam, or even in a slide deck,\n\nand we have Figma Slides now too,\n\nbeing able to show great visual work\n\ncan really help bring people along.\n\nAnd I think that the more creative you can be,\n\nthe more you can stand out,\n\nwhether it's inside of an organization\n\nor it's on the outside of an organization\n\nand in your marketing, your product,\n\nthe ways that you'll stand out to customers.\n\nSo if millions of people are using Figma,\n\nwhich they are, right?\n\nYou're not telling me how many millions,\n\nbut it's fair to say millions,\n\nthen if everything looks good, then how do you stand out?\n\nIsn't you raising the bar\n\nmaking it actually tougher to be distinct?\n\nYeah, I think that it's not just about how it looks,\n\nbut also how it works, of course.\n\nBut I believe that there's things\n\nthat the best designers are doing today\n\nin terms of interactivity, dynamism, motion,\n\nand just unique experiences that they're creating,\n\nwhich very few people are able to do.\n\nBut I hope that we can do two things.\n\nI hope that we can, partially with our tools,\n\nbut also partially with AI,\n\nand really they're the same thing.\n\nWe can lower the floor,\n\nmake it so that more people can participate\n\nin the process of design, but also raise the ceiling,\n\nmake it so that more people,\n\nwhether they're new to design\n\nor outside the world of design\n\nor they wouldn't classify themselves that way,\n\nor they're new designers can raise the ceiling\n\non their work.\n\nAnd they can make it so that they're able to match the work\n\nof some of the best designers in the world.\n\nAnd they're limited more by their ideas\n\nthan by the tools in front of them.\n\nSo Dylan, the first time we spoke,\n\nI know we had a great meeting\n\nand went out for coffee\n\nand you were telling me how\n\nI'm never gonna sell out this company,\n\nwe're gonna go it alone, we're gonna like build on that.\n\nAnd it was like maybe two months later,\n\nAdobe is gonna buy your company for $20 billion.\n\nI felt so bad when I told you that.\n\nI felt like,\n\nif you've ever had a one-on-one conversation with Steven,\n\nyou'll know how he stares into your soul.\n\nAnd I had just gotten off a call\n\nwith Adobe literally minutes before.\n\nWhat a poker player. Unbelievable.\n\nNo no no. I was petrified.\n\nI was like, did he hear? Anyway, I'm still sorry.\n\nOkay, well don't drop the subject.\n\n[Dylan] Just feel bad, that's all.\n\nI mean was this the kind of thing\n\nwhere you felt it's an offer I can't refuse?\n\nOr is it something you felt,\n\ngee, this is generally gonna be better for my customers\n\nand to grow what we want to do?\n\nYeah, I was honestly quite excited.\n\nI think it was something that to me,\n\nespecially as we explored it further,\n\nand that was still early in the process.\n\nAnd so I think we're going back and forth,\n\nbut I was excited about the possibilities\n\nwe could have inside of Adobe.\n\nWhat we could do there in terms\n\nof taking the multiplayer tech,\n\nthe way that we brought our product to the web\n\nand doing that for more of the Adobe ecosystem\n\nand the change we could create there.\n\nAnd I thought it was a good outcome,\n\nnot only for our customers,\n\nwhich honestly most negotiation was about\n\nhow to make sure our customers would end up in a great place\n\nand be beneficial for them,\n\nbut also for all the stakeholders around the company.\n\nSo yeah, I was excited and that's why we went after it.\n\nAnd obviously because regulators here and abroad\n\nsaid they were not gonna look kindly on this,\n\nthat went fizzle.\n\nAnd you're left with a company on your own again,\n\nyou have an extra billion dollars\n\nfor a breakup fee.\n\nBut I'm sure you had your plans\n\nand it was a distraction,\n\nbut then you get to concentrate on AI there.\n\nSo walk me through a little bit of your journey\n\nabout how you're building, you know,\n\nit's available now in open betas and things,\n\nAI into what you do.\n\nAbsolutely, so yeah,\n\nwe're wildly excited about just all the opportunities ahead.\n\nAnd I think that as we think about the future\n\nof Figma and what it can become,\n\nI mean we started off as a design tool where\n\na third of our users, weekly active users are designers,\n\nthird are developers,\n\nand third are kind of in the other category.\n\nAnd we found these folks were coming into the product\n\nand then we started to build out from there.\n\nWe created FigJam, we created Figma Slides, now Dev Mode.\n\nAnd we're really trying to make this platform\n\nwhere you can go and create products and do that end to end.\n\nAnd as I think about what AI enables through that,\n\nI get excited about these different transitions\n\nbetween abstractions.\n\nHow can you go from a brainstorm file to a slide deck,\n\nor a slide deck to a design file,\n\na design file to working code?\n\nThat becomes more possible in a world of AI,\n\nbut also the ability to improve\n\nthe way that you explore this idea maze.\n\nWe're all kind of in the design process\n\nthinking about all these different possibilities\n\nthat could exist.\n\nHow do you go rapidly navigate that?\n\nThink about the things that could be, evaluate them quickly,\n\nand then see if you wanna go down that path\n\nand really refine it and bring all the craft to it,\n\nor if you can discard that possibility.\n\nAnd if you could do that across that entire process quickly\n\nand bring those two things together, it's super powerful.\n\nAnd that's where I think you can,\n\nI guess both lower the floor but also raise the ceiling\n\nand make it so that in the sort of end state,\n\neven though there's so much more software in the world,\n\nthe software we have that stands out can be so much better.\n\nIt seems to me, the way I understand,\n\nand correct me if I'm wrong,\n\nthere's sort of two paths that you're pursuing on AI.\n\nOne is just to improve the flow,\n\nto use AI the way some of us will use ChatGPT\n\nto fill in things and automate certain kinds of things\n\nand just like make...\n\nAnd it's all once search through things you already have,\n\njust things that make it go smoother\n\nand take drudgery away.\n\nThe second is almost to build a collaborator\n\nto the creative process.\n\nAnd that's where things get interesting\n\nand a little questionable.\n\nLike where did this stuff come from?\n\nAnd you had one experience,\n\nyou had a product that\n\nmaybe you could explain it briefly,\n\nbut I mean, I don't know have we time to really get into it,\n\nultimately someone used something\n\nthat wound up looking a lot like Apple's weather app\n\nand you had to make an adjustment.\n\nSo rather than dive into that,\n\nthere is this gray area of whether people should contribute\n\nto the training sets.\n\nYou're transparent about that,\n\nbut some people wanna do that.\n\nThey want to contribute to the community.\n\nOther people are very protective. There's lawsuits.\n\nSo where you stand on that?\n\nDo you feel that we're gonna be a blend of the creativity\n\nthat comes from this cloud\n\nof what comes from training sets and us,\n\nor will people draw firmer lines as this goes along?\n\nSo it's interesting\n\nbecause when we launched this Make Design feature,\n\nwhich we later called First Draft\n\nbecause we thought that was more representative\n\nof the actual value that we were creating,\n\nthis is the first draft that you're gonna iterate on,\n\nwe did it in a way that was more generic.\n\nAnd what we found in the feedback we received\n\nwas actually design companies have a design system already.\n\nThey have a system that they rely on\n\nof a kit of parts of all their styles,\n\ntheir components that they want to use.\n\nSo they don't want an arbitrary thing.\n\nAnd what they do want from us\n\nis the ability to quickly explore\n\nand make variations using their own design system.\n\nSo I think first of all, most likely,\n\na lot of those outputs on the generative side\n\nare more unique to companies and organizations\n\nthan they are matching the general universe of design.\n\nBut it is important to be able to do all sorts\n\nof other functionality as well.\n\nAnd I think where training comes in is making it\n\nso that we're able to explore that.\n\nThings like if you're in Gmail for example,\n\nand you start typing and you see auto-suggested text\n\nand you can press Tab to complete it,\n\nlike what's the design tool equivalent of that?\n\nWhat makes it so that you can remove drudgery,\n\nthe things that people don't want to do,\n\nand put people into more of a flow state,\n\nmake them more creative\n\nand make it so that they can explore\n\neven more options faster?\n\nIf we can do that, then that I think is really exciting.\n\nYeah, that's great.\n\nBut I guess my fear is\n\nyou're doing great work in democratizing design,\n\nso you add AI to the mix,\n\nthere's people who are gonna\n\nlike raise the floor to do that, to make things look good.\n\nBut we've already seen what good enough does in ChatGPT\n\nand we're inundated with AI slop,\n\nand I guess it's sort of my nightmare\n\nthat this stuff looks better and draws us in even more.\n\nYeah, I think that it's interesting,\n\nwhen I look back at the history of Figma,\n\nthere was a moment where, I don't know, 2014, 2015,\n\nwhere I realized some of the negative effects\n\nof the power of design.\n\nI remember later in the night\n\nreading about the time ISIS was\n\na really important challenge\n\nthat we were facing globally.\n\nAnd there was a magazine they put out\n\nwhich was really horrific\n\nand it was incredibly well-designed.\n\nAnd designed as a power to lift\n\nbad actors as well as, that's extreme case obviously,\n\nas well as stuff that maybe just be like not as interesting.\n\nAnd I think that that is the reality\n\nof all tools is they have the power\n\nif they're made correctly to lift people up.\n\nAnd that's a debate that you can have\n\nI think about any tool.\n\nBut what I think is most important is\n\nthat we find ways to recognize that most\n\nof the AI tools right now are about lowering the floor.\n\nThey're about making it so that there's democratization.\n\nDemocratization is great in many ways\n\nand new use cases and markets aren't locked.\n\nYou talk to the people that do image generation\n\nwith diffusion models, not all of them are doing the things\n\nthat you expect.\n\nSome of them are doing like art therapy,\n\nwhich is never possible before.\n\nBut I also think it's so critical for us\n\nto really invest in, like I said,\n\nraising the ceiling and making these new possibilities\n\nfor designers.\n\nAnd that's where a lot of our thinking is right now.\n\nAnd that's where I hope we can drive towards.\n\nI'd love to go on, that's a great place to stop.\n\nThank you, Dylan. Thank you.\n\n[audience applauding]",
  "authors": [
    "Condé Nast"
  ],
  "url": "https://www.wired.com/video/watch/designing-the-future-a-conversation-with-dylan-field"
}