{
  "title": "Tom Brady Reveals His Dog Junie Was Cloned from Beloved Pet Lua, Who Died in 2023",
  "text": "NEED TO KNOW Tom Brady's dog Junie is a clone of his dog Lua, who died in 2023, he announced Nov. 4\n\nColossal Biosciences, which Brady is an investor in, cloned the pit bull mix using a blood sample collected prior to her death\n\nThe announcement coincides with Colossal's announcement that it is acquiring Viagen Pets and Equine, which cloned Barbra Streisand and Paris Hilton's dogs\n\nTom Brady’s dog Junie is a clone of his late dog Lua.\n\nAfter Lua — whom the retired quarterback shared with ex-wife Gisele Bündchen and their children — died in December 2023, he welcomed another, similar-looking dog, Junie. Nearly two years later, Brady has revealed that Junie is a clone of the late pit bull mix.\n\nBrady shared the news on Tuesday, Nov. 4, coinciding with an announcement from Colossal Biosciences, a biotech company that he is an investor in — and that worked with him to clone his beloved Lua. On Nov. 4, the Dallas-based company, best known for its headline-making claim that it produced three dire wolf pups, announced that it has acquired another biotech company, Viagen Pets and Equine.\n\nTom Brady with Fluffy and Junie. Backgrid\n\nViagen is known for cloning Barbra Streisand’s dog Samantha, who died in 2017, and Paris Hilton’s dog Diamond Baby into two puppies after the pet went missing in 2022. The biotech company has “exclusive licensing and access to the breakthrough technologies” that were developed by the Roslin Institute of Edinburgh, which is widely known for cloning Dolly the Sheep in the late ‘90s, Viagen said in a press release obtained by PEOPLE.\n\nBrady’s late pet Lua was cloned using blood collected prior to her death in 2023, the Colossal investor said in a statement obtained by PEOPLE.\n\nTom Brady's Instagram tribute to his late dog, Lua. Tom Brady/Instagram\n\n“I love my animals. They mean the world to me and my family,” the former NFL star said. “A few years ago, I worked with Colossal and leveraged their non-invasive cloning technology through a simple blood draw of our family's elderly dog before she passed.”\n\nThe company “gave my family a second chance with a clone of our beloved dog,” Brady continued, adding that he is “excited how Colossal and Viagen's tech together can help both families losing their beloved pets while helping to save endangered species.”\n\nWhile Viagen has made headlines for cloning pets for celebrities like Streisand, Hilton and now, Brady, Colossal is best known for its “de-extinction” efforts, like its dire wolf project, which it debuted in April. In September, the Texas-based company also announced a scientific breakthrough in its effort to bring the extinct dodo bird back to life.\n\nTom Brady and Lua. Tom Brady/Instagram\n\nBündchen and Brady — who divorced in 2022 — adopted the pit bull mix during their marriage, and she was a prominent member of the family over the years.\n\nBrady regularly posted about the pup on social media, and she even starred alongside him in his 2014 Ugg Australia commercial.\n\nNever miss a story — sign up for PEOPLE's free daily newsletter to stay up-to-date on the best of what PEOPLE has to offer​​, from celebrity news to compelling human interest stories.\n\nThe supermodel, 45, first announced Lua’s death in an Instagram post on Dec. 23, 2023. She shared several photos of the beloved pet, including several with the exes’ children Benjamin Rein, 15, and Vivian Lake, 12.\n\nGisele Bündchen and Lua. Gisele Bundchen/Instagram\n\n“Our little Lulu, our guardian angel is gone to heaven,” the supermodel wrote alongside the pictures. “She will forever live in our hearts. We already miss her sooooo much! #unconditionallove RIPLua 💔.”\n\nBrady also posted a tribute to Lua, sharing a photo of the dog with his kids on Instagram Stories and writing, “We love you Lua, RIP.\" In another tribute, he added that the late pup is \"forever in our hearts.”",
  "authors": [
    "Bailey Richards",
    "Bailey Richards Is A Writer-Reporter At People. She Has Been Working At People Since",
    "Interned With The Brand In Her Work Has Previously Appeared In Digital Publications Like Paper",
    "Tv Insider.",
    "People Editorial Guidelines",
    "Desiree Anello",
    "Ingrid Vasquez",
    "Latoya Gayle",
    "Brian Anthony Hernandez",
    "Nicholas Rice"
  ],
  "url": "https://people.com/tom-brady-cloned-his-dog-lua-11842661"
}