{
  "title": "Nighttime Light Exposure May Raise Cardiovascular Disease Risk",
  "text": "LOADING ERROR LOADING\n\nNow may be the time to buy some blackout curtains and actually turn your phone off before bed. While exposing yourself to light during the nighttime may seem innocent, it could potentially be harmful for your health.\n\nExposure to artificial light at night is linked to higher rates of cardiovascular disease, according to recent research published in the journal JAMA Network Open. Specifically, experts saw a greater risk of heart failure, coronary artery disease, atrial fibrillation, myocardial infarction (commonly known as heart attack) and stroke.\n\nAdvertisement\n\nResearchers tracked one week of nighttime light exposure among 88,905 adults over 40, who wore wrist sensors to measure their exposure from 12:30 a.m. to 6 a.m.\n\nParticipants were broken into four percentiles from least amount of nighttime light exposure to most. Researchers then looked at their heart health data over the course of 9.5 years and adjusted for established cardiovascular risk factors such as smoking, physical activity, shift work and socioeconomic status.\n\nWhen compared to those who experienced the lowest amounts of light exposure during the night, people with high exposure had the worst health outcomes. Those who had high light exposure during the night saw a 56% higher chance of developing heart failure, up to a 56% greater risk of heart attack and up to a 30% greater risk of stroke.\n\nAdvertisement\n\nThere’s one main reason why experts believe this happens.\n\nResearchers deduce the negative health effects of nighttime light exposure have to do with the circadian rhythm, which is our body’s 24-hour sleep-wake cycle.\n\n“We know that the circadian rhythm ... is really an important part of healthy lifestyle and that disruptions in that ... sleep-wake style cycle can be associated with cardiovascular events,” said Dr. Jeremy Slivnick, a cardiologist at UChicago Medicine who is not involved with the study.\n\nExposure to nighttime light can trick the brain into thinking it’s daytime, which disrupts the normal circadian rhythm patterns, Slivnick explained.\n\nAdvertisement\n\n“I think light exposure translates to a disturbance in the circadian rhythm, which may or may not impact sleep duration, but certainly affects overall sleep health, which is a combination of not just how long, but how well one sleeps on a regular basis,” said Dr. Ehimen Aneni, an associate professor of cardiovascular medicine at Yale School of Medicine in Connecticut. Aneni is also not affiliated with the study.\n\nEven if you get seven or eight hours of sleep each night, it doesn’t mean you’re getting high-quality sleep. If you’re waking up tired or with headaches, you may be experiencing sleep issues that are worth chatting with your doctor about.\n\nBad sleep is associated with “a variety of cardiovascular and cardio metabolic conditions,” Aneni said. “For instance, there is evidence to show that short sleep duration is associated with increased risk of heart attacks and strokes, and sleep disorders have been associated with heart disease and strokes.”\n\nAdvertisement\n\nSleep is also our body’s “recharging mechanism,” Slivnick said. “Reduction in sleep can increase stress, anxiety and increase the body’s fight or flight mechanisms, and these mechanisms can stress the heart, particularly over prolonged periods of time, which can predispose to cardiovascular risk.”\n\nOngoing stress can lead to issues such as high blood pressure, which puts folks at higher risk of cardiovascular disease. More, circadian rhythm disruptions are a risk factor for developing type 2 diabetes, the study authors wrote. Having diabetes increases the chance of developing cardiovascular disease.\n\n“What else stuck with me was the fact that it seems like the association was more prominent among women relative to men,” Aneni said. Study authors wrote that this finding is consistent with other research, which found women are more sensitive to light-based circadian rhythm disruptions and that women who do overnight shift work have higher heart failure rates than men.\n\nAdvertisement\n\nThere are limitations to the study. For one, researchers don’t know the exact source of the light people were exposed to at night, so it’s unknown whether they were affected by street lights, TV screens, tablets, phones or something else. There also wasn’t much diversity in the cohort; 97% of participants were white.\n\n“I’m hoping that there are more studies like this confirming these findings and directly being able to explain why this night light exposure is leading to heart disease — and I bet that the answers would lie within the quality and the quantity of sleep,” Aneni said.\n\nsestovic via Getty Images New research shows that exposure to light at night puts folks at higher risk of cardiovascular issues such as heart failure.\n\nAdvertisement\n\nPractice good sleep hygiene ― including eliminating nighttime light exposure ― to get quality sleep.\n\nWhile more research is needed to determine the exact ways that nighttime light is linked to cardiovascular health, limiting your exposure is a good way to minimize your risk of heart disease.\n\n“We have a population that does not really sleep as well as they should, and does not value sleep as much,” Aneni said.\n\nAdults should aim for seven to nine hours of sleep and should try to go to bed and wake up at about the same time every day.\n\nAdvertisement\n\n“The healthier your sleep is, the healthier you are,” Aneni added. “And, in terms of cardiovascular disease, the healthier sleep you get, the lower your cardiovascular disease risk.”\n\nBeyond turning off lights when you sleep, limiting bright lights from screens before bed and prioritizing rest, there are other things you can do for better heart health.\n\nSlivnick said he often directs patients to the American Heart Association’s Life Essential 8, which are eight guidelines to follow for optimal cardiovascular health. These guidelines encompass:\n\nAdvertisement\n\nEating a nutritious diet that’s high in vegetables, lean protein, fruit, nuts and seeds.\n\nGetting at least 120 minutes each week of moderate intensity exercise (such as walking or gardening) or 75 minutes of vigorous (such as running or swimming).\n\nQuitting smoking.\n\nSleeping seven to nine hours each night.\n\nManaging weight.\n\nManaging cholesterol.\n\nManaging blood sugar.\n\nManaging blood pressure.\n\n“If we do those eight things, we really can do a major part at controlling our risk of having cardiovascular disease,” Slivnick said.",
  "authors": [
    "Senior Wellness Reporter"
  ],
  "url": "https://www.huffpost.com/entry/night-light-exposure-increase-cardiovascular-problems_l_691740dde4b0191be9d4cb68?origin=life-feed"
}