{
  "title": "Los viajeros que no posean un documento REAL ID podrían ser multados con US$ 18 por la TSA",
  "text": "CNN —\n\nLa Administración de Seguridad en el Transporte (TSA, por sus siglas en inglés) propuso establecer una tarifa de US$ 18 para los viajeros que no posean una identificación REAL ID para pasar por los controles de seguridad de los aeropuertos.\n\nLa tarifa cubriría los costos asociados con la nueva tecnología necesaria para verificar la identidad del pasajero, según informó TSA este jueves en un comunicado.\n\nEl REAL ID —una licencia de conducir o tarjeta de identificación que cumple con los estándares federales de seguridad— se convirtió en requisito para todos los viajes aéreos en Estados Unidos el 7 de mayo, después de años de que se pospusiera el plazo.\n\nLa Ley REAL ID, aprobada por el Congreso en 2005, puso en práctica la recomendación de la Comisión del 11-S de que el Gobierno federal mejorara los estándares de seguridad para la identificación.\n\nDe acuerdo con la nueva norma propuesta, los viajeros que no posean una identificación REAL ID podrían pagar la tarifa y utilizar un nuevo quiosco biométrico que les permitiría acceder a los puntos de control de la TSA durante 10 días, según el aviso publicado en el Registro Federal.\n\nPero, según el aviso, pagar por usar el nuevo “programa modernizado de verificación de identidad alternativa” no garantiza el acceso.\n\nCuando alguien decide utilizar el programa y proporciona la información requerida, “la TSA utilizará la información biográfica y/o biométrica del individuo para verificar su identidad y cotejarla con el resultado de su lista de vigilancia de Secure Flight”.\n\n“Las personas que verifiquen su identidad utilizando el proceso alternativo de verificación de identidad de la TSA también pueden estar sujetas a controles adicionales o experimentar demoras”, decía el aviso.\n\nLos pasaportes siguen siendo una forma aceptable de identificación tanto para viajes aéreos nacionales como internacionales, y las licencias que no cumplen con la ley REAL ID siguen siendo válidas para conducir y para otros fines de identificación fuera de los requisitos federales.\n\nEl aviso indica que la tarifa de US$ 18 por persona no es reembolsable.\n\n“Este aviso constituye un paso más en el proceso de cumplimiento de la ley REAL ID, promulgada hace más de 20 años y finalmente implementada por la secretaria (de Seguridad Nacional Kristi) Noem a partir de mayo de 2025”, declaró un portavoz de la TSA a CNN. “La TSA está colaborando con las partes interesadas y sus socios para garantizar la seguridad y la eficiencia en nuestros puntos de control. En los próximos días se anunciará información adicional”.\n\nCNN se ha puesto en contacto con la TSA para obtener información adicional sobre cuándo podría entrar en vigor esta norma propuesta.",
  "authors": [
    "Devon M. Sayers",
    "Alexandra Skores"
  ],
  "url": "https://cnnespanol.cnn.com/2025/11/20/eeuu/viajeros-no-posean-real-id-multados-trax"
}