{
  "title": "The best Nintendo Switch controllers to buy right now",
  "text": "Editor’s note: Black Friday doesn’t officially take place until Friday, November 28th; however, if you want to shop ahead of time, we’ve rounded up the best early Black Friday deals you can already get.\n\nThe Nintendo Switch 2 has arrived, but we’re not going to up and forget about the original Switch. We’ve still got love for the console and its millions of owners. That’s why we’ve kept testing controllers that might be a good fit for you. Even as many accessory makers are making controllers with the Switch 2 in mind (with likely more to follow soon, given that Nintendo shared that its focus is fully set on the newer console), most of the resulting gamepads to come out also work just fine on the original Switch.\n\nIn terms of any differences between Switch and Switch 2 controllers, there are fewer than you might think; there may be a GameChat button on it that’ll serve no purpose until you eventually upgrade to a Switch 2, but that’s an easy thing to overlook.\n\nThe options below are great for many types of gamers. However, if you’re looking for newer options than the ones listed below, keep tabs on our updated guide to the best Switch 2 controllers. Nintendo’s Switch 2 Pro controller is the only Switch 2 controller released so far that won’t work on the original Switch. The rest that we’ve included do.\n\nIn this buying guide, we’ll focus on wireless controllers that are both comfortable and reliable, as well as a few options that come with unique features designed that may match your unique play style.\n\nThere are some things that are worth knowing if you buy a third-party wireless controller (as in, one not made by Nintendo), it may not support HD rumble, it probably won’t have NFC for Amiibo, or be able to wake the Switch remotely. However, there are some exceptions, which we feature below.\n\nWhat we’re looking for How we test Collapse We test Nintendo Switch controllers by playing with them with a standard grip — the same way most gamers do. We test how easy they are to connect to the Switch, as well as how reliably they stay connected. Then, we jump into a game. Since some controllers are better suited to specific genres than others, we try a variety of titles, including fighting games like Super Smash Bros. Ultimate, racers like Mario Kart 8 Deluxe, and shooters like Overwatch 2. We pay attention to how everything feels — buttons, triggers, analog sticks, the D-pad — noting whether anything seems off. Connectivity Collapse Does it support Bluetooth? Can you use it in wired mode? Are there alternate wireless modes, such as 2.4GHz? Ideally (but not always), a controller we recommend is compatible with other platforms, too. Quality Collapse Do the buttons, sticks, and triggers feel good and sturdy? Does the controller have a satisfying, well-balanced weight? Does it use premium materials for the casing and grips? Any connection issues or glitches? Extra features and customization Collapse Are there rear-facing buttons? Does it support macro settings? Can you remap buttons? Is there software support for tweaking controller settings? Does it have interchangeable buttons or sticks? Can you fine-tune vibration and sensitivity? Value Collapse Is it priced fairly? Are the features and quality worth the money?\n\nThe best Nintendo Switch controller for TV mode\n\nSupported platforms: Nintendo Switch 2, Nintendo Switch, PC, Steam Deck, mobile, Apple TV / Connectivity: Bluetooth, wired / Connector type: USB-C / Mappable rear buttons: No / Software customization: No / Rumble: Yes, HD / NFC: Yes / Motion: Yes / Power: Built-in rechargeable / Console Wakeup: Yes (but not the Switch 2)\n\nEver since the Switch launched, Nintendo’s first-party Pro controller has been the best gamepad for the console. In many ways, it rivals the standard models from Sony and Microsoft in terms of comfort and build quality. Aside from the Joy-Cons, the Switch Pro Controller is one of an elite few wireless options that includes good rumble, gyroscopic movement support, and an NFC reader for Amiibo cards and figurines. It’s also one of a few controllers we’ve tested that can remotely turn on the Switch without being plugged into it. It’s compatible with the Switch 2 (although, it can’t wake the new console from standby— you’ll need a Switch 2 Pro Controller for that, or one of the several third-party options included in our guide to the best Switch 2 controllers).\n\nThe gamepad is built like a tank, and its battery life is so good that it sometimes seems like it’ll never run out. Nintendo says that it lasts around 40 hours per charge, so it’ll likely take casual gamers a long time to run down the battery.\n\nPhoto: James Bareham / The Verge\n\nThe best Switch controller for handheld mode\n\nSupported Platforms: Switch, Switch OLED / Connectivity: Wired / Connector type: Joy-Con slots / Mappable rear buttons: Yes / Software customization: No / Rumble: No / NFC: No / Motion: No / Power: via Joy-Con slots / Console Wakeup: No\n\nI’m sure there are some people who enjoy using Joy-Con controllers, but kids and small-handed folks aside, most people probably wouldn’t say they’re very comfortable. If you struggle with hand pain when you use the Switch, that’s where the Hori Split Pad Compact can probably help out a bit.\n\nThe Split Pad Compact is a — you guessed it — a more compact alternative to the Split Pad Pro, which has unfortunately become tougher to find at a reasonable price. Similarly, it comes in a variety of colorways, and it adds some comfort to using the Switch in handheld mode. One slides into each side of the Switch console like Joy-Cons, but unlike Nintendo’s default controllers, Hori’s gamepad features big, easy-to-reach buttons and generously sized triggers and analog sticks, all of which feel great in play. It also provides more grip than Joy-Con do, which is particularly useful for people who need to get a better handle on the console for fast-paced gameplay, or to stay comfy over longer play sessions.\n\nThe Split Pad Compact fits in your Switch’s Joy-Con slots and doubles as a standalone controller with the optional attachment set. Photo by Cameron Faulkner / The Verge\n\nThe Split Pad Compact doesn’t have batteries or sensors — or support for rumble, motion, IR, or NFC — so it’s completely useless when detached from the Switch. It’s only for handheld mode unless you purchase the Split Pad Compact Attachment that turns it into a wired controller. We don’t recommend most people go that route since the attachment usually (but not always) costs somewhere close to the amount of Switch Pro Controller, which is a shame considering it doesn’t add any of the aforementioned features. It does add a 3.5mm headphone jack when plugged in via USB to the Switch’s dock, however.\n\nThe best Xbox-style controller for the Switch\n\nSupported Platforms: Switch, PC, Steam Deck, mobile, Apple TV / Connectivity: Bluetooth, wired / Connector type: USB-C / Mappable rear buttons: Yes / Software customization: No / Rumble: Yes / NFC: Yes (only in KK3 Max) / Motion: Yes / Power: Built-in rechargeable / Console Wakeup: Yes\n\nOn the surface, the GuliKit KingKong 3 Pro and KingKong 3 Max are similar to the last-gen models they replaced, which took design cues from Microsoft’s standard Xbox controller but rivaled the Switch Pro Controller in terms of build quality and features.\n\nBut there are several notable improvements and additions if you scratch deeper. They each have Hall effect dual-mode triggers (both can switch between analog and digital, but the KK3 Max exclusively adds physical trigger stops), in addition to RGB LED-surrounded Hall effect analog sticks. They each have GuliKit’s powerful magnetic vibration motors with two intensity levels and three distinct modes (including the Switch’s HD rumble). You can even customize the swappable face buttons to match your preferred platform, and to the delight of tournament players, you can play with a 1,000Hz polling rate for reduced input lag on PC (wired or wireless via a dongle).\n\nAdditionally, both controllers feature detachable rear-facing paddles. You get two metal moon-shaped paddles with the KK3 Pro that protrude further from the controller than the extra four you get with the KK3 Max, which are longer and curved to match the contour of the controllers’ rear grips. The latter are similar to the paddles on the Xbox Elite Series 2 and even borrow the same installation technique — just push them into the designated holes on the back. They require a lot more force, though they won’t easily dislodge.\n\nGuliKit’s newest Switch controllers offer ample customization. Photo: Quentyn Kennemer / The Verge\n\nThe best Switch controller that’s also great for PC and Steam Deck\n\nSupported Platforms: Switch, Switch 2, PC, Steam Deck, mobile, Apple TV, Android, macOS, Apple devices / Connectivity: 2.4GHz, Bluetooth, wired / Connector type: USB-C / Mappable buttons: Yes, four / Software customization: Yes / Rumble: Yes / NFC: No / Motion: Yes / Power: Built-in rechargeable / Console Wakeup: Yes, including Switch 2\n\n8BitDo’s Ultimate 2 Bluetooth Controller is a minor step forward compared to the first iteration, but it comes with new features you might care about. It still feels like a Switch Pro Controller in shape, with a similarly short grip profile that larger hands may not prefer. As for what’s changed internally, you’re getting more durable TMR joysticks, plus two new mappable buttons near the triggers (totaling four customizable buttons). Speaking of the triggers, they’re adjustable thanks to new switches that can alter how much you have to pull them to register an input. It’s particularly great for first-person shooters or action games where speed is paramount.\n\nIts haptics are decent in some games, but not nearly as good as Nintendo’s HD Rumble, and it’s missing Amiibo support, though it does feature motion controls — along with a hidden trick that allows you to wake a docked Switch and Switch 2 by giving the controller a little shake. It’s a nice value compared to the Switch Pro, as well as most other third-party options because it also includes a charging dock with an integrated 2.4GHz transmitter.\n\nThe Ultimate 2 controller comes in two variants, but we recommend the Bluetooth model for Switch owners because it’s the only version that’s compatible. Additionally, it’s compatible with the Switch 2, the Steam Deck, PC, macOS computers, and a slew of other Bluetooth-ready devices. Plus, it includes both 2.4GHz connectivity, in case you need a more reliable connection for compatible devices.\n\nA well-rounded Switch controller that looks like a DualShock\n\nSupported Platforms: Switch, Switch 2, PC, Steam Deck, mobile, Apple TV, and more / Connectivity: Bluetooth, 2.4GHz, wired / Connector type: USB-C / Mappable buttons: Yes, four / Software customization: Yes / Rumble: Yes / NFC: No / Motion: Yes / Power: Built-in rechargeable / Console Wakeup: Yes, including Switch 2\n\nThe 8BitDo Pro 3 is the company’s latest high-end controller. On its face, the biggest difference between it and the similarly-priced Ultimate 2 is its PlayStation DualShock-esque stick layout, which alone might enough to convince some gamers to get it. The Pro 3 improves on its predecessor by featuring swappable buttons that can be detached with its included magnetic suction tool. With it, you can go from the Nintendo layout to the Xbox layout. Otherwise, this model’s internal specs and compatibility are very similar to that of the Ultimate 2.\n\nThe Pro 3 features TMR joysticks, plus Hall effect triggers with switches that toggle between full pulls or shorter clicks for either trigger. Just like the Ultimate 2, the Pro 3 has four customizable buttons that can be assigned almost any other button, or combination of buttons, through the company’s Ultimate V2 app on PC or by pressing certain buttons together, as listed in the manual. Additionally, the controller supports turbo mode.\n\nCompared to most other Switch controllers, the Pro 3 stands out due to its PlayStation-style layout of D-pad and sticks. You may prefer this model if you play a lot of retro games that prioritize the D-pad, which is more easily accessible than on most other Switch controllers. One other fun perk of the Pro 3 is its swappable joystick caps. Two arcade stick-like knobs are included that make certain games feel more rewarding to play, such as fighting games.\n\nEach controller includes swappable arcade stick caps. Photo by Cameron Faulkner / The Verge\n\nAn adapter that lets you use your own controllers\n\nThere are a few other devices that allow you to use third-party controllers, but 8BitDo’s is the best value. Instead of spending $80 on a Switch Pro controller, the $19.99 8BitDo Wireless Bluetooth USB Adapter 2 lets you turn most Bluetooth controllers you already own into a wireless Switch controller. It plugs into your Switch dock (or directly into the console if you have a USB-A to USB-C adapter) and supports a wide variety of models, from the latest Xbox and DualSense controllers to last-gen gamepads for the Wii and PlayStation 3. (Note: the first-gen model can’t connect to most Xbox Bluetooth controllers due to a Bluetooth incompatibility, so make sure you get the latest model we’ve linked to.)\n\nTo our delight, the PS5 DualSense controller we tested it with worked incredibly well, with better-than-average rumble and more responsive motion controls than many dedicated Switch controllers offer. What’s more, so long as you’re using one of the newer Xbox Series X or S controllers, an Xbox One Bluetooth controller, a DualSense, a DualShock 4, or the Switch Pro Controller, you can customize their button mapping, analog stick sensitivity, and more within 8BitDo’s computer and mobile app.\n\n8BitDo’s dongle supports most Bluetooth controllers, including official Xbox and PlayStation gamepads. Image: 8BitDo\n\nIf you already have a controller you really like and don’t mind jumping through a few small hoops to connect it, 8BitDo’s affordable adapter deserves a spot in your entertainment center. If you plan to use more than one third-party controller at a time, you’ll need an adapter for each controller (and a USB hub), but if you have a lot of controllers sitting around, it might be worth it.\n\nOther Switch controllers we tested\n\nWe like CRKD’s Nitro Deck around here. It’s a cradle-style controller that holds the Switch between a pair of Hall effect sticks, outfitting it with a standard array of face buttons, four programmable back buttons, turbo functionality, gyro motion controls, and rumble. It has passthrough charging, though not passthrough video, which would allow it to double as a dock for TV gameplay. The step-up Nitro Deck Plus adds said functionality (with a USB-C to HDMI adapter), along with Bluetooth connectivity and adjustable vibration intensity / analog sensitivity. We’ve found these to be notable improvements, but we wish the passthrough solution was more elegant and that CRKD could solve the ergonomics (particularly on the right side, where the analog and button placement can cause discomfort).\n\nWe tested the GameSir T4 Cyclone Pro ($49.99) for consideration. It offers a few of the same functions as the GuliKit KingKong 3 — including remappable buttons, Hall effect sticks, and two distinct macro buttons — along with dedicated vibration motors in the triggers, which is something the GuliKit doesn’t match. That said, it falls just short due to mushy-feeling buttons. GameSir considers the extra padding under the buttons a feature that makes the impact softer, but we felt it takes away from the experience. Also, although it’s perfectly usable with the Switch, the Pro’s button labeling takes after Microsoft’s, which may not be ideal for those who have trouble memorizing inputs. We also found resyncing with the Switch to be a chore after switching from a mobile device or a Windows PC.\n\nWe also recently tried several wireless PowerA controllers, including the GameCube Style Wireless Controller ($59.99) and a Pikachu-themed version of the standard PowerA Enhanced Wireless ($44.99). We like the fun design of PowerA’s controllers, but they don’t live up to the quality of the models we recommend above, which is a shame considering some cost nearly as much. The GameCube-style wireless controller is a pretty faithful recreation of the original if you fancy a pure Super Smash Bros. experience, but it’s barebones with no rumble, NFC, or IR. It’s an easy way to get the old-school feeling back if you don’t already have a Bluetooth-based alternative to use with 8BitDo’s USB Adapter 2.\n\nWhat’s coming next?\n\nI encourage anyone who’s searching for a new Switch controller to check out The Verge’s buying guide for the best Switch 2 controllers. All of the options it includes (except for Nintendo’s Switch 2 Pro) work on the original Switch, not just the Switch 2, and we’ve focused on highlighting affordable, yet capable options. In the guide, you’ll find out about the EasySMX S10, which has almost as many features as Nintendo’s pricier Switch 2 Pro for $30 less. We’re also testing new models for potential inclusion in the future.\n\nUpdate, November 18th: Updated to reflect current pricing and availability. Added links to The Verge’s buying guide to the best Switch 2 controllers, most of which work fine on the original Switch.",
  "authors": [
    "Quentyn Kennemer",
    "Cameron Faulkner",
    "Quentyn Kennemer Cameron Faulkner"
  ],
  "url": "https://www.theverge.com/23350899/nintendo-switch-controllers-best-wireless-joy-con-gamepad"
}