{
  "title": "Joby Aviation makes ‘corporate espionage’ claims in lawsuit against rival Archer",
  "text": "Electric air taxi developer Joby Aviation is suing Archer Aviation over allegations its rival used stolen trade secrets extracted from a former employee to interfere in its business.\n\nThe lawsuit, filed Thursday in the Superior Court of California in Santa Cruz County, makes a series of allegations against Archer and George Kivork, a former Joby employee. Joby alleges Kivork, who was hired by Archer, stole trade secrets that were then used by Archer.\n\nIn the lawsuit, Joby alleges that two days before announcing his resignation, Kivork “exfiltrated a cache of highly valuable Joby filings containing confidential partnerships terms, business and regulatory strategies, infrastructure strategies for vertiports and airport access, and technical information about Joby’s aircraft and operations,” the complaint states.\n\nJoby claims Archer approached one of its strategic partners and shared detailed information about confidential terms of its exclusive agreement with Joby. According to the complaint, this information was known to Kivork and contained in the files he allegedly stole.\n\n“This is corporate espionage, planned and premeditated,” the complaint states. “Kivork and Archer’s behavior has left Joby with no choice but to bring this action to protect Joby’s valuable confidential and proprietary information.”\n\nArcher was quick to strike back.\n\n“Joby is turning to baseless litigation in an attempt to distract from its own shortcomings and slow down its leading competitor,” Eric Lentell, Archer’s chief legal and strategy officer, said in an emailed statement to TechCrunch.\n\n“Joby’s case is entirely without merit. The complaint, regarding a non-technical employee who recently joined Archer in a business development role, does not identify a single specific trade secret let alone any evidence of misappropriation,” said Lentell. “As Joby knows, Archer has implemented rigorous employee onboarding procedures to prevent against the very thing it is accused of. Joby is improperly attempting to weaponize the legal system to achieve through bad faith litigation what it cannot accomplish through fair competition. Archer remains focused on building the future of advanced aviation in America.”\n\nArcher Aviation and Joby are both based in California and went public in 2021 via mergers with special purpose acquisition companies. Both are developing electric air taxis as well as pursuing defense applications to its technology.\n\nFor instance, Archer signed an exclusive deal with weapons manufacturer Anduril earlier this year to jointly develop a hybrid gas-and-electric-powered vertical take-off and landing (VTOL) aircraft for critical defense applications. Meanwhile, Joby signed an agreement with defense contractor L3Harris Technologies to “explore opportunities” to develop a gas-turbine hybrid VTOL aircraft that can fly autonomously.\n\nThe lawsuit puts the two competitors on a far more combative path.\n\nArcher has been in the legal hot seat before, although that was ultimately settled.\n\nWisk, which is now a subsidiary of Boeing, sued Archer in 2021 for “brazen theft” of confidential information and intellectual property. Those files included over 50 trade secrets that Wisk alleged were stolen by a former employee who was later hired by Archer. The lawsuit dragged on for two years before the parties settled the legal dispute and agreed to collaborate.",
  "authors": [
    "Kirsten Korosec",
    "Transportation Editor",
    "Sarah Perez",
    "Julie Bort",
    "Lorenzo Franceschi-Bicchierai",
    "Ram Iyer",
    "Connie Loizos",
    "Anthony Ha",
    "Rebecca Bellan",
    "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var"
  ],
  "url": "https://techcrunch.com/2025/11/20/joby-aviation-makes-corporate-espionage-claims-in-lawsuit-against-rival-archer/"
}