{
  "title": "Kevin Spacey dice que no tiene un hogar",
  "text": "CNN —\n\nEl actor ganador del Oscar Kevin Spacey ha dicho que “no tiene hogar”, citando los costos que ha enfrentado tras las acusaciones de agresión sexual.\n\nEn una entrevista publicada el miércoles por el periódico británico The Daily Telegraph, Spacey reveló que las consecuencias financieras de las acusaciones, que salieron a la luz en 2017, le hicieron perder su casa.\n\nEn 2022, un jurado de Nueva York determinó que Spacey no era responsable de agresión por las acusaciones hechas por el actor Anthony Rapp en las que denunció que Spacey se acostó con él después de una fiesta en 1986. Y en 2023, Spacey fue absuelto de varios cargos de agresión sexual por un tribunal de Londres, Reino Unido, en un caso separado.\n\n“Los costos de estos últimos siete años han sido astronómicos. He tenido muy pocos ingresos y todo ha sido gastos”, dijo.\n\n“Todo está en depósitos, y espero que en algún momento, si las cosas siguen mejorando, pueda decidir dónde quiero establecerme de nuevo”, añadió Spacey.\n\n“Estoy viviendo en hoteles, en Airbnbs, voy donde está el trabajo. Literalmente no tengo hogar, eso es lo que intento explicar”, dijo, agregando que su situación financiera “no es buena”.\n\nKevin Spacey, de 66 años, construyó una carrera muy exitosa tras comenzar como actor de teatro en los años 80. Ganó el premio Oscar a mejor actor de reparto por “The Usual Suspects” (1995) y el premio Oscar a mejor actor principal por “American Beauty” (1999).\n\nFue director artístico del teatro Old Vic de Londres entre 2004 y 2015, y protagonizó, interpretando a Frank Underwood, el drama político de Netflix “House of Cards”.\n\nKevin Spacey fotografiado fuera del Tribunal de la Corona de Southwark en Londres en julio de 2023. Dan Kitwood/Getty Images\n\nSin embargo, en 2017, el actor Anthony Rapp dijo que Spacey le hizo una insinuación sexual en 1986, cuando Rapp tenía 14 años y Spacey 26.\n\nA medida que surgieron otras acusaciones de abuso, Netflix rompió lazos con Spacey en la serie “House of Cards” y sus escenas en la película de Ridley Scott “All the Money in the World” volvieron a filmarse por el fallecido Christopher Plummer.\n\nSpacey negó cualquier acusación de conducta inapropiada o criminal, y un jurado de Nueva York lo declaró no responsable de agresión contra Rapp en octubre de 2022. También fue declarado inocente de siete cargos de agresión sexual y dos cargos de otros delitos sexuales graves en un tribunal de Londres en julio de 2023.\n\nA pesar de estas victorias legales, Spacey aún no ha sido recibido de nuevo en Hollywood.\n\n“Estamos en contacto con personas extremadamente poderosas que quieren que vuelva a trabajar”, dijo a The Daily Telegraph, que anteriormente ha publicado declaraciones de apoyo a Spacey de colegas de Hollywood como Sharon Stone y Liam Neeson.\n\n“Y eso sucederá en su debido momento. Pero también diré que lo que la industria parece estar esperando es recibir permiso, de parte de alguien que tenga un enorme respeto y autoridad”.",
  "authors": [
    "Jack Guy"
  ],
  "url": "https://cnnespanol.cnn.com/2025/11/20/entretenimiento/kevin-spacey-sin-hogar-trax"
}