{
  "title": "How Netflix’s “Physical: Asia” Changed My Perception Of My Body",
  "text": "At the beginning of 2025, I wrote one resolution for my body: I would do whatever it took to no longer be scrawny. As I approach 30, I realize I feel weaker than I should in my own body, as I had long neglected exercise in service of my career.\n\nIf you believe in deeply personal journalism — the kind that connects us in our hardest, most honest moments — please consider becoming a HuffPost member today.\n\n\n\nAll of a sudden, my lithe frame felt uncomfortable and boyish to me, almost as though it had been frozen in time from when I was in high school, which is the last time I had a steady exercise regimen. With newfound conviction, I began to eat four (more balanced) meals a day and to lift weights. Today, 10 months later, I’m nearly 30 pounds heavier.\n\nAdvertisement\n\nAlthough I’m not exactly where I want to be yet, I managed to shatter one of the most relentless beliefs I’d had about my body — that, as an Asian man, I was destined to be skinny and devoid of any substantial muscle mass forever.\n\nThat’s partly why I delved into the Netflix show “Physical: Asia,” a reality competition show where athletes representing eight countries from across Asia and the Pacific region compete in extremely physically demanding challenges to win a massive cash prize. The one thing all contestants have in common is that no matter where in the diaspora they come from, they’re brolic as hell.\n\nAdvertisement\n\nIf you haven’t seen the show, one of its distinguishing features is how many different types of athletes take part in it, from circus acrobats to bodybuilders to Turkish oil wrestlers. The participants’ bodies are the focal point: The competition starts with a mold of each athlete’s torso for the other participants to size up the moment they walk onto the set. The latest season has people you’ve probably heard of before, including the world-renowned Filipino boxer Manny Pacquiao.\n\nTo most people, “Physical: Asia” probably reads as any regular athletic competition show, but for some Asian Americans like me, it’s been awakening something else. It’s the first time I’ve seen so many people of Asian descent with so many different body types on TV. Growing up in the West, Asian bodies have been depicted as weak, subservient and physically small.\n\nFor Asian women, that’s partially a function of decades of Western colonization and fetishization cemented by classic films like “Madame Butterfly” and propagated by iconography from the Vietnam War. For Asian men, it’s rooted in a decades-long process of “emasculation” that stemmed from xenophobia, and let’s not forget, fears that we would steal white women.\n\nAdvertisement\n\nWe’ve historically been portrayed as foreign and decidedly unsexy, and growing up in early 2000s America with no flattering depictions of us meant we had no references for how our bodies could look. My relationship to my own body has always reflected this anxiety of not being visible enough — in my case, not being physically imposing enough in a country where assertiveness and hypervisibility is how you make friends and get ahead.\n\nWhen I was younger, I couldn’t gain weight no matter how hard I tried. Although I’m sure that’s an envious reality to some, I felt like I was unwillingly participating in stereotypes that were already projected onto my body, ideas that, as an Asian man, I was physically weaker and smaller than other men.\n\nAs I’ve gotten older, I’ve been examining beliefs that have held me back and prevented me from growing. As part of my journey to grow stronger, I sought the advice of a Vietnamese American personal trainer and friend, Tracy Bui, who helped me divorce myself from the idea that I was bound to the body I’ve always had, and who affirmed that Asians can, in fact, be big and strong.\n\nAdvertisement\n\nPerceptions of Asian bodies are not solely cultural, of course: Body mass and fat depends on a variety of factors, including environment, diet and genetics. Many East and South Asians share a genetic variation called GDF5 that contributes to our skeletal frame being smaller. It’s also widely believed by the scientific community that we tend to store fat in our abdomen more, so it can be more challenging for some of us to gain muscle and look snatched.\n\nBut the true revelation here is that understanding and working with my body, instead of passively accepting the narratives our culture has about Asian bodies, allowed me to feel more autonomy over my physical self. Sure, it might take me a little extra effort to have a six-pack and large, chiseled arms, but it’s absolutely possible.\n\nIf there’s something that clicked for me on “Physical: Asia,” it’s that, away from the Western gaze, mainland Asians seem to have a strong grasp on the reality that we have every possible body type known to man. We can be snatched and toned like Kim Dong-hyun, the UFC fighter and the captain of the South Korean team in the show; be a strong, badass woman like Jar Uracha Teerawanitsan, a CrossFit athlete from the Thai team; or have biceps so massive they look like they could strangle a gator, like the Indonesian team captain Igedz Executioner.\n\nAdvertisement\n\nI’d love for my community to see more empowered depictions of ourselves — especially physically — in every area of life. It might start with distancing ourselves from a colonial mindset and exploring the perspectives of people who look like us and have been free to define their bodies on their own terms.\n\nIdentifying and ultimately freeing ourselves from harmful narratives about ourselves can be a convoluted and sticky process — ultimately, though, it’s an essential part of taking back our power.",
  "authors": [
    "Contributing Writer"
  ],
  "url": "https://www.huffpost.com/entry/physical-asia-netflix-asian-stereotype-bodies_n_690cd95ae4b094b50cf89d53"
}