{
  "title": "How some Charlotte residents are mobilizing during the ICE raids and arrests",
  "text": "The pews of the Charlotte church were packed as onlookers watched a man restrain a woman while a group in bright vests furiously blew their whistles and filmed the interaction, chanting, “La migra esta aqui.”\n\nAnother group loudly sang, “This little light of mine, I’m gonna let it shine.”\n\nClapping then erupted from the crowd.\n\nThe scene was among several role-play scenarios hundreds watched Wednesday evening at Dilworth United Methodist Church as part of a training on how to respond to the expanding federal immigration enforcement operation that has gripped the Charlotte area and left residents on high alert.\n\n“Let’s practice our whistling language,” Rev. Joel Simpson, a pastor at First United Methodist Church in Taylorsville, said before a dissonant symphony of whistles filled the church.\n\n“We’re going to report active operations that are happening in our city, alert people nearby and offer reminders of our rights,” Simpson, who led the training, told the crowd. “We’re going to document and record unlawful practices, and we’re going to deter violence by getting as many people as possible to join quickly as an organized presence.”\n\nThe plan is simple: Volunteers sign up for shifts and receive instructions from a “patrol dispatch team” on specific zones in Charlotte they will drive around in and alert people when they see immigration enforcement activity. They’re advised to do it in pairs, keep a safe distance from agents and to never try to physically impede law enforcement.\n\nThe initiative is just one of many launched by Charlotte residents to help immigrant neighbors as the Trump administration touts over 250 arrests in the area since the aggressive immigration crackdown began over the weekend.\n\nParents are banding together to guard school entrances or carpool students to class, and business owners across the city are patrolling their neighborhoods and closing their doors to protect their customers.\n\nPeople throughout Charlotte have been using many of the same tactics employed in Chicago – including watching for raids, blowing warning whistles and carrying signs advising people of their rights. Flags from Honduras, Colombia and Mexico were seen adorning cars and hanging from homes and businesses.\n\nStill, the fear throughout the city is palpable: families are keeping their children home from school and taking off from work, worrying they’ll be targeted by federal immigration agents.\n\nTrainees simulate an immigration arrest, posing as federal agents and those documenting them. CNN\n\n‘Loving your neighbors is holy’\n\nImmigrant worker group Siembra NC organized Wednesday’s event at the church to train volunteers to help immigrants safely get to school and work and guard against constitutional violations during immigration enforcement activities, according to the organization.\n\nVolunteers stood outside the church doors, passing out warning whistles and held signs saying “Loving your neighbors is holy.”\n\nHundreds of volunteers have attended training sessions held by the group to help immigrants as they travel within the city, document and record “unlawful practices” by agents and warn about enforcement activity, Simpson said.\n\n“They’re coming out on weeknights and they’re saying this is how we need to be spending our time and we want to be on the streets and in our communities, making sure people are cared for,” Simpson told CNN.\n\nDilworth United Methodist Church is seen packed Wednesday evening during a training event. CNN\n\nOver 1,000 people registered for Wednesday’s training and some people had to be turned away, the pastor said.\n\nSimpson said they got “best practices” from other communities that have been stops in the administration’s immigration blitz, including Chicago, Los Angeles and Washington, DC.\n\n“People are telling me as they go through this training like, ‘I’m feeling empowered,’” he said. “‘I feel like I can do something and there’s a way to channel my love and my anger and my fear into something that supports other people.’”\n\nThat was the case for Maria Klein, who has used the training as a way to channel her frustration about the crackdown in her city.\n\nShe attended the training because she cares about “our children who should be able to go to school safely, for our parents who should be able to go to work for the American dream.” Klein, who teaches English as a Second Language to adults, says many of her students have stopped attending class.\n\n“This was an opportunity to really do something practical and to have an immediate impact,” Klein told CNN.\n\nUS Border Patrol agents stand outside a Home Depot store on Wednesday in Charlotte, North Carolina. John Moore/Getty Images\n\nParents and teachers help families as school attendance plummets\n\n“What is gonna happen if I go home and my parents aren’t there?”\n\n“What does that mean if my parents get taken away?”\n\nThese are the questions teacher Jamie Roldan told CNN she has been getting from students at Charlotte East Language Academy since the immigration crackdown began in the city.\n\n“I tell them that I’m gonna fight if someone comes to my door. I’m fighting – hands, feet, it doesn’t matter. You’re not coming in my classroom and taking any of my kids,” Roldan said. “My classroom is a safe space and it will stay that way.”\n\nAmid “Operation Charlotte’s Web” – the immigration enforcement operation in the city named after the classic 1952 children’s book – more than 30,000 students were absent from Charlotte-Mecklenburg Schools on Monday, about 20% of the district’s enrollment.\n\n“We just understand that they were not in school receiving education, advancing their social skills and we know that that there was an impact to those homes where parents had to modify their work schedules,” Charlotte Mayor Pro Tem Danté Anderson told CNN Wednesday. “They had to have an economic impact out of fear that something would occur at those schools.”\n\nThe district issued a statement Sunday night that no immigration activity had happened on their campuses and that leaders hadn’t been informed of impending action. There were no reports of immigration enforcement on their campuses on Monday or Tuesday.\n\nCharlotte-Mecklenburg Schools teacher David Gillespie says hallways and classrooms were nearly empty on Monday.\n\n“I’m not sure which of my students I’m going to see again,” Gillespie told CNN affiliate WCNC. “Whether because their parents were involved in detainments or because their parents have to make that unfortunate safety calculus — is it worth it to send my kids to school and put myself at risk?”\n\nUS Border Patrol chief Greg Bovino leaves a 7 Eleven gas station while searching for undocumented immigrants on Monday, in Charlotte, North Carolina. Ryan Murphy/Getty Images North America/Getty Images\n\nAs attendance plummets, some parents in the district are organizing to help families who are afraid to leave their homes.\n\nSome PTA members are standing guard at school entrances during drop-off and pick-up so they can alert staff and families if they see federal immigration agents, WCNC reported. Others are passing out information packets and using PTA funds to help families experiencing food insecurity or transportation issues.\n\n“We’re standing there bearing witness and being part of the community,” PTA member Amy Hawnelson told WCNC. “They do not stick around — and that’s why we’re here.”\n\nAnother member, Mike Mastry, said they want to help students feel safe at school.\n\n“Seeing a familiar face that’s friendly and smiling helps bring a sense of normalcy,” Mastry told WCNC. “When kids don’t know what’s going on, they get disoriented and have trouble learning.”\n\nRoldan said parents with legal status are picking up children whose parents may not have legal status to bring them to school.\n\nGillespie says he’s reaching out to families to help students stay on top of schoolwork.\n\nExtracurriculars have been impacted by the operation too. OurBRIDGE, an organization that helps newly arrived immigrant children and their families, has suspended its afterschool programs after Border Patrol activity at one of its sites, the group announced on social media.\n\nHigh school students in the district staged a walkout Tuesday morning to protest immigration enforcement in the city. Several hundred students gathered around the edge of a football field at East Mecklenburg High School, many wearing black and holding flags, photos of the demonstration showed.\n\n“The students’ main objective is to provide protection and cover to their fellow students of immigrant descent,” a news release on the demonstration said.\n\nA person is detained by US Border Patrol agents on Wednesday in Charlotte, North Carolina. Ryan Murphy/Getty Images\n\nBusiness owners work to protect customers\n\nCharlotte business owner Bryan Li enrolled in a training session offered by a local advocacy group and has been out patrolling the city the past few days, looking for federal agents and reporting back to advocacy groups that alert the community.\n\nLi, a US citizen born in Hong Kong, told CNN he couldn’t sit at home and not do something.\n\n“When harm is done, more people rally, learn and prepare so we can help protect our most vulnerable,” Li told CNN. “Charlotte will stand united and protect our immigrant community with everything we have.”\n\nWhile people like Li patrol the city, many businesses have shuttered their doors, fearing their customers will be a target.\n\nAbout half the mom-and-pop businesses the community development organization CharlotteEast works with have closed their doors at some point, despite all of them being owned by US citizens, Executive Director Greg Asciutto said Tuesday.\n\n“From strictly an economic standpoint, it’s pretty catastrophic right now,” Asciutto said, comparing current closures to the first week of the coronavirus pandemic in the area.\n\nA Colombian bakery open for 28 years closed its doors Saturday after men in tactical gear chased and tackled people outside the shop. Community members showed up afterwards to guard the business.\n\nBeth Clements, who stood outside the bakery wearing a yellow vest, had been standing guard there for three days.\n\n“I’m going to walk the streets with my whistle and I want to keep my neighbors protected because they deserve protection and they deserve to live in a world where they’re not scared,” Clements said.",
  "authors": [
    "Dalia Faheid",
    "Andy Buck",
    "Dianne Gallagher"
  ],
  "url": "https://www.cnn.com/2025/11/20/us/charlotte-ice-raids-residents-mobilizing"
}