{
  "title": "Europe banned new gas cars after 2035 — now it’s reconsidering",
  "text": "Mercedes-Benz CEO Ola Källenius is the eternal optimist, and for good reason. He has long pushed the European Union to roll back its lofty goal of phasing out new internal combustion engine cars, arguing that weakening the rules was a return to pragmatism and not capitulation to opponents of Europe’s green agenda.\n\nHis push is working. The rigid deadlines for phasing out combustion engines after 2035 are “no longer feasible,” Källenius told The Verge in a recent interview, given infrastructure bottlenecks and the sluggish adoption of EVs by consumers. More flexibility was needed to protect jobs and competitiveness, give consumers greater choice, and ensure manufacturers can finance the transition profitably.\n\n“This is not a retreat,” he said in defense of loosening the 2035 deadline. “It is an upgrade to a smarter strategy that matches Europe’s ambitions with a thoughtful plan for success.”\n\n“This is not a retreat.”\n\nWhen the economy was humming and jobs were plentiful, Europeans largely backed an ambitious climate agenda. Now, with the economy limping and automakers and suppliers slashing tens of thousands of jobs, support has shifted toward slowing down the transition.\n\nKällenius said that carmakers had proved their commitment to fighting global warming with a decade of huge investments in new technology, electric vehicles, and battery plants.\n\n“Taking a more pragmatic approach could be a way of delivering on Europe’s climate goals more effectively,” he said. “The ultimate target of achieving CO 2 neutrality in the EU by 2050 remains firmly in place. What changes is the path to get there.”\n\nCars from the vehicle manufacturer Mercedes-Benz are parked in front of a car dealership. Image: Getty\n\nReopening the ICE car ban\n\nFor now, it is still European law to ban the sale of new cars with internal combustion engines after 2035. To change that, the EU has to either repeal the law or to amend it and create exceptions that would allow the sale of conventional cars to continue beyond the deadline.\n\nAt their October summit, European leaders called on the Commission, the bloc’s executive body, to reopen the ICE car ban and present proposals by the end of the year to slow Europe’s once brisk march to a carbon-free future.\n\nThe Commission has said it is considering allowing more “technology neutrality,” which analysts say means possibly allowing plug-in hybrids and ICE cars that run on synthetic fuels or biofuels, which produce fewer emissions than conventional fuel. The auto industry has been demanding such a change for years, and wants the Commission to count hybrids and cars that run on synthetic fuels among zero-emission vehicles, even if they have an internal combustion engine beyond the 2035 deadline.\n\n“Turning the EU’s most important automotive regulation into a Swiss cheese will not restore the industry’s competitiveness,” said Lucien Mathieu, cars director at the Brussels-based lobby group Transport & Environment, in a statement in October. “It is a cynical attempt to dismantle a central pillar of Europe’s climate law. If the Commission capitulates to these demands, it will only hand a further competitive advantage to Chinese automakers.”\n\n“Turning the EU’s most important automotive regulation into a Swiss cheese will not restore the industry’s competitiveness.”\n\nKällenius noted that even after 2035 there would still be more than 200 million conventional cars on the road. Without alternative fuels and new ICE cars to replace them they would age, risking “a ‘Havana effect’ that would cause our vehicle fleet to grow even older, harming both the climate and the economy.”\n\nGermany is lobbying to weaken the ban and create a longer transition period. The German economy is barely growing after two years of recession. The auto industry’s troubles go back a lot further. Auto production in Germany peaked in 1998, but fell 25 percent in the wake of covid in 2020, and has declined every year since. And now German automakers face new competition from lower-cost Chinese vehicles.\n\nThe country’s political leaders are alarmed because of the nearly 800,000 jobs that the industry provides and because economic uncertainty is fueling a rise of support for right-wing populism. Against this backdrop, the government is throwing its weight behind industry demands to roll back climate goals and throw core gas-powered cars a lifeline.\n\n“There will be no hard cut” in 2035, German Chancellor Friedrich Merz pledged after a meeting with auto industry leaders in September.\n\nA Volkswagen e-up! electric car charges at a public fast-charging station in Hanover. Image: Getty\n\nAlternative fuels and hybrids\n\nSlowing the shift to electric vehicles aims to give carmakers and suppliers more time to keep earning money from their most profitable models and maintain their competitive edge over rivals, including the new Chinese manufacturers that are fast making inroads into European markets.\n\nThere is a danger that slowing the transition to EVs could put the huge investments that have been made in EV charging networks and battery plants at risk, which could also lead to job losses.\n\n“If tomorrow we abandon the 2035 objective, forget European battery factories,” French President Emmanuel Macron told reporters after the October leaders’ summit, pointing to the gigafactories now being built across the continent as a direct result of the 2035 deadline. Instead, he backed loosening the language of the law to allow alternative fuels and hybrids.\n\n“There will be no hard cut” in 2035.\n\nAllowing automakers to keep selling conventional cars as hybrids or with low-emission fuels is just one part of a compromise. To boost sales of economy EVs, Europeans are also working on incentives for new battery electric vehicle purchases. Manufacturers could be required to use more European-made components to be eligible for EV subsidies as a way to support jobs and push back against cheap Chinese imports.\n\nAs politicians discuss how to help automakers, the situation for the industry is increasingly dire.\n\nThe only growth in Europe’s automotive markets this year is coming from electric vehicles and hybrids, from which many automakers still struggle to earn any money because of the high costs of developing new technologies, manufacturing in Europe, and the still meager sales volumes of EVs.\n\nEuropeans bought 1.3 million battery-electric vehicles in the nine months through September, accounting for about 16 percent of total new car sales, according to ACEA, the continent’s auto lobby. But even the strong performance of electric and hybrid vehicles could not offset the steep decline of ICE cars. Overall, Europe’s new car sales grew just 0.9 percent in the first nine months.\n\nThe Polestar showroom in Stockholm, Sweden. Image: Bloomberg via Getty Images\n\n‘We’re asking for a different regime’\n\nFor some automakers, the changes that are under discussion don’t go far enough.\n\nBMW CEO Oliver Zipse told reporters in an earnings call that under the EU’s current law, manufacturers get no benefit from their investments in carbon-neutral components such as green steel or for building new, low-emission factories. He slammed the EU’s focus on regulating tailpipe emissions instead of the car’s total carbon footprint.\n\n“We are not asking for the targets to be weakened. We’re asking for a different regime,” Zipse said. “We are continually reducing our CO2 footprint but it has no impact.”\n\nSome green tech lobby groups and think tanks warn against boosting support for plug-in hybrids at the expense of full EVs.\n\nBrussels-based Transport & Environment (T&E), a green tech lobby group, concluded in a recent study that plug-in hybrids emit nearly five times more CO2 in real world driving than shown in official tests. And even when running in electric mode, PHEVs burn more fuel than manufacturers claim because their combustion engines kick in when accelerating or driving uphill, the study concludes.\n\n“We are continually reducing our CO2 footprint but it has no impact.”\n\nThe gap hits drivers’ wallets, too: Annual fuel and charging costs are about €500 higher than advertised. With an average sticker price of €55,700 in 2025, plug-in hybrids are also €15,200 more expensive than battery-electrics.\n\n“Plug-in hybrids are one of the biggest cons in automotive history,” said T&E’s Mathieu.\n\nPeter Mock, Europe managing director of the International Council on Clean Transportation, rejected the notion that plug-in hybrids are a “bridge” to electrification. He said evidence shows most drivers who switch to battery-electrics stay with them, while a large share of plug-in hybrid buyers later revert to combustion cars.\n\nMock pointed to Denmark, where battery-electrics account for about 70 percent of new sales, and Belgium at around 40 percent, as examples of how to accelerate adoption. The key, he said, is a mix of EU CO2 standards and national tax policies that make combustion cars more expensive while lowering costs for EVs — ideally in a self-balancing system where higher ICE taxes fund EV subsidies.\n\nOn e-fuels, Mock was blunt: They are too inefficient and costly for cars and trucks. “For road transport, electrification is by far the better option,” he said. “E-fuels are a distraction.”\n\nA sign for a charging point for electric cars is displayed in Bristol, England. Image: Getty Images\n\n‘The rest of the world will not stand still’\n\nThe EU’s climate policies of the past decade have attracted a lot of investment from pure EV manufacturers, battery manufacturers, and other suppliers along the EV supply chain. That’s why more than 200 business leaders from the industry wrote an open letter calling on the Commission to “Stand firm, don’t step back” in the face of legacy automaker lobbying.\n\nMichael Lohscheller, CEO of Polestar, told The Verge that watering down the 2035 ban would punish companies that have already staked their future on electrification. “It undermines the basis for the investments that companies like us have made,” he said, noting that years of negotiation went into the current framework, including with legacy carmakers now seeking to backtrack.\n\nWhile a delay might make EV demand less linear, Lohscheller said, “the shift will still happen and is happening, as we see in demand for our cars across most European markets.”\n\n“Stand firm, don’t step back”\n\nHe also warned that Europe risks falling behind global competitors if it weakens its climate goals. “We would become even less competitive in the future. The rest of the world will not stand still: they will continue to develop new, better technologies, which would put even more future EU jobs in jeopardy.”\n\nOthers agree. Lawrence Hamilton, president of Lucid Motors Europe, said that reopening the debate over the EU’s 2035 combustion car ban risks confusing consumers and slowing electric vehicle adoption. “It remains a distraction in the conversation with the consumers,” he said. “If the ICE ban is rolled back, everybody believes they’ve got longer, and consumer adoption tends to be ‘not now.’ But we want people to be thinking about making the transition to EV now.”\n\nHamilton stressed that car replacement cycles are long — often seven years or more — which means the industry needs customers to start switching today, not years down the road. He pointed out that EVs are approaching price parity with gas cars, already deliver lower total cost of ownership in many cases, and have largely overcome concerns about range.\n\nIf Europe’s automakers want to regain competitiveness — especially against China — the answer is not to slow the shift to electric, but to double down on it and tackle their own structural weaknesses.\n\n“They must close the battery cost gap, pivot to software and AI-driven manufacturing, and rediscover the entrepreneurial urgency their Chinese rivals live by,” said Andy Palmer, who played a key role in driving electric vehicle technology at Nissan and later was CEO of Aston Martin. “Europe still has immense engineering talent, but it’s held back by bureaucracy and legacy thinking. They need to catch up. And fast.”",
  "authors": [
    "William Boston"
  ],
  "url": "https://www.theverge.com/transportation/820398/eu-gas-car-ban-2035-weaken-climate"
}