{
  "title": "How ICE's Explosive Growth Threatens Every American",
  "text": "Transcript\n\nThese days, it seems like not an hour goes by\n\nwithout another brutal arrest by immigration\n\nand customs enforcement.\n\nYou've probably seen the aggressive tactics\n\nin videos online.\n\nWhile many people find these videos really disturbing,\n\nothers question why this matters to them at all.\n\nIf they're not here in the US illegally,\n\ndo they really have to care?\n\nIsn't this just law enforcement in action?\n\nToday we're gonna be breaking down how ICE's expansion\n\nof power will impact everybody in the US.\n\nThis is Incognito Mode.\n\n[tense music]\n\nSocial media monitoring is one of the big ways\n\nthat the US government surveils a lot of people.\n\nIn fact, if you're posting online,\n\nthey're probably surveilling you right now.\n\nThe State Department has expanded its use\n\nof social media surveillance to monitor anybody\n\nwho wants to enter the US.\n\nBut even if you're not a traveler here,\n\nyou're probably being surveilled.\n\nThe independent reports that ICE is expanding its use\n\nof social media surveillance\n\nto search for anti-ICE sentiment.\n\nSo if you're going to a protest\n\nor posting about ICE online in ways\n\nthat they might not like, you're probably getting scooped up\n\ninto a surveillance machine you might not even know exists.\n\nIt's been reported that one social media surveillance tool\n\nused by government agencies including ICE is Social Net,\n\nwhich can reportedly monitor up to 200 websites,\n\nsocial media platforms, another online spaces.\n\nSome of these platforms include Facebook, Instagram, X,\n\nBlue Sky, TikTok, Reddit, PayPal, OnlyFans, Cash App,\n\nWhatsApp, Telegram, Discord, chess.com for some reason.\n\nPretty much anywhere you are online,\n\nSocialNet is probably watching.\n\nIt's been reported that ICE's Homeland Security\n\nInvestigations Division has directly contracted\n\nwith Shadow Dragon, which makes SocialNet.\n\nThe problem with social media surveillance\n\nis that by its very nature,\n\nit's a massive dragnet operation.\n\nThey're collecting data on basically everyone,\n\nespecially anyone who's posting online all the time.\n\nThis massive amount of data\n\nthat's being collected doesn't just go away.\n\nAll this data is likely being stored\n\nand can potentially be used at any point in the future\n\nto target you for anything.\n\nSo right now, these tools are being used\n\nto target one kind of speech,\n\nbut in the future, an administration could choose\n\nto use it to target something entirely different.\n\nA big problem with social media surveillance\n\nis that can chill speech.\n\nYou might not post about things online if you know\n\nthat ICE agents or other law enforcement\n\nare flagging your speech\n\njust because you set a certain keyword\n\nor expressed a certain sentiment,\n\nthat's gonna dissuade people from exercising\n\ntheir First Amendment rights, going to protests\n\nor speaking out against things they disagree with.\n\n[tense music]\n\nOne of the first ways you might think\n\nof ICE impacting you is surveillance.\n\nFacial recognition is one of the ways we know\n\nthat ICE is targeting pretty much anybody\n\nthey come across who they find suspicious.\n\nImmigration officials have long used facial recognition\n\nat the border, but now agents\n\ncan use it right on their phones.\n\nUsing an app called Mobile Fortify,\n\nthey can just point their camera at you\n\nand run your face through a bunch of different databases\n\nthat does identity verification on the fly.\n\nSo why is this a problem?\n\nWell, first of all, Mobile Fortify,\n\nlike other facial recognition systems,\n\nhas a margin of error.\n\nThat means it can bring up false positives,\n\nso the app might identify you as being somebody\n\nwho you're not, and maybe that person\n\nis a hardened criminal who's in the US illegally\n\nand you might get detained.\n\nThe other issue is what we call surveillance creep.\n\nThis means that powerful surveillance tools\n\nare being used in more and more ways\n\nand is becoming normalized.\n\nIt might be ICE agents using it today,\n\nbut you can imagine the situation\n\nwhere a police officer is standing on a corner\n\nand just pointing his phone at everybody\n\ntrying to catch a criminal.\n\nNow, you might think this kind of surveillance\n\nisn't a big deal, and you might think, hey,\n\nif cops are catching more criminals, that's great.\n\nThe problem is that once a surveillance power is introduced,\n\nit's very rare that it gets taken away.\n\nWhile you might agree with the law enforcement actions\n\nof one administration, another administration\n\nmight have totally different priorities\n\nand totally different targets.\n\nAs we see in all types of situations,\n\ntechnology moves faster than laws.\n\nAs of now, there's no federal law\n\nregulating the use of facial recognition by ICE\n\nor any other law enforcement agency.\n\n[gentle music]\n\nICE's use of data brokers is another form\n\nof digital surveillance.\n\nICE isn't just buying data one-off.\n\nThey also have contracts with data brokers like LexisNexis,\n\nwhich gives thousands of agents access\n\nto all types of data about anyone they're targeting.\n\nThis means they know who you are, who you know,\n\nwho your family members are, what your criminal history is,\n\nwhether you own a boat or a car.\n\nAll this information is readily available to ICE\n\nfor anyone who they wanna target.\n\nICE is making use\n\nof something called the data Broker loophole,\n\nwhich allows the agency to just buy data\n\nthat they might otherwise have to obtain\n\nthrough a subpoena or a warrant.\n\nICE has reportedly used the data broker loophole\n\nto get around Colorado's Sanctuary Cities laws,\n\nwhich prevent local police\n\nfrom sharing information with the agency.\n\nICE was able to just buy data on targets\n\nrather than getting it through a process\n\nthat involves judicial review.\n\n[gentle music]\n\nICE has a program known as 287G,\n\nwhich allows it to deputize\n\nlocal and state police to help in deportation actions.\n\nUnder 287G, ICE has agreements\n\nwith some 800 departments across 40 states,\n\nwith dozens more pending.\n\nThis is all part of the agency's efforts\n\nto rapidly increase enforcement actions.\n\nWe're not asking them to be immigration officers.\n\nWe're asking them to help us,\n\ncops working with the cops to keep New York safe.\n\nNamed Operation Tidal Wave,\n\nICE's, expansion of 287G means a massive amount\n\nof resources across the country are being devoted\n\njust towards the issues of immigration and deportation.\n\nEven if you think immigration is the most pressing issue,\n\ngetting local law enforcement involved\n\ncan have consequences beyond what you might expect.\n\nFirst of all, local police need to have a relationship\n\nwith their community so that people\n\ncan trust them when they call to report a crime.\n\nIf your family has mixed immigration status\n\nor even if you just look a certain way,\n\nyou may be more unlikely to call the police\n\nand report a crime, and that makes everybody less safe.\n\nAnother issue is that local police have limited budgets.\n\nThis inevitably means that resources\n\nare gonna be diverted from other things\n\nlike investigating thefts or murders\n\nor child abductions.\n\nWith resources from the federal government\n\nto your local police being diverted\n\ntowards immigration issues,\n\nall types of other things\n\nare going to go ignored or underfunded.\n\n[upbeat music]\n\nAs ICE's power is expanding,\n\nit's sweeping up even more people\n\ninto its crosshairs, not just immigrants.\n\nFor example, in July, 2025,\n\nWired reported on a bulletin\n\nfrom the Department of Homeland Security,\n\nwhich oversees ICE.\n\nThe memo characterized regular activities\n\nlike riding a skateboard or a bicycle\n\nas running reconnaissance\n\nfor protestors and indicative of potential violence.\n\nWe've also seen ICE agents arrest US citizens\n\nwho were nearby\n\nwhile they were conducting raids and arrests.\n\nAccording to Wired reporting, protestors are subject\n\nto all types of social media surveillance\n\nwith law enforcement building dossiers on them\n\nthat can include their names, their affiliations\n\nand the things they say online.\n\nThis is a perfect example\n\nof how these tools can be turned against anyone\n\nan administration deems problematic.\n\n[upbeat music]\n\nFounded in 2003, in the wake of 9/11, under the task\n\nof increasing national security, ICE has since become\n\none of the most dominant law enforcement agencies\n\nin the United States and has poised\n\nto reach its apex under the second Trump administration,\n\nwhich has promised mass deportations on a historic scale.\n\nWe're gonna have to have a deportation level\n\nthat we haven't seen in this country\n\nfor a long time since Dwight Eisenhower actually.\n\nEven though news of ICE arrests\n\nand detentions are happening all the time,\n\nit's about to get even bigger.\n\nCongress recently allocated some $170 billion\n\ntowards immigration enforcement,\n\nmaking it more heavily funded\n\nthan any other law enforcement agency\n\nin the United States, including the FBI and the DEA.\n\nWhile the Trump administration has framed ICE's actions\n\nas removing criminals from our communities,\n\n65% of people targeted by ICE have no criminal convictions\n\nand 93% have no violent convictions.\n\nWhat this looks like on the ground\n\nis masked unidentified ICE agents\n\nstorming into restaurants and other businesses\n\nand snatching people off the street,\n\neven if they've never been involved in any crime at all.\n\nAgents are even arresting people at courthouses\n\nwhen they show up for their immigration court appointments.\n\nEven green card holders have been targeted,\n\nso it's not just undocumented criminal immigrants\n\nwho are being targeted, it's pretty much anybody\n\nwho has a vulnerable immigration status.\n\nOn paper, ICE's detention rate has soared to 140%\n\nof the capacity of detention centers.\n\nThis has led to massive overcrowding,\n\nunsanitary conditions, lack of medical care\n\nand other issues within detention centers,\n\nand it's only poised to get worse.\n\nWe are looking to set a goal of a minimum\n\nof 3000 arrests for ICE every day,\n\nand President Trump is gonna keep pushing\n\nto get that number up higher.\n\nIn June, ICE agents arrested an average\n\nof 1200 people a day.\n\nThat's nearly twice as many\n\nas during the first 100\n\ndays of the second Trump administration.\n\n[upbeat music]\n\nThere's very little anyone can do\n\nto push back against ICE's enforcement actions,\n\nbut some people are trying.\n\nApps like ICE Block allow people to identify ICE agents,\n\nwhere they are, what they look like\n\nand even what their vehicles are,\n\nbut even that can come with consequences.\n\nThe Trump administration has threatened the developer\n\nof ICE Block with prosecution,\n\nand people have criticized the app\n\nfor endangering ICE agents.\n\nThe Trump administration has also equated\n\nrevealing ICE agents identities as illegal doxing.\n\nWe should just note that making an app like ICE Block\n\nor publishing an ICE Agent's personal information\n\nis according to legal experts\n\nprotected by the First Amendment.\n\n[person shouting]\n\nThe disappearance of hundreds of thousands\n\nor even millions of people is going to change American life,\n\nregardless of your views on immigration.\n\nThis can happen in small ways from people you know\n\nsuddenly vanishing and big ways\n\nto having fewer people in the American economy\n\nand thus making it shrink.\n\nNo matter who you are, and no matter what you think\n\nabout immigration or ICE's tactics\n\nor the second Trump administration,\n\nmass deportations are going to have an impact on your life.\n\nThis has been Incognito Mode, until next time.\n\n[upbeat music]",
  "authors": [
    "Condé Nast"
  ],
  "url": "https://www.wired.com/video/watch/incognito-mode-how-ices-explosive-growth-threatens-every-american"
}