{
  "title": "What Speakers That Cost $370,000 Sound Like",
  "text": "Transcript\n\nThis...\n\n[dramatic music]\n\nIs coming out of the Wilson Chronosonic XVX.\n\nWhereas this...\n\n[dramatic music]\n\nIs coming outta the Sonos Era 300.\n\nSo how does a speaker,\n\nthe price of a house sound different\n\nto a speaker I use at home?\n\nAnd why would someone spend such an insane amount of money?\n\nLet's find out.\n\nI asked Chris Haslam Wired's audio expert\n\nto give me some steer on what we should be listening to,\n\nand he suggested piano music.\n\nThe piano is one of the most difficult instruments\n\nto reproduce in a recording.\n\n[mellow piano music]\n\nListening to that music on the Sonos\n\nis a very pleasant experience.\n\nBut listening to Clair de Lune on the Wilson Speakers\n\nwas an emotional experience.\n\n[dramatic piano music]\n\nIt wasn't just bits in that music\n\nthat I haven't heard properly before,\n\nbut it's the spaces in the song, the absence of sound,\n\nthe weight of the keys, you can feel the difference to it,\n\nit has a physical response almost.\n\n[dramatic piano music]\n\nYou need a lot of detail to create this kind of\n\nrich and textured sound.\n\nAnd the Chronosonic uses very large,\n\npowerful components to pump this out.\n\nFirst thing you notice is this thing.\n\nIt's huge.\n\nIt's over six feet tall.\n\nEach speaker is a super tower\n\nof seven drivers stacked on top of each other.\n\nThe more drivers, the more detail you can hear.\n\nMost people think these are speakers,\n\nwhat they're actually called a drivers.\n\nThe whole thing is the speaker.\n\nThe most crucial part of any speaker is the driver.\n\nThis is the part of the speaker\n\nthat turns audio signals into sound waves.\n\nWe've got 12 inch and a 10 inch base drivers here,\n\na tweeter here,\n\nthe high range as the name implies,\n\nand you've got mid-range drivers,\n\neither side of it, three of those there.\n\nAnd you've also got a upward firing tweeter\n\nrear at the back here\n\nto give you sort of spatial sound as it were,\n\nor broaden out the sound.\n\nYou might expect the tweeter to be\n\nat the top of the driver array,\n\nbut it doesn't actually matter where it is.\n\nAs long as the tweeter is pointing towards a rear level,\n\nyour brain can determine much better\n\nwhere the higher frequencies are coming from.\n\nSo they need to be directed at you.\n\nHigher frequencies have shorter wavelengths\n\nwith sharper curves,\n\nwhich makes it easier for our ears to locate them.\n\nWhile high frequencies are like a flashlight,\n\nlow frequencies are like a glow\n\nspreading out and making it harder to pinpoint the source,\n\nwhich is why so often with subwoofers\n\nyou can put them anywhere in a room,\n\nbut these speakers need to be pointing at your head.\n\nMany home speakers, like the Sonos Eras,\n\nall squeeze drivers into one box or bar.\n\nWhat's clever about the Sonos\n\nis the amount of stuff they've managed to squeeze\n\ninto this tiny package.\n\nSo you've got a center driver, two side drivers,\n\nyou've got a upward firing tweeter\n\nand you've got two woofers,\n\nas well as a computer amplifier\n\nand everything you need to run this speaker\n\nwithin this housing.\n\nAnd the difference here is that\n\nthese Wilson speakers are passive.\n\nThey've got no power in them at all.\n\nThey need to have separate amplifiers,\n\na preamp and enormous amounts of other equipment\n\nand huge cables just to make them work.\n\nYes, the speakers cost $370,000,\n\nbut you're gonna be spending probably\n\nnorth of a million dollars with everything else\n\nyou need to make these run.\n\nThis makes the Sonos far more convenient to set up.\n\nWhile it's still a premium speaker for most budgets,\n\nit doesn't cover nearly as much detail\n\nor frequency range as the Wilson.\n\nWhen you're talking about frequency,\n\nimagine that as a rainbow spectrum.\n\nThe sound rainbow coming from the Wilson\n\nis much brighter and much wider\n\nthan the rainbow coming from the Sonos.\n\nThis speaker can only play 41 hertz to 16 kilohertz,\n\nwhereas this one has a frequency range\n\nof 20 hertz to 30 kilohertz,\n\nwhich is beyond the range of human hearing.\n\nIt's got more detail than you can possibly hear.\n\nSo what's the point?\n\nTake a cymbal crash.\n\nHumans can't hear the highest frequency of the crash,\n\nbut what you can hear will sound more realistic\n\nand vibrant with a wider frequency range.\n\nIt's a bit like a high resolution camera\n\ncapturing details you might not notice\n\nbut made the overall picture sharper.\n\nOkay, so we're gonna try going down to 20 hertz.\n\nYou won't be able to hear it\n\nbecause it won't work on your speakers.\n\nOur microphones won't pick up something so low either,\n\nbut you'll see it.\n\nLet's have a look.\n\nSee how it's moving that paper.\n\nLow frequencies produce powerful sound waves\n\nwith larger amplitudes.\n\nThis causes physical vibrations\n\nmoving lightweight objects like paper.\n\nIt's quite a deep unsettling noise,\n\nwhich you don't want to be around for too long.\n\nIf you play the same frequency, 20 hertz on the Sonos,\n\nyou can't hear a thing because it doesn't go down that low.\n\nBut low frequencies can also create bad kinds of vibration.\n\nHave you ever played a low frequency through bad speakers?\n\nYou'll notice a rattle\n\nand a clicking in the casing\n\nas soon as you play anything with bass.\n\nVibration is the enemy of speakers.\n\nYou only want to hear the vibrations\n\ncoming from the drivers themselves.\n\nHeavy casing dampens and absorbs excess vibrations\n\nmade within the driver.\n\nThe base drivers are made of a trade secret material\n\nthat is so dense it can stop this distortion.\n\nGot aerospace grade aluminum architecture\n\nhere on the side for the driver array at the top.\n\nIt is very heavy and very, very solid.\n\nNo vibration and as inert as it possibly can be.\n\nSo all you are hearing is the vibrations of the music\n\nand nothing else.\n\nAnd what's the unique selling point of these drivers?\n\nThe accuracy.\n\nWith tiny adjustments to the back,\n\nthe music hits your ears in perfect sync.\n\nHere at the back,\n\nthere is a micro adjustment of time alignment system\n\nthat is capable of adjusting the time\n\nat which the sound from these drivers\n\nhits your ears within a measurement\n\nof two millionths of a second.\n\nA tiny change that the average human ear\n\nwouldn't even be able to notice.\n\nThe idea here is that Wilson wants your hearing\n\nto be the limit, not the technology.\n\nThe whole point of the Chronosonic\n\nis that you need to sit in one spot in the room.\n\nThat's because all the drivers are angled\n\nto hit your ears at precisely the right time.\n\nIf one tiny thing goes out of kilter, even by a fraction,\n\nthe illusion is destroyed.\n\nSo it should sound radically different as you move around.\n\n[dramatic piano music]\n\nThe Wilsons, you can definitely hear how the sound changes,\n\nespecially when you get into the middle here,\n\nwhere you get into that sweet spot\n\nthat the speakers are being directed towards.\n\nAnd when you move out of it,\n\nyou can hear that the balance of everything\n\nis out of kilter.\n\nWhen you get in the right zone,\n\nthat's when everything starts to make sense.\n\nImagine some flashlights pointing at a painting,\n\na slight tweak in direction,\n\nand you'd still be able to enjoy the painting\n\njust less vividly.\n\nBut with the Sonos, the whole gallery is already lit.\n\nJust as you manipulate the pixels on Photoshop,\n\ndigital signal processing or DSP,\n\nmanipulates digital signals to enhance audio.\n\nThat digital jiggery pokery,\n\nthat DSP is working its magic.\n\nSo it's creating a soundscape\n\nthat is trying to be uniform\n\nno matter where you are in the room.\n\nAnd it actually does manage to do that\n\nto a very convincing degree,\n\nespecially considering it's all coming from one unit.\n\nBut you do notice obviously a difference in sound quality,\n\nbut it's difficult to hear a change in that sound quality\n\nas you go about the room.\n\nCompletely different to the Wilson.\n\nAnd ultimately all the money\n\nthat's gone into the Chronosonic\n\nis there to make you feel something.\n\nSo having listened to these two systems side by side,\n\nthe Sonos is an all in one system that's plug and play\n\nand there's an enormous number of compromises here,\n\nbut it's really easy and the standard is good.\n\nIt's what everyone really wants\n\nif you want an hassle-free life.\n\nThe Wilson speaker,\n\nit is enormously complicated to set up,\n\nunbelievably expensive to run,\n\nbut the sound difference you get,\n\nthe emotional response you get is another level.\n\nBut the $400,000 question is can speakers\n\nthat cost the same as a house in Colorado Springs\n\never be worth it?\n\nIn short, if you love and I mean love music\n\nand you have the means,\n\nthen these open up an audio world\n\nyou simply never knew existed.\n\nIt's like trying Japanese Kobe steak\n\nwhen you've spent your entire life\n\neating In-N-Out burgers.\n\nAnd the price for such an experience\n\nis always going to be high,\n\nalmost unbelievably high\n\ncompared to the perfectly fine Sonos,\n\nbut however capable Sonos is, it just plays music for you.\n\nAstonishingly, the Wilsons change the very way you feel\n\nabout sound and that's so hard to put a price on.\n\n[dramatic music]",
  "authors": [
    "Condé Nast"
  ],
  "url": "https://www.wired.com/video/watch/wired-desired-speakers"
}