{
  "title": "Emm raises $9M seed to create one of the world’s first ‘smart’ menstrual cups",
  "text": "Jenny Button first thought of Emm during the COVID lockdown. She was using an Oura ring and the Whoop monitoring band and getting insights about her body, but there wasn’t a device that could provide data about one of the most important aspects — reproductive and menstrual health.\n\n“It seemed crazy to me, because these are things that every woman wants to be able to track and better understand,” she told TechCrunch. She thought, “Why not make a wearable device that can tell someone more about their reproductive health?” She penned a letter to one of the engineers at Dyson, made a connection, and started testing the idea.\n\n“Five years later, following thousands of designs and iterations and extended user testing, we’ve revealed the world’s first smart menstrual cup,” said Button.\n\nThe U.K.-based company has also raised a $9 million (£6.8 million) seed round, one led by Lunar Ventures, as it prepares to officially launch its product next year.\n\nThe product functions like a regular menstrual cup — designed to store period blood rather than absorb it. But Emm’s medical-grade silicone is “fitted with ultra-thin, advanced sensor technology.” This sensor gathers data that will help users understand patterns about their cycles. Button hopes that it could “transform the research, diagnosis and treatment of menstrual and reproductive health conditions.”\n\nShe isn’t the only one who thinks this way. Other women’s health founders told The Guardian a few months ago that menstrual blood was an “overlooked opportunity in women’s health” that could offer insights not available from health tests based on circulatory blood.\n\nIt could, for instance, help diagnose painful and often misdiagnosed medical conditions like endometriosis.\n\nTechcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | WAITLIST NOW\n\n“One in 10 women today suffer from endometriosis,” Button said. “A condition that, like many others in reproductive health, takes an average of seven to 10 years to diagnose.”\n\nThat delay “is largely due to the lack of meaningful data and poor characterization of menstrual health in clinical settings,” Button believes. “There have been no reliable tools to accurately and objectively track that aspect of health until now.”\n\nBeyond endometriosis, she added that one in three women experiences “severe reproductive health issues” throughout their lives.\n\nData gathered from the Emm app is encrypted and stored securely, with two-factor authentication. “It’s also always anonymized or pseudonymized,” meaning personal identifiers are removed or replaced with codes, “and will only be accessed by the people at Emm who genuinely need it,” she said.\n\nButton used the word “strategic” to describe her funding round and said she connected with her lead investor through her network. Others in the round include Alumni Ventures (who backed Oura), the Labcorp Venture Fund and Blue Lion Global. Money will be used to launch the product into the U.K. market next year, she said, adding that the waitlist has already topped 30,000, with preorders to go live soon.\n\nCapital will also be used for research and development. Button hopes to enter the U.S. market in early 2027.\n\n“Menstrual health is only the jumping off point for Emm,” said Button. “Ultimately, I believe we will have a profound impact on women’s health more broadly,” she continued, adding she hopes to expand the product one day, perhaps into diagnosis, other digital care tools, and even therapeutics.\n\n“Our mission is to accelerate diagnosis, equip people with the data to advocate for themselves, and ultimately help them take control of their own bodies and health journeys,” she said.",
  "authors": [
    "Dominic-Madori Davis",
    "Senior Reporter",
    "Sarah Perez",
    "Julie Bort",
    "Lorenzo Franceschi-Bicchierai",
    "Ram Iyer",
    "Connie Loizos",
    "Anthony Ha",
    "Rebecca Bellan",
    "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var"
  ],
  "url": "https://techcrunch.com/2025/11/18/emm-raises-9m-seed-to-create-to-launch-one-of-the-worlds-first-smart-menstrual-cups/"
}