{
  "title": "Colombia recupera los primeros tesoros del galeón San José, hundido en el Caribe hace 300 años",
  "text": "CNN —\n\nColombia recuperó monedas de oro y bronce, una taza de porcelana y un cañón de un buque de guerra español hundido, conocido como el “Santo Grial de los naufragios”.\n\nEstos artefactos son los primeros tesoros recuperados de los restos del San José, un galeón español que fue hundido por la Marina Real británica en el Caribe hace más de 300 años.\n\nEn el momento de su hundimiento, durante la Guerra de Sucesión española, el San José transportaba grandes cantidades de oro, plata y esmeraldas desde las colonias españolas en América Latina hacia el reino de España.\n\nEn conjunto, se cree que esos tesoros valen miles de millones de dólares en la actualidad y están en el centro de una acalorada disputa legal entre el Gobierno colombiano y una empresa estadounidense de salvamento marítimo llamada Sea Search-Armada (SSA).\n\nColombia sostiene que descubrió el San José en 2015 con ayuda de científicos internacionales, pero SSA, antes conocida como Glocca Morra, afirma haber encontrado los restos del naufragio a principios de la década de 1980 y ha iniciado una batalla legal ante la Corte Permanente de Arbitraje, alegando que tiene derecho a aproximadamente US$ 10.000 millones, cerca de la mitad del valor estimado del tesoro.\n\nEn esta fotografía sin fecha, distribuida por el Ministerio de Cultura de Colombia el 5 de diciembre de 2015, se observan objetos encontrados en los restos del galeón español San José. Ministerio de Cultura de Colombia/Reuters\n\nEl Gobierno colombiano afirma que la recuperación de los tesoros forma parte de un proyecto de investigación que podría aportar pistas sobre el clima económico, social y político de Europa a principios del siglo XVIII. También sostiene que el galeón es importante para la cultura y la identidad de Colombia.\n\nEn un comunicado emitido este jueves, la ministra de Cultura de Colombia, Yannai Kadamani Fonrodona, describió la recuperación como un “acontecimiento histórico” que demuestra la capacidad del país para proteger su patrimonio cultural subacuático.\n\nAlhena Caicedo Fernández, directora del Instituto Colombiano de Antropología e Historia, dijo que esto “abre la posibilidad para que la ciudadanía se acerque, a través de evidencia material, a la historia del galeón San José”.\n\nEl Gobierno asegura que los objetos, que fueron recuperados utilizando robots submarinos, ahora pasarán por un largo proceso de conservación en un laboratorio y serán utilizados para investigaciones arqueológicas.\n\nRegistros históricos muestran que el San José formaba parte de una flota conocida como la Flota de Tierra Firme.\n\nFue uno de varios barcos de la flota que salió de Perú en 1707 transportando una gran cantidad de cargamento real, pero los registros indican que nunca llegó a España y que se hundió frente a las costas de Colombia tras una batalla con fuerzas británicas al año siguiente.",
  "authors": [
    "Michael Rios"
  ],
  "url": "https://cnnespanol.cnn.com/2025/11/20/colombia/colombia-tesoros-del-santo-grial-naufragios-trax"
}