{
  "title": "Chi erano i “cecchini di Sarajevo”, gente che pagava per andare a sparare sui civili durante la guerra in Bosnia",
  "text": "Sarajevo, primavera del 1992. La città era già stretta in un assedio che durerà quasi quattro anni. I cecchini a Sarajevo si nascondono sulle colline, ogni giorno partono colpi di mortaio e di fucile. I civili camminano tra un edificio e l'altro, cercando riparo dai tiratori appostati lungo quella che verrà chiamata “Sniper Alley”, il viale principale della capitale bosniaca.\n\nOggi, a trent'anni di distanza, un'inchiesta aperta dalla procura di Milano riporta alla luce un'ombra ancora più inquietante: l'esistenza di “cecchini del weekend”. I “cecchini di Sarajevo”, occidentali che avrebbero pagato per sparare sui civili durante l'assedio. \"Il reato è quello di strage aggravata da futili motivi\", spiega lo scrittore Ezio Gavazzeni.\n\nLa denuncia di Ezio Gavazzeni\n\nA denunciare i fatti in Italia è lo scrittore Ezio Gavazzeni, che dopo anni di ricerche ha deciso di consegnare un dossier alla magistratura italiana. Tutto è cominciato da una notizia dimenticata, letta per la prima volta negli anni Novanta e poi riaffiorata con forza nel 2022, quando il regista sloveno Miran Zupanič ha presentato il documentario Sarajevo Safari.\n\nIl film raccontava un presunto “turismo di guerra” organizzato in Bosnia, intorno alla città assediata: uomini d'affari e facoltosi occidentali che, dietro loro pagamento, venivano accompagnati sulle postazioni serbo-bosniache per “provare l'emozione” di colpire bersagli umani.\n\n“Mi ero imbattuto in questa storia già negli anni ‘90”, racconta Gavazzeni. \"Ne parlarono Il Corriere della Sera e La Stampa, poi tutto cadde nell’oblio. Quando vidi Sarajevo Safari capii che non potevo più restare in silenzio. Ho contattato il regista, raccolto testimonianze, incrociato fonti e, con l'aiuto della criminologa Martina Radice, abbiamo costruito il profilo dei presunti cacciatori. È stato allora che ho deciso di denunciare”.\n\nL'inchiesta della procura di Milano\n\nLa denuncia è stata depositata presso la procura di Milano ed è ora all'attenzione del pubblico ministero Alessandro Gobbis, che l'ha affidata ai Ros dei Carabinieri. Gavazzeni parla di almeno cinque cittadini italiani, ma ipotizza un fenomeno più ampio. “Non parliamo di dieci fanatici – spiega – ma di molti, molti di più. Un terzo di loro ora potrebbero essere morti, ma ci sono due terzi ancora vivi, la cui età dovrebbe aggirarsi tra i 65 e gli 83 anni massimo”.\n\nSecondo la ricostruzione, i “clienti” erano soprattutto uomini d'affari o professionisti benestanti, appassionati di caccia e armi. “Per una trasferta di due o tre giorni – racconta – pagavano quanto si pagherebbe adesso per un trilocale in una zona media a Milano”. Le partenze avvenivano per lo più dal nord Italia, spesso passando per Trieste, e l'organizzazione, per forza di cose, doveva avere l'assenso delle milizie serbo-bosniache che controllavano le colline.",
  "authors": [
    "Elena Betti"
  ],
  "url": "https://www.wired.it/article/cecchini-sarajevo-inchiesta-milano-gavazzeni#intcid=_wired-it-verso-hp-trending_9911878c-3b24-4da9-8147-d9aec1f7f41e_popular4-2"
}