{
  "title": "'It was treachery with a smile on its face': The shocking downfall of Margaret Thatcher",
  "text": "In November 1990, the UK's prime minister made her tearful departure from 10 Downing Street. She was ousted by her own party, having been weakened by an unlikely enemy.\n\nAs Margaret Thatcher stood on the doorstep of the British prime minister's official residence for a final time, she faced the full glare of the world's media. \"We're leaving Downing Street for the last time after 11.5 wonderful years, and we're happy to leave the UK in a very much better state than when we came here,\" she said. Thatcher looked anything but happy. Less than a week earlier, on 22 November 1990, she had resigned as head of the ruling Conservative Party after failing to win enough support in a leadership contest to carry on with authority. Close to tears, she waved goodbye, then headed for the familiar journey to Buckingham Palace for one last audience with Queen Elizabeth II. Ironically, it was her own increasingly regal management of her party that led it to turn against her.\n\nAs Britain's first ever female prime minister, Thatcher had led her party to victory in three general elections. Few politicians have wielded such power during their time in office or inspired such strong feelings, both for and against. She fought and won countless battles against the British establishment, the trade unions, the opposition Labour Party, and most fiercely, her own cabinet. But now she had lost the ultimate fight with her party colleagues, and, in defeat, she felt deeply betrayed. It is a story of hubris, hurt feelings and some very British sporting metaphors.\n\nWATCH: 'We're very happy that we leave the UK in a very, very much better state'.\n\nOne of her ministers, Chris Patten, told the BBC in 2005 that Thatcher recognised \"people need to be a bit scared of you if you're going to get your own way\". Patten said that she had an \"extraordinary style of summarising the conclusions of meetings at the beginning and then challenging the assembled company to say whether they thought she might be wrong\". He added: \"There was always that slight sense of the anaconda in the chandelier if you got things wrong.\"",
  "authors": [],
  "url": "https://www.bbc.com/culture/article/20251113-the-shocking-downfall-of-margaret-thatcher"
}