{
  "title": "Kevin O'Leary Answers Investor Questions",
  "text": "Transcript\n\nHey, Mr. Wonderful here,\n\nand I'm here to answer your questions from the internet.\n\nThis is Investor Support, and here we go.\n\n[upbeat music]\n\nThis is LorgePorpoise, okay.\n\nIs VOO and chill, a viable strategy?\n\nVOO is one of the least expensive ways to invest\n\nin the S&P 500.\n\nThese are called ETF, Exchange Traded Funds,\n\nand it's a very good vehicle and frankly,\n\nyeah, it is a good way to chill.\n\nBroncobroncobronco...\n\nWhat kind of a name is this, broncobroncobronco?\n\nWhat are you, Bozo Bronco?\n\nWhy do so many people say, 'You can't time the market,'\n\nwhen you can?\n\nThat's not true, Bronco.\n\nNobody can time the market.\n\nEverybody tries, you cannot time the market.\n\nI stopped trying to do that decades ago.\n\nI got my heinie spanked, as you will broncobroncobronco,\n\nit's gonna happen to you.\n\nHere's one from Professional_Soft258.\n\nShould I make a starter emergency fund or pay off debts?\n\nYou gotta pay it off.\n\nIf you know you're being charged 21% interest\n\non a credit card, something as high as 23%,\n\nyou're outta your frigging mind if you don't pay that off.\n\nI can't make 23% a year, either can you?\n\nIt's really hard to do that.\n\nAll right, next on the hit parade, gentrycourt2121.\n\nHow do I get started investing for the very first time?\n\nYou gotta use an app, it's the easiest way to do it.\n\nIf you're just starting out and your salary\n\nis 68,000 a year, that's the average salary in America.\n\nYou download it on your phone, you decide I'm gonna keep\n\n10 to 15% of my salary each month.\n\nThe app is gonna take it out of my bank account\n\nand just put it into an ETF in the market\n\nor a mixture of ETF and bonds,\n\nwhich you can set it up that way.\n\nRezwenn asks, Palantir may be the most overvalued firm\n\nof all time.\n\nYou could have said that about Apple.\n\nYou could have said that about Amazon.\n\nYou could have said that about Netflix.\n\nThere's so many companies that you think are overvalued,\n\nbut over time prove out their growth objectives.\n\nPalantir is about data, and data is the new oil,\n\nand they were the first to go this way\n\nand help both governments and companies mine their data,\n\nbecome more efficient, more productive, more profitable.\n\nSo are they overvalued?\n\nOnly time will tell.\n\nSo far, it's been just killing it\n\nbecause data is really important,\n\nand data is what drives AI.\n\nSo they're in the right space right now,\n\nthat's why it's been performing so well.\n\nHere we have one from kaloostian,\n\nEveryone investing in Bitcoin.\n\nWhat exactly are you investing in?\n\nHype, technology, adoption?\n\nWhat makes it a good investment?\n\nBecause I'm not convinced.\n\nSo listen, you don't have to invest in Bitcoin,\n\nno one's forcing you to do that.\n\nI do invest in Bitcoin 'cause I'm a believer in crypto\n\nand a believer in digital payment systems over time.\n\nI have a general rule that you think about.\n\nDon't put the farm onto any one stock.\n\nIn other words, don't bet everything ever.\n\nSo my diversification strategy was taught to me\n\nby my mother.\n\nNever more than 20% in anyone's sector, including crypto.\n\nNever more than 5% in any one's stock or bond.\n\nNow, we have 11 sectors in the S&P including real estate,\n\nwhich was recently added, it's the most recent.\n\nCrypto is not yet a sector,\n\nbut I believe it'll become the 12th,\n\nprobably within five years\n\nbecause it's being legitimized through policy.\n\nAll right, here's a question from Illustrious-Stock3068,\n\nWhat do you think the overall return on investment\n\nfor 'Shark Tank' is?\n\nWell, nobody really knows for sure\n\nbecause there's guest sharks, the regular sharks,\n\nand nobody really puts together all the data.\n\nBut here's what we do know, it's been on for 17 years.\n\nSomething's working out.\n\nEntrepreneurs keep coming every year\n\nbecause it does a phenomenal job in helping them launch\n\ntheir businesses, create jobs in America,\n\nsell millions of dollars with the product and services.\n\nAnd the sharks have done quite well,\n\notherwise, we wouldn't come back either.\n\nRjInvesting asks, How long until average investors realize\n\nAI is a bubble that will never pay off?\n\nYeah, they said that about the internet too back in 1990.\n\nWrong, technology has a nasty way of being right sometimes\n\nand certainly AI is creating a lot of excitement\n\nabout productivity, margin enhancement,\n\ncustomer acquisition cost, doing a lot of robotics,\n\nworking on all kinds of new technologies\n\nthat we never even thought about,\n\nchanging how movies are made, you name it,\n\nit's starting to affect every sector of the S&P 500.\n\nSo I'm not sure it's a bubble, time will tell.\n\nBig-Phase7911, love that name.\n\nDoes anyone, absolutely anyone think that Tesla stock\n\nwill go back up to its peak?\n\nWhen you're buying Tesla, you're buying more\n\nthan electric car company.\n\nYou're buying a data company,\n\nyou're buying robotics company,\n\nyou're buying a company that understands energy,\n\nand they have a lot of resolution\n\nin terms of their drive towards autonomous cars.\n\nSo you're buying sort of the future.\n\nKing J-U-R-G-Z, kingjurgz,\n\nCan someone please explain to me\n\nhow short stocks actually work?\n\nShorting is very risky.\n\nIt has unlimited losses\n\nbecause you're basically selling a stock you don't own,\n\nand you're assuming it's gonna go down,\n\nthen you're gonna buy it back.\n\nAnd you're gonna profit between what you've bought it,\n\nif you shorted at 100, and then if it goes down to 50,\n\nyou buy it back and you made $50.\n\nBut what happens if it goes to 200?\n\nOops, you just lost $100.\n\nWhat happens if it goes to $1,000?\n\nWhat happens if it goes to $10,000?\n\nThat happened in the internet bubble and people got killed.\n\nSo I wouldn't short stocks\n\nunless you really know what you're doing.\n\nThat's what hedge fund guys do, and very, very risky.\n\nJobenalexx asks, Which is the best product\n\nthat has got an offer on the tank on your perspective?\n\nYou know, here's the thing, you just don't know.\n\nYou can make the assumption each year when you,\n\nlet's say, invest in a dozen deals.\n\nOh, I think they're all winners,\n\nbut that won't be known for at least five to seven years.\n\nThen you're gonna find out which ones win\n\nand which ones lose.\n\nAnd so sometimes, the craziest deals make the most money.\n\nThat's the idea of diversification.\n\nSo the ones I've loved, I found out five years later\n\nwere monster winners like Basepaws or Wicked Good Cupcakes,\n\nyou know, Blue Land, they're all huge winners.\n\nBut you don't know out of the gate.\n\nYou gotta wait, you have to let them marinate.\n\nLook it rhymes, that's fantastic.\n\nJimbob994, Why wouldn't I invest heavily in gold?\n\nI wouldn't invest heavily, I have a 5% weight in gold\n\nand whoa, has that ever worked.\n\nIchihuahua Caramba, I'm so happy with my gold.\n\nNow, I own it two different ways.\n\nThe GLD is the ETF, but I like to touch my gold,\n\nso I actually own the bullion.\n\nBut when you own the bars, you have to pay for storage.\n\nYou're not gonna walk around and put it under your mattress,\n\nyou gotta put 'em in a safety deposit vault\n\nand you pay for that.\n\nAll right, next on the hit parade, Technical_Bank_6670 asks,\n\nIs being a successful day trader really even possible?\n\nYes, it is possible, but it's really hard work.\n\nI mean, this is a full-time job.\n\nIt's not for me, not something I want to do.\n\nThere's a huge community all around the world that do this\n\nand they kind of roam the earth in bans online.\n\nNot easy, and I would say the majority lose money,\n\nbut some of them do quite well\n\nbecause they're really adapted,\n\nfiguring out trends or understanding momentum.\n\nBut a lot of them are actually trade all day long,\n\nand then go back to cash at night, and go to sleep,\n\n'cause they don't wanna be exposed to the market overnight.\n\nIf you think you want a life like that,\n\nyou can check it out.\n\nNot for me, thank you.\n\nElectronic_Change380 asks,\n\nWhen did you realize the power of compound interest?\n\nAlmost immediately, when I was taught this,\n\nI think in grade six.\n\nIt's pretty frigging cool.\n\nJust leave it there and let it compound,\n\nand grow, and grow, and grow, and grow, and grow.\n\nBasically, you can double your money every seven years.\n\nJust making a few percent, it's incredible.\n\nThis is from Slight-Strip-1869, sorry,\n\nSlight-String-1869, crazy name.\n\nHigh yield savings or invest in mutual funds?\n\n4.5 year time span.\n\nNo, not mutual funds.\n\nFees are high and they're tax inefficient.\n\nETFs, Exchange Traded Funds,\n\nI would do that with a four and a half year time span.\n\nThis is Jumperbumper, TheJumperbumper.\n\nWhy do people buy individual stocks instead of funds?\n\n[laughs] If you think you're so good\n\nthat you can pick stocks and beat the index, give it a try.\n\nLearn the hard way.\n\nVirtually, no one beats the index, it's so hard.\n\nSo what you do is you set yourself up, maybe you put,\n\nI don't know, I'm just telling it, give it...\n\nMake it easy for you, $1,000 into one account\n\nwhere you're picking stocks and another into the SPY.\n\nThat's the SPY index,\n\nthe ETF that tracks the entire S&P 500.\n\nAnd then you find out the hard way, you're not that good.\n\n90% of the time, you can't beat it,\n\nso you might as well join it and stop trying to pick stocks.\n\nI don't pick stocks.\n\nThis is a Reddit user asks,\n\nAre dividend stocks ever worth it?\n\nThe answer's absolutely yes.\n\nBut the right dividend stocks\n\nthat you will find a good index called OUSA\n\nthat really focuses on those that actually pay dividends\n\nto make sure they're not taking on inordinate debt\n\nto pay the dividend.\n\nYou want the dividend paid out of operating free cash flow.\n\nAnd that's just giving you back some of your profits,\n\nthat's all, of course, it's worth it.\n\nMohnishkarthikeyan04 asks,\n\nWhat shark do you think has the best ROI?\n\nOh, there's no question, it's Mr. Wonderful.\n\nWho else could it be?\n\nThank you for that question.\n\nJannaDD126 asks, What exactly is a hedge fund?\n\nAnd what does a hedge fund manager do?\n\nSo hedge funds are a different beast.\n\nThese are managers that usually are allowed to go anywhere,\n\nany geography, any security, and they can go short and long,\n\nwhich means they can bet against a stock or with a stock.\n\nAnd they try and beat the market.\n\nSome of them do very well, some of them not so much.\n\nGenerally, you wanna look at a five-year track record\n\nof a hedge fund manager.\n\nIf they beat a hurdle, let's say 7%,\n\nthey take 20% of all the gains above that.\n\nSome of them have no hurdle,\n\nwhich means they take 20% of any gain.\n\nThe point is, you'd always ask what the terms are.\n\nThe classic hedge fund is 2 and 20.\n\n2% fees, 20% of any gains.\n\nSo investors get 80, the manager gets 20.\n\nSome of them have done very, very well\n\nand some not so much equivalent.\n\nEquivalent-Bluejay asks, How good of an idea\n\nis it to invest into startups\n\nand how do I sift through them?\n\nThis is what I do on Shark Tank every day.\n\nI don't invest just one company each season,\n\nsometimes I do a dozen 'cause I don't know\n\nwhich one's gonna work and either do you.\n\nStartups are tricky, because history tell you about 80% fail\n\nand the 20% that make it pay you back for all your mistakes.\n\nBut how many should you have?\n\nI think the magic number is a minimum of seven.\n\nAnd the way you do that is you go to a crowdfunding site\n\nlike StartEngine, and you can look\n\nat all the different deals\n\nand decide how much you're gonna invest in startups,\n\nand pick two, or three, or four, or five,\n\nor six, seven deals, and manage your portfolio that way,\n\nmakes it very easy.\n\nBikesOrBeans asks, Does the market need corrections?\n\nA correction is defined by a loss of 20% or more,\n\nor that's an entry into a bear market.\n\nSometimes because of calamities like pandemics,\n\nyou get a lot of volatility.\n\nAnd yes, they do go up and down, but nobody can time them,\n\nit's impossible to know.\n\nAnd sometimes, they go up violently,\n\nthen they go down violently.\n\nBut long term, don't bet against America\n\nbecause the S&P 500 is provided 8 to 10% returns\n\nfor almost 200 years.\n\nAlterna9 asks, Are there any logical arguments\n\nto not invest in international funds?\n\nNo, diversification is also geographic.\n\nYou can find indices that provide, like those are ETFs,\n\nthat will help you invest in other countries like Europe.\n\nEurope, you know, some years outperforms the S&P,\n\nyou just don't know when.\n\nFar_Lifeguard_5027 ask,\n\nWhy bother with medium/small cap funds\n\nwhen the large cap consistently over performs them both?\n\nNot true, simply not true.\n\nThe Russell 2000 has companies that are growing\n\na little faster than the S&P.\n\nSo in the right conditions, like lower interest rates,\n\nthey tend to outperform.\n\nThere's no guarantee and you never know\n\nwhen they're gonna outperform.\n\nBut they're the small companies that grow into big companies\n\nand they grow faster.\n\nThis comes from Dukethumper, different.\n\nWhat percentage of portfolio is worth holding in bonds\n\nas a 22-year-old?\n\nGreat question.\n\nWhen you're that young, you can take more risk.\n\nThe market provides better returns over time.\n\nWhen you're starting out, you can be as little as 20%\n\nto 30% in fixed income bonds, and 70% in stocks.\n\nAnd then when you hit 50, you go 60 stocks\n\nand 40 fixed income.\n\nThen when you hit 60, you go 50/50.\n\nThat's kind of a general rule\n\nand you're sort of de-risking yourself\n\nas you get a little older,\n\n'cause you've built up a licensed little nest egg.\n\nGenerally, the market gives you 8 to 10% every year.\n\nSunvmikey asks, What sectors or stocks do you think\n\nwill boom in the next few years?\n\nNobody knows.\n\nYou know, seven stocks have been the majority\n\nof the S&P returns for the last three years.\n\nThat's a very concentrated amount,\n\nand there's no guarantee they remain\n\nat the lead of the pack.\n\nThat's why you want diversification.\n\nYou don't want those stocks to become more than 5% each\n\nof your portfolio.\n\nSomething to think about.\n\nHere's Mary_Bit8237 asks,\n\nHow do you guys know when to sell?\n\nYou never know when to sell.\n\nbut a great rule is to make sure you stay diversified.\n\nSo if let's say you own a stock,\n\nit becomes more than 5% of your portfolio,\n\nthat's too much in the world of diversification.\n\nSo you sell it down to 5%.\n\nI've been doing that with Tesla for almost 10 years.\n\nIt's the discipline of diversification\n\nthat forces you to sell,\n\nand no one ever goes bankrupt taking profits,\n\nlook at it that way.\n\nReddit user asks,\n\nWhich shark would you want to have a deal with?\n\nFor me, it's Kevin, because I think he cares most\n\nabout success of people he invests in.\n\nYeah, you know, even as Mr. Wonderful,\n\nI have to agree with you.\n\nI love that Kevin guy.\n\nI mean, you know, he cares, that's what matters.\n\nIt's really about betting on the jockey\n\nthat's riding a good horse.\n\nThat's what I want.\n\nI want entrepreneurs who can pivot.\n\nAnd by the way, almost 90% of my returns have come\n\nfrom women entrepreneurs.\n\nThey get stuff done.\n\nYou want something done, give it to a busy mother,\n\nthat's what works.\n\nBut I agree with you, Mr. Wonderful agrees,\n\nKevin's the dude.\n\nWell, that's it, those are all the questions for today,\n\nand I really hope you learned something.\n\nFantastic being with you.\n\nAnd by the way, I'm impressed with these questions.\n\nI'm glad you're thinking out there,\n\nand the key to success, keep watching Shark Tank.\n\nMr. Wonderful says, keep watching it, or you're dead to me.\n\n[upbeat music]",
  "authors": [
    "Condé Nast"
  ],
  "url": "https://www.wired.com/video/watch/tech-support-kevin-oleary-answers-investor-questions"
}