{
  "title": "K-Pop Icon's Death Reveals Painful Truth About Mental Health Crisis",
  "text": "In recent years, many members of the Korean entertainment industry have been more vocal about mental illness — especially after the deaths of several rising stars, including actor Yoo Joo-eun in 2022 and actor/singer Kim Jong-hyun in 2017. The community’s most recent loss is Moon Bin, a 25-year-old K-pop star and member of the boy group Astro, whose manager reportedly found him dead of suspected suicide last week.\n\nSuicide in the K-pop community has received more attention in recent years. While nobody can pinpoint the exact reason these losses have compounded, there’s no question that the pressure these celebrities experience from a young age — including the burden of exporting Korean culture to the rest of the world — is a major contributing factor. On top of that, the industry pushes artists to be highly “likable” and have a variety of talents and skills, treating them more like products than real people.\n\nStill, I can’t help but feel that this isn’t just a K-pop trauma. It’s a cultural one, too. In South Korea, suicide is a leading cause of death for young people, Time magazine reports. And the country ranks high in suicide rates globally.\n\nAdvertisement\n\nAs someone who is part of the Asian diaspora, events like this hit close to home because they’re part of a larger and unacknowledged crisis that exists in our communities. As children, many of us are taught that our achievements and service to others are more important than our well-being and that being depressed just means you’re not trying hard enough to get better.\n\nFor these artists, I can only speculate about the connection between depression and their apparent suicides. We may never actually know what led to their deaths — nor do we have the right to pry — but the conversations they have sparked are enough for us to take action. It feels evident enough that when we, as people of Asian descent, refuse to talk about mental health issues, those problems don’t go away. We’re just forced to confront them alone.\n\nCombined with other stressors many Asian Americans face outside of the home, like the perpetual foreigner stereotype, it’s not hard to see why some of us feel the need to hide depression and anxiety.\n\nAdvertisement\n\nIn the U.S., the mental health crisis among AAPI individuals is on the rise. In fact, nearly 15% of Asian Americans 18 or older reported having a mental illness in a 2018 survey by the Substance Abuse and Mental Health Services Administration. Also, Asian American college students are believed to have higher rates of suicidal ideations than their white counterparts, according to a study cited by the American Psychological Association.\n\nThe pressure to excel at an unrealistic level is not just present in entertainment but in many other areas of our lives. Even after high-profile deaths like Moon Bin’s, we continue to dance around this issue.\n\nThis might feel harsh, but it’s time for more of us to take responsibility for the mental health crisis in our own communities. Whether it’s working to the point of exhaustion or studying to get into good universities at the expense of our own wellness, we need to evaluate what “success” means to us. Mental illness is an issue that Asian and Asian diaspora communities can no longer afford to ignore.\n\nAdvertisement",
  "authors": [
    "Contributing Writer"
  ],
  "url": "https://www.huffpost.com/entry/k-pop-moon-bin-mental-illness-asian-community_n_6446a1bee4b011a819c2cafb"
}