{
  "title": "6 Of The Worst Data Breaches in U.S. History",
  "text": "Transcript\n\nData breaches happen literally all the time.\n\n[camera snapping] [ominous music]\n\nSomething is probably getting hacked right now.\n\nToday we'll do a deep dive\n\ninto the six worst data breaches of the past 10 years.\n\nThis is Incognito Mode.\n\n[dramatic music]\n\nIn July 2015, a person in a group calling themselves\n\nthe Impact team announced that they had hacked\n\nashleymadison.com, a website used for people\n\nwho wanna cheat on their spouses.\n\nA website that I definitely only heard about\n\nfor the first time this morning.\n\nImpact Team threatened to release the data\n\non all of Ashley Madison's users unless it's parent company\n\nAvid Life Media deleted ashleymadison.com\n\nas well as its sister site Established Men.\n\nInstead of deleting the websites,\n\nAvid Life Media released several statements\n\nbasically saying that they were dealing with the breach.\n\nIn response, Impact team released the details\n\nof 2,500 accounts to prove that they had the data.\n\nA month later, after Avid Life Media\n\nfailed to delete the websites,\n\nImpact Team released the account details\n\nof all of Ashley Madison's 36 million users.\n\nUnlike some criminal hackers, which wage attacks\n\nsimply to get money, or state-sponsored hackers,\n\nwhich do it for other purposes like espionage,\n\nhacktivists generally wage attacks\n\nsimply to make a moral point,\n\nsuch as getting a website for cheaters off the internet.\n\nYou have a lot of people that are freaking out right now\n\nthat are very concerned\n\nthat this information would never get out\n\nand back to their spouses.\n\nThese email addresses can be used for other things.\n\nThey can be used for identity theft.\n\nThey can be used for blackmail and extortion.\n\nThe data Impact Team released included phone numbers,\n\nemail addresses, including thousands linked to US military\n\nand government accounts, as well as other details.\n\nIt also revealed that while Avid Life Media charged people\n\n$19 to have their accounts deleted,\n\nit didn't actually delete that data.\n\nIt was just removing profiles.\n\nThe company has said to have made $1.7 million a year\n\njust from people having their data deleted.\n\nThe leak also exposed\n\nsome 1,200 Saudi Arabian email addresses,\n\nwhich is particularly dangerous\n\nbecause adultery is punishable by death in Saudi Arabia.\n\nAlso exposed was Josh Duggar,\n\na member of the Reality TV show 19 Kids and Counting,\n\na family-focused show that promoted Christian values.\n\nDuggar was later convicted as a sex offender\n\non unrelated charges.\n\nReporting found that some 70% of Ashley Madison's users\n\nwere men, and of the few women that were on the site,\n\nmany of them only logged in once or were just bots.\n\nImpact Team's leak led to widespread harassment\n\nand shaming of Ashley Madison users,\n\nand reportedly led to at least two deaths by suicide.\n\nAvid Life Media ultimately faced\n\na major class action lawsuit and was forced to settle,\n\nbut the data that Impact Team released is still online,\n\nso is ashleymadison.com,\n\nand the perpetrators remain unknown.\n\n[dramatic music]\n\nIn October 2020,\n\na popular chain of mental health clinics in Finland\n\ncalled Vastaamo announced that it had been breached.\n\nThe attacker said that they had stolen patient records\n\nand was extorting the company for 40 Bitcoin\n\nor roughly 400,000 Euros at the time.\n\nThe hacker had the records of roughly 36,000 patients.\n\nFor a country with just 5.5 million people,\n\nthis breach made it one of the worst crimes\n\nimpacting the most people in Finnish history.\n\nNot only that, but this breach was extremely cruel,\n\nimpacting some of the most sensitive information\n\nabout a person, including notes with their therapist\n\nand other health information.\n\nThe hacker using the name Ransom Man\n\nfirst tried extorting the company directly.\n\nWhen that failed,\n\nhe began trying to blackmail patients individually,\n\nsending out tens of thousands of ransom notes,\n\nthreatening to reveal patient information.\n\nRecords show that the hacker accessed the company's systems,\n\nnot once but twice.\n\nA flaw in the company's IT system\n\nexposed the entire patient database to the internet.\n\nThis gave the hacker access to unencrypted records\n\nthat were not anonymized.\n\nAs part of the extortion scheme,\n\nthe hacker was posting patient records daily\n\nin attempt to pressure Vastaamo to pay the ransom.\n\nThe hacker was later revealed to be Julius Kivimaki,\n\na member of the Infamous hacker group Lizard Squad,\n\nwhich was responsible for that 2014 Christmas hacks\n\nof Xbox Live and the PlayStation Network.\n\nWhy did you do this? It affected so many people.\n\nWhy we did it? Mostly for to raise awareness to ourselves.\n\nIn February 2023, Kivimaki was arrested in France\n\nand ultimately convicted of the Vastaamo hack\n\nand sentenced to six years and three months\n\nin Finnish prison.\n\nRecently, Kivimaki was released from custody\n\nas he appeals his case.\n\nVastaamo has since gone bankrupt.\n\n[dramatic music]\n\nIn 2015, a security engineer was doing a routine checkup\n\non the network of the Office of Personnel Management,\n\nUS Government Agency that handles employment\n\nfor most of the federal government.\n\nThat routine checkup ultimately led to the discovery\n\nof one of the biggest hacks\n\nof a US government agency in history.\n\nMore than 21 million Americans\n\nhad personal information stolen from government files\n\nin a data breach that was six times as large\n\nas originally disclosed.\n\nOPM is basically like the HR department\n\nfor the US federal government.\n\nThat means they have a mountain of information\n\nabout everyone who works for the federal government\n\nor applies for a job there\n\nor has ever worked there in the past.\n\nAround the time of the breach, OPM was fending off\n\nmore than 10 million attempted digital intrusions a month.\n\nIn this case, hackers were able to exploit a vulnerability\n\nin OPM's systems and install malware\n\non fewer than 10 servers,\n\none of which is known as the jump box,\n\nwhich gave them access to OPM's entire system.\n\nNow, you might think a hack of this scale\n\nwould be really obvious and easy to detect,\n\nbut in this case, security personnel\n\nhad to follow small digital breadcrumbs,\n\nwhich ultimately led them to a website\n\ncalled opmsecurity.org.\n\nThis third party website was registered by somebody\n\nunder the name Steve Rogers or Captain America.\n\nThat Captain America Reference ultimately led investigators\n\nto a Chinese military hacking group,\n\nwhich often referenced Captain America in their breaches.\n\nAt this point, OPM knew that it had been hit\n\nby an advanced persistent threat or APT,\n\nwhich is typically a state-sponsored group of hackers.\n\nNow, when we're talking about APTs,\n\nwe're not talking about some kids causing havoc\n\nor even cyber criminals trying to make money.\n\nWe're talking about the world's most advanced hackers,\n\nwhich often steal this data\n\nand use it for espionage purposes,\n\nblackmail, or national security reasons.\n\nAmong the most sensitive data stolen in the OPM breach\n\nwas its trove of what's known as Standard Form 86.\n\nThe SF 86 questionnaire can include\n\nall types of sensitive questions,\n\nincluding those about personal finances,\n\npast drug use, and psychiatric care.\n\nWord coming down late this afternoon\n\nof what sources are telling us\n\nis a massive Chinese hack of US government computers,\n\nperhaps on a scale never seen in this country before.\n\nSo how big is this breach?\n\nWell, to give you some figures, at the time,\n\nOPM was processing more than two million\n\nbackground checks a year.\n\nThat includes everyone from federal contractors\n\nto federal judges.\n\nOPM's database included more than 18 million archive copies\n\nof Standard Form 86.\n\nIt also gathered data on applicants\n\nfor some of the government's most secretive jobs.\n\nThat data can include everything\n\nfrom the results of lie detector tests\n\nto notes on people's sexual behavior.\n\nThe hackers also grabbed personnel files on 4.2 million\n\npast and present government employees.\n\nAnd finally, just before the breach was revealed,\n\nthe hackers grabbed 5.6 million images of fingerprints.\n\nThe hack of OPM ultimately exposed 22.1 million records\n\non US government employees,\n\npeople who had undergone background checks\n\nand their families.\n\nAt the time, there was a lot of speculation\n\nabout what the Chinese military hackers\n\nwould do with the data they had stolen.\n\nSome of these included recruiting spies\n\nor even creating fake fingerprints\n\nfor bypassing biometric securities,\n\nbut it's still a mystery why the hackers wanted the data\n\nand what they might have done with it.\n\n[dramatic music]\n\nMassive personal data breach.\n\nEquifax, the credit monitoring company,\n\nsays that social security numbers of 143 million Americans\n\nmay have been exposed.\n\nOne of the most infamous hacks of all time\n\nis the 2017 breach of Equifax,\n\na major credit reporting agency.\n\nThe attackers had gained unauthorized access\n\nto certain Equifax data files.\n\nThe hack exposed personal records\n\nof nearly 148 million Americans,\n\nalong with roughly 14 million UK citizens\n\nand 19,000 Canadian citizens.\n\nThis makes it one of the largest exposures\n\nof personal data in history.\n\nThis was a massive breach\n\naffecting most adult consumers in this country.\n\nBut what was also exposed\n\nwas Equifax's really poor security practices.\n\nJust to give you a sense of what Equifax is,\n\nit's one of the top three major credit reporting bureaus.\n\nIt operates in 24 countries,\n\nand it has an annual revenue of around $5 billion.\n\nGiven that the company handles extremely sensitive data,\n\nlike your social security number\n\nand even issues credit scores,\n\nyou would think that security would be\n\ntheir utmost priority.\n\nA scathing new report\n\nfinds one of the largest data breaches in the US history\n\nwas entirely preventable.\n\nThe Equifax breach began in May of 2017,\n\nbut the company didn't learn about it until July\n\nand it didn't tell the public about it until September.\n\nTo make matters worse, there was a patch available\n\nto the vulnerable software the hackers exploited\n\nall the way back in March,\n\nwhich means Equifax had two months to fix its systems,\n\nwhich would've prevented the hack.\n\nInvestigators found that Equifax\n\nfailed to use multifactor authentication\n\nand even used the username and password admin\n\nfor one of their portals.\n\nMaybe they should have been reading Wired\n\nto find out why they should not do that.\n\nEquifax's poor security practices\n\nwas already known to the company years before.\n\nAn audit in 2015 found that Equifax's IT team\n\nwasn't following the company's own patching schedules.\n\nThe data stolen from Equifax included people's names,\n\nsocial security numbers, date of birth, addresses,\n\nand driver's license numbers,\n\nand some people even had their credit card numbers stolen.\n\nThere are strangers out there that know who I am.\n\nThey know my birthdate, they know my social security number,\n\nand they know specifically where I live.\n\nThat scares me.\n\nIn 2019, Equifax agreed to pay the US Federal Government\n\nand all 50 states between 575 million\n\nand up to $700 million as a result of the breach.\n\nAs part of the settlement,\n\nEquifax agreed to pay $300 million to affected customers\n\nand also provide them with free credit monitoring services.\n\nIn 2020, the US Department of Justice\n\ncharged four members of the Chinese People's Liberation Army\n\nwith crimes related to the Equifax breach.\n\nChina's government denies their involvement,\n\nand this data has never been posted online.\n\n[dramatic music]\n\nIf you were anywhere near the internet\n\nor a television during the contentious\n\n2016 presidential election in the United States,\n\nall you heard about was Russia, Russia, Russia.\n\nThere was Russian bots in our comments.\n\nThere was fake news.\n\nThere was Russian meddling all over the place,\n\nor so some said.\n\nNo matter what anyone says about Russia's involvement\n\nin that hectic 2016 election, one thing we do know\n\nis that Russia's military hacked the Democrats,\n\nand we have the emails to prove it.\n\nThe 2016 hacks against the Democrats wasn't just one hack,\n\nand it wasn't even just one group.\n\nIt's been reported that it was two separate\n\nRussian military hacking groups\n\nknown as Cozy Bear and Fancy Bear.\n\nIn summer of 2015, Cozy Bear,\n\na hacker group tied to the Russian military,\n\ngained access to the servers\n\nof the Democratic National Committee.\n\nSeparately, in March 2016, Fancy Bear hackers gained access\n\nto the personal email of John Podesta,\n\nHillary Clinton's presidential campaign chair.\n\nThen in April of that year,\n\nFancy Bear also gained access to the DNC servers.\n\nWhen the breaches of the DNC were first revealed,\n\nexperts believe that Cozy Bear and Fancy Bear\n\nwere operating independently\n\nand had no knowledge of each other's activities,\n\nwhich is common among Russian military hackers.\n\nThe US Intelligence community even concluded\n\nthat Russia hacked the Democrats\n\nin order to help the election of Donald Trump.\n\nWikiLeaks, I love WikiLeaks.\n\nIn June of 2016,\n\nsomeone operating under the name Guccifer 2.0\n\nstarted pinging reporters with offers of leaked emails\n\nfrom the DNC and the Clinton campaign.\n\nUltimately, some 44,000 emails would be released online\n\neither by a website called DC Leaks or by WikiLeaks,\n\nthe radical transparency organization run by Julian Assange.\n\nOne of the biggest scandals to come out of the email leaks\n\nwas evidence that the Democratic Party\n\nclearly favored Hillary Clinton\n\nover Senator Bernie Sanders in the 2016 Primary.\n\nSo this is another set of email problems\n\nfor the Democrats and Hillary Clinton.\n\nBernie Sanders supporters are very upset\n\nby these revelations that's shown in these emails.\n\nHowever, the ultimate result was just pure chaos,\n\nand it's led to a lot of weird things in American politics,\n\nfrom the mainstreaming of conspiracy theories\n\nto the ultimate distrust of pretty much everyone\n\nin the political sphere.\n\nAnother lasting consequence was the rise of Pizzagate\n\nand other conspiracy theories,\n\nwhich stemmed from the Podesta email leaks.\n\nPizzagate, if you don't remember,\n\nis the completely unfounded conspiracy theory\n\nthat Democrats are a pedophile cabal\n\nthat included raping children\n\nin the basement of a pizza shop in Washington, DC.\n\nA pizza shop should be noted that does not have a basement.\n\nThe rise of Pizzagate ultimately led to the rise of QAnon,\n\nwhich ultimately led to the weird, polarized,\n\nfractious political environment we're in today.\n\nThis is a good example\n\nof state-sponsored hackers stealing data,\n\nnot for the data itself,\n\nbut for what releasing that data could do.\n\n[dramatic music]\n\nIn late 2024, US officials revealed\n\nthat roughly 10 US telecommunication companies\n\nhad been infiltrated by Salt Typhoon,\n\na hacker group tied to China's government.\n\nThe hacked telecom companies\n\ninclude AT&T, Verizon, and T-Mobile, and several others.\n\nThe Salt Typhoon hackers were found to have been spying\n\non the phone calls and text messages\n\nof both the Harris and Trump campaigns,\n\nas well as the office\n\nof then Senate Majority Leader Chuck Schumer.\n\nIt was later revealed that Salt Typhoon successfully hacked\n\nthe US National Guard.\n\nIn August, the FBI said that Salt Typhoon hackers\n\nhad targeted 600 organizations in 80 countries,\n\nincluding 200 American companies.\n\nSalt Typhoon's breach of US Telecommunications Networks\n\nis seen as the worst telecom hack in US history.\n\nThe Chinese hackers were in the American telecom system\n\nfor probably a year before they were detected.\n\nIt's so bad that even the FBI recommended\n\nthat people use encrypted messaging systems\n\nlike Signal to protect their communications.\n\nWhile companies and government officials\n\nsay they've taken steps to mitigate Salt typhoon's attacks,\n\nthey've stopped short of saying\n\nthey've completely eliminated the threat\n\nknowing that Salt Typhoon hackers are difficult to root out.\n\nBecause Salt Typhoon's hacking campaign is still ongoing,\n\nthe impacts of these breaches are unknown.\n\nThis has been Incognito Mode. Until next time.",
  "authors": [
    "Condé Nast"
  ],
  "url": "https://www.wired.com/video/watch/incognito-mode-6-of-the-worst-data-breaches-in-us-history"
}