{
  "title": "Why Queer Men Of Color Love Mariah Carey So Hard",
  "text": "My first boyfriend once said he would take a bullet for Mariah Carey. He was, if this isn’t yet clear, at the top 1 percentile of obsessed. He ran a sizable Twitter account that posted updates about the pop icon and memorized “pivotal” interviews such as the one she’d given about her Tokyo Dome concert in 1996. He’d say things like “Justice for Glitter” unironically and called anyone who had anything bad to say about her a misogynist.\n\nTo be fair, my own journey of queerness has involved an exploration of Mariah’s catalog. Many of my subsequent boyfriends, all queer men of color, also loved the “Butterfly” singer to varying degrees. Something about her captured their spirits in a way that no other artist has been able to. Despite her antics and all the shade she receives from the general public, my community has stood by her for over three decades like she’s some sort of emblem of queer liberation. I simply had to investigate why.\n\nFirst and foremost, I found that Mariah’s music has always embraced people who feel misunderstood or whose emotions have been dismissed in some way. Not long before we broke up, my first boyfriend showed me a lesser-known song by the Grammy winner called “Outside” off her “Butterfly” album.\n\nAdvertisement\n\n“It’s hard to explain. Inherently, it’s just always been strange,” she begins. “Always somewhat out of place everywhere.”\n\nListen to it right now if you can; the song is incredibly tender and flows like a river of revelation. Her melodies and lyrics are both profound and accessible. She goes on to sing about resigning oneself to the fact of not belonging and that for all the beauty in being different, there is also a persistent sadness.\n\nColby Sato, a 32-year-old Japanese-American who lives in Brooklyn and performs drag under the name Sativa Sunset, began to delve deeper into Mariah’s music in 2019 when they were performing at a Mariah-themed show. For Sato, Mariah’s larger-than-life persona and diva disposition feel very drag-like.\n\nAdvertisement\n\nI have to agree. She’s always giving us campy material to work with, whether it’s a clip of her looking massively uncomfortable on public transit or an interview claiming she “doesn’t know” some pretty famous celebrities who have clearly pissed her off.\n\nMariah Carey performs onstage during the Global Citizen Festival 2022: New York at Central Park on Sept. 24, 2022, in New York City. Theo Wargo via Getty Images\n\nMore importantly for Sato, though, a lot of her music seems to speak to really specifically queer emotions. Sato recalls the song “Obsessed” and how it reflected so many of his dating experiences.\n\nAdvertisement\n\n“As queer people, many of us just develop these obsessions with each other,” they tell me. “I feel like we’re always seeking the validation of other queer people.” A lot of queer dating for them feels like a push-and-pull, a back-and-forth between wanting someone desperately and being wanted by others, Sato says, which is an emotion Mariah captures expertly in a lot of her music.\n\nFor others, the affinity for Mariah started during childhood. Darren Christie, a 25-year-old pop culture lover from Massachusetts, says he started listening to Mariah because his parents loved hip hop and R&B. He really began exploring Mariah’s discography on his own, though, after watching her short-lived reality show, “Mariah’s World” in 2016. The more he learned about her, the more he felt that other Gen-Zers didn’t give Mariah the credit she’s due for influencing so much of music, including creating the blueprint for hip-hop features in pop songs.\n\nBut what has kept Christie a fan throughout the years is that he identifies deeply with Mariah’s story as a mixed-race person. “She’s never shied away from her biracial heritage,” Christie tells me. “She sings about not feeling like she belongs with her white side or Black side, and that’s something that, as a younger person, I had to deal with.”\n\nAdvertisement\n\nFor Felix Romero, a 29-year-old psychologist’s assistant based in New York, Mariah’s openness about the complexities of navigating belonging and race also drew him to her. Romero grew up on the coast of Ecuador but was lighter skinned than most of the community he grew up around. “People poked fun at how pale I am,” he says. “Mariah dealt with similar things navigating her identities.”\n\nAlthough it might not seem like a big deal to acknowledge her mixed identity in such an open way now, it was pretty groundbreaking when she was coming up in a country that saw things as Black and white and where the music you were “supposed” to make was inextricably linked to your race.\n\nIn that way, she became a blueprint for pop music and owning an identity that couldn’t fit neatly into a box. Romero, who considers himself a Lamb (the term Mariah fans use for themselves), says that understanding Mariah’s struggles is a big component of why people love her so much.\n\nAdvertisement\n\n“To be a Lamb means to just be confident in your skin and who you are,” Romero tells me. “And to always have that diva queen energy — but with kindness.”\n\nMariah’s music made us feel seen and contributed to our confidence and self-worth. Through her eyelash-batting, blunt honesty, and unabashed sensuality, she helped us embrace our own vulnerabilities.\n\nDavid Sabater, a 44-year-old from the Dominican Republic, first heard Mariah on “MTV Unplugged.” Although he didn’t speak English, he was instantly mesmerized and learned English by listening to her songs, which came in handy once he moved to New York as a young kid. As Sabater’s familiarity with English progressed, he began to understand more of Mariah’s lyrics and discovered an even deeper meaning behind the songs he already loved.\n\nAdvertisement\n\nEven though her lyrics were not, at least explicitly, about being queer, listening to Mariah was like therapy for Sabater when he thought no one else felt as invisible and misunderstood as he did. At the time, Sabater tells me, there were no positive depictions of queer people in pop culture, and the narrative was that gay men’s destiny was to die of AIDS.\n\nThe truth is that many queer men of color felt a similar type of loneliness, and Mariah’s music articulated that precise feeling. “I hated myself so much, but listening to ‘Butterfly’ helped me be like, ‘OK, try to love yourself a little,’” he says. “Her music kept me from going somewhere even darker.” To Sabater, some of Mariah’s more introspective ballads essentially boil down to one message: “I just want to exist and feel OK.”\n\nMany queer people of color still feel that even in the ways we are celebrated, we are equally misunderstood and flattened — by pop culture, by straight people, and by each other. The connection many of us have to Mariah reaches depths that go far beyond the it’s-fine-to-be-gay anthems of pop artists such as Taylor Swift or the seemingly opportunistic pandering of the Harry Styles of the world. I think it’s as simple as this: Mariah Carey has always spoken to us like there’s nobody else in the room. And for that, she’ll get many more decades of our devotion.",
  "authors": [
    "Contributing Writer"
  ],
  "url": "https://www.huffpost.com/entry/mariah-carey-queer-men-of-color_n_6565fd92e4b03ac1cd177071"
}