{
  "title": "'Lee Miller was the bravest person I ever knew': The pioneering photographer who captured the horror of World War Two",
  "text": "The unflinching, surreal gaze of the US artist and war photographer Lee Miller bore witness to both beauty and brutality. Now she is the subject of a major exhibition at Tate Britain.\n\nLee Miller's vision spirits us across place and time. At Tate Britain's newly opened retrospective of Miller's work, we see the intense intimacy and extraordinary range of her practice, spanning high fashion, avant-garde effects, surreal viewpoints and brutal war reportage. At 20, she was a Vogue cover star, embodying roaring-20s panache; she became apprentice and lover to legendary Paris-based artist Man Ray (with whom she pioneered the otherworldly solarisation photographic technique), then swiftly established her own place behind the camera and an independent studio. She would later quip: \"I'd rather take a picture than be one\". By 1942, she was an accredited World War Two correspondent for the same glossy magazine she had originally modelled and shot designer outfits for.\n\nAlamy US photographer Lee Miller, photographed in 1943 (Credit: Alamy)\n\nMiller's images appear to code-switch and slip between boundaries – so sleekly, in fact, that their scope remains startling. Major international exhibitions – at Tate Britain and, from next month, at Vancouver's Polygon Gallery – as well as books and screen releases (notably the 2023 biopic Lee, starring Kate Winslet in the title role) reflect a modern mainstream reawakening to Miller. They also highlight a growing realisation: that she was, arguably, the most fearless photographer of the 20th Century.\n\nTate exhibition curator Hilary Floe spent three years immersed in Miller's work for this show. She tells the BBC: \"What unites these vast and sprawling bodies of work that [Miller] creates? These three words kept haunting me: fearless, poetic, and surreal.\"",
  "authors": [],
  "url": "https://www.bbc.com/culture/article/20251006-lee-miller-the-most-fearless-photographs-of-the-20th-century"
}