{
  "title": "Brazil leads new international effort against climate lies",
  "text": "is a senior science reporter covering energy and the environment with more than a decade of experience. She is also the host of Hell or High Water: When Disaster Hits Home , a podcast from Vox Media and Audible Originals.\n\nPosts from this author will be added to your daily email digest and your homepage feed.\n\nBrazil and the United Nations launched a new international effort to combat disinformation on climate change. They announced the Global Initiative for Information Integrity on Climate Change during the G20 Leaders’ Summit taking place in Rio de Janeiro, Brazil.\n\nIt’s a collaboration between governments and international organizations to boost research on misinformation swirling online and around the globe that they fear could slow action on climate change. There isn’t much information available yet, but they say they’ll fund nonprofit efforts to counter that spread of lies.\n\n“Countries cannot tackle this problem individually,” President of Brazil Luiz Inácio Lula da Silva said in a press release.\n\n“Countries cannot tackle this problem individually.”\n\nOnly Chile, Denmark, France, Morocco, the United Kingdom, and Sweden have joined Brazil in the initiative so far. Countries that make the commitment are expected to contribute to a fund administered by the United Nations Educational, Scientific and Cultural Organization (UNESCO). The initial goal is to get more countries on board and raise $10 to 15 million over the next three years. The money is then supposed to be distributed to nonprofit organizations as grants to support research and public awareness campaigns on climate disinformation.\n\nThey haven’t yet named any specific groups they plan to work with; “calls for partnerships” are forthcoming. Some environmental organizations are already working together to study disinformation and push for measures to stop its spread, like the Climate Action Against Disinformation coalition that publishes reports on misinformation trends and advocates for more stringent content moderation.\n\nA webpage for the new global initiative says environmental disinformation is “increasingly spreading through social media, messaging apps, and generative AI.” That has “serious” consequences, it says: “it undermines scientific consensus, obstructs authorities’ ability to respond effectively to the crisis, and threatens the safety of journalists and environmental defenders working on the frontlines.”\n\nRelated Violent threats against FEMA swirl on social media\n\nFEMA employees faced violent threats on social media in the aftermath of Hurricane Helene in the US, for example. Accounts spewing misinformation about the storm and FEMA were also tied to content denying climate change, according to an analysis by the Institute for Strategic Dialogue (ISD) in October. Posts baselessly accused FEMA of seizing private property and confiscating donations — lies that risked deterring storm survivors from applying for assistance, and that raised fears that FEMA staff might face attacks.\n\nUnited Nations Secretary-General António Guterres also voiced his concerns during remarks today with both the G20 summit and a UN conference on climate change currently underway. “We must also take on climate disinformation,” Guterres said. “Our climate is at a breaking point.”",
  "authors": [
    "Justine Calma"
  ],
  "url": "https://www.theverge.com/2024/11/19/24300541/disinformation-climate-change-g20-summit-united-nations"
}