{
  "title": "Israeli airstrikes kill 33 people in Gaza in escalation of post-ceasefire attacks",
  "text": "Israeli attacks in Gaza have killed 33 people and injured many more, according to medical officials, in one of the most serious escalations of violence since the US-backed ceasefire came into effect last month.\n\nOfficials at Nasser hospital in Khan Younis said they received the bodies of 17 people, including five women and five children, after four Israeli airstrikes targeted tents sheltering displaced people. In Gaza City, medical officials said two airstrikes killed 16 people, including seven children and three women.\n\nIsrael said it launched the attacks after its soldiers came under fire in Khan Younis on Wednesday, though they suffered no reported casualties. Hamas condemned the Israeli strikes as a “shocking massacre” and denied firing toward Israeli troops.\n\nPalestinians in Gaza said they felt as if the two-year war had never stopped. Officials in the territory say more than 300 people have been killed by Israeli strikes since the ceasefire.\n\n“My daughter kept asking me all night, ‘Will the war come back?’ Every time we try to regain hope, the shelling starts again. When will this nightmare end?” Lina Kuraz, 33, from the Tuffah neighbourhood, east of Gaza City, told Agence France-Presse.\n\nMohammed Hamdouna, 36, who was displaced from northern Gaza to a tent in al-Mawasi, said the war had not ended. “The intensity of the death toll has decreased, but martyrs and shelling happen every day. We are still living in tents. The cities are rubble; the crossings are still closed, and all the basic necessities of life are still lacking,” he said.\n\nView image in fullscreen Israeli airstrikes on camps in al-Mawasi, Khan Younis, killed 17 people on Wednesday, hospital officials said. Photograph: Ramadan Abed/Reuters\n\nQatar, a key mediator throughout the two-year war, condemned the “brutal” Israeli airstrikes, saying they were “a dangerous escalation that threatens to undermine the ceasefire agreement”.\n\nOn Monday the UN security council endorsed Donald Trump’s plan for Gaza, including the deployment of an international stabilisation force and a possible path to a sovereign Palestinian state.\n\nHowever, huge challenges remain. It is unclear how Hamas will be made to relinquish its weapons, who will supply the troops for the new peacekeeping force, and how “full aid” will reach Gaza without Israel lifting many of its current restrictions on humanitarian supplies.\n\nHamas is still holding the remains of three hostages, and Israeli military forces hold more than 50% of Gaza after withdrawing from some of their positions at the time of the ceasefire. The territory is now divided by the “yellow line”.\n\nGaza’s health ministry has reported more than 300 deaths since the ceasefire came into effect, an average of more than seven a day. Each side has accused the other of violating its terms, which include increasing the flow of aid into Gaza and returning hostages, dead or alive, to Israel.\n\nThe two-year war in Gaza was triggered when Hamas-led militants killed about 1,200 people, mostly civilians, and abducted 251 during a surprise attack into Israel in October 2023. More than 69,000 Palestinians, mostly civilians, were killed in the ensuring Israeli offensive and in strikes since the ceasefire. The bodies of thousands more remain under the rubble.\n\nThe new violence in Gaza coincided with a barrage of Israeli airstrikes in southern Lebanon on Wednesday. A day earlier, an Israeli airstrike killed 13 people in the Palestinian refugee camp of Ein el-Hilweh, the deadliest Israeli attack on Lebanon since a ceasefire in the Israel-Hezbollah conflict a year ago.\n\nAgence France-Presse and the Associated Press contributed reporting",
  "authors": [
    "Jason Burke"
  ],
  "url": "https://www.theguardian.com/world/2025/nov/20/israeli-airstrikes-gaza-ceasefire-khan-younis"
}