{
  "title": "Tesla is getting better about reporting FSD safety data — but the numbers are still misleading",
  "text": "is transportation editor with 10+ years of experience who covers EVs, public transportation, and aviation. His work has appeared in The New York Daily News and City & State.\n\nPosts from this author will be added to your daily email digest and your homepage feed.\n\nLast week, Tesla revealed a new section of its website dedicated to reporting safety statistics for its advanced driver assist systems, Autopilot and Full Self-Driving (FSD).\n\nThe new hub appears to be an attempt to move beyond the company’s traditional quarterly safety reports, which have been criticized for failing to account for basic facts about traffic statistics, and toward something more verifiable and reliable. And given that Tesla’s future relies on people trusting its self-driving technology, the stakes couldn’t be higher.\n\nBut safety experts say the updated report is too little, too late.\n\n“Yeah on the surface it looks like FSD is performing fairly well,” said Noah Goodall, a civil engineer who has published several peer-reviewed studies about Tesla Autopilot. “But I put very little faith in these numbers because of Tesla’s past deceptions.”\n\n“I put very little faith in these numbers because of Tesla’s past deceptions.”\n\nTesla owners have driven 6.47 billion miles on FSD — and counting. The site literally features a mile counter that is always increasing. “Full Self-Driving (Supervised) keeps you safer,” the site reads, noting that Tesla owners using FSD are driving around 5.1 million miles before a major collision and around 1.5 million miles before a minor collision. That’s much better than the average US driver, who travels 699,000 miles before a major collision and 229,000 miles before a minor collision.\n\nOne of the common criticisms of Tesla’s quarterly safety reports was that they focused almost exclusively on Autopilot, a less capable driver assist feature mainly used on highways, rather than FSD, which can be used on local roads. The reports didn’t take into account the fact that crashes are more common on city streets and undivided roads than on the highway, where Autopilot is most often used.\n\nThe new safety hub finally separates highway miles from non-highway miles, which Philip Koopman, autonomous vehicle expert at Carnegie Mellon University, calls a “good start.” But on his Substack, Koopman drills down on many details that he says undermines Tesla’s claim that drivers who use FSD are safer than those who don’t.\n\nFor example, the company claims that “a brand-new Tesla chockful of safety technology is safer than an old used car without that technology,” which he says is similar to claiming that a particular high school produces the best athletes because its students can run faster than the average US citizen, including people who are unfit and those in nursing homes.\n\nHe also notes that the safety report excludes any information about people who have been injured or killed in crashes involving Autopilot or FSD. Tesla claims that injury reports are “inconsistently provided through voluntary reporting by drivers or otherwise inaccessible to Tesla due to health-related privacy laws.” But Koopman says Tesla likely has a good idea of the number of fatalities in crashes linked to FSD by, if no other way, counting up the incoming lawsuits.\n\n“Tesla has released a document full of marketing puffery,” Koopman concludes, “and not a serious safety analysis.”\n\nWaymo, which operates robotaxis in five US cities, routinely publishes safety data to its own online hub. But the company also publishes peer-reviewed studies to back up its claims that its fully driverless vehicles continue to outperform human drivers. This level of independent verification is totally absent from Tesla’s reports. In fact, Goodall has said he has trouble publishing studies about Tesla’s numbers because reviewers assume they’re fake.\n\n“None of these data are independently verified, so I’m forced to trust Tesla here,” Goodall told The Verge, “but that’s very hard given their history of misleading practices when it comes to safety data.”",
  "authors": [
    "Andrew J. Hawkins"
  ],
  "url": "https://www.theverge.com/transportation/824381/tesla-fsd-safety-data-flaws-misleading"
}