{
  "title": "Daniel Ek stepping down changes nothing for artists boycotting Spotify",
  "text": "Then, on Tuesday, Ek announced that he would be stepping down as CEO. Neither Ek nor Spotify gave any indication that the growing furor over his pivot to warfare was the impetus behind the decision. But if the company was hoping that a byproduct of replacing Ek as CEO would be to stem the tide of artists leaving the platform, I have some bad news.\n\n“Our issues with this particular streaming platform go far beyond one reptile.” — Will Anderson of Hotline TNT\n\nThe Verge reached out to a number of artists and labels who had removed their music from Spotify, and it doesn’t sound like any of them plan to change their tune anytime soon. Part of this is due to the fact that Ek’s title change is little more than that. He will remain the executive chairman and, even in the announcement of Gustav Söderström and Alex Norström being named the new co-CEOs, Ek immediately undercut their authority, saying, “Gustav and Alex will continue to report to me … I will be more hands on than some of my U.S. peers who have a Chairman title.” When asked for clarification about how Ek’s role would change, Spotify declined to comment.\n\nSo, Ek might be handing over some responsibility for day-to-day operations, but he will still hold significant sway over the company’s decisions. Jeremy Blake, who also hosts the YouTube channel Red Means Recording, removed his music in July. He told The Verge that this boardroom shuffling “changes nothing.” He quickly pointed out that “an Executive Chairman is a key leadership position that leads the board of directors while also holding an active, strategic, and often hands-on role in the day-to-day business and executive management of the company.”\n\nWill Anderson of Hotline TNT had a similar takeaway, telling The Verge, “By the company’s own admission, nothing will be changing. Their statement says the move ‘formalizes how Spotify has successfully operated since 2023’. To me this sounds like the company is aware of shifting public sentiment and is trying to publicize a little title adjustment for their CEO to claw back some good will before things snowball out of control.”\n\n“The rare thing Senate Republicans and Democrats seem to agree on is that Spotify is out of control.”\n\nColin Volvert, label manager for Kalahari Oyster Cult, which pulled its entire catalog from Spotify in June, was also unswayed. “We remain attentive to developments, but as it stands, it’s not more than an optics-driven management stunt,” he told The Verge. “Not exactly the clean slate we’d hope for. More likely, it frees him to pursue his more controversial endeavours.”\n\nWhat Anderson, Blake, and others have made clear, though, is that this was never just about Daniel Ek. Anderson says, “Our issues with this particular streaming platform go far beyond one reptile.” His “funding AI battle tech,” to use Deerhoof drummer Greg Saunier’s words, was merely the last thing in a litany of issues. Satomi Matsuzaki, Deerhoof’s vocalist, was unequivocal in a statement to The Verge:\n\n“We won’t return to Spotify unless they start to treat every artist respectfully and pay them a fair amount. They must stop making money by using AI scams. Artists are struggling to survive. Spotify’s payment of $0.003 per stream won’t even get us a can of soda. Their system won’t change dramatically. Good news is Deerhoof will still exist without Spotify if you type ‘Deerhoof’ into your search engine. Spotify does not define our existence.”\n\nChris Macowski, Director of Corporate Communications for Spotify, defended the company’s royalty system, saying:\n\n“All major streaming services calculate royalties in the same way, based on streamshare (not per-stream). In general, if an artist’s catalog accounts for 1% of total streams, they receive 1% of the royalties. Discussions about per-stream rates can be misleading, because those rates are a reflection of how much listening happens on a platform. Total payouts divided by total streams equals the per-stream rate. Services with more active listeners and more streaming will have lower per-stream rates, while those with less listening activity will appear to have higher ones. Spotify paid out $10 billion last year alone, more than any other service.”\n\nThe issue goes beyond simply undervaluing artists. In 2024, the company changed its Premium plan to include audiobooks, which allowed it to suppress royalty payouts by bundling audiobooks with music. With dramatically more hours of content to divide subscription revenue among, royalty payouts dropped by $150 million, while Spotify’s revenue continued to climb dramatically. The underhanded tactics the company uses to artificially suppress royalty rates were even the target of a bipartisan call for an investigation in June — the rare thing Senate Republicans and Democrats seem to agree on is that Spotify is out of control.\n\nBlake sees this valuing of profit over art as the ultimate problem. “Spotify is going to have to make Herculean efforts to roll back tons of damaging choices they’ve introduced to their platform over the years. I don’t see that happening with a publicly traded company that’s beholden to generate profit for shareholders,” he said.\n\nSome artists have proven that, while it might not always be easy, you can find success without Spotify. Joanna Newsom has never put her music on Spotify, calling it a “villainous cabal” in an interview with the Los Angeles Times. And Cindy Lee made herself a critical darling with Pitchfork’s No. 1 record of 2024, Diamond Jubilee, but the album is unavailable on streaming platforms.\n\nBetween the proliferation of AI slop, association with controversial figures, and terrible royalty rates, Spotify has plenty of other baggage beyond Daniel Ek’s investment in military companies. Xiu Xiu’s Jamie Stewart told Anthony Fantano that “us being off of Spotify is not going to make any real financial impact for them. It really has more to do with our conscience.” But Anderson was a bit more optimistic about artists’ ability to effect change: “It seems like Spotify is rattled, and they should be.”\n\nUpdate, October 5th: Added comment from Spotify.",
  "authors": [
    "Terrence O'Brien"
  ],
  "url": "https://www.theverge.com/report/791593/daniel-ek-stepping-down-changes-nothing-for-artists-boycotting-spotify"
}