{
  "title": "The best early Black Friday deals we’ve found so far on laptops, TVs, and more",
  "text": "Black Friday is the most anticipated day of the year for bargain hunters. While there’s still some time to go before November 28th, we’ve already found a healthy selection of early discounts, allosignwing you to get a jump on your holiday shopping. Right now, for instance, the new AirPods Pro 3 are receiving their first sizable discount. Meanwhile, Google’s Pixel Watch 4 — the Android watch to beat — is on sale for the first time.\n\nHowever, that’s just a taste of what’s to come in November. As the month goes on, we’re expecting to see even more deals — including sizable drops on robovacs, TVs, and headphones. In fact, retailers like Amazon, Walmart, Best Buy, and Target have already kicked off their holiday promos. We’ll be updating this guide over the next week or so, too, so be sure to check back as we approach the main event.\n\nApple deals\n\nAmazon, AirPods 4 down to $79.99 ($90 off), which is their best price to date. Apple’s latest non-Pro AirPods sound great despite their open-style build, support voice isolation for clearer-sounding calls, and have a streamlined setup process and multipoint pairing with Apple devices. You can also get the version with active noise cancellation on sale for a new all-time low of $109.99 ($70 off) at Read our review. Walmart , and Target have marked thedown to $79.99 ($90 off), which is their best price to date. Apple’s latest non-Pro AirPods sound great despite their open-style build, support voice isolation for clearer-sounding calls, and have a streamlined setup process and multipoint pairing with Apple devices. You can also get the version with active noise cancellation on sale for a new all-time low of $109.99 ($70 off) at Amazon Walmart , and Target\n\nApple Watch Series 10 has the same wide-angle OLED screen, the same chip, and the same health sensors as the Series 11; however, unlike Apple’s latest smartwatch, the Series 10 is on sale at Thehas the same wide-angle OLED screen, the same chip, and the same health sensors as the Series 11; however, unlike Apple’s latest smartwatch, the Series 10 is on sale at Walmart in its 42mm base configuration for $249 ($150 off). The battery life is slightly less than that of the Series 11, and you lose out on the option for 5G connectivity, but we reckon those are pretty minor compromises for most people. Read our review\n\nHomePod is Apple’s latest smart speaker, and you can pick one up for $269.99 ($30 off) at The second-genis Apple’s latest smart speaker, and you can pick one up for $269.99 ($30 off) at Best Buy right now. The great-sounding speaker can play Dolby Atmos tracks with proper separation, though you can also pair two together for even better separation. The speaker doesn’t support Bluetooth, which means your device has to be on the same network to stream music to it. You can also ask Siri to play tunes, control various smart home accessories, set timers, or answer questions, but all of those functions still require a stable internet connection. Read our review\n\n11-inch iPad Pro has only been out for about a month, but that hasn’t stopped The latesthas only been out for about a month, but that hasn’t stopped Amazon from cutting the price of the 256GB / Wi-Fi model to $924 ($75 off). Apple’s newest, most powerful iPad has the same design as last year’s model, but features a faster M5 processor, which you’ll notice most when performing resource-intensive tasks like playing games. Lower storage configurations of the iPad Pro also have 12GB of RAM (up from 8GB), while all models have faster memory bandwidth. Read our review\n\nRelated The 34 best gift ideas for mom this holiday season\n\nHeadphone and earbud deals\n\nBose’s Ultra Open Earbuds are the brand’s boldest, most unique earbuds — and you can pick them up at are the brand’s boldest, most unique earbuds — and you can pick them up at Amazon Walmart , and Best Buy for $199 ($100 off), their lowest price to date. Instead of sitting in your ear canal, the earbuds cling to your outer ear like a piece of jewelry. That design means you’ll always hear external noise, which isn’t ideal if you want to block out noisy coworkers; however, it’s great if you need to remain aware of your surroundings, such as when walking or riding a bike. Read our review\n\nEarFun Free Pro 3, a great pair of cheap wireless earbuds, are currently down to just $27.99 ($52 off) at PDFP3. The wireless earbuds feature ANC, wireless charging, and over seven hours of continuous playback on a single charge. The EarFun Tune Pro, meanwhile, are on sale for TUNEPRO56. The over-ear headphones feature noise-canceling tech and support for multipoint Bluetooth connectivity, so you can connect to two devices simultaneously. EarFun is offering up to 65 percent off its already affordable headphones, earbuds, and speakers. The, a great pair of cheap wireless earbuds, are currently down to just $27.99 ($52 off) at Earfun’s online storefront with coupon code. The wireless earbuds feature ANC, wireless charging, and over seven hours of continuous playback on a single charge. The, meanwhile, are on sale for $48,99 ($21 off) with code. The over-ear headphones feature noise-canceling tech and support for multipoint Bluetooth connectivity, so you can connect to two devices simultaneously.\n\nBeats Solo Buds at You can pick up the cream-coloredat Walmart for $39 ($40 off), an all-time low. The platform-agnostic earbuds feature gummy tips, offer up to 18 hours of playback per charge, and support both Apple’s Find My and Android’s Find My Device feature, which lets you locate them more easily should you lose them. They don’t have active noise cancellation, but that’s unsurprising at this price. Read our hands-on impressions\n\nSony WF-1000XM5 for $228 ($101 off) at Now through December 1st, you can snag thefor $228 ($101 off) at Amazon Best Buy , and Sony’s online store , which matches the price drop we saw during Amazon’s most recent Prime Day event. Sony’s flagship earbuds improve upon the prior model with richer sound, slightly more powerful noise cancellation, and vastly superior comfort thanks to their reduced size and weight. They also come with four foam-style ear tips, offer around eight hours of battery life with ANC enabled, and carry an IPX4 rating with support for multipoint connectivity. Read our review\n\nSmartwatch and fitness tracker deals\n\nFitbit Ace LTE is down to around $99.95 ($80 off) at Theis down to around $99.95 ($80 off) at Amazon Target , and Best Buy , which marks a new low price. The fitness tracker is designed specifically for kids, with movement-based games that encourage physical activity. It also supports GPS location tracking, along with the ability to send messages and place calls to a limited number of contacts. However, keep in mind that a Fitbit Ace Pass subscription ($9.99 per month / $119.99 per year) is required for location tracking, messaging, and access to the Fitbit Arcade. Read our hands-on impressions\n\nFitbit Versa 4 is on sale at Theis on sale at Amazon Target , and Best Buy for $119.95 ($80 off), which is the lowest price we’ve seen this year. The smartwatch features heart rate, activity, sleep, blood oxygen, menstrual health, and stress tracking, as well as more than 40 exercise modes that automatically detect and track specific workouts. Although it doesn’t support ECG, it can record heart rate variability and monitor it 24/7. It also supports services like Fitbit Pay and Google Maps, extending its usefulness beyond its core fitness tracking capabilities.\n\nFitbit Inspire 3 has returned to its all-time low of $69.95 ($30 off) at The entry-levelhas returned to its all-time low of $69.95 ($30 off) at Amazon Target , and Best Buy . The basic fitness band nails the basics, providing heart rate, sleep, exercise, blood oxygen, and menstrual health tracking. It can also provide you with a sleep score every morning, along with tips for improving your sleep. You can also remove the Inspire 3 from its band and wear it as a necklace, which is less obtrusive but disables heart rate tracking. Read our hands-on impressions\n\nVenu X1 , one of Garmin’s more premium smartwatches, is available from The, one of Garmin’s more premium smartwatches, is available from Amazon and Garmin for a new low of $599.99 ($200 off). The X1 features a 2-inch OLED display and Garmin’s thinnest case yet. It can also track your activity, heart rate, blood oxygen level, and sleep (including naps). It’ll provide you with a morning report based on recorded health metrics, and it offers stress tracking and guided meditations. It can even track over 100 activities and create a running or strength training regimen via Garmin Coach.\n\nGarmin’s midrange Vivoactive 6 is on sale for $249.99 ($50 off) — its best price to date — at is on sale for $249.99 ($50 off) — its best price to date — at Amazon Best Buy , and REI . The watch features a circular 1.2-inch OLED screen, a battery that can last up to 11 hours per charge, and Bluetooth support. It can also track your activity, blood oxygen level, sleep, and heart rate, as well as generate fitness plans using the built-in Garmin Coach.\n\nTablet and e-reader deals\n\nAmazon Fire HD 10 Kids tablet is matching its all-time low of $104.99 ($85 off) at The latesttablet is matching its all-time low of $104.99 ($85 off) at Amazon Target , and Best Buy . The tablet features a 10.1-inch 1080p display, a kid-proof case, and up to 13 hours of battery life. It also comes with 32GB of storage for loading up apps and other content, along with robust parental controls and a two-year warranty. It also comes with a year of Amazon Kids Plus, which features access to ad-free, age-appropriate content, including books, movies, apps, and more.\n\nAmazon Fire 7 Kids is currently available at If you’re looking for something more compact, the latestis currently available at Target Best Buy , and Amazon , for $44.99 ($55 off), its lowest price to date. The basic tablet offers many of the same features and services found in the larger 10.1-inch model — including an extended two-year warranty, extensive parental controls, and a year of Amazon Kids Plus — but the base Fire 7 Kids comes with 16GB of storage and features a smaller 7-inch display. The device also offers up to 10 hours of battery life, providing plenty of fun while on the road.\n\nKindle Colorsoft , Amazon’s newest color e-reader, is down to a new low of $169.99 ($80 off) at Signature Edition has 32GB of storage, plus wireless charging and an auto-adjusting front light sensor. You can pick the latter up for $229.99 ($70 off) at The 16GB, Amazon’s newest color e-reader, is down to a new low of $169.99 ($80 off) at Amazon Best Buy , and Target . It features a 7-inch screen with 300ppi when viewing text and black-and-white imagery, or 150ppi when viewing color. It has 16GB of storage, a battery that lasts up to eight weeks, and a waterproof design. If you want to carry around more books, thehas 32GB of storage, plus wireless charging and an auto-adjusting front light sensor. You can pick the latter up for $229.99 ($70 off) at Amazon Best Buy , and Target\n\nAmazon, 2024 Kindle Scribe with 16GB of storage down to an all-time low of $279.99 ($120 off). The Scribe has a 10.2-inch display and a battery that can last up to 12 weeks, and it comes with Amazon’s Premium Pen, which you can use to annotate books or jot down ideas. The e-reader’s built-in AI features, meanwhile, allow you to clean up your handwriting, summarize your notes, or adjust the length and tone of what you’ve written. However, keep in mind that Amazon Best Buy , and Target have all marked thewith 16GB of storage down to an all-time low of $279.99 ($120 off). The Scribe has a 10.2-inch display and a battery that can last up to 12 weeks, and it comes with Amazon’s Premium Pen, which you can use to annotate books or jot down ideas. The e-reader’s built-in AI features, meanwhile, allow you to clean up your handwriting, summarize your notes, or adjust the length and tone of what you’ve written. However, keep in mind that Amazon recently announced a new model , though we still don’t have a firm launch date. Read our review\n\nTV and streaming deals\n\nLG’s 55-inch C5 OLED is down to around $1,196.99 ($804 off) at is down to around $1,196.99 ($804 off) at Amazon Best Buy , and LG’s online storefront . The midrange TV is a good entry point into the world of OLED technology, offering a solid balance in terms of design, brightness, and high-end gaming features, including four HDMI 2.1 ports that support 4K at 144Hz with variable refresh rate tech. The C5 Series also handles glare and ambient light better than the step-down B5 Series; however, OLED panels are still not ideal for really bright rooms.\n\nHisense’s 65-inch S7N Canvas TV is the company’s answer to Samsung’s popular Frame TV, one you can currently grab for around $897.99 ($402 off) at is the company’s answer to Samsung’s popular Frame TV, one you can currently grab for around $897.99 ($402 off) at Amazon and Best Buy . The 4K set has a matte screen that makes the artwork it displays more akin to a real painting, and Hisense includes a wall mount, allowing you to hang it. The S7N features a QLED panel with a 144Hz refresh rate and four HDMI ports (two HDMI 2.1 and two HDMI 2.0), making it suitable for a mix of current and last-gen gaming consoles.\n\nFire TV Stick 4K Plus is the company’s midrange option, and it’s down to an all-time low of $24.99 ($25 off) at Amazon’s recently rebrandedis the company’s midrange option, and it’s down to an all-time low of $24.99 ($25 off) at Amazon and Best Buy . The inexpensive streaming device comes with an Alexa Voice Remote that features a built-in microphone, which lets you use Amazon’s virtual assistant to find TV shows and movies, or control compatible smart home accessories using your voice. You can also use it to access Amazon Luna or Xbox Game Pass, allowing you to play games from their respective cloud gaming libraries.\n\nRoku Pro Series 4K TV $ 598 $ 900 34 % off $ 598 Roku’s latest Pro 4K TV has a 120Hz refresh rate, four HDMI ports (two 2.1 ports), full array local dimming for even brightness, and supports both Dolby Vision IQ and HDR 10 Plus for better color accuracy. It also works with Apple Home, Amazon Alexa, and Google Home to integrate easily into most smart homes. Read More $598 at Amazon (55-inch)$1200 at Amazon (65-inch)\n\nLG’s 77-inch G5 OLED is an expensive set, but you can currently snag it for around $3,496.99 ($1,003 off) — one of its best prices to date — at is an expensive set, but you can currently snag it for around $3,496.99 ($1,003 off) — one of its best prices to date — at Amazon Best Buy , and LG’s online storefront . The high-end 4K TV delivers better brightness than the aforementioned C5, allowing you to use it in rooms that are exposed to a lot of ambient light. It also features four HDMI 2.1 ports that support 4K at 165Hz with VRR, as well as support for the popular Dolby Vision HDR format.\n\nSmart home deals\n\nRing Battery Doorbell and Indoor Cam Bundle is available at Theis available at Amazon Target , and Best Buy for $69.99 ($70 off), matching its best price to date. The bundle includes a Ring Battery Doorbell and an Indoor Cam, making it a great starter kit for renters and new home owners. The Ring Battery Doorbell offers head-to-toe video outside your front door, while the Indoor Cam let’s you keep an eye on an interior space. They’re easy to install, easy to set up, and easy to use.\n\nYale Assure Lock 2 Touch is on sale for $199.99 ($100 off) at Theis on sale for $199.99 ($100 off) at Best Buy . The stylish smart lock works with every major smart-home platform and supports both Bluetooth and Wi-Fi. It also lets you unlock your door in multiple ways, including via fingerprint, touchscreen, the app, and even has an auto-unlocking feature. Read our review.\n\nGoogle Nest Cam — which can be used both indoors and outside — is now available for its lowest price in months at The— which can be used both indoors and outside — is now available for its lowest price in months at Amazon Best Buy , and the Google Store , where you can pick it up for $119 ($60 off). The battery-powered security cam features 24/7 recording, smart alerts for people, pets, and vehicles, and up to 60 days of video history (with a Nest Aware subscription). You can also snag a two-pack for $229.99 ($100 off) at Amazon Best Buy , and the Google Store , or a three-pack for $349.99 ($100 off) at Best Buy and the Google Store\n\nReolink’s Video Doorbell is one of our is one of our top recommendations if you don’t want to pay a subscription fee to view footage, and it’s returned to its all-time low of $76.99 ($43 off) at Amazon, Newegg, and Reolink’s website. The wired doorbell can record clear 2K HDR footage and store video clips locally on a microSD card, the Reolink Hub, or an FTP server. It’s also compatible with both Amazon Alexa and Google Home, but not Apple Home.\n\nAqara Smart Lock U300 $ 149 $ 230 35 % off $ 149 The first single-borehole smart lock to work with Apple Home Key, the U300 can also be unlocked with a fingerprint, making it an easy, smart addition for shed, garage, or home office doors. It works over Thread and is Matter compatible, with up to a 10-month battery life. Read More $149 at Amazon$230 at Best Buy\n\nAqara G4 Video Doorbell $ 70 $ 120 42 % off $ 70 The Aqara G4 is an inexpensive HomeKit Secure Video doorbell that also works with Alexa and Google Home. It’s powered by batteries, wires or both, and offers 24/7 local recording. But a 16:9 aspect ratio and poorer video quality let it down. Read More $70 at Amazon\n\nEufy X10 Pro Omni , WS24T2351 ). The X10 Pro Omni is particularly great for cleaning up carpets and tiles, thanks to its 8,000Pa of suction power. It also features reliable AI-powered obstacle detection, dual oscillating brushes for mopping up floors, and a dock that handles auto-emptying, washing, and refilling. The our favorite midrange robot vacuum / mop , has returned to its Prime Day low of $499.99 ($400 off) at Amazon and from Anker’s online storefront (with code). The X10 Pro Omni is particularly great for cleaning up carpets and tiles, thanks to its 8,000Pa of suction power. It also features reliable AI-powered obstacle detection, dual oscillating brushes for mopping up floors, and a dock that handles auto-emptying, washing, and refilling.\n\nEufy Omni S1 Pro is also matching its all-time low of $699.99 ($800 off) at WS24T2080111). The robovac features an 11.4-inch roller mop and dual spinning side brushes, which work in tandem to leave your hardwood floors spotless. Plus, with 8,000Pa of suction power, it’s decent at picking up dirt and debris from carpets; it also features solid AI-powered obstacle avoidance, so you don’t need to worry about it getting stuck in clutter. Theis also matching its all-time low of $699.99 ($800 off) at Amazon and from Anker’s online storefront (with promo code). The robovac features an 11.4-inch roller mop and dual spinning side brushes, which work in tandem to leave your hardwood floors spotless. Plus, with 8,000Pa of suction power, it’s decent at picking up dirt and debris from carpets; it also features solid AI-powered obstacle avoidance, so you don’t need to worry about it getting stuck in clutter.\n\nSoundbar and speaker deals\n\nJBL’s Charge 6 is marked down to an all-time low of $129.95 ($70 off) at is marked down to an all-time low of $129.95 ($70 off) at Amazon Best Buy , and Walmart . The powerful Bluetooth speaker carries an IP68 rating, offers up to 28 hours of playback per charge, and uses JBL’s AI Sound Boost tool to prevent distortion at higher volumes. You can also plug your phone into its USB-C port and use it as a battery pack, but JBL says it can’t be used to top off a laptop.\n\nJBL Flip 7 has returned to its all-time low of $109.95 ($40 off) at Thehas returned to its all-time low of $109.95 ($40 off) at Amazon Best Buy , and REI . The portable Bluetooth speaker features several notable upgrades over its predecessor , including a more rugged design, an enhanced tweeter, and an additional two hours of playtime. It also features JBL’s AI Sound Boost technology, which can boost the speaker’s volume without introducing distortion, as well as a PushLock system that lets you attach interchangeable accessories, such as the included wrist strap.\n\nBose SoundLink Plus is on sale for $199 ($70 off) at Theis on sale for $199 ($70 off) at Amazon Best Buy , and Bose’s online storefront , which is its best price to date. Despite being about the size of a 20-ounce water bottle, it delivers loud, impressive sound with a rugged IP67 build and USB-C charging. It supports multipoint Bluetooth connectivity and, unlike the Micro, doubles as a 15W power bank, with longer battery life that lasts up to 20 hours. Read our review\n\nBose SoundLink Micro is on sale for a new all-time low of $109 ($20 off) at The latestis on sale for a new all-time low of $109 ($20 off) at Amazon and Best Buy .The rugged Micro is the brand’s smallest Bluetooth speaker, but it still offers big sound and up to 12 hours of battery life. The second-gen model also features a USB-C charging port, an IP67 rating for full water and dust resistance, and a handy utility strap, so you can clip the speaker to your bag using a carabiner.\n\nTribit StormBox Micro 2 $ 50 $ 70 29 % off $ 50 The latest version of Tribit’s StormBox Micro is a compact Bluetooth speaker that delivers impressive sound for its size and features a built-in strap for attaching to to various objects. Read More $50 at Amazon$50 at Tribit\n\nRelated The best Sonos speakers to buy in 2025\n\nGaming deals\n\n8Bitdo’s Micro Bluetooth Gamepad is down to $14.67 ($10 off) at If you want a compact controller to pair with your Nintendo Switch, smartphone, tablet, or computer,is down to $14.67 ($10 off) at Amazon in select colors. The miniature controller is only four inches long and weighs 24.8 grams, so you may even be able to carry it around in your pocket. It has four face buttons, a directional pad, and four shoulder buttons, which makes it ideal for playing 2D games. The buttons are also remappable, so you can customize them to make playing certain games more comfortable.\n\nAmazon, G7 HE Wired Xbox Controller to $39.99 ($10 off), which is a new all-time low. The wireless controller features drift-resistant Hall effect joysticks, Hall effect magnetic triggers, and Hall effect analog triggers. You can use GameSir’s Nexus app (available on PC and the Xbox store) to remap buttons and make other adjustments to optimize it for your favorite games. Best Buy , and GameSir have all discounted theto $39.99 ($10 off), which is a new all-time low. The wireless controller features drift-resistant Hall effect joysticks, Hall effect magnetic triggers, and Hall effect analog triggers. You can use GameSir’s Nexus app (available on PC and the Xbox store) to remap buttons and make other adjustments to optimize it for your favorite games.\n\nBackbone Pro can turn any smartphone or smaller tablet with a USB-C port into a more effective handheld, and it’s fallen to a new low of $134.99 ($35 off) at Thecan turn any smartphone or smaller tablet with a USB-C port into a more effective handheld, and it’s fallen to a new low of $134.99 ($35 off) at Amazon Best Buy , and Backbone’s online store . The controller has an Xbox-like button layout, plus a pair of remappable rear buttons. It’s also compatible with games available on the App Store and Google Play Store, as well as cloud-based titles that are streamable via Xbox Game Pass. The Pro is Backbone’s first controller to support Bluetooth, too, which allows you to use it with everything from a Stream Deck to the latest smart TVs.\n\nXreal One smart glasses $ 400 $ 500 20 % off $ 400 The Xreal One aren’t the most affordable augmented-reality glasses available, but they are some of the best for displaying movies and games on the go. You can connect them via USB-C to your smartphone, tablet, or handheld gaming PC. Read More $400 at Amazon$400 at Xreal\n\nMiscellaneous deals\n\nHatch Restore 3 from If you’re having trouble falling asleep, a sunrise alarm clock can help bring calm to your bedtime routine. Thankfully, you can snag thefrom Hatch’s online storefront for an all-time low of $139.99 ($30 off) through December 1st (discount applies at checkout). The Restore 3 features more than 50 sleep sounds and 18 adjustable light colors, with access to hundreds more through the optional Hatch Plus subscription, which runs $4.99 per month or $49.99 per year.\n\nMeross Smart Wi-Fi Garage Door Opener $ 40 $ 60 33 % off $ 40 Meross makes a handy add-on that can transform a variety of garage door models into smart doors that you can open remotely. It works with Amazon Alexa, Apple Home, Google Home, and Samsung SmartThings. Read More $40 at Amazon\n\nGarmin inReach Messenger Plus has fallen to an all-time low of $349 ($150 off) at Thehas fallen to an all-time low of $349 ($150 off) at Amazon Walmart , and REI . The satellite communicator provides peace of mind when you’re beyond cell towers by connecting to the Iridium satellite network for global SOS, location sharing, and photo and voice messaging, so you can send a visual marker to a loved one. The richer context makes the Messenger Plus a nice upgrade over the Mini 2’s text-only approach, so long as you’re willing to pay the premium subscription fee.\n\nHeadspace is offering 50 percent off an annual subscription, bringing the price is offering 50 percent off an annual subscription, bringing the price down to $34.99 ($35 off) through December 4th. The discount only applies to your first year; after that, the subscription will renew at full price. Headspace offers access to guided meditations, online therapy, mental health coaching, and more. At a time when the world feels more dire than ever, Headspace can help bring some calm to your daily life.\n\nAnker’s 10,000mAh Power Bank, a solid 30W battery pack, is currently on sale for $29.99 ($15 off) at , a solid 30W battery pack, is currently on saleat Amazon and Anker’s online storefront . The power bank has nearly enough juice to top off an iPhone 15 Pro twice, and it can charge two devices simultaneously using its built-in cable and USB-C port. It’s also a power adapter that can plug directly into an outlet.\n\n15-inch Skylight Calendar is an excellent tool for organizing multiple schedules without sending people reminders, and it’s currently on sale for $239.99 ($60 off) directly from Theis an excellent tool for organizing multiple schedules without sending people reminders, and it’s currently on sale for $239.99 ($60 off) directly from Skylight . Once an event is added to the calendar, it’s automatically synced with other people’s devices, whether they use Apple’s Calendar app, Google Calendar, Outlook, or other popular services. Color coding makes it easy to see whose event it is at a glance, too, whether you’re looking at your device or the Skylight itself.\n\nTheragun Mini Plus may help you look forward to them. Fortunately, Warmups and post-workout cooldowns are easy to skip, but themay help you look forward to them. Fortunately, Amazon Best Buy , and Target have all marked the triangle-shaped massage gun down to around $237.99 ($62 off) for Black Friday. The Theragun Mini Plus can operate at three temperatures and vibration levels to help provide relief. Presets available within Theragun’s app can also help you optimize pressure and speed based on the part of your body that you’re working on.\n\nShure MV7 Plus $ 269 $ 299 10 % off $ 269 Shure’s MV7 Plus is an updated version of its popular USB microphone. The new version features a USB-C port, a customizable LED light panel, and several additional features available in the Motiv Mix app. Read More $269 at Amazon$269 at Shure\n\nSatechi’s Mac Mini M4 Hub down to a new low of $69.99 ($30 off). The USB-C hub sits below your Mac Mini without restricting airflow, and has three USB-A ports, an SD card reader, and an M.2 NVMe SSD slot. It’s an easy, tool-free way to make extra storage accessible to your Mac Mini without plugging in a portable SSD. If you want a convenient, compact way to connect older accessories to your new Mac Mini, Best Buy has discounteddown to a new low of $69.99 ($30 off). The USB-C hub sits below your Mac Mini without restricting airflow, and has three USB-A ports, an SD card reader, and an M.2 NVMe SSD slot. It’s an easy, tool-free way to make extra storage accessible to your Mac Mini without plugging in a portable SSD.\n\nNomad’s ChargeKey V2 is a six-inch USB-C cable with a loop that allows you to attach it to your keyring, and it’s available for around $21.75 ($7.25 off) from is a six-inch USB-C cable with a loop that allows you to attach it to your keyring, and it’s available for around $21.75 ($7.25 off) from Amazon (with Prime) and Nomad . The cable can carry up to 240W of power — enough to charge most laptops at their fastest speed — and data at up to 10Gbps. The accessory is a convenient way to make sure you never leave home without a charging cable.\n\nVerge Deals Sign up for Verge Deals to get deals on products we’ve tested sent to your inbox weekly. Email (required) Sign Up By submitting your email, you agree to our Terms and Privacy Notice . This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.\n\nUpdate, November 20th: Adjusted pricing / availability and added several new deals, including those for the AirPods Pro 3, Google’s Pixel Watch 4, and the latest Kindle Paperwhite. Sheena Vasani and Brandt Ranj also contributed to this post.",
  "authors": [
    "Brandon Russell",
    "Sheena Vasani",
    "Brandon Russell Sheena Vasani"
  ],
  "url": "https://www.theverge.com/tech/814345/black-friday-best-early-deals-2025"
}