{
  "title": "La economía de EE.UU. sumó 119.000 empleos en septiembre, pero el desempleo alcanzó su nivel más alto en casi cuatro años",
  "text": "CNN —\n\nEl esperado informe de empleo ofreció una visión mixta del mercado laboral estadounidense.\n\nLa economía sumó 119.000 empleos en septiembre, lo que representa un repunte inesperado en un contexto de desaceleración general de la economía.\n\nLos economistas esperaban la creación de 50.000 empleos y una tasa de desempleo estable en 4,3 %, según FactSet.\n\nRetrasada siete semanas por el cierre del Gobierno, la más reciente fotografía del mercado laboral estadounidense mostró, sin embargo, que el desempleo aumentó en septiembre al nivel más alto en casi cuatro años.\n\nAdemás, las tibias ganancias de agosto —22.000 empleos— fueron revisadas a una pérdida de 4.000 puestos, y julio fue revisado a la baja en 7.000 empleos, según datos de la Oficina de Estadísticas Laborales publicados el jueves.\n\nEl sector de salud y asistencia social siguió impulsando el crecimiento general del empleo. Estos sectores añadieron unos 57.100 puestos en septiembre, lo que representa casi la mitad del total. Ocio y hospitalidad aportaron 47.000 empleos en un mes con un clima inusualmente cálido.\n\nSe perdieron empleos en sectores como transporte y almacenamiento (-25.300), servicios temporales (-15.900) y manufactura (-6.000).\n\nAunque los datos de septiembre llevaban archivados desde principios de octubre, ofrecen una fotografía crítica del mercado laboral en un momento en que los aranceles, la inflación persistente y las altas tasas de interés siguen desacelerando la economía estadounidense.\n\nVerano de pérdidas de empleo\n\nAdemás, el informe del jueves podría ser el último informe de empleo “limpio” durante un par de meses, ya que el cierre del Gobierno alteró el delicado proceso de recopilación y análisis de datos durante octubre y parte de noviembre. El miércoles, la BLS anunció que no habrá un informe separado de empleo de octubre, sino que parte de esos datos se incluirán en el informe de noviembre previsto para el 16 de diciembre.\n\nA pesar de las ganancias de septiembre, más fuertes de lo esperado —impulsadas en parte por el clima cálido, que favoreció el empleo en ocio y hospitalidad—, este año sigue encaminado a ser el de menor crecimiento del empleo desde la pandemia y, antes de eso, desde la Gran Recesión.\n\n“El mercado laboral estuvo realmente débil en el verano y no mejoró mucho en septiembre”, dijo Heather Long, economista jefe de Navy Credit Union. “Lo que aprendimos hoy es que tanto junio como agosto tuvieron crecimiento negativo de empleo; 119.000 es bastante bueno para septiembre, pero si lo miras en conjunto, el promedio de los últimos cuatro meses está en los 40.000 bajos”.\n\n“Así que se ve muy débil”, añadió.\n\nEl desempleo, un indicador clave de recesión, subió en septiembre hasta la tasa más alta desde octubre de 2021.\n\nSin embargo, lo que impulsó el alza del desempleo fue el aumento de la fuerza laboral —principalmente más personas buscando empleo, y no un salto abrupto en los despidos—, según datos de la BLS.\n\nMercado de baja contratación, pocos despidos y oportunidades escasas\n\nLas ganancias de empleo siguen altamente concentradas. Dos sectores —salud y asistencia social, y ocio y hospitalidad— representaron el 87 % del crecimiento del empleo en septiembre.\n\nPero en un mercado laboral caracterizado por baja contratación y pocos despidos, también hay pocas oportunidades para quienes buscan trabajo. En promedio, encontrar empleo está tardando unos seis meses, según los datos más recientes de la BLS.\n\nEl informe más reciente de solicitudes de desempleo confirma esa tendencia: en un informe separado, el Departamento de Trabajo reportó que unas 1,974 millones de personas presentaron solicitudes continuas de subsidio de desempleo en la semana que terminó el 8 de noviembre, alcanzando un nuevo máximo de cuatro años.\n\nLas solicitudes iniciales, consideradas el mejor indicador de despidos, cayeron a 220.000 la semana pasada, manteniéndose muy por debajo de niveles preocupantes (entre 300.000 y 400.000 de forma sostenida).\n\n“Si tuviera que caracterizarlo, sigue pareciendo un mercado de ‘no contratar, no despedir’”, dijo Long. “Me preocupa que, dado el número de industrias que están empezando a despedir, esto empiece a parecer ‘no contratar, empezar a despedir’”.\n\n“Agua fría” para un recorte de tasas de la Fed\n\nA pesar de la mezcla de datos, el informe de septiembre “podría echar agua fría” a la posibilidad de que la Reserva Federal recorte más las tasas en su reunión de diciembre, escribió en una nota Kathy Bostjancic, economista jefe de Nationwide.\n\n“El fuerte repunte de las ganancias de empleo —119.000 en septiembre tras la revisión a una caída de 4.000 en agosto— alivia la preocupación de que el mercado laboral estuviera al borde de una fuerte caída y elimina la urgencia de otro recorte de tasas”, escribió.\n\nAun así, debido al histórico cierre del Gobierno, el informe de septiembre será el panorama mensual más reciente del mercado laboral disponible cuando la Fed tome su decisión sobre tasas el 10 de diciembre. Los datos parciales de octubre y completos de noviembre no se publicarán hasta la semana siguiente.",
  "authors": [
    "Alicia Wallace"
  ],
  "url": "https://cnnespanol.cnn.com/2025/11/20/eeuu/empleo-ee-uu-119-000-puestos-de-trabajo-septiembre-trax"
}