{
  "title": "Come stanno andando i negoziati sul clima alla Cop30 di Belém (spoiler: l’Italia sta complicando le cose)",
  "text": "Belém, Brasile – A meno di due giorni dalla fine della Cop30, la conferenza sul clima, la situazione – come spesso accade quando ci si avvicina alla fine – si è trasformata in una sorta di braccio di ferro con delegati che corrono da una sala e all’altra, ipotesi di accordo che cambiano di ora in ora, telefonate notturne, e l’impressione che tutto possa velocemente assumere le sembianze di un disastro o dell’ennesima dose di speranza.\n\nQuando si completerà la transizione? Questo è il dilemma\n\nQuesta volta, sul tavolo dei negoziati, c’è una proposta molto semplice da parte della presidenza brasiliana incarnata dal diplomatico di professione André Corrêa do Lago: riprendere e “implementare”, cioè trasformare in azione, quanto già deciso nelle conferenze precedenti. Il riferimento esplicito è a Dubai (Cop28) quando la comunità internazionale inventò l’espressione transitioning away from fossil fuels.\n\nPer rendere concreta questa espressione che racchiude il concetto più importante di questi trent’anni di conferenza, la presidenza brasiliana vuol mettere nero su bianco una roadmap che contenga tempi certi per abbandonare carbone, petrolio e gas; i modi per aderire a questo percorso, invece, resterebbero nelle mani dei governi. Niente di vago, dunque, né di vincolante. Solo la voglia, oltre il bisogno, di darsi delle tappe monitorabili, con date e responsabilità. E perché no, anche di verifiche.\n\nLula è ovunque\n\nPer rafforzare questo messaggio che è sembrato dapprima risuonare e poi stonare, il presidente Lula è tornato fisicamente a Belém, tra i tavoli negoziali, tentando per tutta la giornata di trovare un terreno comune tra blocchi lontani anni luce. In molti lo descrivono come un presidente in modalità “operaia” – sorriso sornione quando serve, grande pressione a porte chiuse.\n\nLa roadmap proposta dal Brasile ha diviso i paesi in modo netto: oltre 80 governi la sostengono, considerandola una linea rossa invalicabile. Dall’altra parte della barricata, i soliti noti guidati dall’Arabia Saudita che respingono qualsiasi riferimento a date e impegni strutturali.\n\nIndovina chi c’è insieme alla Polonia\n\nE nel mezzo? Gli indecisi scarseggiano. Lo ha confermato lo stesso presidente della Cop30, André Corrêa do Lago al quotidiano britannico Guardian: “Non ci sono molti paesi indifferenti”. O si fa la storia, o si muore. A spaventare, in questi casi di stallo alla messicana, come sempre, è il meccanismo con cui si approverà l’accordo, ovvero per consensus: nessuno si deve opporre formalmente, basta un unico piccolo grande “no” per far saltare il banco.\n\nL’Europa, in tutto ciò, si muove compatta, ma chiede flessibilità per paura che l’intero processo si blocchi. Ci stavamo per dimenticare una cosa: ci sono solo due stati europei che non supportano questo piano per la transizione dai combustibili fossili. A far compagnia alla Polonia, c’è l’Italia.",
  "authors": [
    "Tommaso Perrone"
  ],
  "url": "https://www.wired.it/article/come-stanno-andando-i-negoziati-sul-clima-alla-cop30-di-belem/"
}