{
  "title": "As infant botulism cases climb to 31, recalled ByHeart baby formula is still on some store shelves",
  "text": "As cases of potentially deadly botulism in babies who drank ByHeart infant formula continue to grow, state officials say they are still finding the recalled product on some store shelves.\n\nMeanwhile the company reported late Wednesday that laboratory tests confirmed that some samples of formula were contaminated with the type of bacteria that has sickened more than 30 babies in the outbreak.\n\nTests by an independent food safety laboratory found Clostridium botulinum, a bacterium that produces toxins that can lead to potentially life threatening illness in babies younger than 1, the company said on its website. ByHeart officials said they notified the U.S. Food and Drug Administration of the findings but did not specify how many samples were tested or how many were positive.\n\n“We are working to investigate the facts, conduct ongoing testing to identify the source, and ensure this does not happen to families again,” ByHeart said on its website.\n\nThe FDA did not immediately respond to questions about the findings.\n\nThe lab results come as investigators in at least three states found ByHeart formula still for sale even after the New York-based company recalled all products nationwide, officials told The Associated Press.\n\nAt least 31 babies in 15 states who drank ByHeart formula have been hospitalized and treated for infantile botulism since August, federal health officials said Wednesday. They range in age from about 2 weeks to about 6 months, with the most recent case reported on Nov. 13.\n\nNo deaths have been reported.\n\nIn Oregon, nine of more than 150 stores checked still had the formula on shelves this week, a state agriculture official said. In Minnesota, investigators conducted 119 checks between Nov. 13 and Nov. 17 and removed recalled products from sale at four sites, an agriculture department official said. An Arizona health official also said they found the product available.\n\nBusinesses and consumers should remain alert, Minnesota officials said in a statement. “No affected product should be sold or consumed,” they wrote.\n\nInvestigators with the U.S. Food and Drug Administration conducted inspections at ByHeart manufacturing plants in Allerton, Iowa, and Portland, Oregon. No results from the inspections have been reported.\n\nCalifornia officials previously confirmed the germ that can lead to illness in an open can of ByHeart formula fed to a baby who fell ill.\n\nInfant botulism, which can cause paralysis and death, is caused by a type of bacteria that forms spores that germinate in a baby’s gut and produce a toxin.\n\nSymptoms can take up to 30 days to develop and include constipation, poor feeding, a weak cry, drooping eyelids or a flat facial expression. Babies can develop weakness in their limbs and head and may feel “floppy.” They can have trouble swallowing or breathing.\n\nByHeart had been manufacturing about 200,000 cans of formula per month. It was sold online or at retail stores such as Target and Walmart. A Walmart spokesperson said the company swiftly issued a restriction that prevented sale of the formula, removed the product from stores and notified consumers who had bought it. Customers can visit any store for a refund of the formula, which sold for about $42 per can.\n\nFederal and state health officials are concerned that some parents and caregivers may still have ByHeart products in their homes. They are advising consumers to stop using the product — including formula in cans and any singe-serve sticks. They also suggest marking it “DO NOT USE” and keeping it for at least a month in case a baby develops symptoms. In that case, the formula would need to be tested.\n\nThe California health department operates the Infant Botulism Treatment and Prevention Program, which tracks cases and distributes treatment for the disease. Officials there have launched a public hotline at 833-398-2022, which is staffed with health officials from 7 a.m. to 11 p.m. Pacific Standard Time.\n\nThe new hotline was created after calls from hundreds of parents and caregivers flooded a different, longstanding hotline for doctors to discuss suspected infant botulism cases, officials said.",
  "authors": [
    "Associated Press"
  ],
  "url": "https://www.cnn.com/2025/11/19/health/byheart-formula-recall-botulism-grows"
}