{
  "title": "Political Scientist Answers China Questions",
  "text": "Transcript\n\nIf Russian bots exist, do Chinese bots also exist?\n\nI think first of all, you should look down at the comments\n\nin this video and you'll probably get a taste\n\nof whether there are any Chinese bots.\n\nI'm Michael Beckley. I study modern China.\n\nLet's answer your questions from the internet.\n\nThis is China Support.\n\n[upbeat music]\n\nS-Sheepherder wants to know,\n\nWhat do westerners get wrong about China?\n\nWell, China's really big.\n\nThere's 19 countries around China,\n\nand so that big military\n\nthat China has is spread quite thin\n\nhaving to defend all of China's borders.\n\nOr the big economy, you have to feed one\n\nof the largest populations on the planet.\n\nYou have to maintain control over those people.\n\nThat all drains resources from the country\n\nand means just that it's much more complicated\n\nto analyze China.\n\nYou have both a lot of assets,\n\nbut also a lot of liabilities.\n\n@snoowlions wants to know, When did modern China start?\n\nLet's answer that with a timeline.\n\nLet's start in 1911 with the collapse of the Qing dynasty\n\nthat ends thousands of years off and on of imperial rule.\n\nChina then collapses into the warlord era,\n\nwhich is every bit as bad as it sounds.\n\nThen the Japanese in the 1930s\n\nreally step up their aggression in China,\n\nconquering big parts of it,\n\nand basically starting World War II in East Asia.\n\nThe Japanese are defeated in 1945,\n\nbut at that point, the Chinese Civil War comes roaring back\n\nbetween the Communists and the Nationalists.\n\nThe Communists win that Civil War in 1949.\n\nThey found the People's Republic of China under Mao Zedong.\n\nChina initially sides with the Soviet Union in the Cold War,\n\nbut about halfway through,\n\nthey realize that the Soviets are actually their main enemy.\n\nThat paves the way for in the US President Richard Nixon\n\nto go to Beijing.\n\nAnd at that point, China and the United States\n\nbasically become allies in the rest of the Cold War.\n\nThe Soviet Union collapses in 1991\n\nand that sets the stage for the US and China\n\nto become major trading and investment partners.\n\nThat culminates in 2001\n\nwith China's entry into the World Trade Organization.\n\nBut especially after the 2008 financial crisis,\n\nyou start to see the United States\n\nand China looking at each other more like rivals\n\nfeeling like their economies are under strain\n\nand that the trade relationship\n\nis not working out as well as they had hoped.\n\nAnd that really paves the way\n\nfor the era that we're currently in,\n\nwhich is one of tremendous hostility\n\nbetween the United States and China.\n\nhecubiss asks, Why would China even want to invade Taiwan?\n\nSo first of all, Taiwan is the seat\n\nof a rival Chinese government that is democratic,\n\nessentially tied security wise to the United States.\n\nAnd so if you're the Chinese Communist Party\n\nand you insist that this is all your territory,\n\nyou can't have this renegade regime\n\ngoing in a different direction.\n\nTaiwan is where the nationalists fled to\n\nwhen they lost the Chinese Civil War.\n\nSo they want to finish that job.\n\nIt's smack-dab at the epicenter of the East China Sea\n\nand the South China Sea\n\nwhere about half of world trade flows through.\n\nSo this is probably, pound for pound,\n\nthe most strategic important waterway on the planet.\n\nAnd Taiwan itself is, you can see,\n\nthe center cork of what the Chinese call\n\nthe first island chain in East Asia\n\nthat runs from Korea and the Japanese islands\n\ndown through the Philippines.\n\nThese are all American allies.\n\nThey host American troops.\n\nChina has no California, it has no west coast.\n\nIts only coast is completely hemmed in by rival powers\n\nthat are allied with the United States.\n\nSmashing Taiwan and taking it over\n\nwould give China an unsinkable aircraft carrier\n\nin the most important waterways,\n\nand blast a hole, not just geographically,\n\nin the US alliance system in East Asia,\n\nbut really in the credibility of US alliances\n\n'cause no one would trust the United States\n\nif the US just let Taiwan go down.\n\nEvery single Chinese leader has said,\n\nIt's only a question of time.\n\nWe're gonna take Taiwan one of these days.\n\nXi Jinping has said that it's a situation\n\nthat cannot be passed down generation to generation,\n\nwhich some analysts worry means\n\nhe intends to do this on his watch.\n\nBW asks, Is there something America can learn from China?\n\nIs there something that they're doing right?\n\nChina is really good\n\nat mobilizing resources for national missions.\n\nFor example, China has installed more solar and wind power\n\nthan any other country.\n\nChina is the world's largest trade power in the world\n\nand has forged trade relationships\n\nwith the majority of the world's countries.\n\nAnd China has built infrastructure faster\n\nand on greater scale than any country in human history,\n\nthen just the miraculous development\n\nof bringing hundreds of millions of people\n\nfrom living on less than $2 a day\n\nto average disposable incomes of 5,000 to $10,000 a year.\n\nThat is a tremendous, almost miraculous undertaking\n\nthat China has been able to pull off.\n\nAnd I think that only comes\n\nfrom having a sense of national unity\n\nand a willingness to pool resources for national purposes.\n\nThe United States,\n\nit's a dynamic, open, decentralized system,\n\nbut the downside is it also generally does not mobilize\n\nits resources on a national scale and unify\n\nunless it's really confronted with a crisis\n\nlike a global war or a depression.\n\nSo there are areas of the United States\n\nthat are neglected in terms of infrastructure.\n\nThere are neighborhoods that could be built up.\n\nThere are education systems that are failing.\n\nAnd so that type of rallying resources and coming together\n\nis something that the US I think could look to to China.\n\nBut obviously you don't want to go too far\n\nbecause part of what allows China to do that\n\nis just a lack of civil and political rights\n\nfor the Chinese people.\n\n@greatshistorian asks, Who is winning\n\nthe current trade war between America and China?\n\nChina is very much an investment and export-driven economy.\n\nThis trade war is really bad\n\nfor a lot of those major export industries.\n\nThere's been lots of closures, especially in eastern China.\n\nThere's been mass layoffs even just in the short time\n\nthat this trade war has been going on.\n\nNow on the American side, the consumer market\n\nis roughly three times the size of China's.\n\nSo consumers are the ones\n\nwho are being hurt by this trade war\n\nbecause they're gonna have to pay higher prices for goods\n\nthat were manufactured in China.\n\nXi Jinping cares a lot less about GDP growth.\n\nHe cares about power\n\nand about developing self-reliant, strong industries.\n\nAnd if this trade war enables China to decouple\n\nand reduce its dependence on the West,\n\nI think he counts that as a win,\n\neven if it crimps economic growth in the short term.\n\nAnd for the United States under the Trump administration,\n\nthey similarly want to decouple from China\n\nbecause they view it as a national security threat.\n\nI see these two countries as having a distinct interest\n\nin trying to get away from each other economically.\n\nThese dependencies, they both seem\n\nto want to push those away.\n\nChaseTheTaco.\n\nSerious question. Is China truly a Communist country?\n\nI know it seems crazy\n\nif you look at the Shanghai skyline,\n\nyou fly in through the Beijing airport.\n\nThat is the gilded veneer\n\non the outside that's been built up.\n\nBut if you look at the super-structure of the economy,\n\nwhat's actually the driving force behind it?\n\nIt's a very strong state presence.\n\nAll of the land in the country\n\nis owned by the Chinese Communist Party.\n\nThe energy industry, the banking sector is state-owned,\n\n90%+ of the financial assets flowing around the country,\n\nso these are all what Lenin called\n\nthe commanding heights of the economy.\n\nAnd it can produce incredible output.\n\nIt can produce shiny high-speed rail,\n\nit can produce gleaming skyscrapers.\n\nBut this is sort of like a new modern form\n\nof a communist system\n\nwhere you still have the party running the show economically\n\ninsisting on a one-party state\n\nand a dictator ruling over it all.\n\nTake Jack Ma, the former head of Alibaba,\n\nhas a major company in China,\n\nand he gave a speech a few years back criticizing the way\n\nthat the government was running the economy.\n\nHe had his wings totally clipped.\n\nHe was sent out to Tokyo,\n\nhe had his empire completely dismantled\n\nand now has basically had to come crawling back.\n\nYou've had many other billionaires simply just disappear.\n\nAnd so at the end of the day,\n\neven the high-flying titans of China's economy know\n\nthat their livelihoods depend very much\n\non their relationship with the Chinese Communist Party,\n\nwhich is why you see many of the top titans of industry\n\nin China in the National People's Hall\n\nduring these major conclaves sitting next to Xi Jinping\n\nbecause they're effectively part\n\nof the same-party system that he operates.\n\nDizzyMajor5 wants to know,\n\nWhat do the Chinese people think of Mao Zedong?\n\nIs he considered good or bad?\n\nThe standard answer taught in Chinese schools\n\nis that he was 70% right, but 30% wrong.\n\nHere's Mao as a young revolutionary.\n\nHe was a journalist for a long time.\n\nHe actually wrote a whole pamphlet in 1940\n\nabout democracy and freedom in China.\n\nOf course, once he becomes Chairman Mao,\n\na lot of that stuff goes away.\n\nThe 70% right was he unified the country\n\nwhich had been ripped apart by decades of civil war.\n\nHe instituted a mass education campaign\n\n'cause he wanted to lift China up.\n\nSo that led to widespread literacy.\n\nHe wanted women to be active participants\n\nin the labor force.\n\nNow, in terms of the bad, his so-called Great Leap Forward,\n\nwhich was this scheme\n\nto turn China into a superpower in just a few years,\n\ntook millions of peasants off of their farms,\n\nput them in communes,\n\nhad them melt down their pots and pans.\n\nAs a result, the food supply ran out\n\nand 45 million people starved to death\n\nor were beaten or shot along the way.\n\nAnd then in order to insulate and protect himself,\n\nhe then launched the Cultural Revolution\n\nwhere he basically turned\n\nthe Chinese people on the Communist Party\n\nto purge many of his rivals.\n\nThat probably killed another million to 2 million people.\n\nSo ruthless, brutal, but effective\n\nin terms of bringing China together,\n\nwhich for much of Chinese history has not been the case.\n\n@SuperCoach137 asks, How did the one-child policy\n\nwork out for China?\n\nIt resulted in several hundred million abortions\n\nwhen people, starting in the late 1970s,\n\nweren't allowed to have more than one child.\n\nYou'd be subject to massive fines,\n\nequivalent in some cases to a year or more of your income\n\nif you had a second child.\n\nIn the '50s and '60s, China had a massive baby boom\n\nbecause Mao Zedong wanted to turn China into a superpower.\n\nSo he encouraged Chinese families to have lots of children.\n\nSo then when China did a 180\n\nand implemented the one-child policy in the late 1970s,\n\nyou had this baby boom generation\n\ncoming into the prime of their working lives\n\nand they had relatively few children to take care of\n\n'cause they weren't allowed to have them\n\nand they had relatively few elderly parents to care for\n\nbecause so many of them end up dying\n\nin the famines and the Cultural Revolution.\n\nSo in the '90s and 2000s,\n\nyou had anywhere between 10 to 15 working-age adults\n\navailable to support every elderly retiree\n\nin China's population.\n\nThat's two to three times the global average.\n\nIt's five times what the United States currently has.\n\nAnd so as a result, China's population\n\nwas primed for economic productivity\n\nand demographers think that alone explains\n\nabout 25% of China's rapid economic growth\n\nover the last 30 to 40 years.\n\nThe problem for China is now the situation is flipping\n\nwhere that huge baby boom generation\n\nare retiring and falling onto the backs\n\nof this tiny one-child generation.\n\nThat 10:15 ratio is gonna collapse to 2:1.\n\nIn the 2030s, China's gonna lose somewhere\n\nlike 70 million working-age adults in the next 10 years\n\nand gain 130 million senior citizens.\n\nThat's gonna be catastrophic for China's fiscal balance,\n\nfor its economic productivity.\n\n@RightSideofMB says, Siri, what are Chinese ghost cities?\n\nGhost cities refer to entire apartment complexes, airports,\n\nshopping malls that are either mostly or entirely empty.\n\nAnd it's a result of China's economic model,\n\nwhich is very much about collecting the resources\n\nof the Chinese people under the state\n\nand then plowing them into certain industries,\n\nincluding into the real estate sector.\n\nIt works really well for an authoritarian government\n\n'cause it's easy to pay off cronies who own the companies\n\nthat are doing all of the building.\n\nThe problem is it runs amuck.\n\nThese companies, they're getting paid\n\nwhether the apartments are occupied or not.\n\nSo they build a bunch of stuff\n\nbut then people aren't moving into them\n\nand now that China's population is declining,\n\nthere is going to be ever-lowering demand\n\nfor a lot of this base infrastructure.\n\nMehmetTopal wants to know,\n\nHow much power does Xi Jinping hold personally?\n\nIs he an absolutist like Louis XIV or like Stalin?\n\nI'm gonna reserve a certain category\n\nfor divine-right monarchs like Louis XIV\n\nand distinguish that from Xi Jinping.\n\nSo Xi Jinping is probably\n\nthe most powerful leader since Mao Zedong.\n\nHe's made himself president of everything for life,\n\nbut at the end of the day, he's one guy.\n\nAnd so his ability to pay attention\n\nto everything that's going on in his vast sprawling country\n\nis inherently limited.\n\nSo the real estate crisis that's going on,\n\nhe's demanded that people be more frugal\n\nand not speculate on real estate,\n\nbut the market is kind of doing what it's going to do.\n\nAnd as a result, you still have that ongoing crisis.\n\nZero COVID.\n\nYou know, he locked down Chinese people\n\nin their apartments for months on end.\n\nAt a certain point the Chinese people had it\n\nand you saw protests emerging\n\nthat seemed to have encouraged Xi\n\nto back down and undo that policy.\n\nAnd he also has to worry about rivals in the party,\n\nwhich is why he's embarked on\n\nthis massive anti-corruption campaign, purging more than\n\na million senior CCP officials along the way.\n\nWe do know a bit about his backstory.\n\nHis father was a high-ranking official\n\nserving under Mao Zedong, but he was purged,\n\nand in fact, Xi himself and his family were purged\n\nduring the Cultural Revolution.\n\nXi was sent out to the countryside\n\nto basically dig a bunch of holes.\n\nHis father was humiliated,\n\nXi himself was denounced by his own mother,\n\nand his half sister died during the Cultural Revolution.\n\nIt's all speculation, but people think this may have had\n\na big effect on him and that's what he thinks of\n\nwhen he thinks of rule by the people,\n\nwhich may explain partially why he seems so committed\n\nto centralizing all power under himself\n\nand basically installing himself\n\nto the point that he's literally written himself\n\ninto the constitution\n\nand obligates other people in China\n\nto read what he calls Xi Jinping Thought,\n\nwhich is his own sort of philosophy\n\nabout how to guide the country.\n\n@nic_moneypenny wants to know,\n\nWhat was China's ultimate role in the COVID-19 pandemic?\n\nWe don't know for sure\n\nbecause China, the government,\n\nhas gone to extraordinary lengths\n\nto cover up how COVID emerged\n\nand details about the virus.\n\nWe know that in late 2019, they basically got rid\n\nof a lot of their virus samples\n\nthat were related to coronaviruses.\n\nThey floated conspiracy theories\n\nthat a virus actually came to China from frozen food\n\nthat was imported from outside of the country\n\nand they didn't really allow international inspectors\n\nuntil very late.\n\nAnd even then, when the WHO came\n\nto try to figure out where the virus came from,\n\nit was a highly scripted,\n\nalmost sort of like North Korean tour around the facilities.\n\nAnd as a result, we just don't know where it came from.\n\nThe two major theories are that it either emerged\n\nfrom this wet market in Wuhan\n\nbecause of the animals\n\nthat were being eaten and slaughtered there.\n\nThe other major theory is that it emerged\n\nfrom the Wuhan Institute of Virology,\n\nwhich is China's premier place for studying coronaviruses.\n\nAnd we know the virus itself has certain features\n\nthat you really only see\n\nif it's been modified in a lab rather than naturally.\n\nThe bottom line is, we don't know,\n\nbut there's a lot of circumstantial evidence\n\nthat it was done in this lab,\n\nwhich is a center of not just Chinese research,\n\nbut of a multinational research attempt\n\nto analyze coronaviruses.\n\n@JerryDunleavy asks, Whatever happened to Tank Man?\n\nAnd how many people did the Chinese Communist Party murder\n\nat Tiananmen Square?\n\nSo what Jerry is referring to is that famous image\n\nof a man standing in front of several tanks\n\nthat are rolling into Tiananmen Square\n\nto run over demonstrators, mainly students,\n\nthat were protesting there in 1989.\n\nWe have no idea what happened to Tank Man,\n\nhe has never been heard of since.\n\nIt wasn't just a crackdown in Beijing and Tiananmen Square,\n\nthere were massive protests\n\nin basically every provincial capital around China.\n\nMore than 80 cities had mass demonstrations\n\nthat were then forcibly put down.\n\nAccording to the party,\n\nroughly 200 to 300 people were killed.\n\nBut most Western estimates suggest\n\nit was 10 times that amount.\n\nThe way that the Tiananmen Square protests\n\nare often portrayed is as a pro-democracy demonstration\n\nby the Chinese people.\n\nAnd certainly there were elements of that.\n\nA lot of the students in Tiananmen Square\n\nwere calling for more democratic governance.\n\nThey built a giant replica of the Statue of Liberty\n\nin the middle of Tiananmen Square.\n\nBut really the crisis starts\n\nand the reason why\n\nit spreads across the country was economic.\n\nThere was massive inflation.\n\nThis led to massive demonstrations.\n\nA lot of people weren't being paid\n\nfor jobs that they were employed to do by the state.\n\nAnd also keep in mind that communist regimes\n\nwere starting to crumble, especially across Eastern Europe.\n\nSo the tail end of the Cold War\n\nand this belief that the legitimacy,\n\nthe functioning of a communist system is under question\n\nand led to mass demonstrations\n\nand even a split among the elites\n\nin the Chinese Communist Party.\n\nSince then, now the Communist Party is very much,\n\nWe have to stay together.\n\nWe either stay together or we hang separately.\n\nI think that informs a lot of the emphasis\n\non repression put on in China today.\n\nMiltonMerloXD wants to know,\n\nHow does censorship work in China?\n\nSo there's an actual Propaganda Department,\n\nthat's what it's called in China.\n\nThey set guidelines about what is allowed to be said\n\nand what is not allowed to be said.\n\nIt's all pretty predictable.\n\nYou know, criticizing the Chinese Communist Party,\n\npromoting democracy, Western liberal methods\n\nare all kind of looked down upon and and squelched.\n\nWhat the regime then does\n\nis they have this vast great firewall\n\nto control the internet\n\nwhere they use a combination of artificial intelligence\n\nand then hundreds of thousands of people\n\nthat are actually working to monitor China's internet,\n\nwhich is partially sealed off.\n\nWhat the censors really go after\n\nis not so much people going off\n\nand mouthing criticism about the leader,\n\nbut much more about trying to organize politically,\n\nwhether it's a house church, or student group\n\nor anything where you get people together who can then talk\n\nand then rally and potentially grow their numbers,\n\nthat looks too much like the start\n\nof an alternative political party.\n\nAnd the Chinese Communist Party says, No.\n\nWe have a monopoly on power.\n\nWe're the only political party\n\nthat's allowed to be had in this system.\n\nAnd that seems to be what the censorship regime\n\nis primarily dedicated to squelching out.\n\n@mbateman says, Wait, China's domestic surveillance system\n\nis actually called Skynet?\n\nI know, it's kind of on the nose.\n\nIt is called Skynet.\n\nThe idea is that there's hundreds of millions\n\nof surveillance cameras\n\nthat have been set up around the country\n\nas if it's a net coming from the sky.\n\nChina has pioneered methods to take all of the images\n\nthat are being absorbed by these cameras\n\nand then use artificial intelligence\n\nand speech and facial recognition technology,\n\neven gait recognition,\n\nso how you walk can be identified.\n\nAnd at this point they're starting\n\nto export elements of this system to more than 80 countries.\n\nCuba, Pakistan, Cambodia\n\nhave all imported aspects of this system.\n\nAnd so some scholars think this is the emergence\n\nof a new type of authoritarian system\n\nthat seems to have a lot of advantages\n\nin terms of population control.\n\n@Spencemo_c asks, How does China's\n\nsocial credit system work?\n\nSo in addition to video cameras\n\nand speech and facial recognition technology,\n\nthe Communist Party has access to your financial statements,\n\nto your police record, your education,\n\nany kind of disciplinary action.\n\nAnd so what they've done is basically created\n\na dossier on every single citizen.\n\nAnd so what they can then do\n\nis instantly punish Chinese citizens\n\nby saying, Oh you, you jaywalked.\n\nThat's a point.\n\nAnd so now you're gonna have to pay more if you want a loan\n\nor you may not be able to travel as freely\n\nor it may take longer to get your passport\n\nwhen you go to a government office.\n\nThere essentially is like a score\n\nand sometimes they'll actually post names\n\nof people who have been blacklisted\n\nbecause they've committed certain crimes\n\nor they've been infraction of certain regulations\n\nencouraging people to report on each other.\n\nItsAllOver_Again wants to know,\n\nWhy is China so God-like in the world of manufacturing?\n\nWell, it's so God-like,\n\nbecause it's designed to be God-like.\n\nYou have an authoritarian system\n\nthat essentially obligates the Chinese people\n\nto put their life savings in a state-owned bank.\n\nThat means the government has tons of money,\n\na war chest that they can then deploy\n\nat what they call strategic industries.\n\nSo they've spent hundreds of billions of dollars\n\nevery single year for more than a decade.\n\nThat's 10 times what other rich countries\n\nin the OECD or the United States spend\n\nas a share of their GDPs.\n\nSo in for example, the electric vehicle sector,\n\nChina has spent about $230 billion.\n\nSemiconductors, biotechnology,\n\nall of these key strategic industries.\n\nAnd at the same time, many foreign companies\n\nhave sent over lots of investment and training.\n\nSo Apple, for example,\n\nhas spent about $275 billion in investment in China.\n\nThat's more than the Marshall Plan\n\nthat the United States used\n\nto help Europe recover from World War II.\n\nApple also trained millions of Chinese workers, 28 million,\n\nwhich is more than the labor force of California.\n\nAnd also a lot of this is determined by their geography.\n\nChina has a long coastline right in the heart of East Asia,\n\nwhich is the most economically dynamic region in the world.\n\nSo many of the world's supply chains\n\nflow through these waters.\n\nIn the 1970s and early 1980s, you had China setting up\n\nwhat they called Special Economic Zones,\n\nespecially in the Southeast and places like Shenzhen\n\nas well as in Fujian province.\n\nIn some industries,\n\nwhether it's electric vehicles or in rare earths,\n\nChina currently produces anywhere between 60 to 90%\n\nof the global market.\n\nAnd now China has ports lining up and down its coastline\n\nthat serve as export platforms essentially\n\nfor the rest of the world.\n\nIn addition, China has extremely low labor costs\n\nbecause several hundred million people\n\nfrom the poor provinces in the west,\n\nthey move to the richer east coast provinces\n\nto work in factories for very low wages.\n\nBut that provides essentially a bottomless source\n\nof cheap-but-effective labor\n\nfor China's manufacturing juggernaut.\n\nRoxi USA asks, What percentage of pharmaceuticals\n\ndoes the US import in from China?\n\nIn terms of antibiotics, basic antibiotics,\n\nit's upwards of 90% that include\n\nat least some ingredients that are made in China.\n\nAnd so this has become another national security threat\n\nwhere the United States worries\n\nthat China could potentially cut the United States off\n\nfrom basic pharmaceuticals\n\nif there's some kind of crisis over Taiwan.\n\nWhether China would actually do that remains to be seen.\n\n@toxiccowboy1 asks, Are we headed to war with China?\n\nIt's not completely out of the question.\n\nIn addition to the conflict over Taiwan,\n\nthere's also the risk of a war around the Philippines.\n\nThat conflict really stems\n\nover who controls the South China Sea\n\nwhere a lot of trade passes through\n\nwhere most of China's oil imports pass through.\n\nUnder international law,\n\nthe Philippines gets 12 miles out from their coastline\n\nthat is their territory,\n\nand then another 200 miles out from their coastline\n\nthat is their exclusive economic zone.\n\nChina says, No.\n\nThat is all, that's just all Chinese territory.\n\nAnd they've been building artificial islands there.\n\nThey've been turning them into military bases\n\nand they formed what they call a maritime militia.\n\nSo thousands of fishing boats, coast guard vessels\n\nand naval ships that are basically shoving other countries\n\nout of their exclusive economic zone\n\nand confining them\n\nto narrow bands along their own coastlines.\n\nThe Philippines took China to court in 2016,\n\nthe World Court, which ruled that China's historical claims\n\nto the South China Sea are null and void.\n\nAnd in recent years China's really been turning\n\nthe screw on the Philippines,\n\none, I think to invalidate that ruling\n\nand shatter its credibility,\n\nbut second, 'cause the Philippines\n\nhas started opening up new military bases\n\nfor the United States\n\n'cause they say, We need some protection from China\n\nso that we can have access to our territorial waters\n\nin our exclusive economic zone.\n\nThe Chinese have a saying,\n\nYou should kill a chicken to scare the monkeys.\n\nMeaning you should make a bloody example\n\nout of a relatively weak adversary\n\nto send a message to the more powerful ones.\n\nThe Philippines have very little\n\noffensive air or naval capability.\n\nSo you just have to worry that Chinese would look at them\n\nas a very juicy target; weak but symbolically important.\n\n@adamncheck asks, Is TikTok just a China app\n\nto make Americans do dumb stuff to get likes and views\n\nand keep us distracted while they take over?\n\nThe Chinese version of TikTok,\n\nyou're only allowed to use it for 15 minutes\n\nto an hour or so depending on your age and status.\n\nAnd they also try to insert educational wholesome content\n\nin addition to all the fun cat videos\n\nand everything else that people are watching.\n\nSo I think the Chinese know\n\nthat this system is maybe not the best thing\n\nthat kids should be spending all day on.\n\nTikTok is owned by ByteDance, a Chinese company.\n\nUnder Chinese law, ByteDance is required\n\nto hand over data to Beijing whenever\n\nand in however much it wants it.\n\nIt's like putting a Chinese spy balloon in your cell phone\n\nwith your biometric data,\n\neverything you've liked and disliked.\n\nThere's been studies done suggesting\n\nthat the algorithm in TikTok in the American version\n\nwas promoting certain views\n\nlike after the October 7th massacre in Israel,\n\nmore pro-Hamas views were being amplified\n\nor pro-Russian views on the Ukraine conflict.\n\n@NOYK1847 asks, If Russian bots exist,\n\ndo Chinese bots also exist?\n\nI think first of all,\n\nyou should look down at the comments in this video\n\nand you'll probably get a taste\n\nof whether there are any Chinese bots.\n\nChina, it's been well documented,\n\nit uses both bots\n\nas well as what is called a 50-Cent Army\n\nbasically has a bunch of mainly kids and young adults\n\nwho are paid 50 Chinese cents\n\nper internet post that they make\n\nto destroy, undermine the credibility of messages\n\nthat maybe cut against the Chinese Communist Party.\n\nIt's reported there's probably\n\nseveral hundred thousand people\n\nthat are essentially employed as internet trolls\n\nby the Chinese Communist Party, in addition\n\nto obviously using artificial intelligence and bots.\n\n@Psalm_Sixtynine asks, Why would China want Tibet?\n\nI think it becomes very clear\n\nwhen you look at a map of China\n\nand you can see that most of it\n\nis the highest mountains in the world, the Himalayas,\n\nand a lot of it is also desert.\n\nAnd so most of China's population is packed in here\n\nand they're desperate for water as well as strategic space\n\nto defend themselves against enemies.\n\nAnd so Tibet, which is in this area here,\n\nis highly strategic.\n\nFor one, a lot of the glaciers up in the Himalayas\n\nare where the major rivers of Asia start,\n\nboth flowing down into China\n\nas well as flowing down into Southeast Asia and into India.\n\nSo if China can control that territory,\n\nit controls the source of vital water supplies.\n\nAt the same time, China and India,\n\nwhich is now the most populous country on the planet,\n\nhave a longstanding rivalry,\n\nand Tibet is the high ground\n\nliterally looking down onto India.\n\nIn addition, the Chinese Communist Party\n\nessentially inherited the borders\n\nof the previous Qing dynasty empire,\n\nwhich included Tibet led by the Dalai Lama.\n\nAnd so when China took over Tibet and conquered it in 1951,\n\nthe Dalai Lama fled to India\n\nand has been running a government in exile\n\nin India ever since.\n\nThis next question is from TapestryGirl.\n\nMom says China could take over the United States\n\nbecause they own our debt.\n\nChina does own some US debt. It's in the 3 to 4% range.\n\nIt topped out at about 7% about a decade ago,\n\ngenerally in the form of treasury bills.\n\nAnd a lot of this emerges\n\njust from the economic relationship\n\nbetween the United States and China\n\nwhere China is exporting a lot of goods\n\nto the United States.\n\nAnd the United States will often pay for that,\n\nessentially with a piece of paper that says\n\nIOU in the form of a treasury bill.\n\nAnalysts have looked at whether\n\nthey could use this as a course of weapon\n\nand basically concluded\n\nthey'd be shooting themselves in the foot.\n\nThe value of that asset would suddenly plummet.\n\nJapan owns more US debt than China does.\n\nSo I don't think that this is a unique China thing\n\nor that they could use it as some type of weapon\n\nto coerce the United States.\n\nLet's take a question from Quora.\n\nIs modern China more influenced\n\nby Confucianism or Marxism?\n\nI would say both because they lead in similar directions.\n\nMarxism-Leninism stresses the idea\n\nof public or communal ownership of the means of production\n\nto produce wealth.\n\nThat is owned by the state in China.\n\nIt's led by what Lenin would call the vanguard party\n\nstaffed by a top leader that is making decisions\n\non behalf of the people.\n\nAnd that's consistent with certain elements of Confucianism.\n\nConfucianism obviously has a long lineage,\n\nthousands of years in China.\n\nConfucius, a philosopher who emphasized a natural harmony,\n\npeople knowing their place in society,\n\nthat everyone has a certain role to perform in that society,\n\nand that you have to have a benevolent leader\n\nthat leads on behalf of the people.\n\nThat obviously appeals very much\n\nto Chinese dynasties over the millennia.\n\nYou have Xi Jinping today grafting that on\n\nto a Marxist-Leninist structure of the party.\n\n@Gus_802 asked, What happened\n\nwith the Chinese spy balloon hysteria?\n\nIn January, 2023, the United States detected\n\na balloon floating over areas\n\nincluding a nuclear missile silo in Montana.\n\nWhat it was carrying\n\nwas all this advanced surveillance equipment\n\nthat was about the size of a regional jet airliner.\n\nSo we're talking about\n\na major piece of hardware floating around.\n\nChina's done this in more than 40 countries,\n\nin Japan, over Taiwan,\n\nthey've been floating balloons\n\neven over potentially over American bases in Europe.\n\nAnd there's a fear that China is testing out\n\nthis alternative surveillance system.\n\nBecause balloons emit almost no radar signature,\n\nthey're really hard to detect.\n\nThey hover around 60,000 feet, which is higher\n\nthan a commercial airliner but below satellites\n\nin this area where people really aren't looking.\n\nIt gives China eyes and ears over sensitive US sites\n\nthat otherwise they wouldn't have.\n\nThe US sent a fighter jet up eventually to shoot it down\n\nand then the US grabbed all of the technology that was there\n\nand observed the balloon's flight.\n\nThat might have actually helped US intelligence\n\nmore than Chinese intelligence.\n\n@all4stops asks, Who is winning the tech war\n\nbetween China and the United States?\n\nI think they are each dominating\n\ndifferent types of technologies.\n\nThe United States is still doing quite well\n\nin high-value areas.\n\nSo advanced computer chips, aerospace,\n\nthe complicated jet engines\n\nthat you need to fly a jumbo jet or a fighter.\n\nChina on the other hand dominates scale\n\ntaking existing technologies from other countries\n\nand then mass producing highly effective,\n\ncost-efficient electric vehicles,\n\nrun-of-the-mill computer chips,\n\nrare earths, pharmaceuticals, medical PPE.\n\nThere's so many areas where China\n\ncan just flood the market with sheer scales.\n\nBoth of those types of technologies\n\nare really important for a modern economy.\n\nThey're also very important for military power.\n\nSo each in their own way is sort of winning in some ways\n\nbut also has major vulnerabilities.\n\n@JoeBart85120716 asked, Does China own American farmland?\n\nYes, China does own American farmland.\n\nIt's like 0.05% of American farmland.\n\nBut some of this farmland is near American military bases,\n\nespecially Air Force bases\n\nincluding some of those where American strategic forces,\n\nnuclear forces could be taking off.\n\nAnd so there is a fear that if China has this land,\n\nthey can put things on it, explosives, missiles,\n\nthat could potentially attack American bases\n\nif there is some kind of major war\n\nand destroy US aircraft on the ground\n\nbefore they even get up into the air.\n\nWe don't know the details on that.\n\nYou'd have to get classified information,\n\nbut the amount of farmland is small,\n\nthe location is a little bit scary and questionable.\n\ncakeba asks, Can someone explain Hong Kong to me?\n\nSo Hong Kong was a British colony\n\nafter the first Opium War in 1839\n\nall the way up until 1997\n\nwhere Britain agreed to hand back Hong Kong to China\n\nand in exchange, China pledged to grant Hong Kong a, quote,\n\nHigh degree of autonomy.\n\n'Cause within Hong Kong there was a different rule of law.\n\nThere was an independent judiciary.\n\nSo you saw massive protests there\n\nover the last five or six years when China\n\nwas basically trying to erode a lot of those freedoms,\n\ncrack down on the press,\n\ncrack down on the free flow of investment,\n\nand also on the way\n\nthat the Hong Kong government is selected\n\nand the Chinese government passed national security laws\n\nthat made it possible for them to remove protestors,\n\ntake them to mainland China.\n\nSo at this point it seems like Hong Kong\n\nhas basically become another large cosmopolitan,\n\nbut ultimately Chinese city\n\nrun by the Chinese Communist Party.\n\nIronLover64 asks, How does the quality of life\n\nfor the low class in China compare\n\nto that of the United States, let's say in a red state.\n\nSo why don't we compare the poorest of the poor in China\n\nto say average wages in Mississippi,\n\nwhich is the poorest state.\n\nFor China, roughly half the country\n\nis living on something like $5 to $10 a day.\n\nIn Mississippi, that's gonna be three\n\nto four times that amount.\n\nThere's a lot more obesity in a place like Mississippi\n\nthan there is in China.\n\nOn the other hand, in rural China\n\nyou have a severe problem of malnourishment\n\nand rudimentary healthcare.\n\nResearchers at Stanford went out\n\nand they found that roughly a third of rural children,\n\ntheir IQs are around 90, which is really low,\n\nbecause of malnutrition from a young age,\n\na lack of education.\n\nThe average education level is about an eighth grade\n\nor seventh grade level in rural China\n\n'cause high school costs money.\n\nAnd so a lot of Chinese families,\n\ntheir kids will just drop out of school.\n\nAnd the other issue is that your citizenship in China\n\nis tied to your locality.\n\nAnd so if Mom and Dad go\n\nto an eastern rich coastal province to work in a factory,\n\nthey can't bring their kids with them\n\n'cause they won't be allowed to go to school.\n\nSo they're just sending money back\n\nand maybe only seeing their kids\n\na few times or maybe only once a year.\n\nSo just in terms of the basic healthcare and education level\n\nand then just in terms of the amount of wealth\n\nthat someone in Mississippi might have\n\nversus someone in poor rural China,\n\nit's a very stark difference.\n\n@Captaintrips333 asks, What's going on\n\nwith the Uyghur Muslim population in China?\n\nSo there's about 10 to 12 million Uyghur Muslims.\n\nThey live mainly in a province called Xinjiang,\n\nwhich is in the western part of China.\n\nBasically since 2017,\n\nChina set up what they call reeducation centers\n\nor vocational education centers,\n\nwhat people in the West have called concentration camps,\n\nand what the US government deems an attempt at genocide\n\nand basically put in a million\n\nto a million and a half Uyghur Muslims,\n\nso a substantial part of the population, in these centers.\n\nWe've heard from people that have come out of them\n\nthat there's a lot of indoctrination, that they are enforced\n\nto renounce their heritage and to learn Mandarin\n\nand basically to assimilate with Chinese society.\n\nA big part of what the Chinese Communist Party is about\n\nis making sure a Soviet-style collapse\n\nnever occurs in China.\n\nAnd one of their theories\n\nabout why the Soviet Union broke apart\n\nwas that the Soviet Union\n\nwas like one of those Hershey chocolate bars\n\nthat's divided into little squares that you can break apart.\n\nIt was these disparate republics\n\nthat all went their own way when they suddenly could.\n\nSo there was a fear that a minority region like Xinjiang\n\nwhere these Uyghurs were living\n\nwas going to try to separate from the mainland\n\nor was gonna become a base of terrorism directed at China.\n\nSo unfortunately the Uyghur Muslims\n\nare experiencing severe repression right now\n\nunder the Chinese Communist Party.\n\nloefferrafael asks, Does China support\n\nor promote communism around the world?\n\nI don't think China's promoting communism anymore\n\nthe way that the Soviet Union\n\nused to bankroll revolutionary movements.\n\nThey have engaged in this Belt and Road Initiative\n\nwhere they've loaned out more than a trillion dollars\n\nto more than a hundred different countries,\n\nmainly so that those countries can employ Chinese companies\n\nto build infrastructure on their territory.\n\nSo whether that's building ports or roads or soccer stadiums\n\nor what the Chinese call smart city systems.\n\nThere's a port in Greece for example,\n\nthat is highly profitable,\n\nit's an important, valuable piece of infrastructure\n\nthat China helped fund and build.\n\nOne out of every three infrastructure projects\n\nin Sub-Saharan Africa over the last 20 years\n\nhas been built partially\n\nor entirely by Chinese companies.\n\nSo you see a massive spread of infrastructure\n\nand part of the reason really stems\n\nfrom the 2008 Financial Crisis\n\nand the resulting trade protectionism\n\nthat was emerging, backlash against Chinese products.\n\nThe Chinese decided, We need to open up new markets.\n\nWe can also get these countries more hooked\n\non our ecosystem of technology standards,\n\n5G networks, smart city systems,\n\nand that way we'll have dominant market share\n\nin a lot of these areas\n\nthat are gonna be really the growth of demand\n\nin terms of consumption going forwards.\n\nThey also bring that surveillance system\n\nthat allows would-be dictators\n\nto keep easier tabs on their populations.\n\n@ostenati asks, What happens when Xi dies?\n\nWho's next in line? And will they be good for China?\n\nI think chaos could potentially ensue\n\nbecause he has not designated a successor.\n\nHe's written himself into the constitution.\n\nHe's basically treated like a demigod\n\nin terms of Chinese propaganda.\n\nAnd if you look at the history\n\nof the Chinese Communist Party,\n\nthere has only been one completely orderly\n\nand peaceful transition of power.\n\nAnd that's when Xi himself came to power.\n\nAll of the previous leaders,\n\nit was a vicious power struggle\n\nand there were split authorities.\n\nSo for example, Deng Xiaoping is purged\n\nand then eventually comes back to power\n\nand has to put down his enemies and imprison them\n\nin order to take the helm.\n\nThen Jiang Zemin comes to power\n\nafter the Tiananmen Square massacre in 1989,\n\nbasically 'cause the Party realizes\n\nit needs to unify behind a candidate\n\nor they're just gonna disintegrate.\n\nThen when Hu Jintao comes to power,\n\nJiang Zemin is not willing to give up a lot of his power\n\nand he keeps himself as commander in chief\n\neven after Hu Jintao becomes president\n\nand general secretary of the country.\n\nIt'd be like as if Joe Biden was still head of the Pentagon\n\nand the military and commander in chief,\n\neven though Donald Trump\n\nis now president here in the United States.\n\nIn other words, in Chinese politics\n\nit's very rough-and-tumble,\n\neven though it happens behind closed doors.\n\nChaos is entirely possible.\n\nAnd if you just look at the broad sweep of Chinese history,\n\nvicious power struggles tend to ensue.\n\nSome people hope that you'll get\n\na Chinese Mikhail Gorbachev,\n\nyou know, the Soviet leader who made nice with the West\n\nand liberalized a bit at home.\n\nI think you might actually get a Chinese Vladimir Putin.\n\nIt seems like the one thing\n\nthat everyone in the Chinese Communist Party can agree on\n\nis that the Chinese Communist Party\n\nshould continue to rule China in perpetuity.\n\nSo those are all the questions for today.\n\nThanks for watching China Support.\n\n[upbeat music]",
  "authors": [
    "Condé Nast"
  ],
  "url": "https://www.wired.com/video/watch/tech-support-political-scientist-answers-china-questions"
}