{
  "title": "24 Thanksgiving Potato Recipes Our Readers Love",
  "text": "Advertisement\n\n24 Thanksgiving Potato Recipes Our Readers Love Mashed potatoes, potato gratin, roasted potatoes: The potato, in all its forms, is the real M.V.P. of your holiday table. Credit... Linda Xiao for The New York Times. Food Stylist: Barrett Washburne.\n\nTurkey often gets billed as the main event, but potato is the real headliner of Thanksgiving. While green bean casserole, brussels sprouts and sweet potatoes can be divisive, potatoes are the one dish everyone piles onto their plate. (Stuffing gets an honorable mention.) Whether you’re drawn to a classic creamy mash, a cheesy gratin or something roasted and crisp, we’ve got you covered. Below are the potato recipes our readers can’t stop raving about.\n\nCredit... Christopher Testani for The New York Times. Food Stylist: Simon Andrews. Prop Stylist: Christina Lane.\n\n“This is the best. I’m 13 years old and I feel like a chef now.”\n\nJulia Moskin’s recipe is tried and true: She mashed 32 pounds of potatoes to decode the platonic ideal mash. Her findings? Mashed potatoes are forgiving. Boil your potatoes however you like (in plain water or salted water, in water mixed with milk or chicken stock). As long as you have a good tool (masher, ricer, stand mixer), hot spuds and plenty of butter and salt, you can make something delicious.\n\nRecipe: Mashed Potatoes\n\nAdvertisement\n\nCredit... Christopher Testani for The New York Times. Food Stylist: Simon Andrews. Prop Stylist: Christina Lane.\n\n“My family practically hoisted me upon their shoulders.”\n\nCan’t decide between creamy or crispy? You don’t have to, thanks to J. Kenji López-Alt’s genius Hasselback gratin. Rather than laying the potato slices flat, like a traditional gratin, he places them upright on their edges, resulting in crisp, golden brown ridges across the whole casserole dish. (Watch Kenji make this glorious recipe here.)\n\nRecipe: Cheesy Hasselback Potato Gratin\n\nCredit... David Malosh for The New York Times. Food Stylist: Simon Andrews.\n\n“These are such a comfort. They’re just fussy enough to prove how much the cook loves the people at the table.”\n\nThis is a twice-baked potato at its simplest: crisp, salty potato skin on the outside, cheesy mashed potatoes on the inside. Ali Slagle’s recipe is classic — sour cream, Cheddar cheese and chives — but garnish with whatever cheese and toppings your heart desires.\n\nRecipe: Twice-Baked Potatoes\n\nCredit... Christopher Testani for The New York Times. Food Stylist: Simon Andrews.\n\n“I hate potatoes. After cooking these I may reconsider. Excellent!!! Easy and quick.”\n\nLidey Heuck’s recipe is the blueprint for a perfect roasted potato: creamy and tender on the inside, crisp and golden on the outside. Keep them simple with just olive oil, salt and pepper or dress them up with fresh herbs, garlic powder or chili powder.\n\nRecipe: Roasted Potatoes\n\nAdvertisement\n\nCredit... Christopher Testani for The New York Times. Food Stylist: Rebecca Jurkevich.\n\n“It is truly OMG. Next time I will make double the amount.”\n\nVelvety, vegan mashed potatoes exist! The key is to use good olive oil. In this supremely easy recipe, David Tanis boils potatoes with eight cloves of garlic and salt. He then reserves some of that flavorful cooking liquid for mashing, to help thin the mash to your desired consistency.\n\nRecipe: Olive Oil Mashed Potatoes\n\nCredit... Julia Gartland for The New York Times. Food Stylist: Michelle Gatton.\n\n“My husband called these potatoes the lobster of vegetables.”\n\nMark Bittman’s recipe is basically foolproof. Sliced potatoes are layered with half-and-half or heavy cream, butter and grated Parmesan or Gruyère and then baked until golden and bubbly. Feel free to remix: Add onions, leeks, garlic, herbs and different cheeses. It’s hard to mess up. Just make sure you use only one type of potato, as they cook at different rates.\n\nRecipe: Potatoes au Gratin\n\nCredit... Yossy Arefi for The New York Times (Photography and Styling)\n\n“Game changer. This is the gold standard.”\n\nThis bright and spicy dish is just what you need on your Thanksgiving plate. Lidey Heuck’s recipe is inspired by suea rong hai, or “crying tiger,” a Thai dish of grilled beef with a fiery sauce of chile, fish sauce, lime juice, toasted rice powder and cilantro. The sauce pairs beautifully with crispy smashed potatoes, but it would be just as good spooned over brussels sprouts or green beans.\n\nRecipe: Smashed Potatoes With Thai-Style Chile and Herb Sauce\n\nAdvertisement\n\nCredit... Christopher Simpson for The New York Times. Food Stylist: Simon Andrews. Prop Stylist: Paige Hicks.\n\n“This recipe is so good that I not only liked them but was in love with them. I didn’t think potatoes could taste this good!”\n\nMake ahead: No two words have ever sounded more beautiful to a home cook around the holidays. Genevieve Ko’s recipe is not just a gift for someone who likes to prep things in advance; it also yields a mash that is creamier and fluffier than your average mashed potato recipe. When the potatoes are chilled, their starches firm up, so when they are reheated gently, they relax into a mash that’s even silkier than on the day they were made. Science!\n\nRecipe: Make-Ahead Mashed Potatoes\n\nCredit... Christopher Testani for The New York Times. Food Stylist: Simon Andrews.\n\n“Holy moly, these are insane. Seriously my last meal would be a rotisserie chicken and a vat of these.”\n\nThese are melt-in-your-mouth potatoes. (No, seriously — the name “fondant” comes from the French word for melting.) In Lidey Heuck's recipe, Yukon Gold potatoes are cut into nice rounded cylinders, seared in a hot pan, basted in butter, thyme and garlic and then baked until fall-apart tender. If you don’t have the patience or time to cut them uniformly, they will still be delicious.\n\nRecipe: Fondant Potatoes\n\nCredit... David Malosh for The New York Times. Food Stylist: Simon Andrews.\n\n“70000/10 would make again. No notes.”\n\nThis recipe from Claire Saffitz is like a cross between hash browns and a classic mash. The “cake” is made from russet potatoes baked directly on the oven rack, which makes their skins crispy. Garlic sizzles in butter until both are browned, and then the fluffy potatoes are added, along with some roughly chopped potato skins and sour cream. The mixture is flattened into a single layer and then baked in an oven-safe nonstick skillet until a golden crust forms on both sides.\n\nRecipe: Garlicky Mashed Potato Cake\n\nAdvertisement\n\nCredit... David Malosh for The New York Times. Food Stylist: Simon Andrews.\n\n“It’s great that you can make it in advance. It’s always a hit and gets completely devoured.”\n\nMelissa Clark’s brilliant recipe can be made up to three days in advance. Cook the potatoes, mash them with butter and sour cream, season with chives, salt and pepper and spread them into a 9-by-13 pan. When it’s almost time to eat, top the casserole with a mixture of bread crumbs, butter and grated Parmesan and bake until golden.\n\nRecipe: Mashed Potato Casserole\n\nCredit... Christopher Testani for The New York Times. Food Stylist: Spencer Richards.\n\n“These potatoes are definitely a great addition to a meal any time of year!”\n\nSam Sifton’s baked potatoes are a blank canvas and you are the painter. Sour cream, cranberry-orange relish, minced chives, crumbled bacon, chopped jalapeño, grated cheese — adorn these bad boys to your heart’s content.\n\nRecipe: Baked Potatoes\n\nCredit... Christopher Testani for The New York Times. Food Stylist: Simon Andrews.\n\n“WOW! This might be my favorite NYT recipe yet. Family loves it.”\n\nThanksgiving potatoes can also be in salad form, and Melissa Clark’s zippy recipe fits that job description perfectly. Rather than the typical mayonnaise-based potato salad, lemon juice, mint and scallions add bright, herbal flavors; a sprinkle of Aleppo pepper brings some heat.\n\nRecipe: Lemon Potato Salad With Mint\n\nAdvertisement\n\nCredit... Linda Xiao for The New York Times. Food Stylist: Barrett Washburne.\n\n“The most flavorful, rich, amazeballs mashed potatoes I’ve ever made. Loved them. Wouldn’t dare change one thing.”\n\nAlexa Weibel upgrades the classic side dish with garlic two ways: roasted garlic in the mash itself and garlic chips as a crunchy topping. You can roast and fry the garlic ahead of time, and peel the potatoes up to 12 hours before cooking (just store them in water in the refrigerator).\n\nRecipe: Creamy Double-Garlic Mashed Potatoes\n\nCredit... Ryan Liebe for The New York Times. Food Stylist: Simon Andrews.\n\n“This has become our special night go-to potato dish.”\n\nMelissa Clark’s potato gratin stays fairly classic in terms of flavors, but mixes it up when it comes to structure. Instead of piling the potatoes into a baking dish, she shingles the slices in a shallow sheet pan, which looks a bit more elegant and gives more surface area for the baked cheese to get crisp and golden brown.\n\nRecipe: Scalloped Potato Gratin\n\nCredit... David Malosh for The New York Times. Food Stylist: Simon Andrews.\n\n“This is now my go-to air fryer crispy potato recipe. The Dijon really makes a difference!”\n\nThese potatoes taste as if they had been oven-roasted — crispy, blistered skins with creamy, tender centers — but cook in about 15 minutes. Eleanore Park’s recipe calls for baby potatoes (no need to parboil beforehand), which are seasoned with Dijon mustard, dried parsley and garlic salt.\n\nRecipe: Air-Fryer Potatoes\n\nAdvertisement\n\nCredit... David Malosh for The New York Times. Food Stylist: Simon Andrews. Prop Stylist: Megan Hedgpeth.\n\n“Wow! Perfect as is. And incredibly easy. Definitely will replace my usual mashed potatoes.”\n\nSour cream and onion lovers, rejoice! In Sohla El-Waylly’s mash, creamy Yukon Gold potatoes are studded with tender bites of skin-on red bliss potatoes. Tangy sour cream, onion powder and raw scallions keep things bold and bright, making this an ideal side for richer dishes.\n\nRecipe: Sour Cream and Onion Mashed Potatoes\n\nCredit... Christopher Testani for The New York Times. Food Stylist: Barrett Washburne.\n\n“This dish is incredibly delicious. Even my kids who hate beets, squash and sweet potatoes gobbled it up. Well worth all of the slicing.”\n\nThis colorful root vegetable gratin from Alexa Weibel requires some effort and precision, but its wow factor justifies the work. Thinly sliced potatoes, butternut squash, sweet potatoes and beets are baked in an herbed cream until tender and then capped with a wispy, crispy layer of store-bought phyllo.\n\nRecipe: Ombré Gratin\n\nCredit... Johnny Miller for The New York Times. Food Stylist: Susan Spungen.\n\n“These were extraordinary! The texture was perfect, and I usually parboil but no need!”\n\nYou probably wouldn’t serve salt and vinegar potato chips as a side dish, but you definitely could (and should) serve Lidey Heuck’s roasted potatoes inspired by the much-loved snack. In the recipe, potatoes are roasted in a simple vinaigrette and then tossed with another drizzle just before serving. And just like a bag of chips, you won’t be able to stop eating these either.\n\nRecipe: Salt and Vinegar Roasted Potatoes\n\nAdvertisement\n\nCredit... Ryan Liebe for The New York Times. Food Stylist: Simon Andrews.\n\n“These are top notch! So creamy and just the right amount of cheesy! Love love love these!”\n\nDavid Tanis calls for using aged Vermont Cheddar, which is deeply flavored but not too sharp, in this not-too-cheesy or -gooey mash. David Tanis uses a stand mixer with a wire whisk attachment to beat the potatoes and grated cheese together, slowly adding the melted butter and warm cream until everything is incorporated evenly.\n\nRecipe: Vermont Cheddar Mashed Potatoes\n\nCredit... Francesco Tonelli for The New York Times\n\n“This is the best potato I had in my life. Not super easy to prepare, but it makes such an impression on friends and family.”\n\nIf you’re feeling ambitious, this classic French dish is a worthwhile challenge. With only two main ingredients, butter and potatoes, the art is all in the preparation (Melissa Clark shows you how here.). Thin potato slices are layered in a skillet, basted in butter and compressed under another skillet while baking to form a gorgeous crust.\n\nRecipe: Pommes Anna\n\nCredit... Christopher Testani for The New York Times. Food Stylist: Simon Andrews.\n\n“Delicious and easy to make!”\n\nEveryone loves fries, but no one wants to stand over a pot of hot oil and deep-fry potatoes for a crowd, especially not on a holiday. Dan Pelosi’s oven fries scratch that itch and come together with ease. The key is to soak the cut potatoes in cold water for at least 15 minutes before baking to release extra starch, which leads to crispier outsides and creamier insides.\n\nRecipe: Potato Wedges\n\nAdvertisement\n\nCredit... Christopher Testani for The New York Times. Food Stylist: Simon Andrews.\n\n“This is an amazing way for quick baked potatoes. I wrap mine in a clean tea towel after puncturing and it comes out perfectly cooked.”\n\nIf you’re doing a more low-key holiday meal — or maybe you don’t have the oven space — Genevieve Ko’s microwave baked potato is a great option. The trick to cooking the spuds evenly all the way through is doing so at half power.\n\nRecipe: Microwave Baked Potato\n\nCredit... Kerri Brewer for The New York Times. Food Stylist: Barrett Washburne.\n\n“I love the chance to incorporate labneh into any dish I can, and this one did not disappoint!”\n\nAndy Baraghani’s spin on the classic mash features a simple garlic-infused cream and labneh, which adds a layer of creaminess to the potatoes as well as a delightful tang. He uses a wooden spoon to crush the potatoes against the sides of the pot, but if you’re not a fan of lumps feel free to use a masher or whisk. Top with more labneh, scallions, dill and plenty of pepper before serving.\n\nRecipe: Herby Mashed Potatoes With Labneh\n\nFollow NYT Cooking on Instagram, Facebook, YouTube and Pinterest. Get regular updates from NYT Cooking, with recipe suggestions, cooking tips and shopping advice.",
  "authors": [
    "Sharon Attia"
  ],
  "url": "https://cooking.nytimes.com/article/thanksgiving-potato-recipes"
}