{
  "title": "Gordon Ramsay Answers The Web's Most Searched Questions",
  "text": "Transcript\n\nHi guys, this is Gordon\n\non WIRED's Tackling Autocomplete.\n\n[dramatic music]\n\nFirst question:\n\n[dramatic music continues]\n\nis Gordon Ramsay a Michelin star chef?\n\n[Gordon chuckling]\n\nI won my first star many years ago\n\nand this year, we celebrate 27 years at Royal Hospital Road\n\nand 25 years at a three star.\n\nIs Gordon Ramsay considered the best chef\n\nin the world?\n\nThat's absolute bull [beep].\n\nI don't think you can ever be the best,\n\nbut you can be one of the best.\n\nGood question.\n\nIs Gordon Ramsay going vegan?\n\nAm I [beep].\n\nI did go vegan once for an entire lunchtime\n\nand it was interesting.\n\nIt was very interesting.\n\nIs Gordon Ramsay good at football?\n\nI think he was.\n\nFootball was an incredible release\n\nand there's a lot of synergy between running a kitchen\n\nand captaining a team.\n\nWho made Gordon Ramsay cry?\n\nThis one always fascinates me.\n\nI didn't actually cry.\n\nI got upset with the situation because I [beep] up\n\nand like in sports,\n\nlike in kitchens, when you screw up, you get upset.\n\nBut there's multiple people who've made me cry.\n\nMy kids make me cry.\n\nMy mum makes me cry,\n\nmy bulldog when he [beep] all over the carpet makes me cry.\n\nWho inspired Gordon Ramsay to cook?\n\nBiggest inspiration at the beginning was my mom.\n\nGrowing up and watching my mum handle three jobs,\n\nI would go and visit her at the restaurant on weekends\n\nand help her prep, peel all the onions, carrots, potatoes\n\nto help get her home a bit earlier.\n\nWho is Gordon Ramsay's favorite chef?\n\nIt's like saying who's your favorite child?\n\nOh God, that's so hard.\n\nI'm gonna say my favorite chef is a tossup\n\nbetween Clare Smyth, Angela Hartnett and Guy Savoy.\n\nDid Gordon Ramsay invent beef wellington?\n\nAbsolutely not. It was forgotten about.\n\nIt was sort of almost like the Sleeping Beauty of dishes.\n\nSo we revived it back in 2001 at Claridge's\n\nand ever since then, it has gone crazy.\n\nDid Gordon Ramsay jump out of a helicopter?\n\nMultiple times, repelled out of a helicopter,\n\nhung from a helicopter and jumped out of a helicopter.\n\nCan Gordon Ramsay handle spice?\n\nOf course I can.\n\nThis palette is an educated palette that loves spice.\n\n[paper tearing]\n\nCan Gordon Ramsay cook grilled cheese?\n\nWell, this [beep] thing always comes back\n\nto bite me on the arse every year.\n\nCan he do a grilled cheese? Can he get the pull of cheese?\n\nYes, I can finally.\n\nBeing in New Zealand and up against it time-wise,\n\nI thought the cheese had melted but it hadn't.\n\nNow I can perfect a grilled cheese, I promise you.\n\nHere we go.\n\nCan Gordon Ramsay bake?\n\nAbso [beep] lutely. I'll tell you why.\n\nMy first job in Paris,\n\nI worked at the Restaurant Guy Savoy\n\nin the middle of Paris in the 17th arrondissement\n\nand my first job was downstairs in the pastry\n\nand then in London, before going to Paris,\n\nI also worked as a baker at Le Gavroche.\n\nSo yes, I can bake, boom.\n\nDoes Gordon Ramsay drink coffee?\n\nI love coffee first thing in the morning.\n\nI'll start off the day after a session in the gym\n\nand I'll get a black coffee and a croissant\n\nand then throughout the day, I'll have a flat white,\n\npotentially with oat milk or skim milk.\n\n[paper tearing]\n\nDoes Gordon Ramsay like pineapple on a pizza?\n\nNo, I do not.\n\nI did my first Ironman in Hawaii\n\nand at the end of this finishing line,\n\nsome incredible young chef had cooked me a pizza\n\nand I was about to take a bite of it\n\nand I spotted the pineapple.\n\nSo I sort of, I dodged the pineapple and devoured the pizza.\n\nGood question.\n\nDoes Gordon Ramsay ever use a microwave?\n\nTilly recently just graduated from university,\n\none of our daughters, and the microwave was a staple\n\nin this apartment.\n\nSo I think they're good for reheating things.\n\nCouscous, for instance, is really good for 30 seconds\n\nto reheat in a microwave but sort of cook\n\nand eat from a microwave, no,\n\nbut reheating, 100% yes.\n\nDoes Gordon Ramsay call people donuts?\n\nPeople ask me that all the time.\n\nI call them donuts because they're clumsy.\n\nHave you ever tried eating a donut\n\nwithout licking your lips?\n\nIt's a very clumsy thing to try and eat and devour.\n\nSo yeah, I have called many people [beep] donuts.\n\nNext, what does Gordon Ramsay think\n\nof The Bear?\n\nThe Bear's incredible.\n\nIt gives a proper insight to the nitty gritty sort\n\nof [beep] side to the industry,\n\nthe pressure these chefs face,\n\nbut most importantly, the level of determination\n\nthat goes on in the kitchen.\n\nWhat are Gordon Ramsay's world records?\n\nThat's a really good question.\n\nWhen we first started launching The F-Word,\n\nwe used to come up with challenges\n\nthat would inspire winning Guinness World Records.\n\nI think I've lost quite a few of them now\n\nbecause clearly challenged.\n\nI don't know how many we still have.\n\nWhat are Gordon Ramsay's current shows?\n\nThat is a tough one.\n\nSecret Service, Kitchen Nightmares, MasterChef,\n\nHell's Kitchen, MasterChef Junior, Uncharted,\n\nand of course the one\n\nthat I'm most excited about, Knife Edge.\n\nNext, how Gordon Ramsay\n\nbecame famous.\n\nI didn't start cooking to become famous.\n\nI fell in love with it 'cause it was a passion\n\nthat I absolutely was a chef getting to the very top,\n\nspending three years in France\n\nand working with some phenomenal chefs\n\nthat really taught me how to perfect my craft.\n\nHow Gordon Ramsay cuts an onion.\n\nEveryone thinks it's easy cutting onion.\n\nThe secret is having a great sharp knife,\n\nso I peel it once and keep it whole.\n\nI leave a little touch of the root on, slice it in half.\n\nChop, chop, chop, chop, one, two, three, down.\n\nHold the onion back together\n\nand then slice into a nice fine dice.\n\nForget the word speed.\n\nWhen you start chopping things like onions\n\nand carrots, focus on the technique first.\n\nGet the techniques right first\n\nbefore you start getting faster.\n\nWhen you get too fast, that's when you cut yourself,\n\nso slow down.\n\nAny tips to avoid crying when cutting an onion?\n\nRinse it under cold water\n\nand that stops the acid bleeding from the back of the onion.\n\nI do get frustrated\n\nwhen I see people wearing [beep] goggles,\n\nswimming goggles and dive masks cutting an onion.\n\nNo.\n\nHow does Gordon Ramsay like his steak?\n\nI'm a big medium-rare. I'm not a big fan of blue.\n\nI don't think you can really identify the flavor\n\nof the meat when it's blue,\n\nand the secret of cooking a great steak is letting it rest\n\nbefore you slice it.\n\nSo mid-rare all day long.\n\nLove it.\n\nRight, what does Gordon Ramsay use\n\nto sharpen his knives?\n\nSome knives are incredibly delicate that require the stone\n\nand others just a straightforward steel.\n\nNice and slowly.\n\nWhat culinary school did Gordon Ramsay go to?\n\nYeah, so I enrolled in...\n\nIt was a foundation course in catering.\n\nAnd so by the time I got into college,\n\nI was already sort of quite well advanced on the course\n\n'cause I spent two days a week at college\n\nand the other three days a week I spent at school.\n\nSo that was sort of like a test scheme\n\nthat worked out very well.\n\nWhat's in Gordon Ramsay's lamb sauce?\n\nOh [beep].\n\nThat's a tough one that one.\n\nI go back to the moment when I was screaming\n\nand waiting for the freaking lamb sauce to come.\n\nIf you slice the lamb as the main course,\n\nthe thing you've got to serve at the same time is the sauce.\n\nThe secret of any great lamb sauce\n\nis in the resting juices from the lamb.\n\nWhether it's a rump of lamb, a leg of lamb,\n\nor the most amazing shoulder.\n\nThank you so much for watching.\n\nI hope you enjoyed those questions\n\nas much as I didn't and thank you.\n\n[Gordon chuckling]\n\nGod bless.\n\n[beep] You very much.\n\n[lively music]",
  "authors": [
    "Condé Nast"
  ],
  "url": "https://www.wired.com/video/watch/google-autocomplete-inverviews-gordon-ramsay-answers-the-webs-most-searched-questions"
}