{
  "title": "Israeli strikes across Gaza kill at least 32 Palestinians, as Hamas warns of ‘dangerous escalation’",
  "text": "Israeli strikes across Gaza killed at least 32 Palestinians in the latest escalation of violence since the ceasefire between Israel and Hamas took effect.\n\nThe Palestinian Ministry of Health said 12 children and eight women were among those killed in the strikes, which continued from Wednesday into Thursday morning, while a further 88 people sustained injuries.\n\nThe Israel Defense Forces said it carried out the strikes on Hamas targets after “several terrorists” fired on Israeli soldiers operating in Khan Younis in southern Gaza. “This action constitutes a violation of the ceasefire agreement,” the IDF said, adding that none of its forces had been injured.\n\nHamas condemned the strikes as “a dangerous escalation” and rejected the IDF’s account, accusing Israel of trying to “justify its ongoing crimes and violations.” It called on the US to exert “immediate, serious pressure” on Israel to “respect the ceasefire and halt the aggression against our people.”\n\nThe latest strikes bring the total Palestinian death toll since the ceasefire came into effect to 312.\n\nThey come just days after the UN Security Council endorsed US President Donald Trump’s plan for how to move beyond the fragile truce to a more sustainable peace and the reconstruction of the devastated enclave.\n\nMeanwhile, in a separate development, Israel also carried out airstrikes on what it claimed were Hezbollah weapons storage sites in southern Lebanon.\n\nThe strikes in Gaza were the third major escalation since the ceasefire agreement came into force in October, each preceded by an attack on Israeli soldiers.\n\nIn the two previous escalations, on October 19 and 28, approximately 150 Palestinians and three Israeli soldiers were killed.\n\nHowever, despite those escalations the ceasefire has largely held.\n\nPalestinian casualties arrive at Nasser hospital in Khan Younis, Gaza, following Israeli strikes on Wednesday. Abdallah F.s. Alattar/Anadolu/Getty Images\n\nCNN footage taken Wednesday at Gaza City’s Al-Ahli Baptist Hospital complex shows dozens of people crowding around incoming ambulances carrying victims of the strikes.\n\nThe footage shows several people sitting beside the corpses inside the hospital, some peering into the body bags in despair. One of the body bags contains the bodies of three lifeless children still covered in dust.\n\nThe deadliest strike Wednesday was in the Zaytun area in the east of Gaza, where 10 people, including a woman and a child, were killed, Gaza Civil Defense said.\n\nAnother strike hit an area west of Khan Younis targeting “a group of civilians inside the UNRWA club,” the Civil Defense added.\n\nUNRWA is the United Nations Relief and Works Agency for Palestine Refugees in the Near East.\n\nIsrael launched its war in Gaza after Hamas-led militants killed around 1,200 people and took more than 250 hostage during an attack on Israel on October 7, 2023. Since then, according to the Gaza health ministry, more than 69,000 Palestinians – most of them women and children – have been killed.\n\nAs part of the first phase of the US-brokered ceasefire framework, Hamas agreed to release all the remaining hostages in Gaza, living and dead, while Israel agreed to withdraw from some parts of Gaza and release some Palestinian prisoners. Hamas has since released all of the living hostages and the bodies of all but three of the dead ones.\n\nThe strikes in Gaza come a day after an Israeli strike on a Palestinian refugee camp in Lebanon killed 13 people, according to Lebanon’s health ministry. The IDF said Tuesday’s strike had targeted “a Hamas training compound” that was being used to “plan and carry out terrorist attacks against the IDF and the State of Israel.”\n\nOn Wednesday, Israel carried out further strikes in southern Lebanon, targeting what it said were “several weapons storage facilities belonging to Hezbollah’s rocket unit.” The strikes caused no casualties but damaged several houses, according to Lebanon’s state-run National News Agency.\n\nIsrael has been carrying out strikes in Lebanon targeting militants from Hezbollah as well as various Palestinian militant factions for more than two years. These escalated after Iran-backed Hezbollah launched attacks on Israel in support of Hamas following the October 7 attack. The latest strikes come despite a ceasefire agreement between Israel and Hezbollah that took effect in November 2024.\n\nCNN’s Heather law contributed to this report.",
  "authors": [
    "Abeer Salman",
    "Tareq Al Hilou",
    "Mohammed Tawfeeq"
  ],
  "url": "https://www.cnn.com/2025/11/19/middleeast/israel-strikes-gaza-escalation-latam-intl"
}