{
  "title": "Walmart acaba de demostrar que podría ser la solución de Estados Unidos a la crisis de asequibilidad",
  "text": "CNN —\n\nWalmart está demostrando ser el antídoto de Estados Unidos frente a la crisis del costo de vida.\n\nUn número creciente de estadounidenses está recurriendo a Walmart para comprar alimentos y ropa, mientras la inflación y los altos precios aprietan sus presupuestos: el negocio de Walmart en Estados Unidos está en auge y está superando a sus competiores en el mercado, dijo la compañía este jueves en su informe financiero trimestral.\n\nWalmart ha aprovechado su enorme tamaño y escala para reducir precios e invertir miles de millones de dólares en iniciativas como aumentos salariales, renovación de tiendas y la construcción de una red logística para compras en línea.\n\nEstas inversiones están dando resultados para Walmart en un momento en que las finanzas de muchos estadounidenses están bajo presión.\n\nEn el último trimestre, las ventas de Walmart en Estados Unidos aumentaron un 4,5 %. La compañía vio un repunte en las visitas a tiendas y los clientes gastaron más cuando acudieron. Walmart también elevó sus previsiones de ventas y ganancias, lo que indica que prevé una sólida temporada de compras navideñas.\n\nEl avance de Walmart ha sido impulsado por hogares de clase media y de ingresos altos que recurren a sus tiendas y sitio web para intentar ahorrar dinero.\n\n“Estamos ganando cuota de mercado, mejorando la velocidad de entrega y gestionando bien el inventario”, dijo el director ejecutivo de Walmart, Doug McMillon, en un comunicado. “Estamos bien posicionados para cerrar el año con fuerza y también más allá”.\n\nMcMillon anunció que se retirará pronto como director ejecutivo tras 11 años. En febrero será sucedido por John Furner, quien dirige las operaciones de Walmart en Estados Unidos.\n\nGanancias frente a Target y las tiendas de dólar\n\nWalmart le está ganando terreno especialmente a Target, cuyas ventas se han estancado durante unos cuatro años.\n\nUna de las principales ventajas de Walmart sobre Target es su negocio de comestibles.\n\nLos compradores acuden con frecuencia a las tiendas para adquirir alimentos, y Walmart ha hecho de la mejora de su sección de productos frescos una prioridad en los últimos años. La empresa también ha reducido la brecha con Target en materia de ropa y artículos para el hogar.\n\nA medida que los consumidores ajustan su gasto, más personas eligen Walmart por encima de Target.\n\nWalmart también ha captado a clientes de menores ingresos que antes iban a Dollar General y otras tiendas de descuento.",
  "authors": [
    "Nathaniel Meyersohn"
  ],
  "url": "https://cnnespanol.cnn.com/2025/11/20/eeuu/walmart-crisis-precios-estados-unidos-trax"
}