{
  "title": "Lawrence O’Donnell Explains How Epstein Vote Caused Trump’s ‘Surrender And Humiliation’",
  "text": "LOADING ERROR LOADING\n\nMS NOW host Lawrence O’Donnell is calling out President Donald Trump for attempting to save face by announcing having “signed the bill” to release government files on late child sex trafficker Jeffrey Epstein after months of openly dismissing public demand.\n\n“Tonight, Donald Trump put his surrender and humiliation in writing in capital letters in a tweet, saying, ‘I have just signed the bill to release the Epstein files,’” O’Donnell said Wednesday on “The Last Word,” citing Trump’s Truth Social post from earlier that evening.\n\nAdvertisement\n\nThe host continued, “While he was at it, Donald Trump once again treated his true believers as if he believes they are the stupidest people in the world. No one insults the intelligence of Trump voters more than Donald Trump.”\n\nThe current Trump administration had initially positioned itself as transparent on Epstein and his rumored clients, with U.S. Attorney General Pam Bondi vowing in February to release related files only for Trump to call the entire case a Democrat “hoax” come July.\n\nTrump pivoted once again last week amid mounting support for a unanimous consent vote in the Senate. He ultimately went on to sign the related transparency bill into law, but O’Donnell reminded viewers that the MAGA leader has long openly opposed as much.\n\nAdvertisement\n\n“Everyone in Congress knows, and everyone in the country should know that Donald Trump fought this bill every minute until he was told over the weekend that he was going to lose both in the House and, much more importantly, in the Senate,” he said.\n\nO’Donnell stated that Trump would usually have “every right” to expect the GOP-controlled Senate to kill the Epstein Files Transparency Act, but that increasingly bipartisan pressure led him to publicly encourage Republicans to vote in favor, and to its unanimous passage.\n\n“If Donald Trump thought Republicans in the Senate would hold the line for him, he would have never told House Republicans to vote for the bill,” said O’Donnell, before adding that Senate Majority Leader John Thune (R-S.D.) must have told Trump “he was going to lose.”\n\nAdvertisement\n\nHe said, “John Thune has been silent about the Epstein files this week until today. But his public silence just proved how much John Thune must have communicated privately to Donald Trump about just how badly he was going to lose in the United States Senate.”\n\nO’Donnell then reiterated his theory on why Trump went on to support voting, namely that he then “could pretend” without acknowledging his failure that he “allowed it to happen” in the first place, and added that even House Speaker Mike Johnson (R-La.) voted in favor.\n\nAdvertisement\n\nJohnson only did so because “Thune promised,” O’Donnell said, to add amendments to the bill allowing for arguably censorious provisions, which Thune never did, resulting in now-viral footage of Johnson stating how “deeply disappointed” he was.\n\n“That is how unwilling John Thune was to do Donald Trump’s dirty work in the end, after House Democrats spent the year exposing that dirty work,” said O’Donnell, before playing a clip of Thune telling reporters Wednesday why he broke with Johnson.\n\n“I think there are different … ways of doing things,” Thune said. “The House and the Senate function differently. We have procedures and rules that we have to adhere to and follow. It makes it much harder to pass things, as you all know, through the floor and the Senate.”",
  "authors": [
    "Trends Reporter"
  ],
  "url": "https://www.huffpost.com/entry/lawrence-odonnell-trump-surrender-and-humilation-epstein-vote_n_691ef435e4b0b763ab8e11d1?origin=home-zone-d-unit"
}