{
  "title": "Brazil creates new Indigenous territories during protest-hit COP30",
  "text": "Brazil creates new Indigenous territories during protest-hit COP30\n\n3 days ago Share Save Mallory Moench Share Save\n\nAFP via Getty Images Indigenous people during a march at COP30 in Belém, Brazil on 17 November\n\nGeorgina Rannard Climate and science reporter, Belém, Brazil\n\nCOP30 host Brazil has created 10 new Indigenous territories, with the climate summit hit by protests in recent days. The designation means the areas, including one in part of the Amazon, will have their culture and environment protected under Brazilian law - though this is not always enforced. The move follows similar actions from President Luiz Inácio Lula da Silva, whose government recognised Indigenous possession of 11 territories last year. \"Each and every indigenous territory in Brazil is a reason to celebrate and is a reason for us to feel happy,\" Dinaman Tuxá from the group Articulation of Indigenous Peoples of Brazil (APIB) told the BBC at COP30.\n\nThe latest measure will be formalised through a presidential decree. Mr Tuxá said APIB wants more lands to be recognised legally, giving groups the right to control what happens to the land within the borders. \"Indigenous peoples today protect 82% of the world's biodiversity. If you demarcate indigenous lands, you guarantee this area will be protected,\" he said. \"The traditional way of life of indigenous peoples protects the lands and automatically guarantees global warming will be tackled. Consequently the entire humanity benefits from it,\" he added.\n\nDinamam Tuxá from the group Articulation of Indigenous Peoples of Brazil said he is happy that more indigenous peoples are represented at COP30\n\nSome indigenous groups are attacked when they try to defend their land from cattle ranchers or groups trying to cut down trees for agriculture. On Sunday an indigenous leader from the Guarani Kaiowá community in the south of Brazil was killed during an attack, according to Survival International. Vicente Fernandes Vilhalva, 36, was shot in the head when gunmen surrounded the village, according to eyewitnesses who spoke to Survival International. Thousands protested on Saturday outside the UN's annual climate conference, with some carrying signs reading \"demarcation now\".",
  "authors": [],
  "url": "https://www.bbc.com/news/articles/c1d0vekq12ro"
}