{
  "title": "I look at a stranger and see a friend. Am I a super-recognizer?",
  "text": "When I was in my mid-20s, I spotted my grandma through the window of a coffee shop. I was dumbstruck – she had passed away the year before. I stared for a moment, then reminded myself it couldn’t be her.\n\nI’d had similar experiences all my life. Every now and then, I “recognized” someone I didn’t know. Sometimes I could quickly pinpoint who the stranger reminded me of – like my grandma. Other times, a face simply had a vague familiarity I couldn’t place.\n\nRecently, I started wondering if other people have these odd encounters. When I asked my friends, one said she frequently sees people in random places who look familiar. Others sometimes mistake a stranger or celebrity for someone they know in real life. But some reported nothing of the kind – they could easily identify people they’d met and people they hadn’t.\n\nI was intrigued by this range of experiences. Was it just yearning that made me see my grandma that day – or some kind of mental glitch? One study found we spend about 14 minutes of every hour looking at faces – do we just make mistakes sometimes? I was beginning to realize that we can all see the same face but not see the same thing.\n\nResearchers have created many tests to measure the ability to remember faces. There is a wide range: at one end are super-recognizers, who remember faces they have seen only briefly or a long time ago; at the other are people with face blindness, or prosopagnosia, who often struggle to recognize family, close friends and even themselves.\n\nSome tests also capture how good someone is at telling if they have not seen a face before. This is where I suspect I fall short. But researchers “just haven’t dug into this” as much as they’ve looked at the ability to remember a face, said Joseph DeGutis, a cognitive neuroscientist at Harvard Medical School. It does seem that the two skills use different brain processes, DeGutis noted; for instance, there is evidence that super-recognizers and prosopagnosics do about as well as each other at discerning new faces, despite their wildly different abilities to remember old faces.\n\nI was curious whether these tests would shed some light on why strangers look familiar. Was I someone who never forgets a face? I often remember people more than they remember me, and feel disappointed – a sentiment that researchers say is common for super-recognizers. But maybe I over-recognize faces – to the extent that even some new faces look familiar.\n\nDeGutis sent me several facial recognition tests. I waded through, feeling stumped at times. In one, called the Cambridge Face Memory Test, I had to look at black-and-white photos of a face from three angles, then find it in lineups. During another test that instructed me to pick out celebrities from a mix of photos, many of the faces felt at least familiar, but I couldn’t quite place them – reminiscent of my real-life experience.\n\nI felt less than confident about my performance. But DeGutis analyzed my results, and I had correctly identified 96% of the celebrity faces. He concluded that I was a “borderline super-recognizer”.\n\nI also excelled in the old/new faces task, which DeGutis said was particularly good for assessing someone’s memory for faces. The test-taker looks at a series of 60 black-and-white photos, each of a different face. Then they review a string of 120 similar photos – the original series plus 60 new faces – and indicate which were in the first set. The super-recognizer cutoff is roughly 80%; I remembered 78% of the faces I’d seen. On the other end of the spectrum, people with prosopagnosia correctly guess an average of 57%.\n\nI was pleased with my score, but also surprised. I remembered many of the old faces, but rarely mistook a new face for one that I’d seen before. My score on this measure, called the false alarm rate, was 18%. Normal recognizers, super-recognizers and prosopagnosics all have a false alarm rate of about 30% on average. So why was I mistaking a stranger’s face for my grandmother’s?\n\nDeGutis thought it was likely that I possessed some super-recognizer capacities. Everyone has a catalogue of the faces we know in our memory, but super-recognizers – and probably borderline straddlers like me – have a relatively large and high-resolution catalogue. We’re also likely to individuate faces – that is, assign traits to each face, such as friendliness or rudeness. Studies suggest that the latter helps people to learn and commit faces to long-term memory. While individuating may help me remember people, it may also trick me into seeing my grandmother in a woman who has a similar air.\n\nIn addition, DeGutis thought I might be “an active face perceiver”, meaning I pay a lot of attention to faces. Others may have more false alarm moments, thinking they recognize someone they don’t know. But because I tend to look closely at faces, I am prone to notice the stranger who resembles my grandmother. Indeed, one friend who said she doesn’t make facial recognition mistakes admitted she doesn’t really look at the people around her.\n\nThese tests helped me understand where I sat on the spectrum. But I wanted to understand more about what is happening in the brain when we “recognize” strangers. Researching further, I read about a syndrome called hyperfamiliarity for faces (HFF), in which unfamiliar faces appear familiar. On its face, this sounded like it could apply to me. But the handful of reported cases all occurred after a medical episode such as a seizure or stroke, unlike the quirk that I’ve been noticing my whole adult life.\n\nBrad Duchaine, a professor of psychological and brain sciences at Dartmouth College, runs a research site called faceblind.org, along with DeGutis and other colleagues. Through the site, he has heard from about 24,000 prosopagnosics, as well as people with all kinds of facial recognition difficulties, including visual distortions, like when faces appear to be melting. Duchaine and his lab study many of these people, using tools like the old/new faces task and the Cambridge Face Memory Test, which he helped develop.\n\nHe has heard from only a few people with possible HFF in the website’s 25-year history.\n\n“The prevalence is quite low,” Duchaine said of HFF. However, he theorized that there may be a spectrum, with some people who think every face is familiar, and others, like me, who only experience it a few times a month.\n\nJenny, a 53-year-old zookeeper in northern England, developed HFF in 2018. (She withheld her last name to protect her identity.) A couple of migraines struck her as unusual – typically, she felt pain on the right side of her head, but with these it was on the left. Not long after, Jenny and her family visited a seaside town. She had only been there a handful of times before, but every single one of the people they passed on a tram ride looked familiar. Even once back home, she was convinced she knew everyone who walked by. She even followed some to try to figure out who they were.\n\n“Many times I would walk up to someone and smile, and they just walked past me,” said Jenny. “Obviously it was a massive change.”\n\nJenny contacted faceblind.org and started talking with a researcher in Duchaine’s lab. There is no way to ease her condition, but they have helped her make sense of it. Jenny underwent a battery of face tests like I did. Not surprisingly, she had a high false alarm rate on the old/new faces test.\n\nskip past newsletter promotion Sign up to Well Actually Free weekly newsletter Practical advice, expert insights and answers to your questions about how to live a good life Enter your email address Sign up Privacy Notice: Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on theguardian.com to send you this newsletter. You can complete full registration at any time. For more information about how we use your data see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nDuchaine and his team were able to get some insight into Jenny’s HFF because of an extremely entertaining experiment their colleagues at the University of York were conducting. Subjects watched clips from Game of Thrones while undergoing FMRI scans. Some had previously seen the show, and others hadn’t. Participants who had seen it had more activity in the medial temporal lobe, a region deep in the brain that encompasses the hippocampus and is important for memory.\n\nA 2024 study suggested this region includes areas involved in recognizing familiar faces and may be where face catalogues are stored. The thinking goes that this region processes faces after the visual regions in the back of the brain study facial features such as eyes and lips and put them together into a whole-face composite.\n\nJenny joined the Game of Thrones study. Although she had never seen the show, her scans looked as if she had, lighting up in areas in the medial temporal lobe. The actors evoked similar feelings to the strangers on the street: “It was like I had memories with them, which I was looking at through a frosted window so … I couldn’t quite see what the memories were.” Similarly, when we talked over Zoom, Jenny acknowledged that we hadn’t met before but said she couldn’t shake the feeling that we had traveled together and knew each other’s families.\n\nI don’t feel overwhelmed by my false alarm encounters, but Jenny was so distraught by them that she dreaded leaving her house for a couple of years. “My brain’s firing off all these connections and memories that aren’t real, and it’s quite exhausting, actually, because there’s 100 people around you,” she said.\n\nThat feeling has eased now that Jenny lives in a less populous area. She has also developed coping strategies, such as avoiding eye contact and asking friends to send her a photo of what they’re wearing so she can find them in a crowd.\n\nOur experiences have been different, but I relate to Jenny. Many times, I have been embarrassed after smiling at someone who was probably a stranger; I now act more reserved. And despite the discomfort, we both agree that it can be comforting to see a familiar face, even if it is only a mirage.\n\nFacial recognition abilities that are a little better or worse than average may result in embarrassing, funny or stressful moments. But for those with neurological conditions such as prosopagnosia and the facial distortions Duchaine described, the experiences are regular, often highly frustrating – and even scary.\n\nAbout 2% of the population has prosopagnosia, and there’s a clear link between the condition and social anxiety, said Anna Bobak, a senior lecturer in psychology at the University of Stirling in Scotland.\n\nThey feel “anxiety or fear about negative evaluations from others” who may think they’re being rude or aloof for not recognizing people they know, Bobak said. In a recent survey that Bobak and her colleagues conducted, people with face blindness described detailed methods for recall, such as memorizing a person’s specific piece of jewellery. This survey uncovered that “one of [their] main wishes is really raising awareness … making reasonable adjustments just like for conditions such as autism and ADHD”, said Bobak.\n\nFacial recognition remains poorly understood because the roles that vision, memory and emotion play in it are still fuzzy. Super-recognizers and prosopagnosics have been studied for decades, yet researchers have only a vague idea that the former group may have more brain activity in the visual regions that process faces, whereas the latter appears to have less, Duchaine says.\n\nThe Game of Thrones research, and advances in FMRI technique, are highlighting the crucial roles emotion and memory play in facial recognition processes, as well as how the brain regions related to these functions connect with visual regions. Duchaine says he’s planning new studies with super-recognizers and prosopagnosics to explore whether emotion and memory regions also contribute to their differences in facial recognition ability.\n\nIt would be fascinating to learn more about how false alarm moments are related to enhanced activity in these regions. Hearing about the Game of Thrones experiment, I wondered if my brain would react like Jenny’s, misfiring even though I too hadn’t seen the show. And would this suggest that my experiences arise because of a tendency to make emotional connections with strangers?\n\nDeGutis had speculated that I might be particularly attuned to facial emotions. Reflecting on this, I can occasionally figure out that I mistook a stranger for someone I know because they had a similar “vibe”, like snark or eagerness. Once, an Amtrak agent looked so much like my favorite bartender that I expected him to hand me a cocktail. The more I thought about it, they seemed to share a cool nonchalance in addition to their physical similarities.\n\nI wouldn’t change my quirk of recognizing strangers. I enjoy looking at faces and recognizing familiar features or vibes. Sometimes it can be disorienting. But when I’m able to solve the puzzle – that’s who they remind me of! – it feels illuminating, even grounding. It’s like I understand both the stranger and the familiar person a little better. And now that I am more aware of the quirk, I sometimes step into a coffee shop or bar wondering if I’ll see a stranger I know.",
  "authors": [],
  "url": "https://www.theguardian.com/wellness/2025/nov/19/super-face-prosopagnosia-brain-science"
}