{
  "title": "Six ways to stay warm: how a bouncer shows winter the door",
  "text": "As someone who works in frontline security, standing outside bars, shops and night spots for up to 12 hours at a time – occasionally watching clubbers turn blue while waiting for a cab – I am well versed in the need to dress weather appropriately. With temperatures hitting freezing across the UK this week, here are my tips, tricks and product recommendations to keep the frostbite at bay.\n\nIt’s all about the base\n\nView image in fullscreen ‘Like Ready Brek for your lower end’ … merino 260 Tech thermal leggings. Photograph: Icebreaker\n\nA lot of emphasis is put on outerwear, but anyone who’s ever had to stand on a door for hours or cheer their kid on at football while stuck on a touchline will appreciate that thought being given to the inner layers, too. Decent thermal underwear is a must. Made from merino wool, Icebreaker’s 260 Tech thermal leggings were invented 30 years ago at the company’s HQ in New Zealand – one of the last pit stops for travellers before they hit Antarctica. Icebreaker leg gear is like Ready Brek for your lower end – cosiness guaranteed in minutes.\n\nFor your top half, Decathlon’s long-sleeve Simond MT500 is also made from merino and is half the price.\n\nSwap jumpers for zips\n\nIf you’re constantly moving between somewhere cold and somewhere sheltered, you might get tired of repeatedly diving through the head hole of your jumper. Zipped hoodies are what I get on with best. For chilliness indoors, the Rab Nexus is slim-fitting without being constrictive. Designed for hiking, it is also suited for those walking around city streets. And when it’s feeling truly Arctic, there’s the Power Houdi from Houdini, which is made from breathable Polartec fleece.\n\nPick your coat wisely\n\nView image in fullscreen ‘Engineered to deliver warmth’ … Aritzia’s Super Puff coat. Photograph: Aritzia\n\nThere are two approaches here. The first is to go for something ultra-thick. If you want to stay toasty with some added 90s rave nostalgia, Aritzia’s Super Puff coat, which is apparently “engineered to deliver warmth to -30C”, will give you that immersion-heater look and the glow to go with it. It’s made from tear-resistant and high-tensile Japanese fabric, is waterproof, and is stuffed with down. Think the best duvet of your life, but with side pockets and a hood.\n\nThe second approach is to choose a breathable shell. Designed by a snowboard manufacturer, the AK Cyclic Gore-Tex from Burton – a brand born in the frosty depths of Vermont – might be thinner than the wrong end of an ice skate, but it features pit vents and pockets galore (including that all-important chest pocket for your device). Just be sure to wear both of your hoodies underneath.\n\nGo fingerless\n\nView image in fullscreen A radiator, for your hands … Zippo’s 12-hour refillable hand warmer. Photograph: Zippo\n\nFingerless gloves have obvious downsides – no one likes snow getting under their nails – but remember that most of the finger still stays snug. These fingerless woollen gloves from Black Yak are extremely warm, and thankfully are available in more muted colours than so much outdoor adventure gear. You can choose from understated green, blue, brick red or charcoal, and be grateful that your exposed fingertips aren’t in mittens, meaning you can still check your messages.\n\nIf you have bad circulation or another good reason to want to keep hands hyperbolically toasty this winter, the Markhof Pro V3 photography gloves from Vallerret aren’t cheap, at almost €90 (£79), but they do cover all digits while allowing your thumb and index finger to be free to take pictures thanks to removable fingers. If that still feels too exposed, a mate of mine who rides for Deliveroo recommends Zippo’s 12-Hour Refillable Hand Warmer, which he describes as the “smartphone version of a radiator”.\n\nskip past newsletter promotion Sign up to Fashion Statement Free weekly newsletter Style, with substance: what's really trending this week, a roundup of the best fashion journalism and your wardrobe dilemmas solved Enter your email address Sign up Privacy Notice: Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on theguardian.com to send you this newsletter. You can complete full registration at any time. For more information about how we use your data see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nGaiters, hats and beanies\n\nView image in fullscreen The time for the beanie is now. Photograph: LightField Studios Inc./Alamy\n\nA grade-two buzz cut means I don’t have the option of piling up my hair like loft cladding. I need to layer up, starting with something such as OMM’S Core Beanie; it’s thin, it won’t microwave your head if you’re moving around quickly and it will sit happily under another thicker hat. And the Fisherman Beanie from Finisterre is thick but naturally breathable. Combine both with a neck gaiter – the snood scarf from Ruffnek, for example – and you achieve something approaching the insulated look of polar pioneer Matthew Henson.\n\nA soldier’s boots\n\nView image in fullscreen For the rugged … Darn Tough heavyweight socks.\n\nLike jackets, you can either go padded or non-padded for your footwear, something that depends on time spent outside and what you expect your feet to be standing in. Yorkshire-based bootmaker Altberg covers both ends of the scale. Its Norway Military boot is lined for arctic temperatures, while its SF-MK3 tabbing boot is multi-season but light, which means decent socks are required. And for that, Darn Tough’s hiking socks are as reliable as the name suggests. Want something super-tough? HJ Hall make an Indestructible sock, with a somewhat paradoxical 12-month guarantee.\n\nTo read the complete version of this newsletter – complete with this week’s trending topics in The Measure and your wardrobe dilemmas solved – subscribe to receive Fashion Statement in your inbox every Thursday.",
  "authors": [
    "George Bass"
  ],
  "url": "https://www.theguardian.com/fashion/2025/nov/20/six-ways-to-stay-warm-winter-wear"
}