{
  "title": "A Case For Cocky Black Women In Rap",
  "text": "Illustration: Benjamin Currie/HuffPost; Photo: Getty\n\nThe Healing Power Of Cocky Black Women In Hip-Hop\n\n\n\nRappers like Megan Thee Stallion, Trina and Lil Kim center and empower Black women in a world that mistakes us for side characters.\n\nBy Taryn Finley\n\nAug. 2, 2023\n\nAdvertisement\n\nWhen I was 8 years old, I dreamt of growing up to become a rapper. The idea of getting out of my shy shell and popping the biggest shit I could imagine fueled me.\n\nI started my first rhyme book, a steno notepad, because it was the first blank notebook I found in my mom’s computer room. With a glitter gel pen, I decorated the inside with lyrics about the complexities of second grade, flexed my straight As, and told a few lies I viewed as future truths about all of the popularity and money I had — as a rapper does. Sometimes I’d put on mini performances for my friends and boys I liked at recess. It was a way of using my voice in a way I had usually been shy about. But most times, I kept the words in my rhyme book since it felt like a diary.\n\n\"Remy Ma redefined ‘Conceited’ from a character flaw to a self-esteem boost. When Trina said she was a ‘five-star bitch,’ it became an affirmation for the rest of us. Rap beef aside, when Nicki Minaj’s ‘Did It On Em’ or Cardi B’s ‘Bodak Yellow’ comes on, all anxiety goes out the window, and I start to wish a hater would.\"\n\nAdvertisement\n\nAs a child with bad anxiety and people-pleasing tendencies, it was often difficult for me to tap into a sense of self-assuredness. That only worsened going into middle school, where bullying was more frequent, and the pressures to conform became more apparent. For me, the remedy to that was channeling the overconfidence and cockiness required of hip-hop — even to this day in battling imposters’ syndrome or overcoming heartbreak.\n\nWomen in rap helped transform my attitude about what I was capable of and knocked down the mental barriers that came with obstacles I faced early on. When I heard a chorus introduce Eve as “that girl,” I, too, took on the “that girl” persona. Lil Kim declaring, “I’m rich, I’ma stay that bitch” on “Queen Bitch” made me feel like the little $22.37 in my piggy bank was long money. Remy Ma redefined “Conceited” from a character flaw to a self-esteem boost. When Trina said she was a “five-star bitch,” it became an affirmation for the rest of us. Rap beef aside, when Nicki Minaj’s “Did It On Em” or Cardi B’s “Bodak Yellow” comes on, all anxiety goes out the window, and I start to wish a hater would.\n\nMegan Thee Stallion performs at Ruisrock Festival 2022 at Ruissalo Island on July 10, 2022, in Turku, Finland. (Photo by Venla Shalin/Redferns)\n\nAdvertisement\n\nScott Dudelson/Getty Images Gilbert Carrasquillo/Getty Images\n\nAnd when Megan Thee Stallion says she’s “running through yo n***a house like the Tomb Raider,” it’s a proclamation to take up space.\n\nThose may not be the literal translations of their lyrics, but music, like all art, is subjective. Hip-hop invites intrinsic confidence that takes over your movements and can sometimes feel like a spiritual practice. Singing Crime Mobb’s “Stilettos” or Latto’s “Put It On The Floor” in the car with your girls becomes the therapy you need after a long week of folks getting on your last nerve.\n\nParental advisory labels be damned, every Black girl and woman should listen to female rappers talk their shit. OK, maybe the edited version for the kids, but hear me out.\n\nAdvertisement\n\nTo be a cocky Black woman is the complete antithesis of what society demands from us. We’re expected to be overly nurturing, taking care of everyone else but ourselves and being fine with it. We’re told our beauty isn’t up to standard while our bodies and features are constantly fetishized and copied. Our voices are policed to the point of being shamed and shunned for having the audacity to speak. And we’re conditioned to see our roles as in service to men to the point that we’re pitted against each other.\n\nQueen Latifah performs in Chicago during the 2020 State Farm All-Star Saturday Night at United Center on Feb.15, 2020. (Kevin Mazur via Getty Images)\n\nParts of the genre don’t make it any better, as men have used rap to oversexualize and belittle Black women to this day. It took pioneering women like Queen Latifah asking, “Who you callin’ a bitch?” on “U.N.I.T.Y.” to challenge the background role men subjugated us to. Foxy Brown and Lil Kim helped reclaim sexual agency for women in rap while using wordplay and bravado better than the men. That legacy carries on through Cardi B and Meg’s “W.A.P.,” Lola Brooke’s “Don’t Play With It” and Sexxy Red’s “Pound Town.”\n\nAdvertisement\n\nTo this day, however, behind every confident woman rapper is a gang of sorry men complaining about what women rap about. Lest we forget that not too long ago, white folks’ complaints about gangsta rap led to the FBI surveilling rappers along with various states and networks banning certain rappers and songs altogether. And with women’s bodies and rights under critical attack today, the freedom we have to use our voices for joy, change and inspiration is a tool for our safety and sanity.\n\n\"When I heard a chorus introduce Eve as 'that girl,' I, too, took on the 'that girl' persona. When Trina said she was a 'five-star bitch,' it became an affirmation for the rest of us.\"\n\nThe voice that Black women rappers — conscious, ratchet and in between — give to us are radical affirmations of our worth and power. Without exaggeration, hip-hop saved my life, but women in hip-hop specifically helped me see me. They helped remind me of who I was and empowered me to act like it. That was true then, and it’s true now.\n\nAdvertisement\n\nBlack women didn’t just start being cocky with hip-hop, but it has been reaffirming to see reminders for us to pop our shit. Especially within recent years as we see more and more women dominate and literally save rap. City Girls, GloRilla, TiaCorine, Doechii and Flo Milli are just a few examples. This wave of so many different types of women dominating the genre — and doing it with confidence on their own terms — is nothing short of a revolution.\n\nThis story is part of a HuffPost series celebrating the 50th anniversary of hip-hop. See all of our coverage here.",
  "authors": [],
  "url": "https://www.huffpost.com/entry/cocky-black-women-rappers-hip-hop-anniversary_n_64c2a2bee4b0fd06594a0250"
}