{
  "title": "Bipartisan push to reform censure process emerges in Congress after flurry of complaints brought against lawmakers",
  "text": "Lawmakers on both sides of the aisle are now pushing to make the censure process more difficult after the House weighed three separate complaints against sitting members this week.\n\nHouse Speaker Mike Johnson said Thursday he is “very interested in raising the threshold” of votes to censure a member, expressing support for a bipartisan proposal to raise the threshold from a simple majority to 60% of the House.\n\n“I think censure is an extraordinary remedy, extraordinary cases, it should be used sparingly, as it has been over the history of this institution,” Johnson said.\n\nUS House Minority Leader Hakeem Jeffries speaks during a press conference on Capitol Hill in Washington, DC, on Thursday. Tom Brenner/Reuters\n\nHouse Minority Leader Hakeem Jeffries expressed similar sentiments Thursday, saying, “That process needs to be brought under control” and that he is “open-minded” about raising the threshold.\n\nHowever, the minority leader squarely blamed Republicans, describing their censure efforts as “extreme.”\n\nOnce considered rare in the House chamber, censure has been used more frequently in recent years and amounts to a significant rebuke of a member of Congress. This week alone, lawmakers had already weighed three different complaints in just as many days.\n\nRep. Jesus “Chuy” Garcia speaks during a press conference in Broadview, Illinois, on June 18. Octavio Jones/Reuters/File\n\nOn Tuesday, retiring Democratic Rep. Chuy García of Illinois was censured for allegedly coordinating his own retirement to ensure his hand-picked replacement would win his seat next year. It was fellow Democrat, Rep. Marie Gluesenkamp Perez of Washington, who forced the House to take up the symbolic resolution against García, infuriating members of her party.\n\nUltimately, 22 Democrats voted with Gluesenkamp Perez to reprimand Garcia, along with 213 Republicans.\n\nRep. Stacey Plaskett speaks during a mark up meeting with the House Budget Committee on Capitol Hill on May 16, in Washington, DC. Anna Moneymaker/Getty Images\n\nThe same day, a vote to censure Democratic Del. Stacey Plaskett, for texting convicted sex offender Jeffrey Epstein during a 2019 congressional hearing, failed on a 209-214 vote. Three Republicans joining Democrats in opposing the measure and three Republicans registering as “present.”\n\nIf the vote to censure Plaskett had passed, Democrats had planned to bring up a resolution against Florida GOP Rep. Cory Mills, who has faced a swirl of controversies in his time in Congress, including an allegation of assault against Mills and accusations from an ex-girlfriend that he threatened to release sexually explicit images and videos of her.\n\nRepresentative Cory Mills attends a House Task Force hearing on Capitol Hill in Washington, DC, on September 26, 2024. Piroschka Van De Wouw/Reuters\n\nBut on Wednesday, Republican Rep. Nancy Mace of South Carolina brought a complaint against Mills, pointing to individuals who served with Mills in the Army disputing his version of events that led him to be recommended for the Bronze Star, which was reported on by NOTUS. The complaint was referred to the House Ethics Committee after a vote to censure him failed despite seven Republicans joining Mace in favor of the measure.\n\nIn response to the wave of complaints this week, Democratic Rep. Don Beyer and GOP Rep. Don Bacon have sponsored a bill to raise the threshold for a censure resolution to 60%.\n\n“I just think we’ve got out of control,” Bacon said Thursday. “It should be more bipartisan when we do one.”\n\nCNN’s Alison Main, Aileen Graef, Sarah Ferris, Ellis Kim and Arlette Saenz contributed to this report.",
  "authors": [
    "Kaanita Iyer"
  ],
  "url": "https://www.cnn.com/2025/11/20/politics/censure-process-congress-bipartisan-reform"
}