{
  "title": "Le foreste in fiamme sono fuori controllo. Come gli incendi hanno trasformato la mappa della deforestazione globale",
  "text": "Dal 2009 mostrano un trend in aumento, dal 2022 una vertiginosa crescita. Gli incendi sono diventati la principale causa di deforestazione. Solo nel 2024 ne hanno distrutto quasi 14 milioni di ettari, più del doppio di quelli divorati dall’agricoltura permanente, il secondo più potente fattore di deforestazione globale. I dati dell'organizzazione Global Forest Watch parlano chiaro, la crisi mondiale delle foreste sta assumendo nuove forme, ridisegnando le geografie di interi continenti e di singoli Paesi.\n\nDi pari passo urge adeguare anche le strategie di intervento, i leader mondiali ne stanno discutendo a Cop30, la trentesima Conferenza del clima delle Nazioni unite a Belém (Brasile), in questi giorni. Partono da una distruzione forestale attualmente del 63% superiore a quanto necessario per raggiungere gli impegni globali di fermare e invertire la deforestazione entro il 2030. Dove arriveranno?\n\nL’ascesa inesorabile del fuoco\n\nL’analisi temporale delle cause di deforestazione globale da inizio secolo a oggi mostra un panorama in trasformazione, gradualmente ma inesorabilmente. A crescere sono solo gli incendi e la loro recente accelerazione ribalta le priorità di prevenzione e intervento. “Negli ultimi anni il fenomeno è diventato allarmante - osserva Sheam Satkuru, direttore esecutivo dell’Organizzazione internazionale per il legname tropicale -. Il cambiamento climatico sta indubbiamente amplificando il problema: temperature più elevate, stagioni secche prolungate e modelli di precipitazioni inediti stanno creando condizioni in cui anche piccole fonti di fiamme possono degenerare rapidamente e in modo incontrollabile.”\n\nMa le cause non sono esclusivamente climatiche. La convergenza di diversi fattori sta creando una tempesta perfetta. In alcune regioni, le pressioni socio-economiche stanno contribuendo ad aumentare il rischio. Le pratiche di disboscamento non regolamentate continuano a fare affidamento sull’uso del fuoco, spesso senza adeguate misure di sicurezza. L’invasione di paesaggi boschivi e l’espansione agricola, combinati con una pianificazione inadeguata dell’uso del suolo, stanno mettendo comunità ed ecosistemi in posizioni sempre più vulnerabili.\n\nParticolarmente critica è la carenza di capacità istituzionale. Molti paesi mancano di risorse sufficienti per il rilevamento precoce, il monitoraggio e la risposta rapida, permettendo agli incendi di diffondersi su aree vastissime. L’anno scorso, le immagini satellitari hanno catturato incendi che si sono propagati dal Brasile alla Bolivia e oltre, creando un’emergenza ambientale regionale di proporzioni senza precedenti.\n\nAnatomia globale della crisi\n\nLe diverse cause di sofferenza delle principali nazioni forestali del mondo illustrano la complessità delle sfide in corso. La Russia, con i suoi 833 milioni di ettari (secondo i dati Fao ha la più vasta estensione forestale al pianeta ) sta affrontando una crisi nelle sue foreste boreali. Incendi senza precedenti, infestazioni di parassiti guidate dal riscaldamento climatico e il disgelo del permafrost stanno destabilizzando ecosistemi che sono rimasti relativamente intatti per millenni.\n\nIl Canada, con 369 milioni di ettari, sta vivendo una trasformazione drammatica delle sue foreste boreali. Le stagioni degli incendi si sono intensificate in modo allarmante negli ultimi anni, con vasti territori che bruciano simultaneamente da costa a costa. Il riscaldamento delle regioni settentrionali sta procedendo a un ritmo doppio rispetto alla media globale, creando condizioni che favoriscono incendi più frequenti e devastanti. Inoltre, le infestazioni di parassiti come il coleottero del pino stanno uccidendo milioni di ettari di foresta, lasciando dietro di sé materiale altamente infiammabile che alimenta ulteriori incendi.",
  "authors": [
    "Marta Abbà",
    "Riccardo Saporiti"
  ],
  "url": "https://www.wired.it/article/deforestazione-mappa-incendi-cop30/"
}