{
  "title": "Leading Power Sector Companies Reveal Blueprint for Infrastructure Upgrade",
  "text": "The International Renewable Energy Agency (IRENA) forecasts 91% of global electricity to come from renewables by 2050, primarily from solar photovoltaics and wind energy, making large-scale renewables projects and the connection of large consumer loads a priority for the energy transition. Despite the record addition of around 582 GW of new renewable power capacity in 2024, achieving the global target of 11.2 terawatts of renewables capacity by 2030 still requires addressing major gaps.\n\nCurrently, lagging infrastructure development and inefficiencies in power grids represent some of the barriers to meet electricity demand and of the energy transitions. Networks today are not expanding or modernising fast enough to integrate the scale of renewable power needed for the transitions.\n\nExpanding and modernising grids, as well as increasing energy storage are thus critical to triple renewables capacity by 2030. The grids which transport power from where it is produced to where it is consumed now require urgent and significant investment driven by factors including accelerating demand, increasing complexity, and aging equipment. IRENA estimates around USD 670 billion of investment is required annually between 2025 and 2030 towards strengthening electricity grids.\n\nAs a group of leading players in utilities and power sector, over 70 members and partners of the Utilities for Net Zero Alliance (UNEZA) reinforced their commitment to annual grids and renewables investment of more than USD 117 billion. Around 48% of the planned and committed investment will go into grid infrastructure, underpinning the ambitions outlined by the COP29 Global Energy Storage and Grids Pledge to add or refurbish 80 million kilometres of grids by 2040.\n\nTo date, the expansion of grids is impeded by long lead times for projects and permitting timelines. Domestic permitting processes remain the single greatest barrier to the physical establishment of new transmission lines. Supply chain constraints also pose challenges to both developed and developing economies. These barriers raise the urgent need for market reforms, workforce upskilling, de-risking investment, and expanding global manufacturing.\n\nAt a high-level roundtable organised by UNEZA and the Green Grids Initiative during the NYC Climate Week in New York, the IRENA Director-General Francesco la Camera called investments and the upgrades in global grid infrastructure as key enablers for the energy transition: “By investing more, we will send a powerful signal to markets: Grids are the backbone of the energy transition and the key to achieving our goal to triple installed renewable capacity by 2030 as mandated under the UAE Consensus from COP28.”\n\nA new report titled Delivering Large-Scale Grid Infrastructure Projects at Pace released by UNEZA members on the sidelines of the Climate Week highlights the above-mentioned barriers. The report confirms however, that delivering large-scale grid infrastructure projects—although complex and take time to develop—is feasible with significant financial investment, extensive planning, and coordination of multiple stakeholders.\n\nThe report underscores the ‘recipe’ for on-time and within-budget project delivery. This includes right permitting and regulatory approvals processes; access to adequate project financing; global supply chains; and skilled persons across value chains from conception to construction, operation and decommissioning.\n\nThe Alliance identifies key four areas of lessons learned to deliver large-scale infrastructure projects; planning, financing, supply chains, and skills. Accordingly, drawing from concrete examples of implemented projects in different parts of the world, recommendations made by UNEZA members in the report are grouped into the four areas: planning, finance, supply chains and skills. For more on large-scale grid case studies and detailed recommendations, please read the full report: Delivering Large-Scale Grid Infrastructure Projects at Pace.\n\nUnder the guidance of IRENA as Secretariat and the United Nations Climate Change High-Level Champions, UNEZA ensures a focused and strategic approach to achieving a sustainable energy future. As member of COP30 Activation Group 01, UNEZA leads with IRENA on the Plan to Accelerate Electrification Solutions and contributes to the Plan to Accelerate Solutions on Expansion and resilience of power grids.",
  "authors": [],
  "url": "https://www.irena.org/News/articles/2025/Sep/Leading-Power-Sector-Companies-Reveal-Blueprint-for-Infrastructure-Upgrade"
}