{
  "title": "Language Expert Answers English Questions",
  "text": "Transcript\n\nHi, I'm Stephen Turton, and this is Etymology Support.\n\n[upbeat music]\n\nFirst question.\n\nSamuelM80056720 asks,\n\nI have a semi-serious question for etymologists.\n\nIf feet is the plural for foot,\n\nwhy is beet not the plural of boot?\n\nIs it because of the vegetable?\n\nFoot belongs to a category of words\n\nthat derive from Old English in which to make the plural,\n\nyou change the vowel in the word.\n\nSo other words in this category\n\nare tooth-teeth, and goose-geese, mouse-mice.\n\nBook also used to be in this category in Old English,\n\nbut later on we regularized the spelling,\n\nso it's book-books.\n\nIf we'd kept the Old English pattern,\n\nit would now be one book, two beech.\n\nThe word boot, on the other hand, is not from Old English.\n\nIt was borrowed from French into Middle English,\n\nwhich is why it just gets the default plural -s.\n\nThere are lots of different ways of pluralizing nouns\n\nin Old English.\n\nSo you might form the plural\n\nby changing the vowel in the base word,\n\nor you might form the plural by adding a suffix,\n\nwhich could be, -as, -a, -an, -u, -ru.\n\nIn the Middle English period most of these ways\n\nof forming the plural fell out of use\n\nand the -s plural came to predominate.\n\nSo it basically replaced the old plurals\n\nfor a lot of English words just because it was easier.\n\nSharPhoe asks, Weird etymology question.\n\nWhen and why did whoops/oops\n\nbecome the default sound made when making a mistake?\n\nSo, whoops is actually more recent than you might think.\n\nThe earliest evidence we have of whoops being used\n\nin writing dates to the 19th century.\n\nIt actually seems to have been derived from oops-a-daisy,\n\nwhich we have slightly earlier evidence for.\n\nOops-a-daisy might have been\n\na kind of whimsical alteration of lackadaisy,\n\nwhich is in turn a whimsical alteration of alack-a-day,\n\nwhich is in turn a whimsical alteration of alack,\n\nwhich is a very old way of saying, oh no.\n\nThis is from the FindingFennsGold subreddit.\n\nOrigin of the word clue.\n\nClue originally meant a ball of thread.\n\nThen, during Middle English it came to be associated\n\nwith the Greek myth of Theseus\n\nwho used a ball of thread to find his way in and out\n\nof the Minotaur's Labyrinth by unspooling it on the way in\n\nand then following it back out.\n\nFrom this, a clue came to mean\n\nsomething that helped lead you to a solution to a problem.\n\nAnd that is now the only meaning\n\nwhich is common in English today.\n\nRonilBBK asks, Silent letters in words\n\ndon't make any sense.\n\nHow about you just don't add the letter in the word?\n\nSo there are a couple of reasons\n\nthat silent letters exist in English.\n\nOne is that the pronunciation of the language has changed\n\nand the spelling system just hasn't kept up with it.\n\nFor example, the G-H in words\n\nlike through and thought and night.\n\nThe G-H exists there\n\nbecause that sound used to be pronounced.\n\nIn Old English and Middle English,\n\nthat was the velar fricative [vocalizes].\n\nEventually, because that's quite a difficult sound\n\nto pronounce, it dropped out of the language,\n\nbut we continue to spell words with that G-H\n\nthrough a process of sheer inertia.\n\nThere have been calls for spelling reform in English\n\nfor literally centuries.\n\nIn the 19th century, one author complained\n\nthat the word fish might as well be spelled G-H-O-T-I.\n\nG-H, as in the f at the end of rough,\n\nO as in the i in women,\n\nand T-I as in the sh in mention.\n\nNow, in reality no would actually spell fish this way\n\nbecause we know that there are implicit rules\n\nto where letter combinations can go in words.\n\nSo we know that G-H can stand for the sound f,\n\nbut only at the end of a word, as in rough, enough, tough.\n\nThere was also a moment in time where a word like mention\n\nwould've been pronounced ment-i-on or something like that.\n\nBut the T-I-O-N in English,\n\nif you say it enough times over and over,\n\ntion, ti-an, ti-an, chi-an, chi-an, chin, shin,\n\nit just becomes a lot easier to say shin.\n\nSo T-I I becomes sh.\n\nEase of articulation is a common trigger\n\nfor sound change in English and other languages.\n\nCrowzur asks, Why do question words,\n\nwhy, who, where, when, et cetera, all start with WW-H?\n\nSo this goes all the way back to Proto-Indo-European,\n\nwhich is the earliest ancestor of the English language\n\nand many other European and Asian languages\n\nthat etymologists have been able to reconstruct.\n\nProto-Indo-European had an interrogative stem,\n\nan element of a word that would go into building other words\n\nthat looked something like qui.\n\nAnd this and its variants were used to coin question words,\n\nAnd this qui survives into many modern languages.\n\nSo for example, in French and Spanish as Q-U\n\nas in qui, que, quando, quel.\n\nIt also survives in English as W-H.\n\nAnd the resemblance is easy to see\n\nonce you know that the original spelling\n\nand pronunciation in English was H-W, hua.\n\nNobody ever actually said wa-ha.\n\nIf you listen to older speakers today\n\nwho still pronounce the H in these question words,\n\nyou will hear that they put the H before the W.\n\nSo it's what, why, when.\n\nAt jpk_murphy asks,\n\nWonder where the word salary originated.\n\nSo the word salary comes from Latin salarium,\n\nwhich ultimately comes from sal meaning salt.\n\nIn ancient Rome, a salarium was a wage paid to somebody\n\nso that they could buy salt and other household goods.\n\nThe word salad ultimately derives from the same root, sal,\n\nbecause a salad was a cold dish that was seasoned with salt.\n\nThis comes from the etymology subreddit.\n\nWhat's going on with the word child?\n\nWhy does it pluralize into children rather than childs?\n\nChild goes all the way back to Old English,\n\nwhich had multiple methods of forming a plural.\n\nOne of the plurals for the word child in Old English\n\nwas childru.\n\nDuring Middle English, this became childre.\n\nHowever, at a later moment in time for some reason\n\npeople decided that this didn't look enough like a plural,\n\nso they added a second plural ending N,\n\nas in ox-oxen, to create the word children.\n\nSo it actually has two plural endings\n\nstacked on top of each other.\n\nIt's equivalent to saying childses.\n\nDelarosajl24 asks, Why do we call it deadline\n\nfor when something is due?\n\nWhat does death have to do with finishing projects on time?\n\nSo this is a bit of a grizzly story.\n\nDuring the American Civil War,\n\na deadline was a literal boundary around a prison\n\nthat prisoners were not allowed to cross\n\nwithout being in danger of being shot.\n\nFrom that, a deadline came to be used metaphorically\n\nto mean a point of no return.\n\nAnd that's why we get the sense of a date\n\non which something is due.\n\nJbud3570 asks,\n\nWhy are there multiple words that mean the same thing?\n\nThere are actually very few true synonyms\n\nin English or in other languages.\n\nYou know words that have exactly the same meaning\n\nin all contexts.\n\nEven if two words appear to have exactly the same meaning,\n\nthey will tend to be used in somewhat different contexts.\n\nFor example, big and large,\n\nyou could say that you have big ideas,\n\nyou're a big spender, but then you end up in big trouble.\n\nHowever, no one would say that they have large ideas,\n\nthey're a large spender, or they end up in large trouble.\n\nAnd that's because we're very comfortable using the word big\n\nin literal and figurative contexts,\n\nbut we prefer to use the word large\n\nonly with its literal meaning.\n\nSometimes multiple synonyms exist\n\nbecause of language borrowing.\n\nFor example, in English we have the words\n\nkingly, royal, and regal.\n\nThey all mean the same thing,\n\nbut kingly comes from English king,\n\nroyal comes from French roi, meaning king,\n\nand regal comes from Latin rex, also meaning king.\n\nDworkphone asks, Is there any reason\n\nfor the alphabet being in the order it's in?\n\nThe clue is in the name.\n\nThe word alphabet comes from alpha beta,\n\nwhich are the first two letters of the Greek alphabet,\n\nand they correspond to Latin A and B.\n\nExactly how the letters ended up in this order,\n\nA, B, C, or alpha, beta, gamma,\n\nor ah, ba, ca, or ah, ba, ga is not known.\n\nIt might have been random to an extent,\n\nbut it's also worth noting that a lot of these sounds\n\nare the first sounds that human babies make\n\nwhen they first start babbling,\n\na, a, ba, ba, ga, ga, ca, ca, da, da.\n\nThe Latin alphabet ultimately derives\n\nfrom the Greek alphabet,\n\nwhich in turn ultimately derives\n\nfrom the Phoenician alphabet.\n\nAnd in all of these alphabets,\n\nthe letter orders starts out in the same way,\n\nalthough the sounds attached to those letters\n\naren't exactly the same.\n\nWhen the Latin alphabet spread to other languages\n\nin Europe and beyond,\n\nthey tended to keep the same order of letters.\n\nThis is a question from Quora.\n\nWhy do some languages have formal\n\nand informal versions of you, but English does not?\n\nThere's a bit of backstory to this question.\n\nInitially, English had two second-person plural pronouns,\n\nthou and you,\n\nThou was for addressing a singular person,\n\nyou was for addressing more than one person.\n\nHowever, over time, because of the influence\n\nof French in which the plural pronoun vu\n\ncan also be used as a polite pronoun,\n\nyou became a respectful way\n\nof addressing a single person as well.\n\nAnd at that point, thou started to fall out of use.\n\nBecause if you was the respectful way\n\nof addressing one person, then if you called someone thou,\n\nit implied that you disrespected them.\n\nSo after that happened,\n\nthou eventually fell out of the language.\n\nSo English was left with you\n\nas its only second-person plural.\n\nObviously, the problem with this\n\nis you can no longer easily distinguish\n\nbetween singular and plural.\n\nWhat some people have since done\n\nis they have coined new second-person plural pronouns\n\nlike y'all and yinz in Pittsburgh,\n\nand yous which is used in Scotland\n\nand Ireland and some other places.\n\nGanson asks, Why do we say it's raining cats and dogs,\n\nbut not any other animals?\n\nThere are a couple of theories about\n\nwhere this expression came from.\n\nSome people say that it's because medieval people\n\nused to keep their livestock and pets on the roof\n\nand during heavy rain they would fall through the thatch.\n\nSeems unlikely.\n\nOther people say it's because during heavy rains\n\ndead animals in the gutters of London\n\nwould float down the streets.\n\nBut it's worth noting that there is an earlier idiom,\n\nwhich is they agree like cats and dogs,\n\nwhich means two people don't agree at all,\n\nthey're constantly fighting.\n\nSo it's possible that that meaning\n\nthen informed the expression it's raining cats and dogs,\n\nas in it's raining so hard,\n\nit's like the weather is fighting outside.\n\nYokernat asks, Does the language you speak\n\nmake you feel and think differently?\n\nAnd if, how so?\n\nSo, linguistic determinism is the technical term\n\nfor the belief that the language we speak\n\nfundamentally controls and limits the way we can think.\n\nIn the strong form, this obviously isn't true.\n\nIf it were true,\n\nwe would never be able to learn a new concept\n\nunless we already knew the word for them,\n\nand we also wouldn't be able to learn a second language\n\nunless it's vocabulary mapped\n\nexactly onto our first language.\n\nBut there is a weaker version of this hypothesis\n\ncalled linguistic relativity,\n\nwhich is just the suggestion that yeah,\n\nmaybe language does affect the way we think to an extent.\n\nAnd there is some evidence for this.\n\nFor example, some linguists did a study\n\nwhere they showed native speakers of German and Spanish\n\na series of pictures of objects.\n\nAnd it just so happened that those objects\n\nhad names in Spanish and German\n\nthat had different grammatical genders in the two languages.\n\nAnd what they found was when they asked speakers\n\nof those languages to describe the objects they saw,\n\nthe speakers would tend to use adjectives\n\nthat reflected certain cultural gender stereotypes.\n\nSo for example, they showed them a picture of a bridge.\n\nIn Spanish a bridge is puente, which is masculine,\n\nand Spanish speakers tended to describe the picture they saw\n\nas big and strong.\n\nBut when they showed the same picture to German speakers\n\nfor whom bridge is brucke, which is feminine,\n\nthose speakers tended to say\n\nthat the bridge was beautiful or elegant.\n\nSo clearly there is some bias\n\nthat goes into how we think about language,\n\nbut that doesn't mean that a speaker of German\n\nwould be incapable of imagining a bridge as masculine.\n\nSometimes you see posts on social media of people saying,\n\nHere's this word in my language\n\nthat is untranslatable into other languages.\n\nWelsh word hiraeth, which means a sense of longing\n\nfor something, possibly home, possibly something else.\n\nBut the thing is you can actually translate\n\nthese words into other languages.\n\nI just translated hiraeth into English,\n\nI just have to use a sentence\n\nrather than an individual word.\n\nBut clearly we can translate concepts\n\nfrom one language into another.\n\nJust because we don't have a direct single word for it\n\ndoesn't mean that we can't fully grasp what it means\n\nin another language.\n\nAnd if we really want to,\n\nwe can always just borrow that word\n\nfrom another language into our own.\n\nAXDAJQ asks, Why do we say break a leg\n\nto wish someone good luck?\n\nWouldn't breaking a leg be the opposite of good luck?\n\nThe expression break a leg originates in the theater\n\nwhere superstitious actors thought it was bad luck\n\nto wish someone good luck\n\nand good luck to wish someone bad luck.\n\nDerekAtTheChase asks, I am curious.\n\nHow do etymologists/wordsmiths\n\ndetermine the pronunciation of Old English words?\n\nThinking emoji.\n\nSo there are a number of ways etymologists do this.\n\nOne thing is that luckily Old English\n\nwas a lot more phonetic in its writing system\n\nthan modern English is.\n\nThere was much closer match between how words were spelled\n\nand how they were pronounced.\n\nOld English also borrowed its alphabet from Latin,\n\nand it happens that a lot of the sounds those letters had\n\nin Latin are the same sounds they then had in Old English,\n\nwhich makes it a lot easier.\n\nWe know what modern German and Dutch sound like.\n\nWe know what modern English sounds like.\n\nSo from that we can reconstruct what earlier forms of words\n\nin those languages might have sounded like\n\nand how they might have diverged\n\nbased on regular processes of sound change.\n\nFor example, we have the word night in modern English.\n\nIt's spelled N-I-G-H-T.\n\nIn Old English, it was typically spelled N-I-H-T.\n\nWe know that the German word for night is nacht,\n\nwhich has this velar fricative sound at the end [vocalizes].\n\nAnd so based on the spelling in Old English\n\nand the fact that this velar fricative sound\n\nhas survived in other Germanic languages,\n\nwe can conclude that in Old English\n\nnight was pronounced nicht.\n\nJakeUnusual asks, How do new words form,\n\nget approved, and get added in the dictionary?\n\nOkay.\n\n[book slams]\n\nThis is volume one of The OED.\n\nIt goes from A to bouzouki.\n\nI couldn't bring the whole thing with me\n\nbecause it is 20 volumes long.\n\nThe Oxford English Dictionary is an attempt\n\nto document every word pretty much\n\nused in the English language\n\nfrom the year 1150 to the present day,\n\nwhich is why it keeps getting longer and longer.\n\nSo in theory, words should never be taken out\n\nof The Oxford English dictionary,\n\nalthough in practice sometimes they are.\n\nSo this is basically the mother of all dictionaries\n\nin English.\n\nAny word that enters the language\n\nand gets used by enough people\n\nand stays in the language for long enough\n\nwill be added to the OED eventually.\n\nQuo210 asks, Why do Americans say the bee's knees\n\nto refer to something amazing?\n\nThe bee's knees originated in the 1920s\n\nin the flapper culture.\n\nThat's when a woman wore long necklaces and short dresses.\n\nBee's knees was one of a number of phrases that people used\n\nto suggest that something was beyond compare.\n\nAnother one is cat's pajamas, which still survives,\n\nbut there are also a host of others that we no longer use\n\nlike the eel's ankle, the sardine's whiskers,\n\nand the elephants in step,\n\nwhich I think we should bring back.\n\nThis question comes from the NoStupidQuestions subreddit.\n\nWhy the [beep] are pineapples called pineapples\n\nwhen they ain't got [beep] to do with pine or apples?\n\nSo, pineapple originally meant a pine cone,\n\nand when Europeans first encountered pineapples,\n\nthey thought they resembled pine cones.\n\nThat's where the word comes from.\n\nBut the apple is basically the default fruit\n\nthat Europeans use for talking about\n\nnew fruit they've encountered in other parts of the world.\n\nSo a potato used to be known as an earth apple,\n\nwhich is modeled after French pomme de terre.\n\nA tomato used to be called a love apple, no idea why.\n\nDunno what it has to do with love.\n\nThis is from the AskSocialScience subreddit.\n\nWhy did we stop using words like thou and hath\n\nand words with -eth on the end?\n\nSo words like hath, doth, goeth, words that end with T-H,\n\nreflect the original way of marking a verb\n\nto show that it had a third-person singular subject\n\nin English, so he goeth, she hath, it doth.\n\nRoundabout the Middle English period,\n\nthis -eth started to fall out of use\n\nand it was replaced by -S, so she has, he has, it does,\n\nwhich is still the form we use today.\n\nToday, we most associate words like hath\n\nwith the works of William Shakespeare\n\nor the King James Bible.\n\nBut interestingly, even though the word hath\n\nwas commonly spelled around this time in the early 1600s,\n\nit had already fallen out of use in the spoken language.\n\nSo we actually have a spelling book from this time\n\nthat tells young students\n\nthat although we write the word hath and doth,\n\nwe pronounce them as if they were written with an -s,\n\nhas and does.\n\nSo this is an instance where writing\n\nhas taken longer to catch up with the spoken language.\n\nBusy-Consequence-697 asks,\n\nDo people really use those funny collective nouns,\n\nmurder of crows, et cetera?\n\nI mean, I guess people can use these words\n\nif they're feeling whimsical enough.\n\nSo these collective nouns started out life\n\nin the Middle Ages as hunting terms.\n\nThat's where we get phrases like a gaggle of geese,\n\na herd of deer, and a siege of herons.\n\nThey quickly spread to other domains of use,\n\noften with humorous intentions.\n\nSo the 15th century Book of Saint Albans, for example,\n\ngives us a long list of collective nouns,\n\nincluding a drunkenship of cobblers,\n\nan eloquence of lawyers, and a superfluity of nuns.\n\nNeurotic-parents asks, How did the word okay\n\ncome to be used in so many languages\n\nwith practically the same meaning and pronunciation?\n\nOkay originated as an abbreviation of all correct\n\nin the US in the 19th century.\n\nThere is a theory that originated in the army\n\nwhere a particular general used to sign off documents\n\nas okay because he didn't know how to spell\n\nall correct properly.\n\nWe don't have any evidence of that\n\nand it seems more likely\n\nthat it was a deliberate joking misspelling of the words\n\nto indicate that actually things were just adequate\n\nrather than entirely satisfactory.\n\nThe first evidence we have for it comes from newspapers.\n\nThis is from the AskHistorians subreddit.\n\nDid people actually talk how Shakespeare wrote?\n\nYes and no.\n\nPutting aside the fact that Shakespeare wrote in rhyme\n\nand iambic pentameter a lot of the time,\n\nhe also lived at a time of intense linguistic creativity.\n\nSo, writers of all kinds were eager to coin new words\n\nor use old words in new ways.\n\nSo much so that some people actually complained about this\n\nand objected to the rise of what they called inkhorn terms.\n\nAn inkhorn is a vessel\n\nin which you would keep your ink for writing.\n\nSo an inkhorn term is a word that never had any real life\n\nin the language.\n\nIt's almost as if you've just plucked it\n\nstraight from your inkwell on the end of your quill.\n\nIn everyday language,\n\nmost speakers would not have had such a vast vocabulary\n\nor contorted grammar in such unusual ways.\n\n@jesse_cassino asks,\n\nAlexa, what's the origin of the word quarantine?\n\nQuarantine comes from the French quarante, meaning 40,\n\nwhich ultimately comes from a Latin word\n\nmeaning the same thing.\n\nOriginally, a quarantine was a period of 40 days\n\nset aside for a special purpose, like fasting.\n\nIt then changed to mean a period\n\nduring which somebody was isolated from a community\n\nto prevent the spread of disease.\n\nA Quora user asks, How do words change meaning over time?\n\nSemantic change is a regular feature\n\nof all living languages.\n\nThere are a number of common processes\n\nthrough which words change their meaning.\n\nOne process is narrowing,\n\nwhich is when a word's meaning becomes more specific.\n\nSo for example, the word girl in Old English\n\nmeant a child of any gender,\n\nbut then it's meaning narrowed to mean only a female child.\n\nThe opposite process is broadening,\n\nwhich is when a word's meaning becomes more general.\n\nFor instance, the word bird used to mean a little chick,\n\na nestling, a fledgling,\n\nand it was only later that it came to mean\n\na fowl of any age.\n\nAnd at that point it started to replace the word fowl\n\nin the rest of the English language.\n\nAnother process is amelioration,\n\nwhich is when a word's meaning\n\nbecomes more positive over time.\n\nThe word nice originally meant foolish.\n\nIt then came to mean fussy,\n\nthen it came to mean meticulous,\n\nthen it came to mean delicate,\n\nthen it came to mean attractive.\n\nThe opposite process to amelioration is pejoration,\n\nwhich is when a word gains a more negative meaning.\n\nSo kind of in the opposite process to the word nice,\n\nthe word silly used to mean holy or blessed.\n\nIt then came to mean innocent or harmless,\n\nthen it came to mean helpless,\n\nand then it came to mean foolish.\n\nThis is from the etymology subreddit.\n\nWhy does cow, pig, sheep, all have different names\n\nwhen referring to them as food, beef, pork, lamb,\n\nbut chicken, fish, or rabbit stay the same?\n\nThe words beef, pork, and mutton\n\nwere borrowed into English from French\n\nafter the Normans invaded England.\n\nAt that point in time,\n\nFrench became the language spoken by the nobility.\n\nThe author Walter Scott suggested that the reason\n\nwe had these pairs of native English words\n\nlike cow, sheep, and pig versus French words for the meat,\n\nso beef, pork, and mutton,\n\nhad to do with the fact that English-speaking peasants\n\nwould raise these livestock and then they would be eaten\n\nby the French-speaking nobility.\n\nThe reason that rabbit doesn't have a separate word\n\nis that there was no native English word for rabbit\n\nbecause they didn't exist in England\n\nuntil the Normans brought them over.\n\nTiny-Werewolf-4650 asks,\n\nWhy aren't English words pronounced\n\nas the way they are written?\n\nThere are a couple of reasons that English pronunciation\n\ndivots from English spelling.\n\nOne is sound change.\n\nWords have changed the pronunciation over time,\n\nbut we haven't updated the spelling to match.\n\nAnother reason is language borrowing.\n\nSo English has borrowed a lot of words from other languages\n\nthat have their own different spelling systems,\n\nand sometimes these spelling systems\n\nhave been partly imported into English.\n\nFor example, in English words that have P-H pronounced f,\n\nlike physics or phlegm,\n\nare all borrowed from Greek where there is no letter F.\n\nAnother reason is folk etymology,\n\nwhich is when people change the spelling\n\nor pronunciation of a word due to an erroneous belief\n\nthat it's related to another word.\n\nSo a good example of this is the word island.\n\nIsland comes from Old English iegland.\n\nIt did not have an S in Old English.\n\nBut during the Middle English period,\n\nEnglish borrowed another word meaning the same thing\n\nfrom French, isle, which English now pronounces isle.\n\nThe reason that isle or isle has an S in it\n\nis that the French word\n\nultimately derives from the Latin word insular.\n\nSo people thought, well, there's an S in insular,\n\ntherefore we should put an S in isle,\n\neven though the S was always silent\n\nin English and in French.\n\nAnd once this had taken place, people thought,\n\nWait a minute, we have these two words, isle and island.\n\nThey must be related.\n\nAnd so they inserted a silent S\n\ninto the word island as well,\n\neven though historically\n\nthere is no reason for it to be there.\n\nMecHR asks, Why is it that some sayings\n\nbetween certain languages are the same?\n\nThere could be two reasons why two languages\n\nhave very similar idioms.\n\nOne could be because there are some basic metaphors\n\nthat many languages share.\n\nFor example, the Spanish idiom [speaking Spanish]\n\nmeans literally to throw wood on the fire.\n\nIn English we would say to add fuel to the flames.\n\nBut they both mean the same basic thing,\n\nwhich is to make a bad situation worse.\n\nThe reason they could be so similar\n\nis just that the idea that conflict or danger equals fire\n\nis one that is found as a basic metaphor in many languages.\n\nAnother reason that languages could have similar idioms\n\nis because one language has just literally translated\n\nan idiom from another language.\n\nA Quora user asks, Why is the word muscle\n\npronounced mussel?\n\nSo muscle is one of a group of words in English\n\nwhere there's a silent letter in the base word,\n\nbut then that letter gets pronounced in an adjective form.\n\nOther words in this category include condemn\n\nto condemnation and phlegm to phlegmatic.\n\nThe reason for this has to do with rules\n\naround syllables structures in English.\n\nThere are certain combinations of consonants\n\nthat are not allowed to occur together\n\nat the beginning or an end of an English syllable.\n\nSo for instance, the sound sequence muscle, S-C-L,\n\nis not really permitted in English syllable structures,\n\nso instead we drop the C.\n\nHowever, in the word muscular,\n\na U is added to the middle of the word\n\nand that breaks up the syllable boundaries\n\nso that now we have mus-cu-lar.\n\nThat consonant cluster no longer exists.\n\nThe word muscle comes from Latin musculus,\n\nwhich literally translates as little mouse.\n\nApparently the Romans thought\n\nthat muscles look like small critters\n\nrunning up and down your skin.\n\nEdLincoln6 says,\n\nWords with the same spelling and pronunciation,\n\nbut different etymologies.\n\nSo these would be known as homonyms,\n\nfor instance bat as in the winged creature\n\nand bat as in the stick of word.\n\nSome of these are true homonyms,\n\nas in they come from separate roots,\n\nbut actually a lot of words that look like homonyms\n\ndo share a root.\n\nFor example, bank as in a riverside\n\nand bank the place where you keep your money,\n\nthese actually derived from the same Germanic root,\n\nwhich originally meant a slope.\n\nFrom there, it came to mean a shoreline,\n\nthe land sloping down to a river,\n\nand also a counter on which you would exchange money.\n\nColomboSabani asks,\n\nHow do etymologists even find out the meaning of the words?\n\nHow do they know where to look back to?\n\nSo, it is rare for words to appear out of nowhere.\n\nA new word is often a blend\n\nor a compound of two existing words,\n\nor it's an existing word that's changed,\n\na noun has become a verb or an adjective has become a noun.\n\nIf none of those cases apply,\n\nthen an entomologist will look at other languages\n\nthat the word might have been borrowed from,\n\nand they'll try to trace back\n\nthe earliest known use of that particular word.\n\nWhat an entomologist will have to do\n\nis to compare the word they're looking at\n\nto other words in languages they know to be related,\n\nand then reconstruct from the evidence\n\nwhat an earlier form of that word might have been.\n\nFor example, an entomologist would work out\n\nthat the word disaster in English\n\ncomes from Italian disastro.\n\nFrom there, they would work out that dis-\n\nis a negative prefix, astro means star,\n\nso disaster or disastro literally means an event\n\nthat happens under a bad star.\n\nChatongie asks, What is that R like sound I hear\n\nbetween vowels when you say something like,\n\n'Did you eat?' but sounds like, 'Did youreet?'\n\nOr, 'The idearof blah blah,' when meaning the idea of?\n\nSo this is known as intrusive R\n\nand it's a way of resolving vowel hiatus.\n\nSo vowel hiatus is when two vowels in separate syllables\n\ncome together without a consonant separating them.\n\nEnglish speakers are very uncomfortable about this,\n\nand so when it happens we'll often insert an R\n\nto break up the hiatus.\n\nSo for example, this ice cream tastes bananary.\n\nSo people will insert an R as a way\n\nof avoiding the vowels being together,\n\nfor instance in an expression like Africa and Asia.\n\nRdfporcazzo asks, Why is the letter R\n\npronounced so differently in each language?\n\nSo the letter R can be pronounced as an approximate er,\n\nas an alveolar trill [trills], as a uvular trill [trills],\n\nor as a tap [vocalizes],\n\nand that's just in languages in Western Europe.\n\nIt's thought that in the Middle Ages\n\nmost Western European languages\n\nused an alveolar trill [trills].\n\nHowever, in the early modern period\n\nthe uvular trill [trills]\n\nstarted to become fashionable in France\n\nand then later in Germany.\n\nAnd in English around the same time,\n\nthe trill [trills] was replaced with the approximate er,\n\nwhich is easier to say,\n\nalthough it doesn't sound as good.\n\nOne of the major reasons for sound change\n\nis ease of articulation,\n\nthat and changing fashions.\n\nThere's often no more logic to it than that.\n\nI hope you learned something today.\n\nThanks for listening.\n\nSee you next time.\n\n[upbeat music]",
  "authors": [
    "Condé Nast"
  ],
  "url": "https://www.wired.com/video/watch/tech-support-language-expert-answers-english-questions"
}