{
  "title": "Alex Karp Goes to War",
  "text": "Alex Karp and I would not seem to have much in common. I work for WIRED, which does tough reporting on Trumpworld; Karp is the CEO of Palantir, a $450 billion firm that has contracts with agencies like the CIA and ICE and worked for the Israeli military during its campaign in Gaza. I live in the East Village of New York City, and the home Karp spends the most time in is a 500-acre compound in rural New Hampshire. (Last year he was one of the highest paid executives in the United States.) I was a plain old English major, and he’s got a law degree and a PhD in philosophy, studying under the legendary Jürgen Habermas. I consider myself a progressive; Karp regards that stuff as “pagan religion.”\n\nBut we can bond over one shared status: Both of us are alumni of Central High School, a Philadelphia magnet school. (Not at the same time. I have some years on the 58-year-old executive.) Maybe it was that connection that led Karp to agree to a sit-down. The son of a Jewish pediatrician and a Black artist, Karp struggled with dyslexia, and at Central he seems to have turned a corner—even speculating now that overcoming the challenge helped position him for later success.\n\nWe conducted our interview at an annual gathering of Palantir’s corporate customers. The event had the giddy vibe of a multilevel marketing summit. The customers I talked to—from giants like American Airlines to relatively modest family firms—said that Palantir’s AI-powered systems are expensive but well worth it.\n\nThe Big Interview Read more deep, weird, smart conversations with the most important people in our world.\n\nNot presenting at the event are the customers who provide Palantir with the majority of its business—the US government and its allies. (The company does not do business with Russia or China.) Palantir was founded to put Silicon Valley’s innovation into defense and government technology. With coauthor Nicholas Zamiska (a Palantirian), Karp laid out his philosophy earlier this year in a book called The Technological Republic, a surprisingly readable polemic that skewers Silicon Valley for insufficient patriotism. In Karp’s view, the antiestablishment tone of Apple’s Macintosh marketing was the original sin in a tech culture that celebrates indulgent individualism and neglects nationalist concerns. At the conference, Karp, dressed in a white T-shirt and jeans, began his opening remarks by saying, “We’ve been at odds with Silicon Valley on and off since our inception 20 years ago.” In 2020, Karp moved the company headquarters from Palo Alto to Denver, whereupon it became that state’s wealthiest corporation.\n\nSome see Karp as a dystopic supervillain. He responds to those critics aggressively, bluntly, and without a shred of remorse. After years of contracts, the company has apparently proven to the government’s satisfaction that its tools can effectively leverage information on the battlefield and in intelligence operations. Palantir has a multimillion-dollar contract with ICE involving “targeting and enforcement”—essentially helping the agency to locate people for deportation. In Ukraine, Karp says with pride, the company’s products have helped deliver lethal force. Palantir has a Code of Conduct that supposedly binds the company to, among other things, “protect privacy and civil liberties,” “protect the vulnerable,” “respect human dignity,” and “preserve and promote democracy.” In an open letter last May, 13 former workers accused Palantir’s leadership of having abandoned its founding values and of being complicit in “normalizing authoritarianism under the guise of a ‘revolution’ led by oligarchs.” Karp has also revealed that other employees have left because of the company’s work with the Israel military. His retort: If you’re not generating opposition, you’re probably doing something wrong.\n\nBeneath his fiery defense of Palantir, I sense that Karp yearns to be understood. He noted that all anyone wants to talk to him about is ICE, Israel, and Ukraine. I wanted to visit those subjects, too, and we did. But our conversation also touched on Donald Trump, democracy, and his love affair with German culture. Oh, and Central High.",
  "authors": [
    "Steven Levy"
  ],
  "url": "https://www.wired.com/story/alex-karp-goes-to-war-palantir-big-interview/"
}