{
  "title": "Is phubbing ruining your relationship? Here's how to fix it",
  "text": "Is phubbing ruining your relationship? Here's how to fix it\n\n3 days ago Share Save Yasmin Rufo BBC News Share Save\n\nGetty Images\n\nWe all know our phones aren't great for our relationships, but that doesn't stop us reaching for them dozens of times a day. That's how so called phubbing - unintentionally snubbing someone in favour of your phone - creeps into everyday moments. This can impact your relationship by making partners feel ignored and parental phone use can really affect children from weakening bonds with younger kids and denting self-esteem in older ones. Rather than criticising yourself about your lack of self-control, focusing on being more intentional about when we pick up our devices can be more effective, according to one psychologist. Dr Kaitlyn Regehr, Associate Professor at University College London suggests one simple way to stop you picking up your phone mindlessly when you're with someone else.\n\nEvery time you reach for your phone, tell the other person why you're doing it, and when you're done, put it down and re-engage. It sounds almost too easy, but Dr Regehr tells Woman's Hour that this small shift can help change our behaviour as we often check messages, swipe notifications or \"Just quickly look something up\" without thinking. What matters is being transparent, so if a message pops up that you need to check, you should tell the person or people you are with: \"I just need to reply to this, then you'll have my attention again.\" By naming it - \"I need to check my train times\" or \"I'm replying to my mum\" - you interrupt the automatic habit of checking your phone and it also signals to the person beside you that they still matter. \"It stops the other person feeling ignored,\" Dr Regehr says. \"And it keeps you accountable, because you're less likely to drift into other apps or endless scrolling.\" Doing this could help improve your relationships too.\n\nGetty Images",
  "authors": [],
  "url": "https://www.bbc.com/news/articles/cx2l1zxekp3o"
}