{
  "title": "Blasfemo o coraggioso? The Carpenter’s Son, il film con Nicolas Cage riscrive la storia della sacra famiglia come un horror",
  "text": "Negli Stati Uniti è da pochissimo uscito un nuovo horror soprannaturale con Nicolas Cage, The Carpenter’s Son, incentrato su una famiglia in fuga: una giovane madre paziente, un padre anziano e ossessivo, un figlio confuso che scopre di avere poteri sovrumani. La natura di quest'ultimo spaventa gli uomini e attrae creature ultraterrene, come la misteriosa orfana chiamata “la Forestiera” scatenando violenza e follia. I nomi della donna, del falegname e di loro figlio non vengono pronunciati, ma sappiamo che sono Maria, Giuseppe e Gesù: ebbene sì, il regista e sceneggiatore Lofty Nathan ha pensato di sbarcare (quasi) a Natale nei cinema con una reinterpretazione in chiave horror della gioventù di Cristo fusa con elementi del dramma familiare e del romanzo di formazione, una sorta di La prima tentazione di Cristo. Mentre il ragazzo scopre, infatti, di possedere poteri incredibili, come quello di guarire i lebbrosi, la sua ribellione nei confronti del falegname e i conflitti tra i due si fanno sempre più duri. Man mano che il genitore perde il controllo, il ragazzo, ormai quindicenne, diventa il bersaglio di una presenza oscura che scatena visioni e possessioni terrificanti.\n\nLa Bibbia horror di Lofty Nathan\n\nQuello che inizia come un racconto laico evolve man mano in una parabola sulla fede, culminante in una delirante rappresentazione iconografica del Divino che conferisce al film un’aura arcana, alienante, acuita da un’ambientazione spoglia caratterizzata dai panorami aridi e soffocanti del deserto e dalle visioni inquietanti dei campi di tortura ed esecuzione. È un film di possessioni che non si fa problemi a mostrare infanti arsi vivi (i primogeniti sacrificati alla follia di Erode) descritti nel Vangelo, è un’origin story di un supereroe dove il confine tra ironia e serietà è imperscrutabile. Tuttavia, il regista Lofty Nathan afferma che il film è un’esplorazione della dialettica tra divino e umano, della vulnerabilità dell’anima e dimensione umana della Sacra Famiglia.\n\nll vangelo apocrifo\n\nIl film nasce dall’interesse di Nathan, nato in una famiglia copta ortodossa, per i testi apocrifi cristiani, in particolare il Vangelo di Tommaso, testo risalente al II secolo che descrive episodi controversi, fantastici e talvolta cruenti della giovinezza di Gesù. Per l’autore sono fondamentali per colmare il vuoto narrativo sulla biografia cristiana. Nathan ha scelto anche di non usare i nomi ma di chiamare i personaggi il Ragazzo, la Madre, il Falegname e così via, per conferire alla storia un tono mitico e universale. Per mantenere un senso di realismo, nonostante la componente soprannaturale, Nathan ha insistito sul realismo: ha girato su pellicola per sei settimane in Grecia, e ha collaborato con un’accademica esperta in Giudaismo antico, Katell Bethelot, per rendere credibile il contesto storico e culturale (un esempio è la rappresentazione storicamente accurata delle crocifissioni).\n\nIl cast: Nicolas Cage, Fka Twigs e Noah Jupe\n\nC’è chi ha additato la pellicola di blasfemia e chi la considera un’opera coraggiosa; tra questi ultimi c'è Nicolas Cage, anche produttore di The Carpenter’s Son. La sua versione di Giuseppe è quella di un uomo ossessionato dalla fede e dalla sua missione, quella di proteggere il figlio di Dio, estremamente intransigente come un sensei alle prese con lo studente più riottoso. Nel ruolo della giovanissima e dolce Madre troviamo la cantante britannica Fka Twigs, già apparsa nel remake di Il Corvo. Noah Jupe di A Quiet Place - Un posto tranquillo e del suo sequel è il Ragazzo tormentato dalla sua natura soprannaturale e dall’incontro con la Sconosciuta, interpretata dalla bravissima Isla Johnston, incarnazione luciferina della Tentazione. Lotfy Nathan è un regista britannico-statunitense di origine egiziana. Il suo primo lavoro importante è il documentario 12 O’Clock Boys, che racconta la cultura dei “dirt-biker”; nel 2022 ha realizzato Harka, film su Mohamed Bouazizi (l'uomo che dandosi fuoco diede inizio alla Primavera Araba) presentato a Cannes nella sezione Un Certain Regard.",
  "authors": [
    "Lorenza Negri"
  ],
  "url": "https://www.wired.it/article/the-carpenters-son-film-con-nicolas-cage-riscrive-storia-sacra-famiglia-horror/"
}