{
  "title": "Venezuela anuncia investigación tras incendio en planta de PDVSA y Maduro llama a proteger instalaciones petroleras",
  "text": "CNN Español —\n\nLa empresa estatal Petróleos de Venezuela (PDVSA) dijo este jueves que abrió una investigación para determinar las causas del incendio ocurrido el miércoles en una planta de procesamiento de petróleo, ubicada en el estado Anzoátegui, para “descartar un acto de sabotaje promovido por enemigos de Venezuela”.\n\nPDVSA informó en un comunicado, difundido en su canal de Telegram, que el incendio se produjo en el Mejorador de Petrocedeño en el Complejo Industrial José Antonio Anzóategui, en el oriente del país.\n\nDe acuerdo con la empresa estatal, cuando el incendio comenzó, “se activaron de manera inmediata las Brigadas de Emergencia de PDVSA y los Organismos de Control del estado Anzoátegui, aplicando los protocolos de seguridad industrial establecidos”.\n\nAgregó que el incendio fue sofocado totalmente y no dejó personas heridas ni afectaciones a comunidades cercanas.\n\nPDVSA dijo que la investigación sobre el incendio estará a cargo de un comité y no implicará “interrupción alguna de los procesos productivos de la industria, gracias a los planes de contingencia y previsión establecidos”.\n\nEl incendio ocurrió la tarde del miércoles y generó una alta columna de llamas y humo, así como la evacuación preventiva de trabajadores y la movilización de servicios de emergencia, reportaron la agencia Reuters y varios medios locales en el lugar.\n\nNo es la primera vez que ocurre una explosión en alguna instalación petrolera venezolana, sea un campo, una refinería o mejoradores de crudo pesado, que, en su mayoría, no han sido modernizados. Con frecuencia, el Gobierno argumenta que el sabotaje es la razón. Sin embargo, varios expertos apuntan a problemas de operación y mantenimiento.\n\nCNN contactó a la Gobernación de Anzoátegui para pedir más información y está en espera de respuesta.\n\nMaduro llama a proteger instalaciones petroleras\n\nSin hacer referencia a los hechos en Anzoátegui, el presidente de Venezuela, Nicolás Maduro, llamó este jueves a la “milicia bolivariana, cuerpos combatientes y el plan integral de defensa” a proteger las instalaciones petroleras del país y “defenderlas de la CIA”.\n\n“Cada quien defienda su espacio, las instalaciones petroleras, gasíferas, defenderlas de la CIA, la CIA que le han metido un billete y han dicho: ‘vayan para allá a dañarle la economía a los venezolanos’”, dijo Maduro en un evento en Caracas transmitido por VTV.\n\nCNN contactó a la Agencia Central de Inteligencia (CIA, por sus siglas en inglés) para solicitar comentarios sobre las palabras de Maduro y espera una respuesta.\n\nEn octubre el presidente de Estados Unidos, Donald Trump, dijo que autorizó a la CIA a operar dentro de Venezuela para controlar la inmigración ilegal y el narcotráfico provenientes de ese país.\n\nLo hizo en medio de una creciente presencia militar de Estados Unidos en el Caribe y el Pacífico en lo que Washington asegura es una operación contra el narcotráfico, dirigida especialmente al Cártel de los Soles, el cual asegura está vinculado al Gobierno de Venezuela. Caracas niega estas acusaciones y sostiene en cambio que Washington está buscando la salida de Maduro del poder.",
  "authors": [
    "Por Cnn En Español"
  ],
  "url": "https://cnnespanol.cnn.com/2025/11/20/venezuela/pdvsa-investigacion-incendio-planta-anzoategui-orix"
}