{
  "title": "NCAA currently falling short to rescind rule that would allow college athletes to gamble on professional sports, source says",
  "text": "With less than 24 hours to go before a 5 p.m. ET Friday deadline to rescind a rule that would otherwise allow college athletes to gamble on professional sports, the NCAA has a wide gap to close, a source tells CNN Sports.\n\nAs of Thursday night, 188 Division I schools had submitted the paperwork to request the recission, the source said. The magic number to stop the rule switch is 241 – or two-thirds of the 361 Division I member institutions. If that threshold isn’t met, college athletes, coaches and staff will be permitted to gamble on professional sports by Saturday morning.\n\nThe proposed switch comes at a time when sports gambling is under heightened scrutiny.\n\nIn the last month, federal authorities have arrested two Major League Baseball players (Cleveland Guardians pitchers Emmanuel Clase and Luis Ortiz), as well as Portland Trail Blazers head coach and basketball Hall of Famer Chauncey Billups, Miami Heat guard Terry Rozier and former NBA journeyman Damon Jones – all accused of taking part in separate gambling schemes.\n\nIn addition, six college basketball players have been deemed permanently ineligible for participating in game fixing activities, and Congress has called on sports leaders to ensure the integrity of sports.\n\nFor years, the NCAA held steady, prohibiting its athletes, staff and coaches from betting on any sport in which it crowned a champion. Horse racing, for example, was OK; baseball, football, basketball and hockey were not. But citing the growth in legal sports betting nationwide – now permissible in 38 states – and arguing that sports betting was now available to regular college students, the NCAA agreed to change its policy. Betting on college sports would still be against the rules.\n\nThe rule change originally was meant to go into effect on November 1 – a week after the sweeping indictments involving the NBA and members of New York crime families. While the optics weren’t good, the actual implementation of the rule was delayed because of a technicality – less than 75% of the cabinet members voted in favor of the change, triggering an automatic rescission period.\n\nThat rescission period ends Friday.",
  "authors": [
    "Dana O Neil"
  ],
  "url": "https://www.cnn.com/2025/11/20/sport/ncaa-sports-gambling-rule-recission-tally"
}