{
  "title": "Rare Klimt painting ‘Portrait of Elisabeth Lederer’ smashes auction records at $236.4 million",
  "text": "What do a notorious gold toilet and a nearly destroyed Klimt painting have in common? They christened Sotheby’s first sale out of its new US headquarters in New York on Tuesday evening in a buzzy, record-breaking night.\n\nEarly on, the headlining artwork by Gustav Klimt, “Portrait of Elisabeth Lederer,” became the most valuable work of modern art to ever sell at auction, reaching $236.4 million to gasps and applause from the room during the 20-minute bidding war. It was also the most expensive work of art ever sold by Sotheby’s globally. The portrait of Klimt’s patrons’ young daughter, made in the last years of the artist’s life, was spared from destruction during World War II when it was separated from his works that later burned during a fire at Immendorf Castle in Austria.\n\nThe lot was “really one of the last opportunities to acquire a (portrait) of this significance by the artist,” noted the auctioneer, Sotheby’s European chairman Oliver Barker, during the sale. In 2023, Klimt’s final completed portrait, “Dame mit Fächer” (Lady with a Fan),” sold for $108.4 million.\n\nThe portrait of Lederer, which beat out a previous record set by a Andy Warhol work in 2022, was part of the collection of Estée Lauder heir Leonard A. Lauder, who died earlier this year. Across the sale, most artworks met or exceeded their high estimates, including an Edvard Munch painting at $35.1 million, and a Klimt landscape at $86 million. The tone was set from the first lot, a sculpture by Alexander Calder that attracted nine eager bidders and sold for nearly triple its high estimate at $889,000. So far, Lauder’s collection fetched $527.5 million, well past its estimate of $400 million — with more to be sold during a separate daytime event.\n\nSotheby's fourth-floor Lauder gallery showed all three Klimt paintings side by side. Courtesy Sotheby's\n\nThe Lauder collection kicked off a triumphant night for the top end of the art market, which has been experiencing a slowdown for more than two years. Combined with earnings from the contemporary sale that followed, Sotheby’s raked in $706 million total in a personal best for the global auction house.\n\nThe second marquee sale was led by a monumental $48.3 million Jean-Michel Basquiat work, and also set a new record for the contemporary British painter Cecily Brown at $9.8 million. Significantly, however, two of the top lots — one by Kerry James Marshall and another by Barkley L. Hendricks — failed to sell, in a surprising divergence from the evening’s momentum. In addition, the event’s most unusual offering, the 220-pound, 18-karat gold toilet by the conceptual artist and enfant terrible Maurizio Cattelan, only drew a single bid.\n\nOne bid for ‘America’\n\nThe opulent sculpture, titled “America,” is a sibling to the infamous version, which was exhibited in the Guggenheim as a working toilet and later stolen from Winston Churchill’s birthplace, Blenheim Palace, and never found.\n\nMaurizio Cattelan’s “America” drew lines to see the golden toilet in situ. Courtesy Sotheby's\n\nIn a first, the starting bid for “America,” which has been in private hands since 2017, was ideated as a moving target according to the current value of its weight in gold, or $9.9 million and rounded up to $10 million. The pricing was a way to “lean into the very essence of the conceptual basis behind the artwork, which is largely to draw attention to the difference between a work’s artistic value, and a work’s inherent material value,” said David Galperin, Sotheby’s head of contemporary art, ahead of the sale. But only one buyer ended up making an offer — a “famous American brand,” per Sotheby’s — and no one followed, implying that bidders decided it wasn’t worth much more than its raw materials. (With fees, it totaled $12.1 million).\n\nThe mystery buyer has since been revealed as Ripley’s Believe It or Not! which made the announcement in an Instagram post, writing “we’re flush with excitement.” The American franchise company runs attractions including museums exhibiting strange and unusual artifacts. Now, the world’s most extravagant restroom fixture is being added to their display, but whether guests will be permitted to “take the ultimate golden seat” remains to be seen (for now, the team say they are “exploring possibilities”).\n\n'That's a lot of money for a toilet' Six years ago, the art world was shocked when thieves with sledgehammers stole a golden toilet by the artist Maurizio Cattelan. Now, it’s back — kind of. CNN Style writer Jacqui Palumbo went to see the artwork before it goes on sale at Sotheby's in New York. 2:26 • Source: CNN 'That's a lot of money for a toilet' 2:26\n\n﻿Marquee sales will continue to take place this week, with Sotheby’s hoping to take in more than $1 billion total by the end, based on its high estimates. The pre-sale exhibitions drew crowds to the array of artworks by Basquiat, Yves Klein, Henri Matisse, Cecily Brown and Jeff Koons — as well as lines to Cattelan’s toilet, which was installed on the Breuer Building’s fourth floor in a tiny, mirrored bathroom with a look-but-don’t-touch rule. Sotheby’s new HQ, previously home to the Whitney Museum of American Art and later, an outpost for the Metropolitan Museum of Art’s contemporary collection, has signaled a major shift in its public-facing presence, aligning itself just off the city’s famed Museum Mile, where many of its most important institutions reside.\n\nThis 1981 painting by Jean-Michel Basquiat led the contemporary sales of the night. Florian Perlot/Courtesy Sotheby's\n\nThe opening comes at a rocky time for the art market, as global sales of arts and antiques fell for a second consecutive year in 2024, according to the latest annual Art Market Report by Art Basel and UBS, and several major brick-and-mortar galleries have shuttered or shifted operations. In May, following the springtime marquee sales in New York, The Art Newspaper reported that auction houses Sotheby’s, Christie’s and Phillips saw an 8% slump in sales compared to the year prior, with top lots failing to find buyers or being withdrawn ahead of the sale.\n\nBut with the highly successful off-season sale of art collector and patron Pauline Karpidas’ surrealist works this summer, as well as reports of mid-market resilience, some analyses have cautiously pointed to a market rebound. Christie’s also fared well during its two-part 20th-century sale on Monday evening, reaching $690 million with fees — a substantial increase from 2024 — led by a $62 million Mark Rothko painting.\n\nRecord-smashing sales of individual artworks exceeding $40 million haven’t been a guarantee this year, but later in the week, Sotheby’s has another rabbit in the hat — a psychologically haunting painting by Frida Kahlo, “El sueño (La cama),” which could break Georgia O’Keeffe’s record for the most expensive artwork publicly sold by a female artist.\n\nThis article has been updated with more details of the sale, and the revelation of the buyer of Maurizio Cattelan’s “America.”",
  "authors": [
    "Jacqui Palumbo"
  ],
  "url": "https://www.cnn.com/2025/11/18/style/sothebys-klimt-cattelan-sales"
}