{
  "title": "A Councilwoman Intervened During an ICE Arrest. Then She Faced the Voters.",
  "text": "Federal agents had detained a Brazilian woman who they said was in the country illegally. After Ms. Haxhiaj arrived, she stood by the woman and her daughters, one a teenager and the other holding a baby. Ms. Haxhiaj shielded them with her arms and demanded that the agents show a warrant. After the woman was placed in an ICE vehicle, her daughters clung to the car, trying to prevent it from leaving.\n\nMs. Haxhiaj declined to describe what happened on the street, citing her ongoing court case. But body camera footage from the incident shows pushing, pulling and moments of contact between civilians, ICE agents and police officers who had been summoned by ICE to clear the crowd. At one point, officers tried to lay hands on Ms. Haxhiaj’s arms, and she shook them off. At another, her hands flew out and appeared to make contact with an officer’s chest.\n\nWhen federal agents finally drove away with the woman, her younger daughter ran after the car, crying and screaming. Police officers raced to stop her, and the teenager ended up on the ground. “She was just howling, ‘No, no, no,’” said Maydee Morales, a community activist who was there. “It’s a sound I will never forget.”\n\nThe ICE action did not result in a deportation. After four months in detention, the Brazilian woman was released and granted asylum. The police charges against her teenage daughter, for disorderly conduct and resisting arrest, were dropped.\n\nBut soon after the incident, the local police union called for an investigation into Ms. Haxhiaj’s actions, citing her “reckless interference and agitation of that crowd.” In early June, the Worcester police announced they were charging her with assaulting an officer and interfering with the police, both misdemeanors. (The department did not respond to interview requests.)",
  "authors": [
    "Jenna Russell"
  ],
  "url": "https://www.nytimes.com/2025/11/17/us/etel-haxhiaj-ice-immigration-election-massachusetts.html"
}