{
  "title": "Gayming Icon and LGBTQ+ games pioneer, Rebecca Heineman, has died",
  "text": "Rebecca Heineman, a trailblazing figure in the video game industry and a celebrated icon within the LGBTQ+ gaming community, has died after being diagnosed with cancer only last month. Heineman was crowned Gayming Icon at this year’s Gayming Awards and we were honored that she flew into LA to spend time with her extended LGBTQ+ family and receive their plaudits for an inspiring career.\n\nRebecca Heineman was an icon in every sense of the word. She first made headlines in 1980 when she became the first-ever national video game champion by winning the Space Invaders tournament held by Atari. That victory kickstarted a career that would help shape the very foundation of modern video games.\n\nAs a self-taught programmer and designer, Rebecca helped port and develop some of the most iconic games of the ’80s, ’90s and ’00s. Her fingerprints are on classics like The Bard’s Tale 3: Thief of Fate, Wasteland, and Wolfenstein 3D, amongst several other iconic titles.\n\nThroughout her life, Rebecca wasn’t just coding, she was breaking-down barriers. Rebecca was a founding member of Interplay Entertainment, one of the most influential game studios of its time with game credits such as Baldur’s Gate and Fallout to name a few.\n\nShe also spent 14 years as a senior software architect at Contraband Entertainment, and she was a senior software architect at Sony Computer Entertainment for a year in 2011 and 2012. In addition to founding her own companies like Logicware and Olde Sküül, she also consulted with companies including Electronic Arts, Gearbox, Amazon, Microsoft and Ubisoft.\n\nBut Rebecca’s legacy isn’t just about the games she made, it’s about the space she carved out for others. As an out and proud trans woman in the games industry, she was a trailblazer.\n\nDuring her time at Amazon, she was the ‘Transgender Chair’ of Glamazon, Amazon’s LGBTQ+ staff group. She held similar positions at Microsoft’s GLEAM group and Sony’s LGBTQ+ advocacy group, the Sony Rainbow Coalition. Outside of the industry, she also advocated for LGBTQ+ people by holding a board position at GLAAD.\n\nHer advocacy for LGBTQ+ inclusion, accessibility, and diversity in tech inspired countless developers and players. She didn’t just build games… she paved the way for future generations of LGBTQ+ developers to create games for years to come.\n\nHeineman publicly came out as transgender in 2003, and was married to fellow games industry legend Jennell Jaquays. Jaquays sadly died of complications from Guillain–Barré syndrome in January 2024 and in her final post on social media, Rebecca poignantly spoke of with her.\n\nRebecca was brought to public attention in the Netflix video game documentary series High Score. In episode 1, “Boom & Bust”, which charts the giddy heights and drastic falls of the the early arcade scene, Rebecca is introduced to viewers as the person who won the Atari National Space Invaders Championship in 1981 – becoming the first trans woman to dominate what we would now call esports.\n\nSource: Netflix\n\nIn October 2025, Heineman revealed that she was suffering with an aggressive cancer diagnosis and started a GoFundMe to cover medical bills. The initial campaign target was smashed within 24 hours of it going live, proving just how beloved she was. As her condition worsened, the campaign total was extended to cover the growing costs of advanced treatment.\n\nIn her last post on the platform, she posted this heartbreaking message: “It’s time. According to my doctors. All further treatments are pointless. So, please donate so my kids can create a funeral worthy of my keyboard, Pixelbreaker! So I can make a worthy entrance for reuniting with my one true love, Jennell Jaquays.”\n\nThe GoFundMe campaign remains live to cover funeral costs, please consider making a donation, if you can, to help send this true Gayming Icon off with the honor that she deserves.\n\nRebecca once said, “I code so others can dream.” The video game world is vastly more diverse and enriched from Rebecca’s work. We must take inspiration from her life and redouble our own efforts to ensure our work leaves a legacy so future generations can dream.\n\nAbout The Author",
  "authors": [
    "Robin Gray",
    ".Wp_Post_Author_Widget .Wp-Post-Author-Meta .Awpa-Display-Name A Hover Body .Wp-Post-Author-Wrap .Awpa-Display-Name A Hover Color",
    ".Wp-Post-Author-Meta .Wp-Post-Author-Meta-More-Posts A.Awpa-More-Posts Hover",
    ".Awpa-Review-Field .Right-Star .Awpa-Rating-Button Not",
    "Disabled",
    "Hover",
    "Color",
    "Border-Color"
  ],
  "url": "https://gaymingmag.com/2025/11/gayming-icon-and-lgbtq-games-pioneer-rebecca-heineman-has-died/"
}