{
  "title": "Inside Harvey: How a first-year legal associate built one of Silicon Valley’s hottest startups",
  "text": "Legal AI might not sound like the sexiest category in Silicon Valley, but Harvey‘s CEO Winston Weinberg has captured the attention of virtually every top-tier investor in the Valley. The company’s cap table reads like a who’s who of venture capital: the OpenAI Startup Fund (its first institutional investor), Sequoia Capital, Kleiner Perkins, Elad Gil, Google Ventures, Coatue, and most recently, Andreessen Horowitz.\n\nThe San Francisco-based company’s valuation skyrocketed from $3 billion in February 2025 to $5 billion in June to $8 billion in late October — a rise that reflects both the bonkers price tags awarded to AI companies and Harvey’s ability to win over major law firms and corporate legal departments.\n\nIn fact, the startup now claims 700 clients across 63 countries, including a majority of the top 10 U.S. law firms. It also says it surpassed $100 million in annual recurring revenue as of August.\n\nTechCrunch spoke with Weinberg for this week’s StrictlyVC Download podcast to ask about the wild ride that he and co-founder Gabe Pereyra have been on so far. During that chat, he shared how a cold email sent a few summers ago to Sam Altman changed everything; why he believes lawyers will benefit rather than suffer from AI; and how Harvey is tackling the technically complex challenge of building a truly multiplayer platform that navigates ethical walls and data permissioning across dozens of countries.\n\nThis interview has been edited lightly for length. For the full monty, check out the podcast.\n\nYou started as a first-year associate at O’Melveny & Myers. When did you realize AI could transform legal work?\n\nSo my co-founder was working at Meta at the time; he was also my roommate. He was showing me GPT-3, and in the beginning, I swear to God, the main use case I had for it was running a Dungeons and Dragons game with friends in LA. Then I was assigned to this landlord-tenant case at O’Melveny, and I didn’t know anything about landlord-tenant law. I started using GPT-3 to work on it.\n\nTechcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | WAITLIST NOW\n\nMy co-founder Gabe and I figured out we could do chain-of-thought prompting before that was really a thing. We created this super long chain-of-thought prompt over California landlord-tenant statutes. We grabbed 100 questions from r/legaladvice [on Reddit] and ran that prompt over them, then gave the question-answer pairs to three landlord-tenant attorneys without saying anything about AI.\n\nWe just said, “A potential customer asked this question, here’s the answer — would you make any edits or would you send this as is?” On 86 of the 100 samples, two out of three attorneys or more said they would send it with zero edits. That was the moment when we were like, wow, this entire industry can be transformed by this technology.\n\nWhat happened next?\n\nWe cold-emailed Sam Altman and Jason Kwon, who was the general counsel at OpenAI. We figured we had to email a lawyer because otherwise the person wouldn’t know if the outputs were right. On the morning of July 4 at 10 a.m. — I remember this specifically because it was July 4 — we got on a call with them and kind of the rest of the C-suite at OpenAI, and we made our pitch.\n\nDid they write a check right away?\n\nYeah. It’s the OpenAI Startup Fund [they are the second-largest investor in Harvey]. OpenAI introduced us to our angel investors at the time, Sarah Guo and Elad Gil, and then everything else from there we were doing ourselves. I actually didn’t have any friends that worked in tech. I didn’t grow up in San Francisco. I didn’t know who the top VCs were. I didn’t understand how you’re supposed to fundraise. This was all just net new to me.\n\nFor someone who wasn’t familiar with the VC scene, you’ve raised a lot of money. What enabled you to raise so much?\n\nI might say something the VC community might not love, but I strongly believe that the best way to raise money is to just make sure your company is doing super well. I think there’s a lot of advice out there about networking, but to me, the most important thing is to spend almost the entire time on your business, and then find VCs who want to do that with you.\n\nYou need to find a few partners who you think are going to go the distance with you. So, 99% of your time, focus on the business going well, and then spend time trying to find a few folks who you really think you can partner with and who will be there for you for the long run.\n\nYou hit $100 million in ARR in August. With around 400 employees, how close are you to break-even?\n\nCompute costs are more expensive for us than a lot of other things. We’re operating in more than 60 countries with data residency laws in all of them. For a long time, if you used multiple models in your product, you had to buy a bucket of compute — a minimum threshold — in every single one of those countries, even if you didn’t have enough clients yet to support that cost.\n\nGermany and Australia have incredibly strict data processing laws. You cannot send financial data outside of those countries. We’d set up Azure or AWS instances in every single one of those countries, but we’d only use them to close three or four large clients. Our margins look very good on a token basis, but they’re worse because we have to spend so much on upfront compute across so many jurisdictions. That will get solved over time.\n\nTell us about your sales process. How are you expanding globally?\n\nAt the beginning of this year, about 4% of our revenue was from corporates and 96% from law firms. Right now, 33% of our revenue is from corporates, and my gut says, by the end of the year, that looks closer to 40%.\n\nIn the beginning, we would take public litigation briefs from Pacer, find the partner who wrote it, put them into Harvey, and show them how they could argue against their own brief. That got massive attention because it was relevant to what they just did.\n\nBut what was interesting is once we got adoption at law firms, the law firms themselves would help us pitch to corporates. A firm like Latham will introduce Harvey to clients and say, “Hey, did you know this is how we can use AI to do XYZ?” So what started happening was law firms would actually help us sell to corporates because they want to collaborate in the system.\n\nYou refer to this as “multiplayer.” Can you expound on this as a growing area of focus?\n\nThis is a huge problem. You’ve seen announcements from OpenAI and Microsoft about shared threads and company memory. That’s hard — you have to get the permissioning right so agents can access the right systems. But you’re only solving it for one entity at a time.\n\nThe secondary problem we have is: How do you solve that for a company plus all its law firms? You need to get the permissioning right internally and externally. There’s a concept in law called ethical walls. Think about a law firm in the valley that works with 20 VCs. If you’re working on a deal for Sequoia, but also working on another deal for Kleiner Perkins, what happens if you accidentally give all the data on the Sequoia deal to Kleiner Perkins? Huge, astronomical problem. We have to solve internal permissioning and external permissioning so agents can work correctly, and if you get it wrong, you’re going to have disastrous impacts on the industry.\n\nHave you solved this?\n\nIt’s definitely in process. We’re doing all of the security and the permissioning first. The first version of this at scale will probably be done in December. The nice thing is because such a high percentage of our customer base are already corporates using Harvey, the security problem is much easier because they’ve already gone through security review.\n\nHow are lawyers primarily using Harvey today?\n\nNumber one is drafting. Number two is research — that’s emerging because we just have a partnership with LexisNexis. And the third is analyze. What I mean by analyze is running 10 questions over 100,000 documents, like what you do in diligence or discovery.\n\nIn the beginning, we had much more transactional use cases — M&A and fund formation. Those are still very popular, and we’re building modules specifically for those matters. The area that’s growing faster is litigation, and a lot of that is because you needed the data before you could do it.\n\nSome critics have said Harvey is just a wrapper for ChatGPT. How do you respond?\n\nThe largest advantage we have over time is two things. One, we’re collecting a tremendous amount of workflow data — what are the main use cases these models can actually do? Evaluation becomes a pretty strong moat, because how do you evaluate the quality of a merger agreement? That becomes really hard. You have to set up evaluation frameworks and agentic systems that can self-eval all the different steps.\n\nThe second strongest moat is our product is becoming very strongly multiplayer. This industry has two sides — providers of legal services and consumers. You need to build a platform that’s in between both. So far, I haven’t seen a competitor doing that. We have competitors doing what we do for law firms, and competitors doing what we do for in-house, but I haven’t seen someone build a truly multiplayer platform.\n\nIn terms of the “ChatGPT wrapper” criticism, for 2023 and 2024, a lot of the power behind the product is honestly the model, plus front-end work that makes the UI and UX easier. But if you’re trying to build something where I have 100,000 documents in this data room, 5,000 emails about this M&A, all these different statutes and codes, and I want is a system where I can ask questions over all of those pieces combined with high accuracy — that’s the holy grail. We’ve created all the pieces, and what we’ve been building for the past couple months is pulling that together.\n\nWhat’s your business model?\n\nRight now it’s mostly seats, but we’re moving to more outcome-based pricing as the workflows get more complex. You want to do both. You want outcome-based pricing for very small things that you can ensure have the exact same level of accuracy as a human, or better, with very high speed. But the reality is, you’re going to want a lawyer in the loop for so much of work.\n\nFor at least the next year or two, it’s a productivity suite sold seat-based and multiplayer between law firms and their in-house teams. Slowly over time, we’ll build more consumption-based workflows as the systems get better and more accurate than humans in some areas. But it’s not going to be like you automate an entire M&A — it’s going to be specific pieces of diligence where you can have disclosure agents automate the first pass, then have lawyers jump in and do the rest.\n\nYou mentioned to us earlier that penetration is really low in legal. How low?\n\nWhat percentage of the lawyers on Earth are using Harvey right now? It’s a super low percentage. There are 8 or 9 million lawyers on Earth. But the more interesting point is we are in the unbelievably early innings on how complex work these systems can do. They’re very helpful and people are getting incredible ROI, but if you think about what percentage of legal work these systems can do today versus what I think it can do in the next five years, it’s so much lower.\n\nThink about the use case as, what is the value per token. The legal fees for a merger could easily be tens of millions of dollars. The artifact you have after that merger is a merger agreement and an SPA — maybe 200 pages total. What is the value per token on that document that required $20 million or $30 million of legal fees to generate? Those are the types of use cases where, when I say we’re at incredibly low penetration, it’s that we aren’t at the point where you can do something like that. And the value of being able to do that accurately is incredibly high.\n\nWhat happens to junior lawyers who are no longer getting the apprenticeship they might have had in the past?\n\nI care about this potentially more than anything else at the company because I was a junior lawyer very recently. The goal of law firms in the next five to 10 years is: How fast can you train the best partners?\n\nI think right now, that’s partially the goal, but partially the goal is we hire armies of associates and bill them out a lot. Whether it’s because things become outcome-based pricing or because partners can charge more if AI systems can’t do what they do, the most important thing financially for a law firm is to make sure you’re hiring, training, and developing lawyers that get to being a partner as fast as humanly possible.\n\nIf you can build tools that can do the first pass of an M&A, that is a one-on-one tutor for a junior associate. We work with a lot of law schools. You can imagine at some point you have an AI merger that you do in Harvey — the system’s teaching you, giving you real-time feedback. That’s an incredible training system. If you can build systems that can actually do a lot of the tasks, there’s no reason you couldn’t turn that into one of the best education platforms possible.\n\nWith your valuation jumping from $3 billion to $8 billion in less than a year, what are your plans for future fundraising?\n\nFundraising large rounds is not something we have planned anytime soon. We don’t need that much money, and we aren’t burning a crazy amount. The reason I did a lot of fundraising this year is there are research directions that are going to require a lot of compute, and we wanted to prepare ourselves for that. In terms of public markets, that’s definitely what we’re interested in long term. I can’t give you anything close to a timeline, but we’re interested.",
  "authors": [
    "Connie Loizos",
    "Editor In Chief",
    "General Manager",
    "Sarah Perez",
    "Julie Bort",
    "Lorenzo Franceschi-Bicchierai",
    "Ram Iyer",
    "Anthony Ha",
    "Rebecca Bellan",
    "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var"
  ],
  "url": "https://techcrunch.com/2025/11/14/inside-harvey-how-a-first-year-legal-associate-built-one-of-silicon-valleys-hottest-startups/"
}