{
  "title": "TechCrunch Disrupt 2025 Startup Battlefield 200: Celebrating outstanding achievements",
  "text": "This year, TechCrunch Disrupt showcased the incredible talent and groundbreaking ideas of our 2025 Startup Battlefield 200 cohort.\n\nOut of thousands of applications, we selected 200 of the most promising startups, each bringing unique innovations to their respective industries. The competition culminated in an electrifying event where these startups had the opportunity to pitch and demonstrate their solutions live over three days.\n\nFrom the top 20 finalists, TechCrunch editorial selected the top five companies that then battled it out for the $100,000 equity-free prize money and the coveted Disrupt Cup. The well-deserved win went to Glīd, with a strong runner-up, Nephrogen.\n\nAmong the Startup Battlefield 200 were many industry-defining companies exhibiting and pitching on the Showcase Stage. Here are the standouts:\n\nBest Showcase Stage pitch by industry group\n\nSustainability\n\nHomeBoost provides AI-powered home energy assessments that save money, cut carbon, and boost comfort.\n\nBuilt World\n\nTechcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | WAITLIST NOW\n\nInvestwise has built an AI/ML-driven leak prevention tool for Data Centers and Commercial Buildings.\n\nConsumer\n\nRax is democratizing luxury fashion through a two-sided marketplace.\n\nEnterprise\n\nCashew Research delivers expert customer insights fast and affordably with AI-powered research.\n\nHealth\n\nAWEAR has developed an ear-worn EEG with AI coach for brainwave tracking and stress management.\n\nPolicy + Protection\n\nJustiGuide is turning immigration from bureaucratic nightmare into seamless infrastructure.\n\nBest booth — it’s a tie!\n\nBillight brought one of their light-up pool gaming systems and secured it to their pop-up banner. They are building the “Top Golf” of pool, but without having a pool table available to demo, they did what any good founder would: improvise! This was an innovative use of space and a big hit in the Expo Hall.\n\nCalificadas brought the energy, colors, and creativity all the way from Argentina to their booth setup. They demonstrated their AI-powered communication intelligence coach in an interactive way, encouraging attendees to use their platform live at the booth. They were the talk of their row, and rightfully so!\n\nSpirit of Disrupt award\n\nThe Spirit of Disrupt award goes to Manu Seve, co-founder and CEO of Sponstar, who went above and beyond to create exposure, connections, and opportunities for fellow founders through a treasure hunt she organized for weeks leading up to the event. Using her platform, the hunt served 33 participating companies, 15 side events featured 200 leads captured, over 700 locations visited (about four locations per user), and 50 prizes claimed from eight different startups.\n\n\n\nThe Startup Battlefield is more than a pitch competition; it’s an opportunity to build relationships with investors, potential customers, and fellow founders to support each other on their entrepreneurial journeys.\n\nAs we celebrate the achievements of this year’s winners, we are excited to see how they will shape their industries and drive innovation in the months and years to come. Congratulations to all the participants of the Startup Battlefield 200, and a special thank you to our judges and sponsors for their support in making TechCrunch Disrupt 2025 a resounding success.",
  "authors": [
    "Isabelle Johannessen",
    "Michael Schick",
    "Head Of The Startup Battlefield Program",
    "Startup Battlefield Operations Manager",
    "Senior Event Coordinator",
    "Sarah Perez",
    "Julie Bort",
    "Lorenzo Franceschi-Bicchierai",
    "Ram Iyer",
    "Connie Loizos"
  ],
  "url": "https://techcrunch.com/2025/11/07/techcrunch-disrupt-2025s-startup-battlefield-200-celebrating-outstanding-achievements/"
}