{
  "title": "Le iniziative promosse in Italia per la Giornata internazionale per l’eliminazione della violenza contro le donne",
  "text": "Il 25 novembre è la Giornata internazionale per l'eliminazione della violenza contro le donne. Istituita nel 1999 dall'Assemblea Generale delle Nazioni Unite in memoria delle sorelle Mirabal, tre donne uccise nel 1960 nella Repubblica Dominicana per il loro impegno politico e sociale contro la dittatura di Rafael Leónidas Trujillo. Oggi questa data è diventata uno spazio simbolico per richiamare l’attenzione su un fenomeno oltremodo diffuso, persistente e devastante, un’occasione per discutere di consenso, parità di genere, violenza di genere, femminicidio, e di cosa questa parola sottenda, cosa significhi in realtà.\n\nL’ultimo rapporto di UN Women e United Nations Office on Drugs and Crime (UNODC), ovvero “Femicides in 2023: Global Estimates of Intimate Partner/Family Member Femicides”, ha rilevato che nel 2023 circa 51.100 donne sono state uccise in casa da persone a loro strettamente legate. “85.000 donne e ragazze sono state uccise intenzionalmente nel 2023. Il 60% di questi omicidi è stato commesso da un partner intimo o da un familiare. I dati mostrano che 140 donne e ragazze muoiono ogni giorno per mano del partner o di un parente stretto, il che significa che una donna o ragazza viene uccisa ogni 10 minuti”.\n\nLa violenza contro le donne assume volti diversi e forme molteplici, permea qualsiasi condizione sociale, economica, culturale, può essere sessuale, psicologica, economica, istituzionale, fisica. Un fenomeno che in Italia, secondo i dati ISTAT, continua ad essere critico: “La violenza fisica continua a rappresentare la forma prevalente di maltrattamento, interessando quasi la metà delle vittime (39,8%), seguita dalla violenza psicologica (33,8%)”. Inoltre, “un ulteriore elemento che conferma la stabilità della dinamica della violenza riguarda il luogo in cui essa si consuma: la casa si conferma come principale scenario, indicata dal 68,7% delle vittime”.\n\nIl 25 Novembre e le iniziative sul territorio\n\nIn occasione della Giornata internazionale per l'eliminazione della violenza contro le donne 2025, il movimento femminista e transfemminista Non Una Di Meno si mobilita con una manifestazione che si terrà a Roma il 22 novembre: “In un paese che si prepara al riarmo approfondendo disuguaglianze e discriminazioni, la violenza patriarcale diventa programma di governo ed è normalizzata dalla produzione ossessiva di misure e leggi misogine e transfobiche. I dati dell’Osservatorio di Non Una di Meno registrano, tra gli altri dati, 78 femminicidi, 3 suicidi indotti di donne, 2 suicidi indotti di due ragazzi trans, 1 suicidio indotto di una persona non binaria, 1 suicidio indotto di un ragazzo ma, come sappiamo, questi numeri, di per sé eloquenti, non danno la misura di quel quotidiano sommerso e strutturale della violenza. L’approccio punitivista scelto dal Governo è pura propaganda da cui non farsi incantare: mentre mostra il pugno di ferro con l’ergastolo per i colpevoli di femminicidio, attacca i centri antiviolenza, la loro storia politica femminista, le pratiche e le metodologie per la fuoriuscita e la prevenzione della violenza di genere”.\n\nSempre a Roma il 20 novembre, da non perdere l’inaugurazione del MUPA – Museo del Patriarcato, ideato da ActionAid, ovvero \"un’esposizione immersiva che ci trasporta nel passato recente — quello dell’Italia patriarcale del XX e XXI secolo — per osservare da vicino le tracce di un sistema di potere fondato sulla discriminazione e sull’oppressione delle soggettività marginalizzate per la propria identità di genere. Reperti autentici, opere e testimonianze restituiscono l’atmosfera degli anni ’20 del 2000, tra dinamiche familiari, stereotipi di genere e violenza normalizzata. Un viaggio tra gli oggetti, i gesti e le parole che hanno plasmato la cultura patriarcale, per ricordare quanto sia necessario che resti un capitolo storico definitivamente chiuso”.",
  "authors": [
    "Lucia Tedesco"
  ],
  "url": "https://www.wired.it/article/giornata-internazionale-eliminazione-violenza-sulle-donne-2025-iniziative-italia/"
}