{
  "title": "The Best Delivery Thanksgiving Meal Kits (2025)",
  "text": "Making a full Thanksgiving feast for guests can be daunting, for some perhaps even terrifying. The world, and especially Hallmark movies, is full of holiday disaster stories: burnt turkeys, failed desserts, steamed hams. But I'm not bragging when I say that the first Thanksgiving dinner I prepared for my extended family—a little early, this year—was an unmitigated success.\n\nMy aunt couldn't stop talking about the black pepper in the biscuits and the sage on the carrots. My uncle went in for the turkey and the apple-sausage stuffing. My father didn't speak at all, unless prompted. He just ate and ate. This was a compliment.\n\nBut of course, I had cheated. I had ordered my Thanksgiving in the mail—one of the new breed of Thanksgiving meal kits.\n\nThe meal was genuinely home-cooked, of course, prepared mostly from scratch. But the entire seven-platter feast—its ingredients and recipes—had arrived two days before, in a box large enough to house a primal cut of beef. It was Thanksgiving in a box: a $200 “Chef's Table Thanksgiving” meal kit available from sister meal delivery plans Sunbasket and Gobble.\n\nThe spread from Sunbasket was vast and generous. The table contained a nearly 3-pound roast of turkey, mounds of mashed potato, pebbled cranberry compote, roasted carrots dressed in miso-sage butter, brussels sprouts dappled with pecorino romano and pancetta, an endless platter of fennel-apple-sausage-stuffing, Gruyère black-pepper biscuits caked more than an inch tall, a tureen of deep brown turkey gravy, a ginger apple crisp waiting in the wings.\n\nSunbasket is among a new bounty of meal kit companies that aim to ease the stress of the holidays by doing the planning and the shopping for you—big meal boxes tailor-made for those who still want to make a home-cooked meal but for whom the prospect of planning a vast and complicated feast is prohibitive. In fact, two weeks later I cooked another Thanksgiving meal from Blue Apron, this time for my sister's family.\n\nHere was my experience with Sunbasket and Blue Apron—and some of the other Thanksgiving meal delivery options to get your whole Thanksgiving meal delivered to your home.\n\nUpdate Nov. 18, 2025: Added a review of the Blue Apron Thanksgiving and holiday meal kit dishes, after preparing an eight-dish meal. Also updated prices, ordering deadlines, and offerings throughout.\n\nWant meal kits for more everyday occasions? See WIRED's guides to the best meal delivery services, and the best plant-based meal delivery kits.\n\nThe Blue Apron à la Carte Thanksgiving (and Holiday) Meal Kit\n\nAvailable till December 29. Order by November 19 to ensure delivery by Thanksgiving.\n\nBlue Apron, one of the OG meal kits in the US, has undergone a wholesale transformation this year. One of the biggest changes is that subscriptions are no longer required, and à la carte meal ordering is possible—indeed, it's now my favorite no-subscription meal kit offering. What this means is that for this Thanksgiving, you can order individual Thanksgiving recipe kits to prep fresh at home, without ever setting foot in a crowded grocery store.\n\nThat means roasted grape and goat cheese salad ($12), a big ol' turkey breast with gravy and cranberry sauce ($50), rosemary herb stuffing ($15), a truly excellent casserole worth of truffle-oiled Southern mac and cheese ($20), almond apple crumb pie ($15), brown butter mashed potatoes ($8), challah rolls with maple ($8) and roasted brussels sprouts with pistachios, ($10). I made all of these recipes for my sister's family and our parents, a little early this year—and it was a surprisingly delicious feast fit for at least eight people. Probably even 10, if you add an extra order of mashed potatoes.",
  "authors": [
    "Matthew Korfhage"
  ],
  "url": "https://www.wired.com/story/thanksgiving-meal-kits-2025-update/"
}