{
  "title": "'No one had the slightest idea what the book was about': Why The Great Gatsby is the world's most misunderstood novel",
  "text": "William Cain, an expert in American literature and the Mary Jewett Gaiser Professor of English at Wellesley College, agrees that Nick is crucial to understanding the novel's richness. \"Fitzgerald gave some thought to structuring it in the third person but ultimately he chose Nick Carraway, a first-person narrator who would tell Gatsby's story, and who would be an intermediary between us and Gatsby. We have to respond to and understand Gatsby and, as we do so, remain aware that we're approaching him through Nick's very particular perspective, and through Nick's very ambivalent relationship to Gatsby, which is simultaneously full of praise and full of severe criticism, even at some moments contempt,\" he says.\n\nAlamy Leonardo DiCaprio and Carey Mulligan starred in Baz Luhrmann's divisive 2013 film (Credit: Alamy)\n\nLike Smith, Cain first encountered the novel as a student. It was a different era – the 1960s – but even so, little attention was paid to Nick. Cain recalls instead talk of symbolism – the legendary green light, for example, and Gatsby's fabled automobile. It's a reminder that, in a way, the education system is as much to blame as pop culture for our limited readings of this seminal text. It may be a Great American Novel but, at fewer than 200 pages, its sublimely economical storytelling makes its study points very easy to access. Ironically, given that this is a novel of illusion and delusion, in which surfaces are crucial, we all too often overlook the texture of its prose. As Cain puts it, \"I think when we consider The Great Gatsby, we need to think about it not just as a novel that is an occasion or a point of departure for us to talk about big American themes and questions, but we have to really enter into the richness of Fitzgerald's actual page-to-page writing. We have to come to Gatsby, yes, aware of its social and cultural significance, but also we need to return to it as a literary experience.\"\n\nCain re-reads the novel every two or three years but frequently finds himself thinking about it in between – in 2020, for instance, when US President Biden, accepting the Democratic nomination at the DNC, spoke of the right to pursue dreams of a better future. The American Dream is, of course, another of Gatsby's Big Themes, and one that continues to be misunderstood. \"Fitzgerald shows that that dream is very powerful, but that it is indeed a very hard one for most Americans to realise. It feeds them great hopes, great desires, and it's extraordinary, the efforts that so many of them make to fulfil those dreams and those desires, but that dream is beyond the reach of many, and many, they give up all too much to try to achieve that great success,\" Cain points out. Among the obstacles, Fitzgerald seems to suggest, are hard-and-fast class lines that no amount of money will enable Gatsby to cross. It's a view that resonates with a mood that Cain says he's been picking up on among his students – a certain \"melancholy\" for the American Dream, the feeling fanned by racial and economic inequalities that the pandemic has only deepened.",
  "authors": [],
  "url": "https://www.bbc.com/culture/article/20210209-the-worlds-most-misunderstood-novel"
}