{
  "title": "Trump Calls Democrats’ Military Video ‘Seditious Behavior, Punishable by Death’",
  "text": "Mr. Trump has flexed his power over the military during his second term and his attempts to politicize the armed forces have become more overt. He gave a nakedly political address to military leaders and has sent troops into cities around the country. All of which surely contributed to why the Democrats made their video.\n\nAnd Ms. Slotkin told The New York Times earlier this week that she’d been hearing from active-duty troops concerned about the legality of strikes that targeted people accused of drug-smuggling by the Trump administration.\n\nMr. Trump’s series of posts about the video on Thursday accused Ms. Slotkin and her fellow Democrats of traitorous conduct. One of his posts carried his signature sign-off which usually indicates he was the actual author of the post as opposed to an aide. It read: “This is really bad, and Dangerous to our Country. Their words cannot be allowed to stand. SEDITIOUS BEHAVIOR FROM TRAITORS!!! LOCK THEM UP??? President DJT.”\n\nMr. Trump’s posts appeared at a moment when he is beset by challenges on many sides. His administration is aflame over the Jeffrey Epstein saga; he is contending with a revolt from some of the most loyal members of his party and portions of his political base; and his poll numbers have dipped considerably.\n\nHis posts instantly triggered an uproar in Washington.\n\nThe six Democrats who produced the video put out a joint statement which read, in part: “What’s most telling is that the president considers it punishable by death for us to restate the law. Our service members should know that we have their backs as they fulfill their oath to the Constitution and obligation to follow only lawful orders. It is not only the right thing to do, but also our duty.”",
  "authors": [
    "Shawn Mccreesh"
  ],
  "url": "https://www.nytimes.com/2025/11/20/us/politics/trump-democrats-sedition-death-punishment.html"
}