{
  "title": "US broadcast regulator writes to BBC over Panorama edit of Trump speech",
  "text": "US broadcast regulator writes to BBC over Panorama edit of Trump speech\n\nFCC boss Brendan Carr (L) has written to the BBC and US public service broacasters NPR and PBS\n\nThe BBC has previously stated it did not have the rights to, and did not, distribute the Panorama episode on its US channels .\n\nCarr said he wanted to determine if the BBC provided either the video or audio of the spliced speech to any broadcaster \"regulated by the FCC for airing in the US\".\n\nFederal Communications Commission (FCC) chief Brendan Carr wrote to the BBC's outgoing director general Tim Davie - and to top executives at public service broadcasters NPR and PBS, whose member stations air some BBC content.\n\nThe US broadcast regulator has written to the BBC over a Panorama episode that edited together parts of a 2021 speech by US President Donald Trump.\n\nTrump has threatened to sue over the programme, saying it defamed him. The BBC has apologised, while refusing the president's demand for financial compensation.\n\nThe broadcaster has acknowledged the edit gave \"the mistaken impression that President Trump had made a direct call for violent action\" on the day of the riot at the US Capitol building on 6 January 2021.\n\nIn Trump's speech in the Panorama episode, Trump: A Second Chance?, he said: \"We're going to walk down to the Capitol, and we're going to cheer on our brave senators and congressmen and women.\"\n\nMore than 50 minutes later in the speech, he said: \"And we fight. We fight like hell.\"\n\nIn the Panorama programme the clip shows him as saying: \"We're going to walk down to the Capitol... and I'll be there with you. And we fight. We fight like hell.\"\n\nOf the edit, Carr wrote: \"In doing so, the BBC programme depicts President Trump voicing a sentence that, in fact, he never uttered. That would appear to meet the very definition of publishing a materially false and damaging statement.\"\n\nThe letter goes on to say: \"As you may know, broadcasters regulated by the FCC have a legal obligation to operate in the public interest. Those public interest requirements include prohibitions on news distortion and broadcast hoax.\"\n\nCarr's letter also stated that he was \"writing to determine whether any FCC regulations have been implicated by the BBC's misleading and deceptive conduct\".\n\nThe BBC has said it has nothing to add to its previous public statements.\n\nLast week the corporation set out why it does not think it has a case to answer in a letter to Trump's legal team.\n\nAs well as stating it did not have the rights to, and did not, distribute the Panorama episode on its US channels, the BBC also said that when the documentary was available on BBC iPlayer, it was restricted to viewers in the UK.\n\nThe BBC letter also argued that the documentary did not cause Trump harm, as he was re-elected shortly after.\n\n\"I think I have to do it,\" Trump told reporters last weekend of his plan to take legal action. \"They cheated. They changed the words coming out of my mouth.\"\n\nFollowing his threat to sue for \"anywhere between $1bn and $5bn\", Trump was expected to speak to UK Prime Minister Keir Starmer about the issue at the weekend. Details have not yet emerged.",
  "authors": [],
  "url": "https://www.bbc.com/news/articles/cnvev26jlymo"
}