{
  "title": "Police arrest alleged mastermind of Mexican mayor's murder",
  "text": "Alleged mastermind behind Mexican mayor's murder arrested\n\nThe mayor of Uruapan, Carlos Manzo, had spoken out publicly against cartel violence\n\nMexico's security minister said the man suspected of ordering his murder had links to the powerful Jalisco New Generation Cartel (CJNG).\n\nManzo was an outspoken critic of cartel violence in his home state of Michoacán and his assassination triggered mass protests.\n\nCarlos Manzo, the mayor of Uruapan, was shot dead on 1 November at a public event marking the Day of the Dead.\n\nPolice in Mexico have arrested a man they accuse of being the mastermind behind the murder of a popular mayor.\n\n\"This arrest represents a key step in dismantling the criminal structure responsible for this attack,\" Security Minister Omar García Harfuch said.\n\nHe did not say what the possible motive of the attack may have been, but local officials in Mexico are often targeted by criminal gangs for failing to do their bidding.\n\nGarcía Harfuch said the suspect, whom he named as Jorge Amando, withholding his surname, had been the one who had ordered the deadly attack on Carlos Manzo.\n\nHe said that Jorge Amando, who is also known as The Graduate, had communicated with those who carried out the killing via WhatsApp.\n\nAccording to the official, The Graduate pressured his men to open fire on Manzo even if he was surrounded by people.\n\nThe 40-year-old mayor was attending a Day of the Dead ceremony - which honours deceased family and friends - alongside his relatives when he was shot seven times, sending bystanders running for cover.\n\nManzo had spoken out publicly about how avocado growers in the region were being extorted and threatened by criminal groups.\n\nHe had also demanded that Mexico's federal government, led by President Claudia Sheinbaum, do more to rein in cartels who hold sway in much of the state.\n\nThe Jalisco New Generation Cartel, which Mexico's security minister blamed for the attack on Manzo, engages in drug trafficking as well as kidnapping for ransom and extortion.\n\nIt is also infamous for targeting public officials who refuse to do its bidding.\n\nWhile the CJNG is thought to be the most powerful of the criminal gangs operating in Michoacán, there are many others and their fights for control of drug, arms and fuel smuggling routes often result in deadly confrontations.\n\nThe assassination of Manzo triggered mass protests.\n\nAt one large rally in Mexico City last weekend, many of the protesters carried placards with the photo of the mayor, while other held up banners reading \"we are all Carlos Manzo\".\n\nSome of the protesters clashed with police in Mexico's central Zócalo square.",
  "authors": [],
  "url": "https://www.bbc.com/news/articles/c70901djjw8o"
}