{
  "title": "This Hot Mess Of An Undergarment Finally Got The Makeover It Deserves",
  "text": "I was 9, maybe 10 years old, when menopause first entered my life. Not my own, of course, but my mother’s ― and by extension, the whole family’s.\n\nWe were somewhere along I-95, inching our way down the East Coast on a road trip to Florida, when it began in earnest. One minute, my mom was bundled in layers, hunched beneath a fleece blanket and insisting we keep the windows shut tight. The next, she’d be flinging open the car window mid-cruise, letting the cool night air slap her face as glistening beads of sweat broke across her brow. She’d stick her head out like a golden retriever, eyes closed, chasing relief.\n\nMy brother and I, in the backseat, adapted on a delay. When she was cold, we sweltered. When she burned up, we froze. It was a strange, synchronized dance of body temperature management ― a sort of familial thermoregulation improv routine. No one explained what was happening, not really. But even then, I understood that something in her body was changing, something she couldn’t quite control.\n\nAdvertisement\n\nNow, decades later, I’m sweating through my own kind of storm. I live alone in a New York City studio apartment with air conditioning that hums more than it chills. I wrote this during the hottest heat wave in 10 years, and as I work hunched over my laptop. Trying to ignore the sweat pooling behind my knees, I suddenly thought of her.\n\nMy mom. That road trip. The involuntary choreography of menopause we all danced to in the car. And I couldn’t help but wonder: Has anything actually changed since that drive to Florida? Has menopause gotten any easier for women, or are we still leaving them to quietly suffer in a fog of overheated silence?\n\nAs I recently learned, hot flashes aren’t exclusive to menopause. Women’s bodies go through massive physiological shifts across every decade. Puberty. Periods. Pregnancy. Postpartum recovery. Perimenopause. Menopause. Postmenopause. Each chapter brings its own hormonal roller coaster — and thermoregulation takes a hit almost every time. One recent study found that up to 30% of women under 40 experience heat sensitivity tied to hormonal changes, while another report showed that 75% of women over 50 experience hot flashes ― many of which last seven to 10 years, intermittently. So no, feeling hot and bothered isn’t the plight of just one age group. It can be a life-long struggle.\n\nAdvertisement\n\nWhen I found myself sweating through yet another afternoon in my sweltering apartment ― forehead damp, bra sticking to my back, inbox overflowing ― an Instagram ad touting Temperature-Regulating Underwear for Hot Flashes caught my eye. It was from ThirdLove, promoting a new collection designed to help women stay cool through hormonal hell. Bras engineered for body heat flare-ups? My own inner golden retriever was intrigued.\n\nBut since I have a family of (literally) hot girls who overheat, I roped in three generations of women in my family ― me, 28; my mom, 60; and my grandma, 80 ― to test out the bras. Together, we represented wildly different ages, expectations and hormonal journeys. It couldn’t have come at a better time since my A/C was hanging on by a thread at 83 degrees, and the city was baking under a triple-digit heat wave.\n\nWe wore them for a full week. Our reactions varied, but the experience left us with a lot to talk about.\n\nAdvertisement\n\n\"While the three of us had plenty of laughs on this bra journey, this little experiment was about more than just bonding and body-cooling,\" Rotunno writes. Photo Courtesy of Alyssa Rotunno\n\nMy mom, who’s been battling hot flashes for over a decade, was impressed; she loved the smooth, cooling back and noticed way less underboob sweat than usual. “I forgot I was even wearing it sometimes,” she admitted, which, from her, is high praise.\n\nMy grandma? A straight shooter. “It was comfortable,” she shrugged. “Maybe a little snug by the end of the day.” She’s self-described as “flat-chested” and joked she “always needs help in that department,” which made all of us laugh.\n\nAdvertisement\n\nBut her biggest endorsement came at bedtime (my grandma is of a certain generation of women who keeps their bra on at night). “No discomfort at all,” she said. “I slept in it, washed it, and put it right back on.”\n\nAs for me, I felt cool (like, actually cool) in the middle of a humid summer. The bra was snug in a secure way, keeping everything in place. And best of all? No dreaded underboob sweat stains creeping through my tank top mid-Zoom call.\n\nAnd while the three of us had plenty of laughs on this bra journey, this little experiment was about more than just bonding and body-cooling. It was about the lack of investment in what goes on women’s bodies and what actually creates positive experiences for women regardless of how largely we’re represented in American consumer culture.\n\nAdvertisement\n\nThermoregulation, hormonal shifts, temperature sensitivity ― these aren’t niche issues. They’re human issues that affect half the population, often for decades at a time. Women’s comfort is still treated like an afterthought. We live in a world where men have entire aisles of performance fabrics and cooling gear for their morning jog, but for women? We’re left to navigate pregnancy, menopause, anxiety, PCOS and postpartum recovery by layering pantyliners in our bras to soak up sweat.\n\nHealth and comfort of women has never been a priority in innovation. And that’s the issue. The research is generally grossly underfunded, the design process often ignores our bodies entirely, and the assumption is that we’ll just figure it out. Tough it out, stay quiet and adapt.\n\nBut we deserve products designed with our physiology in mind. We deserve undergarments that support us without smothering us, tools that respond to the way our bodies actually function, and daily basics that aren’t just pink-washed versions of male-centered inventions.\n\nAdvertisement\n\nI didn’t write this to review a bra (though that was fun, too). I wrote this because the conversation around women’s health and daily comfort needs to get louder, and maybe even more demanding. It’s not frivolous to want to feel good in your body. It’s not vain to expect support through life’s messiest transitions. From first periods to final hot flashes, women’s bodies are constantly evolving, and we deserve innovation that evolves with us.\n\nBecause whether you’re in your 20s anxiously sweating through a Zoom call, in your 60s navigating hot flashes, or in your 80s just trying to sleep through the night, one thing is true ― comfort shouldn’t be a privilege. It’s time we demand more than survival. We deserve comfort. We deserve innovation. We deserve to be taken seriously.\n\nWe’ve spent generations shrinking, adapting, layering and coping, quietly adjusting to products never built with us in mind. But our bodies deserve better. Our experiences deserve to be acknowledged, studied and centered.\n\nAdvertisement",
  "authors": [
    "Contributing Writer"
  ],
  "url": "https://www.huffpost.com/entry/bra-for-hot-flashes-family-experiment_n_68beedf8e4b0d24eab796284"
}