{
  "title": "Defending the digital realm: navigating cyber threats in a cloud-first world",
  "text": "By Andro Galinović, Chief Information Security Officer, Infobip\n\nMoving operations and infrastructure to the cloud has become a common strategy as businesses worldwide adopt digital transformation.\n\nThis shift promises unprecedented scalability, flexibility, and cost-efficiency. Yet, it serves as a timely reminder that cloud adoption also brings new security considerations.\n\nA new frontier: from fortress to cloud\n\nImagine a traditional on-premises setup as a medieval fortified city, equipped with familiar and reliable security measures. In this environment, businesses are aware of and understand threats and defences.\n\nHowever, firms must now accommodate remote work and utilise best-of-breed, cloud-only SaaS products. Therefore, staying within these walls is no longer feasible for companies that want to remain competitive.\n\nMoving to the cloud is inevitable and akin to relocating to an expansive, open landscape.\n\nWhile businesses gain boundless horizons and opportunities, they also face uncertainty and new security dynamics.\n\nIn this context, security is not just about reinforcing the outer walls. Instead, it is about understanding and addressing a complex array of new vulnerabilities.\n\nWhile cloud services come with their own security features, they often do not offer the level or type of protection that many organisations assume they do.\n\nSimilarly, IT professionals have been working for years to control “shadow IT,” only to see it reemerge bigger than ever with the cloud. However, to fight it means to embrace it with controls like identity federation – a system that lets users log in once through a trusted provider (like Google, Facebook, Microsoft and Octa) to seamlessly and securely access multiple services – clearly understood required permissions, and the solution maturity assessments.\n\nCloud security risks make the vendor management process even more complex. There’s a shared security responsibility that must be acknowledged and prioritised to support the business from those wanting to acquire new cloud tools and from those in IT security.\n\nThe double threat: artificially inflated traffic and account takeovers\n\nAs organisations move to the cloud, they face the threat of Account Takeover (ATO) attacks that can cause severe business impact while simplifying and improving online customer experience might lead to Artificial Inflation of Traffic (AIT), which strains resources and costs billions of dollars annually.\n\nAccount Takeover (ATO) attacks pose another significant risk across industries. ATO threats are amplified by cloud migration, as in many cases, hacking is not necessary. Cybercriminals exploit weak or stolen credentials to infiltrate systems that lack two-factor authentication (2FA), gaining unauthorised access to sensitive data and operations. Once inside, these silent intruders can steal information, execute unauthorised transactions, or even use an account as a launchpad for further attacks.\n\nATOs are like insidious saboteurs slipping into the walled city unnoticed, causing chaos and harm from within.\n\nThe cost of ATO attacks includes direct losses from unauthorised transactions and chargebacks, recovery expenses for investigations and system updates, and regulatory fines for data breaches. Significant indirect costs include the loss of customer trust and damage to brand and reputation. According to VPN Ranks, the total financial cost could reach $17 billion by the end of this year.\n\nIn a cloud-first environment, preventing such breaches requires robust authentication protocols. Multi-factor authentication (MFA), strong password policies, and the adoption of Zero Trust principles are essential tools in defending the digital realm.\n\nOn the other hand, AIT threat involves malicious actors using legitimate but well-protected systems to generate fake traffic to messaging services. Driven by bots or other automated means, AIT can wreak havoc on a business’s operations and balance sheet. According to Juniper Research, AIT hacks cost enterprises $2.1 billion in 2024.\n\nAIT attackers mimic legitimate users, flooding systems with fake account creation requests or triggering one-time passcode (OTP) authentication, resulting in unexpected costs and system strain. The fraudster partners with a rogue mobile ecosystem to intercept the traffic, with both the fraudster and the rogue mobile operator benefiting from the charges for sending but not delivering the messages.\n\nMaintaining vigilance in the cloud\n\nTransitioning to the cloud doesn’t absolve businesses of their security responsibilities. Instead, it reshapes how businesses manage those responsibilities.\n\nInfobip supports businesses and brands with the following security measures:\n\nFirst, strong and smart user authentication and authorisation.\n\nInfobip offers strong password policies, smart risk-based 2FA across multiple channels, configurable IT safe listing, CAPTCHA or SSO federation with a business’s identity provider, and configurable role-based authorisation. These measures significantly reduce the risk of account takeover attacks by making unauthorised access more difficult.\n\nSecond, traffic monitoring and anomaly detection.\n\nInfobip’s Signals system uses machine learning to identify abnormal traffic patterns. This system predicts unusual activity in real-time, such as spikes in message volumes, and proactively blocks suspicious traffic, protecting customers from fraud before it impacts their business. For many digital-native companies, this has become an essential layer of defence against fraud and abuse.\n\nThird, securing machine-to-machine (M2M) communications.\n\nWhile APIs accelerate processes and underpin digital transformation, they also pose security risks. Hackers can scrape public code repositories, such as GitHub, for embedded credentials or steal API keys. To mitigate this, Infobip offers API access security features, including multi-factor authentication and IP safe listing/geolocation access.\n\nFostering a security-first culture\n\nMany cyberattacks exploit human errors, meaning security is not just a technological challenge; it’s a cultural one.\n\nOrganisations must foster a culture of cybersecurity awareness. They must educate employees to recognise potential threats and understand their role in maintaining security.\n\nBusinesses and brands must think of their employees as citizens in their digital city, trained and ready to defend its gates. Regular training sessions, phishing simulations, and security drills can empower colleagues to act as an effective first line of defence.\n\nThriving in the cloud era\n\nWhile the cloud presents new challenges, it also offers opportunities for innovation and growth. Businesses must strike a balance between embracing these opportunities and taking proactive steps to secure their operations.\n\nBy understanding and mitigating risks, organisations can safeguard their digital transformations. Implementing robust security measures, fostering a proactive security culture, and maintaining vigilant monitoring are key strategies for thriving in this cloud-first era.\n\nDiscover how Infobip can help: https://www.infobip.com/signals.",
  "authors": [
    "Cindy Zackney",
    "Zack Whittaker",
    "Ivan Mehta"
  ],
  "url": "https://techcrunch.com/sponsor/infobip/defending-the-digital-realm-navigating-cyber-threats-in-a-cloud-first-world/"
}