{
  "title": "Saudi Arabia’s crown prince got almost everything wanted from Trump",
  "text": "Just three years ago, the US was openly reconsidering its relationship with Saudi Arabia. President Joe Biden had vowed to make Mohammed bin Salman a pariah. Even arms sales to one of America’s closest military partners were put under review.\n\nThis week, the crown prince and de facto Saudi leader walked into the Oval Office to find a different world - one where President Donald Trump defended him so forcefully that he scolded a reporter for “embarrassing our guest” when she pressed him on the murder of Washington Post columnist Jamal Khashoggi.\n\nBeyond the Oval Office theatrics, the substance of the administration’s announcements tells the real story of bin Salman’s remarkable rehabilitation in Washington. It also highlights Trump’s willingness to move past the Khashoggi episode and deepen relations with a kingdom that has pledged nearly a trillion dollars in US investments and maintains business ties with his own family.\n\nThe visit also underscores the crown prince’s growing clout and his ability to skillfully navigate great power rivalries to his advantage.\n\nPerhaps his biggest win was persuading Trump to drop the one condition Washington had long insisted on before sealing major defense and trade deals with Riyadh: Full normalization with Israel.\n\nThe shift marks another reversal from just a year ago, when the Biden administration insisted that any comprehensive US-Saudi deal could only move forward if all three of its components – bilateral defense and trade agreements, Saudi normalization with Israel, and an Israeli commitment to a pathway to a Palestinian state – advanced together. But with Israel rejecting the prospect of a Palestinian state and Saudi Arabia refusing to soften its position, the framework stalled.\n\nNow, the Trump administration appears to have decoupled those components, handing Riyadh most of what it has long sought on defense, economics and regional security.\n\nThis week it designated Saudi Arabia a Major Non-NATO Ally, moved forward with plans to sell it F-35 jets “pretty similar” to those flown by Israel, and signed a new Strategic Defense Agreement.\n\nIn a nod to Riyadh’s singular focus to rewire its economy away from oil dependence, the two countries launched an AI cooperation framework which includes clearing of the sale of advanced chips to the kingdom, signed a critical minerals agreement, and opened the door to expand cooperation on nuclear energy.\n\nTrump also delivered on bin Salman’s regional requests as the crown prince tries to reshape the Middle East’s security landscape, agreeing to help end the civil war in Sudan\n\nIn the Oval Office, bin Salman framed the new agreements as delivering benefits for both the US and Saudi Arabia.\n\n“Today is a very important time in our history,” bin Salman said in the Oval Office on Tuesday, seated beside Trump.\n\nUS President Donald Trump meets Saudi Arabia's Crown Prince Mohammed bin Salman in the Oval Office of the White House on Tuesday. Evan Vucci/AP\n\nWhat Saudi Arabia didn’t get\n\nWhile bin Salman received almost everything Saudi Arabia has been seeking from the US, there were two notable exceptions: a green light to domestically enrich uranium for future nuclear plants and a formal defense commitment.\n\nThe US has long been reluctant to back a Saudi nuclear program that includes domestic uranium enrichment – a process that can produce bomb-grade material if purified to high levels – but CNN understands that Riyadh is reluctant to give up its right to do so, citing its substantial uranium deposits. US Energy Secretary Chris Wright told Fox News on Wednesday that the agreement doesn’t include domestic enrichment.\n\nAmong Washington’s Arab allies, Qatar has the strongest defense relationship with the US. It hosts the biggest US airbase in the region, was declared a Major Non-NATO ally in 2022, and this year received the strongest US security commitment for any Arab state, through an executive order declaring that any armed attack on the nation would be regarded as “a threat to the peace and security of the United States.”\n\nCNN understands that Saudi Arabia is seeking at least as deep a security commitment from Washington. A senior Saudi source told CNN the kingdom wants a permanent agreement that would last beyond Trump’s presidency, a move that would ultimately require Congressional approval. But a White House statement made no mention of any obligation to defend the kingdom.\n\n“What (bin Salman) reportedly wants is a Senate-ratified defense commitment along the lines of a NATO Article 5 pledge,” wrote Aaron David Miller, a senior fellow at the Carnegie Endowment think tank, referring to NATO’s mutual defense clause. “The last time Washington delivered that was 65 years ago, with the 1960 US-Japan treaty.”\n\nThere is a case to be made for such a pact, he continued. “The United States went to war to protect Saudi and Gulf oil before, a defense pact might prove to be a deterrent to future predators, and it would lock Saudi Arabia into a pro-American alignment for years to come, boxing out our competitors Russia and especially China.”\n\nOver the past few years, Saudi Arabia has been signaling that it is willing to seek defense partners beyond the US should Washington not make a stronger commitment to its security. In late 2023, bin Salman was explicit about the threat in an interview with Fox News, saying the US doesn’t “want to see Saudi Arabia shifting their armament from America to another place.”\n\nSaudi Crown Prince Mohammed bin Salman and Pakistan Prime Minister Shehbaz Sharif embrace each other on the day they sign a defence agreement, in Riyadh, Saudi Arabia, September 17. Saudi Press Agency/Reuters\n\nIn recent years, Riyadh has been gradually improving its ties with Beijing, culminating in the surprise rapprochement between Saudi Arabia and Iran in the Chinese capital in March 2023. The message has been that the US is Riyadh’s first port of call, but there are others too.\n\nAnd earlier this year, bin Salman followed through on his quest to diversify security partners, securing protection from Riyadh’s closest Muslim ally, nuclear armed Pakistan. The mutual defense agreement marked a striking expansion of the kingdom’s search for non-US security guarantees.\n\nThat hedging has not gone unnoticed in the halls of power in Washington.\n\n“I think that’s a positive move,” Rep. Michael McCaul, a top Republican foreign policy voice, said about the growing defense partnership between Riyadh and Washington. “Because to pull Saudi as an ally of the United States in this direction, rather than to China, and it will also solidify normalization in that process, in a post Gaza world.”\n\nThe Eurasia Group think tank said in an analysis piece last week that the US-Saudi relationship is now driven more by great power competition than normalization with Israel.\n\n“The kingdom has become a key strategic partner in the US’s competition with China,” it said. “The strategic convergence underway between Washington and Riyadh will continue to be underpinned by the role the kingdom can play in supporting the US in sectors that are crucial for US competition with China.”\n\nIt added that Riyadh’s calculation on normalization has shifted as Saudi public sentiment toward Israel has grown more negative and the kingdom has already secured many of the gains it expected from Washington.\n\nIn the Oval Office on Tuesday, Trump said he got a “positive response” from bin Salman on normalizing with Israel but said he wouldn’t “use the word ‘commitment’.”\n\nCNN’s Alison Main, Manu Raju and Casey Riddle contributed to this report.",
  "authors": [
    "Abbas Al Lawati",
    "Becky Anderson",
    "Analysis Abbas Al Lawati"
  ],
  "url": "https://www.cnn.com/2025/11/20/middleeast/jets-chips-clean-slate-mbs-trump-saudi-intl"
}