{
  "title": "These Tiramisù Are the Best Make-Ahead Thanksgiving Desserts",
  "text": "Advertisement\n\nThese Tiramisù Are the Best Make-Ahead Thanksgiving Desserts Cranberry, pumpkin and apple give the creamy no-bake classic a fall makeover with festive flavors. Final flourishes like a drizzle of caramel or a dusting of ground spice make tiramisù even more beautiful. Credit... Andrew Bui for The New York Times. Food Stylist: Kaitlin Wayne.\n\nThere are three different types of dessert people: cake people, custard people and pastry people. I’m very much a custard person, here for silky, creamy fillings — and tiramisù delivers every time. When it comes to eating it, especially after a feast like Thanksgiving, there’s a lightness to the layers of soft cream and caky soaked ladyfingers that lets you enjoy bite after bite without feeling too stuffed.\n\nCredit... Scott Loitsch\n\nTiramisù doesn’t require baking, feeds a crowd and actually needs to be prepared in advance, making it a great contender for a Thanksgiving dessert. These three versions have the structure of the classic, layering soaked ladyfingers with whipped mascarpone, but swap the traditional espresso with fall favorites.\n\nCranberry tiramisù captures tart and fruity notes similar to those in a berry cheesecake, while a modern (and loose) take on pumpkin pie combines the subtlety of pumpkin with chai spices and the beautiful sweetness of dates. For apple enthusiasts, the diced fruit is glossed with caramel and tucked underneath dollops of whipped mascarpone and candied pecans. The flavors end up complex, but the assembly is easy.\n\nCranberry juice soaks ladyfingers and cranberry sauce is layered with mascarpone for a tangy take on tiramisù. Credit... Andrew Bui for The New York Times. Food Stylist: Kaitlin Wayne.\n\nGrowing up in Romania, where tiramisù is a standard in pastry shops, I made it often for celebrations. From my teenage years at home through my adulthood working in bakeries, I’ve experimented with different seasonings and picked up essential tricks to creating the fluffiest, most flavorful tiramisù. Follow these tips and you can tiramisù anything.\n\n1. Watch your whipped cream.\n\nSpreadable soft mascarpone, a signature ingredient in tiramisù filling, is often lightened with beaten egg whites or yolks. For additional stability, the fillings here use whipped cream as well. There’s a fine line between forming stiff peaks and making butter when whisking heavy cream, so keep an eye on the bowl and adjust the mixer’s speed as needed.\n\nCaramel sauce glazes the apples tucked into the tiramisù and also coats the creamy top. Credit... Andrew Bui for The New York Times. Food Stylist: Kaitlin Wayne.\n\nAdvertisement\n\n2. Let cooked fillings cool completely.\n\nIf you want to customize your tiramisù, you can create sauces or other components to fold into or layer with the creamy base. (These Thanksgiving versions include cranberry sauce, caramelized apples and pumpkin butter.) Mascarpone and whipped cream are very sensitive to temperature, so allow each cooked element to cool before assembling or the filling will turn into a sloppy puddle.\n\n3. Aim for a quick soak.\n\nThe cake layer of tiramisù starts with store-bought Italian ladyfingers, also known as savoiardi. These dry biscuits, designed to absorb liquid and soften to a sponge cake texture, require less time to soak than you may think. A quick in-and-out dip will suffice and prevent them from disintegrating into a soupy mess.\n\nCredit... Andrew Bui for The New York Times. Food Stylist: Kaitlin Wayne.\n\n4. Enjoy the calm and layer on.\n\nWhen making tiramisù, there’s a sense of breeziness in the kitchen. Sure, you’re going to get a few bowls dirty, but it doesn’t feel like a major task. I put on “Cool Cat” by Queen and start whipping some cream. Turn on your favorite playlist and enjoy the relaxing steps of mixing the filling, soaking the ladyfingers and stacking all of it into a stunning dessert.\n\nFollow New York Times Cooking on Instagram, Facebook, YouTube, TikTok and Pinterest. Get regular updates from New York Times Cooking, with recipe suggestions, cooking tips and shopping advice.",
  "authors": [
    "Carolina Gelen",
    "Carolina Gelen Is A Recipe Developer",
    "James Beard Award-Winning Cookbook Author. A Transylvania Native",
    "She Draws Heavily Her Upbringing",
    "Creating Resourceful Recipes That Focus On Flavor"
  ],
  "url": "https://cooking.nytimes.com/article/tiramisu-thanksgiving-desserts"
}