{
  "title": "Netflix’s High Score proves we need a better history of video games",
  "text": "The story of video games is too often told by the same kind of person. Reports have extensively detailed the ways the video game industry has centered its orbit around men and boys — particularly white men and boys — and that homogeneity often extends to the people who are allowed to tell the story of games. Writers who were there at the medium’s nativity and made a career of chronicling video game history are also frequently from the same background, blind to the ways in which they are treated as the default and, in turn, further that narrative.\n\nNetflix’s High Score sets out to amend this. It’s a (very) brief history of the video games that spans the ‘80s and early ‘90s, when games leapt from arcade cabinets to home consoles, ending just as 3D games arrive on the scene. Creator France Costrel goes out of her way to center frequently overlooked figures in the industry, to a degree that is legitimately surprising. Yet it still fails to offer a clear-eyed view of the industry.\n\nThat’s not to say it has no redeeming qualities. Among High Score’s best moments: an episode that prominently features Rebecca Heineman, a long time game developer who is also the first winner of a national video game tournament and a trans woman. In another, the children of Jerry Lawson, the man largely responsible for the creation of the video game cartridge, reminisce about their late father, one of the few Black engineers in the nascent field of video games. Or an episode about Ryan Best, who created the early LGBTQ role-playing game GayBlade, which would have disappeared into obscurity had a dedicated community not tracked down copies of the game after Best lost his own.\n\nCourtesy of Netflix\n\nLike a lot of video game media geared towards the mainstream, High Score is compelled to cheerlead the medium’s successes and flee its ugliness. It recognizes that Jerry Lawson and Ryan Best have sat on the margins of the story. But it does not care to illustrate who put them there, nor does it seem to believe that anyone might have the same struggle today. You won’t find iconic developers like Brenda Romero, a woman with a decades-spanning career in games, in this story, but rather her husband, John Romero — creator of Doom, talking his days spent blasting heavy metal and making the first wildly popular first-person shooter. Had Brenda Romero been interviewed, High Score would have been able to add another storied developer to its roster — but also one with a different lived experience, who’s been extremely outspoken about the undercurrent of sexism that has persisted in games.\n\nat times, it is downright retrograde\n\nHigh Score’s reluctance to acknowledge even the obvious institutional problems in video games is embarrassing, and at times, it is downright retrograde, leaning into old-school rhetoric about gaming as a hobby that requires serious skills. Other times it’s just plain cloying. It features narration by Charles Martinet, the voice actor most famous for portraying Mario, and pixel-art dramatizations of anecdotes — both add little, especially when you consider just how much access High Score is afforded.\n\nHigh Score’s interview subjects include Richard Garriot (Ultima), John Tobias (Mortal Kombat), Akira Yasuda (Street Fighter), Gail Tilden (Nintendo), and Roberta Williams (King’s Quest). Most are surprisingly candid, and share original sketches, design documents, and other artifacts that are genuinely cool to see get a loving presentation. The show also takes care to illustrate that video games of this era were inspired by things that are not video games: roller coasters (Sonic the Hedgehog) or watercolor paintings (Final Fantasy) or H.G. Wells (Space Invaders). The amount of material is dizzying, and also wide in its scope. Executives are interviewed alongside fans who won early gaming competitions; it would feel comprehensive if the series’ construction wasn’t so haphazard, leaping from one subject to the next to provide a disjointed narrative.\n\nThen there’s Shaun Bloom. High Score introduces him in its second episode; he was one of Nintendo’s “Game Counselors,” staffing a hotline Nintendo players could call for tips when they’re stuck. Through its narration — and quotes from Bloom — High Score depicts Game Counselors as a fortunate bunch, people lucky enough to play games for a living. Bloom seems to agree, remembering his youth in a call center fondly, but also remembering a taskmaster of a boss, a lack of support for developers that forced counselors mainline games to make their own guides, and an aggressive schedule where they were encouraged to log as many calls an hour as they could.\n\nCourtesy of Netflix\n\nAgain, Bloom seems to have a rosy memory of this, but in the context of what we know about video games today, rife with crunch culture and underpaid labor — it reads as painfully disingenuous, portraying an idyllic career that, as we now know, barely ever existed.\n\nHigh Score presents video games as a great equalizer: a boundless medium where the limits are only a single person’s imagination, an art form where who you are does not matter, whether you make these adventures or play them. It does not have any interest in exploring the gatekeepers, inside and out of the industry, who have made this vision as simplistic as it is wrong. In this, the series undermines the goodwill garnered by its focus on the marginalized, glossing over the fact that they are notable in spite of an industry that actively excluded them.\n\nHigh Score’s version of the video game story celebrates games as a place where people like Ryan Best and Rebecca Heineman can do boundary-pushing work, not a place where they have long been — and arguably remain — in danger of being forgotten. It’s a pernicious cycle. If shows like High Score are the only video game documentaries that are made, then the industry will continue to overlook a whole new generation of Ryan Bests and Rebecca Heinemans.",
  "authors": [
    "Joshua Rivera"
  ],
  "url": "https://www.theverge.com/21400844/high-score-netflix-review-video-games"
}