{
  "title": "Democratic Senator Drops F-Bomb In Fiery Response To Trump’s ‘HANG THEM’ Attack",
  "text": "LOADING ERROR LOADING\n\nPresident Donald Trump’s shocking call Thursday for members of Congress to be executed was met with immediate, and explicit, pushback from Sen. Chris Murphy (D-Conn.), who sounded the horn for every “person of influence” to repudiate the president’s call for violence.\n\n“The president of the United States just called for members of Congress to be executed,” Murphy said in a fiery video statement. “If you are a person of influence in this country, maybe it’s time to pick a fucking side.”\n\nAdvertisement\n\nMurphy specifically called on Republicans to show some spine, saying:\n\n“If you are a Republican in Congress, if you are a Republican governor, maybe it’s time to draw a line in the sand and say that under no circumstances should the president of the United States be calling on his political opposition to be hanged.”\n\nThe President of the United States just called for Democratic members of Congress to be executed. \"HANG THEM\", he posted. If you're a person of influence in this country and you haven't picked a side, maybe now would be the time to pick a fucking side. — Chris Murphy (@chrismurphyct.bsky.social) 2025-11-20T16:15:56.109Z\n\n“We are at a very dangerous moment right now,” Murphy said in closing. “The president is engaged in the wholesale incitement, endorsement and rationalization of political violence in this country.\n\nAdvertisement\n\n“This is a moment for people to step up, for Republicans to step up, for business leaders to step up. Anybody who has a voice or a soapbox in this country needs to draw a line in the sand and say that it is not acceptable for the president of the United States to call on the murder of his political opposition.”\n\nTrump embarked on the violent social media spree after six Democratic lawmakers released a video reminding members of the military and intelligence community that they shouldn’t follow illegal orders.\n\nAll six of the Democrats are veterans and former intelligence officers.\n\n“Our laws are clear,” said Mark Kelly (D-Ariz.), a Navy veteran and former astronaut, in the video. “You can refuse illegal orders.”\n\nAdvertisement",
  "authors": [
    "Senior Reporter"
  ],
  "url": "https://www.huffpost.com/entry/chris-murphy-trump-hang-them-attack_n_691f43ede4b071a086ba047a?origin=top-ad-recirc"
}