{
  "title": "Screen Legend Dick Van Dyke Names The 1 Iconic Film Role He Turned Down",
  "text": "LOADING ERROR LOADING\n\nScreen legend Dick Van Dyke said he was offered a potential career-altering role in one of the world’s most famous movie franchises.\n\nAnd he turned it down.\n\n“Cubby Broccoli came to me and said, ‘Would you like to be Bond?’” he told Al Roker of NBC’s “Today” in an interview conducted ahead of his 100th birthday next month.\n\nAdvertisement\n\nVan Dyke said Broccoli, who produced many of the James Bond films, offered him the role of 007 when Sean Connery left. Connery left the role twice, in 1967 and 1971 (or three times, if you count the non-canonical “Never Say Never Again” in 1983). It’s not clear when Van Dyke was approached, but there was a reason he wasn’t interested.\n\n“I said, ‘Have you heard my British accent?’” he said, referring to his famous attempt at a Cockney accent when he portrayed Bert in 1964’s “Mary Poppins.”\n\nHe even apologized for it in 2017, when the British Academy of Film and Television Arts gave him a Britannia Award for excellence in television.\n\nAdvertisement\n\n“I appreciate this opportunity to apologize to the members of BAFTA for inflicting on them the most atrocious Cockney accent in the history of cinema,” he said, according to The Guardian.\n\nDick Van Dyke and Julie Andrews in \"Mary Poppins.\" Donaldson Collection via Getty Images\n\nVan Dyke added that at the time, no one told him just how bad it was.\n\n“I was working with an entire English cast and nobody said a word, not Julie [Andrews], not anybody said I needed to work on it so I thought I was alright,” he recalled.\n\nAdvertisement\n\nIn the new interview, Van Dyke said he regretted turning down Bond, but added there was one part he’s wanted that he can still play.\n\n“I wanted to be Scrooge,” he said. “Always wanted to play Scrooge, and I could do it. It’s just November. I still got time.”\n\nVan Dyke turns 100 on Dec. 13, and is marking the occasion with a new book: “100 Rules for Living to 100: An Optimist’s Guide to a Happy Life.”\n\nAdvertisement",
  "authors": [
    "Deputy Editor",
    "Trends"
  ],
  "url": "https://www.huffpost.com/entry/dick-van-dyke-turned-down-james-bond_n_691fe2f4e4b047290e29aa15"
}