{
  "title": "David Guetta Answers DJ Questions",
  "text": "Transcript\n\nHi guys, I'm David Guetta\n\nand I'm gonna answer a few questions from the internet.\n\nThis is DJ Support.\n\n[upbeat percussion music]\n\nFrom Koorutheguru, what is the theory behind drops?\n\nMusic is all about contrast.\n\nIf you want something to sound loud,\n\nit needs to be quiet before.\n\nIf you want something to sound very wide and stereo,\n\nit needs to be mono before.\n\nSo, this is kind of announcing\n\nthat something is about to happen,\n\nbut at the same time, you don't use kick,\n\nyou don't use the bass,\n\nyou don't use the elements that are really driving the song.\n\nSo, really you miss them,\n\nso when they come back, that's the drop,\n\nand it is gonna feel like an insane energy\n\nbecause, you know, the volume was there\n\nand another second it's there.\n\nThis is the trick.\n\nEven if I would play a very simple beat like that,\n\n[upbeat music]\n\nand I put a EQ, I use a filter,\n\nand there is no,\n\nyou cannot hear the kick very well\n\nbecause there's no low end,\n\nand another second I'm gonna put it back\n\nand people are gonna scream\n\nbecause if I leave you like this, it's like a tension,\n\ntension, tension, tension, tension.\n\nAnd then when you hear that,\n\nwoo, it's like [chuckles] you know,\n\nso it's really as simple as this.\n\nIt's just the contrast.\n\nSo, from Dradoc,\n\ndo most DJs create and practice sets before a gig\n\nor they just know the library incredibly well?\n\nWhen I started we would never play the same set\n\nbecause it was about the journey.\n\nSo, you read the people,\n\nand for me this is the essential art of DJing.\n\nThe technical part of DJing is really easy\n\nto master today thanks to technology.\n\nWhen I started it was vinyls.\n\nToday everything is done on computers.\n\nSo, the beat is always perfect.\n\nIt's very easy to beat match today.\n\nWhen I play a festival like Ultra or Tomorrowland,\n\nyou have 10 DJs playing one after the other\n\nand they're all the biggest DJs on the planet\n\nand they all playing one hour or 90 minutes,\n\nwe cannot have even a one minute that is so, so,\n\nit has to be on point perfect all the time.\n\nSo, in that case, yes, we prepare our set.\n\nI never played a prerecorded set.\n\nI hear so much about those stories of prerecorded set.\n\nI think it's absolutely ridiculous\n\nbecause beat matching is so easy.\n\nLike I can teach a kid that is 10 years old\n\nhow to beat match in a couple of hours\n\nbecause today it really became easy.\n\nSo, I don't know why people are talking about this,\n\nbut what I can say is that yes, we prepare.\n\nWhen I play a festival like Ultra,\n\nI probably work one full month every day on that set\n\nto make it perfect.\n\nI would create a skeleton\n\nand then when I play, I see,\n\nare people reacting more to this or to that?\n\nLet's say I'm playing my set that I prepared,\n\nbut I see that when I play an underground record,\n\nthey really into it.\n\nSo, I have my underground playlist,\n\nI'm gonna add some of this,\n\nor let's say I play an underground record\n\nand it's a disaster,\n\nthe only want hits, and sing along and feel good music,\n\nokay, no problem.\n\nI also have my list\n\nand I'm gonna add that more into the skeleton of my set.\n\nSo, yes, more sets are prepared.\n\nFrom DJFRANKUS, why do DJs always act\n\nlike the knobs on the mixer are hot?\n\nIf I'm totally honest,\n\nsome of it can become like a trick to do that\n\nand some of it is a little bullshit part of the show.\n\nI put the EQ straight\n\nbecause you have the craziest engineers\n\nthat are coming into the club.\n\nSo, unless really the club sucks,\n\nyou don't need to do all this show with EQ.\n\nSo, then there's a little bit of the creative EQ.\n\nSo, in the mixing\n\nand also like you can like,\n\nhuh, I don't wanna speak bad about my colleagues [laughs]\n\nbut I think a lot of this is for the show.\n\nLet's say it like that.\n\n[David laughing]\n\nFrom LEXN_Beats,\n\nhow do you read the crowd when the club isn't vibing?\n\nThat's a good question.\n\nActually this happens even to me.\n\nWhat you would do is try different things\n\nuntil one thing is reacting and one,\n\nwhen that record is reacting,\n\nwell, you know you have your different playlists\n\nand let's say you play a tech house record\n\nand it's reacting when you've been playing techno\n\nand it was not reacting,\n\nwell, then you go to best of tech house of 2025\n\nin your playlist and then you play more of that style.\n\nAnd this is why prerecorded set makes no sense\n\n'cause you need to be able to try different things\n\nuntil you win.\n\nAnd when you win, you make them happy.\n\nAnd once they're happy\n\nthen you can take them where you want.\n\nFrom NapLvr,\n\nwhat's the difference between playing at festivals or clubs?\n\nSo, usually when you start to DJ,\n\nyou do parties with your friends\n\nand then when you become more professional, you play clubs.\n\nAnd if you become very famous, you play festivals.\n\nI started as a resident, I would play eight hours every day,\n\nsix days a week.\n\nWhen I play a festival, I play 90 minutes\n\nbecause people want to hear my music.\n\nThe same way you have a festival,\n\nimagine you have the Rolling Stones and AC/DC,\n\nwell, you want the Rolling Stones to play satisfaction,\n\nyou want the AC/DC to play a highway to hell.\n\nThey're not gonna do in a festival Little Jam\n\nand play their favorite records from different artists.\n\nWell, it's the same for festivals.\n\nWhen you play a festival,\n\npeople want you to play exactly your sound\n\nbecause this is why they're buying tickets.\n\nAnd usually because the crowd is so much bigger,\n\nyou have to play more energy\n\nbecause of course you need more energy\n\nto move 100,000 people than to move 200 people.\n\nSo, really underground music is coming from the clubs.\n\nSometimes it goes to festival,\n\nbut in my opinion, when you play to 20,000 people,\n\nit's not underground anymore\n\neven if you call it underground.\n\nFrom Throwaway,\n\nbest way to start to learn to beat match?\n\nHonestly, beat matching is really easy today\n\nwith the technology of today.\n\nSo, I just took loops\n\n[upbeat music]\n\nfor you to understand.\n\nSo, let's say that this record is playing\n\nand I need to get into the next record.\n\nSo, what I would do usually is turn down the base\n\nbecause it's just a mixing principle.\n\nIf you have too much base at the same time\n\nit's gonna sound horrible.\n\nAnd then so,\n\n[upbeat music]\n\nso now,\n\n[upbeat music]\n\nthere're two records playing and it's beat matching, okay?\n\nIf it was a bad mix,\n\nit would do that.\n\n[upbeat music]\n\nIf you do that is,\n\nit is horrible, like people are confused,\n\nthey don't know how to dance, like where to dance.\n\nSo, then you need to adjust it.\n\nAnd now, okay, again, I'm gonna do that,\n\n[upbeat music]\n\nand then I can go to the other one.\n\nSo, I kept the beat steady\n\nso that people can dance.\n\nAnd now let's go to the next level of,\n\nlet's say in the [chuckles]\n\nwhen you learn how to DJ,\n\nthe first step is to beat match correctly the way I did,\n\nand the next step is also to respect the key.\n\nSo, then you need to know a little bit about music theory.\n\nSo, this is in C minor,\n\nthis one is in F-sharp minor.\n\nSo, maybe you don't hear it,\n\nbut it's off key, it's not pleasant.\n\nSo, I'm gonna now put it in G.\n\nNow, listen,\n\n[upbeat music]\n\nthis is pleasant.\n\nSo, not only is beat matched,\n\nbut it's also in key because G is in a chord.\n\nWe call this a fifth, so it's a perfect chord.\n\nC and G goes perfectly well together.\n\nSo, if I hear a DJ do that,\n\nI'm like, okay, this guy is good.\n\nSomeone ask what they're hearing\n\nin the headphones when they're playing a set\n\nin a loud venue.\n\nAgain, let's say I'm playing Record A,\n\nwhich is would be this one,\n\nI would use my headphones to listen to Record B\n\nand make sure that I started the record at the right time\n\nand that it's bit matching correctly.\n\nAnd I'm gonna check this in my headphones\n\nbecause I don't wanna mess it up and just launch it\n\nand put it there and I think it's right,\n\nbut maybe it's not right.\n\nSo, it's like an insurance policy,\n\nyou wanna make sure that your mixing is on point.\n\nAnd also when you're looking\n\nfor the next record to play,\n\nwell, sometimes you have an hesitation.\n\nYou feel like this is gonna feel good after Record A,\n\nbut let me double check how it feels in the headphones.\n\nSo, one ear is listening in the headphones\n\nto the next record and one ear is listening to the monitor,\n\nto what's playing on the sound system for everyone.\n\nMr-x-dj asked,\n\nwhat were the biggest mistakes you did\n\nwhen starting out to DJ?\n\nFirst, there is always a fine line\n\nin how to create your own identity.\n\nIn order to be successful, you need to have your own style,\n\nyour own music.\n\nSometimes it is the music you create yourself\n\nor sometimes you just play a lot of the same style\n\nand when it's unique, it makes you famous for that.\n\nAnd this is cool,\n\nbut what I see a lot is sometimes people\n\nso want to create the identity and so want to be cool\n\nthey don't even care if people are liking it or not,\n\nespecially in the time of today because it's filmed,\n\nthey care more about social media\n\nand how people are gonna perceive this behind\n\ntheir computers or their phones\n\ninstead of playing for the people that are in front of them.\n\nSo, okay, you want to be cool and unique,\n\nbut you don't want to forget why people are paying you.\n\nYou're getting paid to give a good time\n\nand entertain the people that are in front of you.\n\nThat's what I see a lot DJs that are playing like this\n\nand they never look at the crowd.\n\nThat's madness to me because our job is before anything,\n\nto entertain people give them a good time.\n\nSo, you need to be able to read them.\n\nSo, if you don't look at them, how can you read them?\n\nDoesn't make sense.\n\nFrom redonios, playing my first gig at 3:00 AM,\n\nhow to not be tired?\n\nOh, I feel you, this is something you need to accept\n\nbecause this is part of what we do\n\nand it doesn't get any better ever.\n\nBecause first there's working at night\n\nand then when you become very successful\n\nyou need to travel and be jet lagged.\n\nSo, yes, it's, I'm sorry my friend,\n\nthere's no perfect solution,\n\nbut there is one okay solution,\n\nwhich is what I do when I play late nights.\n\nI do what I call a disco nap.\n\nI sleep one hour, no more, before the show,\n\nand then I take half an hour to,\n\nso I don't arrive like a zombie.\n\nThis is a big problem in our community\n\nbecause we all have the worst sleep patterns\n\nbecause of course when you sleep before,\n\nyou know, before your show and when you go home,\n\nyou're not sleepy anymore,\n\nman, don't take Zolpidem,\n\nit's not good for your health.\n\nFrom kipthebronzesheep,\n\ncan someone help clarify the difference\n\nbetween mixing, remixes and producing?\n\nSome people think that DJs are creating\n\nthe music live with the turntables, which is not true.\n\nSome people think that when I make a record\n\nI'm just remixing it or mixing it, which is also not true.\n\nLet's be clear.\n\nSo, mixing two records together means\n\nthere's one record that is playing,\n\nmost DJs are playing other people record.\n\nYou play one record\n\nand then you need to do a transition to the next record.\n\nSo, you mix the next record in\n\nand there's a technique for that\n\nthat's called beat matching.\n\nSo, that's mixing.\n\nRemixing is when you create\n\na new production around an existing vocal,\n\nyou take a famous song that everyone knows,\n\nbut instead of playing the original version,\n\nyou play a version that you created yourself\n\nwith your own style of music.\n\nWhen you say someone is a producer,\n\nit usually involves all the different steps.\n\nComposition is usually simply chords played on the piano\n\nor the guitar, a little melody.\n\nSongwriting is the song, it's melody,\n\nand then later when you have that, you produce it.\n\nThe production is the choice of sounds,\n\nthe choice of arrangement\n\nthat is gonna make the song go into this style\n\nor that style.\n\nSo, for you to understand if a song is great,\n\nI can produce it in so many different ways.\n\nI can make it a ballad, I can make it a EDM song,\n\nI can make it a reggae song.\n\nThis is only due to production.\n\nFrom totallynotagirl,\n\nhow do you make a set?\n\nI compare this to a fashion show a little bit.\n\nLet's say that there are two,\n\nthree or four seasons in a year.\n\nSo, when it's the beginning of the season,\n\nin my case, usually it would be around March,\n\nthis is what is going to be my summer collection.\n\nSo, before Ultra,\n\nI work like maybe a full month creating a set\n\nand then I'm playing it at Ultra,\n\nI see what works, what doesn't works.\n\nThen I have my season in Vegas,\n\nI see what works, what doesn't work.\n\nThen I'm using some of this\n\nto play my season in Europe in Ibiza,\n\nand I have then probably 50% of my set,\n\nI have to play a little more underground for Ibiza.\n\nSo, then at the beginning of the season I have a set,\n\nand every time I'm writing down what works\n\nand what doesn't work,\n\nand then I'm like, okay, this record, out,\n\nthis one, works really well.\n\nOkay, that hot new sound,\n\nI was not expecting it to work that well,\n\nI'm gonna put more of that style.\n\nAnd then what happens is every week\n\nthe set is getting better and better and better.\n\nAnd then in August it's gonna be so fucking perfect\n\nthat I'm getting bored of it.\n\nFrom jijihggg, are jog wheels essentials?\n\nWell, I guess this is the jog wheel.\n\nThis is actually coming from the idea of vinyls\n\nbecause it was a similar way to mix\n\nand, you know, you would like,\n\nif it's not perfectly beat matched,\n\nyou would move the vinyl a little bit forward or backward\n\nuntil it's perfect.\n\nThis is one technique\n\nthat comes from the old school way of mixing.\n\nThere would be a possibility to use other ways,\n\nbut I think this is very practical.\n\nSo, yes, it's useful.\n\nOkay, those were all the questions.\n\nThank you for watching DJ Support.\n\n[upbeat music]",
  "authors": [
    "Condé Nast"
  ],
  "url": "https://www.wired.com/video/watch/tech-support-david-guetta-answers-dj-questions"
}