{
  "title": "The Echo Aviation Controller puts a flight simulator in your hands",
  "text": "is a senior reporter who’s been covering and reviewing the latest gadgets and tech since 2006, but has loved all things electronic since he was a kid.\n\nPosts from this author will be added to your daily email digest and your homepage feed.\n\nHoneycomb Aeronautical, a company that makes flight simulator accessories like flight sticks and pedals that can turn your desk into a cockpit, has announced a compact alternative for PC pilots with limited room. Its upcoming Echo Aviation Controller is about the size of a console gamepad but squeezes standard features like joysticks and buttons to one side to make room for flight-specific controls like throttle levers and a dedicated trim wheel.\n\nThe Echo Aviation Controller is expected to be available in mid-December 2025 for $149.99 through the company’s online store. It’s fully compatible with various PC-based flight simulators, including Microsoft Flight Simulator, and it connects to a computer with a USB-C cable or wirelessly using a dongle, according to Calum Martin at FSElite, who went hands on with the gamepad at a recent event.\n\nOn the left side of the main controller you’ll find a thumbstick, four action buttons, and a second conical joystick used to control a simulator’s camera. Meanwhile, the right side is where all the flight specific controls are located: four throttle levers accompanied by a trim wheel that can be adjusted to maintain a plane’s altitude without additional inputs.\n\nA pair of sliding paddles on the back of the controller move in opposition so they function as a plane’s rudder control. Image: Honeycomb Aeronautical\n\nOn the bottom of the Echo Aviation Controller are dedicated controls for adjusting the aircraft’s flaps, raising or lowering the landing gear, and activating the parking brake so you don’t have to reach for your keyboard as frequently. There are also two sets of shoulder buttons on the top edge, and on the back you’ll find a pair of sliding paddles that move in opposition and function as rudders, controlling the side-to-side movement of your aircraft’s nose and aiding in steering while navigating an airport and runways.\n\nThe controller comes with alternate caps for its throttle levers so you can customize their shape and color. Image: Honeycomb Aeronautical\n\nIn addition to a hard shell carrying case, the Echo Aviation Controller will come with a collection of interchangeable caps for the throttle levers and other controls so you can customize and easily differentiate each of them by their shape or color if you’ve remapped their functionality.",
  "authors": [
    "Andrew Liszewski"
  ],
  "url": "https://www.theverge.com/news/823018/honeycomb-aeronautical-echo-aviation-controller-gamepad-pc-flight-simulator"
}