{
  "title": "Michael Caton-Jones: Working class roots prepared me for Hollywood",
  "text": "Rob Roy director says being working class was 'big bonus' in Hollywood\n\n41 minutes ago Share Save Pauline McLean Scotland arts correspondent Share Save\n\nGetty Images Hollywood director Michael Caton-Jones is in front of the camera for once\n\nMichael Caton-Jones has directed some of the biggest names in the business including Leonardo DiCaprio, Robert de Niro and Jessica Lange. But today he is in front of the camera as filming of a new documentary about his own rags-to-riches story gets underway in his home town of Broxburn, West Lothian. Made by two Scottish production companies in collaboration with Stranger Things actor Matthew Modine's new production house, the 68-year-old director said he wasn't immediately convinced about the project. \"My first response was embarrassment because I'm not one for bigging myself up,\" he says. \"But then I thought, it's not really about you. It's about where you come from. \"It's about showing that this is my job, this is what I do.\"\n\nGetty Images On set filming City By The Sea with Robert De Niro\n\nBorn in Broxburn in 1957, Caton-Jones's first introduction to film was at his local cinema, the Regal, where he went most Saturday mornings for special children's screenings. \"It was as much a social outing as anything else,\" he says. \"Parents would take their kids down to the cinema and drop them off and that was it - mayhem for an hour or so with five, six, seven-year-olds, just going bananas. \"It was fantastic and something to look forward to every week.\" Later he developed an entrepreneurial streak which would stand him in good stead for the world of Hollywood, as he delivered posters for the cinema to locations around the town, in exchange for tickets to screenings.\n\nGetty Images The new Caton-Jones documentary is being made with Memphis Belle and Stranger Things actor Matthew Modine's production company\n\nAlthough Caton-Jones left school at 15 with few qualifications, and Scotland soon after that, the film explores how he learned his craft in London theatreland and then secured a place at Film School. His first feature film Scandal, made in 1989, established him as a director worth hiring, and was swiftly followed by Memphis Belle which included a young Matthew Modine as Captain Dennis Dearborn. \"In retrospect, I can see that being Scottish and having the working class upbringing I had was a big bonus for me in many ways,\" says Caton-Jones. \"In Hollywood, it kept me centred. I had a great time. I enjoyed making films. It got me to travel the world. \"I saw some amazing things, met some incredible people, ate some really good food. \"I would recommend it to anybody.\"\n\nReuters Leonardo DiCaprio spoke about Michael Caton-Jones in his Oscar acceptance speech in 2016\n\nIn 1993, he made This Boy's Life, a true life coming of age story set in the 1950s, and was instrumental in casting a 16-year-old Leonardo DiCaprio in his first screen role alongside Robert De Niro. In 2016, when he won an Oscar for his role in The Revenant, he thanked Caton-Jones for that first breakthrough role. \"I'm very proud of Leonardo. He was a sponge. He wanted to learn,\" Caton-Jones said. \"But he was a bit of an indulged wee kid and essentially I played his big brother while we were making the film. \"Because he was in every single scene in the film the best thing I could do was keep him thinking this was a game and we were playing around. \"But I was aware at the time that he was extraordinarily talented.\" Another key casting moment was Tim Roth in Rob Roy. His role in Quentin Tarantino's cult film Reservoir Dogs in 1992 had given him a fresh burst of fame and he wasn't convinced about plans for a Scottish western called Rob Roy - or the idea that he should play the ruthless powdered villain Archie Cunningham.\n\nGetty Images Tim Roth wasn't sure about the role of Archie Cunningham in Rob Roy\n\nAlmost all of the filming was done in Scotland – where three decades later Tim Roth returned to make John MacLean's Tornado, and was relieved to find the wintry temperatures had killed off the midges. But the arrival of two major historical feature films at the same time, inevitably squeezed resources and audiences. \"I was aware of Braveheart when they were making it,\" says Caton-Jones. \"I knew what they were going to make because I'd read the script. \"And I knew that they had a bucketload of money, and we didn't have so much. \"My plan was to use the landscape and figures in the landscape as opposed to an army in the landscape. \"I think Rob Roy is the more Scottish film whereas Braveheart could be anywhere. \"It's just a wild group of painted faces with good teeth.\"\n\nGetty Images Caton-Jones, left, on the red carpet in Cannes with actorss Sharon Stone and David Morrissey.\n\nRob Roy cost an estimated £28m dollars whereas Braveheart had almost three times that amount - but despite the pressures of budget, the film included some unforgettable scenes. \"To this day, Rob Roy remains one of my favourite movies of the 1990s,\" says Adam Rackoff, Matthew Modine's producing partner at Cinco Dedos Peliculas. \"The end sword fight might be the most realistic ever put to film.\"\n\nAlamy Liam Neeson and Jessica Lange in Rob Roy gave Braveheart a run for its bigger budget money.\n\nCaton-Jones said he looked to legendary Japanese director Akira Kurosawa for inspiration, as well as sword master Bill Hobbs. The key to the scene was practice, but the other trick was to pare it back from the planned crowd scene to the two protagonists. \"We'd spent a quarter of a million dollars on wigs and costumes and extras but I went to the producer and said we've got to lose it all,\" says Caton-Jones. \"It changed the scene and made it personal. Like a sheriff and a bad cowboy coming in to have a gunfight.\" He did the same with the soundtrack, removing everything but the sound of the swords. \"And when you took all that out, you could hear people breathe in the audience,\" he says. \"They were holding their breath as they were watching it. I wasn't aware that it was going to have this effect. I'm really proud of it.\"\n\nCaton-Jones returns to Broxburn as part of the film about his life and career",
  "authors": [],
  "url": "https://www.bbc.com/news/articles/c98n8ge0ge3o"
}