{
  "title": "Economics Professor Answers Great Depression Questions",
  "text": "Transcript\n\nHi, I'm Chris Clark.\n\nI'm an Economics Professor at Washington State University\n\nand I'm here to answer your questions from the internet.\n\nThis is Great Depression Support.\n\n[steady upbeat music]\n\nThis_Caterpillar_330 asks,\n\nwas the great depression really as bad\n\nas it's commonly portrayed to be?\n\nYes, it was awful.\n\nThe unemployment rate is 25%.\n\nIn the Great recession of 2009,\n\nwe maxed out at 10%.\n\nOther places across the planet\n\nwhere we see this, say Greece in 2012 also hit 25%.\n\nNot a good time. The economy collapsed.\n\nIndustrial production fell by half.\n\nThis is a huge amount of idle resources. Folks went hungry.\n\nIt spurred us to create the first federal welfare systems.\n\nThis is where we got Social Security,\n\nunemployment insurance, federal minimum wage,\n\nhousing subsidies all throughout the thirties trying\n\nto address the suffering that we saw then.\n\nBrightSherbet asks, explain it like I'm five,\n\nwhat caused the Great Depression between 1929 and 1933?\n\nIn the late 1920s,\n\nthe United States financial markets were experiencing\n\na speculative boom.\n\nNow the real economy was growing\n\nand there were real profits to be shared on Wall Street,\n\nbut they started investing heavily on margins.\n\nNow, what this means is that they would take out huge loans\n\nand then buy stocks with those loans,\n\nand then they would set up a different company\n\nto buy stocks in that company again on huge loans.\n\nSo that meant an initial investment of say,\n\na hundred dollars could turn into a thousand\n\ndollars worth of stock.\n\nSo any rise in the stock would be a huge boom,\n\nbut any speculative boom is eventually going to end.\n\nThe economy hit a run of the mill recession in the summer\n\nof 1929.\n\nThe slowdown in economic activity led the market\n\nto peak on September 3rd,\n\nbut because so many of these stocks were not held outright,\n\nbut by loan, any fall in the price meant a cascading\n\nchain of everyone calling in their loans, which meant\n\nby October we experienced a huge crash.\n\nHere's a picture of Wall Street on the corner of Wall Street\n\nand Broad showing the crowds all worried about their\n\nfalling fortunes.\n\nNow, despite what everyone thinks,\n\nthe stock market is not the economy.\n\nOnly one to 2% of Americans at the time held any stock.\n\nThis event could have primarily just affected folks in\n\nNew York and other financial markets.\n\nHow did it start affecting the rest of the economy?\n\nA falling stock market means there's less\n\nwealth in the economy.\n\nLess wealth means less consumption.\n\nBusinesses can't move goods.\n\nThey're not able to hire people, they gotta let others go.\n\nThings start cascading into the real world once we start\n\nseeing massive bank failures.\n\nYou see, if a bank loses a lot of their stock,\n\nthey're not going to be able to honor folks\n\nwho put their deposits in.\n\nThis is how a bank works.\n\nYou come along, you put your money in the bank,\n\nthey take it, and then they lend it out to other people.\n\nBut if those loans aren't being paid back then the bank\n\ncan't pay their depositors back, which means you\n\nas a depositor are only gonna get there if you are first.\n\nAnd how do you get there first?\n\nYou gotta be the number one person in that line.\n\nIf you're too far back, the banks ran out of cash\n\nand they're not gonna be able to pay you back.\n\nThe bank doesn't have any loans available\n\nbecause the people who owe them\n\nmoney are now going bankrupt.\n\nAnd so banks are starting to fail.\n\nIt's not just one or two banks here and there.\n\nIt's 10,000 banks\n\nthat are collapsing across these years.\n\nOne of the reasons is because all these banks are forced\n\nto be really small, so if you get a modest shock,\n\nthey don't have the resources to ensure themselves\n\nor to draw on other regions.\n\nSurprisingly, just north of the border,\n\nCanada only had 10 banks served in the entire country\n\nand they didn't experience runs.\n\nThis was unique to the United States\n\nand our fractured banking system.\n\nYear by year, things kept getting worse.\n\nBy 1932,\n\nthe unemployment rate had reached 25%.\n\nThat meant one out of every four people can't find work\n\nwho want to find work.\n\nMen would line the streets advertising themselves\n\nfor work, relief efforts set up soup kitchens\n\nto serve the unemployed.\n\nEconomists still today debate on\n\nwhat are the ultimate causes of the Great Depression,\n\nbut these are the primary events that got us along the way.\n\nthenamesdrjane asks, when does a great depression start\n\nand who declares it?\n\nA great depression is gonna involve a lot\n\nof economic collapse, not just production,\n\nbut we'll have high unemployment.\n\nAll across the board,\n\nwe're gonna see a slowdown in economic activity\n\nand the period between 1929\n\nand 1933 was the worst economic decline in the\n\nUnited States history.\n\nNow, who declares it?\n\nThat's the National Bureau of Economic Research.\n\nThey're actually not part of the government.\n\nThey're a nonprofit research group based in Massachusetts.\n\nAnd after some time for research purposes,\n\nthe committee gets together and they decide what month\n\nand year a contraction starts,\n\nand then when does the economy start growing again.\n\nA Reddit user asks,\n\nwhy do Americans call the 1930s depression they had great?\n\nWasn't it bad? What are they stupid?\n\nIt was bad.\n\nActually, the term depression\n\ngoes all the way back to James Monroe.\n\nThis is the term that they would use\n\nfor any economic downturn was depression.\n\nAnd they actually called the episode\n\nin the early twenties, a great depression.\n\nIt started having capital letters as the Great Depression,\n\nby about the mid thirties, we have Lionel Robbins,\n\nan economist who wrote a book called The Great Depression.\n\nIn the subsequent years,\n\nwe capitalized it, called it The Great Depression.\n\nzoppytops asks,\n\nwhat effect did the Smoot-Hawley Act have\n\non the Great Depression?\n\nThe Smoot-Hawley Act was a large increase in tariffs.\n\nOne of the hypothesized reason\n\nfor the Great Depression at the time was not enough economic\n\nactivity at home and a greater need\n\nfor protection from abroad.\n\nThe idea was if you increase the tariffs here,\n\nit'll protect our businesses\n\nand they'll be able to succeed more,\n\nand that'll get us out of the depression.\n\nUnfortunately, economists have long known and argued\n\nand warned at the time that trade is one\n\nof the ultimate secrets for long run economic growth.\n\nTrade allows a country to specialize.\n\nIt allows more economic activity, more diversity,\n\nand more options across the world.\n\nNow, how much effect did this have?\n\nIt was signed into law by President Hoover in 1930,\n\njust as we were getting started on the Depression.\n\nNow, the effect on the American economy was modest, largely\n\nbecause the US economy was one of the biggest on the globe,\n\nand the role of international trade was relatively small.\n\nEconomists have estimated it declined our economy\n\nby maybe a couple of percentage points,\n\nbut the effect on Smoot-Hawley was bigger across the globe.\n\nOther countries seeing\n\nthat we were no longer playing fair raised their own\n\ntariffs, their own retaliatory tariffs,\n\nand we started to begin\n\nwhat we call this kinder bird's cycle,\n\nwhere the tariffs got higher and higher across the world\n\nand global trade shrunk and shrunk and shrunk\n\nevery year throughout 1932 and 33.\n\nCarbonCaptureShield asks, what caused the Great\n\nDust Bowl of the 1930s?\n\nA drought,\n\nbut we get droughts all the time.\n\nThe Dust Bowl was one\n\nof the worst environmental disasters in the\n\nUnited States history.\n\nIn the 1920s,\n\nwe start seeing mechanizations spread across agriculture.\n\nWe get tractors\n\nand other machinery to help us till up the land.\n\nIn the late twenties, a huge increase in migrants\n\nto the Oklahoma Panhandle area, Colorado, Kansas,\n\nand in northern Texas dug up millions of acres\n\nof prairie grass.\n\nThe rain was great those years,\n\nand they got bumper harvest crops.\n\n1931, we get a drought. 1932, the drought continues.\n\nIt goes for year after year.\n\nThe area experiences drought from time to time before,\n\nbut the native grasses had a deep root system\n\nthat would keep the dirt in place when it would dry out.\n\nBut this all got plowed up, so without the rain,\n\nthe wheat wasn't growing\n\nand we were left with huge fields of dirt.\n\nSo you'd get a real big windstorm come in,\n\nit would kick up the dust and spread.\n\nBy 1935, they called the Black Sunday.\n\nThe dust was being spread to Chicago, to Washington DC,\n\nso the government started doing things about it.\n\nThey told 'em to plow in a way that would reduce erosion.\n\nThey planted trees\n\nto help put a windbreaker all across the Great Plains.\n\nThey bought hundreds of thousands of acres\n\nto turn back into Prairie Land.\n\nNow, the effect on the macro economy was relatively minor.\n\nIt affected around a hundred million acres.\n\nFor reference, the United States had around a billion acres\n\nof agricultural land.\n\nAlso, only 20%\n\nof the economy's workers were in the agricultural sector\n\nby 1930.\n\nSo it was hugely harmful for that panhandle region,\n\nbut for the nation as a whole,\n\nit wasn't a cause of the Great Depression.\n\nThe local pain\n\nthat we did witness was a large migration outward.\n\nThis is where we get the famous novel, The Grapes of Wrath\n\nby John Steinbeck.\n\nIt's also where we get the most famous\n\npicture for the Great Depression.\n\nThis was taken by Dorothea Lang,\n\nand this is a family of migrants\n\nthat came from the Dust Bowl,\n\nOklahoma region into California.\n\nAnd in California,\n\nthese migrants were living in very, very,\n\nvery poor conditions,\n\nand the United States government hired photographers to go\n\naround and take pictures\n\nof these stories to help document it.\n\nAnd when Dorothea Lang saw this family,\n\nshe took them in a bunch of different poses.\n\nTaking the snapshot that tells the story for the ages.\n\nDullSwing135 asks,\n\nhow was the military affected during the Great Depression?\n\nAfter World War I, the veterans were promised a bonus\n\nthat was gonna be paid out in the 1940s,\n\nbut because of the severity of the depression,\n\nthese veterans were unemployed\n\nand asked for that support to be paid earlier.\n\nAnd over the course of months,\n\nthey organized a march all the way on Washington DC setting\n\nup camps to sit there\n\nand ask that their promised support could be paid\n\nearly during this depressive era.\n\nCongress was slow to act.\n\nHoover didn't want to do it,\n\nand due to some local strives between some of these camps\n\nand the local police, Hoover directed General Douglas\n\nMacArthur to forcibly remove these veterans.\n\nMacArthur came in with force\n\nand bayonets, set the camps on fire\n\nand force these veterans out.\n\neragon233 asks, are we following in the footsteps\n\nof the Great Depression?\n\nThere's always parallels.\n\nThere's always worry that it could happen again.\n\nIt could, but we're not seeing anything anywhere\n\nclose to that magnitude today.\n\nDuring the 2022, 2023 inflation period, a lot\n\nof people on social media asked if we were living in another\n\nsilent Depression, we weren't.\n\nHome ownership rates are way higher than they were then.\n\nPeople own cars at way higher rates than they did then.\n\nThe food stamp program and other assistance didn't exist.\n\nIn 2008, we did experience another major financial crisis,\n\narguably bigger than the collapse that we saw in 1929.\n\nYet the Federal Reserve acted in a way\n\nto preserve the financial system\n\nand prevent that spread from going further\n\ninto the deeper economy.\n\nToday, people are worried about an increase in tariffs.\n\nIt's true we are raising tariffs to the levels\n\nthat we last saw in the 1930s.\n\nWe do trade a whole lot more today,\n\nthe United States, compared to\n\nwhat the US was trading in the thirties,\n\nthe economic harm from tariffs will be worse\n\ntoday than what it was.\n\nBut the difference is the tariffs of the 1930s caused one\n\nto two percentage points of the Great Depression.\n\nToday, the tariffs might harm the economy\n\none to two percentage points again.\n\nMagic-karma asks, The Great Depression was awful,\n\nbut it wasn't as bad for some of the rich.\n\nWhat business receptors held their own\n\nor improved during the Great Depression?\n\nHow did the rich stay rich during that time?\n\nWell, most of the rich held their wealth in the stock market\n\nand the stock market collapsed.\n\nSo the rich actually didn't do that well.\n\nThis is a period of a huge decrease in inequality.\n\nNow, this is one of the episodes\n\nof decreasing in inequality that's not so hot.\n\nDestruction is not a good way\n\nto make the economy more equal.\n\nThe difference today is during 2008\n\nand during the COVID crisis, the wealthy were saved.\n\nTheir wealth was preserved,\n\nand this has led to a lot of debates about the moral role\n\nof the wealthy in society.\n\nIn previous crises,\n\nall the way back to the Black plague of the 1300s\n\nto the Great Depression of the 1930s,\n\nthe rich experienced pain along with everybody else\n\nand so worked to get everybody back on board again.\n\nToday, the sentiment feels different\n\nand that can explain movements from Occupy and others.\n\nhistorydefined asks, shanty towns,\n\nwhat was life like in the Hoovervilles\n\nof the Great Depression?\n\nThe depression was so severe that the quantity\n\nof homeless and unsheltered increased drastically\n\nand in every major city in America, they started\n\nto set up makeshift homes either out of corrugated tin\n\nor cardboard or loose construction materials\n\nor digging holes in the ground for Hovels.\n\nWe've never seen homelessness at that scale\n\nbefore, and the United States wasn't even\n\ncollecting statistics on it.\n\nAfter FDR was elected, he hired a sociologist\n\nto go out and measure it.\n\nHe came up with an estimate of 1.5 million homeless out\n\nof a total population of 120 plus million.\n\nThat comes out to about 1.2% of the population.\n\nFor reference today, the homeless population is\n\naround 700,000.\n\nThis is a quarter of a share of the population compared to\n\nwhat was experienced in 1933.\n\nA Reddit user asks,\n\nhow much did Herbert Hoover's policies contribute\n\nto the Great Depression?\n\nPresident Hoover largely didn't do much,\n\nand it was somewhat against his instinct.\n\nOn his path to the presidency,\n\nhe served in the post World War I reconstruction.\n\nHe was a humanitarian, he was an engineer,\n\nand he wanted the best for the country.\n\nHis advisor, Andrew Mellon, told him\n\nthat recessions are healthy and necessary in an economy.\n\nThey cut out the fat.\n\nIf you're a business that has a bad model,\n\na recession cleans it out\n\nso we can use our resources more effectively.\n\nAfter the depression, Hoover in his memoirs, lambasted\n\nthat previous view and completely regretted his\n\nlack of action.\n\nHe complained that Mellon simply wanted to liquidate labor,\n\nliquidate investment, liquidate wall Street,\n\nliquidate everything,\n\nand clearly you can't liquidate an entire economy.\n\nThis sets up a debate.\n\nStill today, there is a split between economists on\n\nhow much should the government get involved in a depression.\n\nBut Hoover wasn't entirely actionless.\n\nHe brought in folks from industry\n\nand he pled with them to keep wages high.\n\nThere are some economists who think that this effort\n\nto keep wages at a high level prevented the economy\n\nfrom self-correcting, that it encouraged monopoly practices\n\nand that distorted the market, slowing it down even further.\n\ndynaboyj asks,\n\nwhy are Franklin Roosevelt's fireside chats more well known\n\nthan other presidential attempts at directly\n\nconnecting with the public?\n\nWell, they were new.\n\nThe radio was new technology,\n\nand by the end of the 1930s,\n\nnearly everybody had a radio all across\n\nthe income distribution.\n\nSo for the first time, a president was able to communicate\n\nwith their own voice about\n\nwhat is happening in Washington DC.\n\nI mean, before the radio, the only way you'd hear\n\nfrom your representatives in Congress\n\nwas through the newspaper.\n\nThis was a very serious time for the country,\n\nand leadership is needed.\n\nFDR was an optimist.\n\nHe had a way with people\n\nand he encouraged and lifted them up.\n\niheartalpacas asks,\n\nwhat role did being on the Gold Standard play\n\nduring the Great Depression?\n\nEverything.\n\nMonetary policy is one\n\nof the primary tools we have to help recessions,\n\nand Hoover and initially FDR did not want\n\nto get off the gold standard.\n\nThe gold standard at the time said one ounce\n\nof gold could be purchased for $20,\n\nand that price could not fluctuate.\n\nAnd the way to maintain that is to have a certain quantity\n\nof gold on hand.\n\nSo if the value of the gold changed,\n\nthen the central bank can buy\n\nand sell gold to maintain that dollar peg.\n\nBut the problem is, this is going to tie your hands\n\nto respond to an economic crisis.\n\nNobel Prize economist, Milton Friedman\n\nand his co-author, Anna Schwartz, published this book,\n\nThe Monetary History of the United States,\n\nand it was monumental.\n\nIt argued that the Great Depression was largely the fault\n\nof the Central Bank, in part, trying to hold onto\n\nthat gold standard.\n\nThe total demand in the United States economy\n\nwas collapsing.\n\nPrices were falling.\n\nThis meant that businesses couldn't pay back their loans,\n\nwhich meant you saw more\n\nand more bank collapses,\n\nwhich in turn would put more businesses out of line\n\nand decline more and more wealth.\n\nIf you allow the currency to change,\n\nif you get off the gold standard.\n\nIn other words, you allow the central bank to print money,\n\nthat's gonna increase the amount of cash in the economy,\n\nthat's gonna make it so the banks can stay open.\n\nThat's gonna allow the economy to start growing again.\n\nThis is such a big deal that as we see,\n\nwhen each country got off the gold standard,\n\ntheir depression stopped and growth returned.\n\nThe first to do this was Scandinavia way back in 30 and 31,\n\nand then Great Britain did it in 1931,\n\nthe United States and Germany.\n\nWe did it in 1933.\n\nAnd then finally, France waited all the way to 37\n\nbefore their economy started recovering.\n\nTatem1961 asks,\n\nin 1933, the US government seized all the gold owned\n\nby private citizens.\n\nWhy didn't that result in a massive protest or a civil war?\n\nI think to understand this best, we have to understand\n\nhow dire the situation was in 1933,\n\nhow desperate everybody was for drastic political change.\n\nHerbert Hoover wanted to keep the gold standard.\n\nFDR on the campaign said he wanted\n\nto keep the gold standard, but it became very clear\n\nthat if we are going to have the system reset, we had\n\nto change the currency.\n\nAnd FDR was very popular. People saw the need for it.\n\nIn April of 1933, FDR signs an executive order,\n\nchanging the value of one ounce of gold from $20 to $35\n\nand requiring that people couldn't hoard gold anymore.\n\nIf you held more than a hundred dollars worth of gold,\n\nyou were required to sell it back\n\nto the government.\n\nFor reference,\n\nthat's the equivalent to around $10,000 worth of gold today.\n\nAnd of course there were exceptions\n\nfor jewelry and coin collecting.\n\nThere were a handful of arrests across the country.\n\nSome people didn't want to return their gold,\n\nbut the law was held up in court\n\nand the Supreme Court ruled it okay\n\nover multiple rulings between 34 and 36.\n\nDarkmatter2025 asks, when did the FDIC start?\n\nThe FDIC is part\n\nof FDR's New Deal in the whole alphabet soup.\n\nIt stands for Federal Deposit Insurance Corporation.\n\nAnd this thing stopped the bank runs. Here's how it works.\n\nYou have a deposit with the bank.\n\nAs long as that bank's in business, you can go\n\nand you can ask for your money at any time.\n\nThe bank doesn't keep all your cash in a vault.\n\nIt makes money by taking in deposits\n\nand lending it out to other folks, businesses, mortgages,\n\ninvesting it in somewhere.\n\nNow, if those investments go sour,\n\nif those businesses don't pay back,\n\nif folks stop paying back their mortgages,\n\nthen the bank won't have the ability\n\nto pay you back your deposits.\n\nAnd we had three, four years of bank run after bank run.\n\nWhen the FDIC came along it said, hey, hey, hey banks.\n\nYou pay a little premium into the system,\n\nwe'll guarantee a deposit of a certain amount.\n\nIf you've got your deposit in the bank,\n\nyou know they're running into some trouble.\n\nYou know that the bank might be having difficulties.\n\nYou won't need to go run to the bank\n\nand get their last remaining cash outta their vault.\n\nYou can just wait 'cause you know\n\nthat the government is backing up the insurance.\n\nFrom 1933 on, this solved the bank run problem.\n\nBostonDrivingIsWorse asks,\n\nwhat would happen if there were a run on banks similar\n\nto 1929 today?\n\nThis is a great question\n\n'cause it's so far out of our lifetimes.\n\nWe haven't experienced bank runs like this\n\nbecause of the creation of federal deposit insurance.\n\nWhat we can see are bank runs of a different type.\n\nNot every bank is covered by deposit insurance.\n\nIn the 2008 crisis, a lot of that banking activity was bank\n\nto bank, one investment bank to another investment bank.\n\nThis was part of the shadow banking sector.\n\nIt doesn't have the same regulation\n\nand standards as a regular deposit consumer bank does.\n\nSo we did see a run between investment banks in 2008\n\nthat led to the collapse of Bear Stearns, Lehman Brothers,\n\nand ultimately AIG whom the government\n\nstepped in to bail out.\n\ndonqon asks,\n\ndid the New Deal actually help Americans or not?\n\nAnd did it help during the Great Depression?\n\nThe New Deal was kind of like taking spaghetti\n\nand throwing it on the wall\n\nand seeing what sticks.\n\nSome's going to,\n\nbut some of the noodles are gonna fall down the counter.\n\nSome of the policies that were effective, such as the CCC\n\nor the WPA, hired the unemployed\n\nand got them working on public works.\n\nThese are pictures of my great-grandfather, Levi Bibe,\n\nand he worked in the WPA.\n\nHe lived in rural Utah during the Great Depression\n\nand didn't have work and had 14 children to feed.\n\nThe WPA gave him employment,\n\nbut more than just employment to be able to feed his family,\n\nit gave dignity and it gave purpose.\n\nSome of these public works included famous buildings such\n\nas the Griffith Observatory in LA .\n\nThey built schools,\n\nthey built libraries,\n\nthey built town halls all across the country.\n\nThey helped improve parks.\n\nNow, some of the criticism of the WPA\n\nand the CCC where these were make work programs,\n\nthey had them do things that weren't needed.\n\nFor instance, my other grandpa, the WPA,\n\nbuilt an outhouse in their backyard.\n\nOne can say we don't need the government to come in\n\nand build outhouses for people.\n\nBut on the other hand, we know through long re years\n\nof economic research that the longer you're unemployed,\n\nthe more harm you have in your total lifetime earnings.\n\nIt's harder to go back into the workforce and find a job.\n\nAnother criticism comes from the very first African American\n\nto get a PhD in economics.\n\nSadie Alexander Moser, she was a huge critic of the New Deal\n\nbecause it was implicitly designed\n\nto exclude African Americans.\n\nNow there was no direct racial language in any\n\nof these programs, but primarily most African Americans\n\nworked either as domestic household servants\n\nor as tenant farmers.\n\nAnd programs such as the introduction of minimum wage,\n\nexplicitly excluded domestic workers.\n\nSocial Security that was set up in 1935 explicitly excluded\n\ndomestic workers as well.\n\nShe felt that African American tenant farmers were being\n\npushed out by the aid that was given to the large farmers,\n\nbut not to the smaller ones.\n\nA Redditer asks, what did Americans eat\n\nduring the Great Depression?\n\nSurprisingly,\n\neconomic productivity increased throughout the thirties.\n\nWe started getting better technology.\n\nMore households owned a refrigerator by the end\n\nof the thirties than they did in 1930.\n\nThis meant you can eat food that spoils more.\n\nSo if you look at studies of their diet, they ate more fruit\n\nand they ate more meat in 1940 compared to\n\nwhat they were doing in 1930.\n\ncauliflowernice asks, wait,\n\nwhy did the Federal Reserve do nothing\n\nduring the Great Depression?\n\nWhere is the money? This is a really important question.\n\nThis is everything.\n\nThe Fed, some argue, basically caused the whole thing.\n\nMilton Friedman said that the decline in the money supply\n\nbetween 1929 and 1933 was a huge increase in it.\n\nBen Bernanke recently won the Nobel Prize\n\nfor his work on the Great Depression where he said,\n\nwhen a bank collapsed, it lost information.\n\nSo say you need a loan to get your business going,\n\nyou're gonna go to the bank and ask for it.\n\nThat bank will give you a loan 'cause they know who you are.\n\nThey know you're good for it and\n\nthey know you'll pay it back.\n\nBut if that bank collapses, now you gotta go\n\nto a new bank and now you're a stranger.\n\nYou can bring your paperwork, you can bring a letter\n\nof recommendation, but they really don't know who you are.\n\nAnd that asymmetry\n\nin information caused even more economic decline.\n\nBen Bernanki became the Fed chair during 2006\n\nand led us through the Great Recession\n\nand his biggest thing was\n\nto prevent more banks from falling.\n\nWe've known since 1873\n\nin Walter Paget's book that Central Banks' jobs\n\nare to be a lender of last resort.\n\nIf the private economy isn't lending to each other,\n\nthe central bank needs to lend to these banks.\n\n'cause otherwise good banks who\n\notherwise have a great business are gonna go over just\n\nbecause they're in the middle of a crisis.\n\nSo why didn't they act?\n\nOne reason is this, the Federal\n\nReserve was smaller back then.\n\nMost of the banks that collapsed in the thirties were small\n\nrural banks, not necessarily under the federal system.\n\nAnd one of the changes in the thirties was\n\nto expand the role of the Federal Reserve's influence\n\nso that they can help save other banks.\n\nAnother one is they were constantly concerned about\n\nstaying on the gold standard.\n\nPeople were worried about inflation coming along, even\n\nas they were watching the opposite deflation coming along.\n\nThe United States Federal Reserve was created in 1913\n\nas a response to the crisis of 1907.\n\nThe fact that the next big crisis came along\n\nand they didn't prevent it is a huge stain on the history\n\nand a huge lesson for us today.\n\nniceguybadboy asks, how much truth is there\n\nto the stories of hitherto wealthy people throwing\n\nthemselves out of windows when the market crashed in 1929?\n\nNot a lot.\n\nThere were some international\n\nreports that this happened.\n\nReally gruesome stuff about bodies strewn on the ground.\n\nBut when we dig into the history, we don't really see it.\n\nJJVMT asks,\n\nwhy do massive job creation projects like FDRs Works\n\nProgress Administration seem to have largely gone away\n\nby the late 20th century?\n\nWhen you have millions of people\n\nwho are unemployed, anybody working,\n\ndoing anything is important.\n\nBut eventually the economy recovers.\n\nWe had 25% unemployment in 32.\n\nIt comes down to about 9% in 37,\n\nbumps up in 38 again.\n\nBy the beginning of World War II, we're back down to 9%\n\nand by the end of World War II, we're only at 2%\n\nunemployment.\n\nWhen the rest of the economy's humming on all cylinders,\n\nyou don't need public programs to get people to work.\n\nThere is a large debate about whether the government should\n\nalways have this public jobs option\n\nso that we reduce unemployment to zero all the time.\n\nThe debate here is about efficiency.\n\nMarkets when they function, have a huge power\n\nto put in information from all these buyers\n\nand all these sellers and allocate our scarce resources\n\nto the most efficient part.\n\nGovernments are gonna be more clunky to do that,\n\nand so if your public sector is too big, it distorts\n\nwhat the economy can do.\n\nAnd we underperform, leading\n\nto less long run economic growth and prosperity.\n\nbretth1100 asks, was World War II really\n\nwhat ended the Great Depression?\n\nThe economics of war is war is bad.\n\nWar is bad for your economy.\n\nThe reason the US did so well in World War II is basically\n\nbecause the fighting didn't happen here.\n\nBut you look at Europe and they collapsed.\n\nIt had two giant civil wars\n\nduring the first half of the 20th century.\n\nNot good for their economy.\n\nIt's a whole lot better to build houses,\n\nto build businesses than it is to build weapons and bombs.\n\nOn the other hand, World War II gave a reason\n\nfor the government to increase their spending at levels\n\nthat they hadn't seen ever in the history of the country.\n\nAnd they did this through deficit spending.\n\nThat means through borrowing.\n\nThis is a relatively new idea.\n\nUnder Hoover and under FDR,\n\nthey originally wanted to balance the budget.\n\nJohn Maynard Keynes was an economist back in England\n\nand he is the most influential economist in the 1920s.\n\nThe modern study of macroeconomics\n\nbasically can get its start\n\nlooking at this guy.\n\nWhen he published his book,\n\nhis General Theory in 1936,\n\nand from his writings that he had been doing\n\nin the years previous,\n\nhe said, during a recession, the government needs to step in\n\nand be the spender of last resort.\n\nAnd in his world, it didn't matter\n\nwhat you spent on, anything is better than nothing.\n\nThis position has largely been dominant in the years since.\n\nEvery time the economy experiences a recession,\n\nthe government is going to increase its deficit spending.\n\nDuring COVID, we spent $5 trillion to make sure\n\nthat folks were taken care of, and they were.\n\nThe amount of economic suffering we had in the 2020\n\nrecession was a fraction of what we saw just previously.\n\nStudying macroeconomics\n\nand learning how to prevent catastrophes, like recessions\n\nand massive depressions, is one\n\nof the most important things we can do.\n\nWe want to prevent economic suffering.\n\nWe want to encourage prosperity for everyone. And that's it.\n\nI hope you've learned something.\n\nI hope we can prevent these catastrophes\n\nfrom ever happening again.\n\n[steady upbeat music]",
  "authors": [
    "Condé Nast"
  ],
  "url": "https://www.wired.com/video/watch/tech-support-economics-professor-answers-great-depression-questions"
}