{
  "title": "Jen Easterly On The Future of Cybersecurity and Her Agency's Survival",
  "text": "Transcript\n\nAt the end of the day, this is really a world where\n\na major conflict in Asia,\n\nthe potential invasion or blockade of Taiwan\n\nby the PRC could have very real consequences here in the US,\n\nyou could see pipelines being affected,\n\nwater being affected, telecommunications being severed.\n\nWired sat down with outgoing CISA Director Jen Easterly\n\nto talk about her time in Washington\n\nand the future of US cybersecurity,\n\nthis is the big interview.\n\n[upbeat music]\n\nHi Jen, I'm so happy to be here with you.\n\nYou're in your last days as the director of CISA.\n\nHow are your last days feeling?\n\nWell, it's bittersweet, of course.\n\nThis has been the best job I've ever had and the best team\n\nand every day it's been a privilege to come into work here,\n\nso it's a little bittersweet to be leaving,\n\nbut I feel really, really good about\n\neverything that we've been able to do.\n\nOf course, there's a lot of unfinished business,\n\nbut I think we have set a good path for the incoming team.\n\nI know my team is excited to continue\n\nto drive forward on the many priorities that we've set,\n\nbut all good things come to an end\n\nand looking forward to next adventures.\n\nAnd you've been here three and a half years, right?\n\nYeah, I came in, I was nominated in April,\n\nconfirmed in July, so over three and a half years.\n\nAnd then I was actually part of the transition team,\n\nI was the Cyber Policy Lead\n\nwhen I was still at Morgan Stanley.\n\nSo was working these issues early on\n\nand in fact, when I was the cyber policy lead,\n\nit was during the SolarWinds.\n\nSo that was a very interesting incident to observe,\n\nboth from being in the private sector,\n\nbut also being part of the transition team to see\n\nhow far we could come and frankly how far we have come\n\nwith respect to being able to secure the.gov,\n\nthe federal civilian executive branch.\n\nAnd so that was a useful sort of marker for me.\n\nThat must have been a really interesting vantage point\n\nand a good learning experience.\n\nI didn't realize that that was exactly the timing\n\nof when you came in because you know,\n\none thing we're gonna talk a lot about you and your tenure,\n\nbut one thing I wanted to bring up that I'm sure\n\nit's top of mind for everyone,\n\nand I'm sure it's something you've been engaged with,\n\nis revelations recently about Chinese espionage\n\nand hacking in US telecoms.\n\nSo I'm interested to know what you observed\n\nin that other situation,\n\nwhich was obviously Russian hackers, different situation,\n\nbut how were the lessons learned there then applicable\n\nwith the work you all are doing now in this response?\n\nWell, certainly what we saw in December of 2020\n\nwith the revelations about the intrusions\n\ninto federal government networks\n\nas well as businesses around the world,\n\nwas a pretty sophisticated supply chain espionage operation.\n\nAnd off the back of that, there were a lot of things\n\nthat were put in place in 2021\n\nto include through the executive order 14028,\n\nwhere a lot of the responsibilities came to CISA,\n\nthere was also some money that came to CISA\n\nthrough the American Rescue Plan Act,\n\nand I would say the bumper sticker\n\nwas to finally allow CISA\n\nin our role as America's Cyber Defense Agency\n\nand as the national coordinator\n\nfor critical infrastructure resilience and security\n\nto manage the .gov as an enterprise,\n\nnot as a disparate tribe\n\nof a hundred separate departments and agencies.\n\nSo what we've been able to put in place\n\nacross the so-called fseb, the.gov,\n\nover the past three and a half years,\n\nhas given us enormous visibility that we never had before\n\nand has allowed us to detect intrusions much more rapidly\n\nto be able to remediate them\n\nand to get ahead of future intrusions\n\nby understanding from an analytic perspective\n\nwhat exactly is happening on the .gov.\n\nAnd then frankly, using that information\n\nto be able to enrich our work with critical infrastructure\n\nbecause all of our networks are connected,\n\nthey're vulnerable in many ways.\n\nAnd so understanding and enriching what we know\n\nfrom what we see on the .gov\n\nto what we see in critical infrastructure has also been\n\na really important evolution.\n\nWith respect to China, as you know Lily,\n\nwe've been talking about this for years.\n\nThe big thing for me that changed\n\nbecause certainly I've been doing\n\ncyber for a very long time.\n\nWe were always very focused on the PRC\n\nwith respect to espionage campaigns and data theft\n\nand intellectual property theft.\n\nAnd we're certainly seeing that now\n\nwith this so-called salt typhoon campaign\n\nwith intrusions into our telecommunications infrastructure.\n\nBut the big thing for me was seeing\n\nintrusions into our critical infrastructure,\n\nnot for espionage,\n\nbut rather specifically for disruption and destruction.\n\nAnd we've talked a lot about that,\n\nI testified earlier this year,\n\nbut at the end of the day, this is really a world where\n\na major conflict in Asia,\n\nthe potential invasion or blockade of Taiwan by the PRC\n\ncould have very real consequences here in the US.\n\nYou could see pipelines being affected,\n\nwater being affected, telecommunications being severed,\n\nrail lines, power, exactly.\n\nAnd that is all part of a very deliberate effort\n\nby China to incite what they call societal panic\n\nand to deter our ability to marshal military might\n\nand citizen will.\n\nThis is all part of a very deliberate campaign\n\nand that's why we have been so laser focused,\n\nleveraging our technical talent at CISA\n\nto be able to work with the private sector to identify\n\nand eradicate these types of actors from their networks\n\nto provide mitigation and hunting,\n\nguidance, hardening guidance in\n\nwhat we just put out for telecommunications,\n\nguidance on how to communicate securely.\n\nYou saw that in some of our recent guidance\n\non end to end encryption,\n\nencrypted communications, which is really important.\n\nAnd then to work through mechanisms\n\nlike our joint cyber defense collaborative\n\nthat we stood up in August of 2021\n\nto work with a wide variety\n\nof those critical infrastructure sectors,\n\npower, telecommunications, aviation, transportation,\n\nto ensure that we have a common picture of the threat\n\nand that these entities know what they need to do\n\nto reduce risk.\n\nI think one of the most important things,\n\nand you and I have talked about this before,\n\nvis-a-vis Ukraine when we did a panel together\n\nwith Viktor Zhora of the Ukraine Cyber Defense Agency\n\nis really the importance of resilience.\n\nIt is gonna be extremely difficult\n\nto prevent disruption in a scalable way,\n\nand so we have to prepare for it.\n\nWe have to acknowledge that disruption may occur,\n\nbut the way that we train our people, how we exercise,\n\nhow we architect our systems needs to enable us to detect,\n\nrespond, and then recover\n\nso that we can mitigate the downtime\n\nfor critical infrastructure services\n\nthat are necessary for the American people.\n\nDo you think the espionage operations\n\nare getting too much focus and that actually,\n\nthere needs to be more focus\n\non this critical infrastructure infiltration?\n\nThat activity is tracked under this group volt typhoon.\n\nIs there maybe what folks are talking about\n\nin the public sphere is different than the focus\n\nat an agency like CISA or what's the balance there?\n\nYeah, I mean we are very focused overall\n\non PRC cyber actors,\n\nwhether they're the so-called salt typhoon\n\nfocused on espionage,\n\nwhether it's volt typhoon,\n\nfocused on disruption and destruction,\n\nwe are focused on working with our federal partners,\n\nwith our industry partners\n\nto be able to identify these actors and intrusions,\n\neradicate them and harden our networks.\n\nI think we should not get too down the rabbit hole.\n\nAnd is it salt, is it flax, is it volt?\n\nAt the end of the day, China, as we've seen in\n\nassessments from the intelligence community,\n\nis the most formidable, persistent cyber threat\n\nthat we are dealing with, that we will deal with.\n\nAnd it's why frankly very early on when I got here, Lily,\n\nI felt I needed to get what are the big ideas, right?\n\nYou're leading a federal agency,\n\na fairly new federal agency,\n\none that's been through a huge effort to organize it,\n\none that's just been after a pandemic,\n\na contentious election.\n\nSo what are the big ideas\n\nto build America's cyber defense agency?\n\nAnd that was all about how do we catalyze\n\nand mobilize collaboration,\n\ncollaboration with industry, with international partners,\n\nwith state and local partners.\n\nAnd to do it in a way that's not the old hack needs stale\n\npublic private partnerships where you go meet once a month\n\nand share secret level information,\n\nit's really ongoing, real time work together\n\nwith a recognition that if your critical infrastructure,\n\na threat to one is a threat to many,\n\ngiven the interdependence of networks.\n\nIt's also a recognition that the federal government\n\nhas to be responsive, has to be transparent,\n\nhas to add value.\n\nThat was very much informed by my time at Morgan Stanley.\n\nAnd that you really needed these scalable platforms.\n\nSo the collaboration piece,\n\nthe fact that big corporations\n\nneeded to recognize this threat\n\nas a existential business risk,\n\none that they needed to prepare for and really manage,\n\nnot as something that the IT folks deal with,\n\nbut manage as a matter of good governance.\n\nSo this idea of corporate cyber responsibility,\n\nbecause as you know,\n\nthe vast majority is owned by the private sector,\n\nthey are now on the front lines,\n\nthey are on the front lines of the cyber fight.\n\nSo they have to recognize\n\nthat they have a really important role\n\nin managing that cyber risk and working with the agencies\n\nto help us mitigate that risk.\n\nSo this whole idea of corporate cyber responsibility,\n\nthe other one was cyber civil defense.\n\nMy friend Craig Newmark talks about this,\n\nbut I love to think about this\n\nin our campaign for secure our world.\n\nThe whole idea is make cyber hygiene as common as\n\nphysical hygiene.\n\nWashing your face, brushing your teeth,\n\nit's the whole campaign inspired by schoolhouse rock\n\nthat we did a whole music video.\n\nThe idea is you want to make cyber sexy and cool,\n\nnot something that's scary\n\nbecause if people are scared by things,\n\nthen their brain shuts down.\n\nMake it cool, make it fun, make cyber sexy,\n\nthat's been one of the things I've been driving towards.\n\nAnd then the last thing is secure by design.\n\nAnd that's make cyber sexy, make technology safe.\n\nFor decades, we've accepted a world where\n\ntechnology has been delivered to us full of vulnerabilities.\n\nAnd so we've spent time glorifying the villains\n\nand blaming the victims.\n\nWe have to now hold vendors accountable\n\nfor designing and developing and testing and delivering\n\nsoftware and technology\n\nthat is specifically focused\n\non driving down the number of exploitable flaws.\n\nSo you think about those big ideas\n\nand that's what we've been driving towards.\n\nAgain, a lot of unfinished business.\n\nBut when you think about the continued ransomware attacks,\n\nwhen you think about the continued attacks from China,\n\nthat we can expect to continue,\n\nthese are not exotic attacks,\n\nthese are attacks that are using\n\nfor the most part, known vulnerabilities.\n\nAnd so ensuring that the tech that we rely upon\n\nis as secure as possible is incredibly important as well.\n\nAnd I wanna ask you more about\n\nholding vendors accountable,\n\nby tying into the other thing you were saying about,\n\npublic private partnership and developing that rapport,\n\nhas been concerning to see how difficult it seems\n\nto have been for the telecoms\n\nto eradicate the Chinese hackers from their networks\n\nand to be certain or be very confident.\n\nHas there been progress\n\non some of those things that you're talking about\n\nin terms of being able to have that transparency\n\nand insight into what's actually going on?\n\nYeah, it's a really important question.\n\nSo after the revelations of these breaches,\n\nwe stood up what's called a Unified Coordination Group,\n\nwhich brings together the federal agencies, CISA, FBI,\n\nthe intelligence community.\n\nWe are focused on the response, so we are responding.\n\nFBI is going after, they're investigating,\n\ngoing after potential threat actors.\n\nThe IC folks like the National Security Agency are using\n\nwhat we see in the intelligence to understand\n\nthe extent of this intrusion by foreign actors.\n\nAnd we're coming together to work with\n\nthose known and suspected victims,\n\nand so we've been doing that for months now.\n\nI understand that some of the victims\n\nhave talked about being able to remediate these threats\n\nand I think that that's gonna be a long-term effort.\n\nI mean this has unfortunately been out in the press a lot\n\nand anything that gets-\n\nUnfortunately too!\n\nAnything that gets out there has the downside\n\nof having adversaries change their tactics.\n\nSo while I think the transparency to consumers is important,\n\nit also makes it more difficult\n\nto then find these actors within the networks.\n\nSo while they're using\n\nknown defects and technology to get in,\n\nonce they're in, they are hard to find.\n\nAnd in fact, CISA and this is one reason\n\nI'm so proud of the incredible technical talent of our team,\n\nit's one of the few agencies in the government\n\nthat have been able to find both volt typhoon\n\nwithin critical infrastructure as well as salt typhoon.\n\nAnd in fact, it was our work to find salt typhoon\n\nthat then led to law enforcement\n\nbeing able to identify virtual private servers\n\nthat were being leased by the adversaries.\n\nAnd then that unraveled the wider campaign.\n\nAnd that's just an example\n\nof some of the things that we're doing\n\nthat have helped improve our ability\n\nto manage the security of the .gov.\n\nBut this is a long-term effort, frankly,\n\nand I don't expect it to be remediated in the short term,\n\nthat's why at the end of the day,\n\nwe need to focus on resilience.\n\nOn the telecommunications infrastructure more broadly,\n\nwe have to understand that comms,\n\njust like my point on software and technology,\n\nthese systems were basically architected\n\nfor speed and efficiency,\n\nThey weren't built with security as top of mind,\n\nsecurity is in many ways in telecommunications\n\nand other aspects of critical infrastructure\n\nhas been bolted on because at the end of the day,\n\na lot of this technology was developed for speed,\n\nfor driving down cost, for cool features,\n\nsecurity was an afterthought and a bolt-on,\n\nand that's why we have a cybersecurity industry\n\nand jobs like mine.\n\nSo when I talk about the story of cybersecurity,\n\nI actually wanna work myself out of a job,\n\nI want to envision a future where ransomware\n\nis a shocking anomaly\n\nwhere damaging software vulnerabilities\n\nby nation state actors are as infrequent as plane crashes.\n\nA world where the technology\n\nthat we've come to rely on every hour of every day\n\nis first and foremost secure so that we can believe in\n\nwhat we are using\n\nand what is driving and powering our daily lives\n\nas something that is safe for ourselves, for our families,\n\nfor our small businesses.\n\nAnd that's the work that we've been catalyzing.\n\nThere's much more work to do,\n\nbut I think we have laid out a roadmap.\n\nAnd the most important thing\n\nabout getting those big ideas right,\n\nwas before we were able to put any of that into play,\n\nwas we had to have the right talent and the right culture.\n\nStarting from day one frankly, it was making sure\n\nthat we could retain the talent we have\n\nand then hire some of the incredible world class talent\n\nthat has been able to find these threat actors,\n\nhelp to eradicate and evict them,\n\nand then to ensure that we are working collaboratively\n\nwith our partners to help them drive down risk\n\nto the critical infrastructure Americans rely on.\n\nWhen you were talking before\n\nabout how in the wake of SolarWinds,\n\nthere were opportunities for CISA\n\nto expand its funding, its powers.\n\nDo you feel like the agency has the levers of control now\n\nthat it needs to do its work?\n\nWe are much bigger than when I started,\n\nin terms of number of people, we're about 3,400 people.\n\nWe've hired over 2,100 people since I came on board,\n\nwhich is pretty incredible when you think about\n\nthe talent that is very mission driven,\n\nbut they could go get paid a lot more money\n\nin the private sector,\n\nso really proud of that, our budget is nearly $3 billion.\n\nWe have much more authorities,\n\nto include some of the authorities we got\n\nout of the cyberspace solarium commission,\n\nlike the Joint Cyber Planning Office,\n\nwhich we made the Joint Cyber Defense Collaborative,\n\nlike our ability to persistently hunt on federal networks.\n\nThat has allowed us to discover things like\n\nthe salt typhoon campaign that I mentioned.\n\nSo I think we are in great shape right now.\n\nWhat I would just tell my successor, first of all,\n\nyou're inheriting the best job in government.\n\nBut I would also say,\n\nlook, we are America's cyber defense agency.\n\nWhen you compare our size to the law enforcement agencies,\n\nthe investigative agencies or the intelligence agencies,\n\nwe are much smaller,\n\nbut I think we punch far above our weight.\n\nThe magic of CISA is the fact that\n\nwe are a partnership agency, a voluntary agency\n\nand everything we do is rooted\n\nin being able to catalyze trusted partnerships.\n\nAnd so it's not authorities\n\nto force compliance or enforcement.\n\nWe're not a regulator, we're not a military agency,\n\nwe don't collect intel, we don't do law enforcement.\n\nEverything we do is by, with and through partners,\n\nproviding no cost services and capabilities\n\nto enable critical infrastructure entities\n\nto manage and reduce risk.\n\nAnd I'm really proud of where we are,\n\nbut there's much, much more work to be done.\n\nAnd do you think the new administration\n\nwill be supportive of that?\n\nOn the one hand, in his first term,\n\npresident Trump was actually the one who elevated CISA\n\nto be an agency, full fledged agency.\n\nBut on the other hand, there have been some comments\n\nthat make it seem like perhaps his administration\n\nis no longer sort of putting a priority\n\non the mission of the agency.\n\nSo are you concerned about that?\n\nNo, I'm not concerned about it.\n\nI think anybody that takes a hard look at what CISA is,\n\nthe talent that we have,\n\nwhat we accomplished over the last several years\n\nwill appreciate the value that we bring\n\nto the American people.\n\nAnd CISA success is the success of the American people,\n\nit's national security.\n\nAnd while I know there's been a lot of\n\ndiscussion of politics and partisanship,\n\nat the end of the day,\n\ncybersecurity critical infrastructure security\n\nis not a political issue, it's not a partisan issue.\n\nAnd the American people understand that.\n\nAnd I grew up in a world\n\nwhere we didn't think at all about politics,\n\nI was a military officer,\n\nI worked for President George W. Bush, president Obama,\n\nnow President Biden, I am never driven by politics,\n\nI'm driven by mission.\n\nAnd I think that is very much the spirit and ethos\n\nof folks within CISA, we are very focused\n\non driving down risk to the American people.\n\nIf you just look at, for example, the elections,\n\nthe elections when election infrastructure\n\nwas designated as critical infrastructure in 2017,\n\nthat really was a no trust environment.\n\nThe states didn't want the federal government\n\nat all involved in elections,\n\nwhich are run by state and local officials.\n\nAnd it took a lot of work by my predecessor and that team\n\nand now my team to move from a no trust,\n\nlow trust environment to a pretty high trust environment.\n\nI mean, one of the things that I'm most proud about\n\nover the past several months\n\nwas our work with election officials across the country,\n\nto include some very conservative\n\nRepublican secretaries of State,\n\nspending time with Dave Scanlan up in New Hampshire\n\nwith Phil McGrane in Idaho.\n\nAnd then we spent time at the Midwest\n\nElection Security Summit with Bob Evnen of Nebraska,\n\nScott Schwab of Kansas,\n\nPaul Pate of Iowa, Jay Ashcroft of Missouri,\n\nMonae Johnson of South Dakota,\n\nand so this really shows people out in America\n\nwhere the work actually happens\n\nlook at us as an agency that is there to help.\n\nI think one of the things\n\nthat's been really important, Lily,\n\nis we have put an enormous amount of effort\n\ninto building our field force,\n\nas we've grown those 2,200 hirees,\n\nwe've built hundreds in our force of cybersecurity advisors,\n\nphysical security advisors who are out in every state\n\nto work with critical infrastructure owners and operators,\n\nbusinesses, large and small,\n\nto work with election officials,\n\nstate and local officials.\n\nAnd these are folks from those areas.\n\nSo while you may not, trust the federal government,\n\nif you're sitting in a state somewhere,\n\na very conservative state,\n\nyou trust your cybersecurity advisor\n\nwho you've known for years and years.\n\nAnd so that comes with sort of a built in ability\n\nto build those relationships.\n\nSo I'm very aware people don't trust institutions,\n\npeople trust people.\n\nAnd it's why everybody in CISA is very focused on\n\nnot only having the technical talent\n\nto enable us to understand and reduce risk,\n\nbut to build collaborative partnerships, right?\n\nIt's about developing those relationships\n\nto allow us to work together to reduce risk to the nation.\n\nAnd frankly, it's why I've been all over the world,\n\nall over the country to help us build that trust,\n\ncatalyze that trust, advance those partnerships\n\nin a way that we can work together\n\nfor the collective defense of the nation.\n\nLet's say this, defense is hard, right?\n\nWe know that.\n\nAnd when you were talking about holding vendors accountable,\n\nwanting to make these exploitable vulnerabilities,\n\na plane crash once in a blue moon rather than\n\nso common, are we getting there on that?\n\nIt feels like on endpoints on,\n\nin some ways there has been a lot of progress on,\n\nthat type of detection,\n\nbut then things move to the periphery,\n\nthey move to network devices, cloud,\n\nthe ongoing need for account hygiene and account security.\n\nSo are we winning, can you win at defense?\n\nDo you worry about that?\n\nYou're right, defense is hard.\n\nI say that as the America's cyber head goalie\n\nand that's why it has to be a team.\n\n'cause you need all those levers of power.\n\nAs much as we work to hunt for and eradicate Chinese actors\n\nand work with critical infrastructure to build resilience,\n\nour partners need to hold those actors accountable\n\nand to be able to hold our adversaries at risk.\n\nWhether that's through offensive cyber capabilities,\n\nwhether that's through indictments or sanctions,\n\nand so that's when we talk about cyber as a team sport.\n\nBut yes, we're on the defensive side and it's a challenge.\n\nI think we are making progress,\n\nwe have seen when we launched this\n\nsecure by design campaign, I like to call it the revolution,\n\nbut at the end of the day, this has been something that\n\nthere have been thought leaders talking about\n\nfor years and years and years.\n\nWe wanted to give it a platform\n\nthat was really highlighted\n\nby some of my fantastic technical experts.\n\nStarted working on this,\n\ntalked about it first in November of 2022,\n\nthen launched it at Carnegie Mellon\n\nin a big speech in early 2023,\n\nand then came together with our federal partners,\n\nwith international partners\n\nto start laying out the key principles for secure by design.\n\nLater that year,\n\nwe locked arms with our international partners,\n\nbut importantly, we worked very closely\n\nwith technology vendors.\n\nAnd you saw that in the pledge that we launched at RSA\n\nstarted out with 68 technology vendors, now we're over 260.\n\nAnd these are vendors who voluntarily committed\n\nto make significant and measurable progress on key areas,\n\nwhether that's enabling of multi-factor authentication,\n\nreducing default passwords, moving towards memory safety.\n\nAnd several of them have already started publishing\n\nprogress that they've made.\n\nAnd look, at the end of the day,\n\nthese technology vendors want to create safe products,\n\nit's just decades and decades\n\nwhere it hasn't been a priority,\n\nit's been driving down cost, it's been features,\n\nit's been speed to market for competition.\n\nAnd so I think we really have seen\n\nvendors grasping onto this.\n\nYou remember Ralph Nader wrote this bestselling book in 1965\n\nall about car crashes.\n\nCars were not focused on being safe,\n\nand I talk about secure by design\n\nas unsafe at any CPU speed.\n\nAnd you think about from 1965,\n\nI think it wasn't until 1983\n\nwhen the first state mandated use of seat belts.\n\nSo it took a long time.\n\nIt takes time, yeah.\n\nBut what I'm excited about Lily,\n\nis I think we can get there quicker.\n\nGPU speed.\n\nYes, maybe exactly, exactly.\n\nyou're going in my, you're speaking my language sister.\n\nSo it's AI,\n\nI think we can use the incredible power of AI\n\nand that's why we've been so excited about\n\nhow do we use generative artificial intelligence\n\nin large language models for cyber defense?\n\nSo when you think about, for example,\n\nnot to geek out on you too much,\n\nwhen you think about, when you think about\n\ntwo thirds of software vulnerabilities are memory safety\n\nvulnerabilities, right?\n\nSo buffer overflow or use after free vulnerabilities,\n\nand when you think about SQL injection,\n\nif you can drive down,\n\nif you can move from memory unsafe to memory safe.\n\nSo moving from C and C++ to things like Rust,\n\nrefactoring that code\n\ncan drive down the number of software vulnerabilities.\n\nAnd so I'm excited about how fast this is moving.\n\nI wanna make sure that these capabilities\n\nare built to also be secure by design.\n\nAnd so we've been extending\n\nwhat we've been working on in software into AI\n\nand that's been a huge effort\n\nand a lot of fun, frankly,\n\nunder the leadership of our Chief AI officer.\n\nBut just think about using these capabilities.\n\nThis can accelerate our ability\n\nto get to a secure by design future.\n\nAnd what does that mean?\n\nIt doesn't mean perfect cybersecurity,\n\nwe're never gonna get to perfect cybersecurity,\n\nbut what we can get to is a technology ecosystem\n\nthat is much safer, much more secure,\n\nand frankly, defensible.\n\nSo driving down the number of exploitable defects,\n\nexploitable flaws that can really be accelerated\n\nby the use of generative AI,\n\nso I'm super pumped about that.\n\nSo I have to ask you, there's rumors,\n\nare you or are you not going on tour when you leave CISA?\n\nI certainly hope to be,\n\nyou and I actually met over a mutual friend Meryl Goldberg.\n\nYou wrote a fantastic article about\n\nher time in a Klezmer band\n\nand being in the Soviet Union and encoding music.\n\nAnd she and I ran into each other in the green room at RSA\n\nand I saw these instruments, the saxophone,\n\nand I was like, oh my gosh, what's happening?\n\nAnd that started this wonderful friendship.\n\nWe have bonded over music.\n\nI played piano and guitar when I was young,\n\nbut I really started with electric guitar\n\nwhen my son started taking it up during COVID.\n\nOh, there you go.\n\nAnd it's been the thing that has,\n\nbecause I love all kinds of music,\n\nthat's what's behind the joint Cyber Defense Collaborative.\n\nBut I started taking up electric guitar\n\nand that has been become my passion, my obsession.\n\nAnd as we were really focused on election security\n\nover the past couple months, I wasn't able to practice,\n\nbut now I'm getting back to it.\n\nSo I hope my big post-retirement plan several years from now\n\nis to start this bar, to have a band.\n\nWe're gonna do magic, we're gonna do improv,\n\nI'm gonna be the bartender, and so.\n\nIs there gonna be a cyber tie in or?\n\nWell, there'll always be some cyber tie in.\n\nMy team, I really wanted to start my own podcast in this job\n\ncalled, Bourbon and Bites,\n\n'cause I'm a big old fashioned fan,\n\nbut they didn't like the whole bourbon thing.\n\nSo there could be some podcasting from the bar.\n\nThere you go, okay.\n\nBut the cyber will always\n\nbe a part of my life no matter what I do.\n\nSomething I've done forever\n\nand I'm very passionate about the importance of\n\nensuring that we secure our world.\n\nFor everybody from K through Gray.\n\nAnd it's one of the things that's been motivating me\n\nto make cyber sexy and make tech safe.\n\nWill there be Rubik's cubes\n\nat every table in the bar?\n\nThere will, there will be Rubik's Cubes.\n\nI'm also sort of obsessed with the Rubik's Cube\n\nand I think we might have talked about this before,\n\nbut, so this is actually a CISA Cube\n\nand I like to think of it as a kind of a magic cube.\n\nBut let's see here, oh, there we go, all right, so.\n\nOh, there we go.\n\nThere we go, solve this CISA cube.\n\nBut I love this thing because when I was 11,\n\nthese things were introduced into the world\n\nand I was a huge puzzler and a video game person,\n\nand I became obsessed with it, learned how to solve it,\n\nand then I would go to toy stores,\n\nsay, I was this little kid with pigtails,\n\nif I can solve this in less than two minutes,\n\nwill you give me a free one?\n\nSo I was able to amass this whole.\n\nThe whole trove.\n\nAnd the reason I love it is because Erno Rubik,\n\nwho invented the thing, talked about, if you are curious,\n\nyou will find the puzzles around you.\n\nAnd if you are determined, you will solve them.\n\nAnd when I think about\n\nthe type of incredible technical talent\n\nthat we have here at CISA,\n\nyou think about the intellectual curiosity,\n\nit's the hacker mindset, it's the problem solver,\n\nbut it's the determination, the relentless drive\n\nto solve the most complicated problems out there.\n\nAnd that's, sort of symbolized in the CISA Cube.\n\nWell, it's really a pleasure to talk to you.\n\nYou as well.\n\nThanks so much for joining us.\n\nThank you as well, Lily.\n\n[upbeat music]",
  "authors": [
    "Condé Nast"
  ],
  "url": "https://www.wired.com/video/watch/the-big-interview-jen-easterly"
}