{
  "title": "Chi è Bari Weiss, la giornalista passata dal New York Times alla guida di CBS News (passando per il suo The Free Press)",
  "text": "“Sono una donna omosessuale e so che molti di voi in questa stanza non avrebbero voluto che il mio matrimonio fosse legale… E va bene così, perché qui dentro tutti vogliamo abbassare le tasse”. Così due anni fa la giornalista statunitense Bari Weiss, classe 1984, si presentava alla Federalist Society, una potente organizzazione conservatrice, descrivendosi come una persona progressista nei costumi, ma liberista sull'economia.\n\nUna frase-manifesto che spiega bene la filosofia del personaggio al centro della storia mediatica più importante del momento, almeno negli Stati Uniti: l'acquisto da parte del colosso Paramount del sito The Free Press (150 milioni di dollari di valutazione) e il piazzamento di Weiss a capo della redazione di CBS News, con sede a New York. Una figura di cui probabilmente quasi nessuno in Italia ha sentito parlare.\n\nLa carriera di Bari Weiss\n\nTalento precoce e purissimo, laureata alla Columbia University, dove ha diretto un gruppo di pressione filoisraeliano tra i più agguerriti – un ricordo ci tornerà utile –, poi caporedattrice della sezione culturale del New York Times, Weiss diventa nota al grande pubblico nel 2018 con l'inchiesta che codifica l’intellectual dark web. Di cosa parla? Del circuito di pensatori eterodossi che sfidano a suo dire le “ortodossie” liberal. Jordan Peterson, Ben Shapiro, Douglas Murray, Joe Rogan e Steve Pinker, giusto per fare qualche nome.\n\nDue anni dopo, in polemica con la direzione, secondo Weiss influenzata dagli utenti più moralisti e woke, la grande scommessa: lasciare il NYT, cioè il posto a tempo indeterminato più ambito nel mondo del giornalismo d'oltreoceano (e non solo), e aprire una newsletter dal titolo Common Sense, attingendo proprio alla rete di intellettuali anti-liberali di cui sopra. Da lì nascerà una rivista polemica su Substack, The Free Press. I numeri sono impressionanti: in sei mesi 14mila abbonati paganti, abbastanza da \"guadagnare più del Times\", spiega lei.\n\nLa stagione The Free Press\n\nQuella testata in poco tempo diventa sempre più influente, oltre che il luogo dove gli scontenti dell'America di Biden portano dossier e sfoghi. Molte “scoop stories”, sostiene il giornalista David Klion, arrivano “da apparatchik trumpiani” e la loro regola d'oro è semplice: colpire “verso il basso e a sinistra”, ovvero i movimenti e gli intellettuali progressisti, e proteggere l’establishment economico.\n\nThe Free Press diventa una piattaforma per rilanciare una classe intellettuale ostracizzata o trascurata dell'élite tradizionale e rendendola (più o meno consapevolmente) un'alleata culturale del secondo regno di Trump. Non parliamo dei populisti di destra come Steve Bannon o della destra cristiana radicale di Charlie Kirk, ma di una galassia molto più brillante e presentabile dentro un paradigma reazionario. Weiss diventa la madrina di quest'operazione.\n\nL’operazione Paramount–Skydance\n\nMa come si è arrivati a 150 milioni di dollari di valutazione per un sito che, per quanto di successo, resta comunque fermo a 115mila abbonati paganti (stimati) e il cui canale YouTube difficilmente ha video che superano le poche migliaia di visualizzazioni? Qui entrano in scena David Ellison, figlio del fondatore di Oracle, Larry Ellison – oggi tra gli uomini più ricchi della Terra e mega-donor di Israele – e la sua società di produzione, Skydance.",
  "authors": [
    "Paolo Mossetti"
  ],
  "url": "https://www.wired.it/article/bari-weiss-giornalista-cbs-news-the-free-press/"
}