{
  "title": "The best Xbox controller to buy right now",
  "text": "Editor’s note: Black Friday doesn’t officially take place until Friday, November 28th; however, if you want to shop ahead of time, we’ve rounded up the best early Black Friday deals you can already get.\n\nWe live in a golden age of controllers. The gamepads on the market now are of higher quality, more versatile, and more customizable than anything from even one console generation ago. If you play games on an Xbox Series X or Series S (or a Windows PC), you have the unenviable task of choosing between several high-quality controllers from Microsoft as well as a plethora of great options from the likes of 8BitDo, PowerA, Razer, Scuf, GameSir, and Hyperkin. Some of them have drift-resistant Hall effect or TMR-based joysticks for improved longevity, yet all of them are good for one reason or another. The days of the cheap “little sibling” controller that looked cool but barely worked are over.\n\nWe’ve spent a ton of time playing all kinds of games (first-person shooters, fighters, third-person action-adventure, racing, indie roguelikes, etc.) to test a wide swath of Xbox controllers, and it may not be a surprise that the standard, Xbox Wireless Controller is the best option for most folks. It makes for a great PC and Steam Deck controller, too. The default Xbox gamepad strikes the right balance of quality, comfort, versatility, and price, but there are several alternatives worth considering.\n\nWhat we’re looking for How we test Xbox controllers Collapse We test Xbox controllers by playing with them for an extended period of time across a variety of genres. Our test targets include team-based arena games like Marvel Rivals, competitive shooters like Call of Duty, fighters like Tekken 8, and role-playing titles like Elden Ring. When doing so, we pay close attention to how all of the components feel. Are the triggers satisfying to pull? Do the analog sticks offer the right level of resistance? Are the D-pads and face buttons too mushy, or just right? If a controller includes customization options — such as adjustable trigger stops and sensitivity, and / or remappable back buttons — we test how easy they are to configure, then judge their impact on our gameplay experience. Connectivity Collapse Is it wireless? Does it support Bluetooth? Or is it wired only? If so, is the cable replaceable? Quality Collapse Does it feel cheap or nicely made? Any glitches or reliability issues while testing? Extra features Collapse Does it have handy extras, like remappable buttons or fancy triggers? Customization Collapse Can you remap buttons or tune it with custom software profiles? Value Collapse Is it priced affordably, about average, or does it come at a steep premium?\n\nThe best Xbox controller for most people\n\nConnectivity: Xbox wireless, Bluetooth, wired / Connector type: USB-C / Mappable rear buttons: No / Software customization: No / Power: AA batteries or add-on rechargeable\n\nOkay, I already know what you’re thinking. “The best controller for Xbox is the one that comes with the Xbox?” That may seem like a no-brainer, but this standard controller truly does earn this title as the best. It lacks some extras found on pricier options, but this controller is the distillation of all that has made the last 20 years of Xbox gamepads great, and it shows.\n\nThanks to Microsoft’s proprietary wireless protocol, the Xbox Wireless Controller is the only affordable wireless option out there. (Third-party wireless alternatives are available, but they’re mostly at the high end.) While some hate the standard Xbox wireless controller for its use of AA batteries instead of a built-in rechargeable cell, that also means it’s flexible, allowing for rechargeable AAs or a battery pack. And user-replaceable batteries mean you’re not stuck with a controller that doesn’t hold its charge after years of use. It also works over a USB-C wired connection.\n\nYou won’t find a better wireless controller at this price. Photo by Antonio G. Di Benedetto / The Verge\n\nBut the standard-issue Xbox pad isn’t just great because of its varied connectivity. The hardware itself is excellent for the controller’s $65 (and often less) asking price. The sticks, buttons, triggers, and the sunken dish-shaped D-pad all feel impeccably tight, with the latter having a satisfying clickiness to it. If you’re a hardcore fighting game fan, you’ll probably be best served by a dedicated fight stick or a controller geared toward that genre — one with a superb D-pad like Hori’s Horipad Pro — but the Xbox Wireless Controller is otherwise an extraordinary jack-of-all-trades.\n\nThe only things it really lacks compared to pricier options are extra, customizable buttons and software tuning for things like stick sensitivity (button remapping is available), though Microsoft does offer cosmetic customization through its Xbox Design Lab, which bumps the price from $79.99 to $124.93 depending on the configuration. There’s a lot to love about these controllers, whether you make your own or pick one from the many colors that Microsoft offers.\n\nThe best cheap Xbox controller\n\nConnectivity: Wired / Connector type: USB-C / Mappable rear buttons: Two / Software customization: Yes / Power: Wired\n\nThe 8BitDo Ultimate Wired Controller for Xbox is a fantastic budget model that typically retails for $44.99 but can often be found for as little as $29.99. The shape is reminiscent of Nintendo’s Switch Pro Controller, only a bit smaller, with hints of Xbox influence and a curvaceous design that feels great to hold.\n\nOn the hardware front, the Ultimate Wired Controller features Hall effect sticks with satisfying tension. It also uses Hall effect triggers with dedicated vibration motors, though it lacks trigger stops, unlike our previous budget pick, the PowerA Advantage Wired. Its D-pad, face buttons, and bumpers are nice and clicky, too, despite being smaller than we’d typically like. It has two rear paddles, remappable buttons, and the ability to save up to three profiles, which you can switch between on the fly using a dedicated button. There’s even a built-in mute switch for audio, which isn’t common on cheaper controllers. You can download the 8BitDo Ultimate Software X app on PC or Xbox to fully customize this controller.\n\n8BitDo controllers may be inexpensive, but that doesn’t mean they should be considered cheap. Photo: Quentyn Kennemer / The Verge\n\nThe 8BitDo Ultimate Wired works as a wired controller with your PC, but if you prefer wireless connectivity, the company also makes a three-mode wireless version for $69.99 with support for both Bluetooth and 2.4GHz wireless (via a dongle). The wireless version is a bit more expensive, however, and it’s still limited to wired connectivity on Xbox consoles.\n\nThe best “pro” Xbox controller\n\nConnectivity: Xbox wireless, Bluetooth, wired / Connector type: USB-C / Mappable rear buttons: Up to four / Software customization: Yes / Power: Built-in rechargeable\n\nThe Xbox Elite Wireless Controller Series 2 is Microsoft’s fanciest controller, and it’s got a lot of nice extras, like better build quality, extra buttons, user-swappable sticks and D-pad, a built-in rechargeable battery, and loads of software customization. Where the standard Xbox controller is constructed entirely of unassuming plastic, the Elite mixes higher quality soft-touch plastic, rubberized grips, and metallic touches for a superior fit and finish. This makes it heftier than the stock controller, and as a result, it just feels nicer in your hands. It also comes with a charging dock and zip-up case with passthrough charging, completing a really nice package for $199.99 (or sometimes less, if it’s on sale).\n\nThere’s also the stripped-down Elite Series 2 “Core” version with an MSRP of $149.99, which ditches the add-ons but is equally customizable. You can buy them separately in a $59.99 accessories pack, but you’ll end up paying more that way, barring sales or discounts.\n\nA pricey controller like an Xbox Elite is a bit of a splurge purchase. Most of us are not competing at e-sports levels that require its high-end features. Nevertheless, it’s fun to use something that feels nicer, offers ways to custom-tailor it to your liking, and maybe gives you a slight competitive edge thanks to features like hair triggers and removable rear paddles. In theory, you may be able to get shots off faster in an online shooter with the hair triggers, and you can map the paddles to functions like jump, crouch, reload, etc., while keeping your thumb on the right stick. You could teach yourself claw grip to accomplish the latter with even a cheap wired controller, sure, but it just won’t feel as cool or easy as when using an Elite.\n\nWhile the Elite is still a great controller in 2025, you should keep in mind that it’s been around since 2019 and a Series 3 revision is feeling long overdue. The Series 2 also has a bit of a reputation for lackluster quality control — with horror stories from users about going through multiple replacements under warranty. Microsoft extended the controller’s warranty from 90 days to a year in late 2020 to help address concerns, but buying an Elite Series 2 may still feel like a slightly risky proposition. It also predates the current-gen implementation of a dedicated Share button, and its potentiometer-based sticks run the risk of stick drift after long-term use (something third parties are addressing with controllers that use drift-free Hall effect sticks, unlike all three big console manufacturers).\n\nThe Elite Series 2 offers unprecedented customization with analog sticks and a D-pad you can pluck right off. Photo by Antonio G. Di Benedetto / The Verge\n\nEven so, the Elite 2 remains by far the most well-rounded option for a step-up Xbox controller — thanks in large part to its impressive build and expansive software experience. If all these caveats give you pause, though, there is another promising option.\n\nA formidable alternative to the Elite\n\nConnectivity: Wireless USB dongle (Xbox / PC), wired / Connector type: USB-C / Mappable rear buttons: Four / Software customization: Yes / Power: Built-in rechargeable\n\nAt $199.99, Razer’s Wolverine V3 Pro controller is as expensive (or more, depending on available deals) than the Elite Series 2, but it’s worth the cost if you want a high-end controller with drift-free sticks. Not only is the V3 Pro Razer’s first foray into using Hall effect sticks, it’s the company’s first fully wireless Xbox gamepad. It also sports some of the best hair-trigger lockouts around, yielding a mouse-like click usually found on even pricier Scuf controllers (a previous high-ranking pick of ours).\n\nOther than that, the V3 Pro is similar to the previous V2 Pro, with six remappable buttons — four rear paddles in new, angled orientations and two extra shoulder buttons — and some RGB lighting. The buttons and D-pad still have that satisfying micro-switch tactility and audible clickiness like the previous-gen V2 Pro, but the RGB lighting is more subtle this time around.\n\nIt’s not every day you see six buttons on top of a controller. Photo by Antonio G. Di Benedetto / The Verge\n\nThe Wolverine V3 Pro’s biggest shortcomings compared to Microsoft’s Elite Series 2 are its more basic software customization, its lack of Bluetooth, and the fact that it needs a USB dongle to work wirelessly. The V3 Pro is otherwise the better pick if you can justify its high price, which, unlike the Series 2, is rarely subjected to discounts. Luckily, if you can’t, there’s also the $99.99 Wolverine V3 Pro Tournament Edition that has a nearly identical set of features in a wired configuration.\n\nAn affordable alternative to the Elite\n\nConnectivity: Wired (Xbox), wireless USB dongle (PC), Bluetooth (Android) / Connector type: USB-C / Mappable rear buttons: Two / Software customization: Yes / Power: Built-in rechargeable\n\nIf you don’t mind using a wired controller, GameSir’s G7 Pro offers some features of the splurge-worthy Xbox Elite Controller 2 for under $100. It has remappable buttons, smooth-feeling drift-resistant TMR control sticks, a satisfying weight, and textured grips that made it feel comfortable to hold even with sweaty palms.\n\nThe G7 Pro is actually a battery-powered wireless controller, but its cable free connectivity is limited to PC (via an included 2.4Ghz dongle) and Android (via Bluetooth). You’ll need to plug the controller into the Xbox with a cable, and GameSir provides a lengthy USB-C to USB-A cord. The cable was long enough that I could play games from my couch (roughly six feet away) without feeling tethered.\n\nI was impressed with the G7 Pro’s overall build quality, especially the triggers, which could be locked by flipping switches on its back. GameSir includes three swappable direction pads with the G7 Pro, which can be swapped by lifting the front of the controller’s shell and popping them in and out. However, its face buttons felt noticeably cheaper than the ones on the Elite 2, which makes sense given their price difference. Button feel aside, the controller never dropped an input, even when I mashed buttons to string together elaborate combos in Tony Hawk’s Pro Skater, or continuously cast spells, dodged, and healed in Diablo IV. If an action was mistimed, it was on me.\n\nWhat the controller lacks in face button quality is more than made up for in customizability. GameSir Nexus, a free app on the Xbox Store, allowed me to remap any button (including the L4 and R4 buttons on its backside), adjust the vibration intensity of both triggers, enable two flavors of hair trigger mode, and set the deadzone for each control stick. You can save up to four profiles with different settings, and quickly switch between them by pressing the controller’s M button along with one of the face buttons. You never need to touch these options, or even download the GameSir Nexus app for the G7 Pro to work, but doing so will unlock its full potential.\n\nThe GameSir G7 Pro is an excellent Xbox controller, especially in its price range. I’d have liked the option to use it wirelessly, but that wasn’t a dealbreaker for me. That said, it’s something to consider depending on how far away you are from your Xbox when playing. If you’re a multi-platform gamer and want a controller to use with both an Xbox and PC (or Android device), it’s an even better choice.\n\nThe best Xbox controller for multi-console gamers\n\nHyperkin Competitor $ 50 $ 50 Hyperkin’s Competitor is a wired Xbox controller that looks and feels like Sony’s PlayStation 5 DualSense gamepad. It has symmetrical Hall effect joysticks, four-button directional pad, and a pair of programmable back buttons. Read More $50 at Amazon$50 at Hyperkin\n\nConnectivity: Wired / Connector type: USB-C / Mappable rear buttons: Two / Software customization: No / Power: N/A\n\nHyperkin’s cheekily-named Competitor wired Xbox and PC-compatible controller that looks and feels like the DualSense gamepad that comes with the PlayStation 5 — aka one of the Xbox’s main competitors. The controller’s Hall effect joysticks are symmetrical and located at the bottom, while a four-button directional pad sits above the left grip. The giant “X” button in the middle of the controller is an immediate giveaway that you’re using an Xbox gamepad, but it was easy to forget I wasn’t using a DualSense when playing games.\n\nIn terms of comfort the Competitor was on par with Microsoft’s official Xbox Wireless Controller. I’ve played enough PlayStation games over the years that using the gamepad felt intuitive, with no need to adjust my muscle memory, or change my grip. Playing with a wired controller can feel restrictive, but the long USB-C to USB-A cable included with the Competitor prevented me from feeling tethered. The cable is replaceable, which is good news if yours get frayed or otherwise damaged over time.\n\nOverall, I was pleased with the controller’s construction. It was heavy enough to feel substantial, but light enough that I never felt wrist fatigue after holding it for an hour or more. Its buttons were all satisfyingly clickey, and its joysticks glided smoothly. The controller has two programmable back buttons, which you can program by pressing one of the rear buttons and the “M” button that’s also located on the controller’s backside. The controller rumbles to let you know it’s time to press another button on the controller to set the hot key. Each back button has to be programmed one at a time, and can be disabled by flipping a switch.\n\nMy tests included playing Tony Hawk’s Pro Skater 1 + 2, Crash Bandicoot 4, Trials of Mana, and Tales of Arise. I had no problems jumping (or skating as it were) into any of these games. Playing them felt intuitive, and the controller never dropped an input. A benefit to playing games with a wired controller is there’s less latency between when you press a button and an action happens on screen. The difference is generally imperceptible (unless you play online games competitively), but there were probably a couple of Tony Hawk combos I nailed in the nick of time thanks to the lower latency.\n\nMy personal preference will always be to play Xbox games with a wireless controller because it’s the least restrictive type of gamepad. However, Hyperkin’s Competitor is a great gamepad in general, and an especially good choice if you’re regularly switching between playing Xbox, PC, and PS5 games. It doesn’t offer the same amount of customization as the GameSir G7 or Xbox Elite Series 2 controller, but its design and $49.99 MSRP more than make up for those shortcomings.\n\nOther Xbox controllers we tested\n\nThe Scuf Valor Pro is the company’s first Xbox controller with Hall effect sticks, as well as its cheapest at $109.99 . Scuf emulates Microsoft’s winning ergonomics while implementing redesigned remappable rear buttons (two are removable) and shoulder bumpers that are more comfortable to reach. It also has trigger stops that produce a satisfying click with next to no travel when pressed. The D-pad produces a similarly satisfying click, one we prefer over the softer tactile feel of the Instinct. The Valor Pro is not the most exciting controller on paper, but it’s a solid option for Scuf faithful or anyone who wants more durable analog sticks. Read our hands-on impressions\n\nWe tested PowerA’s latest pro-style Xbox controllers, including the Fusion Pro 4 Wired ($79.99) and PowerA Fusion Pro Wireless ($169.99). They’re standard fare for pro-style controllers these days, with height-adjustable Hall effect sticks, four remappable rear buttons, three-way trigger locks, and onboard volume controls. They’re similar, but the Pro Wireless has four trippy Lumectra lighting zones that respond to your button presses. Both controllers are satisfying to use and a clear step up from PowerA’s older products in terms of overall quality, but they ultimately don’t stand out much at these price points.\n\nUpdate, November 18th: Updated to reflect current pricing / availability and to add Hyperkin’s Competitor controller. Brandt Ranj also contributed to this post.\n\nVerge Deals Sign up for Verge Deals to get deals on products we’ve tested sent to your inbox weekly. Email (required) Sign Up By submitting your email, you agree to our Terms and Privacy Notice . This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.",
  "authors": [
    "Quentyn Kennemer",
    "Antonio G. Di Benedetto",
    "Quentyn Kennemer Antonio G. Di Benedetto"
  ],
  "url": "https://www.theverge.com/23025443/best-xbox-controllers-one-series-x-s"
}