{
  "title": "Ukraine war briefing: Buildings engulfed in flames as Russian air attack on Zaporizhzhia kills five",
  "text": "A Russian attack on the south-eastern Ukrainian city of Zaporizhzhia late on Thursday killed five people and injured three, the regional governor said. Ivan Fedorov posted pictures online showing buildings engulfed by flames and streets strewn with rubble. Fedorov had earlier issued a warning of an impending attack by Russian guided bombs.\n\nVolodymyr Zelenskyy has said he will negotiate with Donald Trump on a US-backed peace plan that called on Ukraine to make painful concessions in order to end the Russian invasion, report Luke Harding and Andrew Roth. The Ukrainian president’s office on Thursday confirmed he had received the draft peace plan, which was prepared by US and Russian officials, and that he would speak to Trump in the coming days about “existing diplomatic opportunities and the main points that are necessary for peace”. “Ukraine needs peace and Ukraine will do everything so that no one in the world can say we are upending diplomacy. This is important,” Zelenskyy said in his nightly video address. His cautious response followed angry denouncements of the plan by some Ukrainian officials who called it “absurd” and unacceptable.\n\nKey points of the draft US-Russian proposal, according to a copy seen by news agencies, include that:\n\n– Ukraine give up the Luhansk and Donetsk provinces – making up the Donbas region – as well as Crimea, which will all be “recognised as de facto Russian, including by the United States”.\n\n– Ukraine will not join Nato, now or in future. The military alliance will agree not to station troops in Ukraine.\n\n– Ukraine’s armed forces will be limited to 600,000 personnel.\n\n– Ukraine will receive “reliable security guarantees” and be eligible for EU membership.\n\n– Russia will be invited to rejoin the G8 and be “reintegrated into the global economy”, with a view to the lifting of sanctions. It will be expected not to invade any neighbouring countries.\n\nEuropeans must be involved in any attempt to broker peace between Ukraine and Russia, the continent’s top diplomats said after reports emerged of the US-Russia plan favourable to Kremlin interests. Jennifer Rankin reports that the EU’s foreign policy chief, Kaja Kallas, welcomed any “meaningful efforts” to end the war but said Ukrainian and European input was needed for any plan to work. “[Vladimir] Putin could end this war immediately if he just stopped bombing civilians and killing the people,” she said. “But we haven’t seen any concessions on the Russian side. We welcome all the meaningful efforts to end this war, but like we have said before, it has to be just and lasting. That also means that the Ukrainians, but also the Europeans, agree to this.”\n\nThe chief of Russia’s general staff told Vladimir Putin on Thursday that Russian forces had taken control of the north-eastern Ukrainian city of Kupiansk, but Ukraine’s military denied the city had changed hands. Ukraine also dismissed Russian statements that its forces had taken over large parts of Pokrovsk – a key logistics hub it has been pressing to capture for months – and Vovchansk, near the Russian border. Putin had visited the command post of the Russian forces’ “west” grouping, where he met with chief of staff Valery Gerasimov and top military brass, the Kremlin said earlier. Gerasimov told Putin in a video posted on the Kremlin site that the heaviest fighting along the 1,200km frontline was near Pokrovsk, with Ukrainian forces offering “stiff resistance”.",
  "authors": [],
  "url": "https://www.theguardian.com/world/2025/nov/21/ukraine-war-briefing-russian-attack-zaporizhzhia-deaths"
}