{
  "title": "Opinion | Marjorie Taylor Greene Was Not on Our Bingo Card",
  "text": "Bret: On a serious note, though, Trump has also had foreign policy wins. He ended the border crisis. He helped Israel destroy Iran’s most dangerous nuclear sites and then brought that war to a swift close. He brought about a cease-fire in Gaza and got the U.N. Security Council to bless his peace plan. He’s forced our NATO allies to finally start paying more for their own defense. These are genuine achievements, brought about in part because he thinks and acts and speaks like no president before him did. Would you give him credit for any of this?\n\nFrank: For sure — and, in fact, I’d noticed what happened with the Security Council and marveled at the flare of something good amid all the Trump-administration evil. That’s the cognitive dissonance of this presidency and this president, who is spectacularly wrong for the office but still gets some things right. I think Democrats would be wise to acknowledge that more often. Doing so wouldn’t launder Trump, who’s soiled beyond all laundering. But it would project maturity and calm to an electorate that craves that.\n\nBret: I think you’ve put your finger on the essential challenge facing Democrats: They have to treat an abnormal president as if he were a normal one — not to lose sight of his abnormalities, but to keep from losing their own minds and judgment in the bargain. Whoever the political Einsteins were who persuaded the Democrats to shut down the government? Stop listening to them. Americans want Democrats to propose new and superior solutions to common problems, not just throw themselves at the barricades in stupid and futile gestures in the name of saving democracy.\n\nFrank: Speaking of democracy and what will and won’t save it, you’re here with me in Chapel Hill because you just appeared at my alma mater, the University of North Carolina, for a discussion about civil discourse with our former Times Opinion colleague Elizabeth Bruenig, who now writes for The Atlantic. That’s a topic and a challenge — how to talk across ideological divides, how to have productive and respectful disagreement — that we also pay enormous attention to at Duke, where I teach. What have you concluded are some of the keys to making progress on that front?\n\nBret: Frank, you ignorant slut.\n\nFrank: Quiet, piggy!\n\nBret: Well, that was the perfect illustration of what not to do. My suggestion to the audience was that universities have to turn themselves into countercultural agents. Meaning, in an age in which social-media algorithms and political polarization drive people into silos of ideological and cultural identity, universities have to develop more mechanisms to force them into communities of engagement. And in an era in which we are prone to scream past each other, universities have to get people to listen to one another — not for the sake of agreement, but for the purposes of understanding and truth-seeking. More easily said than done, but where else can this happen except on campus?",
  "authors": [
    "Frank Bruni",
    "Bret Stephens"
  ],
  "url": "https://www.nytimes.com/2025/11/20/opinion/trump-marjorie-taylor-greene-republicans-maga.html"
}