{
  "title": "Trump cuts Energy Star program that saved households $450 a year",
  "text": "is a senior reviewer with over twenty years of experience. She covers smart home, IoT, and connected tech, and has written previously for Wirecutter, Wired, Dwell, BBC, and US News.\n\nPosts from this author will be added to your daily email digest and your homepage feed.\n\nThe Trump administration is moving to shut down the Energy Star program, which saves homeowners an average of $450 a year. “If you wanted to raise families’ energy bills, getting rid of the Energy Star label would be a pretty good way,” says Steven Nadel of the American Council for Energy Efficiency.\n\nThe program, which started in 1992, provides basic information about how much energy an appliance uses. Without it, your next large appliance purchase could end up costing you more money than you bargained for. Buying Energy Star-rated products can also qualify you for rebates on appliances as well as tax credits of up to $3,200 annually.\n\nSources in the Environmental Protection Agency, which oversees Energy Star, say that Trump administration officials told them the program will be shuttered, according to reports from CNN and The Washington Post.\n\nMolly Vaseliou, EPA Associate Administrator for Public Affairs, confirmed to The Verge via email that the agency is going through the “next phase of organizational improvements” to “better provide clean air, water, and land for all Americans.”\n\nVaseliou shared a PDF showing a future organizational chart with the Office of Transportation & Air Quality and the Office of Radiation & Indoor Air Quality eliminated. Vaseliou did not respond to questions about Energy Star specifically, but the program falls under these departments.\n\nThe future org chart for the Office of Air and Radiation. The departments in red will stay, and those in white will go. Image: EPA\n\nEnergy Star is a private-public partnership set up by the first Bush administration in 1992 to help consumers and businesses save money by reducing their energy use, while conserving natural resources. Over that time, it’s saved more than $500 billion in energy costs.\n\n“For just $32 million a year, Energy Star helps American families save over $40 billion in annual energy costs,” Paula Glover, president of the nonprofit Alliance to Save Energy, told CNN. “That’s a return of $350 for every federal dollar invested.”",
  "authors": [
    "Jennifer Pattison Tuohy"
  ],
  "url": "https://www.theverge.com/news/662847/trump-ending-energy-star-program-could-cost-homeowners-450-annually"
}