{
  "title": "All There Is with Anderson Cooper",
  "text": "Tig Notaro: Finding What Matters All There Is with Anderson Cooper Comedian Tig Notaro recently witnessed the death of her friend, poet Andrea Gibson, after a years-long battle with cancer. Being by Andrea's bedside was a profound experience for Tig and she talks about its impact on her in this moving and at times funny conversation. Join the community to share your story and watch Anderson's weekly streaming show All There Is Live at cnn.com/allthereis. Host: Anderson Cooper Showrunner: Haley Thomas Producers: Chuck Hadad, Grace Walker, Emily Williams Associate Producer: Kyra Dahring Video Editor: Eric Zembrzuski Technical Director: Dan Dzula Bookers: Kerry Rubin and Kari Pricher Nov 19, 2025 32 mins\n\nKenny Chesney All There Is with Anderson Cooper Country superstar Kenny Chesney reflects on the loss of friends and a beloved dog. He and Anderson also share their connection to a family who experienced a profound loss. Plus, Anderson talks about the death of David Gergen and speaks to a podcast listener facing a life-threatening illness. Join the community to share your story and watch Anderson's weekly streaming show All There Is Live at cnn.com/allthereis. Host: Anderson Cooper Showrunner: Haley Thomas Producers: Chuck Hadad, Grace Walker, Emily Williams Video Editor: Eric Zembrzuski Technical Director: Dan Dzula Booker: Kerry Rubin Nov 12, 2025 30 mins\n\nKen Burns' History With Grief All There Is with Anderson Cooper Documentary filmmaker Ken Burns has been called “America’s biographer,” but in this moving conversation, he reveals how his own history has been shaped by early loss - the death of his mother Lyla when Ken was eleven years old. Join the community to share your story and watch Anderson's weekly streaming show All There Is Live at cnn.com/allthereis Host: Anderson Cooper, Showrunner: Haley Thomas, Producers: Chuck Hadad, Grace Walker, Emily Williams, Video Editor: Eric Zembrzuski, Technical Director: Dan Dzula. Booker: Kerry Rubin. Nov 5, 2025 45 mins\n\nLuke Bryan: Grief, Faith, and Music All There Is with Anderson Cooper Luke Bryan is one of country music’s biggest stars. He's also faced great loss. In this personal and revealing conversation with Anderson, Luke shares how faith, family, and music have helped him \"do what you do to get through.\" Join the community to share your story and watch Anderson's weekly streaming show All There Is Live at cnn.com/allthereis Host: Anderson Cooper, Showrunner: Haley Thomas, Producers: Chuck Hadad, Grace Walker, Emily Williams, Video Editor: Eric Zembrzuski, Technical Director: Dan Dzula. Booker: Kerry Rubin. Oct 28, 2025 48 mins\n\nComing Back To Life All There Is with Anderson Cooper In this special episode of the podcast, Anderson reports from Rome following the death of Pope Francis, and speaks to religion professor Elaine Pagels who lost both her 6-year-old son Mark and her husband Heinz. Visit the All There Is online grief community at cnn.com/allthereisonline and watch the video version on YouTube. Apr 25, 2025 33 mins\n\nLove Is What Survives All There Is with Anderson Cooper In the season three finale, Anderson plays some of the more than 6000 voicemails he has received from podcast listeners about what they have learned in their grief that might help others. Jan 29, 2025 53 mins\n\nDoris Kearns Goodwin All There Is with Anderson Cooper Pulitzer Prize winning historian Doris Kearns Goodwin knows what it’s like to face the past. She talks with Anderson about how Abraham Lincoln and other historic figures dealt with grief, and how she has. She went through boxes of papers and mementos with her husband Dick Goodwin before he died and it changed both of their lives in ways she never expected. Visit the All There Is online grief community at cnn.com/allthereisonline and watch the video version on YouTube. Jan 15, 2025 32 mins\n\nDavid & Amy Sedaris All There Is with Anderson Cooper David and his sister Amy Sedaris have lived through the deaths of their mother, father and sister, and most recently, Amy’s pet rabbit. They join Anderson for a heartfelt, and at times irreverently funny, conversation about loss and grief. Visit the All There Is online grief community at cnn.com/allthereisonline and watch the video version on YouTube. Jan 8, 2025 30 mins\n\nA Message from Anderson All There Is with Anderson Cooper Anderson checks in with an update about the podcast and invites listeners to call the All There Is voicemail. Visit the All There Is online grief community at cnn.com/allthereisonline Dec 17, 2024 3 mins\n\nTyler Perry: Letting Go All There Is with Anderson Cooper This week marks 15 years since actor and filmmaker Tyler Perry lost his beloved mother, Willie Maxine Perry, at 64 years old. Tyler shares with Anderson how he’s avoided his grief by pouring himself into work, and how he is now facing the trauma of his past and the pain of his mother’s absence. Visit the All There Is online grief community at cnn.com/allthereisonline and watch the video version on YouTube. Dec 11, 2024 36 mins",
  "authors": [],
  "url": "https://www.cnn.com/audio/podcasts/all-there-is-with-anderson-cooper"
}