{
  "title": "In-form Preston lead surprise surge for Championship’s unfancied contenders",
  "text": "There is a refreshingly unfamiliar feel to the Championship top six. None of the incumbents have played in the Premier League this decade, a rarity in the modern-day second tier where those in receipt of parachute payments tend to rule the roost. In fact, of the top 11, only seventh-placed Ipswich have featured in the past seven top-flight seasons.\n\nPreston are one of the few in that group never to have graced the Premier League, this their 11th consecutive Championship campaign. Unfancied and unfashionable in the current climate, they were widely tipped to struggle after a disastrous finish to last season, but under Paul Heckingbottom they sit fourth going into a crunch derby with Blackburn on Friday night and would rise to second with a win.\n\nThe sense of drift towards the end of 2024-25 was striking. After a 1-0 victory at Norwich on 11 February, Preston won only one more league match. Four successive defeats in April dragged them into the relegation picture but they stayed up on the final day by virtue of West Brom’s 5-3 win over Luton.\n\nView image in fullscreen Preston fans saw their team survive by the skin of their teeth last season but the mood is high this time around. Photograph: Alex Livesey/Getty Images\n\nThere is a contrasting feel now, with the wily Heckingbottom putting his imprint on the side a year after he replaced Ryan Lowe.\n\n“Last season was a really strange one, everyone knows what happened, but we still had the feeling this year we were way better than that,” said the defender Liam Lindsay. “The manager has been emphasising hard work on the training pitch, the feeling at the training ground has been really positive and I think he’s brought in some good personalities. Recruitment has been massive. The new guys have made a massive difference.”\n\nPreston’s rejuvenation has been achieved on a modest budget. Thierry Small joined after his contract at Charlton expired and has been a livewire at left wing-back in Heckingbottom’s 3-5-2. Odeluga Offiah cost a seven-figure fee from Brighton and has added physicality and consistency on the opposite flank. The goalkeeper Daniel Iversen, a fan favourite during two loans at Deepdale, was brought back from Leicester on a free. Preston have also made smart use of the loan market, particularly in midfield, where the skilful Alfie Devine and Harrison Armstrong – loaned from Tottenham and Everton respectively – have shone in creative roles. The forward Lewis Dobbin has also impressed on loan from Aston Villa.\n\nskip past newsletter promotion Sign up to Football Daily Free daily newsletter Kick off your evenings with the Guardian's take on the world of football Enter your email address Sign up Privacy Notice: Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on theguardian.com to send you this newsletter. You can complete full registration at any time. For more information about how we use your data see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nView image in fullscreen Paul Heckingbottom has steered Preston towards the top of the Championship. Photograph: Rob Newell/CameraSport/Getty Images\n\nPreston have beaten the three relegated Premier League teams, confidence beginning to flow after back-to-back home wins over Leicester and Ipswich in August. The 2-0 away victory at Southampton this month was another statement to the rest of the division; the Lilywhites are not a soft touch this year. Heckingbottom and his drill sergeant, assistant manager Stuart McCall, have transformed them into a super-committed defensive unit but they are also easy on the eye, capable of playing fluent counterattacking football. The sense of unity extends to the supporters, who rapidly snapped up tickets for the battle with Blackburn.\n\nWith the two clubs deprived of league games against their more traditional rivals (Blackpool for Preston and Burnley for Blackburn), this Lancastrian rivalry – a near constant in the Championship these days – has taken on extra meaning. Rovers, who finished last season in sparkling form under Valérien Ismaël and are slowly recovering from a sluggish start, can expect to step into a cauldron-like atmosphere. The Sky Sports cameras will be in situ. It will be an occasion to relish for Heckingbottom and his players.\n\n“It’s a huge game – they always are, these games,” said Lindsay. “Friday night under the lights at Deepdale, a sold-out crowd and we’re on a good run of form, but I guess so are Blackburn. We always back ourselves.”\n\nView image in fullscreen Preston’s Thierry Small (centre) celebrates with with Milutin Osmajic after opening the scoring against Swansea this month. Photograph: Lee Parker/CameraSport/Getty Images\n\n“I would be disappointed if we didn’t come and give our best,” said Heckingbottom. “We can’t guarantee the result off the back of it but you can guarantee the effort. It’s our job to try and put the players on the pitch with the belief we can go out there and carry out a performance that gives us three points. We try to attack the games and that’s us doing our part. The fans have responded with more [noise] at home.”\n\nA win would not only lift Preston into an automatic promotion slot, at least until Middlesbrough and Stoke play on Saturday afternoon, but also prompt a surge of optimism. After 15 games talk of the P-word at Deepdale has been tentative, but given the topsy-turvy nature of this season’s Championship, why not begin to believe?\n\n“You do usually get a couple of teams running away with it,” said Lindsay. “If you look at the top eight, you wouldn’t have predicted that, so it is quite open and it’s anyone’s game. I just don’t want to jinx it – it’s the old cliche of taking it game by game.”",
  "authors": [
    "Dominic Booth"
  ],
  "url": "https://www.theguardian.com/football/2025/nov/20/preston-north-end-surprise-surge-championship-unfancied-contenders"
}