{
  "title": "Waymo enters 3 more cities: Minneapolis, New Orleans, and Tampa",
  "text": "Waymo has three new cities in its sights as it continues to expand around the United States: Minneapolis, New Orleans, and Tampa.\n\nThe company said on Thursday that it will start manually driving its vehicles in those cities “in the coming days,” ahead of testing and validating its driverless tech, before eventually launching a commercial robotaxi service in each.\n\nThese cities join a growing list of locations where Waymo has launched or plans to launch its robotaxis. The Alphabet-owned company is already offering rides on surface streets and highways in Los Angeles, San Francisco, and Phoenix, and is live in Austin and Atlanta as well.\n\nIn 2026, Waymo plans to expand to Dallas, Denver, Detroit, Houston, Las Vegas, Miami, Nashville, Orlando, San Antonio, San Diego, Seattle, and Washington, D.C. It’s also testing in New York City, and plans to offer commercial rides internationally starting with London and Tokyo.\n\nThe new cities announced Thursday could present some unique challenges for Waymo, though. Minneapolis has perhaps the harshest winters of the cities Waymo has chosen to date. Snow could challenge Waymo’s perception stack, and the lack of traction will give its automated driving system some extra work to do. New Orleans, meanwhile, has a lot of tight, one-way streets that are heavily used by pedestrians — especially in the French Quarter.\n\nAs Waymo has expanded, it’s been working with partners in a number of cities to help operate its fleets. Its vehicles are on Uber’s app in Austin and Atlanta, African mobility and fintech company Moove took over operations in Phoenix (and will do the same in Miami), and Avis Budget Group will manage the fleet in Dallas. It’s not immediately clear if Waymo will lean on similar partnerships in the new cities.\n\nWaymo’s so far outpacing other players when it comes to expanding to new cities. Amazon-owned Zoox is offering free rides in its custom-built robotaxi in Las Vegas, and letting members of its early-rider program take trips in San Francisco while it awaits a necessary exemption from the National Highway Traffic Safety Administration to launch full commercial operations.\n\nTechcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | WAITLIST NOW\n\nTesla, meanwhile, is trying to expand its nascent robotaxi service, which still has safety monitors in the driver’s seat. This week, the company received a permit to start offering rides in Arizona, in addition to Austin and San Francisco.",
  "authors": [
    "Sean O'Kane",
    "Sr. Reporter",
    "Sarah Perez",
    "Julie Bort",
    "Lorenzo Franceschi-Bicchierai",
    "Ram Iyer",
    "Connie Loizos",
    "Anthony Ha",
    "Rebecca Bellan",
    "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var"
  ],
  "url": "https://techcrunch.com/2025/11/20/waymo-enters-3-more-cities-minneapolis-new-orleans-and-tampa/"
}