{
  "title": "A polar vortex disruption is on the way, and its magnitude is almost unheard of in November",
  "text": "High above the North Pole, in a slice of atmosphere rarely noticed and even less understood, a transformation is underway. Over the next 10 days, changes in the stratosphere will upend weather patterns and set the stage for a cold, snowy December across parts of the Northern Hemisphere.\n\nIt will mean a dramatic swing in weather for parts of the US that are currently simmering in record heat, and it could begin the week of Thanksgiving.\n\nIt could also be one of the earliest significant polar vortex disruptions recorded since the dawn of the satellite era.\n\nThink of the stratospheric polar vortex like a wall of wind, corralling the ultra-cold, Arctic air over the North Pole. When it weakens, cold air spills south into places like the Lower 48, Europe and Asia.\n\nRight now, the air in the stratosphere — the layer of the atmosphere above where most weather occurs — is warming quickly and dramatically, in a phenomenon known as a sudden stratospheric warming event.\n\nBut the sudden warming in the far upper atmosphere is going to result in anything but warmth. It is causing the polar vortex winds to weaken, said Amy H. Butler, a meteorologist at the National Oceanic and Atmospheric Administration, and they could even reverse.\n\nScientists are still trying to figure out why these warming events happen, and for good reason: they can trigger the most intense “polar vortex” cold-air outbreaks in the US.\n\nOver the next two weeks, these shifts could start to be felt in North America, Europe and Asia as the polar vortex weakens and tumbles south, like a spinning top that slows and wobbles off course.\n\nOne unusual feature of this event is its timing; sudden stratospheric warming events of this magnitude are almost unheard of in November, said meteorologist Judah Cohen, a research scientist at MIT.\n\nIt’s still not certain there will be a major winter blast, but scientists are watching for colder than normal conditions to develop in the mid-latitudes — where most of the world’s population resides — over the next month or so. Once the polar vortex is disrupted, it can take a month or more to recover, said Andrea Lopez Lang, a meteorologist at the University of Wisconsin-Madison.\n\nWhat’s most difficult to predict is where the polar vortex will deliver its icy blast, and the temperature outlooks aren’t taking it fully into account, yet.\n\n“We can see more active and shifted storm tracks and increases in cold air outbreaks in regions across the Northern Hemisphere,” she said in an email.\n\nBoth Butler and Lopez Lang said having accurate forecasts for polar vortex events can help make 7- to 10-day forecasts better, which can be beneficial for decision-making.\n\n“Even though the stratospheric polar vortex is miles above us, it’s sometimes connected to our weather via invisible puppet strings we describe with atmospheric dynamics and thermodynamics,” Lopez Lang said.\n\nFor example, other polar vortex events early in the winter have been followed by colder and snowier Decembers in the US, she said. Polar vortex events like these tend to generate a ridge of warm, high pressure over Alaska, which triggers a dip, or trough, in the jet stream to the east. That trough can usher in colder, snowier weather over the Central states and portions of the Eastern US.\n\nAs impactful as these polar vortex events are, scientists are losing some of their eyes on this layer of the atmosphere, Lopez Lang said.\n\nSatellites are crucial to observing the stratosphere and making predictions about sudden stratospheric warming events, she said, and some of that data is blinking out as satellites age and NOAA makes budget and program decisions that affect the availability of current and future measurements. She cited some newly missing data from polar-orbiting satellites as an example.\n\n“The only way that we really observe these phenomena is via satellite data,” she said.",
  "authors": [
    "Andrew Freedman"
  ],
  "url": "https://www.cnn.com/2025/11/19/weather/polar-vortex-cold-snowy-december-stratosphere"
}