{
  "title": "Bluesky CEO Jay Graber On Building A Better Social Ecosystem",
  "text": "Transcript\n\nBluesky's for everyone.\n\nWhen we think that over time the broader public conversation\n\nneeds to be on an open protocol,\n\nwhich is what we're built on.\n\nI'm Wired senior writer Kate Nibs.\n\nToday I sat down with Bluesky, CEO Jay Graber.\n\nWe discuss how influencers are joining the platform,\n\nBluesky's relationship with news media\n\nand whether she would welcome President Trump to Bluesky.\n\nThis is The Big Interview.\n\n[upbeat music]\n\nJay, thank you so much for joining me today.\n\nThank you. Thanks for having me.\n\nSo last time we talked in December,\n\nI believe Bluesky had just surpassed 24, 25 million users.\n\nWhere are you today?\n\n34.6 million users.\n\nWhat milestones are you hoping to hit by the end of 2025?\n\nThere's a lot of new features that we're launching\n\nand we're excited to expand a lot.\n\nI think getting in some of the things we've been talking\n\nabout for a long time.\n\nLike communities.\n\nOr what does that look like?\n\nYeah, communities is a way\n\nthat people are already using feeds.\n\nA lot of people don't realize\n\nthat Bluesky is a bit like Reddit\n\nand Twitter at the same time\n\nbecause you can build feeds\n\nthat are essentially communities like the science feed is\n\nrun by scientists, moderated by scientists\n\nand has its own rules.\n\nAnd so this is something that you can do,\n\nbut you have to go outside the app to do it right now.\n\nAnd so we've talked to people who are running these feeds\n\nand they would like better tooling\n\nfor making these into communities in the app.\n\nAnd so that's the big idea, which is essentially just making\n\nit easier to create\n\nand run a custom feed,\n\nwhich is an interface you can install into the app\n\nthat's like your own timeline\n\nand run that like a community of your own.\n\nWhen you say you have to go outside\n\nof the app, what does that mean?\n\nThere's third party services\n\nthat have built feed builders services like Sky Feeds\n\nor Grays.\n\nThey let you create feeds without knowing how to code\n\nand you can say, I want this list of people\n\nto contribute to my feed.\n\nYou can post into it with this hashtag or this emoji\n\nand then you run it essentially like it's a service\n\nthat you're providing other people,\n\nother people can install it, subscribe to it, pin it\n\nto the homepage of their app.\n\nAny timeline for when this is coming?\n\nWell, you asked about the end of the year, so I think\n\nthat's the, the most\n\nconcrete timeline we can give at the moment.\n\nAnd I know that you recently rolled out video\n\nas a feature, which we're very excited about.\n\nI think a lot of people already conceptualize Bluesky\n\nas sort of a X competitor,\n\nbut now are you gunning for TikTok too?\n\nWe are, as you know, built on an open protocol\n\nand so other apps are starting to fill in these open spaces.\n\nThere is an app called Skylight\n\nthat has just gotten 150,000 users\n\nand this is more of a straight TikTok alternative.\n\nIt lets you post short form videos, you know,\n\nedit them in app, create them.\n\nThere's these other apps springing up now on the same\n\nprotocol like Skylight, like flashes for photos\n\nthat do different things.\n\nAnd the great thing about this being an open protocol means\n\nthat you can move from Bluesky over to Skylight Social\n\nand keep your followers.\n\nSo they go with you across these applications.\n\nSo when you say they go with me, if I'm going\n\nto port my followers over\n\nor even just join these new apps, how would I do that?\n\nLike do I actually go into the app store\n\nand download something new or how does it work?\n\nYeah, you download Skylight from the app store\n\nand then you log in\n\nwith your Bluesky username if you wanna link them together.\n\nIf you don't want to link them, you can create\n\na new account, but if you link them,\n\nyou have the same number of followers and the photos\n\nor videos that you post\n\nto Skylight will also show up in Bluesky or vice versa.\n\nAnd like over time the apps can decide is everything going\n\nto, you know, be shared across\n\nor is there gonna be some stuff that's separate?\n\nBut right now it's sort of just a shared data layer\n\nwhere you can have people seeing your videos on Bluesky,\n\neven if they're posted on Skylight.\n\nAnd so does the Bluesky team have anything to do\n\nwith the development of Skylight or is it totally separate?\n\nIt's totally separate.\n\nDo you know know who developed it at all?\n\nLike what are your relationships like with the people\n\nwho are developing different apps on the protocol?\n\nThere was recently a conference called\n\nthe Atmosphere Conference.\n\nWe call the atmosphere the broader ecosystem of applications\n\naround the AT protocol,\n\nwhich is the layer Bluesky is built on.\n\nAnd we met a lot of folks there\n\nwho are building even apps we didn't know were being built.\n\nSo there's private messengers being built,\n\nnew forms of moderation tools.\n\nThere's a lot of ones out there\n\nthat are innovating on new forms\n\nof social built on this shared layer\n\nbecause they can immediately tap into the Bluesky user base\n\nand just add features on\n\nrather than having to start from zero.\n\nSo that's the benefit to developers\n\nof building in an open ecosystem.\n\nYou don't have to start from zero each time you start over\n\nand now you have 34.6 million users to tap into.\n\nSo I know there's Bluesky the app\n\nand then it's built on this app protocol\n\nand that's how all of these people are developing\n\nthese new cool video and photo apps and everything.\n\nSo the teams are separate.\n\nAs the CEO of Bluesky,\n\nlike if one of the video apps were to go mega viral\n\nand surpass Bluesky wildly, et cetera, would that help you\n\nor would it just sort of be a wash for you?\n\nIt would help us because these are shared backends\n\nif you recall.\n\nSo that means that all those videos would be being able\n\nto be viewed on Bluesky too.\n\nIt'd probably change the way\n\nthat people could interact over on Bluesky\n\nbecause all this content would be coming in\n\nfrom another application,\n\njust like all the content created on Bluesky\n\ncan be borrowed over there.\n\nWe can borrow from the other apps as well.\n\nAnd then it means that, you know,\n\nif they're building on our services over time,\n\none of the pathways to monetization we've mentioned is\n\ndeveloper services.\n\nSo building out infrastructure for new apps to get started.\n\nSort of like a fire base for social, if you will,\n\nwhere you get new apps off the ground\n\nand then you know, provide infrastructure to them.\n\nSo I've noticed that there has been sort of an influx\n\nof big creators onto Bluesky,\n\nbut right now there's no direct way for creators\n\nto monetize their work on Bluesky in the way\n\nthat there is on say YouTube.\n\nAre you working on ways to change that?\n\nYeah, one things that we've seen is\n\nthat we're not giving creators money\n\nbut we're giving them really great traffic\n\nand that can convert to money\n\nbecause if you are a YouTube creator or you have a Patreon\n\nand you're posting your Patreon link,\n\none big thing is we don't down rank links\n\nand so you're getting higher link traffic on Bluesky,\n\neven with a smaller follower count.\n\nThis is true of small creators\n\nand even news organizations have been reporting this\n\ndifference in engagement and click-through numbers.\n\nWe've heard from large news organizations\n\nthat Bluesky is giving better click-throughs\n\nand subscription rates\n\nand so this converts to money once you\n\nget people onto your site.\n\nSo I think this is one of the big benefits we're leaning\n\ninto right now is just giving people that direct traffic,\n\nthat direct relationship with their audience\n\nand giving them the ability to monetize\n\nhowever they want.\n\nDown the road we might introduce other mechanisms,\n\nbut right now it's just about being the best platform\n\nto serve creators needs in terms of giving them attention,\n\ngiving them engagement and giving them the ability\n\nto move with their followers right?\n\nSo as I mentioned before, if you're a video creator\n\nand you do some content on Bluesky to build up a following\n\nand then you download Skylight\n\nand you start posting different kinds of content over there,\n\nyou can have that follow graph just go with you\n\nand start building on it.\n\nSo it's cumulative rather than also\n\nas a creator starting from scratch each app you move to.\n\nI love that as someone who's jumped from app\n\nto app in the past, that sounds very helpful.\n\nAnd when you were talking about traffic\n\nfor traditional news organizations,\n\nI know that traditionally the news media\n\nand social media have had sort\n\nof an antagonistic relationship.\n\nLike it's been obviously a huge driver of traffic\n\nfor news outlets,\n\nbut then they're sort of beholden\n\nto people like Mark Zuckerberg or Elon Musk\n\nand what they wanna do to the news.\n\nDo you have a broader vision for how you want Bluesky\n\nto interact\n\nwith like the information ecosystem or the news media?\n\nYeah, we want to create a more direct relationship again\n\nand be the place where we make those relationships happen.\n\nAnd so rather than being the single feed\n\nthat all user attention passes through\n\nwhere small algorithm changes can affect\n\nhow much traffic a news organization is getting,\n\nwe want to give direct traffic to news orgs\n\nand even let them do things like build their own feeds\n\nor link their domain directly as their username,\n\nclicking that just clicks you directly through to your site.\n\nYou can also right now create verified news feeds.\n\nSome people have been building these in the community\n\nand so users can just scroll\n\nthrough all the news articles being posted.\n\nThis means that you're getting direct traffic\n\nbecause you're not depending on the algorithm,\n\nwhich might be at any given moment showing more\n\nor less news to a given user.\n\nIf the users are interested they can just subscribe\n\nto a newsfeed and see all the articles being published\n\non Bluesky in one place.\n\nSo recently there's been a pretty noticeable influx\n\nof bigger name celebrities on the app,\n\nincluding some of the biggest names in democratic politics\n\nlike Barack Obama and Hillary Clinton\n\njust joined for instance.\n\nAre you doing anything to court the celebrities\n\nor really famous influencers?\n\nWe're doing some community outreach.\n\nWe've had a very community driven growth strategy\n\nand so we're seeing a lot of growth in sectors\n\nwith maybe not as big celebrities,\n\nbut a lot of traction in areas like you know, sports media.\n\nFor example, Mina Kimes, a sports reporter came on\n\nand she created a starter pack which got\n\na lot of follows very quickly\n\nbecause when you create starter packs,\n\nwhich are essentially lists of accounts\n\nthat bundle together everyone in a given field,\n\nwhen new people come on through that link,\n\nthey're following all of them at once.\n\nSo that's been a way that communities have been onboarding\n\noutside of, you know, politics\n\nor like even large celebrities, we have game devs,\n\nwe have sports, we have science.\n\nLots of these different interests are kind of starting\n\nwith people building custom starter packs\n\nand then bringing on folks directly into their community.\n\nSome of these bigger name people who are joining,\n\nyou know, they do tend\n\nto be liberal politicians when they're politicians.\n\nI'm wondering, would you welcome President Trump\n\nif he was debating joining Bluesky?\n\nYeah, Bluesky's for everyone, you know,\n\nand we think that over time the broader public conversation\n\nneeds to be on an open protocol,\n\nwhich is what we're built on because\n\nthat lets people choose their own moderation preferences.\n\nIt lets people choose their own feed preferences\n\nand things can evolve without it being a binary choice,\n\nwhich is like everyone has to adhere\n\nto this set of moderation rules\n\nor that one you can have customization both within\n\nthe app and outside of it.\n\nRight now, you know, it's people who feel\n\nthat there's more direct benefits\n\nto being on here if you are a creator\n\nor somebody who wants to have a direct relationship\n\nwith your audience.\n\nBut over time the benefit\n\nof this protocol based approach I think will extend\n\nto all sorts of social media users.\n\nSo right now we're in this moment\n\nwhere free speech is under threat\n\nand free speech on the internet is under threat.\n\nI'm wondering how you envision Bluesky's relationship\n\nto speech, including political speech\n\nand what your obligations are to your users\n\nand I guess to the internet at large.\n\nI think building on an open protocol like we've done is\n\nthe most enduring foundation for speech\n\nbecause what we're doing is creating a digital commons\n\nof user data where you really get\n\nto control your own identity and your data.\n\nAnd then we're building, you know, infrastructure\n\nthat I hope stays around for a really long time\n\nbecause Bluesky, the app is just one site\n\nwhere speech can happen and all these other apps are showing\n\nthat you can have an ecosystem of a lot\n\nof different applications.\n\nThis is like the web itself.\n\nEarly on we had AOL\n\nand accessing the internet happen through AOL\n\nand if the AOL web portal wasn't showing you something,\n\nit would be a lot harder to find\n\nand then more unopinionated browsers came along\n\nand these just linked you out to the broader internet\n\nand now anyone can put up a blog\n\nand host their own views online.\n\nAnd then there's larger websites if you want to, you know,\n\nbe on Substack or Medium, but you can either self-host\n\nor choose one of these, this is the kind\n\nof ecosystem we're building, anyone can self-host.\n\nAnd then the question of, you know, freedom of speech\n\nnot reach is made very tangible\n\nbecause then the sites like the sort of mediums of the world\n\nthat host a lot of blogs get\n\nto choose their moderation rules,\n\nbut if individuals are unhappy with that,\n\nthey can start a new site or host their own blog.\n\nFor people who might not be familiar\n\nwith the phrase freedom of speech, not freedom of reach.\n\nCould you explain it?\n\nYeah, this was a principle\n\nthat old Twitter talked about early on\n\nand when we were spinning out of Twitter, I never worked\n\nfor Twitter, but we opened up this new design space\n\naround Bluesky, which was how do we embed\n\nthat into a protocol layer?\n\nSo the freedom of speech is embedded in the protocol.\n\nAnyone can do the equivalent of standing up a new blog\n\nand then the sites like Bluesky,\n\nwhich are the applications, get to decide, you know,\n\nhow are we going to prioritize reach, you know,\n\nwe do have a default algorithm\n\nbut you can choose any other algorithm you want.\n\nAnd so we don't necessarily show everything in the algorithm\n\nor the default service,\n\nbut if you want to find something elsewhere,\n\nyou can go elsewhere in the ecosystem to find it.\n\nThat means that you have the pathways\n\nthat the apps are deciding what is going\n\nto be most accessible\n\nand then if you want\n\nto change the rules you can build another thing\n\nand that's guarantee of freedom of speech\n\nis being always able to build your own thing\n\nor find your own space that serves you the most.\n\nSo as you're scaling up,\n\nI know that you hired additional moderators to tackle\n\nsome of the necessary moderation challenges like CSAM.\n\nHow challenging is it as as you're scaling up to sort\n\nof balance offering this level of customization\n\nwith just the sort of basic things you need to do\n\nas a social network for everyone?\n\nLike you know, keep pornography off for example?\n\nYeah, I mean we're running\n\na foundational moderation service,\n\nso we get to choose the rules within the Bluesky app\n\nand like I said, you can fork off do your own thing,\n\nbut within the parameters of Bluesky we're setting\n\nwhat the rules are and so we employ\n\nmoderation team to do this.\n\nWe face some of the same challenges\n\nas centralized social apps\n\nbecause to run a centralized moderation team you're doing\n\na lot of the same kinds of work.\n\nAnd so I would say it's, it's very similar at the base layer\n\nand then we have this extra options\n\nthat we've layered on top for users\n\nto choose their own spaces.\n\nAnd in some cases that means that users are able\n\nto resolve things more locally.\n\nSo for example, within the feeds\n\nthat run a bit like communities, you can moderate things,\n\nresolve things locally,\n\nbut still it's a broader Bluesky application\n\nhas its own set of rules.\n\nHow many countries are you operating in right now\n\nor do you have users everywhere?\n\nWe have a lot of users in different countries.\n\nSome of the biggest are the US of course, Japan, Brazil,\n\nand various countries in the EU.\n\nAre there unique challenges in certain locations\n\nand if so, what are they?\n\nEach place has their own regulatory guidelines\n\nand you know, we try to be in compliance\n\nand that's part of being a global company is just learning\n\nto operate in different places.\n\nI think over the long run there will be applications\n\njust like Skylight is targeted towards video,\n\nmaybe there's applications targeted\n\ntowards different markets.\n\nEarly on we saw several Japanese users build Japan focused\n\napplications before we had gotten\n\ninternationalization into the app.\n\nSo you know, different languages depending on\n\nwhere you're based, people built their own apps to do that.\n\nSo that's an example of how you can customize things\n\nto your own local market.\n\nSpeaking of local markets, we're in Seattle,\n\nwhich is where you are based,\n\nbut is Bluesky currently remote forward workspace?\n\nHow are you guys set up?\n\nWe're a fully remote team\n\nand part of the reason for this is we wanted to hire people\n\nwho care deeply about the mission\n\nand are really aligned in what we're doing.\n\nHave some of the experience in social,\n\nhave experience in open protocols\n\nand that combination is rare and hard to find.\n\nSo if we tried to hire all in one city,\n\nwe wouldn't be getting the best people out there.\n\nBut as it is, we've hired from several different countries\n\nall over the United States\n\nbecause there's people all over\n\nthat are interested in the vision of what we're building.\n\nAnd what brought you to Seattle originally?\n\nI moved here during the pandemic.\n\nI was previously in San Francisco\n\nand it's a really nice city.\n\nI mean the nature, the water, the mountains, it's a place\n\nwhere nature is really accessible and I really like that.\n\nAnd I understand that you have a background in crypto.\n\nI know that the largest investor in Bluesky is\n\na venture capital firm that sort of specializes\n\nin crypto investing.\n\nDoes Bluesky have more in common\n\nwith a crypto startup than one might like\n\noriginally suspect?\n\nWell the term Web3 got very associated\n\nwith cryptocurrency, so it's not a good word to use for\n\nwhat we're doing anymore because there isn't a blockchain\n\nor a cryptocurrency involved.\n\nBut if you wanna think about Web3\n\nas evolving the social Web2 version forward,\n\nthat kind of is what we're doing.\n\nWe're evolving forward social media\n\nthat was based in centralized companies into something\n\nthat is open and distributed\n\nand that was some of the goals underlying the Web3 movement\n\nthat had a lot of blockchains involved.\n\nWe just didn't build on that technical foundation\n\nof a blockchain because we didn't need it.\n\nYou can achieve a lot of the same things using\n\nopen web principles and more Web 1.0 kinds of technology,\n\nwhich is, for example,\n\nour identity system let's you use a domain name\n\nas your username so you can be like\n\nwired.com as your username.\n\nThat's just a web 1.0 technology brought\n\ninto a social media sphere.\n\nAnd so I think our investors really saw that vision\n\nand they're also excited about building out\n\nthe broader dev ecosystem,\n\nwhich is something we really wanted alignment on.\n\nWe want investors who care about seeing this entire world\n\nof social media come to life,\n\nnot just one application Bluesky succeeding.\n\nYeah. What would building out the dev ecosystem look like?\n\nIt's starting to happen.\n\nSo the Atmosphere Conference,\n\nwhich I mentioned was started and run by the community.\n\nWe heard about it partway through and sponsored it,\n\nbut they found other sponsors as well.\n\nAnd it's something that's taking off sort of as a movement\n\nof people to reclaim social and Bluesky\n\nand the Open Protocol is a great place\n\nto do a lot of this building.\n\nPeople are getting in and starting\n\nto build different applications,\n\nstarting to propose new ways the protocol could be evolved.\n\nPrivate data for example, is not something\n\nthat we have in Bluesky at the moment\n\nas part of the protocol, but people are proposing new ways\n\nto do private data for their applications\n\nthat they're building.\n\nAnd so moving forward the app protocol,\n\nI don't think all the development will just be\n\nwithin the Bluesky company.\n\nIt'll be other people building their own applications\n\nand then modifying the protocol\n\nand suggesting changes\n\nthat meet the needs of what they're trying to do.\n\nAnd when you say the Bluesky company,\n\nlike would you be the CEO of all of this\n\nor just the platform?\n\nI am just the CEO of Bluesky Social.\n\nSo we have built out the app protocol\n\nand we maintain the Bluesky application.\n\nSo we'll always maintain the Bluesky app,\n\nbut the app protocol is going to take on a life of its own.\n\nPieces of it are going to be standardized,\n\npieces of it are going to be stewarded by the community\n\nand it's going to evolve in different directions\n\nas the new people who are getting involved shape it.\n\nRight now you do have some investor money.\n\nIs your stance on advertising still the same?\n\nWhere are you with subscriptions?\n\nBasically this is me asking you\n\nhow are you planning to make money?\n\nYeah, subscriptions are actually coming soon as well.\n\nSo that got delayed\n\nfor a few months last year doing our growth spurt,\n\nbut we're re-approaching how we're gonna do them\n\nand I think the next steps down the road are also\n\nto look into what kind of marketplaces can we build\n\nthat span some of these different applications.\n\nThere's other apps in the ecosystem that are experimenting\n\nwith say, you know, placing sponsored posts\n\nin feeds and things like that.\n\nI've mentioned before, I think ads eventually in some form\n\nwork their way into an attention economy,\n\nbut we're not gonna do ads the way\n\ntraditional social apps did\n\nbecause we don't have a single feed\n\nand the traditional ad model is usually getting everyone\n\nto spend as much time engaged on a single feed as possible\n\nand then putting ads in there.\n\nSince we have lots of different feeds.\n\nEven if we did that, you could switch away\n\nand use a different feed because this one has too many ads.\n\nAnd so it kind of constrains the open model of\n\nwhat we've done, constraints what we can do.\n\nWe'll just let people experiment\n\nand see what comes out of it.\n\nSome people watching this video might not be\n\nsuper familiar with Bluesky.\n\nWhat do you want people to know about this platform?\n\nI'd want them to know this is\n\na choose your own adventure game so you can get in there\n\nand customize the experience as much as you want.\n\nAnd if you're not finding what you want\n\nwithin the Bluesky app,\n\nthere might be another app out there\n\nthat is still part of the Bluesky at protocol ecosystem\n\nthat will give you what you want.\n\nLike if it's you know, videos or images\n\nor maybe a different kind of feed experience,\n\nlike let's say the Discover Feed isn't giving you\n\nwhat you want, you can install a different one\n\nand find the stuff you want\n\nand if you can't find it, you can build it.\n\nAnd so the options are really endless.\n\nI think it takes some time to get in there\n\nand really set things up the way that you like it,\n\nbut then once you do, it's a great place to be\n\nbecause you don't get this level of control anywhere else.\n\nI mean you've kind of sold me on becoming an app developer\n\nfor this protocol.\n\nI might be making a career pivot soon, so thank you.\n\nYeah, I think there's lots of technical folks who watch,\n\nyou know, Wired interviews as well\n\nand I would just love for them to know\n\nthat this is an open field to build on.\n\nThis is like early social era\n\nwhere you can build anything on fully open APIs.\n\nWell thank you again for joining us.\n\nThank you. [cameras snapping]\n\n[upbeat music]",
  "authors": [
    "Condé Nast"
  ],
  "url": "https://www.wired.com/video/watch/the-big-interview-jay-graber"
}