{
  "title": "TechCrunch Disrupt 2025: How to watch the Startup Battlefield finale, Cluely, Solana, SF’s mayor",
  "text": "TechCrunch Disrupt 2025 is here! If you’re still on the fence about attending in person, dive into the extensive schedule of speakers, networking opportunities, workshops, after-parties, and more that’s available here. There’s still time to get a last-minute ticket, and we’re giving a 50% discount since there’s just one day left!\n\nIf you’re not able to attend in person, the next best thing is to check out our livestream of the Disrupt Stage, which features some of our most prominent speakers and the highly anticipated Startup Battlefield 200 pitch competition. We’re streaming via YouTube, so you can catch the embed below, or just follow this link to watch live. Today, we’re starting things up at 10 a.m. PT and ending the Disrupt Stage at around 4:15 p.m. PT.\n\n10 a.m.: Rebuilding the City that Builds Startups\n\nSan Francisco’s new mayor, Daniel Lurie, shares his vision for revitalizing the city’s startup ecosystem. From housing and public safety to innovation policy and global competitiveness, he explains why San Francisco remains the ultimate launchpad for both early- and late-stage founders.\n\n10:30 a.m.: A Conversation with Investor Extraordinaire Elad Gil\n\nBefore most of the world had experienced ChatGPT, Elad Gil had already written seed checks to startups like Perplexity, Character.AI, and Harvey. This on top of checks into, for example, Airbnb, Airtable, Anduril, Brex, Checkr, Coinbase, Deel, Figma, Flexport, Gitlab, Gusto, Instacart, Notion, Opendoor, Pinterest, Rippling, Square, Stripe … you get the idea.\n\n10:55 a.m.: Survive, Scale, Reinvent: Lessons from a Cloud OG\n\nTechcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | WAITLIST NOW\n\nAaron Levie built Box before cloud was cool and the company is still thriving while competitors have come and gone. Known for his sharp takes and startup instincts, Levie joins us to unpack how to keep innovating inside a public company, the possibilities AI and agents bring to enterprise software, and why reinvention is the name of the game in tech right now. Expect real talk and a playbook for building companies that last in the world of AI.\n\n10:55 a.m.: Startup Battlefield Alumni Update\n\nBattlefield startups from the past return to the stage to tell us what they’ve been up to since they competed for the Battlefield Cup. This year, we’ll hear from 2024’s geCKo Materials.\n\n11:25 a.m.: The Startup Battlefield Final\n\nThe grand finale of TechCrunch’s iconic startup competition. Watch the final 5 teams from around the world pitch expert judges and vie for the Startup Battlefield Cup and $100,000.\n\n2:15 p.m.: Crypto’s Next Chapter with Solana’s Anatoly Yakovenko\n\nSolana’s co-founder takes the stage to share where crypto goes from here, from the memecoin frenzy to real-world finance, and why he’s betting big. He’ll dig into Solana’s breakout year, the challenges of scaling a blockchain for mainstream use, and how builders can seize the moment as crypto edges closer to mass adoption.\n\n2:40 p.m.: From Digg to Deals: Kevin Rose on Reinvention and Investing\n\nKevin Rose last spoke at Disrupt in 2012, when Digg was in the middle of one of tech’s most talked-about pivots. More than a decade later, he returns to Disrupt to talk about relaunching Digg alongside Reddit co-founder Alexis Ohanian, and to share what that experience taught him about product and community. Beyond Digg, Rose has become one of Silicon Valley’s most active early-stage investors, backing breakout startups in consumer tech and crypto. In this fireside chat, he’ll reveal how he evaluates founders, spots the next wave of opportunities, and applies lessons from his own entrepreneurial journey to investing today.\n\n3:00 p.m.: Cluely’s Roy Lee: Building, Breaking, and Betting Big\n\nRoy Lee isn’t afraid to stir the pot — or seize the spotlight. The Cluely founder takes the stage to share how he’s building one of the most talked-about startups in AI, why courting controversy can be a growth strategy, and what it takes to stand out in a noisy consumer tech market.\n\n3:30 p.m.: From Courtside to Code: Tristan Thompson on AI, Sports, and Startups\n\nNBA champion and investor Tristan Thompson has built a portfolio that bridges sports, culture, and technology. At Disrupt, he’ll share how he’s channeling his competitive drive into ventures like World Mobile, Basketball Fun, AxonDao, and Somnia — and why he believes athletes have a unique edge in building the next generation of consumer and web3 companies.\n\n4:00 p.m.: Announcing the Winner of the Startup Battlefield 2025",
  "authors": [
    "Techcrunch Staff",
    "Karyne Levy",
    "Julie Bort",
    "Lorenzo Franceschi-Bicchierai",
    "Ram Iyer",
    "Connie Loizos",
    "Anthony Ha",
    "Rebecca Bellan",
    "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var",
    "Media"
  ],
  "url": "https://techcrunch.com/2025/10/29/techcrunch-disrupt-2025-how-to-watch-the-startup-battlefield-finale-cluely-solana-sfs-mayor/"
}