{
  "title": "White House press secretary defends Trump’s ‘piggy’ insult",
  "text": "The White House issued a full-throated defense of Donald Trump’s reference to a Bloomberg News correspondent as a “piggy” on Thursday, claiming without evidence that the president “calls out fake news when he sees it and gets frustrated with reporters who spread false information”.\n\nWhite House press secretary Karoline Leavitt made the remarks during a White House briefing, saying Trump was re-elected because of his bluntness and that members of the media should appreciate his willingness to answer their questions.\n\n“He calls out fake news when he sees it and gets frustrated with reporters who spread false information,” Leavitt said. “But he also provides unprecedented access to the press and answers questions on a near-daily basis.”\n\nLeavitt did not specify what “fake news” or “false information” Trump was responding to when he called Catherine Lucey, Bloomberg’s White House correspondent, “piggy”.\n\nThe clash between Trump and Lucey happened on Friday onboard Air Force One. Lucey asked a question about the unfolding Jeffrey Epstein scandal and the possibility of the House voting to release all of the files related to his case, which came to fruition earlier this week.\n\nWhen Lucey started to ask why Trump was behaving the way he was “if there’s nothing incriminating in the files”, Trump pointed at her and said: “Quiet. Quiet, piggy.”\n\nThe remark received widespread backlash on Monday and Tuesday, with many fellow journalists condemning the incident. CNN anchor Jake Tapper wrote on X that the comment was “disgusting and completely unacceptable”, while former Fox News anchor Gretchen Carlson called the remark “disgusting and degrading”.\n\nWhile Trump has long held and shared contempt for journalists publicly, he’s been particularly open this week with his vitriol. On Tuesday, Trump called another female reporter, Mary Bruce of ABC News, “a terrible person” in the Oval Office. The reporter had asked Mohammed bin Salman, the visiting Saudi crown prince, about the killing of Washington Post journalist Jamal Khashoggi, and also why Trump had not released the Epstein files.\n\n“Mr President, why wait for Congress to release the Epstein files?’ Bruce asked. “Why not just do it now?”\n\n“It’s not the question that I mind. It’s your attitude. I think you are a terrible reporter. It’s the way you ask these questions. You start off with a man who is highly respected, asking him a horrible, insubordinate, and just a terrible question,” Trump responded.\n\nAfter this incident, the Society of Professional Journalists issued a statement condemning Trump’s remarks to Lucey and Bruce.\n\n“These incidents are not isolated; they are part of an unmistakable pattern of hostility – often directed at women – that undermines the essential role of a free and independent press,” the statement reads.\n\nSPJ executive director Caroline Hendrie emphasized that “targeting women reporters with humiliating insults should not be tolerated”.\n\n“What we say – and what we refuse to say – signals to the world how much we value human rights and free expression,” Hendrie said. “When US leaders downplay the murder of a journalist or shame reporters for demanding transparency, it reverberates far beyond Washington.”",
  "authors": [
    "Jenna Amatulli"
  ],
  "url": "https://www.theguardian.com/us-news/2025/nov/20/white-house-defends-trump-piggy-insult"
}