{
  "title": "The French city where you can eat gourmet food for €1",
  "text": "In Marseille, France’s most diverse city, a new wave of restaurants is redefining fine dining by blending haute cuisine with community solidarity.\n\nBehind the ornate facade of Marseille restaurant Le République, lunch service is in full swing. Smoked mullet with sea fennel butter arrives as a starter, invoking the salty history of France's second city. Hay-smoked cheese with rice flour follows, singing with flavour from the surrounding Provençal countryside. Tourists and locals savour organic ingredients prepared by Michelin-starred chef Sébastien Richard.\n\nBut Le République is a gourmet restaurant with a few big differences. First, the staff include a recently released prisoner. Second, around 40% of diners will pay just €1 for their three-course feast. And, finally, several diners have never set foot inside a restaurant before.\n\nLe République is a restaurant solidaire – one of around 10 in Marseille – run as a social enterprise in aid of community solidarity. Other examples include L'Après M, a former McDonald's taken over by its redundant staff when the franchise closed. The team purchased the premises and reopened it as a social enterprise, serving gourmet burgers created by a three-star Michelin chef served to the beat of Algerian rap, while operating a free food-delivery service of healthy takeout for people in need.\n\nMarseille's newest restaurant solidaire is Chaleur, which opened in June 2025. When I visited, it was packed with patrons enjoying chilled cucumber soup adorned with clams, figs and roasted pumpkin seeds. A blowout lunch with wine costs around €25 (£21; $29). But if a patron explains that they're in a penurious position, they can enjoy the exact same menu for a tarif suspend – a \"suspended rate\" – of just €8 (£6.90; $9.29). Across Marseille, prices vary by philosophy. Some, like Le République, partner with charities to subsidise €1 meals, while others, like Chaleur, operate on trust.",
  "authors": [],
  "url": "https://www.bbc.com/travel/article/20251013-the-french-city-where-you-can-eat-gourmet-food-for-one-euro"
}