{
  "title": "‘Do you expect me to talk?’: Dick Van Dyke says he turned down playing James Bond",
  "text": "For more than six decades, the actor Dick Van Dyke has been pilloried for his attempts at a British accent in Mary Poppins (1964). Now, the actor who has since apologised for the “most atrocious cockney accent in the history of cinema” as chimney sweep Bert in the Disney classic has revealed he was in the running to play another UK icon on screen: James Bond.\n\nSpeaking on the Today TV programme in the US, Van Dyke, who turns 100 next month, said that Bond producer Albert Broccoli approached him after his performance in Chitty Chitty Bang Bang in 1968 to ask if he fancied being a successor to Sean Connery.\n\n“Would you like to be Bond?” Van Dyke recalls Broccoli saying, to which he replied: “Have you heard my British accent?”\n\nIn press since, Van Dyke has credited his notoriously inaccurate attempt in Mary Poppins to an Irish dialect coach, while also suggesting that cast and crew, including Julie Andrews, should have flagged with him any shortcomings.\n\nVan Dyke continued by saying that he is still actively seeking acting work, saying: “I don’t want to [retire], I mean, it’s my life. I love it.”\n\nThe star, who won three Emmys for The Dick Van Dyke Show, as well as a Tony award for Bye Bye Birdie, is promoting a new book, 100 Rules for Living to 100: An Optimist’s Guide to a Happy Life.\n\nThe star is a famously garrulous chatshow guest. In 2010, then 84, he recalled how he was rescued from drowning by porpoises who pushed his surfboard back to shore after he nodded off on the waves.\n\nThree years later, he was rescued from a burning car on the California freeway, and in 2023 came another close call, when he lost control of his Lexus in rainy weather and crashed into a gate.\n\nThe actor who will become the next cinema Bond is still to be announced, after Daniel Craig’s departure and rights to the franchise being handed over to Amazon.\n\nAlthough Scottish, Irish and Australian stars have taken on the role, no American since Van Dyke is thought to have been in contention. Should he again fail to secure the role, Callum Turner, Aaron Taylor-Johnson and Theo James are believed to be the frontrunners.",
  "authors": [
    "Catherine Shoard"
  ],
  "url": "https://www.theguardian.com/film/2025/nov/20/do-you-expect-me-to-talk-dick-van-dyke-says-he-turned-down-playing-james-bond"
}