{
  "title": "Sisu: Road to Revenge review – Finnish hero takes on a Red Army butcher in terrific sequel",
  "text": "In 2022, the Finnish indie action movie Sisu had the look of a one-hit wonder. Pitting a grizzled prospector against an entire platoon of Nazis, writer-director Jalmari Helander heeded the lessons of George Miller’s Mad Max: Fury Road, principally that there is serious cinematic value in going pedal-to-the-metal along a single, straight narrative line. That profitable sleeper hit now yields this choice follow-up, which somehow feels more expansive while still clocking in under 90 minutes.\n\nHaving seen off the SS, indomitable hero Aatami (Jorma Tommila) gains a tragic backstory and a new, vicious postwar foe in the tremendously named Red Army butcher Igor Draganov, played by wily James Cameron favourite Stephen Lang. Again, the economy of Helander’s approach proves striking and thrilling. No unnecessary obstacles have been placed between the audience and a good time at the movies: we get one scene of Aatami dismantling his family home beam by beam and one scene of Draganov being sprung from jail before the pair intersect in the back roads of Soviet-occupied Finland. Cutting to the chase grants Helander time to craft set pieces in which Aatami outthinks and outflanks the Red Army’s might; in this respect, Sisu 2 is a more-of-the-same sequel. The good news is that it remains terrific: punchy, old-school stunt work, crisply uncluttered cutting, and varied, inventive baddie-splattering from the moment Aatami deploys one of those beams to take down a jet fighter.\n\nRevelling in his homeland’s gorgeous, sun-dappled scenery, Helander has the boyish enthusiasm of a kid playing war games in the woods; you half-expect someone’s mum to call everybody in for tea. It may be cartoonish – look sharp for a regrettably misplaced mousetrap – but the comic-strip simplicity serves as a rebuke to knottier blockbusters. You don’t need excessive CGI with practical special effects as potently compelling as Tommila’s bloodied, defiant face. The script meanwhile offers one grace note after another; those beams become a memento, then a life raft, then a new beginning.\n\nLike his protagonist, Helander holds on to the essential, torches the rest, and goes harder and faster for it. His film should raise huge cheers in Kyiv – and, indeed, everywhere else.",
  "authors": [
    "Mike Mccahill"
  ],
  "url": "https://www.theguardian.com/film/2025/nov/19/sisu-road-to-revenge-review-finnish-hero-takes-on-a-red-army-butcher-in-terrific-sequel"
}