{
  "title": "Mark Wahlberg Answers The Web's Most Searched Questions",
  "text": "Transcript\n\nHey, I'm Mark Wahlberg,\n\nand this is the Wired Autocomplete Interview?\n\n[upbeat music]\n\n[Producer] Do you remember the last thing you Googled?\n\nNo, but I remember the last thing my son Googled of me.\n\nYeah, he was asking me how much money I had.\n\nI said, Don't pay attention to that.\n\nThat's inaccurate.\n\n[upbeat music]\n\nOkay.\n\nNo, although I am named an honorary Philadelphian\n\nfor playing Vince Papale in the movie.\n\nI made five movies in Philadelphia,\n\nand especially as a Boston native\n\nand a Boston sports fan,\n\nwe have a major rivalry with Philadelphia.\n\nSo to be named an honorary Philadelphian is a big deal.\n\nOkay. That's a lot of love.\n\nThey threw snowballs at Santa Claus, so yeah,\n\nso you'd be like, Hey, you're from Boston.\n\nLike what part?\n\nThey're like, Oh, Nashville, New Hampshire.\n\nYeah, no, no, no. I'm from the [bleep] hood.\n\nMark Wahlberg making new movie.\n\nI'm about to make a new movie\n\nand I just finished a movie.\n\nI don't know if you noticed,\n\nbut I keep pretty busy in this day and age.\n\nThat would be a yes.\n\nI am definitely a diehard Celtics fan,\n\nespecially now with Coach Joe Missoula.\n\nHe and I share a special bond in our faith\n\nand our love for our family,\n\nand putting our faith and our family first.\n\nSo shout out to the coach.\n\nI hope you enjoyed Rome\n\nand I hope you enjoyed that restaurant I sent you\n\nto La Pergola.\n\nIs Mark Wahlberg Italian? Yeah.\n\nThis fucking guy over here, this fucking Italian.\n\nOf course I'm fucking Italian.\n\nGet the car.\n\nFucking hey, stupid. Get the fucking car.\n\nNo, I'm not Italian.\n\nI am Swedish, French Canadian, Irish,\n\nand whatever other little mixture my parents had\n\nalong the way.\n\nYeah. Fuck outta here.\n\nThis fucking guy, this fucking guy staring at me over here.\n\nOkay, we good?\n\nOkay, why does Mark Wahlberg work out at 4:00 AM?\n\nWell, I don't always work out at 4:00 AM,\n\nbut most days I do.\n\nThere's been this whole thing about my schedule\n\nand it's gotten way outta hand.\n\nI don't take hour and a half showers, but I do,\n\nno, I get up.\n\nIf I get up at 3:00 AM, there's a good chance\n\nthat I went to bed at 7:00 PM,\n\nso I always get eight hours sleep.\n\nI truly believe that recovery, good rest is just\n\nas important as working out, if not more, as is nutrition.\n\nBut yes, I got up this morning at three.\n\nI cold plunged at 3:45. I was in the gym at four.\n\nI was outta the gym by five.\n\nI was on the golf course at 6:45.\n\nI played 18 holes in two hours,\n\nand then I got stuck in this beautiful studio\n\nthat I'm reminiscing about.\n\nWe shot Boogie Nights here.\n\nThat's a true story too. Yeah.\n\nOkay. Why did Mark Wahlberg municipal?\n\nOh, I missed one. Sorry.\n\nWhy did Mark Wahlberg name his clothing line Municipal?\n\nBecause as you know, municipalities are something\n\nthat are accessible to the public and for everybody.\n\nWe are encouraging and inspiring people\n\nand challenging people\n\nto be the best versions of themselves.\n\nSo whatever level you think you can attain, there's more.\n\nEverybody starts somewhere.\n\nYou can start at a municipal basketball court,\n\nyou start a municipal golf course, you can become a member\n\nof Augusta, you can win the Masters.\n\nThere isn't anything you can't do\n\nif you're willing to do the work.\n\nSo there is no better name.\n\nAnd this name is going to be around for a long time.\n\nYou'll see.\n\nWhy does Mark Wahlberg look like Matt Damon?\n\nI don't know. Why does Matt Damon look like Mark Wahlberg?\n\nI think, you know what, I take it as a compliment.\n\nI tell you what, if people say,\n\nHey, I loved you in fucking Bourne Identity,\n\nI say thank you, and I keep walking.\n\nI am not about to try to correct somebody.\n\nI don't have enough time in the day\n\nto tell people the difference between myself and Matt.\n\nAnd he gets that a lot.\n\nAnd we got a lot of laughs about that\n\nwhen we were doing The Departed.\n\nYeah. All good.\n\nFuck outta here, man. Okay.\n\nWhen does Mark Wahlberg go to bed?\n\nYou know what, I tell you today,\n\nprobably gonna be about 6:15.\n\nI turn the television on\n\nand I choose, not what I'm going to watch,\n\nbut what is gonna watch me sleep.\n\nAnd it takes about five minutes and I'm done\n\nbecause usually I have a very full day, every day.\n\nI go, I get after it from the second I wake up\n\nand by the time I lay my head down, whew.\n\nReady for some snoring. Wow.\n\nDoes Mark Wahlberg eat breakfast? Of course.\n\nBreakfast is the most important meal of the day.\n\nI don't eat breakfast the way I used to eat breakfast.\n\nBy the time, I used to get up,\n\nI'd be up maybe 15 minutes and I had to eat something.\n\nI always felt like I needed to be eating all the time.\n\nLed to a lot of gut issues for me,\n\ndigestion issues, stuff like that.\n\nSo I woke up this morning at three\n\nand I didn't have breakfast until after golf.\n\nI probably ate about 10:45, 11:00 AM,\n\nbut biggest meal of the day is breakfast,\n\nsmall lunch, and a small dinner.\n\nThat's usually it for me.\n\nAnd I try to do that in a six hour window.\n\nMaybe on my two toughest workout days,\n\nMondays and Thursdays, my leg days, I'll do four meals,\n\none little small meal in between in the afternoon,\n\nnice little snack.\n\nA triple espresso in the morning, and then that's it.\n\nBut if I'm gonna do a fast, four day, five day fast,\n\nI can drink as much espresso as I want\n\nand then water, that's it.\n\nBut I like to fast once in a while.\n\nCan Mark Wahlberg dance ballet?\n\nI did dance ballet in The Other Guys.\n\nThat was me giving it my best shot.\n\nBut I would not say that I'm like a qualified ballet dancer.\n\nThat's for sure.\n\nIs Mark Wahlberg the youngest?\n\nYes, I'm the youngest of nine children.\n\n[Producer] Can you name all of your siblings?\n\nNo. I forgot most of their names already.\n\nThat's like such a hard question.\n\nThat's like asking me their birthday.\n\nNo, of course.\n\nMy sister Debbie, rest in peace.\n\nMy sister Michelle, rest in peace.\n\nMy brother Arthur, my brother Paul, my brother Jim,\n\nmy sister Tracy, my brother Bob, and my brother Donnie.\n\nYep, and my mom actually had two miscarriages very late\n\nin pregnancy, so I would've had an older brother\n\nand I would've actually had a younger brother.\n\nYep. She never stopped trying to have more.\n\nHow old is Mark Wahlberg in Boogie Nights?\n\nWhen I shot Boogie Nights, I was 25.\n\nI was 25.\n\nSo yeah, 29 years ago in this studio, popping fireworks.\n\nPaul was 25 as well.\n\n25. Imagine that.\n\nIt's crazy, right?\n\nLong time. Goes by fast.\n\nI was just thinking of Bill Paxon\n\nand Philip Seymour Hoffman.\n\nThey worked together on Twister\n\nbefore we shot Boogie Nights\n\nand Bill was working across the street.\n\nHe and I had just done a movie\n\nand I was over here doing Boogie Nights\n\nand wanted to try to get them to reconnect.\n\nHow much does Mark Wahlberg eat a day?\n\nWell, I said that already. Three meals.\n\nFour meals every once in a while.\n\nHow Mark Wahlberg get started?\n\nHow Mark Wahlberg get started.\n\nMark Wahlberg come from very humble beginnings.\n\nMark Wahlberg's doesn't mind working. Okay?\n\nGrinding, working, dream, the plan, the hustle.\n\nIs that a good answer?\n\nWhere's Mark Wahlberg's burger restaurant?\n\nWe have many locations all over the country\n\nand all over the world.\n\nAlso, we're international.\n\nWe are in Australia, we're in New Zealand, we're in Canada,\n\nwe're here in LA and Hollywood Boulevard.\n\nAnd we have many, many new locations coming very soon.\n\nNever wanted to be in the burger business,\n\nbut my brother is a very accomplished chef.\n\nYou know, he was always working for other people.\n\nHe wanted to open his own business.\n\nHe opened the first restaurant, which is Alma Nove,\n\nwhich was a tribute to my mother, Alma's Nine,\n\nfor the nine children.\n\nAnd she was the hostess there.\n\nAnd then he wanted to start a burger chain,\n\nwhich I thought was a ridiculous idea.\n\nBut then of course,\n\nthe entrepreneur in me was like, You know what?\n\nI can actually build this.\n\nSo I take care of the business.\n\nHe kind of comes up with the customer experience.\n\nDonny does the marketing,\n\nand it really did bring us together.\n\nAnd I think the best thing about the show,\n\nwhich created a lot of awareness\n\nand excitement around the brand,\n\nreally gave my mom the recognition\n\nthat I think she really desired, but certainly deserved\n\nfor raising nine kids in a very difficult situation\n\nunder very difficult circumstances.\n\nSo to kind of get her to reconnect,\n\nshe became a celebrity herself,\n\nshe was kinda like the star of the show.\n\nIt really meant a lot to her.\n\nI mean, obviously she was thrilled\n\nto see us become successful,\n\nbut you know, she had worked really hard\n\nand she had dreams of her own.\n\nAnd so it meant a lot to her when people recognized her\n\nand said what a wonderful job she did with the kids\n\nbecause, you know, it was not always the case.\n\nWhere is Mark Wahlberg's Hollywood star?\n\nIt's on Hollywood Boulevard across from,\n\nwhat's that theater?\n\nWhat's it, the hotel? The nice hotel.\n\n[Producer] The Roosevelt. The Roosevelt.\n\nIt's near the Roosevelt Hotel,\n\nacross the street on the other side.\n\nSame side as Chinese,\n\nso that would be north side of the street?\n\nI don't have my compass, I'm sorry.\n\nWhere did Mark Wahlberg meet his wife?\n\nI actually met my wife through a mutual friend in New York.\n\nWe had kind of crossed paths in LA,\n\nbut we met in New York through a mutual friend.\n\n[Producer] How long have you been married?\n\nTrying to get me a lot of trouble.\n\n15 years.\n\nOkay. Can Mark Wahlberg fly a helicopter?\n\nNo. Fuck no.\n\nI could fly a remote control helicopter.\n\nDoes Mark Wahlberg own a Chevy dealership?\n\nI own multiple Chevy dealerships.\n\nYou want a deal?\n\nLittle Suburban, Silverado?\n\nMy favorite Chevy, Camaro.\n\nEh, Corvette, Camaro, Impala.\n\nI actually just had an old mobile 442, 1971.\n\nIt's pretty sweet.\n\nCan Mark Wahlberg speak French?\n\nI can say bad words in lots of languages, yes.\n\nI've spoken French in multiple movies.\n\nI've spoken now, Mandarin, Cantonese,\n\nArabic, Spanish, Hebrew.\n\nYes, I spoke quite a bit\n\nof French, actually in the last movie,\n\nI speak, in the last Family Plan,\n\nI speak even more French than I did in the first one.\n\nAnd I know all the curse words.\n\nFuck, it's about [speaks in French]!\n\nOkay. What breed is Mark Wahlberg's dog?\n\nWell, I have more dogs than you're allowed\n\nin the state of Nevada.\n\nWe have five dogs,\n\nbut technically we have six dogs in the house.\n\nAnd really, we have seven dogs\n\nbecause now my daughter has a dog,\n\nnamed Dixon, a golden retriever.\n\nHe lives with her, but hopefully after school,\n\nshe'll come home and he'll be with us.\n\nMy son Michael has a dog\n\nthat lives upstairs in our house named Pickle.\n\nHe's a wiener dog.\n\nYou know the long, little, what are they called?\n\nDachshunds, yeah.\n\nSo cute, named Pickle.\n\nOh, she's a sweetheart.\n\nAnd then we have two pomskies, Jojo and Penny.\n\nAnd then we have a pomeranian teacup, named Champ,\n\nwho's battling alopecia.\n\nSo if anybody has a cure, if not, offer up some prayers.\n\nHe doesn't notice. He doesn't mind.\n\nBut he was like, oh, like, he was like Ted.\n\nAnd then we have two Boston terriers,\n\nLola and Nugget.\n\nYeah, we got a house full of dogs\n\nand usually a living room full of poop that we have\n\nto clean up in the morning.\n\nJojo doesn't like Nugget.\n\nJojo is the pomsky.\n\nHe's got that wolf mentality.\n\nOh shit, I missed one. Sorry.\n\nWe'll cover that up. Can't see that.\n\nWhat is Mark Wahlberg's accent?\n\nYou know, I tried to lose my Boston accent\n\nwhen I got into the movies.\n\nI realized not everybody spoke like me.\n\nAnd for a lot of people, it was like nails on a chalkboard.\n\nAnd so I was like, You know what?\n\nGoing to lose my accent.\n\nNever gonna play a Boston character ever.\n\nSome of the most memorable films are me playing Boston guys,\n\nwhether it be The Fighter or The Departed\n\nor Ted, Patriots Day.\n\nI mean, there's a lot of movies that I've done.\n\nSpenser Confidential.\n\nYou know what's funny is, Perfect Storm,\n\nbut when other actors do a Boston accent,\n\nthis is a nice little tidbit I'll share with you,\n\nwe were doing The Departed and Matt Damon\n\nand I, obviously both from Boston\n\nand most of our other actors weren't from Boston.\n\nAnd there were some actors, not all,\n\nbut some were like, I think they're gonna think\n\nthat we're doing two heavy fake Boston accents.\n\nRight, a lot of people, you know, some people, they listen\n\nto JFK, you know, some people do, you know,\n\nthey all have their puck to eye and that's it.\n\nBut it's a little more nuanced than that.\n\nBut definitely tried to shake the accent for a long time.\n\nIf I have too much time at home\n\nor a little too much of something,\n\nthen maybe it comes out a little bit thicker.\n\nBut my kids love to make fun of my accent.\n\nNot the wicked, guys. That's terrible.\n\nThat's terrible. I fucking hate that.\n\n[Producer] I've never been able to get rid of it.\n\nYeah, like when somebody says,\n\nHey, I'm a mass hole, I'm a fellow mass hole.\n\nI'm like, why would you call yourself that?\n\nWe grew up in Dorchester, right?\n\nSo people, they call us dot rats, right?\n\nIt's not a compliment.\n\nAnd people who aren't from there will think, you know,\n\nit's cool to be from there.\n\nLike, they call you dot rat.\n\nWe get offended by those things.\n\nOkay, what music does Mark Wahlberg listen to?\n\nRight now, I'm crazy into yacht rock.\n\nLike, yacht rock, I have a boat\n\nand we have the adult boat\n\nand the kids go out on the ski boat and wakeboard and tube.\n\nI go in that, I wanna hear some Todd Rundgren,\n\nI wanna to hear some Michael McDonald,\n\nI want to hear Journey.\n\nI wanna see some fucking hit fucking records\n\nthat take you back, a little bit of nostalgia.\n\nI don't really listen to music when I'm in the gym.\n\nI kind of have ESPN on.\n\nI'm watching sports highlights from the night before\n\nthat I missed because I was asleep so early.\n\nNever know who won the game.\n\nNever usually make it past halftime.\n\nAnd that's like, it's a west coast game.\n\nI like obviously hip hop music, I like reggae,\n\nI like rock and roll, I like R&B.\n\nMy kids are now like, not all of my kids,\n\nbut two of my children specifically are into country,\n\nwhich is like, so random.\n\nBut it's cool.\n\nBut yeah, I'm mostly listening right now, yacht rock,\n\nclassic rock.\n\nAll right, well thank you guys\n\nfor all the wonderful questions.\n\nHopefully I answered as thoroughly as you'd hoped.\n\nAnd you know, make sure if you get a chance,\n\nplease check out Play Dirty\n\non Amazon Prime, streaming now.\n\n[upbeat music]",
  "authors": [
    "Condé Nast"
  ],
  "url": "https://www.wired.com/video/watch/google-autocomplete-inverviews-mark-wahlberg-answers-the-webs-most-searched-questions"
}