{
  "title": "EJAE on KPop Demon Hunters and Her Journey to Success",
  "text": "Transcript\n\n♪ Gonna be, gonna be golden ♪\n\n[Ejae sings in Korean]\n\nI think there's a formula for a K-pop hit.\n\nHooky is definitely important.\n\nThe melody came quite instantly.\n\nWe just like looked at ourselves and like,\n\nEjae, is this a hit?\n\nLike we're just like, Wow, I think this is a smash.\n\nWired sat down with Ejae,\n\nshe's the singing voice behind Rumi\n\nand Netflix's wildly successful K-Pop Demon Hunters.\n\nShe co-wrote several songs on the soundtrack,\n\nincluding Golden.\n\nWe talked about what it's like inside the K-pop machine\n\nand if there's a formula to writing a hit song.\n\nThis is The Big Interview.\n\n[camera clicking]\n\n[casual music]\n\nSo the movie came out in June,\n\nit's become Netflix most watched project.\n\nThere's Oscar buzz.\n\nWhat's it like knowing that every kid in America\n\nknows the words to your song?\n\nOh my God.\n\nIt's like a dream come true as a songwriter.\n\nAnd the fact that kids are like so plugged.\n\nSo the fact that they love it,\n\nit's like I feel real proud of myself, you know?\n\nYou got like the kids' stamp of approval.\n\nI got them.\n\nAnd it's hard to get kids' stamp of approval,\n\nso I feel like a cool person.\n\nCan you tell me a little bit of the story of Golden,\n\nand like did you know it was going to be a hit\n\nright off the bat?\n\nI mean, in our little circle, yes, it was a hit.\n\nSometimes like, you know, I do hear from other songwriters,\n\nlike when a hit happens, it happens quite fast.\n\nThe lyric and the writing was a whole process,\n\nbut the melody came quite instantly,\n\nbecause I had this session with Mark, my co-writer,\n\nand I was like, Mark, I'm so excited.\n\nI was like, Oh my God, this melody.\n\nAnd he heard it and he was like,\n\nOh my God, this is amazing.\n\nSo when we finished the whole song and the lyrics,\n\nwe just like looked at ourselves and like,\n\nwe're just like, Wow. Ejae is this a hit?\n\nLike we're just like, Wow, I think this is a smash.\n\nSo yeah, amongst us, like we thought it was a hit.\n\nIs there like a formula to making a K-pop hit\n\nor is it just different every time?\n\nI think for like K-pop hit,\n\nhooky is definitely important.\n\nA concept that everyone can relate to\n\nand it's kind of easy to sing.\n\nI think with K-pop hits, though,\n\nmelody is also very important,\n\nbut you need different elements.\n\nYou have to keep exciting the audience,\n\nwhether there's a chord change,\n\nor there's a melodic change,\n\nor rhythms change, or something.\n\nThe second verse is a rap, you know?\n\nBecause, again, K-pop idols are usually in groups,\n\nso you need different members singing different parts,\n\nshowing off their role in the group.\n\nThat's one thing, and also, K-pop,\n\nvery important is choreography.\n\nThere are a lot of songs in K-pop\n\nwhere the song got huge because of the choreography.\n\nSo I think that comes hand in hand in K-pop.\n\nThere is a general formula of like,\n\nif you start on one on the verse,\n\nstart on like the upbeat on the pre,\n\nand then the chorus come in before or something.\n\nLike it should come in differently.\n\nAnd also like, melodically, like if you start here,\n\nin the pre-chorus go higher,\n\nand in the chorus come back to the the verse\n\nor like go higher.\n\nYou know, there's like a formula to that.\n\nSo I think with Golden too,\n\nit kind of followed that formula.\n\nGolden was actually quite interesting of being a hit\n\nbecause, right now, a lot of the pop hits\n\nare quite in the same range.\n\nIt's more like lyrical puns and funny concepts.\n\nBut the melodies are quite easy to listen to.\n\nWhereas Golden is very melodic, right?\n\nBut I do still think in pop and global hits in general,\n\nmelody is king, 100%.\n\nNirvana is a huge example of that.\n\nTeen Spirit. He's saying gibberish.\n\nDefinitely something I didn't expect you to say.\n\nNo, but seriously, it's like, Mosquito.\n\nIt's like, literally.\n\nBut the melody is so good.\n\nAnd when your melody is amazing,\n\nand for me, I look up to Max Martin so much,\n\nhe has like incredible melodies.\n\nIt just like, oof.\n\nI have so much respect for Taylor Swift and Max Martin.\n\nThat synergy is just amazing.\n\nSo I think, universally, when the concept is really good,\n\nand it's easy to say, and also when there's a good melody\n\nand a great message, you have a hit, I think.\n\nThere's been sort of a lot of talk right now\n\nabout AI's infiltration into songwriting\n\nand just artistry in general.\n\nDo you have any thoughts on that?\n\nLike did you use it at all for the movie?\n\nNo.\n\nOne thing I find so interesting,\n\nso fascinating is like,\n\npeople are like, Oh, like it's an animated character\n\nand it's a girl group and they're singing. It's AI.\n\nLike why is this AI girl group becoming number one,\n\nand stuff like that, right?\n\nIt's hurtful because we work so hard.\n\nLike I'm a singer, I'm not an AI.\n\nAs a songwriter, like you've kind of been more\n\nbehind the scenes.\n\nWhat is your relationship with fame right now?\n\nLike do you consider yourself famous?\n\nNo.\n\n[both chuckle]\n\nI consider the song famous, which I love.\n\nFame is a tricky thing.\n\nYou know, I was a K-pop trainee myself,\n\nand my grandpa is also an actor.\n\nSo I've seen fame in different angles,\n\nand it's very beautiful in the front, you know?\n\nBut it can get very, very dark.\n\nI feel like fame is definitely not for the faint heart,\n\nand so I'm trying to navigate through it.\n\nSuddenly getting all this attention is quite,\n\nit's very new.\n\nI can't quite say it's natural for me, to be honest.\n\nI love being behind the scenes,\n\nand working with people behind the scenes.\n\nBut yeah, I'm trying to get used to it.\n\nI was listening to an interview with Maggie Kang\n\nand she was saying how it took her years\n\nto even be able to pitch this movie,\n\nand she didn't come across any like animated Korean movies.\n\nWhat does it mean to have this breakthrough moment\n\nand so much success and for that to be\n\nan Asian story and a Korean story?\n\nOh my God, it means the world.\n\nIt means so much as a Korean American, Asian American woman.\n\nAnd it just feels so cool to be finally like portrayed\n\nas not the typical portrayal of Asian women, I feel like,\n\nwhich is like, what do you call,\n\nlike subservient. Subservient.\n\nYeah, and like, quiet and passive\n\nand always like listening.\n\nBecause I'm not really like that,\n\nI'm quite like outspoken, I'm quite blunt.\n\nFirst of all, it's a superhero movie about Korean women.\n\nAnd they're like so funny. They're goofy.\n\nThey're not just solely strong and badass,\n\nbut like, they like eat their food like crazy.\n\nI do that all the time.\n\nLike we binge on our food and just like.\n\nI think that's what I think is beautiful about the film,\n\nportraying that side of it too.\n\nSeeing that as cool, you know?\n\nObviously like K-pop has been huge for a long time,\n\nbut this is introducing so many new people to it.\n\nDo you feel like, I don't know, how do you feel about that?\n\nDo you worry about it becoming like diluted?\n\nLike, is there concerns around authenticity?\n\nNo, not at all.\n\nBecause, again, this film,\n\nlike there are a lot of Koreans that are a part of it.\n\nYou know, I'm one of them, you know?\n\nI wrote all the Korean lyrics, except for Soda Pop.\n\nBecause I'm bilingual,\n\nI always try to make sure that the end sentence\n\nor end rhyme of the Korean lyrics\n\nrhymes with the English lyrics.\n\nSo Golden, for example.\n\n♪ Gonna be, gonna be golden ♪\n\n[Ejae sings in Korean]\n\nIt rhymes, and it makes sense.\n\nSo, I think that was another thing\n\nthat I think people appreciated, probably.\n\nI mean, I liked it, so. [chuckles]\n\nWhat are your favorite sort of like,\n\nKorean Easter eggs in the movie?\n\nThere's so many.\n\nFor example, it's very small,\n\nbut like the scene where Rumi like loses her voice\n\nand she like runs out,\n\nand then Mira and Zoey are in like this restaurant,\n\nand they were in their sweatpants,\n\nand they're eating soup.\n\nAnd the fact that it's not like the typical bulgogi food,\n\nit's like gukbap, which is, Koreans would know.\n\nAnd the way like the Korean kimchi radish was in,\n\nlike the way that the chopstick were put,\n\nit was so authentic.\n\nSo, and those little details\n\nis what I think the Korean people definitely appreciated.\n\nOh, another one, Easter egg.\n\nI love when they say [speaks Korean].\n\n[Zoey speaks Korean]\n\nLike in between, that's so,\n\nthat means like, let's go.\n\nI love that. I feel like every language\n\nhas a version of that.\n\nYes, 100%.\n\nAnd for me, when I saw that, I was like,\n\nOh my God, I do that all the time.\n\nSo, that was such a beautiful surprise.\n\nI think another one was,\n\nthat actually people don't notice that much\n\nis the fact that in the plane\n\nthey're like sitting on the floor,\n\nand they don't really sit on the couch.\n\nKoreans, I feel like, I noticed with my friends,\n\nlike we sit on the floor and eat.\n\nThat was a really cool detail.\n\nAnd the way Mira sits in that scene\n\nthat I was talking about earlier,\n\nwhere they're eating that stew.\n\nI can't do it right now.\n\nHer leg is like up, she's eating like this.\n\nYeah. It's so fun.\n\nAnyway, yeah. That was so Korean.\n\nThat's such a Korean stance,\n\nwhich I do all the time.\n\nI want to go back to you being a trainee\n\nfor SM Entertainment.\n\nAnd like, so how old were you when that happened?\n\nCan you like tell me a little bit about this world?\n\nBecause I find it so fascinating.\n\nIt is fascinating.\n\nIt's still fascinating for me too.\n\nMy dream to become a singer was like three, four.\n\nAnd then I started auditioning around 10 or 11.\n\nAnd then one of them was SM, and I got in,\n\nand you start training quite immediately.\n\nYou learn how to dance, sing,\n\njazz dance, rap, Chinese, Japanese,\n\nlike the whole thing.\n\nWow. All day, literally.\n\nEvery couple months, there would be like showcase\n\nof like showcasing what you've learned.\n\nEvery Monday, every Sunday, actually,\n\nall the trainees would join in one room,\n\nand we would go in front of the camera\n\nand sing and speak our Chinese and do our dance moves.\n\nSo it was like, intense, I'm not going to lie.\n\nWhat was the criticism like? Like was it harsh?\n\nHow do you cope with that at a young age?\n\nDamn. I don't know how, what,\n\nI don't think I knew what coping meant at that age, right?\n\nWe just take it literally, especially during,\n\nwhen you're 11, when you're going through puberty\n\nis when like girls are so sensitive.\n\nIt wasn't easy, I'm not going to lie.\n\nIt wasn't easy, it's very competitive,\n\nand you're kind of trying to do this job\n\nthat's essentially an adult job, you know what I mean?\n\nAll I could do was work hard\n\nand always try to put my best foot forward,\n\nand always I was craving for a compliment.\n\nMn-hmm.\n\nThat was constant.\n\nLike, Oh, you did so good today.\n\nI just wanted something.\n\nDid you get those very often?\n\nNot really.\n\nI tried to.\n\nYou got better or something,\n\nbut it's very objective.\n\nLike looking at it now as like an adult,\n\nI understand the reason behind certain things\n\nwhen it comes to marketing or something like that.\n\nBut at a young age, it's like, it's not easy to hear.\n\nI'm glad the fame is coming now that it is when I was a kid.\n\nSo you were a trainee for 10 years?\n\nMm-hmm. A little over actually, like 12.\n\nWhat kind of made you walk away from it?\n\nAnd were you expecting to like debut in a group?\n\nLike during that time, did you come close to that?\n\nYeah, I was supposed to debut, and that didn't happen.\n\nAnd then I discovered like underground music,\n\nand my vision and SM didn't align.\n\nYou know, girls and guys with debut quite early,\n\nquite young.\n\nI was like 23.\n\nSo that's quite like,\n\nlike that's like grandma age\n\nfor the K-pop industry. Don't say that.\n\nI'm dead serious.\n\nLike, yeah, so that's kind of like one of the reasons\n\nwhy it just didn't work out.\n\nEspecially when it comes to my singing too.\n\nMy singing didn't really align\n\nwith kind of their vision, I think.\n\nI have a very lower tone, clearly.\n\nMore raspier voice.\n\nSo I have no hard feelings about that.\n\nBut as a kid, you know, it hurts.\n\nI mean, looking at where you are now,\n\nlike does it give you any satisfaction,\n\njust thinking back on the people\n\nwho maybe didn't believe in you\n\nor who didn't give you an opportunity,\n\nare you kind of like?\n\nYou can be petty.\n\nI am. I'm not,\n\nI don't know, like I said, like I get it.\n\nBack then, I was not, like at the level that I am now.\n\nLike I couldn't sing those high notes back then.\n\nSo I get where they were coming from.\n\nSo I do feel satisfied in the fact that like,\n\nI didn't give up and I just kept going.\n\nI think the biggest regret I had when I got dropped\n\nwas I felt like I let down 11-year-old Ejae\n\nwho really wanted to become a singer.\n\nSo in that respect, I feel,\n\nI'm just like, I hope I made her proud.\n\nIt's like the biggest thing I feel.\n\nWith Rumi's character sort of like feeling like,\n\nshe has to mask her patterns.\n\nLike, I don't know, did you relate to that?\n\nBig time. Absolutely.\n\nVery competitive industry,\n\nand looking perfect, sounding perfect,\n\ndancing perfect is essential.\n\nK-pop is not just about the music, it's about everything.\n\nVisuals, packaging, marketing.\n\nHow you speak, are you smart,\n\nlike how you dance, and everything.\n\nSo, it did make me feel pressured\n\nto make sure to always hide away\n\nall my insecurities and my flaws.\n\nOh, and that pressure was really, really heavy.\n\nAnd so, I understood that pressure\n\nof wanting to hide that\n\nto be accepted,\n\nto feel loved.\n\nOof, that was really, really hard.\n\nAnd I think I related to Rumi a lot in that.\n\nHas anything weird been happening\n\nin light of how big the movie has become?\n\nJust like on a fan level.\n\nOr do you feel overwhelmed?\n\nFan level?\n\nYeah. Oh.\n\nThe thing is like, the fans have been so amazing.\n\nI think the fame part is a little tricky.\n\nI don't want to read comments because I have\n\nand I was like hurt by it sometimes.\n\nBut like that's what I'm saying is like,\n\nthe fame part doesn't fit with my personality\n\nbecause I was very like honest with myself.\n\nLike to be in this industry, you got to have thick skin.\n\nI don't think I do.\n\nSo like, I was like really real with myself.\n\nWhat's the most like toxic\n\nor intimidating element of the fandom?\n\nWell, you know, when I was writing Your Idol,\n\nit was inspired by that.\n\nI saw the dark side of it,\n\nand part of that was the intensity of the fandom.\n\nOne of the times I had that experience\n\nwhen I was a K-pop trainee was like,\n\nat that time, there was a boy band called TVXQ.\n\nThey were huge at that time.\n\nAnd I still remember\n\nthere's like a third floor dance practice room\n\nand a first floor, and we had to walk up.\n\nAnd to walk up, it's like up, up,\n\nand right here, it was like this glass door.\n\nIt's just glass.\n\nThe fans were all over that door,\n\nand they would try to open it,\n\nand once they had like little bit of like a crack open,\n\nand whenever the female trainees go up,\n\nthey would throw trash and call us names,\n\nreally bad names.\n\nAnd mind you, we're like 11, 12, maybe old like 14.\n\nAnd I just remember that so clearly\n\nand feeling so scared.\n\nThey threw trash at us.\n\nSo that was like a really dark moment that I experienced.\n\nSM definitely protected us from this.\n\nOnce that happened, they blocked everything out.\n\nBut that was like an intense fan scene I've seen.\n\nWhat do you think that was about?\n\nLike why call you guys names and throw trash\n\nif they're, you know, fans of the genre?\n\nIt's like tricky when you're idolizing someone so much.\n\nIt can get intense, and it gets very dark fast, and toxic.\n\nSo I think the obsession can be very,\n\nit can make you very blind to your intense emotions.\n\nAnd a lot of the fans are like teenagers,\n\nand I feel like when you're a teenager,\n\nyou're going through puberty,\n\nyou feel lots of intense emotions.\n\nWhat is your relationship to ambition right now?\n\nMm!\n\nWhat a cool question.\n\nOoh.\n\nToxic. I'm kidding.\n\n[Manisha chuckles]\n\nSame.\n\nIt can be, right?\n\nI swear.\n\nThat's like Golden.\n\nGolden is a bittersweet song.\n\nIn that moment with Rumi and the character,\n\nshe's like really focused on the Honmoon\n\nand getting that achievement\n\nthat she kind of ignores her flaws. You know what I mean?\n\nYeah. And even in the movie\n\nyou see her saying like,\n\nNo one more hiding, while she's hiding.\n\nAnd that's a really important part of the message,\n\na part of that song.\n\nSo like, as much as it's great to strive\n\nand be ambitious and go,\n\nalways do it in a healthy way.\n\nAlways keep talking to yourself while you're doing it,\n\ndon't ignore your health, don't ignore your mental health.\n\nBe real with yourself while you're being ambitious.\n\nIt's a great balance, I think, is important.\n\nSo, my relationship with ambition is healthy, I think.\n\nWhen you were on SNL, like were you nervous to sing?\n\nI'm always nervous to sing.\n\nI'm nervous in the studio to sing.\n\nSo, the fact that I'm performing it is a huge jump for me.\n\nMy comfort zone and usually where I feel the best singing\n\nis my own little corner in my house in Brooklyn.\n\nBut yeah, that was a huge jump, I was so nervous.\n\nWhat do you see being like next for K-pop?\n\nI think K-pop was kind of going\n\nthrough this like pop direction.\n\nI think it kind of lost its K-pop beauty,\n\nand what I find it is, is like,\n\nK-pop has a very unique approach to genres,\n\nand they love to mix things up.\n\nJust like how Korean people and food,\n\nthey like to mix things up.\n\nLike bibimbap is just a mixture of all these things.\n\nAnd I love that about Korea,\n\nand I think you see that a lot in the movie with K-pop.\n\nYou see different genres mixed,\n\ndifferent melodies come up randomly.\n\nRhythmically, it's always changing.\n\nSuddenly the bridge is a different song, you know?\n\nAnd that's the beauty of it.\n\nSo I think maybe that will come back more,\n\nand I want it to come back more.\n\nEmbracing that side,\n\nhaving a lot of Korean in it as well.\n\nI think that may be very curious.\n\nWell, thank you so much,\n\nthis was totally fascinating.\n\nAnd congratulations.\n\nThank you. I appreciate you.\n\n[camera clicking]\n\n[casual music]\n\n[upbeat electronic music]",
  "authors": [
    "Condé Nast"
  ],
  "url": "https://www.wired.com/video/watch/big-interview-the-big-interview-ejae"
}