{
  "title": "Cop30 climate summit in Brazil disrupted after fire breaks out in venue",
  "text": "Talks at the Cop30 climate summit in Brazil were disrupted on Thursday after a fire broke out in the venue, triggering an evacuation just as negotiators were preparing to try to land a deal to strengthen international efforts to address the climate crisis.\n\nThirteen people were treated for smoke inhalation, organisers said in a statement, after the fire broke out in the pavilion area of the conference centre in Belém, Brazil.\n\nThe cause of the fire, which was brought under control within minutes, was being investigated but was believed to be an electrical device, probably a microwave, Reuters reported, citing the local fire department.\n\n“Earlier today, a fire broke out in the blue zone of the Cop30 venue in Belém,” the UN organiser’s statement said.\n\n“The fire department and UN security officers responded swiftly, and the fire was controlled in approximately six minutes. People were evacuated safely.\n\n“Thirteen individuals were treated on site for smoke inhalation. Their condition is being monitored, and appropriate medical support has been provided.”\n\nAntónio Guterres, the UN secretary general, had appealed earlier in the day for a deal from the summit, welcoming calls from some for clarity on the hotly disputed subject of weaning the world off fossil fuels.\n\nThe entire venue had to be cleared from shortly after 2pm local time (5pm UK time). The Guardian was told it was likely to be several hours before any delegates were allowed to return.\n\nThe incident threw a carefully choreographed series of meetings into confusion. The Cop30 presidency was preparing a new draft text of the “mutirão” decision, a central plan of the hoped for outcome of Cop30, and one that until Thursday contained a potential commitment to draw up a roadmap to transition away from fossil fuels.\n\nThe presidency was holding a series of crunch meetings with the main negotiating groups.\n\nskip past newsletter promotion Sign up to Down to Earth Free weekly newsletter The planet's most important stories. Get all the week's environment news - the good, the bad and the essential Enter your email address Sign up Privacy Notice: Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on theguardian.com to send you this newsletter. You can complete full registration at any time. For more information about how we use your data see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nThe Alliance of Small Island States had been due to meet the presidency shortly before 4pm, but that was cancelled.\n\nThe EU was due to hold a ministerial coordination meeting at 6pm before meeting the presidency at 9pm, but that timetable was thrown into doubt.\n\nThe severity of the disruption at this stage of the talks is likely to make it impossible to stick to the timetable, and may push the talks, which are scheduled to finish on Friday evening, well into overtime.",
  "authors": [],
  "url": "https://www.theguardian.com/environment/2025/nov/20/cop30-climate-summit-in-brazil-disrupted-after-fire-breaks-out-in-venue"
}