{
  "title": "The art of the possible: the Nottingham art gallery being run by citizens’ assembly",
  "text": "“I used to see this place on the street but I didn’t know what was here, I didn’t even know it was an art gallery,” says Felix, a 20-year-old nursing student. “And now I’m here shaping its future.”\n\nFelix is one of 40 residents of Hyson Green in Nottingham who run the show at New Art Exchange (NAE), which believes it is the first cultural institution in the world to hand permanent leadership to a citizens’ assembly.\n\nThese people, representative of a diverse community that speaks 52 languages, decide everything from what events the gallery should put on, to where money should be spent and what artists should be exhibited. They have allocated £285,000 in funding since starting out.\n\nView image in fullscreen Assembly member Rudy, 70, a volunteer support worker, making a point at a progress report meeting. Photograph: Fabio De Paola/The Guardian\n\n“Without citizens and community around the table shaping the direction and showing the horizon, we would quickly become an average organisation,” says Saad Eddine Said, chief executive and artistic director at NAE, which is the UK’s largest gallery dedicated to African, Caribbean and south Asian artists.\n\n“This neighbourhood is such a huge treasure of culture and of talent so we wanted it to play a key role, not just in terms of consultancy, but in real terms of coleadership.”\n\nA street gallery outside the building, designed to entice people in, was removed after assembly members said it was intimidating and off-putting, and more money was invested in making the cafe a welcoming space that would bring people through the door instead.\n\nAfter reporting that a major problem in the area was a lack of places to socialise on a Friday evening, NAE started hosting socials, such as poetry and DJ events, which draw large crowds.\n\n“We believe in [the assembly] and we don’t want it to become just a trendy thing, just ticking boxes,” says Said. “Removing the street gallery felt counterintuitive to us. But straight away that street gallery was in the bin, and in the bin for ever.\n\nView image in fullscreen The cafe area at the New Art Exchange. The citizens’ assembly made the cafe a welcoming space that would bring people through the door. Photograph: Fabio De Paola/The Guardian\n\n“It didn’t matter whether we understood it. There is no compromise in that conversation.”\n\nAdam Roe, the gallery’s executive director, says: “I’ve been asked: ‘Do you think that you’ve lost power as a result of this?’\n\n“Actually, I think I’ve gained power. Collectively, we’ve got so much more knowledge because we’re doing the things we know we need to do.\n\n“And some of the artists and the performers we work with now we probably would never have known about before.”\n\nCitizens’ assemblies have long been used in local democracy and public policy to gauge national opinion, but in recent years they have spread into other sectors – and cultural institutions are the latest to try using them.\n\nIn August, the National Gallery announced it was creating a citizens’ assembly of 50 people from across the UK who will make recommendations that will be built on by a smaller citizens’ panel over the next five years.\n\nBirmingham Museum & Art Gallery recruited a citizens’ jury in 2024 which published several recommendations, including later opening times and promoting the work of young people.\n\nskip past newsletter promotion Sign up to Art Weekly Free weekly newsletter Your weekly art world round-up, sketching out all the biggest stories, scandals and exhibitions Enter your email address Sign up Privacy Notice: Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on theguardian.com to send you this newsletter. You can complete full registration at any time. For more information about how we use your data see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nBut there is some scepticism about the effectiveness of these initiatives and over whether senior leadership teams consider them as anything more than a public engagement exercise.\n\nView image in fullscreen Visitors interacting with an exhibition by Heather Agyepong in the mezzanine gallery at the New Art Exchange. Photograph: Fabio De Paola/The Guardian\n\n“Lots of people were very sceptical and wondering whether anything would come of this,” says assembly member Lily, a 21-year-old fine art graduate, sitting alongside Rudy, a 70-year-old retired youth worker. “I’m impressed they’ve actually done the things we said.”\n\nMany of the assembly members said they were tired of seeing Hyson Green, which has some of the highest deprivation rates in the country, receive attention for all the wrong reasons – crime, antisocial behaviour and fly-tipping.\n\n“I’ve lived out here a long time, and I was sceptical, and I was cynical, because I’ve seen so many initiatives come and go,” says Kathy*, a retired resident.\n\n“This area has been ignored and if people experience the negative for too long, it can disempower them. So for me, it has been a real boost. I feel invigorated by being part of this process.”\n\nSaid says the assembly was “hugely expensive and time consuming” to set up, but has had a drastically positive impact – overall engagement at NAE is up 22% and the number of visitors from global ethnic majority backgrounds has grown by 48%.\n\nHe has now developed a blueprint for other organisations to implement citizens’ assemblies in a similar way.\n\n“It has helped us navigate one of the most challenging times for the cultural and art industry in a very long time – just look at how many organisations are closing down,” he says. “Our citizens make us relevant.”\n\n* Not her real name",
  "authors": [
    "Jessica Murray"
  ],
  "url": "https://www.theguardian.com/artanddesign/2025/nov/04/new-art-exchange-nottingham-community-run-art-gallery"
}