{
  "title": "This is how we do it: ‘I do get jealous and question whether I’m cut out for non-monogamy’",
  "text": "Maya, 29\n\nIf I know that Ollie’s on a date, I find it difficult sitting around, not knowing what to do with myself\n\nI knew I liked Ollie immediately. He was the perfect mix of male and female. I asked him what his hobbies are, and he said dressing up as a woman and masturbating furiously. I got the impression he was just looking for sex, but so was I. If either of us had thought the other was looking for something serious, we’d have run a mile.\n\nThat Ollie is more experienced in ethical non-monogamy (ENM) made me feel insecure at first. I felt embarrassed about being new at it. I knew that for Ollie it was a non-negotiable, and worried, what if I decide I can’t do it? There’s a part of me that hasn’t fully worked out if I can do this for ever. What if I wake up one day and want him to be mine? With monogamy, you know what the rules are, but with ENM, there are lots of conversations to be had. We’ve agreed to be open and honest, to use protection, and that if I see him out with someone else, I wouldn’t want them to be intimate in front of me.\n\nI thought that if I took penetration off the table, it would be a big issue. But sex with Ollie is pleasure-driven\n\nI don’t believe monogamy works long-term. With my ex, I had trust issues, and he ended up cheating on me. The hiding is the problem, and ENM removes that. There’s no reason not to trust Ollie. But that doesn’t mean I don’t get jealous, and I question whether that jealousy means I’m not cut out for non-monogamy. If I know that Ollie’s on a date, I find it difficult sitting around not knowing what to do with myself. I visualise him having sex with someone else. But then I tell myself that’s learned behaviour, and I need to unlearn it.\n\nSex with Ollie doesn’t compare with the sex I’ve had before. In previous relationships, I didn’t enjoy penetrative sex and found it painful. I thought that if I took penetration off the table it would be a big issue. But sex with Ollie is pleasure-driven, and he makes me feel confident enough to take on a more dominant role, which I find terrifying and exciting. The times I’ve been dominant are the sexiest I’ve ever felt. But I’d struggle if it weren’t for Ollie being so submissive, gender-fluid and in tune with his desires.\n\nShare your experience If you’re keen to talk to us about your sex lives you can get in touch by filling in the form below. It is very important that both sexual partners are happy to participate. Please share your story if you are 18 or over, anonymously if you wish. For more information please see our terms of service and privacy policy Tell us here Your responses, which can be anonymous, are secure as the form is encrypted and only the Guardian has access to your contributions. We will only use the data you provide us for the purpose of the feature and we will delete any personal data when we no longer require it for this purpose. For alternative ways to get in touch securely please see our tips guide First name of partner one First name of partner two Length of relationship Contact number or email address of partner one Please include your country's area code if outside of the UK. Contact number or email address of partner two Please include your country's area code if outside of the UK. Do both parties agree to being contacted by a journalist from the Guardian? Yes By submitting your response, you are agreeing to share your details with us for this feature. Submit Show more\n\nOllie, 35\n\nI don’t feel jealous about sexual acts, but I’d struggle if she developed deeper feelings for someone else\n\nWhen I met Maya, I wasn’t looking for anything serious. I’d been in an abusive relationship that ended a year before, and felt damaged, so although I’d been dating I didn’t want to be attached. Establishing intimacy with someone else was difficult at first, but as we got to know each other, and she showed me unrelenting kindness, I began to feel safe with Maya.\n\nI don’t believe one person can meet all of another’s needs or wants. But while I’d been in open relationships before, Maya hadn’t, and in the early days she’d get jealous. She would struggle when I saw female-presenting people, but was less bothered when it came to men. We’ve got better at navigating jealousy, which starts with just acknowledging that it exists. I don’t feel jealous about sexual acts and am happy for Maya to tell me anything about the people she sees, but I’d struggle if she developed deeper feelings for someone else.\n\nskip past newsletter promotion Sign up to Inside Saturday Free weekly newsletter The only way to get a look behind the scenes of the Saturday magazine. Sign up to get the inside story from our top writers as well as all the must-read articles and columns, delivered to your inbox every weekend. Enter your email address Sign up Privacy Notice: Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on theguardian.com to send you this newsletter. You can complete full registration at any time. For more information about how we use your data see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nWhen she takes on a more dominant role, it encourages me to bring cross-dressing into sex\n\nMy first impression of Maya was that she seemed cool, fun and easygoing. I found her round face and long curly red hair very attractive, and I liked the way she dressed, her interesting job and outlook on life. We have similar desires, morals and ideas for the future.\n\nMaya doesn’t enjoy being penetrated, and I don’t get much pleasure from it either, so we’ve had to learn interesting alternatives. She likes it when I barely touch her, which leads to deep moments where Maya’s the one in control. When she takes on a more dominant role, it encourages me to bring cross-dressing into sex; when I’m being feminine, I feel like Maya sees all sides of me, and it gives her more confidence to be dominant.\n\nMy understanding of intimacy has grown and developed since being with Maya. She allows me to be vulnerable and fully myself, and supports and accepts me in a way I’ve never experienced before.",
  "authors": [
    "Olivia Ladanyi"
  ],
  "url": "https://www.theguardian.com/lifeandstyle/2025/nov/16/this-is-how-we-do-it-i-do-get-jealous-and-question-whether-im-cut-out-for-non-monogamy"
}