{
  "title": "Remembering some of the trans lives lost to violence and suicide in the past year",
  "text": "EDITOR’S NOTE: This story involves discussion about violence and suicide that some readers may find upsetting. If you feel you are in crisis, call or text 988 to reach the 24-hour Suicide Crisis Lifeline.\n\nOn a cool November night in 1999, dozens of transgender people and their friends stood thousands of miles apart in Boston and San Francisco. They lit slender candles and spoke into the surrounding darkness the names of trans people whose lives had abruptly – and violently – ended.\n\nThat somber night, born out of trans activists’ anger and frustration after two Black trans women were killed in Massachusetts, is now considered the first Transgender Day of Remembrance.\n\nOn November 20, communities across the globe will meet to read aloud the names of trans people who died by violence over the last year. For transgender Americans, this year’s memorials will take on particular poignance, as the Trump administration and conservative lawmakers have taken great strides to restrict how they can live publicly and privately, while also eliminating federal data collection about anti-trans hate crimes and ending funding for an LGBTQ suicide hotline.\n\nSince last November, at least 27 trans and nonbinary people have been killed, according to the nonprofit Advocates for Trans Equality. The number is likely an undercount as precise data is difficult to collect, the organization notes. Some research has shown trans people are more than four times more likely than cisgender people to be victims of violent crime.\n\n“In many ways, in our society, trans people are made to feel invisible,” said Bahari Thomas, the advocacy group’s director of public education.\n\nTrans people, particularly trans youth, are also at heightened risk of suicidal thoughts and attempts, according to the Trevor Project. The organization notes this may be the result of a lack of social support and exposure to stigma and discrimination.\n\nGwendolyn Smith – one of the activists who founded Transgender Day of Remembrance – said it’s both heartening to see her community uphold what she started decades later and sobering to see them continue to experience high rates of violence.\n\nIt’s crucial, she said, to remember the “very vibrant lives” trans victims led. “That’s our humanity.”\n\nCNN has profiled eight trans people who died this year, focusing on the fullness of their lives rather than the tragic circumstances of their deaths. These are their stories.\n\nTahiry Broom, who stood ‘ten toes down’ for her values\n\nTahiry Broom is remembered for her outgoing nature with a love for performing, fashion, dancing and music. Illustration by Leah Abucayan/CNN/courtesy of Patricia Bender\n\nTahiry Broom could show up anywhere – from a seat at a church service to a night club’s pulsing dance floor – armed with her long, painted nails, shimmery eyeshadow and colorful wigs. Then, like magic, the whole place would belong to her.\n\nAnd Patricia Bender would most likely be there, too, watching proudly.\n\nBender is Tahiry Broom’s aunt, but the two grew up more like siblings. With only five years between them, Bender and Broom spent their days in Cleveland, practically inseparable.\n\n“When you see me, you saw her,” Bender said.\n\nBender said she loved Broom’s fearlessness. Broom taught her to “walk into the room like you own it, every time.”\n\nBroom was outspoken, always standing “ten toes down” for anyone or anything she believed in, ever since she was a kid. She was a social butterfly who “could make fun out of nothing.”\n\nPatricia Bender pictured with a custom airbrushed jacket of Tahiry Broom in Cleveland, Ohio, on Feb 21, 2025. Courtesy Patricia Bender\n\nBender, who is a member of the LGBTQ community, said Broom leaned on her for support before coming into her own as a transgender woman.\n\n“I’m like, ‘Hey, you can’t worry yourself worrying about what the next person is going to feel like or what the next person is going to think, because at the end of the day, you’re killing yourself trying to make everybody else happy,’” Bender said.\n\nShe also helped Broom become more acquainted with those in Cleveland’s LGBTQ community. Bender already knew “everything and everybody” and getting to know new people “was a big thing” for Broom.\n\nShe was outgoing. She loved everybody, and they loved her back.\n\nGoing one to two weeks without hearing from her wasn’t cause for concern. She was independent and tended to mind her own business.\n\nBut in February, Bender’s phone began to ring and ring and ring. She hesitated to answer, sensing there may be bad news on the other end of the line.\n\n“Sometimes your phone rings and it rings different,” Bender said.\n\nWhen she finally answered her cousins’ FaceTime call and saw their rosy and tear-stained faces, she said she felt numb.\n\nBroom – visiting snowy Southfield, Michigan, at the time – had been shot and killed, less than a month before her 30th birthday.\n\n“My little brother, my nephews, my male cousins, I worry about them. They’ll be outside doing only God knows what,” Bender said. “Tahiry? Nobody worries about Tahiry.”\n\nA suspect in Broom’s death has been charged with second-degree murder and remains in custody, awaiting a trial date, according to Southfield police.\n\nHearing of an arrest in Broom’s case was a “calming feeling” for Bender, but getting her justice would involve the suspect being “in a cell for the rest of his life,” she said. She and her family members keep up with the case by regularly attending the suspect’s Zoom hearings.\n\nResearchers and advocacy groups say Black trans women, like Broom, are disproportionately impacted by violence. Of the 372 trans victims identified by Human Rights Watch between 2013 and 2024, 73% were women of color, and 60% were Black women.\n\nBender is still Broom’s “ying and yang.” Her “frick and frack.”\n\nHer niece might have thought introducing her to the local LGBTQ scene, being older or being her “auntie” made Bender Broom’s “savior.” But Broom, Bender said, saved her too.\n\n“I may be helping you in a sense or exposing you to this…and I’m helping you live your truth,” she added. “And the whole time, you think you need me. But the whole time, I needed you more.”\n\nFrom CNN’s Sydney Bishop\n\nKarmin Wells, a Detroit ballroom legend whose walk rivaled Naomi Campbell\n\nKarmin Wells found peace in small ways such as through morning devotionals to God. Illustration by Leah Abucayan/CNN/courtesy of LonDyn Hudson/Marcel Goudeaux-Stanley/Markeitha Bibb\n\nShe was the “walking wonder” of Detroit’s queer ballroom scene – a nightlife runway legend whose hip-twisting strut is rumored to have put Naomi Campbell to shame. She wouldn’t hit the runway in anything less than six-inch heels, and the jangle of jewelry and sharp clack of her heels announced her presence almost everywhere she went.\n\nShe was Karmin Wells – nothing more and nothing less.\n\n“Her style can’t be mimicked ever again,” said her aunt, Markeitha Bibb. “When she came in, they knew what it is. They knew she was (going to) take the stage.”\n\nThe 37-year-old was a staple of the local ballroom community, a historic queer subculture where performers compete in categories that include modeling, dancing and “voguing.” Often, performers compete as members of a “house,” a chosen family that can provide a support system that biological families sometimes cannot.\n\nWells had worked the stage for years, eventually earning the status of “legend” and becoming the mother of the Detroit chapter of the internationally-renowned House of Revlon.\n\nMonica Hudson met Wells when she was still a teenager. Hudson had been doing LGBTQ community outreach at the city’s Palmer Park when she came across Wells and was instantly charmed by her witty sense of humor.\n\n“Our interaction was so real and so raw and authentic. She ended up becoming my chosen daughter,” Hudson said. When Wells was killed on May 25, Hudson said it felt like “losing a part of myself.”\n\nWells was shot to death in her home just days before her 38th birthday. Police say the suspect has not been identified or charged.\n\n“The world lost a talented, funny, loving, caring, hardworking hustler. The world has lost a gem,” said Hudson.\n\nShe cared deeply for her grandfather, Willie Bibb, and her younger sister, Kimari Howard, her aunt said. And she had formed her own sprawling family of chosen children – younger people she mentored and uplifted, Hudson said.\n\nKarmin Wells poses with her grandfather, Willie Bibb. She called him “Daddy” because he raised her like a father. Courtesy Markeitha Bibb\n\n“Whatever you gave her, she gave it back to you 10 times,” said Marcel Goudeaux-Stanley, Wells’ close friend and former significant other. “You could never outdo her. She had a really, really big heart.”\n\nNever staying in one place for long, Wells’ suitcase seemed to always be packed. She would leave Michigan at a moment’s notice, traveling to Las Vegas to hit the casinos or to Atlanta to compete in balls, Bibb said. Then, she would show up on her aunt’s doorstep, insisting they go out to Gigi’s or the Woodward, popular LGBTQ bars in Detroit.\n\n“She’s always on the go. She’s always hustling,” Hudson said.\n\nBut Wells found peace in small ways: through morning devotionals to God, performing alone in the privacy of her living room, and finding the company of those who knew who she was when the aura of entertainment wore off, Hudson said.\n\n“When she’s around people that she loves, that genuinely love her, and when she can be comfortable and she can rest, that’s where she’s genuinely happy,” Hudson said.\n\nFrom CNN’s Elizabeth Wolfe\n\nLia Smith, a curious student athlete and formidable board game opponent\n\nLia Smith was working towards degrees in statistics and computer science at Middlebury College. Illustration by Leah Abucayan/CNN/courtesy of G. Smith\n\nFor her parents, Lia Smith’s birth was a dream come true – albeit a little nerve-racking.\n\nBorn early at just over 31 weeks and under 4 pounds, Smith arrived just minutes before her twin (a fact she would later point out with pride to her “baby” sister). Her father, Greg Smith, camped out in the NICU for weeks until he and his husband, Keith, were able to take the babies home to meet their other child.\n\n“We were just thrilled beyond belief,” Greg Smith said.\n\nSmith grew into a healthy child and young adult who was deeply empathetic, “intrinsically curious and very hardworking,” her father said.\n\nShe filled her days learning piano and trombone, going to swim practice, poring over books on world history, and playing board games and cards with her family. Exceptional with numbers and problem-solving, she eventually learned how to count cards and maximize her odds of winning.\n\n“Over time, I learned to only play games of pure chance with her if I wanted to win,” Smith said at his daughter’s memorial service earlier this month. “Simply put, she was smarter than me.”\n\nDiving became a “core part of her existence,” he said. At age 8, Smith began training with Stanford’s youth swim program, and by the time she left home for college, her bedroom walls were decorated with hundreds of competition ribbons.\n\nThough she was recruited by several colleges to compete on their men’s teams, she was delighted to be invited to compete on the women’s team at Middlebury College in Vermont, her father said.\n\nIt would be the first time she would compete on a team that aligned with her identity. After her first year at Middlebury, Smith stopped competing in diving but continued to practice with the team.\n\n“She was really more focused on being one of the girls,” Smith said. “It was very affirming, and mostly she just wanted to hang out with them and practice.”\n\nA week before Lia Smith died, her father, Greg, visited her at college. Courtesy G. Smith\n\nThis year, Smith returned to Middlebury as a senior, working towards degrees in statistics and computer science. The 21-year-old was somehow able to find time to pursue other interests as well.\n\n“She loved to debate the history of Japan or think about the intricacies of China. She had a keen and eclectic interest, and it made it always fun and interesting to talk to her.”\n\nThough she loved to spend time with family and friends, she was at her core an introvert. In her cherished private moments, she would read, sit down at the piano, or write poetry, which she rarely shared.\n\nBut while Lia was deeply loved, her father Greg said at her memorial that she “lived on a daily basis with the quiet whispers of judgment and the furrowed brows of contempt.”\n\nLast month, Lia was reported missing. After a days-long search, her body was found near the college campus. She had died by suicide.\n\nLia did not leave a note explaining why she killed herself, but her father noted that she had felt the brunt of cultural backlash against transgender people, a feeling he said was only exacerbated by online harassment and a parade of restrictions on transgender people under the Trump administration.\n\n“Over time, I believe the relentless negativity exhausted her,” he said.\n\nHundreds of people attended memorial services at Middlebury and at Smith’s high school, her father said. He was stricken by the “infinite love” shared at the services and the outpouring of support he has received from strangers online.\n\n“She was perfect for us in every way,” he said. “We cherished her, and others did, too.”\n\nFrom CNN’s Elizabeth Wolfe\n\nAmyri Dior, a mother figure with a musical soul\n\nAmyri Dior was passionate about singing, rapping and dancing. Illustration by Leah Abucayan/CNN/courtesy of Alejandra Rederford\n\nEven though Amyri Dior didn’t have children, she was like a mother to all. She guided and cared for her loved ones in Milwaukee, Wisconsin, deeply. And when it came to her family and friends’ children, she didn’t play around — she looked after them like her own.\n\n“My child, her friend’s children, she would claim them as her kids,” Alejandra Rederford, Dior’s cousin and best friend, said. “Always giving. She will give her last, even if it’s her last … Amyri was a good, caring, genuine soul.”\n\nDior also “didn’t discriminate” when it came to music and had a passion for singing, rapping and dancing. Rederford said sometimes she would sing while Dior rapped on the spot. Through giggles, she also recalled a memory of Dior dancing in a parking lot once to the sound of a car alarm.\n\n“She would try to hype the people around her to dance,” Rederford said.\n\nDior would write her own songs, her grandmother, Carrie Joyner, remembered.\n\n“She sang her own music from her own voice. She loved singing with such character,” Joyner said.\n\nDior would also take the time to have deep conversations with Rederford and others about her experience as a trans woman. She was confident in her identity, even if some people didn’t accept her.\n\nRederford and Joyner also highlighted Dior’s immense strength, living in foster care as a child for eight years before ultimately running away to her grandma’s house.\n\nDior and Rederford were only a year apart, and mid-February was always a special time, with their birthdays on February 15 on February 21, respectively.\n\nOn Dior’s 23rd birthday this year, they celebrated with a house party full of food and drinks. Dior sang along to songs she loved while laughing with her friends and family.\n\nJust seven days later, the two were supposed to be celebrating Rederford’s birthday together. While Rederford was still getting dressed, she answered a phone call, thinking it was Dior ready to be picked up for the night of festivities. Instead, the voice on the other line was her aunt, telling her Dior had been shot.\n\nA man has been charged with first-degree intentional homicide in Dior’s death, according to a criminal complaint from the Milwaukee District Attorney’s office obtained by CNN.\n\n“She was a shining soul,” Rederford said. “She was really loved. Everywhere she (went), she was loved.”\n\nFrom CNN’s Taylor Galgano\n\nKelsey Elem, who was chasing her dream of modeling\n\nKelsey Elem loved fashion. Illustration by Leah Abucayan/CNN/courtesy of Elem family\n\nKelsey Elem’s smile could light up a room the moment she walked in, her mother, Calvenita Brock, said. She said Kelsey moved through the world with love, the kind you could feel just being around her.\n\n“Kelsey would give a person any and everything,” Brock said.\n\nBorn in Greenville, Illinois, and raised in East St. Louis, with her mother and two brothers, Elem ran track, sang in the church choir and loved animals. Later, she joined Job Corps and received her nursing certificate, her mother said.\n\nElem loved fashion. She was always dressed to impress, known for her bold style and her signature long nails. Brock said the two were very close, and Elem often turned to her for styling advice.\n\n“She’ll come by the house like, ‘Ma, I need to go in your closet, and I’m on my way, get me something out. I need something to wear today.’”\n\nBrock said she spoke to Elem daily, up until the morning of her death on April 24. She was 25 years old when she was fatally shot. The suspect, whom Brock has identified as one of Elem’s friends, was arrested and charged with second-degree murder, third-degree domestic assault and armed criminal action.\n\nThe day before her death, Elem posted on Facebook about how proud she was of her transition journey and how happy she was with life.\n\n“She fought to be the woman and the queen that she were,” Brock said. Elem strove to show other trans people “that they didn’t have to have shame, they didn’t have to feel unloved, because, you know, some people’s … loved ones don’t accept them, and Kelsey was there to let them know, because I accepted my child.”\n\nAt the time of her death, she was traveling around the US as a model, building a dream she had long imagined.\n\n“She been traveling all around and so she kept telling me, ‘Mom, you got to come on,’” Brock said. “So she told me, ‘Well, I’m (going to) make sure I do all this for you, Ma, you wanted to do all this, and you stopped for us.’”\n\nShe was laid to rest on May 9 in a red, pink, white and green casket adorned with photos of her and the words “goodbyes are not forever.”\n\nFrom CNN’s Amanda Jackson\n\nSam Nordquist, who dreamed of buying a log cabin filled with animals\n\nSam Nordquist would often buy extra food to hand out to the homeless. Illustration by Leah Abucayan/CNN/courtesy of Kayla Nordquist\n\nA man so kind he would give you the shirt off his back.\n\nThat’s how Linda Nordquist describes her son Sam. His kindness permeated every part of his life, from the patient demeanor he assumed at his job caring for vulnerable adults to the loving care he showed his pet cats and lizards, or the way he showered his young nieces and nephews with affection. On drives around Minneapolis, Nordquist would often buy extra food to hand out to the homeless, his sister, Kayla Nordquist, said.\n\nNordquist’s confidence blossomed after he transitioned, his sister said, buoyed by a close-knit and deeply supportive family. His mother helped administer his testosterone shots and carefully emptied his surgical drains after he got top surgery. Although transgender identity was new to her, “Sam is still Sam to me, and I loved Sam no matter what,” his mother said.\n\nHe was close with his family, often jetting off for road trips with his sister and her children or binging true crime shows together. He lived with his mother, and they built a familiar routine: sharing a cigarette before work, walking the dog together, and making plans for the weekend.\n\nLast September, their routine ended when Nordquist traveled to upstate New York to meet a woman he had met online. Nordquist was tortured to death in early February, according to New York State Police. Seven people have been indicted on murder charges for their involvement. He was 24. Authorities have said there is no evidence of a hate crime but said Nordquist was treated “like a dog” before his death: beaten, assaulted, sexually abused, starved, and held captive for weeks.\n\n“My heart is shattered,” his sister said. Kayla Nordquist said she still wakes up every day wanting to text her brother. For his mother, “life will never be the same. Life will never be normal as we used to know it.”\n\nNordquist had big aspirations, his family said: He dreamed of buying a log cabin, filled with animals. His mother wishes most of all she could have seen Nordquist find “actual true love.” It stings, she said, that she’ll never see her son get married or have children.\n\nIn Minnesota, Nordquist’s family is dedicated to keeping his memory alive as they brace for their first holiday season without him. His sister had a portrait of him tattooed on her arm, and both his sister and mother got tattoos of “8,995,” the number of days Nordquist was alive. For Christmas, his mother is decorating the tree with ornaments adorned with her son’s name.\n\nKayla's tattoo of her brother, Sam. Courtesy Kayla Nordquist\n\nHis mother has taken responsibility for his cat, who sometimes wakes her up scratching at the door of Nordquist’s room, which she’s left untouched since he was killed. His sister, meanwhile, took in his bearded dragon – and she’s found herself caring for the lizard just as lovingly as Nordquist did, decorating its tank for Halloween and Christmas.\n\nNordquist “was the most gentle, kindest, sweetest person that you’ll probably ever meet,” his mother said. “And the world should know that they’re all missing out on him.”\n\nFrom CNN’s Zoe Sottile\n\nLaura Schueler, the ‘Beyonce of Cincinnati’ with an eye for consignment shopping\n\nLaura Schueler cared deeply about her family, including her nieces and nephews. Illustration by Leah Abucayan/CNN/courtesy of De’Whitney Hankins\n\nLaura Schueler was the friend you could call for anything.\n\nDe’Whitney Hankins said she would text Schueler for help with outfit choices because she trusted her fashion instincts. Schueler, a transgender woman, was known for wearing trendy furs, jackets, shoes and purses often purchased from consignment shops, Hankins said. Her edgy style prompted some in their circle of friends to call Schueler the “Beyonce of Cincinnati,” Hankins said.\n\n“She was very much outgoing,” said Hankins, a transgender woman who befriended Schueler in the 1990s when they were living in the same neighborhood.\n\nBut the light Schueler brought to others— along with her fun, selfless and caring spirit— darkened when she was shot and killed on June 7 in Cincinnati, Hankins said. Schueler was 47. A 19-year-old man was arrested on July 11 in connection with her death and charged with murder, felonious assault, among other charges, court records show.\n\nHankins said Schueler was confident and secure with herself, which inspired many others in the transgender community. She cared deeply about her family, including her nieces and nephews, Hankins said.\n\n“She was not a taker,” Hankins said. “She was more of a giver. If you were hungry, she would give you money or take you to get something to eat. And she would give you the clothes off her back.”\n\nHankins said she believes Schueler was targeted because she was a transgender woman and her death was a hate crime.\n\n“She had a lot of love to give, and we still had stuff to do,” Hankins said. “My heart is empty.”\n\nFrom CNN’s Nicquel Terry Ellis\n\nDream Johnson, whose animated personality was made for reality TV\n\nDream Johnson was the life of the party, her mother said. Illustration by Leah Abucayan/CNN/courtesy of Iris Terrell\n\nWhen she began her transition three years ago, Iris Terrell’s daughter chose a new name for herself, one that her mother said fit her perfectly: Dream.\n\n“Dream wanted to be a superstar one day,” said Terrell.\n\nJohnson thought her big, confident personality would be perfect for a reality show and wanted to be on TV, Terrell said.\n\n“She had a beautiful soul and would always, always keep you laughing,” her mother said. “She was the life of the party.”\n\nJohnson’s aunt, Vanna Terrell, said her niece’s desire to be in the spotlight even extended to their holiday gatherings.\n\n“We would say we’re going to color coordinate, and Dream would go outside the box and wear something totally different,” Vanna laughs. “We would have a family function, and she would dress like Diana Ross.”\n\nJohnson’s mother and aunt say the family supported her transition and credit Dream’s closest friends for helping her find her own new style.\n\n“They were pushing her to come out of her shell – to be whoever she wanted to be,” Vanna Terrell said.\n\n“I know for a fact that her friends are definitely going through the hardest time now because they stayed together,” she adds.\n\nJohnson’s life was cut short in July at the age of 28 when she was shot four times on a sidewalk in her hometown of Washington, DC, in a residential neighborhood about two miles from the US Capitol.\n\nAccording to a court document, witnesses say Dream got into an argument with a group of strangers mocking her and calling her “a boy” and a slur used to attack the LGBTQ community.\n\nAlthough surveillance footage showed Johnson never physically attacked anyone, according to police, a member of the group allegedly pulled out a handgun and shot her to death. She was unarmed, prosecutors say.\n\nThe suspect is charged with first-degree murder, and the case is classified as a gender identity hate crime.\n\nAlthough the allegation that Dream was targeted for being transgender is painful to her family, they also feel it is important that the reality of the crime be recognized.\n\n“We were pushing for that. We wanted the hate crime (charge),” Vanna said. “We needed the world to know that this is still out here.”\n\nThat kind of hate was something Johnson never had to worry about at home.\n\n“I told her she was kind. She was beautiful,” said Johnson’s mother. “Can’t no one change you from being you, and don’t let no one change you.”\n\nIris Terrell keeps Johnson’s positive spirit even through the sadness surrounding her death, but said the holidays will be hard this year.\n\nBut despite her family’s tragedy, Iris Terrell only has happy memories of her daughter and the person she became.\n\n“It was one thing that I loved about her – that she was herself.”\n\nFrom CNN’s Andy Rose\n\nCorrection: An earlier headline on this story incorrectly described one of the victims. It has been updated.",
  "authors": [
    "Zoe Sottile",
    "Elizabeth Wolfe",
    "Andy Rose",
    "Amanda Jackson",
    "Sydney Bishop",
    "Taylor Galgano",
    "Nicquel Terry Ellis"
  ],
  "url": "https://www.cnn.com/2025/11/20/us/transgender-day-remembrance-victims"
}