{
  "title": "Kevin Spacey says he doesn’t have a home",
  "text": "Oscar-winning actor Kevin Spacey has said he’s got “no home,” citing the costs he’s incurred following allegations of sexual assault.\n\nSpeaking to UK newspaper The Daily Telegraph in an interview published Wednesday, Spacey revealed that the financial fallout of the allegations, which came to light in 2017, resulted in him losing his house.\n\nIn 2022, a New York jury found Spacey not liable for battery over allegations he picked up actor Anthony Rapp and laid on top of him after a party in 1986. And in 2023, Spacey was cleared of a number of sexual assault charges by a court in London, United Kingdom, in a separate case.\n\n“The costs over these last seven years have been astronomical. I’ve had very little coming in and everything going out,” he said.\n\n“Everything is in storage, and I hope at some point, if things continue to improve, that I’ll be able to decide where I want to settle down again,” added Spacey.\n\n“I’m living in hotels, I’m living in Airbnbs, I’m going where the work is. I literally have no home, that’s what I’m attempting to explain,” he said, adding that his financial situation was “not great.”\n\nSpacey, 66, built a hugely successful career after starting out as a stage actor in the 1980s. He went on to win the Academy Award for Best Supporting Actor for “The Usual Suspects” (1995) and the Academy Award for Best Actor for “American Beauty” (1999).\n\nHe was artistic director at London’s Old Vic theater between 2004 and 2015, and played Frank Underwood in Netflix political drama “House of Cards.”\n\nHowever, in 2017, actor Rapp said Spacey had made a sexual advance toward him in 1986, when Rapp was then 14 and Spacey was 26.\n\nAs other allegations of abuse followed, Netflix cut ties with Spacey on the series “House of Cards” and his scenes in the Ridley Scott movie “All the Money in the World” were re-shot by the late Christopher Plummer.\n\nSpacey denied any allegations of improper or criminal behavior and a New York jury found him not liable for battery against Rapp in October 2022.\n\nHe was also found not guilty of seven counts of sexual assault and two counts of other serious sexual offenses at a court in London in July 2023.\n\nDespite these legal victories, Spacey is yet to be welcomed back into the Hollywood fold.\n\n“We are in touch with some extremely powerful people who want to put me back to work,” he told The Daily Telegraph, which has previously published statements of support for Spacey from Hollywood peers such as Sharon Stone and Liam Neeson.\n\n“And that will happen in its right time. But I will also say what I think the industry seems to be waiting for is to be given permission – by someone who is in some position of enormous respect and authority.”",
  "authors": [
    "Jack Guy"
  ],
  "url": "https://www.cnn.com/2025/11/20/entertainment/kevin-spacey-home-scli-intl"
}