{
  "title": "How to turn hazelnuts into a brilliant flour for cakes – recipe",
  "text": "Each recipe in my cookbook Eating for Pleasure, People & Planet includes optional whole food ingredients such as rapadura sugar, emmer wheat and flaxseeds to boost nutrients and flavour, while also keeping things adaptable so you can use up what you already have in the cupboards. Writing a plant-based cookbook taught me new ways to save waste, and confirmed my belief that zero-waste cooking is whole food cooking. Aquafaba (the liquid from a tin of chickpeas or other beans), for example, is a powerful emulsifier that can replace eggs, especially when whisked with ground flaxseeds or chia. It’s a brilliant way of turning what we’d usually pour down the sink into cakes with remarkable lift and texture.\n\nPear, hazelnut and chocolate torte\n\nWhen I was writing the dessert chapter of my cookbook, I wanted every recipe to offer new ways of making cakes more nourishing. Here, I use aquafaba with omega-rich flaxseed, and blitz hazelnuts into flour instead of using ground almonds (though I would encourage you to use ground almonds if they are what you have).\n\nSeasonality is core to how I cook, not least because I find it such a joyous and economical approach to home cooking that connects us to the rhythm of the seasons. With pears fresh, plentiful and easy to source locally right now, they’re perfect inspiration for this vegan chocolate torte that’s gooey, flavourful and not too sweet. Cook it a little under, so it has a brownie-like centre and, for best results, serve warm with your favourite yoghurt. You will need a 23cm stoneware flan dish or similar.\n\nServes About 10\n\n250g shelled hazelnuts\n\n100g light-brown sugar, plus extra for dusting and finishing\n\n75g wholemeal flour (I used emmer wheat, but regular wholemeal or plain white will work fine, too)\n\n2 tbsp cocoa powder, plus extra for dusting\n\n2 tsp baking powder\n\n100ml extra-virgin olive oil, plus extra for greasing\n\n100ml aquafaba\n\n50g ground flaxseeds, or chia seeds, or 2 tsp psyllium husk\n\n4 pears, cored and cut into thin slices\n\nYoghurt (coconut, soya or dairy), to serve (optional)\n\nHeat the oven to 200C (180C fan)/390F/gas 6 and put a large baking tray inside to heat up. Tip the hazelnuts on to the hot tray, roast for eight minutes, then remove and leave to cool. Pulse-blend the cooled nuts to a powder, stopping the motor before the ground nuts turn oily, then tip into a large bowl and add the sugar, flour, cocoa powder, baking powder, olive oil, aquafaba and flaxseeds, and beat to combine thoroughly.\n\nGrease a 23cm flan dish with a little olive oil, then spoon in a teaspoon each of flour and cocoa. Turn the dish a few times, so the insides are evenly coated, then knock out any excess flour and sugar. Fill the dish with the hazelnut mixture, then lay the pear slices on top. Bake for 40 minutes, or until the pudding has risen and is firm in the centre.\n\nSprinkle the top of the finished tart with a little brown sugar, or make your own brown sugar icing sugar by blending it to a fine powder. Enjoy warm with your choice of yoghurt.\n\n\n\n\n\n",
  "authors": [
    "Tom Hunt"
  ],
  "url": "https://www.theguardian.com/food/2025/nov/19/turn-hazelnuts-into-flour-substitute-cakes-pear-torte-recipe-zero-waste-cooking"
}