{
  "title": "Chadwick Boseman honored with posthumous star on Hollywood Walk of Fame: ‘He was an incredible leader’",
  "text": "Friends, family and fans gathered Thursday to honor the late Chadwick Boseman receiving a star on the Hollywood Walk of Fame in Los Angeles.\n\nThursday was declared “Chadwick Boseman Day” in Hollywood, and his “Ma Rainey’s Black Bottom” costar Viola Davis, his “Black Panther” director Ryan Coogler and Boseman’s widow Taylor Simone Ledward Boseman spoke during the emotional ceremony.\n\n“I have to believe that Chadwick is still alive,” Davis said. “I can’t use the word ‘gone’ or ‘death’ really when thinking about him.”\n\nThe “Black Panther” actor died in 2020 at the age of 43 after a private battle with colon cancer.\n\nDavis noted that they worked on their Oscar-winning movie “Ma Rainey’s Black Bottom” just before he passed, and said Boseman “was always trying to engage me on the set” talking about the “cap of success” and having the types of conversations that she believes people have when they know they “possibly are transitioning.”\n\nViola Davis speaks onstage as actor Chadwick Boseman is honored with a posthumous star on the Hollywood Walk of Fame on Thursday. Matt Winkelmeyer/Getty Images\n\nThe late actor, she said in her tribute, was a “mighty mighty elixir that sort of stirred up the alchemy that we’re all in search of, which is meaning.”\n\n“I celebrate him today. And I say to him, I hope all the angels in heaven just sang him to a beautiful rest,” Davis said. “And I thank him for what he left behind in me, which is a burning ember that always guides me to a higher meaning of my work and my purpose.”\n\n“This star, as beautiful as it is on the Walk of Fame, shines a whole lot less brighter than Chadwick is in heaven,” she concluded her speech.\n\nCoogler, Boseman’s friend who directed him in the “Black Panther” Marvel film, asked for attendees’ understanding as he emotionally talked about the late star.\n\n“When I think of Chadwick Boseman I think of three things: leadership, teaching and generosity,” Coogler said. “He was an incredible leader.”\n\nThe famed “Sinners” director said Boseman was “ageless,” and joked he didn’t know his age until he went to one of his birthday parties. He also told a story about Boseman sneaking past stars like Sylvestor Stallone, Michael B. Jordan (who was present at Thursday’s ceremony) and others to get into Coogler’s hotel room during a big press tour for the 2015 film “Creed.”\n\nBoseman, Coogler said, wanted to meet with him to talk about working together on “Black Panther” and managed to evade even the press that were were present.\n\n“I was so impressed by that and I asked him how he got past everybody and he smiled and said, ‘That was the Panther,’” Coogler said, chuckling.\n\nBoseman’s wife was the last to take the podium, and had a heartfelt message for her late husband.\n\n“Chad, today we recognize a lifetime of artistry. We recognize your skill and your devotion and we cement your legacy as a hero and icon,” she said. “You lived with honor and you walked in truth. You were as brilliant as you were beautiful and as courageous as you were kind. We love you, we miss you and we thank you.”\n\nShe then invited her husband’s brothers, Derrick and Kevin Boseman, to help with the unveiling of the star.\n\nIn addition to portraying T’Challa in “Black Panther” and other Marvel movies as well as his Academy Award-nominated turn in Netflix’s “Ma Rainey’s Black Bottom,” Boseman had a robust film and television career, and portrayed Thurgood Marshall, James Brown and Jackie Robinson on film before his untimely passing.",
  "authors": [
    "Lisa Respers France"
  ],
  "url": "https://www.cnn.com/2025/11/20/entertainment/chadwick-boseman-hollywood-walk-of-fame"
}