{
  "title": "Victoria para Meta: un juez dictaminó que el gigante de las redes sociales no es un monopolio ilegal",
  "text": "CNN —\n\nMeta obtuvo una gran victoria este martes después de que un juez federal dictaminara que la empresa no es un monopolio de redes sociales, desestimando un argumento de la Comisión Federal de Comercio de EE.UU. que buscaba obligar a la compañía a desprenderse de dos de sus plataformas más populares.\n\nLa Comisión Federal de Comercio (FTC, por sus siglas en inglés) demandó a Meta en 2020, acusándola de violar la ley antimonopolio al adquirir a posibles rivales emergentes como Instagram y WhatsApp para evitar tener que competir con ellos. El juicio, que duró siete semanas, incluyó testimonios de varias figuras destacadas, como el del director ejecutivo de Meta, Mark Zuckerberg, quien argumentó que la empresa enfrenta mucha competencia de plataformas como YouTube y TikTok.\n\nEl juez federal James Boasberg estuvo de acuerdo con el argumento de la empresa en su opinión del martes, diciendo que TikTok y YouTube impiden que Meta monopolice el mercado de redes sociales. También señaló que las aplicaciones de Meta y el panorama de las redes sociales han cambiado desde que la FTC presentó el caso, más recientemente debido al contenido generado por inteligencia artificial, lo que debilitó los argumentos de la agencia.\n\n“Meta no posee un monopolio relevante en el mercado”, escribió.\n\nJoe Simonson, director de Asuntos Públicos de la FTC, dijo en un comunicado que la agencia está revisando sus opciones tras la decisión.\n\n“Estamos profundamente decepcionados con esta decisión”, dijo Simonson. “La baraja siempre estuvo en nuestra contra con el juez Boasberg, quien actualmente enfrenta artículos de juicio político. Estamos revisando todas nuestras opciones”.\n\nUna ruptura forzada habría sido una gran pérdida para Meta, que depende en gran medida de Instagram para los ingresos publicitarios y de WhatsApp para las suscripciones empresariales y su prominencia internacional. Aunque Meta cuenta con 3.300 millones de usuarios diarios en todas sus plataformas, el testimonio de Zuckerberg durante el juicio de siete semanas indicó que la aplicación con la que fundó la empresa, Facebook, está perdiendo popularidad.\n\n“La decisión de la Corte de hoy reconoce que Meta enfrenta una competencia feroz”, dijo la directora jurídica de Meta, Jennifer Newstead, en un comunicado proporcionado por la portavoz Nkechi Nneji. “Nuestros productos son beneficiosos para las personas y las empresas, y ejemplifican la innovación estadounidense y el crecimiento económico. Esperamos continuar colaborando con el Gobierno e invirtiendo en Estados Unidos”.\n\nEl fallo también representa una victoria para Silicon Valley, ya que los reguladores estadounidenses buscan cada vez más frenar el poder de las grandes tecnológicas. Recientemente, se dictaminó que Google es un monopolio en dos casos separados relacionados con sus negocios de búsqueda y publicidad en línea. Apple y Amazon también están luchando contra casos antimonopolio presentados por el Gobierno.\n\nMeta, entonces conocida como Facebook, adquirió Instagram en 2012 por US$ 1.000 millones y WhatsApp en 2014 por US$ 19.000 millones.\n\nDurante el juicio, los abogados de la FTC señalaron correos electrónicos y documentos internos que, según dijeron, mostraban que Zuckerberg estaba preocupado por la competencia de Instagram y WhatsApp antes de las adquisiciones. Afirmaron que la gran base de usuarios de Meta reflejaba la falta de “alternativas razonables” para los consumidores en el ámbito de las redes sociales.\n\nMeta argumentó que los reguladores aprobaron las adquisiciones hace años cuando se realizaron, y que una ruptura forzada podría perjudicar la competitividad estadounidense en el sector tecnológico.\n\nEl fallo de Boasberg sostiene que las aplicaciones de Meta solo tienen una “participación modesta” del tiempo total dedicado en el mercado de redes sociales —que incluye Facebook, Instagram, Snapchat, MeWe, TikTok y YouTube— y que su participación está disminuyendo. Añadió que “incluso si YouTube se excluye (del mercado relevante), Meta aún no tendría un monopolio”. (La opinión de Boasberg omite la cuota de mercado específica que considera que tiene Meta).\n\n“TikTok —que Meta considera su competidor más feroz— irrumpió en el mercado hace solo siete años… y ha estado dominando el mercado desde entonces”, escribió Boasberg.",
  "authors": [
    "Clare Duffy"
  ],
  "url": "https://cnnespanol.cnn.com/2025/11/18/economia/meta-no-es-monopolio-dice-juez-trax"
}