{
  "title": "'An unmistakable stab at the USSR': Could Amadeus be the most misunderstood Oscar winner ever?",
  "text": "Released 40 years ago this month, Miloš Forman's best picture-winning Amadeus is often accused of historical inaccuracies – but the film's critics could be missing the point.\n\nWhen it premiered 40 years ago, Amadeus drew an initial wave of praise. A historical drama revolving around the rivalry between two composers, Wolfgang Amadeus Mozart and Antonio Salieri, it went on to win eight Oscars, including for best picture. Miloš Forman took home the best director prize, Peter Shaffer won for best adapted screenplay and both of the lead actors were nominated: F Murray Abraham, who played Salieri, beat Tom Hulce, who played Mozart.\n\nBut in the years that followed, a backlash grew over what some people saw as Amadeus's litany of historical errors. An article in The Guardian declared that \"the fart jokes can't conceal how laughably wrong this is\", and the BBC commented that \"the film plays shamelessly fast and loose with historical fact\". Salieri, critics noted, was no pious bachelor (as attested by his wife, eight children and mistress), and it's after all an odd kind of hateful rivalry when the real Mozart entrusted the musical education of his own son to Salieri. As for Mozart's lewd humor, that cheeky insouciance was actually commonplace in middle-class Viennese society. Most egregiously of all, world-famous Mozart was not dumped in an unmarked pauper's grave. If this is a homage to history, the complaint goes, it's akin to Emperor Joseph II fumbling ineptly on the pianoforte and bungling every other note.\n\nBut this kind of cavilling may be missing the point. Forman's aim for Amadeus can be seen as radically different from a typical biopic, and that was to use a fictionalised version of an epic clash between musical composers to allegorise the defining global rivalry of the mid-to-late 20th Century: the Cold War. Put simply, the film may have played fast and loose with 1784 because its real preoccupation was 1984.",
  "authors": [],
  "url": "https://www.bbc.com/culture/article/20240926-could-amadeus-be-the-most-misunderstood-oscar-winner-ever"
}