{
  "title": "Fluoride in drinking water does not negatively affect cognitive ability — and may actually provide benefit, study finds",
  "text": "The longstanding public health practice of adding fluoride to community drinking water is facing heavy scrutiny in the United States over questions about whether the benefits outweigh the potential risks. But new research challenges recent claims about the risks of fluoride in drinking water — and instead suggests that it may have additional positive effects.\n\nThe heightened federal debate was spurred by a recent government study from the National Toxicology Program that concluded that high levels of fluoride exposure are linked to lower IQ in children, but that study evaluated fluoride exposures that were at least twice the federally recommended limits with notably “insufficient data” to determine the effects of lower levels.\n\nThe new study looked at more typical, recommended levels of fluoride in drinking water and instead found “robust evidence” that young people exposed to fluoride at these lower levels actually performed better on ​cognitive tests than their peers who did not have fluoride in their drinking water.\n\nDr. Rob Warren, lead author of the study published in the journal Science Advances on Wednesday, said he was “shocked” by the findings from the National Toxicology Program study and motivated to provide research that was more relevant to public policy decisions.\n\n“I wouldn’t have done this work had it not been an empirical question that I didn’t think we had an answer to, of great immediate policy interest,” he said.\n\nUS Department of Health and Human Services Secretary Robert F. Kennedy Jr. has called fluoride “an industrial waste” and cited “IQ loss” in pledges to roll back federal recommendations that fluoride be added to municipal drinking water. Utah and Florida have become the first two states to ban the practice.\n\n“Imagine testing some new drug for heart disease and the recommended dosage is 100 milligrams, and then your study compares people who get a million milligrams to people who get half a million milligrams. Well, that doesn’t tell you anything about the effect of getting 100 milligrams versus getting nothing,” Warren said. “That’s kind of the world we’re in with fluoride research. It’s important to know that if you get a toxic dose, really bad things happen to your body, but that’s not relevant for the public policy discussion.”\n\nWarren, a sociology professor at the University of Minnesota, leads a program that started in the US Department of Education and has followed a cohort of tens of thousands of people for more than four decades since their high school years in the 1980s.\n\nFor the new study, he and other researchers used this data to overlay performance on mathematics, reading and vocabulary tests for a nationally representative sample of nearly 27,000 people with their exposure to fluoride in community drinking water based on historical data from HHS and the US Geological Survey.\n\nThe analysis assumed that individuals lived near their high school for their whole childhood and grouped them based on whether they would have been consistently exposed to recommended fluoride levels through community water fluoridation or natural occurrence of the mineral, consistently lacking exposure to fluoride, or partly exposed if their community changed their local fluoridation policy at some point during their childhood.\n\nStudents who were exposed to fluoride for part of their childhood had higher test scores in high school than those who had no exposure to fluoride, and the difference was even greater for those who were exposed to fluoride for their whole childhood, the study found. Follow-up tests continued through 2021, when most participants had reached 60 years of age, and suggested that fluoride exposure also did not contribute to cognitive decline as participants aged.\n\nCognitive tests are not direct measures of IQ. There is a strong correlation, Warren says, but cognitive tests measure a mix of how well someone’s brain works along with the opportunities they’ve had to learn the material. He’s working on additional research that will directly assess the link between fluoride and IQ, with more precise measurements data about where the individuals lived during childhood, too.\n\nOther research from this year estimated that removing fluoride from public water in the US would lead to 25.4 million excess decayed teeth in children and adolescents within five years, along with $9.8 billion in health care costs. The new study did not measure individual dental health, but experts say that pain from tooth decay can cause children to have trouble focusing in school or miss it completely — which could be a factor affecting cognitive test scores.\n\nFluoride is a mineral that can be found naturally in some foods and groundwater. It can help prevent tooth decay by strengthening the protective outer layer of enamel that can be worn away by acids formed by bacteria, plaque and sugars in the mouth. The practice of adding fluoride to public water systems started in the United States in 1945 to help improve oral health in a cost-effective and equitable way.\n\nThe American Dental Association and many experts have continued to support the practice of community water fluoridation, and the US Centers for Disease Control and Prevention has not changed its recommendations. The agency cannot mandate that communities add fluoride to their water, but it considers 0.7 milligrams of fluoride per liter of water to be the “optimal level.”\n\nBut the US Food and Drug Administration recently took action to restrict the use of prescription fluoride supplements. “There are better ways to protect children’s teeth than taking unapproved ingestible fluoride, which is now recognized to alter the gut microbiome,” FDA Commissioner Dr. Marty Makary said in a news release about the action.\n\nDr. Bruce Lanphear, an epidemiologist and professor at Simon Fraser University in Canada, said it’s important to capture a more complete set of all sources of fluoride exposures, such as toothpaste and pesticides.\n\n“Population strategies – like fluoridation, like vaccination, like taking lead out of gasoline – they can be extraordinarily powerful. If you’ve got a safe and effective intervention, you can have a big impact on the health of populations,” he said. “But when you have a population strategy like fluoridation, the evidence about its safety and about its effectiveness has to be extraordinarily strong.”\n\nBut in a formal response to the new research that was also published in Science Advances on Wednesday, Dr. David Savitz, an epidemiologist with the Brown University School of Public Health, argues that the greater burden lies on proving the risk before ending a public health practice that has been successful for decades.\n\n“Until clear evidence exists that water fluoridation lacks public health benefit or compelling evidence of harm at the level of fluoride exposure in fluoridated water, neither of which has occurred, it seems foolhardy to interfere with a long-established and well-recognized public health success,” he wrote.\n\n“With due credit to the folk wisdom of Bert Lance, director of the Office of Management and Budget under President Jimmy Carter, ‘If it ain’t broke, don’t fix it.’ Warren and colleagues move the needle a bit further into the ‘ain’t broke’ range.”",
  "authors": [
    "Deidre Mcphillips"
  ],
  "url": "https://www.cnn.com/2025/11/19/health/fluoride-drinking-water-cognition-positive-link"
}