{
  "title": "Trump opens parts of Florida, California waters up to offshore oil drilling, breaking decades of precedent",
  "text": "The Trump administration is proposing to open federal waters off the entire coastline of California to drilling, as well as an area off the coast of Florida. Neither state’s waters have been open to new drilling for decades.\n\nPresident Donald Trump’s Interior Department released a five-year offshore drilling plan on Thursday that would open up vast parts of California’s coastline to drilling, which hasn’t happened in that state since the late 1960s. The Department is also proposing new oil drilling in parts of the Eastern Gulf — located approximately 100 nautical miles off Florida’s coast — a decision opposed by Florida’s Republican leadership.\n\nThe Trump administration’s proposal would open the Eastern Gulf to federal oil drilling auctions starting in 2029. It would open auctions for drilling in central and southern California in 2027 and northern California in 2029.\n\nThe oil industry has been advocating for opening up parts of the Eastern Gulf that are adjacent to areas where oil production has been happening for decades in the Central Gulf, an industry source told CNN.\n\nThe proposal is sure to be met with resistance in California. The state’s coast has not seen drilling since a devastating oil spill in 1969, which drew national attention for destroying coastal wildlife and the state’s fishing industry.\n\nCalifornia Gov. Gavin Newsom called the plan “idiotic” in a statement and vowed the state “will use every tool at our disposal to protect our coastline.”\n\n“It’s interesting that Donald’s proposal doesn’t include the waters off Mar-a-Lago,” Newsom said in his statement.\n\nDuring Trump’s first term, Florida’s congressional delegation — including Republicans — repeatedly pushed back against attempts to open the eastern Gulf of Mexico to drilling. The first Trump administration extended the offshore drilling ban for the Eastern Gulf, rather than opening it up.\n\nThis new Gulf action has also rankled many Florida Republicans, where memories of the 2010 Deepwater Horizon spill still shape public opinion. Molly Best, a spokeswoman for Florida Gov. Ron DeSantis, said the governor’s office still supports the ban on drilling in the area from Trump’s first term.\n\nThe DeSantis administration “urges the Department of Interior to reconsider,” Best said in a statement.\n\nAnd a letter from several Florida Republican congressmen to the president urged the administration to withdraw the Eastern Gulf parcels, saying oil exploration there was “incompatible with military operations and recreational uses.” Among the signees is Rep. Byron Donalds, the Trump-endorsed candidate for governor in 2026.\n\nLeading up to the release of Thursday’s five-year plan, Republican Sen. Rick Scott of Florida said he believed he had assurances from Interior Secretary Doug Burgum that any new drilling in the Gulf would not threaten Florida economically, environmentally or militarily, a source with knowledge of their conversation told CNN. A source close to several Republicans in Florida’s delegation told CNN officials believe the proposal honors those assurances, though congressional staff were still studying the details.\n\nNational Ocean Industries Association president Erik Milito called the inclusion of the Eastern Gulf a “forward-looking approach” and American Petroleum Institute president Mike Sommers hailed it as a “historic step.”\n\nThe move is part of President Donald Trump’s agenda to open up more parts of the country to drilling for fossil fuels — the oft-repeated campaign promise of “drill, baby, drill.”\n\nTrump’s plan also proposes holding lease sales in the western and central Gulf of Mexico, where the vast majority of offshore drilling currently takes place. It also proposes auctioning off federal waters along almost all of Alaska’s coastline at the end of the decade and into the early 2030s.\n\nIn response to the Trump administration’s new plan, California leaders vowed to push back on the federal government’s move to open waters up to drilling, including possible legal action.\n\n“Time and again, President Trump has shown that his interest lies with his Big Oil friends profiting at the expense of our environment and public health,” said Christine Lee, a spokesperson for California attorney general Rob Bonta. “We won’t stand for this and are exploring our legal options.”\n\nSen. Alex Padilla and Rep. Jared Huffman, both California Democrats, said in a joint statement that Trump’s plan “targets California and the whole West Coast because they think we will roll over.”\n\n“They are wrong,” Padilla and Huffman said. “We’re going to fight this with everything we have.”\n\nGiven Trump’s tariffs, it’s not currently boom time for oil drilling, experts told CNN. Companies instead are trying to curb their spending and hold onto their earnings, said Tom Seng, a professor of energy finance at Texas Christian University.\n\n“Right now, the industry doesn’t have a lot going on,” Seng told CNN. “We certainly have a pro-fossil fuel administration. They’re going to streamline things for us, but the marketplace will always dictate activity.”\n\nHowever, Seng said, some oil exploration companies will likely want to “take advantage of the lease offerings,” with an eye towards the long-term future.\n\n“The question is, when will they deploy the capital to actually drill on the leases?” he said. “There won’t be a rush to do so. $60 oil won’t help.”\n\nEnvironmental groups said the plan would pose a threat to marine life and oceanside communities around the country.\n\n“This draft plan is an oil spill nightmare,” said Oceana campaign director Joseph Gordon. “The last thing America needs now is a massive expansion of offshore drilling that could shut down our shores with catastrophic oil spills.”\n\nThe latest move follows other steps the Trump administration has taken in recent days and weeks to expand oil drilling around the country. The Interior Department this week announced it was rolling back a Biden-era rule that had banned fossil fuel drilling on nearly half of the National Petroleum Reserve in Alaska, over 13 million acres.\n\nAnd environmental groups sounded the alarm as oil company ConocoPhillips proposed more oil drilling exploration in Alaska, including drilling four new exploratory wells in the NPRA. The company is currently developing the massive Willow project in NPRA where it expects to start producing oil by 2029. Willow was approved by former President Joe Biden in a move that roiled the Democratic president’s base.\n\n“The public deserves the right to have a say on what happens on these critically important public lands in the Western Arctic,” Earthjustice attorney Ian Dooley said in a recent statement. “Seismic and drilling activities can cause impacts on this sensitive ecosystem that lasts decades.”",
  "authors": [
    "Ella Nilsen",
    "Steve Contorno"
  ],
  "url": "https://www.cnn.com/2025/11/20/climate/trump-oil-drilling-offshore-california-florida"
}