{
  "title": "I Had My Fallopian Tubes Removed To End My Marriage. My Then-Husband's Reaction Shocked Me.",
  "text": ". Courtesy of Carly Rae Brunault\n\nIn the summer of 2020, while the virus raged and my marriage folded in and collapsed in slow motion upon itself, I decided that I would become infertile.\n\nMy husband sat next to me in the waiting room before I was wheeled away, surprisingly good-natured about it all, even taking a selfie of us for posterity.\n\nAdvertisement\n\nI was relieved. He was my high school sweetheart and a fervent Catholic who had insisted I convert before we were married right out of college. He had been vocally against me using any form of birth control for years, but I didn’t question his sudden ambivalence.\n\nMy first gynecologist, also a Catholic, was recommended to me by my mother-in-law, who worked at the same hospital. Like my husband, he also rebuked my desire to prevent pregnancy. One year into my marriage, I asked him for an IUD. The next, an implant. After each request, he demurred: “You’re healthy, and doing so well with natural family planning,” he said in rebuffing me, referring to the method I’d been using to prevent pregnancy.\n\nIt was a complicated process riddled with uncertainty. Each morning, I took my temperature and charted it next to my other observations; a sharp uptick in temperature meant I was nearing my follicular phase, and the risk of pregnancy was high. To verify that evidence, I would use my fingers to explore the texture, position, and fluids emanating from my cervix, to predict whether ovulation was imminent enough for my husband and I to need to abstain from sex. This divination worked for about two years — and then I missed a period.\n\nAdvertisement\n\nIn 2018, I miscarried in our bathroom. The cramps roared through me in a way they never had before, and I passed thick, brown blood and membranous tissue into the toilet.\n\n“It’s just a period, though, right?” My husband had asked — almost begged. “If you’re miscarrying, then we need to collect it and bury the baby. I’ll call the priest.”\n\n“Don’t, don’t,” I wept, hunched over my knees, naked, sweating, shivering. It was so early that I hadn’t even gotten a definitively positive pregnancy test yet; I knew I was pregnant only from my own intuition, and then, the agony. When it was finished, I flushed away the last of it and sat on the tiled bathroom floor, slick-skinned and floating. I relished the feeling of the cool tile, and I was relieved. Both because it was over, and because I wasn’t pregnant.\n\nAdvertisement\n\nI don’t want to be a mother, I realized, hovering pleasantly against the ceiling, above and apart.\n\nIt was the first original idea I’d had for myself.\n\nI left the Catholic gynecologist and ordered birth control online.\n\nI left the Church. My husband — after consulting with our priest to see if an annulment was possible — begrudgingly stayed at my side and cast long, hangdog glances my way when he went to Sunday Mass alone.\n\nI don’t want to be a mother, I repeated to myself, as our marriage hung by a slim thread of obligation instead of desire. When Covid reached us, and we were locked into our home together, working remotely at opposite ends of our little two-bedroom cottage in Baton Rouge, I had a new thought: I don’t want to be a mother to his children.\n\nThe implication — that I may want to be a mother to someone else’s children — was lost to the roiling uncertainty between us. Trapped, trapped, trapped, my racing mind thought — as I heard him type, and as he shirked lockdown procedures to attend weekly Mass, no matter how much I begged him not to go. His choice wasn’t one of animosity towards me; he was obligated to perform Catholicism in ways I didn’t yet understand. Still, I waited for our fever to set in.\n\nAdvertisement\n\nThe birth control, which made me depressed and foggy, no longer felt like enough protection. I took pregnancy tests every month. My breath hitched every time I flipped them over to see the results.\n\nI couldn’t leave him — that felt impossible in ways I couldn’t explain — but I couldn’t be a mother, either.\n\nBetween those two impossibilities, I saw a thin sliver of choice. I found a new gynecologist and, when Covid restrictions cooled enough to allow non-emergency visits, I sat on her exam table and requested that she remove my fallopian tubes, a procedure called a bilateral salpingectomy.\n\nAdvertisement\n\nI had pronounced the name of it in front of the mirror that morning, slowly and decisively, practicing, readying myself. The surgery meant that my tubes would be removed, not tied. It was irreversible, which meant that if I ever reneged on the decision, in-vitro fertilization would be my only option to become pregnant.\n\nI was 26, and didn’t have children. Most gynecologists wouldn’t even consider a permanent sterilization procedure for someone like me. I was prepared to defend myself as I never had before.\n\n“Sure,” she said, her eyes understanding and non-judgmental over her mask. “When would you like to get on the calendar?”\n\nAdvertisement\n\nI froze in shock, and then, I collapsed. I’d expected to have to fight for it, I told her when she handed me a box of tissues. I’d been fighting for so long to feel in control of my own body.\n\nThere were only a few more skirmishes between me and that sharp relief of self-imposed infertility. First, I had to tell my husband. Braced for pushback, I told him that I had been approved for the surgery, and I was going to do it. I didn’t leave room for argument, though that was unnecessary.\n\nAfter staring at me for a long moment, with a detached, unreadable expression on his face, he shrugged and said, “Seems like you’ve already made your choice.” There was no fight left in him.\n\nAdvertisement\n\nFloating on my high of newfound independence — the outside validation that I deserved to take control of my reproductive choices — I didn’t question his distance, or what it meant for the future of our marriage. For the first time in my life, I truly believed that I was considering only my desires… so I no longer cared.\n\nWith that hurdle crossed, there was a flurry of pre-op appointments and bloodwork. There was one more appointment with my new doctor during which she read a list of questions meant to provoke second thoughts, if I had any. I steeled myself against them and passed.\n\nOfficially cleared for surgery, I endured an early Covid test that involved swabs being inserted so forcefully into my nostrils, it felt as though they were pressed up against the backs of my eye sockets.\n\nAdvertisement\n\nAnd then, on May 7, 2020, I was wheeled into the OR. About an hour later, they wheeled me back out, freshly barren and groggy.\n\nI hadn’t eaten anything since midnight the previous night, but when I woke, I couldn’t stop dry-heaving. A nurse jabbed something into my thigh to end the nausea. I shook, insurmountably cold, and my husband stared at me from the corner of the room. I’d never reacted to anesthesia that way — my whole body rebuking the invasion, trembling and uncontrollable and somehow apart from me. I floated over my body, disassociating from it as it quaked, and I stayed there.\n\nThree months later, my Catholic husband sat me down at our dining room table and explained that he had been gay, and closeted, his entire life. He had come to understand the truth that I’d been ignoring for years: He needed to be alone so that he could become endeared to himself.\n\nAdvertisement\n\nIt was the beginning of a long walk for both of us — a parallel path that spiraled inward, then unfolded. Years later, my ex realized that she was trans and I realized the degree to which I had also ignored my own knowing.\n\nBut first, there was a reckoning. When the word “divorce” split the air between us, I rested a hand on my abdomen, over the three raw little scars from the procedure, and crashed back into my body.\n\nRegret pooled into my belly, and stayed there. I cried on a second date when I told my next boyfriend about the surgery, and wept even harder when he told me it didn’t matter to him — that he just wanted me.\n\nAdvertisement\n\nWe would go out to dinner, and a screaming infant and its cooing mother would give me a singular moment of relief. Imagine, I thought. Imagine if you had one of those. You wouldn’t be free.\n\nI decided to exercise that freedom, and in 2022, I sold my home and most of my belongings, quit my job in Baton Rouge, left my boyfriend, and walked the entire length of the Appalachian Trail. Somewhere in the Smoky Mountains, I realized that if the baby I’d miscarried had lived, I would have a three year old. I could see him toddling before me on the trail, dark-haired and beautiful, before disappearing into the mist. I followed him north for 2,200 miles.\n\nThe author completing her 2022 thru-hike of the Appalachian Trail, at the summit of Mt. Katahdin, Maine. Courtesy of Mary Leavines\n\nAdvertisement\n\nWith each step, I understood that sterilization had been my ultimate act of self-betrayal, and he would always be just out of reach.\n\nI knew then — with the kind of clarity only hindsight gives you — that it had been my choice. I had other choices: I could have left, I could have doubled up on birth control, and, if it came to it, I could’ve had an abortion. I didn’t have to gnaw off my own foot to escape the vise of my failing marriage. The trap had been open all along. I could have walked away.\n\nI also understood, as Roe v. Wade was overturned — news I learned on a wavering bar of cell signal as I hiked into Harper’s Ferry, West Virginia — that maybe the surgery, even with my regrets, was also for the best. I was fully aware of my immense privilege: to have been able to access the procedure, and then to have lived to regret it. My choices hadn’t been limited then. But they were being limited now.\n\nAdvertisement\n\nAfter completing the trail, newly single and armed with that steady, aching knowing, I moved to Asheville, North Carolina. There, I reconnected with Ben, a hiker I’d met in passing on the trail. On May 10, 2024, four years and three days after my surgery, I looked into his eyes, and vowed to walk with him always.\n\nA Polaroid taken of the author at the Appalachian Trail Conservancy headquarters, in Harper’s Ferry, West Virginia. Courtesy of Mary Leavines\n\nIn my second marriage, I was no longer fulfilling a role — the Catholic wife, the future mother, the dutiful, Vatican-loyal voter that bowed towards tradition and away from my own knowing. I wasn’t required to be anything more — or rather, less — than what I was.\n\nAdvertisement\n\nIn that cocoon of safety and acceptance — knowing that either way I had a partner in life, and even if I didn’t, I was whole — I asked, “Do you want to try?” He did.\n\nI found in-vitro fertilization providers. I dug out of the most hidden parts of my heart the names that would belong to our children: Levi and Caroline, matched to his Thomas and Elizabeth. My home state, Louisiana, placed tighter restrictions on abortion and IVF. We both hoped for a boy, but I secretly imagined a little girl with Ben’s soft, brown eyes.\n\nAlabama passed a bill in February 2024 that made IVF providers hesitant, fearful, and unable to proceed. A friend of mine became pregnant, and I lingered next to a rack of onesies, considering buying two: one for her, one for me. There were several state lines between me and the slow creep of those restrictions, I reasoned, as I flicked through the impossibly tiny clothes. I still had choices available to me, despite the choice I had made in 2020. The vise had not snapped shut on them yet.\n\nAdvertisement\n\nThen, the 2024 presidential election roared into the forefront of our lives. Sweeping restrictions on abortion, and on D&C procedures following miscarriage, claimed the life of a woman in Texas. She died of sepsis a few days after her baby’s heart stopped beating.\n\nDriving home one day, I imagined the joy of my parents meeting their first grandchild for the first time, and it brought me to tears. But what if I miscarried again, and died with my dead baby inside me like that woman from Texas, and never got to see their joy?\n\nBen and I weighed our whittled-down options as the teeth of the trap began to scrape our skin. Was the possibility of a child worth my life? It wasn’t.\n\nAdvertisement\n\nI voted early, and I hoped.\n\n“If it’s Trump, don’t wake me up,” I told Ben before we went to bed on election night. He always roused in the wee hours for a slow shuffle to the kitchen for water, so he would know first. “If it’s Kamala, wake me up so we can celebrate. But if it’s him…” Levi-Thomas-Caroline-Elizabeth. “If it’s him, just let me rest.”\n\nWhen I woke the next morning, the sun was just beginning to approach the horizon. Soft blue light filled the room.\n\nI waited — to slam back into my own body, to be forced to face it fully — but I was already present, and I already knew.\n\nAdvertisement\n\nMary Leavines is a writer, photographer, and long-distance hiker currently working on her memoir, “Newfound.” Her book explores themes of religious deconstruction, the unexpected alchemy of grief, and the liberation of radical vulnerability, all framed by her 2022 thru-hike of the Appalachian Trail. You can find her essays, trail journals, email newsletter, and more information about her upcoming memoir at maryleavines.com.\n\nThis essay ran earlier this year and is being shared again as part of HuffPost Personal’s “Best Of” series.\n\nDo you have a compelling personal story you’d like to see published on HuffPost? Find out what we’re looking for here and send us a pitch at pitch@huffpost.com.",
  "authors": [
    "Guest Writer"
  ],
  "url": "https://www.huffpost.com/entry/marriage-fallopian-tube-removal-infertility-divorce-husband_n_691e6282e4b0dc5d37ac37e2?origin=home-huffpost-personal-unit"
}