{
  "title": "Juventus, la Signora del calcio torna giovane grazie alla comunicazione digitale",
  "text": "Periodi poco felici capitano anche nelle migliori famiglie. Vale anche per una squadra di calcio, come la Juventus, per cui “vincere è l’unica cosa che conta”. Per chi è abituato all'eccellenza, accettare l'anonimato nei risultati sportivi è dura. Anno dopo anno, il rischio è che i tifosi non si riconoscano più nell’ambiente e nei giocatori e che pian piano si disaffezionino.\n\nDopo Fino Alla Fine, ora è la volta We Are Youth. Since 1897 il claim della Juventus da circa un anno Lino Garbellini\n\nSiamo gioventù, siamo Juventus\n\nA mettere una pezza in casa Juve è il marketing con il claim We Are Youth. Since 1897 presentato un anno fa, ma anche la relativa e recente Youth Week (che si è svolta dal 29 ottobre al 3 novembre 2025), una settimana densa d'eventi non sportivi per il brand della Vecchia Signora (ammesso che sia ancora sensato definirla così).\n\nLa gioventù ce l'ha nel dna, a partire dal nome, ma anche dalla grande voglia di coinvolgere le generazioni di teenager e ragazzi a cui sono dedicate le tante iniziative recenti. “Vogliamo dare continuità a quello che è stato fatto negli ultimi tre anni, abbiamo strutturato un diverso approccio verso i nuovi media, cambiato il modo in cui ci raccontiamo e vogliamo proseguire nel progetto”, spiega Marco Castellaneta, direttore marketing Juventus FC, “gioventù per noi non è una questione anagrafica, ma un'attitudine, rappresenta curiosità, coraggio, voglia di evolvere. Anche attraverso il nuovo video manifesto con la voce di Del Piero, stiamo andando a misurare la penetrazione sui fan, a livello mondiale, ma sopratutto in paesi per noi strategici come Italia e Stati Uniti”.\n\nUn riposizionamento che richiede tempo e che passa attraverso numerose attività riguardanti il brand Juventus in ambiti prima impensabili, dall'arte alla cultura pop, passando per la musica, “c'è bisogno di tempo per raggiungere i tifosi con il nuovo racconto, ma anche d'attività come quella fatta al Lucca Comics, ad Artissima o al C2C Festival a Torino”.",
  "authors": [
    "Lino Garbellini"
  ],
  "url": "https://www.wired.it/article/juventus-la-signora-del-calcio-torna-giovane-grazie-alla-comunicazione-digitale/"
}