{
  "title": "Odd Lots Cohost Joe Weisenthal Has Predictions About How the AI Bubble Will Burst",
  "text": "If you read any of WIRED’s recent AI edition, you know that lots of people are spending lots of time talking about how the technology is revolutionizing pretty much everything—from coding to writing to accounting. You’ve also probably heard by now, from us or somebody else, that we might very well be in an economic bubble of AI origin, one wherein the billions and billions of dollars being funneled into the industry is creating an untenable economic scenario that could turn catastrophic.\n\nOf course, you may also have read that I’m really sick of being asked about AI. I’m still not sick, though, of asking other people about it—especially when they’re much smarter about this stuff than I am. Enter Joe Weisenthal, the cohost of Bloomberg’s fantastic Odd Lots podcast and a former coworker of mine. Trust me: As someone who spent a year listening to Joe lose his mind in the office—loudly!—anytime the economy hiccuped, few people think more about our country’s, and our planet’s, financial circumstances than Joe does. And right now, Joe’s concerns aren’t strictly about what happens if or when that AI bubble bursts. His worries are more focused on what’s going right and wrong with the US economy writ large.\n\nFor this week’s episode of The Big Interview, Joe and I talked about weird market indicators, US competition with China, and whether or not we should all prepare for an AI economic apocalypse.\n\nThis interview has been edited for length and clarity.\n\nKATIE DRUMMOND: Joe Weisenthal, welcome to The Big Interview.\n\nJOE WEISENTHAL: Thrilled to be here. Nice to see you again.\n\nIt's been too long. We were just talking about how you and I worked together—what was that, like nine years ago?\n\nI think you were there 2014, 2015, so maybe 10 years ago or something?\n\nYeah, I worked at Bloomberg. I lasted about a year.\n\nNot bad.\n\nNot bad. In my mid-twenties, maybe not the most conducive environment to my professional success. Let's just say that. But Joe, you were there, you were loud, you were proud, you were always very excited about the economy.\n\nI love talking about the economy.\n\nYou would just scream and shout and hoot and holler, and I was like, who is this guy sitting across from me? And why is he so loud? But I really appreciated your enthusiasm.",
  "authors": [
    "Katie Drummond"
  ],
  "url": "https://www.wired.com/story/the-big-interview-podcast-joe-weisenthal/"
}