{
  "title": "Arnold Schwarzenegger & Carrie-Anne Moss Answer The Web's Most Searched Questions",
  "text": "Transcript\n\nI'm Carrie-Anne Moss.\n\nI'm Arnold Schwarzenegger.\n\nThis is the Wired Complete...\n\nAutocomplete Interview.\n\n[they laugh]\n\n[upbeat music]\n\n[Interviewer] The Wired Autocomplete Interview.\n\nYeah, [beep] you.\n\n[they laugh]\n\n[upbeat music]\n\nWhat did Arnold eat for breakfast?\n\nOh, I know.\n\nI know what he ate for breakfast.\n\nMuesli and yogurt.\n\nVery good.\n\nYeah.\n\nBut you forgot the breakfast burrito.\n\nOh, I didn't know that. Okay.\n\nWell, of course you didn't know that.\n\nThat's why he asked the question,\n\nbecause he wanted to trick you.\n\nThat was the trick question.\n\n[Carrie-Anne] What was Arnold Schwarzenegger's best...\n\nBest bench? Best bench.\n\n500. Mm.\n\nIt's very private. Yeah.\n\nGot it. Just 500.\n\n[Carrie-Anne] Arnold Schwarzenegger's iconic pose.\n\nWell, you know,\n\nthe most muscular pose probably is what he's referring to.\n\nBut I mean, there's many other ones.\n\nTo me, every single pose that I've ever done is iconic.\n\nIf it's the double bicep pose, or the ab pose,\n\nor the double bicep from the back,\n\nor the lat spread to the side chest pose,\n\nor the thigh pose, or the calf pose,\n\nit makes no difference what it is.\n\nIt was iconic.\n\nThat's why I became the greatest bodybuilder four times.\n\nPeriod.\n\nHasta la vista, baby. Fantastic.\n\n[board clatters]\n\n[Carrie-Anne] Carrie-Anne Moss.\n\nJeri Hogarth.\n\nJeri Hogarth?\n\nIt's a character I played on a Marvel show,\n\nJessica Jones. I know.\n\nYeah. I loved playing her.\n\nI think I did three seasons of that Netflix show.\n\nI think it was three seasons.\n\nAnd then I also, you know,\n\ncross-pollinated into other Marvel worlds.\n\nI loved playing her.\n\nShe was...\n\nThat was really fun.\n\nI love playing people that are super manipulative\n\nand will do anything.\n\nIt's incredibly freeing.\n\nI would say I'm not that kind of person.\n\nI don't have a bone in my body like that.\n\nSo it's super fun to just know\n\nthat there's nothing you can do wrong.\n\nThere's nothing you could...\n\nYou could be...\n\nLike, there's no judgment.\n\nLike, she just would do whatever she needed to do\n\nto make whatever she needed to happen.\n\nAnd there's something really fun about that.\n\nHow about Christopher Nolan?\n\nChristopher Nolan.\n\nYeah. Really wonderful.\n\nI mean, I did Memento with him\n\nright in the beginning of his career.\n\nYou know, I knew that he was a phenomenal director.\n\nHe created an environment on that set.\n\nI think I worked for 10 days when I did that part.\n\nAnd I've talked to you a few times about how like,\n\nI really look for freedom when I'm acting.\n\nLike, I love the feeling of freedom.\n\nAnd it's very rare on a set that you feel free, right.\n\nBecause you have your mark, you have your containment,\n\nyou know, you're stopping and starting.\n\nThere's people over here, you know.\n\nYou know you're not in that imaginary world.\n\nLike, it's hard to believe that all the way, right.\n\nWith Christopher Nolan, he just like steps back\n\nand you just are in this world.\n\nSo it was really very...\n\nA lot of freedom that I experienced working with him.\n\nRight. Yep.\n\nNext one.\n\nYour training for The Matrix.\n\nOh, yeah.\n\nYou know, like us learning the dancing, right?\n\nI had four months of every day,\n\nKeanu, me and Laurence training, and Hugo.\n\nSo we became like a family every day doing the training.\n\nSo that was really cool.\n\nVery nice.\n\nKeanu Reeves friendship.\n\nYeah.\n\nGood friend. Tell us about the,\n\nthe friendship you had. Yeah.\n\nI mean, were you as close to him as with me?\n\nNot even close.\n\nGood. [Carrie-Anne laughs]\n\nYou see, she knows how to do it.\n\nIt just isn't close.\n\n[they laugh]\n\nWe're very good friends.\n\nYou know, we spent years together, so yeah.\n\nBut... You what?\n\nWe spent years in the movies together.\n\n[board clatters]\n\nI had to redo it. No.\n\nNo, don't ever say that.\n\n[Carrie-Anne laughs]\n\nOkay. Arnold Schwarzenegger, again.\n\nNo, I am holding it now.\n\nYeah. Okay. I'm holding it now.\n\n[Carrie-Anne] Can you meet Arnold Schwarzenegger?\n\nYes, you can.\n\nIf you come to the red carpet premiere of FUBAR,\n\nthe red carpet premiere is all about the fans.\n\nFans come there, they can come and hang out.\n\nThey can come and shake hands.\n\nThey can come out and have the experience just like I have.\n\nSo, come on out on Wednesday evening, right here at Netflix.\n\nHow did Arnold Schwarzenegger become successful?\n\nThe best thing to do is to go\n\nand buy the book Be Useful.\n\nBecause that book has everything in there that I...\n\nAll the tools that I used to be successful.\n\nIt's that simple.\n\nFirst of all, you have to have a great vision,\n\nso you know where you're going,\n\nwhich direction you're going.\n\nLike me wanting to be the world champion in bodybuilding.\n\nNow I had do the training to get me there.\n\nEvery step, every rep, every exercise that did\n\nmade me enthusiastic and excited\n\nbecause it was one step closer\n\nto having that vision, make it a reality.\n\nSo, having a vision is the most important thing.\n\nThe next thing is, is work your ass off.\n\nThere's no such thing as shortcuts.\n\nAnyone that thinks there's a shortcut,\n\nor you can lie around,\n\nor maybe you get up after six o'clock in the morning, no.\n\nPeople that have built this country\n\ndidn't get up at six in the morning,\n\nor at seven in the morning, or at eight.\n\nThey got up earlier.\n\nRemember, the early birds get the worm.\n\nSo, it's like, this is that simple.\n\nIt's all about work your ass off.\n\nThere was times when I was working on construction,\n\nI was training five hours a day for bodybuilding.\n\nI was going to college at the same time.\n\nI was running my mail order business at the same time.\n\nI was doing all of this at the same time.\n\nBecause the day is 24 hours.\n\nSix hours, we sleep.\n\nThe rest of the 18 hours, we work our ass off.\n\nThat's how you do it. Mm.\n\nAnd the third is don't listen to the naysayers.\n\nbecause there's a lot of people out there\n\nthat will always say, You wanna be world champion?\n\nThis is crazy. You would never do that.\n\nYou say you wanna be a great actor or actress.\n\nThey say that this is crazy, this is insane,\n\nit's impossible.\n\nWell, screw the impossible.\n\nDoesn't exist.\n\nThe no doesn't exist.\n\nIgnore all of those naysayers.\n\nNo, This is impossible.\n\nForget all that.\n\nEverything is possible.\n\nThat's the bottom line.\n\nWas Arnold Schwarzenegger a good governor?\n\nThe best.\n\nI'm not gonna brag.\n\n[Carrie-Anne laughs]\n\nI'm gonna go and just say I was happy with the outcome.\n\nI was very, very happy, the things that we've accomplished,\n\nand I was very, very dissatisfied\n\nwith the things we didn't accomplish.\n\nMm. That's the bottom line.\n\nYou always walk away from the job\n\nfeeling like you haven't done everything\n\nand you want to have another four years.\n\nBut don't get tricked into that\n\n'cause it just happens to every governor.\n\nEveryone would tell you that I wish\n\nI could have stayed another four years.\n\nIt's just the way it is.\n\nWe can never, ever solve all of the problems\n\nbecause they come, as you just put out a fire over here,\n\nthere's another fire starting over here.\n\nSo that's just the way the job is.\n\nBut the key thing is, that I'm most proud of,\n\nis that I was able to work together\n\nwith Democrats and Republicans\n\nand Independents in the state.\n\nBring everyone together\n\nand never look at anyone as the enemy.\n\nI always looked at them as kind of partners.\n\nTogether, we can do it.\n\nThat's the bottom line.\n\nDo you know martial arts?\n\nNo. I just do movie Kung Fu.\n\nAh. Okay. Yeah.\n\nMovie Kung Fu is good.\n\nYou're doing it well.\n\nThank you. Yeah.\n\nI like it.\n\nYou wanna do the next one?\n\nRide motorcycles?\n\nIn movies only.\n\nAll right.\n\nYou can see the theme here.\n\nDo you do your own stunts?\n\nNo.\n\nI do my own action.\n\nStunt men, stunt women do stunts.\n\nWho did Arnold Schwarzenegger look up to?\n\nI looked up to a lot of people.\n\nI looked up to Reg Park,\n\nwho was a Mr. Universe three times\n\nand then went to a star in Hercules movies.\n\nHe was kind of like one of my first idols\n\nwhen I saw him on the big screen.\n\nI looked up to Ronald Reagan when I came to America.\n\nI looked up to Nixon.\n\nI looked up to Gorbachev later on\n\nfor, you know, dropping communism in Russia\n\nbecause it didn't work.\n\nAnd to have the balls to do that,\n\nthat's something that is admirable.\n\nNelson Mandela was someone that I looked up to.\n\nI mean, what a great leader.\n\nA man that forgave the past\n\nto move the future forward in a big way\n\nin South Africa was fantastic.\n\nAnd when I promoted Special Olympics\n\nwith him down there in South Africa,\n\nit was a great experience for me.\n\nAnd being in his prison cell,\n\nwhere he was in prison for 20-something years,\n\nit was fantastic.\n\nMuhammad Ali was another one that was a great athlete,\n\nbut he was multi-talented, had such a fantastic personality.\n\nAnd without him, you know, boxing wouldn't have gotten\n\nto the level that it is today.\n\nI mean, he really elevated boxing because of his humor\n\nand his wit and his quickness and all that stuff.\n\nAnd so giving.\n\nI mean, he would just walk through the airport\n\nand give a 100 dollar bill to someone that is hanging there\n\nand saying, you know, I don't have a home.\n\nOr, I need help, or something like that.\n\nSo it is just, you know, he really taught us all how to be,\n\nyou know, giving and to give back to the community.\n\n[Carrie-Anne] What does Arnold Schwarzenegger\n\ndo in FUBAR?\n\nI kick some serious ass in FUBAR.\n\nAnd I dance my way out of trouble.\n\nI'm a little bit confused with my love life.\n\nOn the one hand it's with my ex-wife,\n\nthen it is with Carrie-Anne.\n\nAnd it's like, kind of all over the place\n\nbecause in this seriousness, in the second season,\n\nmy past comes back, you know.\n\nWe worked together like, you know,\n\n30-something years ago, 40 years ago.\n\nAnd we actually together helped to bring the wall,\n\nthe Berlin Wall down.\n\nAnd we also were able to kind of\n\ndismantle communism together and were very helpful in that.\n\nAnd so, we worked together, but we also were enemies.\n\nAnd all of a sudden, now's back in my life again.\n\nSo this is where the drama comes in with a lot of action.\n\n[Carrie-Anne] What is Arnold Schwarzenegger\n\nmost famous for?\n\nMost famous for?\n\nI couldn't, I wouldn't even know.\n\nI think that maybe most famous\n\nfor being the only Austrian\n\nthat ever became Governor of California.\n\nMaybe it's that. That's amazing.\n\nOr maybe I'm the only one that has\n\nwon 13 World Bodybuilding Championship titles.\n\nI don't know.\n\nOr is it that I have made over, you know,\n\nfour and a half billion dollars\n\nat the box office with my movies?\n\nI have no idea which direction, you know, I can go.\n\nBecause I was very fortunate\n\nthat I was very kind of successful in many different areas.\n\nNot because of me,\n\nbut because America gave me the opportunity to do that.\n\nYou know, that's why I think the world of this country\n\nand I always will give something back.\n\nArnold Schwarzenegger famous lines.\n\nWell, I think the most famous one is clearly...\n\nYou're waiting.\n\nI'll be back.\n\nHasta la vista, baby.\n\nYou shouldn't cook and drink.\n\nOr, I'm gonna ram my fist in your stomach\n\nand break your [beep] spine.\n\nOr, Stick around.\n\nThis goes on and on and on,\n\nthe lines. Oh my gosh.\n\nThere's just so many.\n\nOh yeah, Get to the chopper.\n\nExactly. Yeah.\n\nIt's not a tumor.\n\nIt's not a tumor at all. [Carrie-Anne laughs]\n\nYou know, so the list goes on and on, like they said.\n\nWhat is Carrie-Anne most known for?\n\nTrinity in The Matrix?\n\nWell, then we have to go and publicize it right now\n\nthat you should also be known for being\n\nGreta Nelso? The most\n\nextraordinary actress.\n\nAww. In FUBAR.\n\nThank you.\n\nAnd being a fantastic mother\n\nand wife and someone that really knows how to balance.\n\nThank you. The personal life\n\nwith the professional life.\n\nThank you.\n\nImportant to me.\n\nLet's go for the next one. Okay.\n\nhat's Carrie-Anne Moss doing now?\n\nNow you're talking with us. Yeah, sitting with you.\n\nSitting with Arnold Schwarzenegger.\n\nWith the forehead.\n\nAnd what question is that?\n\n[Carrie-Anne] This is what people are Googling about me.\n\n[Arnold] Oh, man. Yeah. Yeah.\n\n[Carrie-Anne] What is Carrie-Anne Moss doing next?\n\nDoing next, exactly.\n\nAs soon as this interview's over,\n\nshe's going to come over to my house,\n\nSee the pig. And help me\n\nfeed all the animals.\n\nI love that.\n\nBecause I need help.\n\nI mean Lulu and Whiskey and my pony and my...\n\nAw, that's so sweet. Donkey was kind of\n\na rebel today. Was he?\n\nOh, yeah.\n\nThey wanted to eat all the cookies,\n\nall the oatmeal cookies that we have.\n\nAnd then the pig came in.\n\nOink, oink, oink, oink, oink.\n\nTotally ballsy with his huge deltoids\n\nand glutes. [Carrie-Anne laughs]\n\nAnd then I had to give him also a cookie.\n\nAw. Then the dogs come in.\n\nI said, Okay, that's too much guys.\n\nI'm gonna wait until Carrie-Anne comes over here\n\nand helps me feed all of you.\n\nAnd before I came, I made my dogs\n\n10 pounds of beef while I was gone\n\nso they would be fed as well\n\nas I feed them when I'm not there.\n\nYeah, I get some of those.\n\nYeah, That's exactly.\n\nThat's my life right there in a nutshell.\n\nOkay. But that's it. We did this.\n\nWell, that's it for the interviews and all the questions\n\nand all of that stuff.\n\nI mean, it was a strange way to go about it\n\nwith pulling off these tapes\n\nand like a classroom\n\nin the third grade or something like that.\n\nBut I mean, it's, look, you do exactly what you wish to do.\n\nWe played the game, we tried to hang in there.",
  "authors": [
    "Condé Nast"
  ],
  "url": "https://www.wired.com/video/watch/google-autocomplete-inverviews-arnold-schwarzenegger-and-carrie-anne-moss-answer-the-webs-most-searched-questions"
}