{
  "title": "Trump’s 28-point peace proposal for Ukraine would require land concessions and military reduction",
  "text": "A new Trump administration plan for the end of the war in Ukraine would see Kyiv cede territory to Russia, US “de facto” recognition of Crimea and other Ukrainian territory forcibly seized by the Kremlin as Russian, and limits to the size of Ukraine’s military, according to a draft of the plan obtained Thursday by CNN.\n\nThe draft’s veracity was confirmed to CNN by a US official. Many of the ideas put forward in the 28-point plan have been rejected in previous negotiations by Ukraine and European officials and would be seen as concessions to Russia.\n\nUS officials said the plan was still being worked on, and that any final agreement would require concessions from both sides, not just Ukraine. Some of the points being circulated now – including some that appear weighted toward Moscow’s demands – are not final, officials said, and will almost certainly evolve. During a Thursday afternoon briefing, the White House press secretary said the plan remained “in flux.”\n\nAfter meeting a top US military official in Kyiv on Thursday, Ukrainian President Volodymyr Zelensky agreed to work with the Trump administration on the new plan, saying in a social media post that he was prepared for “constructive, honest and swift work” to achieve peace.\n\nThe 28-point plan, which President Donald Trump has reviewed and supports, is the White House’s latest attempt to bring Russia’s war in Ukraine to an end. Some of the proposal’s provisions — including territorial concessions in areas not currently held by Russia — have previously been nonstarters with the Ukrainians. But US officials see a new window of opportunity to restart peace discussions.\n\nThe plan is still in the framework stage, and its many points haven’t been finalized.\n\nWhat’s in the draft plan\n\nSimilar to the ceasefire in Gaza, the draft describes the plan’s implementation as being “monitored and guaranteed by the Peace Council, headed by President Donald J. Trump.”\n\n“Sanctions will be imposed for violations,” it states.\n\nThe draft plan would have Crimea, Luhansk and Donetsk be recognized “as de facto Russian, including by the United States.” This would mark a stunning reversal of longstanding US policy to acknowledge Ukraine’s territorial integrity and not recognize forcible changes in territory.\n\nThe draft plan says Kherson and Zaporizhzhia will be frozen along the line of contact, “which will mean de facto recognition along the line of contact.”\n\n“Russia will relinquish other agreed territories it controls outside the five regions,” it says.\n\nThe plan calls for Ukrainian forces to withdraw from the parts of Donetsk that they currently control, “and this withdrawal zone will be considered a neutral demilitarized buffer zone, internationally recognized as territory belonging to the Russian Federation.”\n\nThe plan states that Russian forces will not enter the demilitarized zone. The two countries would commit not to change the agreed-upon territorial arrangements by force, or else security guarantees would not apply.\n\nThe security guarantees, which the plan says Ukraine will receive, are not detailed in the draft. However, it notes that the US will receive compensation for its guarantee.\n\nIf Russia invades Ukraine, “in addition to a decisive coordinated military response, all global sanctions will be reinstated, recognition of the new territory and all other benefits of this deal will be revoked,” the draft states.\n\n“If Ukraine launches a missile at Moscow or St. Petersburg without cause, the security guarantee will be deemed invalid,” it notes.\n\nThe draft plan includes a commitment that Ukraine will not join NATO, that NATO will not station troops in Ukraine, and that European fighter jets be stationed in Poland.\n\nIt limits the size of the Ukrainian armed forces to 600,000 personnel. It also calls for Ukrainian elections within 100 days.\n\nThe draft calls for the creation of a joint US-Russia “working group on security issues will be established to promote and ensure compliance with all provisions of this agreement.”\n\nIt outlines a return of Russia into the global community, including the lifting of sanctions, invitation to rejoin the G8, and its reintegration into the global economy.\n\nThe plan would see “all parties” in the war “receive full amnesty for their actions during the war and agree not to make any claims or consider any complaints in the future.”\n\nRussian President Vladimir Putin is wanted by the International Criminal Court for the crime of forcibly deporting Ukrainian children. The plan calls for the return of “all civilian detainees and hostages,” including children, and the exchange of all prisoners of war and bodies.\n\nThe draft calls for the Zaporizhzhia Nuclear Power Plant to “be launched under the supervision of the IAEA, and the electricity produced will be distributed equally between Russia and Ukraine.”\n\n“President Trump has made it very clear since day one, and even on the campaign trail, that he wants to see this war come to an end. He has grown increasingly frustrated with both sides of this war, Russia and Ukraine alike, for their refusal to commit to a peace agreement,” White House press secretary Karoline Leavitt said during her briefing. “Nevertheless, the president and his national security team are steadfast in seeing this war come to an end.”\n\nLeavitt rejected suggestions the plan was overly weighted toward Moscow, and said the administration had “talked equally with both sides” to create it.\n\n“It’s a good plan for both Russia and Ukraine, and we believe that it should be acceptable to both sides, and we’re working very hard to get it done,” she said.\n\nSecretary of State Marco Rubio suggested late Wednesday the document was a “list of potential ideas” rather than a completed proposal.\n\n“Ending a complex and deadly war such as the one in Ukraine requires an extensive exchange of serious and realistic ideas,” he wrote in a post on X. “And achieving a durable peace will require both sides to agree to difficult but necessary concessions. That is why we are and will continue to develop a list of potential ideas for ending this war based on input from both sides of this conflict.”\n\nStill, some of the provisions being floated are likely to draw criticism from Ukraine and its backers since it would require significant land concessions. The two regions that form the Donbas, Luhansk and Donetsk, are still partially held by Ukraine.\n\nThe proposal echoes a peace proposal from talks in Istanbul in the early weeks of the war in 2022, repeating some of Moscow’s wider geopolitical demands about Ukraine’s armed forces and allegiances.\n\nTalks in Ukraine\n\nArmy Secretary Dan Driscoll met with Zelensky in Ukraine on Thursday and delivered him the Trump administration’s proposed peace plan, a US defense official told CNN.\n\nDriscoll and Zelensky discussed “a collaborative plan to achieve peace in Ukraine” and “agreed on an aggressive timeline for signature,” the defense official said. The official clarified that the US expected Zelensky to sign a framework with the US to work toward an eventual peace agreement, not sign onto a final peace deal itself.\n\nIt’s not clear how aggressive that timeline is, or whether Zelensky agreed to its points. European and Ukrainian officials told CNN on Wednesday that the plan appears to contain unacceptable and maximalist demands from Russia, including ceding territory in the eastern Donbas region that Russia does not even currently control.\n\nBut the Ukrainian presidential office said Thursday on X that “the President of Ukraine has officially received from the American side a draft plan which, in the American side’s assessment, could help reinvigorate diplomacy.”\n\n“The President of Ukraine outlined the fundamental principles that matter to our people, and following today’s meeting, the parties agreed to work on the plan’s provisions in a way that would bring about a just end to the war,” the Ukrainian presidential office said, adding that Zelensky expects to speak with Trump in the coming days.\n\nAsked why the Army was tasked with delivering the peace plan rather than diplomats, the defense official said the Army “comes from a trusted position” with the Ukrainians, and is also in Ukraine to hold meetings on battlefield innovation — a topic Driscoll has been deeply involved in throughout his tenure as secretary.\n\n“We come from a trusted position. The US Army is a proven Ukraine ally,” the official said.\n\n‘Groundhog Day’\n\nA European diplomat echoed a Western official’s description of some of the details of the proposal. The person told CNN that the new effort, which repeats many of Moscow’s maximalist demands dating back to 2022, reminded them of “Groundhog Day,” a film in which events repeat themselves over and over.\n\nA European envoy based in Ukraine said the plan had caught the diplomatic community completely by surprise.\n\n“This has all been gone through before and rejected, and now we’re back to square one,” the diplomat said. “For the Ukrainians, it is just a non-starter and with good reason. It would just be inviting the Russians to come back again at a future date. It would be political suicide for any Ukrainian leader (to accept it), and it would be military suicide to hand over that fortified area.”\n\nThe diplomat also described foreign ministries in Europe and elsewhere calling contacts in Washington for guidance on the plan only to be told they were equally in the dark.\n\n“We have heard directly from people in the State Department and on Capitol Hill that nobody knew anything about this plan until it was leaked yesterday,” the diplomat said.\n\n“People who should have known about it, knew nothing about it … There’s a lot of annoyance and confusion.”\n\nIn her first public comments since reports of the plan emerged, the European Union’s foreign policy chief, Kaja Kallas, told reporters Thursday that “for any plan to work, it needs Ukrainians and Europeans on board.” Poland’s foreign minister Radosław Sikorski, meanwhile, told CNN that any plans should involve Europe and leave Kyiv with the capacity to defend itself.\n\n“We have a much bigger stake in this than the US, and therefore Ukraine, but also Europe, has to be involved,” he said.\n\nTrump’s special envoy, Steve Witkoff, has been leading the effort, CNN reported on Wednesday, with a source saying the negotiations accelerated this week as the administration feels the Kremlin has signaled a renewed openness to a deal. A US official said Witkoff had been quietly working on the plan for a month, with input from both the Ukrainians and the Russians on the terms they could accept.\n\nThe Kremlin, meanwhile, reiterated its denial that it was working with the US on a peace proposal for Ukraine, saying Thursday there were “no new developments.”\n\n“We have nothing new to add to what was said in Anchorage,” Kremlin spokesperson Dmitry Peskov said, referencing a meeting between Putin and Trump in Alaska in August. “We have no new developments.”\n\nCNN’s Andrew Carey, Nick Paton Walsh, Brian Abel, and Catherine Nicholls contributed to this report.\n\nThis headline and story have been updated with additional information.",
  "authors": [
    "Jennifer Hansler",
    "Kevin Liptak",
    "Natasha Bertrand"
  ],
  "url": "https://www.cnn.com/2025/11/20/politics/ukraine-russia-trump-peace-proposal"
}