{
  "title": "Trump habilita aguas de Florida y California para la perforación petrolera tras décadas de prohibición",
  "text": "CNN —\n\nEl Gobierno de Trump propone abrir aguas federales frente a toda la costa de California para perforación petrolera, así como una zona frente a la costa de Florida. Las aguas de ninguno de esos estados han estado abiertas a nueva perforación desde hace décadas.\n\nEl Departamento del Interior del presidente Donald Trump publicó el jueves un plan de perforación costa afuera a cinco años que abriría vastas zonas de la costa de California a la perforación, algo que no sucede en ese estado desde finales de la década de 1960. El Departamento también propone nueva perforación petrolera en partes del golfo oriental —ubicado aproximadamente a 100 millas náuticas de la costa de Florida—, una decisión que anteriormente había sido rechazada por el liderazgo republicano de Florida.\n\nLa propuesta del Gobierno de Trump también abriría el golfo oriental a subastas federales de perforación a partir de 2029. También permitiría subastas para perforación en el centro y el sur de California en 2027 y en el norte de California en 2029.\n\nSegún una fuente del sector, la industria petrolera lleva años defendiendo la apertura de partes del golfo oriental adyacentes a zonas donde la producción petrolera ha ocurrido desde hace décadas en el golfo central.\n\nLa propuesta seguramente enfrentará resistencia en California. La costa del estado no ha visto perforación desde un devastador derrame petrolero en 1969, que atrajo atención nacional por destruir fauna marina y afectar la industria pesquera del estado.\n\nLa acción en el golfo también será examinada de cerca en Florida, donde el recuerdo del derrame de Deepwater Horizon de 2010 aún marca la opinión pública. Durante el primer mandato de Trump, la delegación congresional del estado —incluidos republicanos— rechazó varias veces intentos de abrir el golfo oriental a perforación. El gobernador Ron DeSantis también se ha opuesto a la exploración costa afuera. La primera administración de Trump extendió la prohibición de perforación en el golfo oriental en lugar de abrirlo.\n\nAntes de la publicación del plan quinquenal del jueves, el senador republicano Rick Scott, de Florida, dijo que creía tener garantías del secretario del Interior Doug Burgum de que cualquier nueva perforación en el golfo no amenazaría a Florida económica, ambiental o militarmente, según una fuente conocedora de la conversación. Una fuente cercana a la delegación de Florida cree que la propuesta respeta esas garantías, aunque el personal legislativo aún revisaba los detalles el jueves.\n\nErik Milito, presidente de la Asociación Nacional de Industrias Oceánicas, calificó la inclusión del golfo oriental como un “enfoque con visión de futuro”.\n\nEsta medida forma parte de la agenda del presidente Donald Trump de abrir más zonas del país a la perforación de combustibles fósiles, la repetida promesa de campaña de “perforar, perforar, perforar”.\n\nEl plan de Trump también propone realizar subastas de arrendamiento en el oeste y centro del golfo de México, donde actualmente se concentra la mayor parte de la perforación costa afuera. También propone subastar aguas federales a lo largo de casi toda la costa de Alaska hacia finales de la década y principios de la década de 2030.\n\nEn respuesta al nuevo plan del Gobierno de Trump, líderes de California prometieron oponerse a la medida federal para abrir las aguas a perforación, incluso mediante posibles acciones legales.\n\n“Una y otra vez, el presidente Trump ha demostrado que su interés reside en que sus amigos del petróleo obtengan ganancias a costa de nuestro medio ambiente y nuestra salud pública”, dijo Christine Lee, vocera del fiscal general de California Rob Bonta. “No vamos a permitirlo y estamos explorando nuestras opciones legales”.\n\nEl senador Alex Padilla y el representante Jared Huffman, ambos demócratas de California, dijeron en un comunicado conjunto que el plan de Trump “apunta a California y a toda la costa oeste porque creen que cederemos”.\n\n“Están equivocados”, dijeron Padilla y Huffman. “Vamos a luchar con todo lo que tenemos”.\n\nDado el efecto de los aranceles impuestos por Trump, este no es un momento de auge para la perforación petrolera, dijeron expertos a CNN. Las empresas, en cambio, tratan de reducir gastos y conservar sus ganancias, según Tom Seng, profesor de finanzas energéticas en la Universidad Cristiana de Texas.\n\n“Ahora mismo, la industria no tiene mucho movimiento”, dijo Seng. “Ciertamente tenemos una administración a favor de los combustibles fósiles. Van a agilizar las cosas para nosotros, pero el mercado siempre dictará la actividad”.\n\nSin embargo, señaló Seng, algunas compañías de exploración petrolera probablemente querrán “aprovechar las ofertas de arrendamiento” pensando en el futuro a largo plazo.\n\n“La pregunta es: ¿cuándo invertirán el capital para realmente perforar en esos arrendamientos?”, dijo. “No habrá prisa para hacerlo. Un petróleo a US$ 60 no ayuda”.\n\nGrupos ambientalistas dijeron que el plan representaría una amenaza para la vida marina y las comunidades costeras de todo el país.\n\n“Este plan preliminar es una pesadilla de derrames de petróleo”, dijo Joseph Gordon, director de la campaña oceánica de Ocean. “Lo último que Estados Unidos necesita en est emomento es una expansión considerable de la perforación costa afuera que podría paralizar nuestras costas con derrames catastróficos”.\n\nLa medida más reciente se suma a otros pasos que la administración de Trump ha tomado en los últimos días y semanas para expandir la perforación en el país. El Departamento del Interior anunció esta semana que revertía una regla del Gobierno de Biden que prohibía la perforación de combustibles fósiles en casi la mitad de la Reserva Nacional de Petróleo en Alaska, más de 5 millones de hectáreas.\n\nY los grupos ambientalistas encendieron las alarmas cuando la petrolera ConocoPhillips propuso más exploración en Alaska, incluida la perforación de cuatro nuevos pozos exploratorios en la NPRA. La compañía actualmente desarrolla el enorme proyecto Willow en la NPRA, donde espera comenzar a producir petróleo en 2029. Willow fue aprobado por el expresidente Joe Biden en una decisión que generó malestar en su base demócrata.\n\n“El público merece tener voz en lo que ocurre en estas tierras públicas de importancia crítica en el Ártico occidental”, dijo el abogado de Earthjustice, Ian Dooley, en un comunicado reciente. “Las actividades sísmicas y de perforación pueden causar impactos en este ecosistema sensible que duran décadas”.",
  "authors": [
    "Ella Nilsen",
    "Steve Contorno"
  ],
  "url": "https://cnnespanol.cnn.com/2025/11/20/eeuu/trump-aguas-florida-california-exploracion-petrolera-trax"
}