{
  "title": "Paleontologist Answers Fossil Questions",
  "text": "Transcript\n\nI'm Dr. Kenneth Lacovara,\n\npaleontologist and executive director\n\nof the Edelman Fossil Park of Rowan University.\n\nAnd I'm here to answer your questions from the internet.\n\nThis is fossil support.\n\n[upbeat music]\n\n@jennyflyrocks asks,\n\nDo you know how tyrannosaurs' head is too big\n\nfor the rest of her?\n\nIs it me?\n\nWell, no, it's not you.\n\nIt has a really big head.\n\nIt needs a really big head\n\nbecause tyrannosaur, Tyrannosaurus rex in particular\n\nhad the strongest bite force of any land animal\n\nprobably ever.\n\nAnd to have a really strong bite,\n\nyou need a really big skull\n\nthat can house really big jaw muscles.\n\nAnd it turns out that head muscles and arm muscles\n\ncompete for attachment space\n\naround the girdle of the shoulder.\n\nSo as T. rex's bite got more ferocious, its head got bigger,\n\nits neck muscles had to get bigger.\n\nIt needed to occupy more space on the shoulder\n\nfor its neck muscles.\n\nIts arms got shorter and shorter and shorter.\n\nSo those comical little arms that T. rex has\n\nwith two little witchy fingers is what made possible\n\nit's murderous bite.\n\n@LauraBedrossian writes,\n\nCan you comment on the science behind extracting dino DNA\n\nfrom mosquitoes in amber?\n\nIs that just 'Jurassic Park' stuff?\n\nYes, it is.\n\nAmber is actually a terrible geochemical environment\n\nto preserve DNA.\n\nPeople have looked and no DNA from dinosaurs\n\nhas yet been recovered.\n\nIt seems to be too old, at least for existing technology\n\nand/or samples.\n\n@ClippedWings22 writes, How do fossil bones fossilize?\n\nAre they just filled with air\n\nor are they somehow filled with the same rock\n\nthat surrounds the fossils?\n\nThe latter.\n\nThey are filled with the same rock\n\nthat surrounds the fossils.\n\nHere is a fossil tyrannosaur bone from Morocco.\n\nIt's Cretaceous age.\n\nYou can see that there is sediment inside the hollow bone\n\nof the tyrannosaur.\n\nAnd so what usually happens is the same rock\n\nthat is surrounding the fossil also gets inside the fossil\n\nand it's preserved that way.\n\n@HoltonMusicMan writes, How do fossils for fossil fuel\n\nend up two miles beneath the surface?\n\nEspecially enough to make oil.\n\nThe fossils have to be buried in what we call\n\na deposition basin.\n\nThink of a river valley\n\nor a continental shelf off of a coastline.\n\nAs sediment accumulates in those basins,\n\nthe weight of the rocks pushes them down.\n\nSo they settle under their own weight.\n\nThe pressure increases, the heat increases,\n\nand eventually those organics can turn into fossil fuels.\n\n@_JustCallMe_Al_ asks, You know what's so effing cool?\n\nThe evolution of discovering what dinosaurs look like\n\nthrough the years.\n\nWell, it's true.\n\nYou know, in our understanding\n\nof the way dinosaurs looked and behaved\n\nhas been evolving ever since we discovered dinosaurs.\n\nWhen dinosaurs were first found in the mid part,\n\nearly part of the 19th century,\n\nwe didn't know what they were.\n\nScientists didn't understand them.\n\nThey thought they were these big slow lizard like creatures.\n\nThat's how they were first reconstructed.\n\nIn 1858,\n\nthe world's first nearly complete dinosaur skeleton\n\nwas found in Southern New Jersey just eight miles from here.\n\nAnd that's when we first started to get our view\n\nof dinosaurs as these vigorous creatures.\n\nBut they were still constructed\n\nas these kind of living tripods.\n\nYou always saw the bipedal ones with two legs on the ground\n\nand then their tail resting behind them\n\nto kind of prop them up.\n\nAnd then in old reconstructions, you see the giants,\n\nthe sauropods.\n\nThey're always languishing about in swamps\n\nas though they couldn't support their great weight\n\nwith their own limbs,\n\nthat they needed the buoyancy of water.\n\nThat's not true.\n\nThe giant dinosaurs like Dreadnoughtus\n\nor Argentinosaurus were perfectly capable\n\nof walking on dry land with their four great limbs\n\nand holding their neck\n\nand their tail horizontal to the ground.\n\nYou know, one evolution that has happened\n\njust within most of our lifetimes\n\nis we can see it in the Jurassic movies.\n\nSo in Jurassic Park in 1993,\n\nthe idea that the meat-eating dinosaurs had feathers\n\nwas really just emerging.\n\nSo you see the velociraptor,\n\nit's scaly, and it's also very, very big.\n\nVelociraptor in life was lavishly feathered,\n\na fully feathered dinosaur, and it was tiny.\n\nA velociraptor skull is about that big.\n\nA velociraptor is more like a pissed-off turkey\n\nthan a giant monstrous dinosaur.\n\nIf you have a velociraptor in your kitchen,\n\nit's more of an opportunity than a problem.\n\n@TheBigNastyOne writes,\n\nHow exactly is crude oil created from fossils?\n\nHaving a hard time wrapping my brain\n\naround that biological process.\n\nWell, it starts with the smallest organism.\n\nSome people think that oil comes from dinosaurs.\n\nFossil fuel doesn't come from dinosaurs,\n\nit doesn't come from some of the largest creatures.\n\nIt actually comes from some of the smallest.\n\nIt comes from plankton,\n\nthings like diatoms and foraminifera.\n\nAnd as they rain down from the oceans or in deep lakes,\n\nthe layers accumulate and then they have to be buried.\n\nThey could be buried by more organic material\n\nor they could be buried by sand or mud.\n\nAnd then the pressure begins to increase,\n\nthe heat begins to increase, and they start to cook\n\nand they turn into what we call kerogen.\n\nKerogen is a hard component of rock.\n\nIt's the organic component.\n\nAnd if that is heated\n\nand squeezed in just the right way,\n\nit can turn into either petroleum or natural gas.\n\n@geology_johnson writes, What are the oldest fossil bones?\n\nGoogle says it's a 400-million year old fish.\n\nAre bones really that young?\n\nGeology Johnson,\n\nI really appreciate your deep time perspective\n\nbecause while 400 million years\n\nmay sound old to most people, it's really not.\n\nIf you look at the history of complex life\n\nthe last half billion years,\n\nthat's only 1/9 of Earth history.\n\nAnd yes, it's true that the first ossified bones\n\nappear in the Devonian period about 400 million years ago.\n\nAnd the first function of bones was not to create skeletons.\n\nIt was probably as a reservoir of minerals.\n\nIf you're living in the ocean and the ocean chemistry\n\nis fluctuating from one state to another,\n\nyou're going to have a tough time\n\ngetting the minerals that you need to run your metabolism.\n\nThink of bones as a chemical battery for organisms.\n\nYou can deposit minerals in a bone,\n\nand then later you can withdraw minerals from that bone.\n\nIt's only later that bones start to serve the function\n\nof support as skeletons like we have today.\n\n@TheStronkOrange writes,\n\nHow do museums make the display models for their fossils\n\nand how accurate are the displays to their fossils?\n\nI can speak best about what is happening here\n\nat the Edelman Fossil Park Museum.\n\nOur sculptor who did all of our recreations upstairs\n\nfirst starts with a 1/10 scale clay maquette\n\nof the creature he is attempting to reconstruct.\n\nAnd then he 3D scans it and then he uses a CNC machine\n\nto print out slices of it.\n\nAnd that might be for a creature\n\nthat ultimately is 55 feet longer.\n\nSo, and then all those slices are glued together\n\nand then he puts resin or other material on top of it\n\nand then sculpts the scales individually.\n\nHe says, you know, he just start at the tail\n\nand he starts sculpting scales\n\nand then a couple hundred thousand scales later,\n\nyou're done.\n\nAnd then it comes down\n\nto some really artistic judgements about it.\n\nWhat were the colors?\n\nWhat are the ornamentations?\n\nWere they shrink wrapped, where they blubbery?\n\nA lot of that stuff we don't know.\n\nBut what we do is we use modern analogs.\n\nSo for example, upstairs we have a reconstruction\n\nof a baby hadrosaur.\n\nNow, we don't know what color baby hadrosaurs were,\n\nbut what we did is we looked at what color\n\nand what is the patterning of a small forest herbivore.\n\nAnd we looked at baby tapirs.\n\nSo we gave it the colors\n\nand the pattern of a baby tapir,\n\nhoping that would at least get us\n\na little bit closer to the truth of it.\n\nAs far as the soft parts that the animals have,\n\nimagine like the cox comb of a chicken\n\nor the waddle of a turkey, those things don't preserve.\n\nAnd dinosaurs and other creatures must have had amazing\n\nand extravagant soft parts that we will never know about.\n\nA couple years ago in the Apple TV series\n\nPrehistoric Planet was about to come out,\n\nthe consulting paleontologist contacted me\n\nand he said we wanted to illustrate the point\n\nthat there are all these soft tissue features\n\nthat we may never know about.\n\nSo I decided to give Dreadnoughtus pop out air bladders\n\nin its neck.\n\nAnd so in the show, you see Dreadnoughtus\n\nand then [imitates popping]\n\nyou see these popped out air bladders.\n\nAnd he said, I'm sorry about this.\n\nIt was my decision and I realize\n\nyou're going to have to answer\n\nthe neck bladder question for the rest of your days.\n\nAnd that is actually true.\n\nEvery time I give a talk now,\n\nI get the neck bladder question and we have zero evidence\n\nthat Dreadnoughtus or any other dinosaur\n\nhad neck air bladders,\n\nbut it is an illustration of the point\n\nthat they probably had fantastic structures\n\nthat will never be preserved in the fossil record.\n\n@dino4x4 asks, What's your favorite example\n\nof conversion evolution?\n\nWell, conversion evolution means that organisms\n\nhave landed on the same adaptation\n\neven though they didn't inherit\n\nthose features from a common ancestor.\n\nSo think of the wings of a pterosaur and a bird\n\nand a dragonfly.\n\nThey all have wings,\n\nbut they did not get them from a common ancestor.\n\nThey evolved them independently\n\nbecause they were adapting to similar challenges.\n\nThink of the dorsal fin of a killer whale\n\nand the dorsal fin of a shark.\n\nDidn't get them from the same ancestor.\n\nYou can see this in dinosaurs.\n\nYou can see it in a creature like spinosaurus,\n\nwhich has a crocodile-like skull.\n\nNot a crocodile,\n\nbut it's a fish eater as are many crocodiles.\n\nAnd so it's adapting to a similar situation.\n\nAnd so the evolutionary record in biology today\n\nis just replete with examples of convergent evolution.\n\n@caffeinatedkati writes, Did you know\n\nthere's a dinosaur named Dracorex hogwartsia?\n\nYes, that was named by a paleontologist named Robert Bakker.\n\nIn this museum, we have a replica of a skull on display.\n\nDracorex hogwartsia is a bit of a controversial dinosaur.\n\nThere are many paleontologists\n\nthat think it's actually a juvenile form\n\nof this dinosaur right here called Pachycephalosaurus.\n\nEither way, whether it's a juvenile Pachycephalosaurus\n\nor its own species, it's incredible.\n\nIt's an amazing skull.\n\nThis thing looks like a dragon.\n\n@funked_up, that's funked up asks,\n\nHow would I give myself the best chance\n\nat becoming a fossil once I die?\n\nWell, you need quick burial, right?\n\nYou can't hang around on the surface\n\nwhere you're gonna weather away or become scavenged.\n\nYou need to have yourself buried\n\nin what we call a depositional basin.\n\nSo that's a place where sediment accumulates.\n\nDon't try this on a mountaintop\n\nbecause mountaintops are erosional\n\nand you will never ever turn into a fossil.\n\nTo preserve flesh or soft tissue structures,\n\nyou wanna be in an anoxic environment,\n\nmeaning one that lacks oxygen.\n\nThat way, the microbes won't decay the flesh.\n\nIf you wanna preserve the bones,\n\nyou want a lot of iron in the system.\n\nSo the iron that's dissolved in the groundwater\n\ncan go through and mineralize out in the bones\n\nand it helps stabilize the bones\n\nand it turns them into a really resistant kind of material.\n\nDon't try to become a fossil in California or Costa Rica\n\nor in Iceland because those are tectonic or volcanic areas.\n\nYou wanna be in a place like the bayous of Louisiana\n\nor the Pine Barrens of New Jersey\n\nor maybe the swamps of North Carolina,\n\nplaces that are very environmentally quiet.\n\nSo nothing is going to disturb that body\n\nas it's underground, sitting there for millions of years.\n\n@Hughes_Matt writes, How are dinosaurs' size and shapes\n\ndetermined from largely incomplete fossils?\n\nAnyone know the answer?\n\nYes, I know the answer.\n\nIt's true.\n\nMost dinosaur species are known from partial skeletons.\n\nSo for very few dinosaurs,\n\ndo we have the entire anatomy represented?\n\nSo what we do is we work with close cousins\n\nwhen we don't have a particular part of the body present.\n\nFor Dreadnoughtus, for example, we only had two\n\nof the probable 13 vertebra in its neck.\n\nAnd so to estimate the length\n\nand the proportions of its neck,\n\nwe used a close cousin from Northern Patagonia\n\nwith the unlyrical name of Futalognkosaurus.\n\nBut that dinosaur was discovered\n\nwith a nearly complete neck.\n\nAnd so we used that,\n\nand then we had very little cranial material\n\nfor Dreadnoughtus.\n\nWe just had a little piece of premaxilla and a single tooth.\n\nSo we used another close relative\n\nthat was known really only from a skull.\n\nDreadnoughtus on the other hand,\n\nhas a nearly complete tail section.\n\nSo other scientists that are working on this group\n\ncalled the Titanosaurus who find no tailbones\n\nor just a couple of tailbones\n\nare probably going to use the tail of Dreadnoughtus then\n\nto fill in the blanks.\n\nAnd so we use close cousins whenever we can.\n\n@its_me_michael writes,\n\nHow do we know what dinosaurs ate exactly\n\nif only their bones were fossilized?\n\nTeeth, mostly teeth.\n\nWe can really tell a lot about an animal's diet\n\nfrom their teeth.\n\nThis is a crocodile called the Thoracosaurus.\n\nIt lived in the Cretaceous period.\n\nIt was actually a survivor of the extinction,\n\nso it lived a little bit after the Cretaceous as well.\n\nBut look at these teeth.\n\nThey're not good for anything but murder.\n\nThese little spikes here are good for piercing flesh.\n\nAnd you see the way they're curved back like a gaff hook?\n\nIt's a fish eater.\n\nAnd so these teeth\n\nare meant to both puncture the fish's body,\n\nbut also to keep it from swimming back out.\n\nSo they all point backwards towards the gullet.\n\nIf you look at a different kind of crocodile,\n\nthis is a very rare crocodile.\n\nThis one's called Baurusuchus.\n\nAnd look at this tooth.\n\nIt has this blunt end\n\nand this is a shell crunching crocodile.\n\nIt's picking up crabs and maybe snails and things like that\n\nand crunching them between these anvil-like teeth.\n\nHere's a little shark tooth\n\nthat have serrations along the edge.\n\nSo that is clearly met for ripping flesh.\n\nSo teeth are one way, coprolite are another.\n\nCoprolite is a fancy word for fossil poop.\n\nWe have a coprolite here.\n\nIt's from we think either a turtle or a crocodile.\n\nAnd what you can do with these is you can slice them open\n\nand you can literally see this animal's last meal.\n\nSo it's direct evidence of diet.\n\nWe can also look at the isotopic signatures of teeth\n\nand bones that can tell you what type of plants\n\nit was eating.\n\nIt can tell you if it lived in a tropical\n\nor a temperate environment.\n\nAnd you can look at things like nitrogen isotopes\n\nand that can tell you where it was in the food chain.\n\nAnd so we can tell if it was a prey species\n\nthat ate only plants.\n\nIf it was an omnivore or if it was a predator.\n\nNext up, what's your favorite dinosaur?\n\nWell, I would say it's one that I discovered\n\nand spent about 10 years of my life working on,\n\nwhich I named Dreadnoughtus.\n\nAnd I say that\n\nbecause it really kind of became a member of the family.\n\nSo much of our world for that time\n\nrevolved around Dreadnoughtus.\n\nMy son grew up with Dreadnoughtus.\n\nBut I would say my favorite dinosaur\n\nthat I didn't discover is Spinosaurus,\n\nwhich was found in the Bahariya Oasis of Egypt\n\nabout 125 years ago.\n\nAnd it's this predatory dinosaur, think of a T. rex,\n\nbut kind of one that's been stretched out\n\nwith a crocodile head.\n\nLong arms with gaff hooks at the end of it,\n\nand then it has these huge six foot neural spines,\n\nwhich most people interpret as sails\n\ncould possibly be a hump as well.\n\nBut this thing lived out in a mangrove ecosystem\n\nin what is now the middle of the Sahara desert and ate fish.\n\nProbably some big fish out there.\n\nI would say maybe though my favorite fossil overall\n\nis not a dinosaur at all,\n\nbut it's one from the Cambrian period\n\nfrom the High Rockies in Canada called Pikaia.\n\nAnd Pikaia is a little tiny worm-like creature.\n\nIt's about a centimeter and a half long.\n\nIt doesn't look very tough.\n\nIt's soft and squishy,\n\nbut it has some really interesting features.\n\nPikaia has its sensory organs concentrated anteriorly.\n\nIt has bilateral symmetry.\n\nIt has a one-way digestive system,\n\nwhich I happen to think is the best kind of digestive system\n\nand has V-shaped muscles.\n\nDoes that sound like anybody you know?\n\nThat sounds like everybody you know.\n\nAnd so if it's descendants,\n\ndon't make it out of the Cambrian.\n\nThere will never be vertebrate animals.\n\nThere will never be fish or wombats or hoary bats or camels\n\nor dinosaurs or hamsters or you.\n\n@worthlesshope, first of all, that's sad, asks,\n\nWhich continents or areas\n\nare the best for finding fossil records and why is that so?\n\nWell, it depends on what you're looking for.\n\nFirst, you need rocks of the right age.\n\nIf you're looking for dinosaurs, don't look at rocks\n\nthat are older than 237 million years old.\n\nYou won't find dinosaurs.\n\nThey have to be sedimentary rocks so that a fossil can form.\n\nYou won't find fossils in an igneous rock\n\nor a metamorphic rock.\n\nAnd then today, not then, but today,\n\nit needs to be an arid environment\n\nso that you get good exposures of those rocks.\n\nThat's why you usually see us paleontologists\n\nworking in deserts and in bad lands\n\n'cause you can see the rocks,\n\nand especially in bad lands, you get enough precipitation\n\nthat it doesn't grow plants that cover the rocks,\n\nbut there's enough water in the system to cause erosion,\n\nwhich pushes back the hillside, always exposing new bones.\n\nSo you find those three things\n\nand really you just walk until you see a fossil\n\nsticking out of the rock.\n\nThat's how we do it.\n\nWe never just dig a hole and hope to get lucky.\n\nWe get ourselves in the right geological context\n\nand then we prospect just by walking.\n\n@spectrsknight writes,\n\nWhat's the best preserved dinosaur fossil\n\nthat's been found?\n\nWell, I would have to say Borealopelta\n\nfrom the tar sands of Alberta.\n\nThis is a nodosaur, which falls in a bigger group,\n\nankylosaurs, armored dinosaurs.\n\nAnd it was preserved in 3D.\n\nAnd so you can walk into a room with this dinosaur\n\nand it's like you're in a room with a dinosaur.\n\nYou can see the armor, the scales on this thing.\n\nIt's just incredible.\n\nThere's even some traces of pigment preserved\n\nand it looks like it had what we call counter shading\n\nlike you can see in sharks and whales.\n\nSo it was darker on top and lighter on the bottom.\n\nIt's found in marine sediments,\n\neven though all dinosaurs lived on land.\n\nOftentimes, nearshore marine sediments\n\ndo have terrestrial fossils.\n\nThese are what we call the bloat and float dinosaurs.\n\nThey die on a beach, they get swept out to sea.\n\nAt first they sink, but the body fills with the K gasses.\n\nThey float out to sea like a giant rotten meat booty.\n\nAnd as the carcass decays,\n\nparts of the skeletons start to drop to the sea floor.\n\n@Jacdwis writes, How long does it take to form a fossil?\n\nNot long.\n\nThe organism has to be buried very quickly\n\nand the bones have to be stabilized\n\nby minerals very quickly,\n\na process that maybe only takes weeks or months.\n\n'Cause think about it, if it took a long time,\n\nthen the processes of decay and degradation\n\nwould destroy that carcass before it turned into a fossil.\n\n@vics_linq writes, Scientists study fossilized raindrops\n\nto learn about the earth's atmosphere.\n\nWho ever thought raindrops could fossilize?\n\nIt's amazing, isn't it?\n\nThe geological record preserves the longest spans of time,\n\nbut also sometimes almost the shortest spans.\n\nRaindrops can be preserved.\n\nIndividual footsteps can be preserved.\n\nThe landings of birds and pterosaurs can be preserved.\n\nImagine how long it takes for you\n\nto make a footprint on the beach, right?\n\nJust a second.\n\nAnd if conditions are just right,\n\nthat event that occurred for one second\n\ncould be preserved for a hundred million years.\n\nIt has to be undisturbed naturally\n\nfor a small amount of time.\n\nThe chance of it happening is almost zero.\n\nBut we get to do the experiments so many times,\n\nand deep time is so vast\n\nthat even something that has an almost zero chance,\n\nbut not zero chance of occurring, ends up happening a lot.\n\nThere's a quote that I love that goes,\n\nUnlikely things are likely to happen\n\nwhen happening happens a lot.\n\n@Spiritual_Pie_8298 writes,\n\nHow can we guess from fossils how animals\n\nand other creatures from millions of years ago\n\nlived, behaved, et cetera?\n\nAnd can we at all?\n\nYes, we can.\n\nAnd more than guess, can certainly see what kind of food\n\nan animal ate from its teeth and the way its jaws hinged\n\nand the way they were processing food.\n\nYou can look at the feet and the hands.\n\nIf you have an eight-inch sickle claw\n\nlike Dryptosaurus,\n\nwell, you know that thing is a flesh ripper,\n\nand it was using that to eviscerate its prey.\n\nYou're not gonna see any sickle claw\n\non something that's eating salad all day long.\n\nYou can tell a lot about an animal's lifestyle\n\nfrom its postures.\n\nDinosaurs' feet are hinged\n\nfor straight ahead forward motion.\n\nYou know these were active vigorous creatures.\n\nContrast that with the languid,\n\nsprawling posture of something like a lizard\n\nor a crocodile with elbows and knees bent,\n\nbelly touching the ground, tail dragging behind,\n\na crocodile is always about a half a pushup away\n\nfrom taking a nap.\n\n@wetwork76 asks,\n\nDo you think all the dragon mythology\n\nwas the result of ancient civilizations\n\nfinding dinosaur fossils or are dragons real?\n\nWell, I don't think dragons are real,\n\nalthough there are some creatures like pterosaurs\n\nor Dracorex dinosaur that look a lot like dragons.\n\nBut I think what's really happening\n\nis that ancient people are encountering fossils.\n\nThey don't have any context.\n\nThey don't have any structure\n\nto interpret what they're seeing.\n\nAnd so they generate stories like humans do\n\nto explain their observations.\n\nThere's a woman named Adrienne Meor\n\nwho studies folk paleontology,\n\nand she believes that the legend of the Griffin,\n\nwhich has a lion's body and an eagle head\n\ncomes from observations of the fossils of Protoceratops.\n\nShe also thinks that the legend of the cyclops\n\nmaybe comes from miniature elephants\n\nthat used to live on the aisle of Crete.\n\nAnd if you look at an elephant's skull,\n\nthey have their nose holes, their nares coalesce together,\n\nand it's way up here, high on their head.\n\nIt looks like it has a giant eye hole\n\nright in the center of its head\n\nand thus, perhaps the legend of the cyclops.\n\n@EtherGorilla wants to know,\n\ndumb question, but why are mosasaur teeth so common?\n\nNot a dumb question and we have some right here.\n\nIn fact, we commonly find them out there\n\nin our fossil quarry.\n\nThere are many more mosasaur teeth\n\nthan there were ever mosasaurs.\n\nMosasaurs had a lot of teeth.\n\nThey produce some throughout their lifetime,\n\nand mosasaurs lived in places where sediment accumulated.\n\nAnd so when they would shed their teeth\n\nor when the whole animal would die\n\nand their skull would get buried,\n\nit was much more likely for those teeth to get buried,\n\ngiving them a chance at turning into fossils.\n\n@TreborRhurbarb writes,\n\nThey also tell us the pterosaur, basically flying dinosaur,\n\ndidn't evolve into birds,\n\nbut the dinosaurs, basically non-flying dinosaurs,\n\ndid evolve into birds\n\nand they expect us to believe this rubbish?\n\nNo, please don't believe it\n\nbecause science is not a belief system\n\nand science does not require your belief.\n\nHowever, we have a lot of evidence,\n\nI would call it a mountain of evidence now\n\nthat birds are in fact dinosaurs.\n\nWe can see it in the evolution of their skeletons\n\nand we can see it in preservation of feathers actually\n\nthat go along with some of these skeletal fines\n\nthat the first avian dinosaurs\n\nevolved around 150 million years ago\n\nand we have a really beautiful record now\n\nof the transition from non-avian to avian dinosaurs,\n\nleading right up to the birds today.\n\nA parakeet, a penguin, a ruby-throated hummingbird\n\nis a dinosaur to the same degree\n\nthat a stegosaurs or a T. rex is a dinosaur.\n\nBeing a dinosaur, just like being a mammal,\n\nis a binary condition.\n\nYou can't be half a mammal, you can't be half a dinosaur.\n\nBirds are dinosaurs.\n\nPterosaurs on the other hand,\n\nflying reptiles, not dinosaurs.\n\nIt's a branch called Ornithodira.\n\nAnd the Ornithodirans branched off\n\nbefore there was the first dinosaur.\n\nSo they don't have a dinosaur in their family.\n\nThey're not at dinosaur.\n\n@NewsParticipant writes, Do scientists have dinosaur DNA?\n\nCan you get that from fossils or...?\n\nWe do not have dinosaur DNA.\n\nDNA is a water soluble molecule,\n\nso it doesn't hang around that long in geological time.\n\nThe oldest DNA that's been recovered from an individual\n\nis about 800,000 years old.\n\nAnd the oldest DNA from the environment\n\nis about a million and a half years old.\n\nThat sounds old, but that's a long way from dinosaur time,\n\nwhich is 66 million years ago.\n\nSo we don't have dinosaur DNA,\n\nbut what we do have are dinosaur proteins and blood vessels\n\nand some other biomolecules from dinosaurs.\n\n@thatsanace ask, How big were dinosaur eggs?\n\nThey were all little.\n\nThis giant dinosaur that you see over here, Dreadnoughtus,\n\nwhich I found in South America,\n\nthat grew to be 65 tons and its eggs would've been,\n\nyou know, no bigger than maybe an ostrich egg.\n\nAll dinosaurs, when they hatched,\n\nwere no bigger than about the size of a large house cat.\n\nAnd some were even a lot smaller.\n\nAnd I think that's actually kind of one of the secrets\n\nto the success of dinosaurs.\n\nUs mammals, we scale with adult body size.\n\nA baby elephant might be 300 pounds.\n\nA baby blue whale might be 6,000 pounds.\n\nBut all dinosaurs start off small.\n\nSo a baby Dreadnoughtus like that is in its environment\n\nand it's doing tiny herbivore things at first,\n\nlike rabbit-sized things.\n\nThen it's doing sheep-sized things and cow-sized things\n\nand elephant-sized things,\n\nand then herd of elephant-sized things.\n\nSo this one species is able to capture this entire column\n\nof resources from the ecosystem.\n\nI think that has something to do\n\nwith the amazing success of the dinosaurs.\n\n@Spooky [beeps] says,\n\nSometimes I think how tortoises and gators/crocodiles\n\nare so close to being dinosaurs\n\nand it makes me emotional.\n\nLook at them go.\n\nWell, I'm super glad.\n\nLike turtles and crocodiles, I like them too,\n\nbut they're not dinosaurs.\n\nCrocodiles are the closest living relatives\n\nto dinosaurs today,\n\nbut they don't have a dinosaur in their family tree\n\nnor do the turtles.\n\nAnd if you don't have a dinosaur in your family,\n\nyou can't be a dinosaur.\n\nSo they're living cousins of dinosaurs today.\n\nThe only dinosaurs alive right now are birds.\n\nSo if you love turtles and crocodiles,\n\nyou should love birds as well 'cause they are dinosaurs.\n\n@MiguelWildlife wants to know,\n\nhow to know if a fossil was a juvenile or an adult.\n\nWe can look at what we call the bone histology,\n\nwhere you can look at the bone cells,\n\nyou can see how ordered they are,\n\nand you can plug that into a formula\n\nand you can get what we call percent senescence.\n\nSo this giant dinosaur over here, Dreadnoughtus,\n\nwhen it died, it was 65 tons.\n\nBut we got a real shock\n\nwhen we looked at the bone histology.\n\nWe could see that at the time that it died,\n\nit was growing rapidly.\n\nWe honestly don't know how big these things could get.\n\nAnother way to do it\n\nis you can look at the anatomy of the bones.\n\nSome dinosaurs, like some hadrosaurs,\n\nare born in what we would call an altricial state,\n\nlike a newbie baby robin where the bones are kind of spongy,\n\nthey're not quite articulated, they're soft,\n\nindicating that they must have received parental care.\n\nAnd then also, of course, you know, if you have multiples\n\nof a species, you can look at the size\n\nand see whether that individual is old or young.\n\n@XwhatsgoodX asks,\n\nIf the dinosaurs were annihilated by an asteroid,\n\nis there any evidence of the impact that's been discovered?\n\nOh yes.\n\nSo the crater itself has been discovered.\n\nIt's about 110 miles cross by 12 miles deep.\n\nIt sits off of Yucatan Peninsula in the Gulf of Mexico.\n\nThere's also an ejecta layer from the fallout\n\nfrom the asteroid strike\n\nthat's been found all around the world.\n\nWhen that asteroid hit, it blew the equivalent\n\nof about Massachusetts.\n\nTimes 12 miles deep into near earth orbit.\n\nAnd that material then down all over the planet.\n\nTo date, very few fossils have been found in that layer.\n\nThere's some fish scales in Belgium,\n\nthere's a mosasaur vertebra and a tooth in Poland,\n\nthere's some paddlefish and a dinosaur limb in North Dakota.\n\nThey appear to have spring pollen\n\ntrapped in their gill raker.\n\nSo we think the impact happened in the springtime.\n\nWe think it came in from the northeast\n\nat about 45 or 50 degrees.\n\nIf you were on the earth the day before the asteroid hit,\n\nyou would've thought,\n\nWell, this is how it's always gonna be.\n\nThese dinosaurs are always gonna be on top.\n\nAnd then the next day,\n\nI think they were functionally extinct\n\nfrom a cosmic accident.\n\nIt's just incredible.\n\nIt gives me shivers and makes me thrilled about the fact\n\nthat I became paleontologist.\n\nThat's it, that's all the questions.\n\nHope you learned something.\n\nUntil next time.\n\n[upbeat music]",
  "authors": [
    "Condé Nast"
  ],
  "url": "https://www.wired.com/video/watch/tech-support-paleontologist-answers-fossil-questions"
}