{
  "title": "Epstein Survivor Takes Long Pause When Asked About Trump: 'I Can't Answer That, I'm Sorry'",
  "text": "LOADING ERROR LOADING\n\nAn awkward interview this week with a Jeffrey Epstein survivor highlighted how challenging it is for these women to come forward.\n\nOn Wednesday’s episode of MS NOW’s “The Briefing With Jen Psaki,” Psaki interviewed Sharlene Rochard, a former model who said she frequented President Donald Trump’s Mar-a-Lago club when she was in her early teens.\n\nAdvertisement\n\nJeffrey Epstein survivor Sharlene Rochard on “The Briefing With Jen Psaki” on Wednesday. Screenshot MS NOW via Snapstream\n\n“How did you arrive at Mar-a-Lago?” Psaki asked Rochard, who said she also visited Epstein’s island as a very young teenager. “How did you end up going to Mar-a-Lago? Was he — did [Epstein] send you there? Were you told to go there? How did that happen?”\n\n“There were a lot of model parties at the Mar-a-Lago,” Rochard explained. “Different people would set them up, different magazines, and the limo would come, and you’d jump in the limo and you’d go.”\n\nAdvertisement\n\nRochard clarified that no one involved with Epstein had told her to go to the parties at Mar-a-Lago.\n\n“This is about so much more than one person, Jeffrey Epstein or Ghislaine Maxwell or Donald Trump,” Psaki continued. “But because Donald Trump is a person who, of course, owns Mar-a-Lago, I just have to ask if you think he was aware of that arrangement?”\n\nAt this, Rochard took a long pause.\n\n“Um, I… I don’t know if he was aware. Um, actually, I can’t answer that. I’m sorry,” Rochard said.\n\nPsaki swooped in to remind her viewers that Rochard was in her teens when she met Epstein, and then pressed on.\n\nAdvertisement\n\n“Let me ask you something else, because, again, it’s much bigger than a couple of people,” Psaki said. “Were you trafficked to other people?”\n\nAt this question, Rochard took an even longer pause. She turned to Sky and Amanda Roberts — the brother and sister-in-law of the late Epstein accuser Virginia Giuffre — who were sitting with her, and seemed unsure whether it was OK to respond to the question.\n\nAfter Amanda Roberts reassured Rochard that it was fine to “say yes, but you don’t have to name names,” Rochard turned to Psaki and apologized again.\n\nAdvertisement\n\n“You only share what you want to share,” Psaki told Rochard. “You don’t have to be sorry for anything.”\n\nSky Roberts, the brother of Epstein survivor Virginia Roberts Giuffre, and his wife, Amanda Roberts, speak outside the U.S. Capitol on Nov. 18, 2025. Amanda Roberts holds a photo of Giuffre, who died by suicide earlier this year. DANIEL HEUER via Getty Images\n\nAfter another beat, Rochard finally said, “Terrible things had happened to me within my time with… dealing with Jeffrey Epstein. I had encounters with people that I would rather not have.”\n\nAdvertisement\n\nPsaki then asked Sky Roberts to explain why Rochard — and other Epstein survivors — are hesitant to name the people who abused them.\n\n“It shouldn’t fall on the survivors’ shoulders,” he explained. “I think there’s a lot of people that just want them to release the names, like, ‘Well, you have the names, just do it.’”\n\n“The problem with that,” he continued, “is that these rich and powerful men can, A, they can sue you into homelessness, [which] would be a big part of it. But B, it puts [a] serious threat on your life and your family’s life.”\n\nAdvertisement\n\nJeffrey Epstein accuser Virginia Roberts Giuffre speaks at a press conference following a hearing in Manhattan Federal Court on Aug. 27, 2019. New York Daily News via Getty Images\n\nRoberts went on to say that there were times when his sister was “sitting across people” with “a lot of money and a lot of power” who “would push a picture of her own children in front of her, and essentially say, ‘I know where your kids go to school.’”\n\nHe added that he’s received threats, as well.\n\n“There were still names, up until the very end, that she couldn’t name because these people could — I mean, they still can — come after these survivors,” he said.\n\nAdvertisement\n\nGiuffre, who was among the first victims to speak out publicly against Epstein, died by suicide in April at age 41 after she was hospitalized following a serious accident. She began working at Mar-a-Lago as a teen before reportedly meeting Ghislaine Maxwell, Epstein’s longtime associate, who was found guilty of child sex trafficking.\n\nAfter meeting Maxwell, Giuffre said, she began giving Epstein massages that morphed into years of sexual abuse. She alleged that she was “passed around like a platter of fruit” to Epstein’s powerful friends, including Prince Andrew, whom she met in 2001. The British royal denied Guiffre’s allegations, and they settled a lawsuit out of court.\n\nIf you or someone you know needs help, call or text 988 or chat 988lifeline.org for mental health support. Additionally, you can find local mental health and crisis resources at dontcallthepolice.com. Outside of the U.S., please visit the International Association for Suicide Prevention.",
  "authors": [
    "Senior Reporter"
  ],
  "url": "https://www.huffpost.com/entry/epstein-survivor-takes-long-pause-when-asked-about-trump-i-cant-answer-that-im-sorry_n_691f4ce2e4b0448495235459?origin=top-ad-recirc"
}