{
  "title": "Cop30: dozens of countries threaten to block resolution unless it contains roadmap to fossil fuel phase-out",
  "text": "Countries supporting a phase-out of fossil fuels at the Cop30 climate summit in Brazil have threatened to block any agreement that does not include such a commitment, in a significant escalation of tensions at the crunch talks, the Guardian can reveal.\n\nThe simmering row over a potential roadmap for the “transition away from fossil fuels” boiled over on Thursday night when a group of at least 29 countries signed a strongly worded letter to Brazil, the Cop presidency. The leaked letter demanded that the roadmap be included in the outcome of the talks, which are due to end on Friday but likely to carry on into the weekend.\n\nAn option to start the process of drawing up such a roadmap was included in the first draft of a potential outcome from the two weeks of talks, published on Tuesday.\n\nBut the Guardian understands that Brazil had been planning to drop the potential resolution, in the face of opposition from some petro states, including Saudi Arabia and Russia, and some large fossil fuel consuming countries, including India.\n\nSome of the countries opposing the roadmap threatened to walk out of the talks on Thursday, before a fire broke out in part of the conference centre near the delegations’ offices and talks were suspended for more than six hours.\n\nA letter to the presidency seen by the Guardian shows that many of the governments in favour of a roadmap have set it as a “red line” for the talks.\n\nIt reads: “We cannot support an outcome that does not include a roadmap for implementing a just, orderly, and equitable transition away from fossil fuels. This expectation is shared by a vast majority of Parties, as well as by science and by the people who are watching our work closely. The world is looking to this Cop to demonstrate continuity and progress after the Global Stocktake. Anything less would inevitably be seen as a step backward.”\n\nThe global stocktake refers to the historic decision made at Cop28 in Dubai in 2023, which set out for the first time a pledge by all countries to “transition away from fossil fuels”, but set out no timeline for the transition and no measures on how to achieve it.\n\nSince that commitment was signed, some countries – chiefly Saudi Arabia – have tried to unpick it. In 2024, at the Cop29 talks in Azerbaijan, an attempt to reconfirm the commitment failed in the face of opposition.\n\nThis year, countries in favour of the phase-out took a different tack. Some started to draw up proposals for a forum in which all countries could take part, to discuss a possible roadmap for the transition. This would not require any country to sign up to a firm deadline for a phase-out, and would allow all countries to choose their own policies and pathways. The roadmap would not be completed at this Cop but would take at least a year or more of work at future Cops to be fully articulated.\n\nMore than 80 countries joined the initiative, and held a press conference on Tuesday to announce their plans.\n\nBut this was too much for the countries that are still opposed to such a commitment, led by some members of a group known as the “like-minded developing countries”, a loose grouping which includes Saudi Arabia, Egypt, Iran and Bolivia.\n\nThe Guardian understands that the signatories to the letter in favour of the phase-out of fossil fuels include: Austria, Belgium, Chile, Colombia, Costa Rica, Croatia, Czechia, Estonia, Finland, France, Germany, Guatemala, Honduras, Iceland, Ireland, Liechtenstein, Luxembourg, the Marshall Islands, México, Monaco, the Netherlands, Panamá, Palau, Slovenia, Spain, Sweden, Switzerland, the United Kingdom and Vanuatu.\n\nIrene Velez Torres, the environment minister of Colombia, told the Guardian: “The letter emerged after the presidency presented a ‘take-it-or-leave-it’ text that we believe is insufficient for the level of ambition and implementation this Cop must deliver – particularly regarding the need, clearly backed by science and by people around the world, for a roadmap to phase out fossil fuels.\n\n“This Cop’s success cannot be measured by adopting a text at any cost. The true success of this Cop lies in the quality of the outcome. Adopting a weak or empty text would signal a failure of climate multilateralism and a failure to future generations, who deserve a liveable planet.”\n\nCatherine Abreu, director of the International Climate Politics Hub, said: “It’s clear that a growing group won’t leave Belém without an ambitious package deal built on four cornerstones: money for adaptation, better quality and accountability for climate finance, a clear focus on tackling the biggest sources of climate pollution – fossil fuels and deforestation – and a commitment to drive it all with a just transition.\n\n“… The question is whether the Brazil presidency will choose to listen to them, with time running out.”\n\nThe fortnight of talks in Belém are scheduled to end on Friday evening but were delayed by the fire, which caused some damage to the venue but in which no one was hurt, and are likely to carry on into the weekend.\n\nAs the talks reach their final hours, the row over the transition away from fossil fuels is likely to dominate, but other issues also remain to be resolved, including a response to the fact that countries’ national climate plans are too weak to limit global heating to 1.5C as set out in the 2015 Paris agreement, and questions of finance, trade and transparency, and how much cash developing countries will receive to help them adapt to the impacts of the climate crisis.",
  "authors": [
    "Fiona Harvey"
  ],
  "url": "https://www.theguardian.com/environment/2025/nov/21/cop30-countries-threaten-block-resolution-unless-roadmap-to-fossil-fuel-phase-out"
}