{
  "title": "My friend only ever wants to talk about herself. Should I cut her off?",
  "text": "I have been friends with a woman for more than 20 years, who has overcome many challenges, which I admire. However, she’s constantly blindsided by people. Her husband left her, and it was a huge shock. A lot of her friends disappeared at that point as they were only interested in her husband. This surprised her. She made more effort to be my friend, and must have realised more clearly what friendship was.\n\nOver the years since, quite a few of her friends have disappeared and she isn’t sure why. Her last employer turned on her, even though she was an excellent employee, and she left without knowing what had changed.\n\nRecently we’ve both retired and are seeing each other more, but I am finding my role in the relationship is as the audience. I open topics of conversation and she changes them to what interests her. Politically, she has strong opinions. I try to suggest factchecking and alternate views.\n\nShe has been planning a holiday to a country I’ve visited many times and lived in for a while. I tried to offer insights, but this was not welcomed. She really only wanted me to confirm her choices. I’ve just returned from a month in that country and she wants to catch up, but I don’t.\n\nI don’t want to be a friend who cuts and runs without explanation, but I don’t think she will ever understand the impact of her behaviour on my self-esteem. At this point I am in avoidance mode. What should I do?\n\nYou could cut and run, but it is rarely the peaceful resolution we hope for. But confrontation with a view to resolution takes courage and willingness on both your parts.\n\nI went to UKCP-registered psychotherapist Noel Bell and he felt you should address this with your friend “especially as in the past people didn’t confront her openly and she’s been blindsided”.\n\nBell suggested this useful conflict resolution tool: “The first step is to state what typically happens in your conversations. This needs to be as factual as possible and essentially what a recording device would replay. The second is to tell her how it leaves you feeling. There should be no dispute about this. Your feelings are your feelings, after all. The third step is to ask how you are both going to change the dynamics of your friendship.”\n\nRemember, of course, that she also has a point of view, so you need to be prepared to hear that\n\nBell says you need to think about how you are going to address this with her. You could write a letter but face to face might be best. “In spite of her abrasiveness, she might be more amenable to hearing your side of the coin in person, especially if she values your friendship.” Plus, face to face lets you gauge body language, which can tell you when to push or when to pull back conversationally. “It will also allow an opportunity to answer any of her questions,” says Bell. He suggests trying to do this when you are in a relaxed and private setting.\n\nskip past newsletter promotion Sign up to Inside Saturday Free weekly newsletter The only way to get a look behind the scenes of the Saturday magazine. Sign up to get the inside story from our top writers as well as all the must-read articles and columns, delivered to your inbox every weekend. Enter your email address Sign up Privacy Notice: Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on theguardian.com to send you this newsletter. You can complete full registration at any time. For more information about how we use your data see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nOf course, your friend may dismiss everything. Some people have a “survival narrative”: they have a story about themselves they cannot let go of because their very survival depends upon it and it’s all they’ve known, and everything is everyone else’s fault. This is difficult as there is no thoroughfare with these people, only cul-de-sacs. But she may initially present like this and then think about what you’ve said. And even if you never reach a resolution, it will give you peace that you’ve been honest with her.\n\nRemember, of course, that she also has a point of view, so you need to be prepared to hear that. I have done a podcast on managing differences and a technique I learned from it is to say to the other person (once you’ve said your bit, or even before): “Now you talk and I’m going to not say anything for half an hour.” It’s wildly effective.\n\nEvery week, Annalisa Barbieri addresses a personal problem sent in by a reader. If you would like advice from Annalisa, please send your problem to ask.annalisa@theguardian.com. Annalisa regrets she cannot enter into personal correspondence. Submissions are subject to our terms and conditions. The latest series of Annalisa’s podcast is available here.",
  "authors": [
    "Annalisa Barbieri"
  ],
  "url": "https://www.theguardian.com/lifeandstyle/2025/nov/16/my-friend-only-talks-about-herself-annalisa-barbieri"
}