{
  "title": "What to Do in St. Paul and Minneapolis If You’re Here for Business (2025)",
  "text": "Minnesota is the birthplace of the supercomputer, developed for code cracking during World War II. Tech giants of their day, including Cray Research and Control Data Corporation, were based in the Twin Cities. And while Al Gore is infamously misquoted as “inventing the internet,” humble Minnesota actually can claim a role with the University of Minnesota’s early contribution of the gopher protocol in the early 1990s.\n\nThe Twin Cities sit on opposing shores of the mighty Mississippi River—Minneapolis is big brother to smaller and sleepier St. Paul—making up a metro area of approximately 3.76 million residents. The region’s tech industry spans medtech, fintech, artificial intelligence, and tech-focused agriculture companies. Minnesota is home to a number of Fortune 500 companies with deep connections to tech, including 3M, Best Buy, U.S. Bancorp, UnitedHealth Group, and Target.\n\nIf you’re a tech worker visiting the Twin Cities for business, you’ll find locals who prioritize work-life balance and embrace the area’s distinct four seasons. In the summer, it’s easy to find people on video calls while walking their dogs around the chain of lakes or enjoying happy hour on a packed patio near a body of water. In the winter, hardcore cross-country skiers and fat bikers commute to the office on area trails. For those who fear the cold, one other Minnesota invention—the skyway system—connects office buildings, shops, and residential high-rises in both downtowns.\n\nWhere to Stay in the Twin Cities\n\nMinneapolis is the larger and more modern of the Twin Cities, but there is plenty of tech-related business on the east side of town in and around St. Paul. Here's where to stay in either Twin.\n\nDowntown Minneapolis\n\nCourtesy of the Four Seasons\n\n245 Hennepin Ave., (612) 895-5700\n\nFor visitors on an expense account or looking to splurge, a stay at the Four Seasons is a top pick for its luxury and location. Minnesota’s only five-star hotel property opened in 2022 and quickly became known for its VIP scene and over-the-top amenities. Its fine-dining restaurant, Mara, was created by award-winning local chef Gavin Kaysen. During the winter, Nordic-inspired saunas and private dining spaces line the hotel’s rooftop.\n\n300 N. Washington Ave., (651) 468-0400\n\nThis boutique hotel in the trendy North Loop neighborhood offers meeting rooms and event spaces along with a rooftop bar with spectacular skyline views. It’s a popular place to plop down in the bustling lobby with a laptop or use as a home base to explore the area’s high-end restaurants, speakeasies, and entertainment venues.\n\n201 S. 11th St., (612) 746-4600\n\nHistory and architecture lovers appreciate this luxury hotel located in a 20th-century landmark building that originally opened in 1929. The hotel completed a massive renovation in 2024 and offers all the updated services and meeting rooms in a luxe environment. Connected to the skyway, its location makes it easy to visit nearby cultural icons, Orchestra Hall, and State Theatre.\n\nDowntown St. Paul\n\nSaint Paul, Minnesota - Skyline at Dusk - City Lights Photograph: Aerial Views/Getty Images\n\n26 E. Exchange St., (651) 222-0848\n\nHere’s a chance to stay in a renovated convent in the heart of St. Paul. This quirky but convenient 71-room boutique hotel was once home to the Sisters of St. Joseph of Carondelet convent and music conservatory. That history is on display throughout with many church-themed meeting spaces and networking amenities.\n\n350 Market St., (651) 292-9292\n\nSelf-described as “one of the nation’s premier historic hotels,” this elegant and charming hotel looms large in St. Paul’s compact downtown. Steps away from sports arenas, theaters, and concert venues, it’s easy to see why this hotel and its hopping restaurant and bar are popular with convention-goers, out-of-town visitors, and locals on a date night alike. Stop by the bar or lobby after a show or a Minnesota Wild home hockey game, and you’re likely to rub elbows with a band member or professional athlete.\n\nWhere to Work\n\nMinneapolis Downtown with Hennepin Avenue Bridge at Minnesota USA. Painterly look to downtown. Photograph: Saibal/Getty Images\n\n1400 Van Buren St NE, Suite 200, and 400 S. 4th St., Suite 401\n\nOriginally launched as COCO in St. Paul, this organization is known for starting the coworking scene in the Twin Cities, and Google invested in entrepreneurship programs here. The St. Paul office has since closed, and a failed rebranding has led to some confusion, but there are still two distinct operating locations that offer meeting and event areas, private offices, and a number of resources for various budgets.\n\nFive Twin Cities locations including St. Paul, Minneapolis, and St. Louis Park\n\nThe Coven made Minnesota headlines in 2018 when four advertising execs opened the first coworking office aimed directly at women, nonbinary, and transgender members. Now boasting five Twin Cities locations and additional spaces in Wisconsin and North Carolina, the franchises provide coworking areas, meeting and event rooms, drop-in desks, and community events. Day passes are available.\n\nEdina, Minneapolis, and St. Louis Park locations\n\nAnother Minnesota-headquartered company, Life Time Fitness, expanded its health club model to include luxury coworking spaces across the country in 2018 and offers three facilities in Minnesota. These popular offices lean into the healthy living concept to combine smart workspaces like ergonomic furnishings and nutritious snacks with access to the fitness facilities. Think: PowerPoint presentation followed by pickleball.\n\n225 S. Sixth St., and 729 N. Washington Ave.\n\nFor employees who already have a WeWork membership, consider these two Minneapolis downtown locations, about 2 miles apart for convenience and ease over indie charm.\n\n801 S. Marquette Ave., Suite 200, (612) 488-0644\n\nPart of the national Workbox chain, this centrally located meeting and office space offers an industrial decor with open kitchen and lounge areas, along with a rooftop terrace, fitness center, and access to the skyway system. Day passes are available.\n\nWhere to Get Your Coffee\n\nCourtesy of Fairwave Specialty Coffee Collective\n\nSix cafés in the Twin Cities including St. Paul and Minneapolis\n\nKnown as Minneapolis’ most tech-worker-friendly café chain, grab a coffee and crack open your computer at one of the many tables surrounded by plenty of outlets and powerful Wi-Fi. The North Loop (Minneapolis) location is close to coworking spots, hotels, and entertainment venues, while another Minneapolis site is located inside the Emery Hotel.\n\nMultiple locations, including Minneapolis and St. Paul\n\nFounded in Minnesota but now with shops and stands around the globe, this coffee company rivals Starbucks as a casual coworking and gathering spot. With 292 Caribou Coffee locations in Minnesota alone, make sure to confirm the correct one if meeting someone there, because it may be the other Caribou across the street.\n\n213 Fourth St., St. Paul (651) 493-4694\n\nA combo coffee shop, restaurant, bar, pinball arcade, and art gallery, this funky coffice has a number of nooks and crannies for tech working, virtual meetings, and face-to-face meetings. Located next to the Twin Cities light-rail station and across from the Union Depot transportation hub, it’s easy to get to and a fun find near the Mississippi River.\n\n4208 S. 28th Ave., Minneapolis (612) 353-4222\n\nThis micro-roaster and specialty coffee shop was born from a bike shop, and it shows. With an Up North theme, it is located near downtown and the international airport and offers decent Wi-Fi along with decadent drinks.\n\n111 E. 26th St., Minneapolis (612) 460-7739\n\nThis charming Minneapolis café in the up-and-coming Whittier neighborhood had a lofty goal of bringing beauty to the community and offers craft coffees and Japanese-style teas. Focus on work while sipping some serenity.\n\nWhere to Eat\n\nCourtesy Owamni/NATIFS.org (North American Traditional Indigenous Food Systems)\n\n420 S. First St., Minneapolis (612) 444-1846\n\nThe Twin Cities is filled with impressive ethnic restaurants, and Owamni deserves its buzz-worthy reputation three years after winning the James Beard Award for Best New Restaurant in 2022. Chef Sean Sherman, who is a member of the Oglala Lakota nation, focuses on Indigenous dishes without using colonial ingredients such as dairy, cane sugar, and wheat flour. The dishes are inventive and surprisingly satisfying. Owamni recently announced it will relocate into Minneapolis’ Guthrie Theater in 2026, making dinner and show an attractive option.\n\n825 Marquette Ave., Minneapolis (612) 339-9900\n\nAn appropriately named restaurant, Manny’s is what one conjures up when describing a “steakhouse.” For those with a corporate card and large appetite, the red-meat entrees, cocktails, and desserts here are impeccable and impressive. Voted one of the nation’s top 10 steakhouses by the Zagat Guide, expect to find visiting celebs, tech bros, and local business executives dining here nightly.\n\n3500 Cedar Ave. S., Minneapolis (612) 722-7072\n\nOn the complete opposite spectrum from upscale Manny’s, Matt’s Bar is a hole-in-the-wall must-stop for the Minnesota classic, the Jucy Lucy. There’s debate over which restaurant first introduced these molten cheese-filled hamburgers, but Matt’s has the most authentic dive-bar vibe of them all and, therefore, the best-tasting version as well.",
  "authors": [
    "Amy Nelson"
  ],
  "url": "https://www.wired.com/story/the-wired-guide-to-the-twin-cities-for-business-travelers/"
}