{
  "title": "Elon Musk lashes out at NASA’s Sean Duffy amid SpaceX moon contract uncertainty",
  "text": "Elon Musk lashed out at Transportation Secretary Sean Duffy in a series of insulting posts on his social media platform X on Tuesday, after Duffy suggested NASA may sideline SpaceX from its moon mission.\n\nMusk, SpaceX’s CEO, called Duffy “Sean Dummy,” accused him of having a “2 digit IQ” and posted sophomoric memes aimed at Duffy.\n\n“Should someone whose biggest claim to fame is climbing trees be running America’s space program?” Musk asked in a post Tuesday morning, which he pinned to his X profile. (Duffy, a former member of Congress, is a world champion lumberjack speed climber.)\n\nOn Monday, Duffy said in an interview with CNBC that he believes SpaceX, which has a $2.9 billion contract to provide the lunar lander astronauts would ride to the moon’s surface, is lagging behind schedule, potentially thwarting NASA’s efforts to return humans to the moon before China amid a new space race.\n\nA SpaceX Super Heavy booster carrying the Starship spacecraft lifts off on its 11th test flight at the company's launchpad in Starbase, Texas, on October 13. Steve Nesius/Reuters\n\n“So, I’m going to open up the contract. I’m going to let other space companies compete with SpaceX,” he said.\n\n“They do remarkable things,” Duffy told Fox News about SpaceX on Monday, “but they’re behind schedule.” NASA’s pivotal moon-landing mission, called Artemis III, is planned for as soon as mid-2027.\n\nMusk spent Tuesday morning posting about how SpaceX is “the only company to successfully human-certify a new orbital space vehicle in the US” and resposting criticisms of Duffy.\n\nMusk also responded to reporting from the Wall Street Journal that Musk ally Jared Isaacman may be back in the running to lead the agency, as Duffy jockeys to fold NASA completely under the Transportation Department. Trump had pulled Isaacman’s nomination for NASA administrator earlier this year – the same week Musk departed his role in Washington. Though Trump cited Isaacman’s “prior associations” as the reason for pulling the nomination, CNN previously reported that a faction of people in Trump’s inner circle advocated against Isaacman after Musk left Washington and shortly before Musk’s very public falling out with the President.\n\nBut Isaacman — who has twice flown to orbit on SpaceX capsules he commissioned — has reportedly been back in the running, and a source familiar with the matter confirmed he has met with Trump.\n\n“Sean Dummy is trying to kill NASA!” Musk posted on Tuesday, as well as reposting others’ praise for Isaacman.\n\nIsaacman told CNN he has “never expressed confidence about renomination at any point” and that he has “a lot of respect for Secretary Duffy and I have always enjoyed the time I’ve spent with him.”\n\nTransportation Secretary Sean Duffy speaks during a news conference at the Department of Transportation in Washington, DC, on August 26. Brian Snyder/Reuters\n\n“I’m grateful to all the supporters and to President Trump for the consideration, and most of all, I just wish to see NASA continue to shine as the world’s most accomplished space agency,” he added.\n\nIn a statement, a spokesperson for Duffy said that the transportation secretary “never said he wants to keep the (NASA) job himself.”\n\nThe spokesperson added that Duffy has suggested NASA “might benefit from being part of the Cabinet, maybe even within the Department of Transportation,” but reiterated he has not said he would like to become NASA’s permanent leader.\n\n“The President asked him to talk with potential candidates for Administrator, and he’s been happy to help by vetting people and giving his honest feedback,” the spokesperson said. “The bottom line is that Secretary Duffy is here to serve the President, and he will support whomever the President nominates.”\n\nSign up for CNN’s Wonder Theory science newsletter. Explore the universe with news on fascinating discoveries, scientific advancements and more.",
  "authors": [
    "Hadas Gold",
    "Jackie Wattles"
  ],
  "url": "https://www.cnn.com/2025/10/21/science/elon-musk-sean-duffy-nasa-spacex"
}