{
  "title": "Withings’ latest gadget combines a thermometer, pulse oximeter, EKG, and stethoscope",
  "text": "is a senior reporter and author of the Optimizer newsletter. She has more than 13 years of experience reporting on wearables, health tech, and more. Before coming to The Verge, she worked for Gizmodo and PC Magazine.\n\nPosts from this author will be added to your daily email digest and your homepage feed.\n\nWithings always shows up to CES with a futuristic health tech device in tow, and this year is no different. The company’s latest gadget is the $249.95 BeamO, a so-called multiscope that measures your temperature, takes electrocardiograms, reads blood oxygen levels, and works as a stethoscope to monitor heart and lung health.\n\nThe device itself resembles some of Withings’ other contactless thermometers, but it contains photoplethysmography (PPG) sensors, electrodes, a digital stethoscope, and a second-gen version of the infrared temperature sensor in the Withings Thermo. You’re probably more familiar with PPG sensors as the green LED you find in most smartwatches that measure heart rate by shining light into the skin. The sides of the BeamO also have electrodes to enable EKG readings for atrial fibrillation detection.\n\nLike Withings’ Thermo thermometer, the BeamO will take contactless temperature readings from the temporal artery. Image: Withings\n\nBut more interesting is how Withings has managed to stick a stethoscope into the mix. It does this by including a piezoelectric disc. The gist is the disc captures acoustic noise from your chest or back and then converts it into an electric signal that can be read by the BeamO. (This is how many electronic stethoscopes work.) The device also has a USB-C to headphone jack adaptor so you can listen in before transferring the audio to the Withings app. In telehealth sessions, you can also stream the audio directly to your provider.\n\nThese are all measurements that you can already take at home. You could buy a stethoscope, infrared thermometer, and pulse oximeter, and many smartwatches have similar single-lead EKG functions. Many wearables already let you save your data in PDFs that can be shared with doctors. The novel thing here is condensing them all into a single device that can be shared within a family.\n\nThe BeamO is a 4-in-1 device that measures temperature and blood oxygen levels and takes EKG readings. It also doubles as a stethoscope. Image: Withings\n\nOf course, there are some other factors at play, too. The EKG and AFib detection features will need to undergo the FDA clearance process. Withings says in its press release that it expects the BeamO to go on sale in June this year, but if I had a dollar for every time a health tech company failed to hit their initial FDA clearance estimates, I’d be a millionaire.\n\nIn any case, Withings has clearly invested a lot of resources in the past few years in building out its at-home health platform. The BeamO is just the latest entry in that ecosystem. It just might take a hot second before Withings can fully realize its telehealth vision.",
  "authors": [
    "Victoria Song"
  ],
  "url": "https://www.theverge.com/2024/1/7/24022955/withings-beamo-multiscope-telehealth-ces-2024"
}