{
  "title": "Gustav Klimt portrait sells for $236.4m, making it the second most expensive artwork ever sold at auction",
  "text": "A painting by Gustav Klimt has sold for a record-breaking $236.4m (£179.7m, A$364m) with fees, making it the second most expensive artwork ever sold at auction and the most expensive work of modern art sold at auction.\n\nThe six-foot-tall painting, titled Portrait of Elisabeth Lederer, was painted by the Austrian painter between 1914 and 1916 and shows Lederer, a young heiress and daughter of Klimt’s patrons, draped in a Chinese robe.\n\nSix bidders battled for 20 minutes at the Sotheby’s auction on Tuesday night in New York. Sotheby’s declined to identify the successful buyer of the painting.\n\nPortrait of Elisabeth Lederer was looted by the Nazis and nearly destroyed in a fire during the second world war, but in 1948 it was returned to Lederer’s brother Erich, who was a frequent subject of drawings and paintings by Klimt’s friend and fellow artist Egon Schiele. It remained in Erich’s possession for most of his life, until he sold it in 1983, two years before his death.\n\nIn 1985 the painting became part of the private art collection of Estée Lauder heir Leonard A Lauder, who displayed it in his Fifth Avenue home in New York but for brief periods when it was lent to galleries. Lauder died in June, aged 92.\n\nArt historian Emily Braun, who worked as Lauder’s art adviser for nearly four decades, told CNN that the painting was the jewel of his collection.\n\n“He ate lunch whenever he was at home, and lunch would be at a little round table right by the painting,” Braun said.\n\nThe painting was one of just two full-length Klimt portraits that remain in private hands.\n\nIt was predicted before Tuesday that the Klimt painting would sell for more than $150m (£114m, A$230m). But it smashed expectations to represent more than 40% of the total value of Lauder’s collection, which fetched $575.5m (£437.5m, A$885.7m) with fees.\n\nThe sale of Portrait of Elisabeth Lederer sets a new record for a Klimt painting at auction, surpassing the $108m record set by the sale of Lady with a Fan in 2023.\n\nIn 2006, Lauder’s brother Ronald paid $135m in a private sale, rather than at auction, for Klimt’s famous Portrait of Adele Bloch-Bauer 1, widely known as Woman in Gold.\n\nThe most expensive artwork ever sold at auction was Salvator Mundi by Leonardo da Vinci, which sold in 2017 for US$450.3m in 2017.\n\nAfter the auction of Lauder’s collection on Tuesday night, Sotheby’s proceeded with a wider auction of modern art that included a solid gold, fully functional toilet satirising the ultrarich.\n\nThe 101kg, 18-karat-gold toilet, titled America, was made by Maurizio Cattelan, the provocative Italian artist known for taping a banana to a wall and selling it for $5.2m. But on Tuesday, his gold toilet received only a single bid that met the asking price of $10m, or $12.1m with fees.\n\nCattelan created two solid gold toilets in 2016. The other was displayed in 2016 at New York’s Guggenheim Museum, which pointedly offered to lend it to US president Donald Trump when he asked to borrow a Van Gogh painting. It was later stolen while on display in England at Blenheim Palace.\n\nTwo men were convicted in the toilet heist, but the loo was never found. Investigators believe it probably was broken up and melted down.\n\nCattelan has said that his gold toilets satirise superwealth, once saying: “Whatever you eat, a $200 lunch or a $2 hot dog, the results are the same, toilet-wise.”",
  "authors": [
    "Sian Cain"
  ],
  "url": "https://www.theguardian.com/artanddesign/2025/nov/19/gustav-klimt-portrait-sells-for-2364m-making-it-the-second-most-expensive-artwork-sold-at-auction"
}