{
  "title": "The Frozen Pie Crusts That Pastry Chefs Swear By",
  "text": "DNY59 via Getty Images\n\nUnless you’re a professional pastry chef, you probably make just a couple of pies a year — at most. As we head into peak pie-baking season, we talked to people who bake hundreds of pies each year, and they told us about the packaged pie crusts they recommend for those moments when time is tight and the pressure is on.\n\nFirst, no one’s judging you\n\nPastry chef Zac Young, a “pastry pundit” on Food Network and owner of Sprinkletown Donuts & Ice Cream in Mashantucket, Connecticut, put it this way: ”Pie crusts are truly the supporting actress of pastry, by which I mean that a brilliant one can steal the show but a lousy one can often go unnoticed if the star — the filling — is excellent. Using premade pie crusts is one less thing for you to worry about especially when holiday entertaining, and it’s a cheat that will most often go unnoticed.”\n\nAdvertisement\n\nSara May, operations manager of Bloomsday in Philadelphia, offered absolution of the culinary variety: “If the choice is between using frozen pie crust or not having pie — well, that’s not much of a choice at all, is it?”\n\nMilk Street’s senior recipe developer, Rose Hattabaugh, summed it up: “Using a shortcut to make your life easier is never a bad idea.”\n\nThe frozen crust chefs prefer\n\nMany of the pastry chefs we spoke with encouraged everyone to try a from-scratch version, which can also be made in advance and frozen. But you’re already reading this story, so their pleas are probably falling on deaf ears.\n\nAdvertisement\n\nPastry chef Rochelle Cooper explained why: “Not only is it a women-owned business, but the quality is right up there with what professional kitchens would use.”\n\nDuFour Pastry Kitchens DuFour Pastry Kitchens offers several styles and sizes of pie crust.\n\nAdvertisement\n\nHattabaugh is also a fan. “I don’t often buy premade pie crusts, but I did have a glut of apples recently, and I picked up Dufour for an apple pie. I didn’t realize until I got home that I had actually chosen their vegan/dairy-free version. It was flaky, more like layers of phyllo dough, but it was tasty. It was a treat to have a warm pie coming out of the oven on a Monday night, so for convenience, it was a win.”\n\nMore love for Dufour came from pastry chef Becky Pendola of Chicago’s Virtue Restaurant. “They use great quality ingredients, and the crusts are nice and flaky,” she said. “I suggest folding your crust over once and rolling it out slightly more, and you’re all set for sweet or savory pies.”\n\nIf you’d like to try Dufour Pastry Kitchens’ frozen, ready-to-bake products, you can buy them directly from most Whole Foods stores and at many specialty supermarkets, gourmet shops and natural food stores. (Check for nearby stores here). Products also can be shipped directly via overnight service, with shipments made weekly on Tuesdays or Wednesdays. Call 800-439-1282 for more information about distributors in your area or to arrange for direct shipment.\n\nAdvertisement\n\nOther brands have their fans, though\n\nTV personality and chef Andrew Zimmern, host of “Field to Fire” on the Outdoor Channel, was adamant that “it’s a complete waste of time to use store-bought pie crusts from a supermarket, but if you’re buying from a bakery, that’s another matter.” He said, “I only use Dufour puff pastry or, in a dire emergency, I use the Three Babes [Bakeshop] brand.”\n\nMay suggested an old favorite: “Perhaps this is a nostalgic thing for me, but I enjoy Pillsbury’s frozen pie crust. I come from a big pie-making family, and my mom is no slouch when it comes to homemade pie crusts. But she’s also a wise woman who knows how to pick her battles and didn’t hesitate to reach for any frozen Pillsbury product when we were growing up. Pillsbury’s frozen crusts are delicious, have a nice texture, are reliably easy to work with and are generally easy to find in any supermarket.”\n\nPastry chef Pichet Ong, author of “The Sweet Spot” cookbook and pastry chef of Hiraya Café and Kayu in Washington, D.C., recently tried a frozen pie crust that exceeded expectations. “I went over to someone’s house, and they asked me to make pie on the fly,” he recalled. “I used the Happy Belly Pie Crust that they already had. It was buttery, tender and easy to use.” Happy Belly is Amazon’s private label house brand, and the crusts are available to order through Amazon Fresh.\n\nAdvertisement\n\nPemi Kanavos is a pastry chef and author who’s a big fan of Trader Joe’s brand. “It has the perfect texture and flavor — a little sweet, just the right amount of salty, and it actually tastes like butter. You can see those flaky layers, and they just melt in your mouth.”\n\nChef Tolu Eros from Ile in Los Angeles had another option: “I like Marie Callender’s pastry pie shells because they’re preservative-free, have no artificial flavors or colors and are reasonably priced.”\n\nChef Yoonjung Oh of Hive Hospitality heads right to another popular grocery store brand. “I think Kroger pie crust is a great option,” she said. “Their crusts are consistently flaky, they have a good flavor and the color is great.”\n\nAdvertisement\n\nLisa Steele, host of PBS’ ”Welcome to My Farm,” is also a fan of Pillsbury (“good old Pillsbury — just unroll them and you’re done”) and Marie Callender (“the best for deep-dish-style crusts”).\n\nSome use puff pastry instead\n\nChef Avery Ruzicka of San Francisco’s Manresa Bread skips the frozen pie crust altogether and reaches for something else. “I prefer Pepperidge Farm puff pastry instead,” she said. “Puff pastry has a higher quantity of butter compared to your typical pie dough, which is why it makes for a more flavorful store-bought option.\n\n“You come much closer to creating the buttery amazing flaky crumb and butter-forward flavor of great homemade pie dough, with the ease of a store purchase.”\n\nAdvertisement\n\nShopping tips from chefs\n\nIf you’re in the freezer aisle right now, be sure to follow these tips for choosing the best frozen pie crust. “Look for a simple list of ingredients, and make sure whatever you buy contains butter,” said pastry chef Caroline Schiff. Ruzicka added, “The simpler the ingredients, the better the flavor.”\n\nOng agreed, adding these watch-outs, and also said, “Don’t buy anything with palm oil, stabilizers or food coloring, none of which would be found in a proper pie crust recipe.”\n\nKanavos had this shopping advice: “Inspect those crusts in their own pans before buying, and don’t put them in the bottom of your shopping cart. Frozen pie crust can crack easily.”\n\nAdvertisement\n\nOnce the crusts are in your freezer, don’t forget them, she cautioned: “Check expiration dates and use within a reasonable time frame. Also remember to keep your crusts sealed and away from any strong odors in the freezer. Nobody wants their pie tasting like last week’s garlic dip.”\n\nChef hacks for working with the dough\n\n“When using a frozen crust, make sure it’s completely defrosted before you start to work with it,” May advised. “The best way to do this is to put it in the fridge overnight.” She also suggested maintaining a healthy respect for the dough. “Pie dough, whether homemade or purchased, is a sensitive creature and must be treated like the princess she is,” she said.\n\n“The crust is very finicky when it gets too warm, so don’t try to speed up the process by leaving it out at room temperature or, God forbid, using the microwave, which will leave you with a frustrating mess,” May said. “If dough starts to get tacky or sticky as you’re working with it, put it back in the fridge to chill out for five to 10 minutes. This will help to relax both the gluten in the dough and your frazzled mental state.”\n\nAdvertisement\n\nTatsiana Volkava via Getty Images Consider trying a milk or cream wash instead of an egg wash.\n\nChefs stressed the importance of placing your pie pan on a baking sheet, making it easier to move in and out of the oven and avoid filling spills. Where you put that sheet makes a difference, too, Ong said: “I like pies that have a well-baked bottom crust, so I bake on the bottom rack of the oven, on a baking stone, for even cooking.”\n\nAdd a pro touch with these quick crust tricks\n\nThe chefs also had tips to improve taste and texture: “Frozen crusts tend to dry out, so brush it with some melted butter before adding the filling,” said Curtis Stone, Michelin-starred chef of Los Angeles’ Gwen Butcher Shop & Restaurant and The Pie Room, and judge on ”Crime Scene Kitchen.” “That simple trick will help the crust retain moisture.”\n\nAdvertisement\n\nSteele said the secret is all in the presentation. “Make a lattice crust with the packaged dough, make a braid to go around the edge or do some fancy crimping. No one will ever suspect your crust isn’t homemade.”\n\n“If you’re using a refrigerated brand like Pillsbury, a personalized crimp along the edges will make it look more homemade,” Hattabaugh said. “You can cut out small shapes on the top to vent your pie and place the dough from those cuts onto the dough or around the edges, using water to seal them. I use a set of small leaf cutters for fall pies. Small hearts or circles work well, too.”\n\n“For double-crust pies, add small pieces of butter under the crust for extra flavor,” she added. “It’s a good way to add more buttery flavor to frozen crusts, which don’t usually contain much actual butter.”\n\nAdvertisement\n\nFinally, remember to ‘wash’ the crust\n\nMany recipes suggest brushing the crusts with a beaten egg, but Hattabaugh brushes her crusts with heavy cream or half-and-half instead.\n\nHer suggestion is also the preferred method for Kierin Baldwin, chef-instructor of pastry and baking arts at the Institute of Culinary Education’s New York City campus, who explained why: “To bake properly, a pie should be in the oven for about an hour. If you egg wash your pie and then bake it properly, your egg wash will start to burn long before the pie is baked through, leaving you with a choice to either bake the egg wash the right amount and underbake your crust, or burn the egg wash and properly bake the crust.\n\n“Washing with heavy cream promotes browning of the crust itself.”\n\nHuffPost and its publishing partners may receive a commission from some purchases made via links on this page. Every item is independently curated by the HuffPost Shopping team. Prices and availability are subject to change.",
  "authors": [
    "On Assignment For Huffpost"
  ],
  "url": "https://www.huffpost.com/entry/the-frozen-pie-crusts-that-pastry-chefs-swear-by-goog_l_69138e0ee4b0ff332f7dc4b0?origin=life-feed"
}