{
  "title": "Timothée Chalamet to Frankenstein: 10 of the hottest tips for the 2026 Oscars race",
  "text": "Warner Bros Pictures (Credit: Warner Bros Pictures)\n\nOne Battle After Another\n\nHow could you not love a film that has Leonardo DiCaprio running around in a bathrobe, hilariously trying to remember the password that would allow a revolutionary group to save his kidnapped daughter? A comic-action-drama with a pointed political theme, One Battle After Another is one of the year's best films and is dominating the awards conversation. Those two things don't always go together. Paul Thomas Anderson has, mysteriously, never won an Oscar, despite several best picture nominations and best director nods for Phantom Thread, There Will Be Blood and Licorice Pizza. At this point, the idea that \"he's overdue\" has kicked in. The film is certain to win a best picture nomination, Anderson could win for adapted screenplay, Leo could get another best actor nod, and Sean Penn, Benicio del Toro and Teyana Taylor are strong in the supporting categories. The film's box office may have been more sluggish than expected, but it is still, by far, the year's hottest awards contender. (CJ)\n\nFrankenstein\n\nGuillermo del Toro specialises in lavish spectacles – and Frankenstein is the most lavish of them all. It was always going to be a contender, then, for the production design, costume design and hair and make-up Oscars. But now it's coming back from the dead in other categories, too, as fans luxuriate in the film on Netflix and debate its merits online. Not only has Frankenstein become a likely best picture nominee, but there is talk of Jacob Elordi, who plays the monster, being up for an acting prize, too. The question is, in a film which tells its story first from Victor's perspective and then from the monster's, is Elordi a leading or supporting actor? (NB)\n\nCannes Film Festival (Credit: Cannes Film Festival)\n\nJafar Panahi\n\nDynamic off-screen stories never hurt an awards campaign, and the esteemed Iranian director Jafar Panahi has the year's most dramatic. Jailed twice for films that displeased the government, Panahi made It Was Just an Accident clandestinely and sent it out of Iran on a thumb drive. It went on to win the Palme d'Or, the top prize, at the Cannes Film Festival, and is now France's Oscar submission for best international film. It has a strong chance of winning because it is, in itself, a triumph. Remarkably, this drama about a former prisoner who kidnaps a man he thinks was the one who tortured him is laced with antic comedy. Panahi might also figure in best director and original screenplay categories. But other international contenders are strong too. The powerful Brazilian political drama The Secret Agent won Cannes' best director prize for Kleber Mendonça Filho and best actor for Wagner Moura. Or voters might avoid politics and go for Norway's Sentimental Value. But Panahi has years of great films behind him and has never had a better chance of winning all the way through awards season. (CJ)\n\nAmy Madigan\n\nHorror films are usually dismissed at the Oscars, but they have been so successful lately that this could be their year. Sinners and Frankenstein are sure to do well – and a campaign is building for Amy Madigan to bag a best supporting actress nomination for Zach Cregger's spine-chilling Weapons. She plays Gladys, a gloriously grotesque character who has already become a social media meme and a Halloween costume. The neatest part would be that Madigan, 75, was nominated for best supporting actress exactly 40 years, when she was in a drama called Twice in a Lifetime. That title could turn out to be weirdly appropriate. (NB)\n\nTIFF (Credit: TIFF)\n\nStellan Skarsgård\n\nStrange to say, at 74, Stellan Skarsgård might get his first Oscar nomination. He has been so solid for decades that he is often taken for granted, but he has never been better than he is in the family drama Sentimental Value as Gustav Borg, a famous, self-absorbed but never monstrous film director coming to grips with the hurt he has caused his two daughters. Skarsgård is truly the film's heart and should be considered a lead actor, but his campaign is for supporting. That puts him in a tough competition with Paul Mescal in Hamnet and Sean Penn and Benicio Del Toro in One Battle After Another, all sure things. Together these four make supporting actor one of the year's most volatile, best races to watch. Stellan, father of the actors Alexander and Bill Skarsgård, has already proven to be a refreshing hit on the campaign trail, wryly calling himself in one interview a \"nepo Daddy\". (CJ)\n\nKPop Demon Hunters\n\nEver since the first Academy Award for best animated feature was presented in 2002, most of the trophies have ended up in Pixar's offices, and the rest have been divided between Disney, DreamWorks and a couple of other studios. But the times seem to be changing: the last three animation Oscars went to Netflix (Guillermo del Toro's Pinocchio), Studio Ghibli (The Boy and the Heron) and a Latvian, French and Belgian team-up (Flow). The trend could well continue in 2026. KPop Demon Hunters began streaming on Netflix in June, and yet it was so popular that it earnt two short cinema runs – including one \"sing-along\" release. In a year when mainstream animation has stumbled (Elio, Smurfs and The Bad Guys 2 aren't going to win any prizes), could the Oscar go to a Netflix musical about a monster-hunting Korean pop group? (NB)\n\nOnce hot… now not\n\nOne rock-bottom fact about awards season: you can't count on anything. Some of the year's most anticipated films came in hot and quickly turned ice cold. The most surprising was The Smashing Machine, with Dwayne Johnson going for drama as mixed martial arts fighter Mark Kerr. The film ticks many awards boxes. It's a fact-based biopic from a respected director, Benny Safdie. It has a star known for crowd-pleasing hits proving he can really act, in what was meant to be Johnson's now-we-respect-him moment. But despite strong reviews, the film's disastrous box office put an end to all that. The other shocker was Luca Guadagnino's After the Hunt, with Julia Roberts, still a Hollywood sweetheart, playing against type as a prickly university professor caught up in scandal. Critics and audiences dismissed the film and its #MeToo plot as overwrought and dull. Both films premiered at the Venice Film Festival, usually one of the strongest launching pads for awards, so... don't count your chickens or trophies too soon. (CJ)\n\nThe Oscars nominations will be announced on 22 Jan 2026. The 98th Academy Awards will take place on 15 March.\n\n--\n\nIf you liked this story, sign up for The Essential List newsletter – a handpicked selection of features, videos and can't-miss news, delivered to your inbox twice a week.\n\nFor more Culture stories from the BBC, follow us on Facebook and Instagram.",
  "authors": [],
  "url": "https://www.bbc.com/culture/article/20251113-10-of-the-hottest-tips-for-the-2026-oscars-race"
}