{
  "title": "Blue Origin reveals a super-heavy variant of its New Glenn rocket that is taller than a Saturn V",
  "text": "Fresh off a completely successful second flight of its new mega rocket, Jeff Bezos’ space company Blue Origin has just revealed designs for an even larger version of the launch system. The new-look New Glenn will be even taller than the historic Saturn V rocket and on par with SpaceX’s Starship.\n\nThis super-heavy version of New Glenn will feature nine of the company’s rocket engines on the booster stage, and four on the upper stage. That’s up from seven and two, respectively, on the current version, which Blue Origin says will continue to fly alongside the super-heavy variant. Blue Origin is now referring to the two versions as New Glenn 9×4 and New Glenn 7×2.\n\nThat added firepower will increase the New Glenn booster’s total thrust and allow it to carry “over 70 metric tons to low-Earth orbit,” slightly below Starship’s current theoretical capacity of 100 metric tons. SpaceX is working on new versions of Starship that could double that figure.\n\nThe larger New Glenn will feature a much larger fairing (the forward-facing shield that covers the rocket’s payload) to allow bigger payloads at the top of the rocket. The added capability will put Blue Origin in play for missions centered around “mega-constellations, lunar and deep space explorations, and national security imperatives such as Golden Dome.”\n\nBlue Origin is currently competing with SpaceX to help with NASA missions to the moon, and the company is clearly teasing this capability in the rendering it released of New Glenn 9×4 on Thursday.\n\nThe illustration shows a theoretical view from the ground looking up at the new super-heavy rocket shortly after takeoff. Above the rocket, appearing larger-than-usual? The moon.\n\nThe 7×2 version of New Glenn received some updates on Thursday as well. Its total thrust has increased, and it will now feature reusable fairings. Other smaller upgrades were made in order to reduce the turnaround time between launches, according to Blue Origin.\n\nTechcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | WAITLIST NOW\n\nThe company hasn’t set a date for the next launch yet, but right now it appears to be penciled in for early 2026. According to CEO Dave Limp, Blue Origin may soon try to launch and land its uncrewed Blue Moon Mark 1 lunar lander to the moon.",
  "authors": [
    "Sean O'Kane",
    "Sr. Reporter",
    "Sarah Perez",
    "Julie Bort",
    "Lorenzo Franceschi-Bicchierai",
    "Ram Iyer",
    "Connie Loizos",
    "Anthony Ha",
    "Rebecca Bellan",
    "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var"
  ],
  "url": "https://techcrunch.com/2025/11/20/blue-origin-reveals-a-super-heavy-variant-of-its-new-glenn-rocket-that-is-taller-than-a-saturn-v/"
}