{
  "title": "Mulatu Astatke review – father of Ethio-jazz still innovating during farewell tour",
  "text": "Absolutely nothing about this set feels predictable: at 81, Mulatu Astatke is still pushing the boundaries of genre. Even on his farewell tour, there is no easing in, either. The father of Ethio-jazz and his band immediately play Tsome Diguwa as if conjuring a thunderstorm, which in turn crashes straight into Zèlèsègna Dèwèl, a piece written in the 4th-century Ethiopian tradition, its harmonic minor tonality sounding almost Arabic.\n\nAstatke has a serious demeanour. Unsentimental, he speaks only to introduce songs or instruct the band like a schoolteacher. But he views his vibraphone with care and bewilderment, playing with intense familiarity yet almost as though discovering it for the first time. His fascination with his instrument holds the audience captive in turn. During Yèkèrmo Sèw – which fittingly translates to “a man of experience and wisdom” – Astatke’s solo fills the room, water-like in its shapeshifting.\n\nThe set is equally a showcase for his band. That song, as well as Nètsanèt, highlight their instrumental range and individual capabilities, with solos from James Arben (saxophone), Byron Wallen (trumpet), Danny Keane (plucking cello) and Alexander Hawkins (grand piano). For Kulun, an Ethiopian wedding song, two Ethiopian musicians join the ensemble, playing a masinko (a single-stringed, bowed, lute-like instrument) and a krar (a five-stringed, plucked lyre), and two dancers in traditional outfits also enter to the delight of the crowd. For Azmari and Chik Chikka, technical and highly experimental solos from Keane and John Edwards (double bass) are interspersed with dance breaks.\n\nView image in fullscreen Photograph: Sonja Horsman/The Guardian\n\nIt’s a set rich in sensation. Edwards rubs the double bass body creating a cat-like screech, or drags the bow in an exact replica of a yawn. Richard Baker provides West African percussion astride conga drums, Saworo bells (a selection of traditional hunter’s bells and beer bottle tops), metal bells (Adodo, Apitua, Aja Orisa) and dùndún “talking” drum, creating rich texture throughout. For Yègellé Tezeta, he also sings in Yoruba in call-and-response with Edwards’ conversational bass. Astatke introduces the penultimate song, Mulatu, as “a piece I composed for myself”: it sounds like a wandering train of thought with glittering bells and mystical keyboard.\n\nThere’s a rousing encore in Yèkatit. Where you might expect its crescendo to be resolved in a crash of drums, instead, Astatke guides drummer Ben Brown in a muted, controlled whisper of cymbals. It’s true to the reputation Astatke has built over his five-decade career: a whirlwind of experimentation and excitement, but always with deliberation and control.\n\nskip past newsletter promotion Sign up to Sleeve Notes Free weekly newsletter Get music news, bold reviews and unexpected extras. Every genre, every era, every week Enter your email address Sign up Privacy Notice: Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on theguardian.com to send you this newsletter. You can complete full registration at any time. For more information about how we use your data see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion",
  "authors": [
    "Mahika Ravi Shankar"
  ],
  "url": "https://www.theguardian.com/music/2025/nov/17/mulatu-astatke-review-ethio-jazz-ljf-southbank-centre-royal-festival-hall"
}