{
  "title": "Ultra-processed food is global health threat, experts warn",
  "text": "Ultra-processed food is global health threat, experts warn\n\n2 days ago Share Save Philippa Roxby Health reporter Share Save\n\nGetty Images\n\nAction is needed now to reduce ultra-processed food (UPF) in diets worldwide because of their threat to health, say international experts in a global review of research. They say the way we eat is changing - with a move away from fresh, whole foods to cheap, highly-processed meals - which is increasing our risk of a range of chronic diseases, including obesity and depression. Writing in The Lancet, the researchers say governments need \"to step up\" and introduce warnings and higher taxes on UPF products, to help fund access to more nutritious foods. However some scientists say this review can not prove that UPFs directly cause health harms and more research and trials are needed to show that.\n\nUltra-processed foods are defined as containing more than five ingredients you would not find at home in your kitchen cupboard, such as emulsifiers, preservatives, additives, dyes and sweeteners. Examples of UPFs include sausages, crisps, pastries, biscuits, instant soups, fizzy drinks, ice cream and supermarket bread. Surveys indicate these industrially-manufactured foods are on the rise in diets around the world, worsening the quality of what we eat with too much sugar and unhealthy fats and a lack of fibre and protein. This review of evidence on the impact of UPFs on health, carried out by 43 global experts and based on 104 long-term studies, suggests these foods are linked to a greater risk of 12 health conditions. These include type 2 diabetes, cardiovascular disease, kidney disease, depression and dying prematurely from any cause. Review author Prof Carlos Monteiro, from the University of Sao Paulo in Brazil, who set up the Nova classification system for categorising food, said the growing consumption of ultra-processed foods \"is reshaping diets worldwide, displacing fresh and minimally processed foods and meals\". \"This change in what people eat is fuelled by powerful global corporations who generate huge profits by prioritising ultra-processed products, supported by extensive marketing and political lobbying to stop effective public health policies to support healthy eating,\" he added. Co-author Dr Phillip Baker, from the University of Sydney, said the answer was \"a strong global public health response - like the coordinated efforts to challenge the tobacco industry\". The review acknowledges a lack of clinical trials showing exactly how UPFs damage health - but says that should not delay action to protect people worldwide from potential health harms.",
  "authors": [],
  "url": "https://www.bbc.com/news/articles/cy4pjjzd784o"
}