{
  "title": "The Steam Frame is a surprising new twist on VR",
  "text": "is a senior reporter covering technology, gaming, and more. He joined The Verge in 2019 after nearly two years at Techmeme.\n\nPosts from this author will be added to your daily email digest and your homepage feed.\n\nValve is about to launch a new virtual reality headset, and with it, a comprehensive new approach to what a VR device should be. Most VR headsets I’ve tried have ended up collecting dust after the novelty wore off, and I thought I had sworn off VR for good. But after trying Valve’s new headset for myself at the company’s headquarters, I was nearly ready to put down my credit card before I walked out the door.\n\nThe new headset is called the Steam Frame, and it’s trying to do several things at once. It’s a standalone VR headset with a smartphone-caliber Arm chip inside that lets you play flat-screen Windows games locally off the onboard storage or a microSD card. But the Frame’s arguably bigger trick is that it can stream games directly to the headset, bypassing your unreliable home Wi-Fi by using a short-range, high-bandwidth wireless dongle that plugs into your gaming PC. And its new controllers are packed with all the buttons and inputs you need for both flat-screen games and VR games.\n\nThe pitch: Either locally or over streaming, you can play every game in your Steam library on this lightweight headset, no cord required. I think Valve may be on to something.\n\nThe Verge’s Sean Hollister wearing the Steam Frame. Photo by Everything Time Studio / The Verge\n\nAs I explored an industrial level in Half-Life: Alyx, jumping from floor to floor and blasting headcrabs, I couldn’t tell at all that the game was being streamed to me from a nearby PC. I felt like I was playing it through a hardwired connection or natively on the headset itself.\n\nThe dongle, which comes in the box with the headset, streams your games over 6GHz spectrum — that’s its only job. It means that the experience has “low latency, high bandwidth, and lots of robustness,” Valve hardware engineer Jeremy Selan tells The Verge.\n\nThe Steam Frame’s box, which contains the headset itself, its wireless controllers, and its wireless adapter. Photo by Everything Time Studio / The Verge\n\nWhen you’re streaming, to make what you’re looking at appear sharp and with low latency, the Frame uses a technique Valve calls “foveated streaming.”\n\nYou might be familiar with foveated rendering, which, in VR, enhances what’s directly in front of your eyes and lowers the resolution in your peripheral vision to optimize the performance of a headset. With foveated streaming, the Frame instead uses its two eye-tracking cameras to make it easier to sling compressed images from your PC. “Anywhere the user is looking, we spend as many bits as possible to give them a very high-fidelity, super-high-quality representation of where they’re looking, and we’ve borrowed those bits from everywhere else in the image,” Selan says.\n\nIt’s “always on and always active,” so game developers don’t have to do anything to make it work. The headset checks the position of your eyes more than 80 times a second.\n\nThat finger is pointing to a microSD card slot. If your Steam library from your Steam Deck or Steam Machine is on a microSD card, you can drop it into that slot to access your library right away. Photo by Everything Time Studio / The Verge\n\nAt one point, Valve staffers entered a special command that placed a square in front of wherever my eyes were focused. While it was on, I couldn’t tell that the bits around the square were lower-fidelity, and as I whipped my eyes all over the virtual room, the square kept up without any discernible lag.\n\nIt was extremely impressive, and it means that, depending on your PC, the Frame could let you play high-end VR games on a light headset. The Frame weighs 440 grams with the headset and battery strap, roughly half as much as the approximately 809-gram Valve Index, which, unlike the Frame, also needed to be physically wired to a PC. Valve’s headset is also lighter than the 560-gram PSVR 2 and the 515-gram Meta Quest 3.\n\nThe Steam Frame’s headband can pop off from the core unit. Photo by Everything Time Studio / The Verge\n\nIt’s nice to wear right out of the box, too, with an especially plush and silky face cushion and well-balanced counterweight thanks to the battery being placed on the back of the head strap. The strap also contains speakers — two per side, Valve says, spaced apart so they can cancel out their own vibrations before they affect the headset’s positioning sensors.\n\nThe comfort might come at the cost of performance, though. While it might seem like a Steam Deck for your face, the Frame won’t hit Steam Deck-levels of performance and battery when you’re playing on its own lightweight Arm system.\n\nThe Frame runs SteamOS on a last-generation phone chip, the Snapdragon 8 Gen 3, and it has to recompile Windows x86 game code on the fly using an emulator, named Fex, to let titles run on Arm. (Valve is welcoming Android games into Steam so you can play on the Frame, too — and you’ll be able to sideload APKs as well, the company confirmed to Gamers Nexus.) And at 21.6 watt-hours, the Frame’s battery is about half the capacity of an original Steam Deck, though you can plug any sufficiently powerful USB-C battery (45W) into the headset to extend its life. Valve is working to make streaming battery life “as efficient as possible,” Selan says, though playing six hours of Hades II over streaming would be “unlikely.”\n\nThe Steam Frame from the side. Valve told us this headset was indeed codenamed Deckard during development. Photo by Everything Time Studio / The Verge\n\nIn one demo, I played the standard x86 version of Hades II installed on the Frame on a big, 2D virtual theater screen, and I noticed a couple small gameplay stutters I never see on my Steam Deck or my Nintendo Switch 2. In a later demo of Hollow Knight: Silksong, I noticed more stutters right away — and to my surprise, a Valve employee brought them up proactively, calling them “hitches.”\n\nAccording to Valve hardware engineer Gabe Rowe, the company plans to let you download preconverted versions of the code when you start up a game to help get rid of those hitches, similar to how the Steam Deck downloads precompiled shaders for many games before you even launch them.\n\nRight now, the performance in those games felt a little worrying, and I didn’t get to try anything that might tax the headset even further. However, Selan told us after our visit that the choppiness we saw was actually a bug and that Valve expects performance and stability to improve leading up to and after launch.\n\nValve is also planning a Steam Frame Verified program, like the Steam Deck Verified program that adds green checkmark on the Steam store pages of games that play well on the Steam Deck with no modifications, so you can know which games run well locally.\n\nBut playing games locally isn’t the main point of the device — it’s mostly designed for streaming.\n\n“Steam Frame is a wireless streaming headset, first and foremost,” designer Lawrence Yang tells The Verge. “That is what we’ve optimized a lot of things and a lot of decisions around, not only for hardware, but also in terms of software.”\n\nValve’s Steam Frame Wireless Adapter plugged into a PC. Photo by Everything Time Studio / The Verge\n\nAssuming Valve gets the issues worked out, the Frame could be a decent place to locally play lower-end games. Most of the time, it seems like you’re going to want to stream your games from a PC to the headset instead.\n\nRegardless of how you boot up your games on the Frame, its two new included controllers should give you everything you need to actually play them. Between the controllers, you have access to two drift-resistant TMR joysticks, a D-pad, four face buttons, two bumpers, and two shoulder triggers, all of which should serve you well for flat-screen games. For more immersive VR games, the controllers also have two triggers on the grips and enough sensors to enable five-finger capacitive sensing. The controllers run off of AA batteries, and Valve says they can get up to 40 hours of battery life. (The headset supports Valve’s new Steam Controller, too.)\n\nThe Steam Frame Controllers have 18 infrared LEDs to help with tracking. Photo by Everything Time Studio / The Verge\n\nValve isn’t sharing a price for the Frame yet. The company plans to reveal that in early 2026, and it’s only telling us that it’s targeting a price that’s less than an Index — Valve’s previous headset, which cost $999. But there are other hints that Valve’s new headset won’t be as expensive as competitors.\n\nWhile the Frame does have pancake lenses with an up-to-110-degree field of view and LCD screens with a 2160 x 2160 per eye resolution, that’s no longer class-leading. The Frame offers monochrome passthrough, but Apple’s and Samsung’s expensive headsets have more impressive micro-OLED displays and color passthrough, which can help with more immersive mixed reality experiences. Even the $299.99 Meta Quest 3S has color passthrough and outward IR illuminators so it can track in dark rooms.\n\nPrevious Next\n\n\n\n1 / 3 A Steam Frame prototype with a clear case. Valve isn’t selling this version, unfortunately. Photo by Everything Time Studio / The Verge\n\nThe Frame’s four outward-facing monochrome cameras and IR illuminator seem to provide excellent tracking, though in a brief demo, the black-and-white passthrough view wasn’t useful for much except getting a general idea of my surroundings. Rowe says sticking with monochrome passthrough was an intentional choice because color passthrough would have added to the Frame’s price. “The core focus of the device is the gaming,” Rowe says.\n\nFor those who want color passthrough and other changes to the headset, Valve has made its headset modular, including a dedicated expansion port in the nose piece designed to support extra cameras. The expansion port offers 2.5Gbps of bandwidth via MIPI and one lane of PCIe data.\n\nWe answered your burning questions about Valve’s new hardware. We hosted a subscriber-exclusive AMA about the Steam Machine, Steam Frame, and Steam Controller, and you can check out our responses here.\n\nThe entire core compute module is modular as well. While Valve has nothing to announce right now, Selan suggests that people might want to have things like a hot-swappable battery, a battery in a different location, or different styles of audio, and says it’s “very easy to imagine” that with the Frame’s modular design, “we would be able to accommodate those different needs in the future.”\n\nValve plans to share specs and external CAD files so that people can make accessories for the port and alternate head straps. There will also be a partner program for companies that want to sell official accessories.\n\nThis is where the expansion port is. Photo by Everything Time Studio / The Verge\n\nBut right now, that modularity is just a footnote about the Frame. This device, at least from what we’ve seen, is much more a flexible vehicle to play your existing library of Steam games.\n\nI said at the top of this piece that I was nearly ready to put down my credit card for the Steam Frame. I’m still not sure if I’d prefer kicking back at home with Hades II on the Frame’s screen instead of on my Steam Deck or on a TV. But the Frame seems like a winning combination of ingredients that just make it a nice place to play Steam games — and it won’t require a physical tether. That might be enough to make it my first VR headset that doesn’t just gather dust.\n\nUpdate, November 12th: Added confirmation from Gamers Nexus that you’ll be able to sideload Android APKs.",
  "authors": [
    "Jay Peters"
  ],
  "url": "https://www.theverge.com/games/816118/valve-steam-frame-vr-headset-streaming-arm-steamos-hands-on"
}