{
  "title": "The Scouse Christmas Carol review – knockabout comedy with a potty mouth",
  "text": "Whether it’s Paul Hilton at London’s Old Vic this winter or Marti Pellow in Glasgow next year, you’re never far from a Scrooge during the festive season. Only one of them, however, will strip down to his long johns as he sings I’m Too Sexy by Right Said Fred.\n\nAt Liverpool’s Royal Court they do things differently. With his brushed back mane of silvery hair, Paul Duckworth’s Scrooge is not just miserly, he is also libidinous and foul-mouthed, not to mention being a hot shot on the harmonica.\n\nOn top of that, he is actively corrupt. His colleague Jacob Marley has mysteriously disappeared and Scrooge, having doctored the will, stands to inherit his biscuit factory. The joke about Jacob’s cream crackers is the first of many a biscuit pun.\n\nView image in fullscreen Formidable vocals … Lindzi Germain, left, as Barbara in The Scouse Christmas Carol. Photograph: AB Photography\n\nMarley’s widow Barbara (Lindzi Germain) reckons something is afoot, which means, in this telling by Kevin Fearon, the ghosts of Christmas past, present and future are less the supernatural visitations imagined by Dickens and more a ruse to flush out Scrooge. His drunken sleep is disturbed by the Garston ghost busters, merrily squirting water into the audience from their proton guns and scaring him into coming clean.\n\nSurprisingly, the more the show pulls in its own wayward direction, the more the original asserts itself. Cross out the knockabout antics and the romantic subplots (turns out Scrooge and Barbara have history) and you are back to a wholesome message about generosity and community spirit. No harm in that, but the focus on rattling out the story does lower the joke count, especially as too often we get a swear word where we expect a gag to be.\n\nThe exuberance of Mark Chatterton’s cast covers up the cracks. If they deserve better material than this, they are not going to let it show. Whether it is a doe-eyed Lenny Wood as Bob Scratchitt or a multitasking Keddy Sutton as everything from a housekeeper to a mayor, they all feed into a high-energy ensemble. Gluing the show together are the song-and-dance numbers powered by Ben Gladwin’s live band and Beverley Norris-Edmunds’ choreography, not forgetting Germain’s formidable vocals on the big ballads.",
  "authors": [
    "Mark Fisher"
  ],
  "url": "https://www.theguardian.com/stage/2025/nov/20/the-scouse-christmas-carol-review-royal-court-theatre-liverpool"
}