{
  "title": "Rabih Alameddine wins National book award for fiction with darkly comic epic spanning six decades",
  "text": "Rabih Alameddine has won the National book award for fiction for The True True Story of Raja the Gullible (and His Mother), a darkly comic saga spanning six decades in the life of a Lebanese family.\n\nThe novel, which traverses a sprawling history of Lebanon including its civil war and economic collapse, is told through the eyes of its titular protagonist: a gay 63-year-old philosophy teacher confronting his past and his relationship with his mother and his homeland.\n\nTrue to his irreverent style, Alameddine, on stage, thanked his psychiatrist, his gastrointestinal doctors and his drug dealers. “I shouldn’t say more about that,” he cracked.\n\nElsewhere in his acceptance speech, Alameddine reckoned with crises in both Gaza and the US.\n\n“This morning I saw two videos,” he said. “One was of an ICE agent. The woman was on the asphalt, zip-tied. He came over and zapped her, and then carried her like garbage and threw her in the back of the SUV.”\n\nThe second video, he continued, showed “a Palestinian refugee camp in Lebanon that was bombed and 12 people died. And I kept thinking: they make a desolation and call it a ceasefire. Sometimes, as writers, we have to say: enough.”\n\nAlameddine’s speech on Wednesday night capped off a ceremony filled with politically potent victories. Many winners – like those in the past two years – used their speeches to reflect on the role of literature in the face of global tragedy.\n\n“It’s very difficult to think in celebratory terms about a book that was written in response to a genocide,” said Omar El Akkad, who won the nonfiction prize for One Day, Everyone Will Have Always Been Against This. The Egyptian-Canadian author’s book is a treatise on the western response to Israel’s war on Gaza.\n\n“It’s difficult to think in celebratory terms when I have spent two years seeing what shrapnel does to a child’s body,” he said. “When I know my tax money is doing this, and that many of my elected representatives happily support it.”\n\nEl Akkad was one of three winners recognized by the first time by the National book award. Each of the five categories came with a $10,000 prize.\n\nThe translated literature award went to We Are Green and Trembling by the Argentinian writer and first-time nominee Gabriela Cabezón Cámara, translated from Spanish by Robin Myers.\n\n“I’m gonna speak in Spanish because there are fascists who don’t like that,” Cabezón Cámara said to uproarious applause.\n\nAnother first-time nominee, Daniel Nayeri, won the young people’s literature award for The Teacher of Nomad Land, the story of two orphaned Iranian siblings in the second world war.\n\nThe poetry prize went to Patricia Smith for The Intentions of Thunder, a collection centered around the beauty and brutality of the Black experience in the US. She had previously been a poetry finalist in 2008 for her book Blood Dazzler.\n\nThe ceremony, which took place at Cipriani Wall Street and featured a performance from Corinne Bailey Rae, also included the presentation of two previously announced lifetime achievement awards to Roxane Gay and George Saunders.\n\nSaunders, in a galvanising speech, called on the power of writing to dispel the myth of absolute power. “Bullies, autocrats, zealots … they always know. They’re completely sure,” he said.\n\n“But we artists … have an advantage over autocrats because [we’re] in that not-knowing state. This puts us in a less delusional relationship with reality. And the less delusion, the less suffering we cause.”\n\nThe True True Story of Raja the Gullible (and His Mother) by Rabih Alameddine (Little, Brown Book Group, £22). To support the Guardian, order your copy at guardianbookshop.com. Delivery charges may apply.",
  "authors": [
    "Michael Sun"
  ],
  "url": "https://www.theguardian.com/books/2025/nov/20/rabih-alameddine-wins-national-book-award-for-fiction-with-darkly-comic-epic-spanning-six-decades"
}