{
  "title": "Adrienne Bunn Is Everything RFK Jr. Says People With Autism Can’t Be",
  "text": "Approaching a year into Donald Trump’s second stint in the White House, you’d think we’d be used to his (and his entourage’s) political theater. The outlandish claims, the finger-pointing, the headlines engineered to make us spit out our coffee. It’s all part of the show.\n\nBut every now and then, something lands differently — something so careless and cruel that it makes your jaw drop and your chest burn with anger. Earlier this year, one of those moments came from from Health and Human Services Secretary Robert F. Kennedy Jr.\n\nStanding at a press conference, Kennedy decided to reduce an entire demographic to a single, warped stereotype. Kids with autism, he declared, will “never pay taxes,” “hold a job,” or “play baseball,” and, in perhaps the most callous stroke, “many of them will never use a toilet unassisted.”\n\nAdvertisement\n\nHis words weren’t just false, they were incredibly insulting. They erased the complexity, the capability and the possibility of a community that deserves to be seen in full color. They gave oxygen to the stigma that individuals with autism already fight against every day. And they ignored the fact that autism is a spectrum. While some people with autism need more support, many are living independent, dynamic, ambitious lives. Nobody embodies that reality more vividly than Adrienne Bunn.\n\nAt 19 years old, Bunn became the youngest known woman with autism — and the youngest woman, period — to complete the Ironman World Championship in Kona, Hawaii. That’s a 2.4-mile ocean swim, 112 miles on the bike, and a full marathon under the intense Hawaiian sun, all in one day. Though Kennedy stood behind a podium to dismiss futures, Bunn proved him wrong mile after mile, stroke after stroke, step after step.\n\nHer journey to the Kona finish line began far from the Hawaiian sun. Born and raised in Florida, Bunn did not speak until she was 4 and was diagnosed with autism shortly after her parents took her to a doctor. The prognosis was heavy, saying she might never live independently, attend college or even drive a car.\n\nAdvertisement\n\n“Doctors can often feel like the enemy when it comes to autism and other neurodivergent conditions,” says Bunn. “Too many families feel dismissed and unheard,” but her parents refused to let those predictions define them. They raised Bunn like her siblings or any other child, making sure she was not sheltered or coddled, which gave her the freedom to grow, explore and discover her own strengths.\n\nSo when the specialist who diagnosed Bunn recommended therapeutic horseback riding at age 4, her parents jumped on it. Horses became her first form of therapy, teaching her balance, giving her social cues, and helping her find her voice. Running came next, sparked by a PE teacher who handed out little plastic feet charms for every lap around the parking lot. Bunn collected so many that her necklace jingled and clattered against her chest as she ran. “That’s when I really fell in love with running,” she tells me.\n\nAt 13, she joined a Special Olympics pilot program for triathlon. She was the first and only girl in the program, and while running came naturally, swimming and biking were completely new. “None of us really knew what a triathlon was,” she laughed. “My parents didn’t have a clue either, but I said, ‘Sure, why not.’” Running remained her strength, but swimming long distances and learning to manage the bike, including switching gears and pacing, was all a new challenge, though one she was more than capable and willing to take on.\n\nAdvertisement\n\nA little later in her athletic career, coach Doug Guthrie entered the picture; he taught Adrienne not just the mechanics of triathlon but how to navigate the sensory and physical hurdles her autism presented. Loud noises, sudden movement and disorderly race environments could be overwhelming, but with Guthrie’s guidance, Adrienne learned strategies to manage them and stay confident on the course.\n\n“The Ironman Foundation does a great job of welcoming athletes with physical and intellectual disabilities with their PC/ID category,” says Bunn, giving due credit to Guthrie, who taught her to “stay focused even when everything around me is chaotic.”\n\nHer autism presented unique challenges — the road was anything but easy. “My autism shows up a lot in sensory ways,” Bunn says. “Cars passing on the road can set me off, and races can be overwhelming, like cannons or sudden noises from behind.” But this never defined her limits. Instead, it became another factor to understand and work with, allowing her to channel her determination and love for running into a sport she had never imagined mastering.\n\nAdvertisement\n\nThat leap of trust, joining the pilot program and learning from Guthrie, carried Bunn all the way to Kona, where she would make history.\n\nTo manage the chaos, she often races with guides who keep her focused, pace her nutrition and warn her when a loud start is coming. And then there’s the training, which would exhaust even the most seasoned athlete. “I wake up at 3 a.m., swim at 5, run around 7, then head to class.” She says it so matter-of-factly, as if the grueling schedule is just another ordinary part of her day. And that’s only the first half of her day.\n\nWhen she crossed the finish line in Kona last year, hand-in-hand with her coach, her family cheering from the sidelines, it wasn’t just a personal victory — it was a public rebuttal. “It was a dream come true,” she says. “I was just over the moon.” Her presence on that course shattered myths, not just Kennedy’s but the broader ones society clings to about autism.\n\nAdvertisement\n\nBecause Adrienne’s autism is not a deficit. It is part of what makes her extraordinary. “Autism isn’t something to ‘prevent,’” she says. “It’s an ability. It just means we learn differently. I think people with autism are some of the smartest people alive because we can hyperfocus.”\n\nThat hyperfocus, paired with an iron will, has carried her into a life Kennedy — or any other ill-informed observers who spew misconceptions — could never imagine for her. Bunn is now in college. She’s training for her second Kona this fall. She has a boyfriend. She has ambitions, routines, dreams. She is doing all the things she was told she couldn’t. And she’s doing them better, faster and stronger than most people her age.\n\nWhen asked what advice she’d give to others with autism, she didn’t hesitate: “Always show up, never make excuses, and keep a positive mindset. Don’t let anyone tell you that you can’t do it.”\n\nAdvertisement",
  "authors": [
    "Contributing Writer"
  ],
  "url": "https://www.huffpost.com/entry/adrienne-bunn-defies-rfk-autism-stereotype_n_68e6aceee4b07aeeb1958ea4"
}