{
  "title": "Say it with me: Windows is the problem with Windows handhelds",
  "text": "is a senior editor and founding member of The Verge who covers gadgets, games, and toys. He spent 15 years editing the likes of CNET, Gizmodo, and Engadget.\n\nPosts from this author will be added to your daily email digest and your homepage feed.\n\nIt’s been nearly two weeks since Microsoft, a multi-trillion dollar company, shipped a $600 handheld “Xbox” that can’t be relied on to sleep, wake, or hold a charge while asleep in my tests. Neither Microsoft nor Asus would admit there’s a problem with the white Xbox Ally or offer a timeline to fix it after repeated requests by The Verge. (Asus tells me it needs more time to test.)\n\nBut if you want your white Asus handheld to start working reliably, you could do what I did: I installed the latest build of Bazzite, a SteamOS-like, Linux-based operating system that works properly with gamepad controls, and sleeps like a dream. I didn’t need to hibernate or shut down once this past weekend as I blazed through hours of Silksong and finally triumphed in a tough boss fight.\n\nDid I mention Bazzite runs most of my Windows games substantially faster than Windows?\n\nBazzite vs. Windows vs. Deck OLED Game and power mode Xbox Ally (Bazzite) Xbox Ally (Win 11) Bazzite vs. Windows Steam Deck OLED Xbox Ally X (Z2E) Cyberpunk 2077, 15-watt TDP 48 39 23.08% 50 51 20-watt TDP 53 41 29.27% 69 25-watt TDP 73 30-watt TDP 75 35-watt TDP 75 Plugged in 54 43 25.58% 50 77 DX: Mankind Divided, 15-watt TDP 67 55 21.82% 64 75 20-watt TDP 72 58 24.14% 92 25-watt TDP 93 30-watt TDP 93 35-watt TDP 93 Plugged in 72 58 24.14% 64 106 Returnal, 15-watt TDP 20 24 -16.67% 25 42 20-watt TDP 21 26 -19.23% 47 25-watt TDP 50 30-watt TDP 51 35-watt TDP 50 Plugged in 21 26 -19.23% 25 51 Shadow of the Tomb Raider, 15-watt TDP 59 51 15.69% 60 68 20-watt TDP 63 55 14.55% 75 25-watt TDP 76 30-watt TDP 77 35-watt TDP 76 Plugged in 64 55 16.36% 60 83 HZD Remastered, 15-watt TDP 33 26 26.92% 34 29 20-watt TDP 36 27 33.33% 31 25-watt TDP 31 30-watt TDP 31 35-watt TDP 31 Plugged in 36 27 33.33% 34 32 Average framerates at 720p low, save Cyberpunk 2077 at 720p Steam Deck preset. Cells are blank if handheld doesn’t support that power mode.\n\nI panned the Xbox Ally on October 15th for many reasons including: it runs slower than a two-year-old Steam Deck despite using what’s effectively the same chip. With Bazzite, the same device runs up to 30 percent faster than with Windows, and beats the Steam Deck in all but one of my gaming benchmarks. Several reviewers say the black Xbox Ally X, which doesn’t have as many sleep issues, gets a similar Bazzite speed boost.\n\nIt’s not just games that feel faster: Steam is a far more responsive interface without the bloat of Windows lurking under the hood. It feels like an entirely different handheld. With Bazzite, I can use it like I use a Nintendo Switch, simply pressing the power button whenever I want to pause a game, then picking up exactly where I left off hours or days later.\n\nIt’s faster to launch games, faster to wake from sleep; I also almost never need to touch the screen and leave fingerprints, something that still eludes Microsoft’s latest attempt at gamepad-controlled Windows.\n\nEven the Ally’s buttons are less confusing under Bazzite. By default, tapping the upper left button summons Steam’s home menu on the left… …while tapping the upper right button summons Steam’s quick settings menu on the right.\n\nThe Xbox button summons Handheld Daemon, and a long-press gives you this full-screen version that lets you easily update to new versions of Bazzite. (Yes, I’m on the unstable build, since that’s the version that fixed sleep first.)\n\nI won’t get into all the details because I don’t want to sound like a broken record — last December, I already wrote how Bazzite turned the previous ROG Ally X (not to be confused with the Xbox Ally X) into the best handheld of 2024. And once again, I’ll admit I see no battery life advantage for Bazzite over Windows — occasionally, I even see Bazzite draining a watt more than Microsoft’s OS.\n\nBut it is such a repudiation of Windows that Microsoft’s first “Xbox” handheld, the one with a version of Windows that was supposed to reduce the bloat and fix performance and sleep modes, built by a multi-trillion dollar company, is so effortlessly beaten by the efforts of a few Linux programmers standing atop the shoulders of the roughly 300-person Valve and the broader Linux community.\n\nBazzite had a problem getting the white Xbox Ally to sleep too, at first. When I installed it on October 19th, pressing the power button put the system into a state where it wouldn’t wake up again; I needed to hard-reset every time. But that’s because Bazzite’s developers didn’t yet have an Xbox Ally. Two days after programmer Antheas Kapenekakis obtained the hardware and consulted with two contacts at AMD, the three fixed it — and got the Xbox Ally’s programable RGB joystick lights working in Linux, too.\n\nBazzite and its built-in Handheld Daemon let you control the Ally’s TDP, buttons, and lighting with just a couple presses.\n\nTo give you some idea of just how unreliable the vanilla Xbox Ally is right now, I tested two of them last week, one with “Modern Standby Assist” and “Extreme Standby” turned on, the other off. I applied every update available, checked their batteries regularly, and monitored whenever they woke up.\n\nBoth repeatedly woke up all by themselves at seemingly random intervals, just sitting on my desk, then usually put themselves back to sleep. The deeper sleeper lost 10 percent of its battery life after 12 hours, the other lost 23 percent. (The latter needed to be woken up twice in a row for the gamepad to continue working.)\n\nBut after another 12 hours, I found both handhelds only had 30 percent battery remaining. I’m not sure what happened to one, but the other had clearly tried to apply a Windows Update when it should have been asleep. Separately, I also saw both Windows units refuse to wake from sleep, requiring a hard reset before they would come back to life again. Some Redditors have also reported that issue with both versions of the Xbox Ally, as well as the surprise battery drain.\n\nEven though it’s so much better with Bazzite, I hope Microsoft fixes Windows soon.\n\nMicrosoft declined our request for an interview about the future of the Xbox Ally or a timeline on fixes, but VP of Windows product management Anshul Rawat provided this statement to The Verge:\n\nWindows and Xbox teams are aware of the challenges a limited number of players have experienced and are actively working to refine sleep and wake reliability. We’ve identified a small set of issues and initial fixes will be rolling out soon. Optimizing Windows, the most flexible OS in the world, for a range of devices and screen sizes across PCs and the cloud is an ongoing journey. As we work with our partners to provide a great experience on gaming handhelds, community feedback plays an important role in shaping these improvements for all players.\n\nWe’ve asked Microsoft what it means by “limited number of players” and “rolling out soon.”\n\nIf I had bought an Xbox Ally myself, I’m not sure I’d wait for Microsoft to figure it out. At a minimum, I would dual-boot, occasionally swapping back to Windows to get new BIOS updates.\n\nThere are many lingering misconceptions about Linux gaming, like how it supposedly provides less choice than Windows, doesn’t offer game stores other than Steam, doesn’t play as many games, runs those games poorly by comparison. With some exceptions — mostly games with advanced anti-cheat solutions — they’re not true.\n\nYou can sideload games from the Epic Games Store, from Battle.net, from Ubisoft and GOG and more, and the Linux community’s efforts mean many aging PC games that have issues running on Windows run fine on Linux. ProtonDB helps you check if your favs are among them.\n\nPhotos by Sean Hollister / The Verge\n\nCorrection: An earlier version of this story mislabeled Handheld Daemon as Handheld Companion.",
  "authors": [
    "Sean Hollister"
  ],
  "url": "https://www.theverge.com/games/807711/xbox-ally-sleep-fail-bazzite-fix-performance"
}