{
  "title": "Altrincham bar bans solo-drinkers to 'protect customers'",
  "text": "'I've banned solo drinkers from my bar'\n\n2 days ago Share Save Lynette Horsburgh North West Share Save\n\nGreensmith Photography Carl Peters says he takes pride in how safe his customers feel in Alibi\n\nThe owner of a cocktail and karaoke bar where solo drinkers are banned says he is baffled by the furore it has caused on social media as the policy is \"for the safety of all guests\". Carl Peters said the no-single-entry policy after 21:00 had been in place since the opening of Alibi in Altrincham, Greater Manchester, in 2022. He told the BBC it was to \"mitigate risk\" and \"protect his customers\" from being \"mithered\" by solo drinkers. He posted a reel on Instagram earlier this month about the policy after saying someone had accused him of discrimination. He said he was \"astounded\" by the ensuing criticism, describing his venue as an \"inclusive and safe environment\".\n\nThe ban got a mixed response from Instagram users with one commenter saying she \"always feels safe in Alibi\", while another described the policy as \"narrow minded\", adding if he finishes work late and goes for a drink himself \"he has never once mithered anyone and... happy in my own company\".\n\nAlibi/Instagram A man claimed the policy was \"discrimination\", Mr Peters says\n\nMr Peters explained there were two reasons why he introduced the policy. Firstly, if someone on their own has a seizure or an accident with no-one with them \"in a late night busy bar environment, it's an absolute nightmare for us to deal with\". He said also \"sometimes if you let people in on their own, the reason why they're on their own is that they've got no-one to talk to, so they start mithering other groups\". \"So what we do as a venue is we just eliminate that.\" He added: \"Unless you're with a group and we know who you're with, then you're not coming in.\" Mr Peters added he took \"pride that his customers feel safe in his venue\" so was \"astounded\" it was now being criticised on social media.",
  "authors": [],
  "url": "https://www.bbc.com/news/articles/cnve4eypg8zo"
}