{
  "title": "Uber Eats will use sidewalk robots to make food deliveries in Miami",
  "text": "is transportation editor with 10+ years of experience who covers EVs, public transportation, and aviation. His work has appeared in The New York Daily News and City & State.\n\nPosts from this author will be added to your daily email digest and your homepage feed.\n\nUber is expanding its use of autonomous delivery vehicles with the announcement that it will soon deploy sidewalk robots developed in Miami, Florida.\n\nThe six-wheeled delivery robots will come from Cartken, an Oakland-based AI company founded by a team of ex-Google engineers known mostly for deploying its vehicles on college campuses.\n\nThe robots will deliver items offered by a slate of businesses in the Dadeland area of Miami-Dade County, with plans to expand into larger areas of the city and some additional markets in 2023. Uber claims that its partnership with Cartken represents the robotics company’s “first formal partnership with a global on-demand delivery app beyond college campuses.”\n\nSidewalk delivery robots are becoming a familiar sight on many college campuses\n\nSidewalk delivery robots are becoming a familiar sight on many college campuses and even a few towns and cities. There have been some notable examples of robots getting stuck in the snow, being run over by cars, or catching fire.\n\nCartken’s robots are electric, with a trunk that can fit almost two dozen pounds of cargo, and has a number of embedded cameras that can be used to identify obstacles and help guide it to its destination. Cartken’s robots are manufactured by auto supplier Magna.\n\nThe robots have a delivery radius of several miles but can only travel at a speed slightly slower than walking, which is obviously slower than a delivery by a human on a bike or in a car. And they can climb curbs but not stairs, which may limit their appeal to customers who live in multistory buildings.\n\nUber is getting more comfortable with using autonomous vehicles for ride-hailing trips and deliveries. The company has a 10-year deal with Nuro to use its delivery vehicles in California and Texas and is working with Serve Robotics and Motional on a robot delivery pilot in Los Angeles. Uber is also featuring Motional’s robotaxis for ride-hail customers on its app in Las Vegas.\n\nInfamously, Uber had developed its own fleet of autonomous vehicles with the intention to eventually replace all of its human drivers, but the program was shut down after a woman was killed by one of the company’s vehicles in 2017.",
  "authors": [
    "Andrew J. Hawkins"
  ],
  "url": "https://www.theverge.com/2022/12/15/23509283/uber-eats-sidewalk-robots-delivery-miami-cartken"
}