{
  "title": "Every Cyber Attack Facing America",
  "text": "Transcript\n\nEverybody knows how technology can make our lives better\n\nor a little easier, but it can go the other way too.\n\nSoon, it will actually be impossible for a human being\n\nto tell if the face that they're looking at is real.\n\nAnd that's a very scary new reality.\n\nToday, we're talking about future tech threats,\n\nincluding AI deepfakes, cyber attacks on electrical grids,\n\nquantum computers, and a lot more.\n\nThis is Incognito Mode.\n\n[gentle music]\n\n[keyboard clanking]\n\nOne of the doomsday scenarios\n\nthat experts have worried about for decades\n\nis a major cyber attack on the US electrical grid.\n\nNow, Andy, you've written a literal book\n\nabout cyber attacks on electrical grids\n\nand the hackers behind them.\n\nTell us about that.\n\nAs with so many of these different kind of future threats,\n\nwe've already seen it play out in Ukraine,\n\nwhich is so often the canary in the coal mine\n\nbecause it is so targeted by Russian hackers.\n\nAnd in fact, we've seen one specific group\n\nof Russian hackers called Sandworm\n\ncause blackouts three times in Ukraine,\n\nthe only hacker-induced blackouts in history.\n\nThe first one of these was in 2015.\n\nThese Russian state-sponsored hackers broke into\n\na collection of electrical utilities in Western Ukraine\n\nand turned off the power\n\nfor a quarter million Ukrainian civilians.\n\nThen they did it again the next year\n\nin the capital this time, in Kyiv.\n\nIn that case, they used this kind of automated tool known\n\nas Crash Override, or Industroyer.\n\nIt was essentially kind of blackout-inducing bots\n\nthat could open circuit breakers\n\nwith kind of automated speed.\n\nNow, in both of those first two blackouts in Ukraine,\n\nthe power outage only lasted a few hours.\n\nBut in the second of those two attacks,\n\nwe did also see this troubling tactic,\n\nwhich was that the Sandworm hackers actually tried\n\nto disable a piece of safety equipment called\n\nthe protective relay.\n\nThey intended it that when the Ukrainian engineers tried\n\nto turn the power back on,\n\nthey might have overloaded lines\n\nto cause them to burn or exploded the transformer,\n\nand that would've been a kind of physical destruction\n\nof grid equipment that could have led to outages\n\nof weeks or a month.\n\nAnd that only actually failed\n\nbecause of a tiny misconfiguration in the hacker's malware.\n\nAnd in the midst of Russia's full-scale invasion\n\nof Ukraine starting in 2022,\n\nthey haven't stopped attacking\n\nthe Ukrainian power grid both physically\n\nand with cyber attacks,\n\nand in one case they succeeded in causing a blackout\n\nin the midst of an airstrike,\n\nin the midst of missiles raining down on the city\n\nthat was blacked out.\n\nSo, the US grid, as I understand it,\n\nit's not just one centralized local grid.\n\nThe United States is enormous,\n\nso we've got the East, we've got the West,\n\nand we've got Texas, which is its own thing for some reason.\n\nAnd then within those we have all these utility companies\n\nthat connect to these grids.\n\nSo, we're talking about a bunch of different entities.\n\nHow complicated would it be to kind of target even one\n\nof these regions in the United States?\n\nWell, I think that causing like a massive blackout\n\nacross the whole region in the US would be quite difficult.\n\nThe cyber attacks we've seen so far in Ukraine\n\nare relatively localized.\n\nYou know, the idea of like this kind of nightmare scenario\n\nof blacking out the entire eastern seaboard for a month,\n\nI don't think we've ever seen a hacker group capable\n\nof doing that.\n\nNot to say that it's not technically possible somehow,\n\nbut what we have seen that's very worrying is this one group\n\nof Chinese state-sponsored hackers called Volt Typhoon\n\ngaining access to electric utility networks in the US\n\nacross the entire country.\n\nAnd it seems that they're trying to pre-position\n\nto be ready for some date in the future\n\nwhen they might choose to pull the trigger\n\nand cause blackouts perhaps\n\nin many simultaneous cyber attacks.\n\nAnd of course, the date that we have to guess\n\nthat they're preparing to do that would be on the eve\n\nof the invasion of Taiwan that Xi Jinping,\n\nthe Chinese head of state,\n\nhas said he wants the Chinese military\n\nto be ready for by 2027.\n\nThat could be a kind of tactic in the Chinese playbook\n\nto delay an American response to that invasion,\n\nor perhaps more specifically,\n\nto cut power to US military bases\n\nthat would hamper our military response\n\nto that actual invasion of Taiwan.\n\nI have sometimes thought like the threat\n\nof a power grid attack has become overblown\n\nbecause it's kind of like\n\nthe quintessential cyber nightmare.\n\nSo, at one point I even did ask an NSA official,\n\nAre you actually scared of a cyber attack on the grid?\n\nAnd he said that he absolutely was\n\nbecause of this notion\n\nthat the electric grid underlies every system\n\nthat we have come to rely on, GPS, internet, water,\n\nall of it depends on electricity.\n\nIt is in some ways like the fundamental lowest layer\n\nof the tech stack of America,\n\nAnd this is one of the reasons why cyber attacks\n\non electrical grids kind of loom large\n\nin the cybersecurity mind,\n\nis that this is a hack\n\nthat can potentially cause physical damage in the real world\n\nthat then makes the attack much more consequential.\n\nRight.\n\nIf the power turns off for a few hours,\n\nI think we have backup systems,\n\nwe have natural disasters that cause that.\n\nWe're ready to bounce back.\n\nIf transformers are destroyed, however,\n\nthese are custom pieces of equipment\n\nthat are hard to replace.\n\nWe may not be ready for a long timescale of outage\n\nagainst an actual malicious adversary\n\nthat's still there in the network,\n\nstill trying to cause more damage.\n\nWe saw how difficult it was, for instance,\n\nfor Spain and Portugal to turn the power back on\n\nacross an entire country.\n\nWell, imagine if you're trying to perform that recovery\n\nwhile an active adversary is also trying\n\nto sabotage every step you take to recover.\n\nTerrifying.\n\n[gentle music]\n\nHey, it's me. Don't recognize me?\n\nHow about now?\n\nAI-generated deepfakes are everywhere on the internet.\n\nYou've probably laughed at ones\n\nof politicians or celebrities,\n\nbut did you know these tools can be used\n\nfor nefarious purposes against you?\n\nWhat in your reporting\n\nhave you seen deepfakes being used for?\n\nWell, we've already seen deepfakes being used for two\n\nof the most lucrative form of cyber crime\n\nthat we know about.\n\nOne is what people call business email compromise,\n\nwhere a hacker is kind of impersonate someone inside\n\na company and trick the executives\n\ninto sending money where they shouldn't.\n\nWe've seen one company tricked into sending $25 million\n\nto a hacker who impersonated an employee.\n\nThe other is romance scams,\n\nor other kinds of what people call pig butchering,\n\nwhere a victim is tricked into sending sometimes millions\n\nof dollars to a fake crypto investment.\n\nI've seen listings on black markets\n\nwhere crypto scammers are selling each other deepfake tools\n\nto be able to impersonate someone's face,\n\nand both of these are already making tens\n\nof billions of dollars in revenue a year,\n\ntruly two of the biggest categories\n\nof cyber crime in existence,\n\nand both of them\n\nare going to be absolutely supercharged by deepfakes.\n\nMost of the nefarious uses of deepfakes involve scams,\n\npeople trying to steal people's money.\n\nDeepfakes used by scammers can be put together quickly\n\nand they don't have a lot of resources\n\nto put into them sometimes,\n\nbut they can also be used in geopolitical settings,\n\nfake news on steroids.\n\n[speaking in foreign language]\n\nThe producers of fake news are able to put\n\na lot of resources into making sure something looks reliable\n\nand it makes it really hard to detect\n\nwhen something's actually fake.\n\nUnless you're a digital forensics expert,\n\ndetecting fake news can be really difficult.\n\nThe technology is just rapidly improving.\n\nIt's becoming pretty commonplace\n\nto be able to get access to these tools.\n\nYou don't have to be a specialized hacker or anything\n\nto get them.\n\nYou can just kind of download these tools\n\nand use them for whatever means you want to.\n\nDefinitely, and I think the real time deepfake video tools\n\nthat I've seen are not seamless,\n\nthey're quite detectable\n\nfor like a not super gullible human being today,\n\nbut I think what we're talking about is a very near future\n\nwhere these tools are only going to improve\n\nand soon it will actually be impossible for a human being\n\nto tell if the face that they're looking at is real,\n\nand that's a very scary new reality.\n\nYou know, one of the ways people protect themselves\n\nfrom traditional scams, even before deepfakes,\n\nis you're just familiar with\n\nwhat a phishing email looks like\n\nand you learn to look out for it,\n\nbut at some point the fakes become so good,\n\nyou can't tell what's real and what's fake.\n\nI think we're used to telling people too as a safeguard,\n\nYeah, if you can't tell if this text is fraudulent,\n\nthen get somebody on a call.\n\nIf that doesn't work, you get somebody on a video.\n\nWhen none of that works,\n\nthen we have to come up with new protocols, like, you know,\n\ndo you have some sort of secret code word?\n\nDo you check if somebody\n\ncan remember your last conversation?\n\nYou know, all of these things,\n\nwe'll have to kind of figure them out\n\nin this new deepfake future.\n\nAI has really taken all the headlines\n\nas this big emerging technology\n\nand all the potential threats around it.\n\nAnother emerging technology is quantum computing\n\nthat's continuing to evolve.\n\nOne of the things that security experts kind of worry about\n\nwith regards to quantum computing\n\nis that it could just break all encryption.\n\nWhat have you seen about this?\n\nRight, well, this is what some people call Q Day,\n\nlike, this perhaps near future doomsday scenario\n\nwhere quantum computing becomes powerful enough\n\nto break these crypto systems\n\nthat we have built an entire society on.\n\nIt turns out that there are some kind\n\nof post-quantum crypto systems\n\nthat can't be broken even by quantum computers.\n\nSo, Google, for instance,\n\nhas been very vocal about switching\n\nto post-quantum crypto.\n\nSignal, the encrypted messaging app,\n\nhas also switched to post-quantum crypto,\n\nand that ought to be reassuring.\n\nBut the troubling thing is just how many systems out there\n\nmay not be using post-quantum crypto,\n\nand when quantum computing suddenly appears,\n\nthey can just all be broken\n\nand all of our secrets will be accessible\n\nand it'll be like that moment in Sneakers\n\nwhen like suddenly the entire internet is decryptable.\n\nAnybody wanna shut down the Federal Reserve?\n\nFor instance, Bitcoin we know\n\ndoesn't use post-quantum crypto.\n\nIf a quantum computer arrived today,\n\nit seems like somebody would be able\n\nto steal hundreds of billions of dollars.\n\nBitcoin would probably go to zero immediately,\n\nand that's only gonna be fixed\n\nwhen the entire Bitcoin community decides\n\nto adopt new crypto technologies\n\nand implement them across the network,\n\nwhich is a really big undertaking\n\nand may not happen in time.\n\nThe issue with quantum computers\n\nis that they're just much faster at breaking encryption\n\nthan a traditional computer.\n\nWhile a traditional computer\n\ncan take over a hundred million years\n\nto break certain types of strong encryption,\n\na quantum computer can do it in just a few hours.\n\nWIRED's Amit Katwala recently interviewed several experts\n\nabout the coming quantum apocalypse.\n\nAccording to one survey,\n\nexperts believe Q Day is gonna arrive by 2035,\n\nif not sooner,\n\nand some think there's a 15% chance it's already happened.\n\nNow, if Q Day does actually arrive,\n\nthat means everything from military intelligence secrets\n\nto access to critical infrastructure\n\nto your own private data and messages could all be exposed.\n\nIt's not just the end of privacy as we know it,\n\nit's the end of any control over all the systems\n\nthat we use every day.\n\nExperts kind of compare this to Y2K when,\n\nif you don't remember,\n\nY2K is when the computer systems use two digits\n\nto denote the date zero zero,\n\nand everybody was worried that everything would break\n\nbecause the computers would think it's 1900\n\ninstead of the year 2000.\n\nNow, Y2K has kind of become a joke\n\nbecause everybody pitched in and fixed the problem\n\nbefore it was actually a catastrophic issue.\n\nMidnight has come in Russia,\n\nthere's no Y2K problem at all.\n\nAnd in this case, it's the same kind of situation\n\nwhere we need a bunch of different systems,\n\nmany thousands I'm sure is an understatement.\n\nWell, exactly.\n\nI think talking about it like Y2K\n\nis part of why I've always kind of dismissed this, like,\n\nOh, it's some problem for the nerds.\n\nThey'll deal with it in time.\n\nBut the thing about Y2K was that we knew exactly\n\nwhen it was gonna happen.\n\nThis doomsday, we don't know when the deadline is,\n\nand in fact, there's some adversary out there building\n\na quantum computer.\n\nThey know perhaps when they're gonna have one, and we don't.\n\nAnd we also don't know\n\nif somebody may have actually even now built\n\na quantum computer in secret\n\nand have the ability to crack all of these crypto systems\n\nand access secrets that we can't even imagine.\n\nThere's basically two categories when we're talking\n\nabout quantum computers breaking encryption,\n\nit's keeping of secrets and managing access to systems.\n\nIf the encryption is broken,\n\nthen you can't keep anything secret\n\nand you can't keep anyone out of any system.\n\nAnd to your point,\n\nthey would also be able to mess with things,\n\ntake control of all of the digital systems\n\nthat control the power grid or air traffic control.\n\nIt's really hard to imagine the level of actual havoc\n\nthat they could wreak.\n\nAnd really, like, some other countries could be storing all\n\nof this encrypted data that's traveling across the internet\n\nand just keeping it and waiting for the day\n\nwhen Q Day arrives and they have this computer capable\n\nof cracking all of that.\n\nYeah, absolutely.\n\nYou make a great point that the data\n\nthat's already been stolen\n\nis not gonna be updated alongside those systems,\n\nand so all of those secrets could still be cracked.\n\nWe really can't move\n\nto post-quantum crypto systems fast enough.\n\nOne of the systems we don't really think about,\n\nbecause it's just everywhere\n\nand we take it for granted, is GPS.\n\nIf it goes down, things get bad really quickly.\n\nAnd it's not just the navigation app on your phone.\n\nIt's trains, airplanes, boats,\n\nall types of systems that people rely on,\n\nand it could really cause major disruptions.\n\nGPS is just one\n\nof several global navigation satellite systems, or GNSS,\n\nthat are used around the world.\n\nEurope has Galileo, Russia has GLONASS, China has BeiDou,\n\nbut the US is really reliant on GPS alone.\n\nThe US' reliance on GPS makes it particularly vulnerable\n\nbecause the government hasn't created any backup systems\n\nlike they have in other countries.\n\nIt's used by transportation systems,\n\nemergency services, financial institutions.\n\nBasically everything runs on GPS\n\nand you might not even know it.\n\nWe've seen, for instance,\n\nin the war in Ukraine that Russian\n\nand Ukrainian soldiers have been using GPS jamming\n\nand spoofing to try to disrupt each other's drones\n\nand prevent drone attacks.\n\nBut in those cases, we've also seen collateral damage.\n\nThose jamming devices are like very blunt instruments.\n\nThey send out their radio jamming\n\nin all directions in a wide range.\n\nWe've seen them affect civilian aircraft even,\n\nand I believe our colleague Matt Burgess\n\nhas written about how civilian aircraft\n\nhave had to be rerouted,\n\nsent back to the airport of their origin\n\nbecause of GPS jamming in the Ukraine war.\n\nYeah, so this is something that's already happening\n\non a small scale, but there's the potential,\n\nif there's a major war between the US and China,\n\nwhere these systems could be disrupted\n\non a much bigger scale.\n\nIt's not just spoofing and jamming attacks\n\nthat we have to worry about.\n\nThere's also attacks on the actual satellites themselves.\n\nWe know some countries have developed satellite technology\n\nto take out or disrupt satellites in orbit.\n\nThe fact that countries\n\nare carrying out these kinds of attacks shows just\n\nhow valuable GPS is and how vulnerable it can be.\n\nYeah, I remember in this science fiction book\n\nfrom 10 years ago now called Ghost Fleet,\n\nthey posit this future war with China\n\nwhere the first shot of that war\n\nwould be China destroying all of the US' satellites.\n\nThat is plausible.\n\nWe've seen China and Russia demonstrate the ability\n\nto destroy satellites.\n\nChina has shown that it can use a satellite\n\nto grapple onto another one and pull it out of orbit.\n\nThese sound like science fictional threats,\n\nbut they are practical.\n\nAnd we've never really thought about\n\nwhat our country would look like\n\nif all of GPS were suddenly disrupted.\n\nIf you've used generative AI tools like ChatGPT,\n\nyou know how powerful they are.\n\nThey give you the ability to write an essay in seconds,\n\nor create a business plan\n\non something you might not even know anything about.\n\nThe same for writing code.\n\nProgrammers everywhere are already using generative AI\n\nto write code that they're deploying in the world.\n\nBut the same goes for hackers.\n\nAI for so many people\n\nis a kind of glorified productivity tool,\n\nand it seems like it is that for now for hackers too.\n\nChinese hackers are using generative AI\n\nto write better phishing emails in perfect English now.\n\nThey are almost certainly writing malicious code\n\nwith AI too,\n\nbecause all software developers are using AI to write code,\n\nbut that's not like truly autonomous hacking bots\n\nout there somewhere on the internet,\n\nwhich is the scary future thing we're talking about.\n\nBut I think that's coming.\n\nAt some point, we will see fully autonomous hacking agents,\n\nand I think we may even see a future\n\nwhere AI is able to automatically find\n\nzero-day secret vulnerabilities in code\n\nand exploit it immediately, and that's quite scary.\n\nThese tools can be used by hackers\n\nin a couple of different ways.\n\nOne, they can write code that somebody\n\nwho isn't really skilled wouldn't have any ability to do.\n\nMore and more people could become hackers.\n\nSo, you have these script kiddies writing tools\n\nin large language models and deploying that code\n\nwith unknown consequences.\n\nThen we get to the professional level\n\nwhere both the good guys and the bad guys\n\nare using these tools.\n\nYou have white hat hackers using them to find zero-days,\n\nor secret vulnerabilities\n\nin code nobody's been able to patch.\n\nAI can be really useful for protecting these systems,\n\nbut you also have black hat hackers.\n\nThey can use it to write malicious code\n\nthat they might not otherwise be able to create\n\nand deploy that code in more sophisticated ways.\n\nWe've talked for a long time\n\nabout the problem of zero-days,\n\nthis idea of a secret vulnerability in a piece of software\n\nwhere the company that makes that software\n\nhas had essentially zero days to fix it.\n\nAI is going to be able to find those zero-days\n\nin an autonomous way at some point.\n\nAs these technologies advance,\n\nyou can imagine a future where there is an AI\n\nthat you can point it at a certain system and say,\n\nGo hack that system and it'll go in,\n\nand it'll analyze the code that it's seeing,\n\nfind vulnerabilities in real time,\n\nwrite malicious code in real time,\n\nand then gain further access into those systems,\n\nbe able to exfiltrate data\n\nand just kind of cause all the havoc\n\nthat hackers can already,\n\nbut much more efficiently, much quicker,\n\nand maybe on a much bigger scale.\n\nI think the real issue though\n\nis that defenders definitely need to be using AI\n\nor they're gonna be left behind.\n\nThings aren't necessarily gonna become instantly\n\nmore secure or less secure one way or the other.\n\nWe report on systems getting hacked\n\nalmost every day here at WIRED,\n\nand so that reality is gonna still be there,\n\nit's just the question of will the teams defending\n\nagainst this stuff be adopting it effectively\n\nas well as the malicious hackers?\n\nAnd we just don't know how that's all gonna play out.\n\nIf you've ever been in a natural disaster\n\nand the cell networks go down,\n\nyou know just how helpless and stranded you feel.\n\nNow, imagine that's happening to everybody everywhere.\n\nWe're just not ready for our cell networks to go down.\n\nIn addition to natural disasters,\n\nthere've been several cyber attacks on cell phone networks\n\nin various countries around the world.\n\nThere's also been repressive regimes\n\nthat have taken the cell phone networks down on purpose\n\nto quell protests.\n\nWe've seen a cyber attack launched\n\nagainst Ukraine's cellular provider Kyivstar\n\nin December of 2023,\n\nturn off cellular service to millions of Ukrainians.\n\nThis was the Russian hacker group Sandworm trying\n\nto disrupt the communication systems\n\nfor the whole populace of the country.\n\nAnd we've also seen governments\n\npurposefully turn off cellular access\n\nin Myanmar and India and Iran,\n\nsometimes for a week at a time,\n\njust as a way to quell descent.\n\nWe've never seen this happen in the US,\n\nbut I think we can easily imagine that it's possible,\n\neither with insider access or from an external threat.\n\nAnd we've also seen it just happen\n\nbecause of natural disasters and terrorist attacks in the US\n\nwhere there's a crisis and everyone overwhelms the network,\n\njust trying to reach loved ones\n\nor emergency service providers.\n\nAnd one of the solutions that people have been talking about\n\nis like a kind of peer-to-peer mesh radio,\n\nlike, I think you've been looking into this.\n\nYeah, we've been looking into this type of technology\n\nthat's called Meshtastic.\n\nSo, actually I have one of the devices here,\n\nand it looks like a little pager, if you remember those,\n\nbut it's basically just a radio,\n\na circuit board, and an antenna.\n\nThese devices come in a bunch of different forms.\n\nSome of them look like the old Blackberry devices.\n\nThey have actual keyboards, some of them have touch screens.\n\nSome of them are really simple\n\nwith just like a 3D printed case like this one.\n\nBasically, all the devices work the same.\n\nMeshtastic is a radio-based mesh network\n\nthat uses long range radio\n\nto send encrypted messages between devices\n\nacross distances of up to 200 miles.\n\nMeshtastic is an open source software project.\n\nIt's not maintained by any one company,\n\nand pretty much anybody can get involved\n\nwith the Meshtastic community.\n\nUnlike cell phones that connect to a tower to communicate,\n\nMeshtastic is a peer-to-peer network,\n\nmeaning that each device communicates\n\nwith other devices in the area.\n\nYou're able to use this\n\nwithout cellular service, without wifi.\n\nYou can connect it to your phone,\n\nso you can text straight from there.\n\nAnd the device itself is what's sending the message,\n\nand it's really low bandwidth,\n\nso you can't really send much information,\n\nbut the good thing is that it's really not reliant\n\non any centralized system like a cell network.\n\nAnd the cool thing about it\n\nis that you don't have to be within line of sight\n\nof the recipient of the message,\n\nyou just have to be in line of sight\n\nof some other Meshtastic radio\n\nso that you can connect to the whole mesh,\n\nand then that message gets passed around\n\namong all these peers until it reaches\n\nthe intended recipients.\n\nThat's the cool thing about it, I guess,\n\nis that like the more of these radios connect\n\nto the network, the more powerful it becomes.\n\nIt's still really early days for this.\n\nThere's not that many people\n\nwho have a Meshtastic device compared to, say,\n\na cell phone, of course, but if you live in a city,\n\nthere's a good chance you're gonna have some type\n\nof Meshtastic network already set up\n\nand you're gonna be able to communicate with each other.\n\nIt does seem like this is maybe the first step\n\nin creating a system that would survive a larger disruption\n\nof centralized cellular service.\n\nMeshtastic is real useful during, say,\n\nnatural disasters when the phone lines are down,\n\nbut can also be useful if you're just an area\n\nwith poor cell coverage, like out for a hike.\n\nMeshtastic can't replace your cell phone altogether,\n\nbut it's gonna work when a cell phone isn't.\n\nThis has been Incognito Mode.\n\n[futuristic musical tones]",
  "authors": [
    "Condé Nast"
  ],
  "url": "https://www.wired.com/video/watch/incognito-mode-every-cyber-attack-facing-america"
}