{
  "title": "16 Best Electric Bikes of 2025, Tested and Reviewed: Commuting, Mountain Biking",
  "text": "Other Ebikes We Like\n\nBike Friday All-Day Photograph: Adrienne So\n\nBike Friday All-Day for $5,200: Bike Friday bills the irresistibly tiny All-Day (7/10, WIRED Review) as the world's lightest Bosch-powered ebike, and it's true. You can customize all the colors and components of this folding electric bike, and it has a surprisingly powerful motor for its size. The Brompton above is more widely available and easier to use, but I love this little bike a lot.\n\nRadio Flyer Via Pro for $2,899: Editor Julian Chokkattu could not have had a better experience than this easy-to-use and easy-to-assemble class 2 electric cargo bike. For more info, check out our guide to the Best Electric Cargo Bikes.\n\nAventon Level 3 for $1,899: The Aventon Level 3 is an easy-to-ride ebike that features a clean, step-through design and every feature you could want in a standard-size ebike for riding around town. There are built-in fenders and lights, and a big color display shows you how much of the up to 70 miles of advertised range you have remaining. I have ridden it up to about 25 miles at a time with my heavy 6'2\" frame, easily ending my rides with 20 percent of battery left. The frame feels comfortable and sturdy, thanks to a double-walled construction and improved Shimano gears and brakes. The front suspension fork and semi-hidden suspension seat post add to comfort relative to other bikes I’ve tested in this price range, and I like that the Aventon app lets you set up things like remote locking and geofencing, so you can keep an eye on your expensive bike from afar. The built-in turn signals, which use the bike’s rear lights, are another bonus when riding in cities at night. —Parker Hall\n\nTenways CGO800S for $1,999: This is a budget step-through city ebike. It boasts up to 50 miles of battery life, and I got more than 30. The torque sensor is smooth and responsive to pedaling at various speeds. However, there's no throttle, and because this bike is meant to fit riders of a huge range of sizes (they say 5'1'' to 6'3''), the frame was not as comfortable to pedal for me (5'11\") as some large-size bikes. —Martin Cizmar\n\nEngwe LE20 for $1,899: The selling point of this bike is that for $1,500, you get a cargo bike with room for a massive payload and two high-capacity batteries, which is theoretically able to traverse 211 miles while carrying a 165-pound rider. The batteries only carried me about 80 miles on a single charge (I weigh a lot more and didn't pedal as much as I could have) during three days of testing on America's longest rail-to-trail project, but still, that's a wow stat. This is the roughest assembly job I've had with a DTC ebike, and I ultimately did take it into a shop where the owner congratulated me on the wise decision to not ride it as-is. With weight pushing 100 pounds, it's not easy to load up for travel—you're not putting this thing on a rack. It carries cargo with ease, and with the $170 fast-charger upgrade, you can cover serious mileage in a day. —Martin Cizmar\n\nAventon Ramblas for $2,599: Aventon made a mountain bike! It's a lot of bike for an affordable price, but just a little too heavy to take out for its intended use case. It makes a nice, rugged commuter, however.\n\nLinus eDutchi for $1,799: Need a comfy cruiser? The Linus eDutchi is a comfy class 1 ebike with beautiful colors and loads of proprietary accessories.\n\nElectra Loft Go! Photograph: Electra\n\nElectra Loft Go! for $1,200: I also love the Electra Loft Go! (7/10, WIRED Recommends), which is another comfy sit-up beach cruiser, but the Priority has a slightly more powerful motor for the same price.\n\nXtracycle Estoker for $4,499: This is probably the bike that I see most often in my Portland, Oregon, neighborhood. It has a durable, sturdy Chromoly steel frame and larger 24-inch wheels, along with a Shimano mid-drive motor that makes it perfect for more grueling conditions. Unfortunately, you do have to be over 5'6\" (which I am not) to ride it.\n\nGazelle Eclipse for $6,399: If you want to know just how great the Bosch system can be, the Eclipse (8/10, WIRED Recommends) is the more expensive version of the Radster Road above. It has a nicer shifter, a smarter motor—even the paint job is nicer. It's just much more expensive.\n\nHeybike Tyson for $1,399: You get a lot of stuff for not very much money with the Tyson (6/10, WIRED Review), a fat-tire, folding ebike that includes suspension, blinkers, a throttle, and one of the most obnoxious horns I've ever heard. The components are not super-high-quality, but it's an affordable, comfortable way to dip your toes into ebike waters.\n\nThe Gocycle G4I+ for $5,999: Gocycle's high-end, fast-folding luxury bikes are designed by a former McLaren engineer. This quieter, lighter iteration has better torque, a new carbon-fiber front fork, and an even more painful price.\n\nThe Bunch Original Electric Cargo Bike for $6,499: I didn't care for the Bunch (5/10, WIRED Review), but my family did. It's a standard, if slightly expensive, box bike as you might see in Europe. It'll work well if you live in a flat area and don't have to go very fast.\n\nBikes We Dislike\n\nPass on the left.\n\nThe Retrospec Jax Rev Photograph: Retrospec\n\nThe Retrospec Jax Rev for $1,000: We wanted to love this sleek, stylish folding bike, but we couldn't help worrying about its durability.\n\nNiu Electric Bike BQi-C3 Pro for $1.699: Commerce director Martin Cizmar tested this bike and had a litany of complaints. The riding position is too aggressive, and the bike frame doesn't fit common components like a water bottle and his pannier. The disc brakes weren't suited to stopping it from 28 mph.\n\nFAQs How Does WIRED Procure Ebikes? Bike companies reach out to me, and I request testers in my size. Once I have finished testing, I either return the bikes to the manufacturer, the shop that assembled them, or donate them to nonprofit organizations. How Do You Secure an Ebike? Many ebikes have removable batteries, displays, or built-in wheel locks that make securing your bike much easier. Other bikes, like the Specialized Turbo Vado SL 2, are also compatible with Apple Find My. Check out our Best Ebike Locks guide for more options. Should I Build My Own Bike? Many affordable bikes now come direct-to-consumer—meaning that they are pre-tuned or partially assembled in a box. As Peter Flax recently noted in Bicycling magazine, these bikes do not get nearly the testing or vetting that bikes from a bigger manufacturer get. Unless you're not riding much or for many miles, or are experienced with modifying your own bike, I recommend working with an established manufacturer that has a dealer network. What Terrain Do You Live On? If you live in a flat area, you're probably fine with a 250-watt motor, which is the European speed standard. However, if you live near hills or haul a lot of stuff, you might want to consider a 500-watt or 750-watt motor and a few extras, like hydraulic disc brakes, which will help prevent you from skidding into traffic. How Do I Prevent Bike Fires? The idea of your garage suddenly setting alight is terrifying, but don't worry—the batteries that manufacturers use today are much safer than those of yore. We only write about bikes that have been certified safe by a third-party organization. Also, exercise a bit of common sense. Do not leave your bike battery charging overnight in a boiling hot garage. Don't use aftermarket accessories to charge your bike. And don't plug in a battery that has deformed or smells weird, or try to turn on a bike with a cracked display or computer. Follow Some Basic Safety Tips Not sure where to start? The biking advocacy group PeopleForBikes has a safety education program, E-Bike Smart, which it created in collaboration with the League of American Bicyclists and Bicycle Colorado. Do not let your children ride your bike unsupervised. An 80-pound child should not be piloting a 65-pound bike, even if the motor makes it possible for them to do so. And always wear a helmet, but you already know that. Right? How We Test AccordionItemContainerButton LargeChevron Over the past few years, WIRED's Reviews team has tried almost every kind of electric bike, from the best heavy-duty cargo bikes to high-end mountain bikes. We review upward of 50 new ebikes a year by riding them on a variety of terrain for at least 40 miles over the course of at least two weeks. We test cargo bikes by hauling kids and groceries, we ride mountain and gravel bikes on trails, and we test commuter bikes while running errands on regular city streets (including up and down steep hills). In addition to our real-life testing, we also evaluate specs like weight, tire size, battery life, motor power, and the sourcing of key components. It Costs What Now? AccordionItemContainerButton LargeChevron Whenever I talk to anyone about a possible ebike purchase, the biggest deterrent is usually the price. If this is you, check out our guide to the Best Cheap Ebikes. But I do want to say here that these are vehicles, not toys. When I'm carrying my kids to school or flying down a hill at 25 mph, I want the safest possible ride, and I think you should too. Reasonable auto financing options are the only reason a $2,000 electric bike can feel prohibitively expensive while a $6,000 beater gas-powered car has easy monthly payments. Many states now feature incentive programs that offer rebates or tax credits for ebike purchases. Some bike manufacturers and retailers offer financing through companies like Affirm or PayPal. Your bank might cover ebikes under its vehicle loan program, and I also recommend looking at eBay locally, Craigslist, or local Facebook groups. You probably have more options than you think. Ebike Classifications and Rules AccordionItemContainerButton LargeChevron Before you buy your electric bike, make sure you can actually use it! Many cities and states have laws regulating when and where you can ride an ebike. Check out our guide on the three classes of ebikes. At least 22 states now use this three-class system, and they may restrict when and where different classes of ebikes are used, depending on whether they have a throttle or can assist above 20 mph. Cities may also have laws about whether mountain ebikes are allowed on single-track trails. If your state classifies ebikes under the same laws governing motorcycles and mopeds, you may need a license to ride one.\n\nPower up with unlimited access to WIRED. Get best-in-class reporting and exclusive subscriber content that's too important to ignore. Subscribe Today.",
  "authors": [
    "Adrienne So"
  ],
  "url": "https://www.wired.com/gallery/best-electric-bikes/"
}