{
  "title": "Pluribus review: This new sci-fi from Breaking Bad's creator is 'one of 2025's smartest shows'",
  "text": "This intriguing series from Vince Gilligan stars Better Call Saul's Rhea Seehorn as a cynical woman living in a world where people are suddenly happy all the time. The result is George Orwell meets Invasion of the Body Snatchers.\n\nIf a mystery man talks directly to you by name through your television, and you're not dreaming or hallucinating, it's safe to assume the world has shifted. How and why is the question that winds through Breaking Bad and Better Call Saul creator Vince Gilligan's delightful new series. Pluribus plays like George Orwell meets Invasion of the Body Snatchers, but it still has Gilligan's distinctive voice, blending the real and the outlandish. After all, how preposterous was it for a high-school science teacher to become a drug lord, as Walter White did in Breaking Bad, or for a slimeball lawyer like Saul Goodman to be the hero we root for? Here Gilligan wraps timely social commentary in sci-fi tropes – and centres the story around a prickly but sympathetically down-to-earth heroine – to create one of the smartest, most entertaining shows of the year.\n\nAt times it brings to mind the comedy The Good Place. At other times it recalls the eeriness of HBO drama The Leftovers\n\nThat heroine, Carol Sturka, is played by Rhea Seehorn – Kim from Better Call Saul, without Kim's distinctively unstylish ponytail – and she is perfectly in sync with Gilligan's mix of genuine emotions and wild plot turns. A cataclysmic event occurs which leaves Carol surrounded by people who are happy all the time. She was already one of the least cheerful people on the planet, and seems immune to whatever's going on around her. A best-selling romance novelist, she privately says her readers are \"a bunch of dummies\" for gobbling up her books, which have titles like Bloodsong of Wycaro. She is cynical and acerbic, and her droll scepticism is a great, refreshing quality in this world of people who might as well be walking, talking smiley-faces. \"Nobody sane is that happy,\" she insists. The series puts us in Carol's place, and Seehorn's empathetic performance is both dramatic and witty, grounding the sci-fi plot in her visceral, fearful, determined reactions.\n\nAlthough the show's premise plants it in the Twilight Zone, one of the many genre classics the show evokes along with Body Snatchers (Gilligan has said both are inspirations), Carol is quite precisely located. She lives in a large house in an upscale cul-de-sac in Albuquerque, New Mexico, the city where Breaking Bad and Better Call Saul take place. Those shows don't overlap with Pluribus, but the location allows Gilligan to hide some Easter eggs. The sci-fi aspect takes him back to his early days as a writer for The X-Files. But here he uses genre tropes in a knowing, meta way. \"We've all seen this movie and we know it does not end well,\" Carol says. And the sci-fi never overwhelms her human story. Her sardonic wit and Seehorn's ever-sharp delivery make the show very funny. At times it brings to mind the comedy The Good Place. At other times it recalls the eeriness of HBO drama The Leftovers, but throughout it shifts easily from one tone to the other.\n\nMore like this:\n\n• 10 of the best TV shows in November\n\n• Is All's Fair 'the worst TV drama ever'?\n\n• The sci-fi that was the original Black Mirror",
  "authors": [],
  "url": "https://www.bbc.com/culture/article/20251106-pluribus-review"
}