{
  "title": "Male and female former employees of Smokey Robinson accuse him of sexual assault",
  "text": "Two more former employees of the soul music star Smokey Robinson, both male and female, have alleged he sexually assaulted them, which he denies.\n\nRobinson is already facing similar allegations from four other former employees, who filed a joint lawsuit in May. This week, lawyers for the accusers filed a motion to have two further accusers added to the lawsuit, both anonymously.\n\nThe man, who worked as a car valet for Robinson, alleges that Robinson fondled himself in front of him, and tried to place the man’s hand on his genitals. Like the four initial accusers, the woman worked as a housekeeper, and alleges that Robinson tried to make her touch him while he was showering on numerous occasions.\n\nIn a statement to Rolling Stone, Robinson’s lawyer Christopher Frost said the most recent accusers were “part of the same group of people who have conspired together against the Robinsons and are layering out their claims for maximum adverse publicity,” and called the lawsuit an “organised, avaricious campaign to extract money from an 85-year-old legend”.\n\nRobinson denied the allegations from the first four women, which included allegations of rape.\n\nHis wife, Frances, is a co-defendant in the original filing, and is accused of labour violations, using “ethnically pejorative words and language”, and being aware of the alleged sexual assaults. The plaintiffs are seeking $50m in financial damages.\n\nAfter the initial lawsuit was filed, their lawyer Frost called the allegations “vile, false” and said they were “an ugly method of trying to extract money” from Smokey Robinson.\n\nLater in May, the Robinsons filed a $500m countersuit, alleging defamation and elder abuse, and describing “an extortionate plan to take everything” from them. They claimed they had been generous to the women, giving them gifts and funding dental treatment.\n\nDespite the serious allegations, Robinson has continued to perform since, including UK concerts at Love Supreme jazz festival and London’s Eventim Apollo during the summer.\n\nHe is known for a string of hits he performed with his group the Miracles, followed by 24 albums as a solo artist. The most recent, What the World Needs Now, was released in April.\n\nRobinson also wrote a string of hits for other artists in the Motown stable, including My Girl and Get Ready for the Temptations.",
  "authors": [
    "Ben Beaumont-Thomas"
  ],
  "url": "https://www.theguardian.com/music/2025/nov/20/male-and-female-former-employees-of-smokey-robinson-accuse-him-of-sexual-assault"
}