{
  "title": "‘A Different World’ Sequel Showrunner: Fans Will ‘Feel Seen’",
  "text": "LOADING ERROR LOADING\n\nWhen Felicia Pride was still a young girl growing up in Baltimore, the TV writer would fittingly spend her days after school watching episodes of the hit sitcom “A Different World” — the HBCU-set series that brought Black higher learning to primetime television, and more importantly, changed Black pop culture forever.\n\nBack then, Pride, like many young Black people, fell in love with the iconic ’80s series, its fictional Hillman College and its unforgettable cast of characters that have endured for generations. Never in her wildest dreams did she think she’d be helming a sequel that continues the beloved sitcom’s story decades after Hilman’s finest, Dwayne Wayne (Kadeem Hardison) and Whitley Gilbert (Jasmine Guy), moved on to a different world (pun intended).\n\nAdvertisement\n\nBut last week, after much anticipation, Netflix finally greenlit the series for a full 10-episode season, with Pride, for the first time in her career, serving as showrunner.\n\nAfter getting the greenlight for her forthcoming “A Different World” sequel at Netflix, showrunner Felicia Pride discusses the “tough” task ahead of her, how she’s bringing meaningful Black stories to the forefront through her Honey Chile production company and why that mission prioritizes representation for Black women over 40. BreAnna Jones / NBC via Getty Images\n\nAccording to the streamer, the sequel will follow Whitley and Dwayne’s youngest child, Deborah (Maleah Joi Moon), as she enters her freshman year at Hillman. She’ll be joined by fellow students Rashida (Alijah Kai), Kojo (Chibuikem Uche), Shaquille (Cornell Young IV), Amir (Jordan Aaron Hall) and Hazel (Kennedi Reece) as she steps out of her parents’ shadow to build a legacy of her own at their alma mater.\n\nAdvertisement\n\nIn her first interview since the news broke, Pride, who’s also an executive producer on the series, tells HuffPost that she’s “still processing” her project’s milestone, having worked on it tirelessly for the past two-plus years. But that hasn’t been the most nerve-wracking part of the process.\n\n“TV development takes a lot of time anyway,” Pride said, “but it was less about how long for the decision [to greenlight the series] and more about making sure that everyone felt good about the show that we were creating.”\n\n(Left to right) Charnele Brown as Kimberly Reese, Jasmine Guy as Whitley Gilbert, Darryl Bell as Ron Johnson and Kadeem Hardison as Dwayne Wayne in a scene from \"A Different World.\" Everett Collection\n\nAdvertisement\n\nThat’s the biggest concern these days when it comes to nostalgic sequels, or at least it should be. We’ve seen follow-ups, reboots and reimaginings fall short of the originators time and time again because, let’s face it, it’s next to impossible to replicate the magic of the past if all the right pieces don’t come together.\n\nLucky for Pride, though, she has a “heavyweight” producing team that includes original director Debbie Allen — who returns to helm three episodes, including the first — returning producer Tom Werner, plus Mandy Summers, as well as original writers Reggie Rock Bythewood and Gina Prince-Bythewood, the Hollywood power couple who met while working on “A Different World.”\n\nPride first bumped into Allen during her time as a writer on “Grey’s Anatomy” — quite literally.\n\n“I was in her way, chile, on my first episode,” she jokingly recalled of Allen, who directs, executive produces and plays Dr. Catherine Fox on the series. “She was like, ‘Get out of my way.’ I said, ‘I’m sorry, I’m Felicia Pride.’ And she [goes], ‘I know who you are.’”\n\nAdvertisement\n\nThat unexpected moment stuck with Pride as proof of Allen’s “eye for talent across the board.” She also believes it had a lot to do with the legendary multihyphenate trusting her to continue the work Allen started when she took over “A Different World” after its first season.\n\n“That was one of the big things that helped me get over the hump. Like, OK, [Allen and team] want to do this. And they know better than I do,” Pride said. “Debbie had been trying to get this done for a long time, and she knew the power of continuing this story, and so it was me feeling honored that she saw something in me on ‘Grey’s Anatomy.’”\n\nWith so many original players on board, that’s all Pride needed to move forward with the “tough order” to revive the iconic show for old and new fans alike: “I was like, ‘OK, y’all feel good about [doing a sequel]. Then I feel good.’”\n\nAdvertisement\n\nBut Pride has a much bigger crowd to win over now that everything’s a go. She knows “A Different World” fans have high expectations for the follow-up to the staple sitcom, and according to her, the main priority is to stay true to the show’s core essence.\n\nThat means returning to the Hillman campus we all know and love because “it’s important to make sure that beloved fans feel seen,” as well as tackling the same kind of timely (and timeless) issues that made its predecessor such an influential anomaly.\n\n“I don’t think anybody signed on to do this sequel without knowing that that is part of the fabric of the show. Period,” Pride said. “There’s no way we can do ‘A Different World’ without speaking to the times.”\n\nAdvertisement\n\n“A Different World” isn’t the only show that has explored the Black college experience on-screen, but none have come nearly as close to what the cultural touchstone accomplished during its six-season run on NBC from 1987 to 1993. Beyond ushering HBCU culture into the TV mainstream, the groundbreaking series pushed the envelope in a way that broke barriers and took risks in the name of true-to-life storytelling.\n\nPride knows that’s a hard act to follow. Still, she’s excited to have the opportunity to offer that same experience to a whole new generation of viewers and, most of all, pay homage to a rich, lasting legacy.\n\n“That makes me feel purpose-driven,” said Pride. “Because this was a tough order. I did not wake up and be like, ‘I want to do this.’ As glamorous as it sounds, the pressure is real. I don’t want to mess up. But I know that it’s something that’s pulled me to this show through Debbie Allen that I’m like, ‘OK, I’m supposed to be here.’ Even though I’m scared. Even though I’m like, ‘Can I do this?’”\n\nAdvertisement\n\nShe added: “To be able to reflect young people back to themselves through an amazing cast, the help of an amazing writers room, and then a heavyweight executive-producing team, it is a dream. It is my highest honor to be able to do this.”\n\nPride co-executive-produced the fourth and final season of \"Bel-Air.\" \"You're going to get a lot of drama, a lot of soap,\" she says of what to expect. Peacock\n\nPride didn’t have to search far for inspiration for her upcoming sequel. Through her time executive producing “Bel-Air,” Peacock’s dramatized reimagining of “The Fresh Prince of Bel-Air,” the multihyphenate has witnessed firsthand what it takes to create a successful reinvention of another iconic sitcom.\n\nAdvertisement\n\n“You don’t realize how the experiences you have prepare you for the next,” Pride noted of the alignment.\n\nIt’s fitting that Pride’s latest TV venture arrives just as “Bel-Air” gears up for its fourth and final season, which kicks off Nov. 24. The show’s farewell, she admitted, is “bittersweet,” but the team entered production knowing it would be the last season, “so we were able to write to it.”\n\n“A lot of shows don’t get that luxury,” Pride added, “so it was such a gift to be able to be like, ‘How do we want to end this journey? And how do we want to end these characters?’”\n\nAdvertisement\n\nPride says “Bel-Air” fans can expect plenty in this final stretch, as the season tracks major turning points for the Banks family — Will (Jabari Banks) and Carlton (Olly Sholotan) preparing for college, a grieving Hilary (Coco Jones) embarking on a journey of self-discovery, high school freshman Ashley (Akira Akbar) entering her rebellious phase, an expecting Viv (Cassandra Freeman) awaiting a new addition to the family and Phil (Adrian Holmes) and Geoffrey (Jimmy Akingbola) continuing to navigate their complex brotherhood.\n\n“You’re going to get a lot of drama, a lot of soap,” Pride revealed. “You get romance, you get sexy, you get senior year of Will and Carlton, but a lot of surprises.”\n\n“I’m so excited and so proud of the work that everyone did and poured into this show,” she added. “Everyone who touched that show really cared about it, and you’re going to be able to see that on-screen.”\n\nAdvertisement\n\nIn 2021, Pride launched Honey Chile, a media and production company that aims to offer more visibility for older Black women and their stories. \"Being a woman of a certain age, being a Black woman over 40, I really want to tell those stories so specifically,\" she says. Peter Forest via Getty Images\n\nPride’s instinct for centering Black stories — across television, film and beyond — has always been innate. After the Baltimore native moved to Los Angeles at 35, hustling through Hollywood with the single screenplay that would eventually become her swoonworthy 2020 romantic drama “Really Love,” she was steadfast in her mission to break into the industry and tell those very stories.\n\n“I just love Black people,” Pride remarked. “There’s so much story that comes from Black people. There’s so much humor [and] humanity that comes from us. So for me, the stories are endless. And I just like to reflect ourselves back to each other.”\n\nAdvertisement\n\n“I’m just illuminating our humanity back to ourselves, and whoever else comes as part of that is welcome, and I love that,” she added. “But that’s really what my mission is.”\n\nPride has stayed true to that work by working on shows like “Bel-Air” and “Queen Sugar,” the latter of which, she said, “spoiled me in terms of telling a Black [story].” It also deepened her love for TV writing and all that comes with it — from time in the writers’ room (her favorite place) to “seeing how it all comes together on set.”\n\n“I just love the whole process,” Pride added. “And then I love watching the work — something that not all artists are granted.”\n\nAdvertisement\n\nThat’s especially true for women of a certain demographic. When she was 35, Pride didn’t realize that opportunities in television were available for older Black women beyond the Shonda Rhimeses and the Mara Brock Akils of the world — not until she was exposed to the industry herself. But she doesn’t want other women who look like her to remain unaware of those possibilities, too.\n\nThat’s what partially inspired Pride to, in 2021, launch Honey Chile, a media and production company that develops and creates work by, for and/or about Black women over 40, or Honeys, as she affectionately calls them.\n\nThe idea came from several observations about the industry. For one, Pride wanted more agency over her own projects, which has been historically challenging for marginalized creators with limited leverage in an industry dominated by big-name studios and networks.\n\nAdvertisement\n\nBut she also saw another gap: The shows airing at the time didn’t reflect “the conversations that I was having with my friends,” nor did she believe their lived experiences were being represented “in a plentiful way” in pop culture. So, she set out to address that void.\n\n“Being a woman of a certain age, being a Black woman over 40, I really want to tell those stories so specifically,” Pride explained of her company’s mission. “And it’s interesting, because that’s risky to tell Hollywood. Like, ‘Oh, I want to write for old bitches.’ But more opportunities have come my way because, again, it’s about a perspective. It’s about a lens.”\n\nOne of Pride's Honey Chile projects includes her latest book, \"Come Close,\" a \"meta\" novella set in her hometown that she plans to take to the silver screen. \"I'm adapting that, and we want to turn it into a feature film that we shoot in Baltimore,\" she says. Courtesy of Ascend PR\n\nAdvertisement\n\nOne of those opportunities includes Honey Chile’s first book, “Come Close,” a “very meta” novella by Pride set in her hometown and centered on a seasoned TV/film producer who gets a second chance at love with her high school sweetheart. The book was released in June, but Pride already has plans to bring it to the big screen.\n\n“I’m adapting that, and we want to turn it into a feature film that we shoot in Baltimore,” she shared, adding that the novel aligns with Honey Chile’s mission to own and produce its own IP, with more books on the way.\n\nThere are several more Honey Chile projects that Pride is excited to shepherd into existence, too, including a story about Black witches, plus a TV adaptation of Tia Williams’ bestselling novel, “Seven Days in June,” on which she’s set to serve as writer and showrunner.\n\nAdvertisement\n\nAt a time when DEI efforts are shrinking across Hollywood and investment in diverse creators and stories is waning, some could see Pride’s commitment to Honey Chile as a form of resistance. For her, however, it’s more so “an act of freedom.”\n\n“Our ability to make things without interference, our ability to tell the stories that we want to tell, our ability to own things,” Pride said. “I look at it all as an act of freedom.”\n\nThough true creative autonomy remains elusive for many Black creators in the industry, Pride hopes that Honey Chile will eventually help spark a long-overdue change across the board.\n\nAdvertisement\n\n“We operate from a mission, which is to tell stories that illuminate ourselves back to each other,” she explained. “We focus on telling stories, by, for and about Black women, and therefore Hollywood is just one part of that mission.”\n\nIn service of that mission, Pride’s company has expanded its reach through the aforementioned books, podcasting — the two-time NAACP Image Award–nominated “Chile, Please” — events and even its own editorial platform, Yes, Honey.\n\n“Because those are all the ways that we’re moving in the vision,” Pride added. “And as Hollywood acts up as it does, we find more strategic and creative ways to get it done and get our work in front of audiences.”\n\nAdvertisement",
  "authors": [
    "Culture Reporter"
  ],
  "url": "https://www.huffpost.com/entry/a-different-world-sequel-felicia-pride-black-stories_n_69151ffee4b0c2898bedb183"
}