{
  "title": "London Underground Art Deco posters on show at transport museum",
  "text": "'Golden age' London Underground posters go on show\n\n45 minutes ago Share Save Aurelia Foster London Share Save\n\nLondon Transport Museum Many of these century-old images are on public display for the first time\n\nAnna O'Neill London, London Transport Museum\n\nSome of the first graphic art posters displayed on the London Underground in the 1920s and 1930s have gone on show. The posters were created in distinctive Art Deco style at the peak of the design movement and were put up at Tube stations a century ago to encourage people to travel on the network to explore the city. The artworks typically feature London landmarks and depict aspirational scenes of high living and glamourous pastimes that the era is famed for. London Transport Museum, which is holding the exhibition of the posters, said they had become part of London Transport's world-famous visual identity.\n\nThe Art Deco: The Golden Age of Poster Design exhibition in the Global Poster Gallery features more than 100 posters that were used on the network during this era. About a third of these have never been displayed in public, according to the Covent Garden museum.\n\nLondon Transport Museum The posters typically carried simple messages, bold font and bright colours\n\nAs the main form of advertising at the time, they were put up at Tube stations to entice passengers to explore the city's leisure hotspots, shop the latest fashions, indulge in evening entertainment and embrace the thrill of modern travel. \"It really showed how modern London transport was, how progressive they were,\" exhibition curator Georgia Morley told BBC London. Although a century old, the posters were still appealing, with a \"glamourous and opulent feel\", Ms Morley said. \"A lot of the things these posters are advertising we still want to do in London today - going to the theatre, shopping, going to the zoo, or the riverside - they're still really exciting,\" she said. While posters promoting the network were first introduced in the early 1900s, Ms Morley said the Art Deco designs had been the most captivating to date. \"Art Deco was really effective in transport posters because it had bold lines, simple geometry, and really bright colours and when you're travelling on the Tube, you need to understand the message and the imagery immediately.\"\n\nLondon Transport Museum The artwork often used imagery of high living and glamourous leisure pursuits\n\nThe works were the first graphic art commissioned by former London Transport chief executive Frank Pick when he was in charge of publicity from 1908. Matt Brosnan, the museum's head curator, said the network needed to get more people using the service and buying tickets. \"He (Frank Pick) saw the opportunity for commissioning pictorial posters for the first time, which was quite a new thing at that point in history. \"That became a really useful and dominant marketing tool that the Underground used for decades afterwards, and it was also part of a much wider art and design aspect the Underground's identity.\"\n\nLondon Transport Museum The posters tried to entice people to explore the city's nightspots\n\nLondon Transport Museum The artwork often featured locations outside London to encourage train travel\n\nThe exhibition marks the centenary of the 1925 International Exhibition of Modern Decorative and Industrial Arts in Paris, which was believed to have catalysed mass appeal for the style. Dr Emma Bastin, a historian specialising in the early 20th Century, said the Art Deco style posters were \"enduring\". \"The art is 100 years old now but it still feels modern... they have an aspirational feel to them, so we can relate to these artworks, we can dream that we want to be in some of them,\" she said. \"I think a lot of it's down to the dreamlike vision these posters show and the art shows. \"It allows you to imagine yourself in another world and they still look like they could have been produced today so that's why people still love to put them on their walls.\"\n\nListen to the best of BBC Radio London on Sounds and follow BBC London on Facebook, X and Instagram. Send your story ideas to hello.bbclondon@bbc.co.uk",
  "authors": [],
  "url": "https://www.bbc.com/news/articles/cj97mw4dmwzo"
}