{
  "title": "How bad will Thanksgiving travel be in the US?",
  "text": "Experts say the US travel system should stabilise after the shutdown – but with millions hitting the roads and airports, a \"normal\" Thanksgiving will still feel very crowded.\n\nAs the United States emerges from a historic 43-day government shutdown, millions of travellers are preparing for one of the busiest travel weekends of the year. Despite the weeks of disruption across transportation agencies, experts say the system is likely to stabilise in time for Thanksgiving. But a \"normal\" Thanksgiving still means packed roads, long queues and full flights.\n\nDuring the shutdown, thousands of federal employees – including Transportation Security Administration (TSA) officers and air traffic controllers – worked without pay, contributing to staffing shortages at airports and national parks. To address this, the Federal Aviation Administration (FAA) issued an emergency order that temporarily restricted US airspace and mandated flight reductions, leading to airport delays and long security lines. Those restrictions have now been lifted after Congress passed a funding bill that ended the stalemate and allowed the government to reopen.\n\nAccording to Erik Hansen, vice president of government relations for the US Travel Association, operations should get back to normal fairly quickly. Here's what that means for Americans and visitors looking to travel on or around Thanksgiving weekend.\n\nAir travel: 'Just as functional'\n\nIn a 16 November statement, US Transportation Secretary Sean Duffy said that \"controllers have returned to their posts and normal operations can resume\".\n\nHansen agrees: \"We expect it to take a few days to get back to [normal for our] air travel system,\" he says. \"But by the time we get to Thanksgiving, I think our system will be just as functional as it always is.\"\n\nAccording to a travel forecast released by the American Automobile Association (AAA), nearly 82 million Americans will travel at least 50 miles from home this Thanksgiving, by air and road, making it one of the busiest Thanksgivings on record and outpacing summer's peak holiday weekends, Memorial Day and 4 July.\n\nHansen notes that many travellers cancelled or altered their plans in anticipation of a prolonged shutdown, which could mean lower-than-usual airfares – and potentially a bit more traffic on the roads. He also predicts that last-minute Thanksgiving airfare deals may make for an even busier airport experience. Travellers are encouraged to show up early for flights and expect long lines.",
  "authors": [],
  "url": "https://www.bbc.com/travel/article/20251119-how-bad-will-thanksgiving-travel-be-in-the-us"
}