{
  "title": "NASA Finally Weighs In on the Origin of 3I/ATLAS",
  "text": "After the prolonged shutdown of the US government, NASA has finally started its nonessential work back up. It's starting off with a bang: The agency called a press conference to show its hitherto reserved images of the interstellar object 3I/ATLAS. NASA scientists also confirmed that 3I/ATLAS is in fact a comet, contrary to the speculations about alien technology flooding the internet.\n\nDuring the broadcast, a panel of scientists showed the results of observations obtained by different NASA missions across various points in the journey 3I/ATLAS has taken. Each provided insights in the infrared, visible, ultraviolet, and gamma-ray spectrums, providing a better understanding of the true nature of 3I/ATLAS.\n\nAmong the most relevant data are images captured by the Mars Reconnaissance Orbiter and MAVEN satellites, as well as those from the Psyche and Lucy space probes, and even from the SOHO solar probe. The scientists clarified that all the data will be publicly available for anyone to investigate.\n\n3I/ATLAS Images Shared by NASA\n\nThe shape of 3I/ATLAS as seen by the SOHO solar probe. Lowell Observatory/Qicheng Zhang/NASA\n\nSOHO: Image From the Sun-Monitoring Probe\n\nThis orange-toned photo comes from NASA. The SOHO probe that monitors the sun managed to capture 3I/ATLAS between October 15 and 26. In the words of the agency, this image was a surprise. They did not expect that the object could be seen from so far away, 358 million kilometers.\n\n3I/ATLAS as seen from the Mars Reconnaissance Orbiter. NASA\n\nMRO: One of the Best Close-Ups of 3I/ATLAS\n\nOne of the most anticipated photos of the comet is the one obtained by the Mars Reconnaissance Orbiter satellite in October, when 3I/ATLAS approached at “only” 29 million kilometers. NASA finally shared it. The image shows the frozen body surrounded by a cloud of characteristic dust ejected as the comet approached the sun.\n\nNASA's STEREO (Solar Terrestrial Relations Observatory) observed interstellar comet 3I/ATLAS from September 11 to October 25. NASA/Observatorio Lowell/Qicheng Zhang\n\nSTEREO: The Photo Confirming the Shape of 3I/ATLAS\n\nThe STEREO observatory analyzes the behavior of the sun. To get at least one coherent image of the comet, scientists had to stack several images taken at different exposures. In the end, the interstellar object was revealed as a bright orb against a noisy background.\n\nImage of the water signature of 3I/ATLAS taken by the MAVEN satellite. NASA\n\nMAVEN: A Glimpse of Comet Hydrogen\n\nMAVEN is a Mars orbiter. Its lens captured this ultraviolet spectrum image of 3I/ATLAS before it reached its closest approach to the Red Planet. It shows hydrogen emitted from different sources. The portion on the left belongs to the comet's signature.\n\nThis movie shows PUNCH observations of comet 3I/ATLAS from September 28 to October 10, 2025, NASA/Instituto de Investigación del Suroeste\n\nPUNCH: Another Solar Glimpse\n\nPUNCH is a polarimeter that monitors the sun's corona and its heliosphere. However, its lenses made it possible to visualize the comet's tail for weeks from October to September. In this animation, each frame represents a daily snapshot, while the streaks in the background are produced by the movement of the stars.\n\nOn December 19, 2025, the comet will reach its closest point to Earth. It will pass at a completely safe distance: about 267 million kilometers away. To put that in perspective, it's equivalent to almost 700 times the distance between the Earth and the moon, and 1.8 times the separation between our planet and the sun. This flyby will have no effect on the Earth.\n\nBoth NASA and other space agencies are expected to initiate additional observing campaigns to capture better photographs and relevant information about the third confirmed interstellar object in history.\n\nThis story originally appeared in WIRED en Español and has been translated from Spanish.",
  "authors": [
    "Jorge Garay"
  ],
  "url": "https://www.wired.com/story/nasa-confirms-that-3i-atlas-is-an-interstellar-comet/"
}