{
  "title": "US and Asia stocks slide as AI jitters persist",
  "text": "US and Asia stocks slide as AI jitters persist\n\n1 hour ago Share Save Danielle Kaye Business reporter Share Save\n\nReuters The three major stock indexes in the US resumed their slide on Thursday, reversing course after an early morning rally.\n\nA burst of solid business news in the US was supposed to calm markets, which have been in retreat in recent weeks. But strong sales at artificial intelligence (AI) chip giant Nvidia and the world's largest retailer Walmart, better-than-expected hiring in September, and even a pickup in home sales have so far done little to quell investor worries. The three biggest US stock indexes US resumed their slide on Thursday, reversing course after an early morning rally. The S&P 500 ended the day 1.5% lower, the Dow Jones Industrial Average fell 0.8% and the Nasdaq lost more than 2%. On Friday, major stock markets in Asia also lost ground.\n\nIn New York, shares in Nvidia, which had surged in Thursday morning trading, fell by more than 3%. \"The reaction is noteworthy, because what should have happened, didn't happen,\" said James Stanley, a senior analyst at StoneX, referring to the sudden fade in the broader US market rally on Thursday. \"You've got to ask what's happening under the surface.\" In Asia, Japan's Nikkei 225 was down by more than 2.5% after the lunch break, with technology investment giant Softbank plunging by over 10%. South Korea's Kospi was down by around 4%. Shares in chipmaker SK Hynix fell more than 8% and Samsung was nearly 6% lower. Hong Kong's Hang Seng was down by almost 2%. The price of Bitcoin also fell on Thursday, extending recent declines and falling below $90,000 to its lowest since April. Analysts attributed the drop to, in part, concern about AI valuations. Fears of an AI bubble continue to swirl, even though Nvidia's results, which showed the chip giant powering on amid robust demand for its AI chips, briefly lifted stocks after-hours on Wednesday and early Thursday. Chief executive Jensen Huang dismissed concerns that AI companies are overvalued. \"From our vantage point, we see something very different,\" he said on a call with analysts. But fears on Wall Street persist, investment analysts said, despite Mr Huang's reassurance and blockbuster results from the chip-maker, which is seen as a bellwether for the AI boom. Those fears have picked up this month. Speaking to the BBC this month, Alphabet chief executive Sundar Pichai warned of some \"irrationality\" in the current AI boom. Analysts with Oxford Economics said the recent technology draw-down signals \"a healthy correction rather than the start of something more threatening\". Earlier this week, they warned that tech stocks might suffer from profit taking in the near term, but noted that \"it's too early to call an end to the AI investment boom\".",
  "authors": [],
  "url": "https://www.bbc.com/news/articles/cwy1yl1202yo"
}