{
  "title": "La expulsión forzada de palestinos de los campos de refugiados de la Ribera Occidental es un crimen de guerra, alega HRW",
  "text": "CNN —\n\nLa expulsión forzada de decenas de miles de palestinos de los campos de refugiados en la Ribera Occidental ocupada a principios de este año equivale a crímenes de guerra y crímenes de lesa humanidad, ha alegado Human Rights Watch (HRW).\n\nSegún un informe de 105 páginas publicado por la organización sin fines de lucro, 32.000 palestinos fueron expulsados por las fuerzas israelíes de tres campos en enero y febrero, mientras la atención internacional se centraba en la guerra de Israel en Gaza, y no se les ha permitido regresar.\n\nComo parte de su investigación, HRW dijo que entrevistó a 31 refugiados palestinos desplazados de los campos de refugiados de Jenin, Tulkarem y Nur Shams. La organización también analizó imágenes satelitales y órdenes de demolición militar israelíes, así como videos e imágenes verificadas de operaciones militares israelíes.\n\nEn respuesta al informe, las Fuerzas de Defensa de Israel (FDI) dijeron a CNN en un comunicado que el ejército lanzó lo que llamó la Operación “Muro de Hierro” en los tres campos hace 10 meses “a la luz de las amenazas de seguridad planteadas por estos campos y la creciente presencia de elementos terroristas dentro de ellos”.\n\nLas FDI dijeron que destruyeron “filas de edificios” para crear “nuevas rutas de acceso dentro de los campos”. El ejército dijo que la decisión de demoler los edificios “se tomó basándose en la necesidad operativa, con una cuidadosa consideración y solo después de que se examinaran opciones alternativas para lograr la misma ventaja militar”.\n\nLas FDI afirmaron que “las demoliciones se llevaron a cabo legalmente, basadas en la necesidad militar y con la proporcionalidad requerida” y que “el terrorismo en Judea y Samaria ha disminuido en un 70 %” desde el inicio de la operación, utilizando el término bíblico para la Ribera Occidental.\n\nEl informe de HRW sostiene que Israel irrumpió en el campo de refugiados de Jenin el 21 de enero, con helicópteros Apache, drones, excavadoras y vehículos blindados que transportaban fuerzas terrestres, para expulsar a los palestinos que vivían allí.\n\nOperaciones similares se llevaron a cabo en Tulkarem el 27 de enero y en Nur Shams el 9 de febrero.\n\nLos soldados israelíes “gritaban y lanzaban cosas por todas partes… Era como una escena de película: algunos tenían máscaras y portaban todo tipo de armas”, relató a HRW una mujer de 54 años.\n\nLos palestinos comienzan a irse mientras se observa a las fuerzas israelíes tomando medidas de seguridad en el campo de refugiados de Nur Shams el 10 de febrero de 2025. Issam Rimawi/Anadolu/Getty Images\n\nLos palestinos desplazados no han recibido permiso para regresar a sus hogares, de acuerdo con el informe, que añade que los soldados israelíes dispararon contra quienes intentaron reingresar. Solo a unos pocos se les ha permitido recoger sus pertenencias, dice, mientras que el análisis de imágenes satelitales de HRW seis meses después encontró que más de 850 viviendas y otros edificios fueron dañados o destruidos en los campos.\n\nNo se ofreció refugio ni asistencia humanitaria a los residentes desplazados por parte de las fuerzas israelíes, según el informe. En cambio, las personas quedaron a su suerte, buscando refugio donde podían, incluso hacinándose en casas de familiares o amigos, o llegando a mezquitas u organizaciones benéficas locales.\n\nLos tres campos se remontan a principios de la década de 1950, cuando fueron establecidos por la Agencia de Naciones Unidas para la población refugiada de Palestina en Oriente Próximo (UNRWA, por sus siglas en inglés) para albergar a palestinos que fueron expulsados de sus hogares o forzados a huir tras la creación de Israel en 1948. Esos refugiados y sus descendientes han residido allí desde entonces.\n\n“Las autoridades israelíes a principios de 2025 expulsaron por la fuerza a 32.000 palestinos de sus hogares en campos de refugiados de la Ribera Occidental sin tener en cuenta las protecciones legales internacionales y no les han permitido regresar”, dijo Nadia Hardman, investigadora principal de derechos de los migrantes en HRW.\n\n“Con la atención mundial centrada en Gaza, las fuerzas israelíes han cometido crímenes de guerra, crímenes de lesa humanidad y limpieza étnica en la Ribera Occidental que deben ser investigados y procesados”.\n\nDesde los ataques llevados a cabo por Hamas el 7 de octubre de 2023, las fuerzas israelíes han intensificado las operaciones en toda la Ribera Occidental, atacando células militantes palestinas, imponiendo controles y aislando comunidades del mundo exterior. También ha habido un aumento en los ataques de colonos israelíes y apropiaciones de tierras en el lugar. Los asentamientos israelíes en la Ribera Occidental se consideran ilegales según el derecho internacional.\n\nHRW ahora está pidiendo que se investigue a altos funcionarios israelíes por las expulsiones, incluido el primer ministro, Benjamin Netanyahu, el ministro de Finanzas, Bezalel Smotrich, y el general de división Avi Bluth, el comandante del Comando Central que supervisó las operaciones militares en la Ribera Occidental.\n\nCuando se determine su responsabilidad, deberían ser procesados por crímenes de guerra y crímenes de lesa humanidad, dijo la organización.",
  "authors": [
    "Sophie Tanno"
  ],
  "url": "https://cnnespanol.cnn.com/2025/11/20/mundo/expulsion-palestinos-campos-refugiados-crimen-de-guerra-trax"
}