{
  "title": "Epstein files: Washington on tenterhooks after Trump signs bill",
  "text": "What now?\n\nThe drama, emotion and shock of Congress’s sudden demand for transparency on the Jeffrey Epstein drama has ceded to uncertainty and suspicion that President Donald Trump will try to wriggle off the political hook.\n\nThe victims of Epstein, an accused sex trafficker, have tragically seen justice postponed before. They’d been quick to warn after an unprecedented Republican revolt against Trump on Tuesday that it was just one more step in their long quest for vindication. Their wisdom was obvious once the euphoria of their triumph began to clear.\n\nWashington waited all day Wednesday to find out that Trump had signed the bill passed with a 427-1 majority in the House and waved through on unanimous consent by the Senate, which had no desire to be drawn into the president’s self-inflicted political crisis. The measure requires the Justice Department to release all investigative files, documents and other materials about Epstein, with some exceptions, within 30 days of it becoming law. It’s hardly surprising that Trump didn’t rush to sign it, since, despite his late embrace of the legislation, it repudiated his weekslong bid to keep the evidence secret.\n\nTrump was in a box. Any presidential veto was likely to be overturned, judging by the congressional majorities for the bill. But now his Justice Department — in theory at least — is bound to implement it. Any foot-dragging or obstruction would certainly worsen already disastrous public disapproval of his handling of the issue and would only fuel the question that got him into his current mess: What is he trying to hide?\n\nPresident Donald Trump's shadow is cast on an American flag as he walks on stage to speak in Miami, on November 5. Carl Juste/Miami Herald/TNS/Getty Images\n\nThe political battle to come\n\nEpstein survivors and Trump critics are turning to the next stage of the political battle over the documents, but there is almost no clarity over if and when evidence will come out — and how much.\n\nLawmakers who endorsed the bill seemed unclear what would happen if Trump just ignored it. And Trump’s Attorney General Pam Bondi put on a flustered public performance that fostered little confidence that she would obey Congress or that the administration has a coherent political plan.\n\nThere were also new indications of the depth of the bipartisan morass over Epstein and the likelihood that the release of Justice Department files could cause deep embarrassment for many prominent business and political leaders, entertainment stars and even royalty who associated with him.\n\nLarry Summers, a former Treasury secretary and top White House official in Democratic administrations resigned from the board of OpenAI after the release of emails revealed his friendly correspondence with Epstein. Summers also will not finish out the semester in his instructor role at Harvard University, a school spokesperson confirmed Wednesday.\n\nAnd Stacey Plaskett, a Democrat who represents the US Virgin Islands in Congress as a non-voting delegate, struggled for a convincing explanation of why she texted with Epstein during a congressional hearing in 2019.\n\nNo one can say where this extraordinary scandal with far-reaching consequences will go next. But one thing is clear — it is deeply damaging Trump, both in wider public opinion and because of a never-before-seen split that it has opened in the MAGA movement.\n\nA newly released Marquette University poll — conducted November 5-12, before many of the saga’s latest developments — found that 74% of adults disapproved of Trump’s handling of the Epstein affair. And only 43% of Republicans approved. Marquette’s question asking Americans to choose their top issue didn’t include Epstein on the list. But it found that Americans cared deeply about the economy and the cost of living, on which they gave Trump overwhelmingly negative report cards.\n\nDOJ is yet to show its cards\n\nSuch is the reputation of Trump’s Department of Justice — a fully coopted branch of his political machine — that few observers in Washington expect Bondi to follow the letter of the law just established by Congress.\n\nSenate Democratic Leader Chuck Schumer warned that his party would be ready to hold Trump to account. This shows that Democrats believe that Trump’s exposure to the Epstein drama will outweigh any embarrassment that disclosures could bring to other prominent Democrats.\n\n“There must be no funny business from Donald Trump,” Schumer said. “This bill is a command for the president to be fully transparent, to come fully clean, and to provide full honesty to the American people, even if he doesn’t want to.”\n\nSchumer referred to the possibility that the DOJ could seek an end run around the bill. It could potentially cite investigations into prominent Democrats and Epstein that Trump ordered last week to argue against the release of evidence. Another possibility is that evidence could be released but redacted in such a way as to make it almost meaningless on the premise that officials were protecting victims, witnesses or people who committed no criminal wrongdoing.\n\nSenate Democratic Leader Chuck Schumer conducts a news conference in the Capitol on Wednesday. Tom Williams/CQ-Roll Call, Inc/Getty Images\n\nSome Democrats fear the DOJ will scrub any references to the president himself in the files. There has been no evidence of criminal wrongdoing by Trump in relation to Epstein. But emails released by Congress showed multiple mentions of him by Epstein and his jailed associate Ghislaine Maxwell.\n\nConnecticut Democratic Sen. Richard Blumenthal told CNN’s John Berman on Wednesday that he had “no trust, no confidence whatsoever … that this Justice Department will be evenhanded or fair in the disclosure of these files.” He added, “It will be on us in Congress, and hopefully a bipartisan effort, to scrutinize and oversee this process.”\n\nThe Republican rebellion against Trump on the Epstein files — an issue that obsesses parts of the Republican base — is one thing. But it’s unclear whether GOP lawmakers would risk the kind of vigorous oversight to which they’ve never subjected Trump to force his compliance with their law. Pressure from Epstein victims could be important in this regard.\n\nSeveral senators expressed hopes Wednesday that the administration would show good faith. Missouri Republican Sen. Josh Hawley said he’d “be really surprised” if the DOJ refused to release all the required information “given the huge bipartisan” support for the measure. Missouri’s other senator, Eric Schmitt, said that “all the credible information that can be released should be released.” And Democratic Sen. Dick Durbin of Illinois told CNN’s Manu Raju he hoped Trump wouldn’t “defy the act of Congress.”\n\nAt the Justice Department, Bondi was asked why she had agreed to Trump’s demand to investigate Democrats over Epstein — which critics say was an archly political move — after arguing earlier this year that the evidence suggested no new probes were necessary.\n\n“Information. Information. There’s information that, new information, additional information,” Bondi said, while offering no clarity on the situation. And she repeatedly told reporters, “We will follow the law, we will continue to follow the law, while protecting victims and also providing maximum transparency.”\n\nThis only underscored the great unknowns about what will happen next. Given the extraordinary movement in the saga so far, it seems impossible to believe that the files won’t come out, somehow, eventually. If the administration stalls or obstructs, it’s possible DOJ whistleblowers will emerge.\n\nRepublican lawmakers keen to get to Trump’s right on the issue ahead of midterm elections might discover a political motive to join colleagues like Georgia Rep. Marjorie Taylor Greene in pushing for transparency. GOP Rep. Thomas Massie of Kentucky has warned he’d be ready to read aspects of the evidence surrounding Epstein into the record of the House. And a delay could help Democrats weaponize the issue ahead of midterm elections.\n\nThe survivors will be waiting.\n\n“I’m hoping that they’re going to do the right thing and release everything,” Sharlene Rochard, a victim of Epstein’s abuse, told CNN’s Audie Cornish. “We just want proof that this happened to us. … And we want to help other girls (so) that — that this doesn’t happen again.”",
  "authors": [
    "Stephen Collinson"
  ],
  "url": "https://www.cnn.com/2025/11/20/politics/trump-epstein-bill-larry-summers-congress-analysis"
}