{
  "title": "Body Language Experts Analyze Trump Answering Questions About Epstein",
  "text": "LOADING ERROR LOADING\n\nPresident Donald Trump cannot seem to get away from questions about Jeffrey Epstein.\n\nIn 2025 alone, the president and his camp’s recorded response to information on the case have run the gamut from Pam Bondi promising that the files were “on [her] desk to review” in February to the president himself questioning why “fake news” outlets would ask questions about the case that he deemed a “hoax” and having a very public falling out with former ally Marjorie Taylor Greene in the process.\n\n“The Democrats are trying to bring up the Jeffrey Epstein Hoax again because they’ll do anything at all to deflect on how badly they’ve done on the Shutdown, and so many other subjects,” the president wrote in a post on Truth Social on Nov. 12. “Only a very bad, or stupid, Republican would fall into that trap.”\n\nAdvertisement\n\nGetty Images/Huffpost President Donald Trump's body language in previous exchanges about Epstein could reveal a bit more about how the White House is handling the increased attention to the case. One expert points out that the frequently seen \"overlapping\" positions of Trump and his team stand out as \"odd.\"\n\nThese dismissals all eventually came to a head on Sunday when the president abruptly shifted gears and said he now supported Republicans voting for a release of the Epstein files.\n\nTo better understand the ups, downs, backs and forths of the president’s relationship to the Epstein investigation, HuffPost asked body language experts to take at the nonverbal communication on display when the president was asked about the case.\n\nAdvertisement\n\nExperts feel he’s pushing back against being asked these questions.\n\nChronologically, the first clip we looked at was from July 8, 2025, when Trump was asked in a cabinet meeting about a report that claimed Epstein had “no client list.” Trump proceeded to ask why people were still asking questions about the disgraced financier.\n\n“Are you still talking about Jeffrey Epstein? This guy has been talked about for years,” Trump said. “...Are people still talking about this guy, this creep? That is unbelievable,” turning to ask Bondi if she wanted to “waste the time” to answer the question.\n\n“He gives the universal sign for stop at the very beginning with both palms out,” Body Language Expert & Behavior Analyst Traci Brown told HuffPost. “He says he doesn’t have time to talk about it then goes on and on talking about how bad the question is.”\n\nAdvertisement\n\n“One of the things that’s interesting there is he starts to respond but then he looks at Pam Bondi — and it’s what I call a ‘rescue look,’” said Patti Wood, a body language and nonverbal communication expert, and author of “SNAP: Making the Most of First Impressions, Body Language, and Charisma.” “He tries to defer.”\n\nWood said that it differs from usual approach: “His normal strategy is to give a nonresponse and attack the reporter. Here, he is sitting at this conference table and he defers to [Bondi], and then he comes back” to cast doubt on the validity of the question.\n\nShe notes that when Trump begins to emphasize that he disagreed with being asked about this at the time, his hands display a tell: “His hands go up. He’s looking at the reporter, he’s got his hands out toward the reporter,” Wood explained. “He’s aggressively pushing... symbolically pushing the reporter away.”\n\nAdvertisement\n\nTrump claims he doesn’t understand the interest in this story, but his body language implies he could be ’holding back info or emotions.’\n\nIn the next clip we looked at, Trump was taking questions from reporters at Joint Base Andrews on July 15, 2025, and was asked why he thought his supporters were so fixated on the larger Epstein story, despite his urging that they “move on.”\n\n“Why they would be so interested? He’s dead for a long time,” Trump said. “It was never a big factor in terms of life. I don’t understand what the interest or what the fascination is, I really don’t.”\n\nAdvertisement\n\nHe went on to describe the whole case as “pretty boring stuff. It’s sordid, but it’s boring,” before adding that he thought “really only pretty bad people, including fake news, want to keep something like that going.”\n\n“The big tell is that Trump starts answering the question before the reporter is finished talking,” Brown said, noting how Trump began speaking shortly after it was clear the question was about the Epstein case. “That’s a change in his usual baseline. Most often he waits.”\n\nEvan Vucci via Associated Press Trump speaks to the media after arriving at Joint Base Andrews on July 15, 2025, in Joint Base Andrews, Maryland, as Secretary of the Interior Doug Burgum (left), Secretary of Commerce Howard Lutnick and White House press secretary Karoline Leavitt look on.\n\nAdvertisement\n\nWood also noticed that he offered an “immediate head-shake ‘no’” as the reporter asked the question. Further, she noted that his facial expression is telling.\n\n“He does a crooked sneer. The sneer goes all the way up,” Wood said. “Part of that body language is the nose crinkles with the mouth, his upper lip goes up, showing his front teeth.”\n\n“He sucks his lips in after he says he doesn’t understand the fascination,” Brown said, noting that this move can typically point to “holding back info or emotions.”\n\nAdvertisement\n\nThe emphasis on his words was also “very revealing,” Wood said.\n\n“He does a vocal emphasis about Epstein and says, ’He’s been dead for a long time.’ He really strikes it. He says it loudly with vocal violence and symbolically, the read on that, it indicates he believes Epstein’s death should’ve made... the crisis disappear,” Wood said. “Within the context of everything else he said, it was quite dramatic.”\n\nShe also notes the odd phrasing combined with a shrugging action when he said the case was “never a big factor in terms of life” and when he simultaneously describes the case as both “sordid” and “boring.”\n\n“Rhetorically, that’s fascinating,” Wood said. “He’s trying to say it’s boring. He uses the word ‘boring’ twice, but he can’t help mention that it’s sordid, which is the opposite of boring.”\n\nAdvertisement\n\nThe shrug, Wood said, may also indicate that “Trump wants to shrug off Epstein’s existence.” She noted that it is a strange rhetorical choice given the horrifying nature of the crimes linked with Epstein and the high-profile nature of the case.\n\n“In context, it’s sort of odd to shrug off this seeming-suicide and the life of this person,” Wood said. “A shrug is an awkward, weird way to do it.”\n\nExperts interpret one response as a ‘death glare’ when asked a question about the case.\n\nThe next clip, from an event signing an executive order bringing back the presidential fitness test at the end of July 2025, featured Trump (and it is impossible to ignore that he was flanked by wrestler Triple H) discussing reports that Epstein “stole” young women who worked at Mar-a-Lago spa, including the late Virginia Giuffre, one of the most well-known accusers.\n\nAdvertisement\n\nA reporter from ABC asked the president to respond to a statement from Giuffre’s family on his recent comments, asking if he knew at the time “why he was taking those young women.”\n\nHis response fell into “his old pattern of insults to avoid the question,” Brown said.\n\n“No, I didn’t know why. I figured it was ABC fake news that would ask that question — one of the worst — but, no. I don’t know really why,” Trump replied, first attacking the outlet the question came from. “But I said if he’s taken anybody from Mar-a-Lago, he’s hiring or whatever he’s doing, I didn’t like it and we threw him out. We said, ‘We don’t want him at the place.’”\n\nJacquelyn Martin via Associated Press Trump speaks as professional golfer Bryson DeChambeau, from left, Cody Campbell, WWE CCO Triple H, Kansas City Chiefs NFL football player Harrison Butker, and Health and Human Services Secretary Robert F. Kennedy Jr. listen during an event for the signing of an executive order restarting the Presidential Fitness Test in public schools on July 31, 2025, in the Roosevelt Room of the White House in Washington.\n\nAdvertisement\n\n“He does a death glare,” Wood said. “He gives a death glare to the reporter and his mouth is in a small, crooked frown. It’s scary to think what that reporter felt. He’s done that a lot lately. It’s a scary glare.”\n\nWood also noted that Trump’s body language suggested discomfort with the question in a few key ways: with his eyes (blinking, shutting his eyes) and in how his whole body moved during the exchange (away from the reporter and the question).\n\n“As the question proceeds, he blinks, he shutters his eyes, which means you’re blocking the question, you don’t want the question,” Wood said. “As he’s finished being asked, he does several things right away: His head pulls back quickly and then his whole body kind of jumps back. He does what’s called a ‘body adjustment,’ meaning he moves around in stress.”\n\nAdvertisement\n\nShe says this kind of movement could be a subtle sign of the “flight response” in action.\n\n“You might see that in a lost child or a tired unhappy child... the slacked-jaw and the downward, unfocused gaze. It’s just not normal for adults in this situation.” - Patti Wood, body language and nonverbal communication expert\n\n“It’s the pull-back, the jump-back, the moving around, his body wants to leave and get out of the situation,” she said. “He’s not running away from the situation, but the head back, the body back adjustment are all indication that he wants to get out of that situation.”\n\nShe also noted that as he continues his answer, he appears to give a “sad” expression, with “an unfocused gaze, slacked-jaw and open mouth.”\n\nAdvertisement\n\n“This is something he’s been doing more often, but it’s very odd,” she said. “That combination: the slack jaw on the open mouth. It’s not common in competent adults. You might see that in a lost child or a tired unhappy child... the slacked-jaw and the downward, unfocused gaze. It’s just not normal for adults in this situation.”\n\n“Especially when it’s a serious question, he’s in a serious situation being asked a serious question — and he’s sad and unfocused at the end of it like it has a lack of energy around it.”\n\nHe isn’t standing alone, which is also telling, according to experts.\n\nThe final clip we looked at with our experts was from the Nov. 12, 2025, televised signing of the bill ending the government shutdown. The clip featured a notably abrupt ending to questions when Epstein’s name is mentioned where aids are physically between the president and the crowd of reporters as they end the exchange.\n\nAdvertisement\n\n“He’s just using the chaos around to avoid the question,” Brown said. “He doesn’t even acknowledge it.”\n\nWood describes this moment as seeming “very immediate and hurried,” and said the immediacy in which the team blocked the view and moved to end the interaction “tells you how upset everybody on his team is and how much they are protecting him.”\n\n“It seems really obvious, but I think it needs to be said out loud: They immediately stepped in front of him and pushed those reporters out,” Wood noted, describing the moment in the clip where a woman in a tan suit steps in front of the camera.\n\nAdvertisement\n\nAnother observation that Wood makes is that there’s consistently been an “odd” feature to how Trump is positioned in relation to his team and cabinet members: Their body language actually overlaps.\n\nJacquelyn Martin via Associated Press Trump signs the funding bill to reopen the government in the Oval Office of the White House on Nov. 12, 2025, in Washington.\n\nHistorically, presidents are usually given a decent amount of space in public settings, Wood explained. In American culture, we usually offer 14-18 inches of space to one another — and that space is typically given even more-so to people in power.\n\nAdvertisement\n\nWhile there are photo op formations that undoubtedly will ask folks to scooch together a little bit more to fit in the frame, this positioning for commentary or formal addresses is really uncommon, Wood said. In fact, it’s a positioning that is a lot more familiar for couples: “It means they want to be seen as a unit.”\n\n“I don’t know if anybody’s talked about how odd that is, that he has to be flanked by other people in all these situations,” Wood said. “Usually there’s a sort of space between the president and other people sitting or standing at the conference table at a podium.”\n\n“What I’m seeing is, not only is he flanked, he’s never alone. They’re in that close zone of space. If you look at those pictures, they’re overlapping body language with him shoulder to shoulder,” Wood continued. “That is so highly unusual, it could indicate they might need to not just protect him, but hold him up.”\n\nAdvertisement\n\nTrump’s face, however, does still manage to tell us something, Wood said.",
  "authors": [
    "Senior Editor",
    "Family"
  ],
  "url": "https://www.huffpost.com/entry/trump-epstein-questions-body-language-analysis_n_69175904e4b0781acfd5f12b?origin=home-life-feed-unit"
}