{
  "title": "'Paintings were suddenly seen as money': The reason art heists exploded in the 1970s",
  "text": "Acclaimed new film The Mastermind, starring Josh O'Connor, tells the story of an art robbery gone wrong. It's inspired by a wave of similar thefts during a decade known for upheaval.\n\nIn May 1972, two men walked into the Worcester Art Museum in Massachusetts and hurried out carrying four paintings by Paul Gauguin, Pablo Picasso and a supposed Rembrandt (now believed to be the work of one of his students), holding a group of visiting high school students at gunpoint and shooting a security guard in the process. With the stolen artworks' worth tallying up to $2m (£1.5m), the New York Times ranked it among \"the largest art robberies in modern times\". Some say it even inspired a far more famous crime nearby: the 1990 heist at Boston's Isabella Stewart Gardner Museum, in which $500m (£370m) of art was looted, making it the costliest theft in US history full stop, with the crime remaining unsolved.\n\nThe Worcester heist was orchestrated by career criminal Florian \"Al\" Monday, but the game was up after the two thieves he hired for the raid boasted about their exploits in their local bar. Within a month, the paintings were safely retrieved from a pig farm in Rhode Island and returned to the gallery. \"Ironically, Monday – before he was an art thief – had a band, and I have the 45 of his record,\" writer-director Kelly Reichardt tells the BBC. Her new film The Mastermind, which is released in the US this weekend, is loosely inspired by the chain of events that followed the Worcester robbery, as well as the wave of art heists that followed over the course of that decade.\n\nMubi New film The Mastermind centres on middle-class art school drop-out turned robber JB (played by Josh O'Connor) (Credit: Mubi)\n\nPraised by The Guardian's film critic Peter Bradshaw for locating \"the unglamour in the heist\", Reichardt's thoughtful art crime caper dismantles the usual rules of the glitzy, sensationalised heist movie. Blockbusters have long popularised the idea that there is something classy about this category of crime, particularly when it involves art: think, for example, of the 1999 version of The Thomas Crown Affair, in which Pierce Brosnan plays a very suave billionaire orchestrating a raid on New York's Metropolitan Museum of Art.",
  "authors": [],
  "url": "https://www.bbc.com/culture/article/20251016-the-reason-art-heists-exploded-in-the-1970s"
}