{
  "title": "'We don't see why people should persecute us': Why the teenage David Bowie was already a rebel",
  "text": "On 12 November 1964, the would-be pop star told the BBC that cruelty to hirsute men \"just has to stop\". It was a cheeky stunt, but it hinted at the unconventional spirit that Bowie carried into a career of fearless reinvention.\n\nWe're used to seeing awkward high-school yearbook photos of future stars, barely recognisable before fame transformed them. This 1964 BBC television clip is different. The 17-year-old sitting in a current-affairs studio is unmistakably David Bowie, although at the time he was still plain old David Jones. As founder of the Society for the Prevention of Cruelty to Long-Haired Men, he was there to make a plea for understanding. \"I think we're all fairly tolerant, but for the last two years we've had comments like, 'Darling!' and 'Can I carry your handbag?' thrown at us, and I think it just has to stop now,\" he told the presenter, Cliff Michelmore.\n\nThe Tonight programme's researchers had picked up on an Evening News interview published a week earlier with \"David Jones of Plaistow Grove, Bromley\", the founder and president of the International League for the Preservation of Animal Filament, who \"gave up a commercial art job to go into the pop business\". Jones told the newspaper: \"Anyone who has the courage to wear hair down to his shoulders has to go through hell. It's time we united and stood up for our curls.\" The mention of the \"pop business\" provides a clue that this might have been a publicity stunt. After all, he had already appeared on a BBC music programme four months earlier as lead singer of Davie Jones and the King Bees.\n\nWATCH: 'We like long hair. We don't see why people should persecute us because of this'.\n\nBy the time the news story made it to television, young Jones and his hirsute friends had coined a catchy new name and were claiming to have the support of 1,000 teenagers all over Britain. In reality, his fellow spokesmen were mostly bandmates from his latest pop group, the Manish Boys. Jones insisted that he had begun letting his hair grow out well before the Rolling Stones arrived with their unkempt locks. \"It takes a long time to get this length, you know,\" he claimed. The funny thing is that by modern standards, his hair isn't even all that long. Perhaps that's why Jones and his friends didn't need to go to the hairdressers to have their manes shampooed. \"Our mums do it,\" he revealed. \"They're very good at it.\"\n\nWhile that television item was obviously tongue-in-cheek, the 1960s were the battleground for a culture war over men with long hair. Two decades after World War Two, many members of the older \"short-back-and-sides\" generation could not understand why young people would choose to express themselves in this way. Some schoolboys found themselves expelled for their shocking rebellion, while older teenagers discovered that the workplace could be a hostile environment. In 1969, 20-year-old welder Graham Wadsworth's refusal to cut his shaggy hair so outraged his colleagues at a UK engineering firm that they all went out on strike. The company's personnel manager grumbled, \"I understand civil rights and all that, and the young do have different ideas, but we have to set a good image.\" The dispute was settled when it was agreed that Wadsworth could return to work, as long as he didn't eat in the staff canteen.",
  "authors": [],
  "url": "https://www.bbc.com/culture/article/20251107-why-the-teenage-david-bowie-was-already-a-rebel"
}