{
  "title": "What to know about Lindsey Halligan’s big grand jury revelation at James Comey’s vindictive-prosecution hearing",
  "text": "The hearing Wednesday morning in the case against former FBI Director James Comey ended with a revelation by prosecutors and a conundrum: if a full grand jury never reviewed the final set of charges handed up against Comey, are they void?\n\nThe question arose after a shocking back and forth where prosecutors conceded that instead of presenting a new indictment to the grand jury after it declined to approve one of three counts, interim US Attorney Lindsey Halligan simply brought an altered version, omitting the rejected count, to the magistrate’s courtroom for the grand jury’s foreperson to sign.\n\nHer admission sent shockwaves through the courtroom on Wednesday, where attorneys were gathered to argue a separate legal issue of whether Comey was charged only because of President Donald Trump’s animus toward him.\n\nWhat will happen to the criminal case was not immediately clear. Judge Michael Nachmanoff, despite appearing exasperated and taking several seconds of silence to take in what the prosecutors admitted, did not give away whether he viewed the issue as a procedural or fatal error.\n\nNachmanoff did not make any rulings from the bench, saying that the issues before him were too “weighty” to immediately decide.\n\nBut the judge ask the Justice Department to address Wednesday their legal interpretation of what happened with the grand jury, and the revelation is likely to play into another ongoing fight in the case where defense attorneys have asserted that federal investigators and top prosecutor Halligan mishandled the case.\n\nIn a brief filed Wednesday evening, the Justice Department defended Halligan’s grand jury presentation and said the case should not be dismissed. The final indictment was reviewed by the grand jury foreperson and another representative — and then explained on the record in open court that it was reflective of the grand jury vote, the Justice Department wrote.\n\nThe former FBI director has pleaded not guilty to lying during congressional testimony.\n\nJudge Michael Nachmanoff holds a November 19, 2025 hearing weighing whether the indictment against James Comey was a vindictive prosecution. Dana Verkouteren\n\nThe stunning admission\n\nNachmanoff called on Halligan — Trump’s handpicked US attorney for the Eastern District of Virginia who secured the indictment against Comey by herself — to explain exactly what grand jurors did, or did not, see.\n\nHalligan appeared frustrated as she confirmed that only the foreperson and one other juror – not the entire grand jury – saw the final indictment. In the brief exchange, she tried to answer the judge before he finished asking his question and concluded the exchange with a terse “OK.”\n\nThe back and forth lasted about one minute.\n\nNachmanoff also trained his attention on a different prosecutor on the case, Tyler Lemons, and asked him to explicitly confirm that the final document was never presented to the grand jury.\n\n“I wasn’t there, but that is my understanding,” Lemons said.\n\nAfter the hearing concluded, people connected with the prosecutors’ office told CNN that they weren’t sure how problematic Halligan’s admission will be for the case. Some may consider it a clerical error that could be fixed, while others see a possibility it could be the fatal flaw in the case, as Comey’s team initially argued on Wednesday.\n\nProsecutors have six months to “cure” an indictment that was dismissed over legal issues, according to the Justice Department manual, even if the statute of limitations has expired – as is the case for Comey’s charges.\n\nComey’s attorney Michael Dreeben said that, given the testimony of the prosecutor, “no indictment was returned.”\n\nAnd even if it is a legal problem, a grand jury document flub may pale in comparison to other issues that have arisen in the case and are still playing out in court, including regarding what Halligan told the grand jurors about Comey’s rights, the evidence and the law.\n\nGrand jury transcripts\n\nThe issue over the indictment could also aid in defense attorneys’ efforts to gain access to the grand jury transcripts, an issue that is currently before a magistrate judge in the same courthouse.\n\nThat judge initially allowed Comey’s team to have access to the grand jury material, finding in his own review that “the record points to a disturbing pattern of profound investigative missteps.”\n\nProsecutors quickly asked the magistrate judge to pause the order so that they could file an appeal, which the magistrate judge allowed.\n\nJudge Michael Nachmanoff address interim US Attorney Lindsey Halligan at a November 19 hearing in Alexandria, VA. Dana Verkouteren\n\n‘Ms. Halligan was not a puppet’\n\nThe hearing focused primarily on defense attorneys’ efforts to have the case dismissed because, they argue, it was brought at the direction of Trump and born from his animosity toward Comey.\n\n“The president of the United States has caused the executive branch to prosecute a perceived enemy,” Dreeben began his arguments.\n\nDreeben, citing a social media post from Trump addressed to the attorney general and calling for the prosecution of Comey and other political enemies, argued that the president has gone after the former director to “punish Mr. Comey for speaking out against him.”\n\nLemons pushed back, arguing that Comey was making “inferential leaps” in arguing that the case is selective and vindictive.\n\nThe prosecutor said that there is “no proof” that Halligan took Trump’s social media post “as a charge.”\n\n“Ms. Halligan was not a puppet,” he added.\n\nStill, the judge questioned “what independent examination could she have made” in the few days between her appointment and the charges being brought against Comey.\n\nDOJ refuses to say if a memo declining to prosecute Comey exists\n\nNachmanoff also pressed Lemons on whether previous prosecutors who worked on the case before Halligan’s appointment had submitted a memo recommending that Comey not be prosecuted.\n\nLemons told the judge that someone in Deputy Attorney General Todd Blanche’s office told him he couldn’t disclose “privileged” information without their permission, which included the existence of any memo.\n\n“At this point, my position would be, whether there was a declination memo, is privileged,” Lemons said, adding that “I don’t know in the world of documents there is a declination memo.”\n\nNachmanoff challenged the assertion, pushing Lemons to eventually say that “someone in the Deputy Attorney General’s office” had instructed him not to say anything.\n\nAsked why, Lemons demurred, conceding briefly that he has “reviewed” draft memorandums – both declination and prosecution memos – and other internal communications, but declined to give additional details.\n\n“I hope you understand that I am trying to answer your questions,” Lemons said.\n\nJudge Michael Nachmanoff holds a hearing in James Comey's criminal case in Arlington, Virginia, on Wednesday, November 19, 2025. Dana Verkouteren\n\nJustice Department defends Halligan’s work\n\nFederal prosecutors in their Wednesday brief defended Lindsey Halligan’s handling of the grand jury proceedings against Comey.\n\nAt the end of Wednesday’s hearing, Nachmanoff instructed the parties to review a case in Washington, DC, from the late 1960s that dealt with similar grand jury issues.\n\nBut in that case, prosecutors argued in their brief, “the grand jury never saw any version of the eventual indictment.”\n\n“In this case, the grand jury was provided the proposed Indictment, deliberated, and determined that probable cause existed to believe that the defendant had committed the crimes charged in two counts,” prosecutors said.\n\nThe grand jury did not hand up an indictment on a third charge prosecutors attempted to bring against Comey.\n\nAfter their vote, according to prosecutors, only the foreperson and one other grand juror remained when a final version of the indictment – that omitted the third charge that was rejected – was signed by the foreperson.\n\n“Only the numbering of the counts (i.e., proposed Count Two became Count One, and proposed Count Three became Count Two) and the paragraphs differ,” prosecutors said in their brief.\n\nProsecutors argue the case doesn’t need to be dismissed “given that the grand jury was presented with the two counts on which it voted to return an indictment and in fact voted upon those counts.”\n\n“Grand Jury foreperson, as the representative of the Grand Jury, endorsed the revised two count Indictment by signing it and explaining on the record in open Court that the Indictment reflected the vote of the Grand Jury,” prosecutors continued.\n\nA magistrate judge earlier this week made the rare decision to order prosecutors to give Comey’s team all grand jury materials, including transcripts and recordings of the secret process.\n\nThat judge, William Fitzpatrick, said his review of those transcripts and recordings suggested that the grand jury could have been shown privileged evidence or given false instructions by the attorney who presented the case, Lindsey Halligan.\n\nProsecutors strongly pushed back against that, too, arguing Fitzpatrick had quoted portions of Halligan’s presentation and not her statements in full.\n\n“The magistrate judge’s recommendation is grounded in misreadings of the transcript, incorrect legal conclusions, and factual assumptions that the record directly disproves,” prosecutors wrote.\n\n“The U.S. Attorney did not misstate the law, the grand jury was not misled, and the transcript shows a routine, regular presentation of the indictment,” they said.\n\nThis story has been updated with additional details.",
  "authors": [
    "Hannah Rabinowitz",
    "Holmes Lybrand",
    "Katelyn",
    "Polantz",
    "Casey Gannon"
  ],
  "url": "https://www.cnn.com/2025/11/19/politics/comey-vindictive-prosecution-hearing-lindsey-halligan-grand-jury-takeaways"
}