{
  "title": "How Trump reversed course on the Epstein files as his administration faces lingering suspicion about their release",
  "text": "President Donald Trump on Wednesday sought to bring a swift end to perhaps the most damaging saga of his term, signing a measure compelling the release of the Epstein files after losing a monthslong, tooth-and-nail fight to prevent their disclosure.\n\nThe decision represents a stunning reversal for the president aimed chiefly at quelling a brewing GOP revolt and restoring his iron grip over the party. But few believe the path will be so easy from here.\n\n“I HAVE JUST SIGNED THE BILL TO RELEASE THE EPSTEIN FILES,” Trump posted on Truth Social late in the day, framing the overwhelming votes for it in Congress as a result of his involvement.\n\nThe measure becoming law is now set to open a fraught new stage in the push for the files tied to convicted sex offender Jeffrey Epstein, putting the Justice Department under fresh scrutiny and testing the White House’s ability to pivot attention away from the president’s past dealings with Epstein and toward more advantageous political ground.\n\nAt an unrelated press conference earlier Wednesday, Attorney General Pam Bondi would only say that the Justice Department would “follow the law” when asked about the Epstein files.\n\nBut already, officials face growing suspicion from Capitol Hill and their MAGA base that the administration will use a just-opened, Trump-ordered criminal investigation as an excuse to keep some of the Epstein case file under wraps.\n\nJustice officials, meanwhile, are scrambling to balance their probe with a looming December deadline for releasing the documents after being caught off-guard by both Trump’s demand for a new investigation and his subsequent sudden support Sunday evening for making all the Epstein files public, according to a person familiar with the matter.\n\nAnd even as the White House tries to accelerate past the controversy to focus on next year’s midterm elections, there remains little sign that Trump’s supporters are anywhere near ready to leave it behind.\n\n“This is a storyline that’s going to continue to dog the president into the second year of his presidency,” said Alex Conant, a longtime GOP operative. “The Epstein conspiracies have reached moon landing status. And we’ll never stop talking about it.”\n\nThe relentless intrigue surrounding the Epstein files marks the rare issue that has driven a wedge between Trump and the Republican Party he’s led for the last decade, exposing a vulnerability for the White House made all the more frustrating by the fact that it’s largely the result of a series of self-inflicted wounds.\n\nSince it became clear that he could not suppress the files’ release, Trump has tried to reunify the GOP behind a new effort to tie Epstein directly to the Democratic Party.\n\nIn announcing he’d signed the bill, Trump focused squarely on Democrats, writing, “Perhaps the truth about these Democrats, and their associations with Jeffrey Epstein, will soon be revealed,” and adding, “This latest Hoax will backfire on the Democrats just as all of the rest have!”\n\nThe offensive has drawn on newly disclosed Epstein emails that mention various prominent Democrats, alongside numerous references to Trump — a development that White House officials hope will put them back on offense after months under siege. (Corresponding with Epstein would not be a crime, and there’s no evidence in the emails that any of them participated in Epstein’s wrongdoing.)\n\n“All of a sudden there existed a real opportunity to change the narrative,” one official told CNN, noting that aides had only limited knowledge of what was in the documents compiled by Epstein’s estate until a House committee released them last week.\n\nBut the strategic shift comes after months of failed gambits, dismissals and outright resistance to releasing the files — all of which has sapped precious attention and time from the administration’s core agenda.\n\nThe president now faces some of the lowest approval ratings of his term so far, as well as the twin challenges of waging an uphill battle toward the midterms while keeping a lid on the simmering divisions over Epstein.\n\n“I think the president was in the right position at the end,” GOP Sen. Mike Rounds said of his support for the Epstein measure. “The rest of the story now is that they will have to deliver on that package in very short order, and then it’s going to depend upon what’s in the package and what’s been withheld.”\n\nPressure for the files was a problem of Trump’s own making\n\nTrump’s signature on the bill — and the credit he claimed for its success — capped a public push for the files that the president himself first fueled nearly a year-and-a-half ago, after he pledged on the campaign trail to release the materials if elected.\n\nHis team then leaned into that off-hand commitment as a way to energize a segment of the GOP base that’s been fixated on the Epstein files and has been convinced they would implicate a range of powerful figures in the late financier’s sexual abuse of young girls.\n\nThe administration further heightened expectations in February, when Bondi distributed “Epstein Files” binders to conservative influencers at the White House. The event was a dud; virtually all of the information was already public, sparking public backlash and opening the door to months of private tensions among top DOJ officials.\n\nBondi later claimed the administration was poring over newer materials, only for the DOJ to announce months later that no “further disclosure would be appropriate or warranted.”\n\nThe ensuing firestorm pitted the White House against many of the MAGA figures who had aided Trump’s rise, sparked a bipartisan effort on Capitol Hill to force the release of the files and prompted an internal scramble to tamp down an issue that threatened to consume the administration through much of the summer.\n\nThat effort became more challenging in the wake of revelations that magnified Trump’s past connections to Epstein, including that the president’s name had surfaced in the files. (Trump has not been accused of any wrongdoing in connection with Epstein.)\n\nWithin the White House, aides sought to manage the expectations of their allies, trying to explain that publicizing the rest of the files risked harming victims and violating the privacy of people whose names were in the documents but not credibly accused of wrongdoing.\n\nTrump, meanwhile, repeatedly took to social media to try to browbeat Republicans in line, insisting that the files he once vowed to release were now little more than a Democratic “hoax.” Yet neither approach succeeding in quelling the calls for more disclosure.\n\n“We’re trying to explain to people that they’re believing in something that does not exist,” a senior White House official said. “That’s why it’s so frustrating.”\n\nNew investigation raises fresh questions about what will be released\n\nAt one point, as the congressional effort to compel the Epstein files’ release gained steam, officials floated launching the new DOJ investigation as a way to alleviate the pressure and block any more documents from being released, an administration official said.\n\nBut it’s not clear whether the option made it to Trump. A White House official said the idea of an investigation into Democrats came after the emails were released by the House oversight panel last week. The Justice Department declined to comment.\n\nDuring Wednesday’s unrelated press conference, Bondi said that “new information” obtained by investigators had prompted her to reopen the Epstein matter without specifying what that was.\n\nSo last Friday, as the House vote on releasing the files loomed, Trump abruptly called for the DOJ to probe Epstein’s connections to a handful of Democrat-aligned figures including former President Bill Clinton. He also sought an inquiry into the banking giant JPMorgan Chase’s associations with Epstein. (Responding to the probe, spokespeople for Clinton and JPMorgan maintained they were not involved in Epstein’s crimes.)\n\nThe White House insists Trump has always been on the side of releasing the files. “President Trump has never been against releasing the Epstein files — rather, he has always been against Republicans falling into the Democrat trap of talking about this rather than focusing on the historic tax cuts signed into law, the fact that zero illegal aliens have entered our country in five months, and the many other accomplishments of the Trump Administration on behalf of the American people,” White House spokeswoman Abigail Jackson said in a statement to CNN.\n\nAnd since the opening of the new investigation, multiple White House officials have insisted to CNN that Trump will not stand in the way of the documents being released and that aides have little reason to believe the new investigation will affect that process, though Bondi declined to offer any explicit assurances on Wednesday.\n\nWithin the DOJ, some officials have lamented that Trump’s novel support for releasing the files amounts to a lose-lose — with Bondi and her department now facing dueling directives to both run an investigation and make public its pertinent documents.\n\nThe White House’s belated bid now to lean into the Epstein files as a political attack line has also generated some grumbling among allies on Capitol Hill and in the broader Trump orbit who had hoped to move on from a challenging period.\n\nIn the last two weeks, some of these allies noted, Trump oversaw an end to the record-long government shutdown, promoted the administration’s efforts on key affordability issues and hosted a series of high-profile diplomatic events.\n\nYet as Trump and his aides try to turn the tables on Democrats over Epstein, “this is all anyone’s talking about,” Conant said.\n\n“The power of the presidency is the ability to set the agenda,” he added. “And to the extent that this is a distraction, it does undermine what else he can do.”",
  "authors": [
    "Adam Cancryn",
    "Evan Perez",
    "Kristen Holmes",
    "Kaitlan Collins",
    "Hannah Rabinowitz"
  ],
  "url": "https://www.cnn.com/2025/11/20/politics/trump-reversal-epstein-files"
}