{
  "title": "Interstellar comet 3I/ATLAS images released by NASA",
  "text": "The latest images of an interstellar comet shared by NASA have captured how an array of spacecraft witnessed a flyby that was truly out of this world, revealing clues to the object’s composition.\n\nAstronomers first detected the rare comet, known as 3I/ATLAS, on July 1. It’s only the third observed interstellar object, or ISO, to originate outside of our solar system and pass through it.\n\nWhen the interstellar comet flew by the red planet in October, multiple NASA missions pivoted from their explorations to capture tantalizing images of the object that originated outside of our solar system.\n\nStacked images of 3I/ATLAS, taken by the Solar Terrestrial Relations Observatory spacecraft, show it speeding at 130,000 miles per hour in September. NASA/Lowell Observatory/Qicheng Zhang\n\nThe US space agency released the new observations on Wednesday since it had been unable to share them during the government shutdown.\n\nWhile none of the spacecraft have cameras perfectly designed to spot comets zipping by at speeds up to about 153,000 miles per hour (246,000 kilometers per hour), astronomers didn’t want to miss what might be a once-in-a-lifetime opportunity.\n\n“It’s a little bit as if our NASA spacecraft were at a baseball game, watching the game from different places in the stadium,” said Tom Statler, lead scientist for solar system small bodies at NASA. “Everybody has got a camera and they’re trying to get a picture of the ball and nobody has a perfect view, and everybody has a different camera.”\n\nThe Lucy spacecraft captured a faint halo of gas and dust around the comet on September 16. NASA/Goddard/SwRI/JHU-APL\n\nMissions capture images of a rare interstellar comet\n\nNearly 20 mission teams collaborated to capture images of the comet, said Nicky Fox, associate administrator for NASA’s Science Mission Directorate.\n\n“Everything we’re learning about the comet is possible because of the distribution of all of the different instruments on our spacecraft with different capabilities,” Fox said. “We’ve even pushed our scientific instruments beyond the things that they were designed to achieve, to allow us to capture this amazing glimpse at this interstellar traveler.”\n\nAhead of the Martian flyby in September, the Lucy and Psyche spacecraft, en route to study asteroids, and solar-focused missions, like the Parker Solar Probe, SOHO and PUNCH, caught glimpses of the comet in action.\n\nCombining the data from Lucy and Psyche with Earth-based telescopes can reveal more about the three-dimensional structure of the comet and the nature of the dust coming off of it due to the heat of the sun, Statler said.\n\n“It’s a rare opportunity to compare ancient dust from a distant solar system to that from our own,” he said.\n\n3I/ATLAS appears as a faint smudge against a background of stars from the Perseverance rover's perspective on October 4. NASA/JPL-Caltech/ASU/MSSS\n\nThe Mars Reconnaissance Orbiter and Perseverance rover also tracked the comet as it zoomed past the red planet in October. The orbiter was the spacecraft physically closest to the comet, Fox said.\n\nThe comet arrived at its closest point to the sun when Earth was on the wrong side for ground-based telescopes to conveniently observe, but Mars had optimal viewing conditions, according to Statler. “Our Mars assets were able to observe the comet, and also several of our other spacecraft were on the correct side of the sun,” he said. “We could not get this view from the vantage point of the Earth.”\n\nTwo spacecraft that will study Jupiter and its moons, Europa Clipper and the European Space Agency’s Jupiter Icy Moons Explorer, or Juice, and Europa Clipper, will also aim to capture the comet’s movements as it nears the orbit of Jupiter in the spring.\n\nThe comet came within about 18 million miles (29 million kilometers) of Mars on October 3. The ESA’s ExoMars Trace Gas Orbiter, which has been circling the red planet since 2016, was about 10 times closer to the comet than telescopes on Earth — and it captured images from an angle that Earth-based telescopes couldn’t see. The fresh perspective on 3I/ATLAS enabled scientists to predict the comet’s future path with a tenfold jump in accuracy.\n\nA multitude of other spacecraft, including the Hubble and James Webb Space telescopes, have also observed the object.\n\nWhile scientists have been using telescopes around the world to study 3I/ATLAS, spacecraft missions provide some key observational advantages, said Dr. Theodore Kareta, planetary astronomer and assistant professor in the department of astrophysics and planetary science at Villanova University in Pennsylvania.\n\nCameras and instruments on different spacecraft are geared toward various goals and measurements, and they can provide distinct vantage points that might be otherwise impossible to capture, he said.\n\n“Comets are three-dimensional objects, and looking at them from different angles will give us a much clearer picture of not just where they are and the trajectory they’re on, but also how large the nucleus of the comet is and the nature of any structures or patterns we can see in its atmosphere,” Kareta said.\n\nScientists currently think the comet is anywhere from a couple of thousand feet to a couple of miles in diameter, but they are still refining their measurements, Statler said.\n\nPsyche tracked 3I/ATLAS over the course of eight hours on September 8 and 9 when the comet was about 33 million miles from the spacecraft. NASA/JPL-Caltech/ASU\n\nA comet’s behavior\n\nNASA officials were also quick to address rumors that have swirled around the comet’s interstellar nature, including the idea that it’s an alien spacecraft.\n\n“It looks and behaves like a comet, and all evidence points to it being a comet,” said NASA Associate Administrator Amit Kshatriya. “But this one came from outside the solar system, which makes it fascinating, exciting and scientifically very important.”\n\nFox said that NASA’s close monitoring of the comet since its discovery has not yielded any evidence that would lead them to believe it was anything other than a natural celestial object, like technosignatures — a signal that could be created by extraterrestrial life.\n\n“But the super cool thing is not that it’s exactly like all the comets that we see in our solar system,” Fox said. “It’s the differences that are so tantalizing for us.”\n\nKshatriya said he was actually excited to see much of the world speculating about the comet while NASA was unable to share comment about it due to the constraints of the recent shutdown.\n\n“It expanded people’s brains to think about how magical the universe could be,” he said. “In fact, we want very much to find signs of life in the universe. But 3I/ Atlas is a comet.”\n\nComparing 3I/ATLAS with more common comets\n\nThe comet made its closest approach of the sun on October 30, coming within 130 million miles (210 million kilometers) according to NASA.\n\nA comet that originates within our solar system is like a dirty snowball. Its nucleus, or solid core, is a frozen mashup of rock, gas, dust and ice leftover from the formation of the stars, planets and other celestial bodies. As comets approach stars like our sun, they heat up, forming tails of sublimating material that streak behind them.\n\nThe MAVEN orbiter captured the comet in ultraviolet light, spying its hydrogen atoms on September 28. NASA/Goddard/LASP/CU Boulder\n\nBecause 3I/ATLAS is from another solar system, astronomers are eager to see how different or similar its composition is to the comets they are used to witnessing.\n\n3I/ATLAS has been releasing more carbon dioxide than water, and more nickel than iron, compared with comets that originated in our solar system — something that is still being investigated, Statler said.\n\nThe comet has also shown increased activity, which has caused some observers to question whether the object broke apart during its close pass of the sun.\n\nThe “jets” observed releasing from the comet can mean there are particularly active areas on the surface of the comet where more material is evaporating than elsewhere, Statler said.\n\n“Comets frequently show ‘jets’ or ’spiral’ features in their inner atmospheres related to which parts of their surfaces are active and releasing gas and dust, so taking a picture of them from one angle only can be challenging to interpret,” Kareta added.\n\n\n\nNow, the object is starting to reappear on the other side of our star for Earth-based telescopes. The object will swing within 168 million miles (270 million kilometers) of Earth on December 19 before beginning to make its way out of our solar system.\n\nThe SOHO mission spied the comet between October 15 and 16. Lowell Observatory/Qicheng Zhang\n\n“The fact that so many NASA missions have tried observing this interstellar visitor should tell you how seriously we all take this opportunity,” Kareta said. “Interstellar objects like 3I/ATLAS are fundamentally rare, and ISOs as bright as 3I should be rarer still — this object might very well be the ISO we learn the most about for many years to come.”\n\nWhile the exact age of the comet is unknown, the object’s speed suggests it is much older than anything in our solar system, Statler said.\n\n“3I/ATLAS is not just a window into another solar system, it’s a window into the deep past — and so deep in the past that it predates even the formation of our Earth and our sun,” Statler said.\n\nSign up for CNN’s Wonder Theory science newsletter. Explore the universe with news on fascinating discoveries, scientific advancements and more.",
  "authors": [
    "Ashley Strickland"
  ],
  "url": "https://www.cnn.com/2025/11/19/science/comet-3i-atlas-nasa-images"
}