{
  "title": "Opinion | On Republican Neo-Nazism, Hamas and Israel: An Epidemic of Moral Cowardice",
  "text": "The anti-Nazi Lutheran pastor and theologian Dietrich Bonhoeffer, who was hanged by Hitler’s henchmen shortly before his concentration camp was liberated by the Americans, is often said to have described the moral implications of this kind of behavior: “Silence in the face of evil is itself evil. God will not hold us guiltless. Not to speak is to speak. Not to act is to act.”\n\nBut that is precisely what is going on today. Just look around — and listen to the silence.\n\nI totally respect those on the left, right or center who have protested Israel’s killing of thousands of Palestinian civilians as collateral — and sometimes seemingly deliberate — damage in Israel’s retaliation/revenge campaign against Hamas. Such protests are a sign of moral health.\n\nBut I am still shocked by the declaration signed by more than 30 Harvard “Palestine Solidarity Groups” late on Oct. 7 two years ago. It stated: “We, the undersigned student organizations, hold the Israeli regime entirely responsible for all unfolding violence.” That was only hours after Hamas’s indiscriminate killing of some 1,200 men, women, children, soldiers and elderly people in Israel — including more than 360 people at a music festival, and the kidnapping of some 250 more. That Harvard declaration was issued well before Israel invaded Gaza in retaliation.\n\nWhen pro-Hamas protesters blame everything on Israel and give Hamas a free pass for its murder, sexual abuse and kidnapping; when they ignore everything else that Hamas stands for — its anti-L.G.B.T.Q., antidemocratic, antisemitic, women-subjugating Islamist ideology that should be anathema to everyone; and when they ignore past and current attempts by moderate, non-Hamas Palestinians to forge a two-state solution with the Jewish state, as an alternative to armed struggle — in my view they are essentially telling the world: It’s not Israel’s actions that motivate us; it is Israel’s existence. Therefore, the project of eliminating Israel must come before any critique of Hamas.\n\nThat is warped — and don’t kid yourself, it’s a view not confined to only a very few on the far left.\n\nUnfortunately, too many Israelis and diaspora Jews have put on similar blinders. A day does not go by without a report like this recent one from the Israeli newspaper Haaretz:\n\n“The attacks of October 7 and Israel’s subsequent devastation of Gaza also ignited a lethal conflagration of settler violence in the occupied West Bank. Over the same two-year period that Israeli forces killed more than 68,000 Palestinians in Gaza, more than 1,000 Palestinians have been killed in the West Bank. New settler outposts have been constructed with rapid speed, displacing entire Palestinian communities — a process often facilitated by Israel’s army. … In the face of this reality, there appears to be a concerted campaign on the part of the pro-Israel right to deny it.”",
  "authors": [
    "Thomas L. Friedman"
  ],
  "url": "https://www.nytimes.com/2025/11/18/opinion/israel-hamas-antisemitism-republicans.html"
}