{
  "title": "Border Patrol Agent Mocks Protests As ‘Cult Behavior’",
  "text": "LOADING ERROR LOADING\n\nDepartment of Homeland Security Chief Border Patrol Agent Gregory Bovino mocked people protesting the federal crackdown on immigration Thursday morning, calling their acts of dissent “cult behavior.”\n\nBovino’s Border Patrol agents have been spotted all across North Carolina’s largest city, Charlotte, this week, arresting hundreds of people in what they call “Operation Charlotte’s Web” and sparking an outcry from community members.\n\nAdvertisement\n\nBoth Border Patrol and Immigration and Customs Enforcement have come under major public scrutiny during President Donald Trump’s second term for their enforcement tactics. Federal immigration agents have violently slammed people to the ground and reportedly detained U.S. citizens.\n\nOne U.S. citizen in Charlotte told The Associated Press that border patrol agents threw him to the ground and briefly detained him.\n\nHowever, Bovino, who appeared on Thursday’s episode of Fox News’ “Jesse Watters Primetime,” told Watters that it was a “tall order” for him to understand the backlash, later adding, “it’s beyond understanding in some ways.”\n\nAdvertisement\n\n“I was talking with my team today, and we’ve came to the conclusion that this is a cult, like, this is a cult. This is cult behavior,” Bovino said. “These individuals oftentimes don’t even know why they’re protesting ICE and Border Patrol in their communities.”\n\nThe massive immigration enforcement operations in Democratic cities like Chicago and Los Angeles have triggered lawsuits that cite an aggressive use of force against protesters, including the deployment of tear gas and pepper balls.\n\nAdvertisement\n\n“Jesse, we could be out there with a child rapist, and they would come out and protest that. So that’s the very definition of a cult-like mentality, and we see that every day,” Bovino said. “Believe it or not, it’s the craziest thing I’ve seen.”\n\n“Yeah, well, it looks like they’ve been brainwashed,” Watters cracked.\n\nAn overwhelming majority of the people detained in the Trump administration’s immigration crackdown in Chicago had no criminal histories, multiple news outlets recently reported, citing federal court records.\n\nBovino and his Border Patrol agents are expected to conduct their next massive deployment in New Orleans — a two-month operation they have dubbed “Swamp Sweep,” according to The Associated Press.",
  "authors": [
    "Associate Reporter"
  ],
  "url": "https://www.huffpost.com/entry/gregory-bovino-border-patrol-cult-protests_n_691f4d28e4b071a086ba0d3a?origin=top-ad-recirc"
}