{
  "title": "Why Democrats are warning about Trump giving illegal orders",
  "text": "President Donald Trump has yet again suggested that his political opponents deserve to be executed. And yet again, he’s basing this argument on a rather novel legal theory and a dubious interpretation of the facts.\n\nA half-dozen congressional Democrats cut a video this week urging members of the military not to obey unlawful orders that Trump might issue. Trump then responded by issuing a series of social media posts suggesting these members had committed sedition and possibly even deserved to die.\n\nTrump went from saying they should be arrested, to re-posting someone who said George Washington would “HANG THEM,” to saying “SEDITIOUS BEHAVIOR, punishable by DEATH!”\n\nWhite House press secretary Karoline Leavitt clarified Thursday that Trump does not, in fact, want members of Congress put to death.\n\nBut she otherwise stood by the idea that these members were acting dangerously and undermining the commander in chief. She said the members were urging members of the military to “defy the chain of command.”\n\n“They are literally saying to 1.3 million active-duty servicemembers to defy the chain of command – not to follow lawful orders,” Leavitt said.\n\nBut that is not what they were literally saying.\n\nIn fact, the members were not urging anyone to disobey “lawful orders.” They explicitly referred in the video only to unlawful orders – and repeatedly so.\n\nThe other problem is that “defying the chain of command” isn’t just something military servicemembers are allowed to do in such cases; it’s something they’re often required to do.\n\nThe section of Article 92 of the Uniform Code of Military Justice dealing with failing to obey orders states that members can only be sanctioned for disobeying lawful orders. And servicemembers are generally obligated to not follow orders that are “manifestly unlawful.”\n\nIf there’s a potentially more legitimate objection to Democrats’ video, it’s that they’re erecting a straw man – basically that they’re inventing out of whole cloth the prospect of Trump issuing illegal orders, in order to make military servicemembers hesitant to abide his orders.\n\nThis is the argument that some of Trump’s allies have gone for on Fox News.\n\n“If you can’t name the unlawful orders that these guys are bringing up in their video, you know, that just shows me that you don’t have the courage to even call out what you’re talking about,” Republican Rep. Eli Crane of Arizona said.\n\nFox News anchor Martha MacCallum in a separate segment pressed Democratic Rep. Jason Crow, one of the lawmakers in the video, repeatedly on the same subject.\n\n“What specific order from the commander in chief that we are asking our military to carry out are you objecting to?” MacCallum said. “This is very, very vague.”\n\nBut it’s not as if this is a prospect Democrats have invented out of whole cloth. Trump has given them plenty to work with, including some things Crow mentioned in the interview.\n\nTrump has repeatedly proposed doing things – with the military and otherwise – that appear to be illegal. People who served with him have said he suggested illegal action. And Trump is certainly testing the bounds of the law with his use of the military even as we speak.\n\nThe big example right now is Trump’s strikes on alleged drug vessels in the Caribbean Sea and the Pacific Ocean – strikes that have killed more than 80 people without a legal process.\n\nCNN has reported that both the United Nations and top allies like the United Kingdom regard the strikes as illegal extrajudicial killings. Republican Sen. Rand Paul of Kentucky has echoed those claims, while other GOP senators have questioned their legality as well. The administration has also declined to publicly detail its legal justification, even as the Justice Department has produced a classified legal opinion authorizing the strikes. It has released survivors of the strikes who, if they had been kept in US custody, could have forced it to defend itself in court. Also, a top commander who CNN has reported raised questions about the legality of the strikes is now retiring early.\n\nThere is a very real question about whether the servicemembers involved in those strikes are carrying out illegal orders. And the administration has proactively avoided a more robust legal process that could settle that question.\n\nBut that’s hardly all. Here are some other key data points:\n\nIt’s certainly provocative for Democrats to raise this issue like they have. But it’s not as if they’ve conjured it out of thin air.",
  "authors": [
    "Aaron Blake"
  ],
  "url": "https://www.cnn.com/2025/11/20/politics/hang-democrats-trump-seditious-behavior"
}