{
  "title": "Exclusive: Meet Samsung's Galaxy Buds 4 Pro with a powerful new feature (Updated: New features)",
  "text": "AssembleDebug / Android Authority\n\nTL;DR We’ve found animations confirming the new design and features of the upcoming Samsung Galaxy Buds 4 Pro.\n\nThe earbuds appear to be getting a powerful, new “Head Gestures” feature.\n\nSamsung appears to be ditching the Buds 3 Pro’s sharp, triangular aesthetic in favor of a flatter stem and as well as a redesigned charging case.\n\nUpdate 2, November 19, 2025 (09:40 AM ET): The “Find Your Phone” feature previously mentioned as a carryover from the Buds 3 Pro is actually a new feature for the Buds 4 Pro. We’ve also noticed the speaker grille on the back of the earbuds’ case. You can read more in our new coverage. Update 1, November 18, 2025 (12:05 AM ET): We’ve continued to dig through One UI 8.5 leaks and have uncovered some new photo-realistic imagery of the Galaxy Buds 4 Pro in both white and black:\n\nOriginal article, November 17, 2025 (12:05 AM ET): Samsung’s next-gen wireless earbuds — the Galaxy Buds 4 Pro — are expected to launch alongside the Galaxy S26 series. Mentions of the buds have been popping up for months, including traces in leaked One UI 8.5 firmware. But now, we’ve exclusively obtained new One UI 8.5 animations that showcase the earbuds and their features in detail.\n\nThese leaked animations confirm the redesigned look of the Galaxy Buds 4 Pro, a style that may also carry over to the standard Buds 4. This is our most complete look yet at the Galaxy Buds 4 Pro, along with a major new feature Samsung is preparing to debut.\n\nA first proper look at the Samsung Galaxy Buds 4 Pro design\n\nBack in October, we reported on a vector-based render that hinted at Samsung’s revamped earbud design. Later, we exclusively revealed the codenames for both upcoming models: Galaxy Buds 4: “Handel”\n\n“Handel” Galaxy Buds 4 Pro: “Bach” Now, the leaked One UI 8.5 animations show the actual Galaxy Buds 4 Pro hardware, confirming the stem-style design is sticking around, but with notable refinements. Samsung appears to be ditching the Buds 3 Pro’s sharp, triangular aesthetic in favor of a flatter stem. The distinctive light bar on the stem also appears to be gone, though the pinch controls seem intact.\n\nDon’t want to miss the best from Android Authority? Set us as a favorite source in Google Discover to never miss our latest exclusive reports, expert analysis, and much more.\n\nto never miss our latest exclusive reports, expert analysis, and much more. You can also set us as a preferred source in Google Search by clicking the button below.\n\nWe also get a clearer look at the in-ear tips and a redesigned charging case. Instead of dropping vertically into the case like previous models, the Galaxy Buds 4 Pro now appear to lay flat inside, similar to other recent premium earbuds.\n\nThere’s still no confirmation on whether the standard Buds 4 will follow the same design language, but if Samsung follows the Buds 3/Buds 3 Pro playbook, the base model is likely to receive a similar redesign.\n\nGalaxy Buds 4 Pro: Head Gestures\n\nWe also looked into code strings in the leaked One UI 8.5 build and found that Samsung is integrating a new “Head Gestures” feature in the Galaxy Buds 4 Pro. A similar feature is currently found in a limited form on Sony earbuds, including the WF-1000XM5, and Google’s Pixel Buds Pro 2. However, Samsung’s version isn’t just limiting the functionality to just answering or declining calls.\n\nAccording to the strings found in One UI 8.5, Head Gestures on the Galaxy Buds 4 Pro will allow users to do the following: Respond to calls, notifications, and more by nodding or shaking head\n\nHear notifications aloud or stop the reading\n\nDismiss alarms, timers, Calendar alerts, and Reminder alerts\n\nAnswer yes/no questions or end conversations with an AI assistant\n\nHands-free control for when speaking or touching phone isn’t possible\n\nMore features:\n\nThe leaked animations also preview a number of other Galaxy Buds 4 Pro features. Many of these already exist on the Buds 3 Pro, including: 360° recording\n\nAdaptive Noise Control\n\nFind your phone (see Update 2 at the top)\n\n(see Update 2 at the top) Pairing with a phone or tablet\n\nIf the leaked One UI 8.5 build is any indication, Samsung’s Galaxy Buds 4 Pro will could be a big upgrade compared to the previous model. With a cleaner design, a new case layout, and new hands-free controls, Samsung seems to be preparing some pretty notable changes.\n\n⚠️ An APK teardown helps predict features that may arrive on a service in the future based on work-in-progress code. However, it is possible that such predicted features may not make it to a public release.\n\nFollow",
  "authors": [],
  "url": "https://www.androidauthority.com/samsung-galaxy-buds-4-pro-design-features-leak-3616254/"
}