{
  "title": "Frida Kahlo Portrait Sells for $55 Million, Setting Her Auction Record",
  "text": "Only a handful of Kahlo’s pictures have circulated through the art market since the Mexican government declared her artworks as artistic monuments in 1984, banning any work by Kahlo that was in Mexico at the time from being exported. A 2002 movie starring Salma Hayek as the artist introduced a new generation to her paintings and dramatic biography, which told of a debilitating bus accident at an early age, participation in the Mexican Communist Party and a tempestuous relationship with her husband, the artist Diego Rivera.\n\nHer prior record was set four years ago, for the 1949 work “Diego and I,” at $34.9 million. That canvas was arguably a stronger example of her self-portraits because it featured a close-up of Kahlo’s face with a bushy unibrow, tears falling from her eyes and a disturbing image of her husband emerging from the center of her forehead.\n\nStill, the rare appearance of her paintings at auction led to a bidding war. The auctioneer, Oliver Barker, described the work as “an evocative and spectral meditation on life, death and the spirit world.” Sotheby’s had secured a third-party backer ahead of the sale, ensuring the picture would sell.\n\nThe dreamlike “El sueño (La cama)” captures real elements of Kahlo’s bedroom, such as the papier-mâché skeleton, an effigy known in Mexico as a Judas. The historian Luis-Martín Lozano, who wrote an essay for the auction house on the painting, said that the firecrackers tied onto the fake skeleton suggested “Kahlo’s intent to signal a passage between dimensions — between reality and dream, life and death.”\n\nIn an auction season that was already surreal — it has included a gold toilet, a gold nugget and a triceratops fossil — the painting by Kahlo was somewhat humble. (Christie’s sold Frida Kahlo’s 1941 self-portrait “Me and My Parrots” in a private transaction in 2021 for more than $100 million, according to a source close to the deal.) Dawes said that Sotheby’s had been part of multiple private deals where her paintings sold above $50 million.\n\nDawes also said that the self-portrait’s low estimate of $40 million had taken into account that Kahlo’s figure does not play a clear starring role in the picture. “If a canvas of this size were filled by a full portrait of Frida, zoomed in, it would probably be an estimate of $80 million to $100 million-plus. And I think the market would have been there in a heartbeat.”",
  "authors": [
    "Zachary Small",
    "Tim F. Schneider"
  ],
  "url": "https://www.nytimes.com/2025/11/20/arts/design/kahlo-portrait-auction-art-sothebys.html"
}