{
  "title": "After SEC investigation, Curastory founder resigns, hires replacement",
  "text": "The Securities and Exchange Commission has accused content monetization startup Curastory of overstating revenue to investors and misrepresenting true client numbers, according to paperwork seen by TechCrunch.\n\nAs a result of a settlement with the SEC, Curastory’s founder and CEO, Tiffany Kelly, has resigned from the role and replaced herself with Dave Dickman, former CEO of the influencer marketing platform Tagger.\n\nUnder Dickman’s leadership, the company has begun fundraising, international expansion plans, and product updates, Kelly and Dickman tell TechCrunch.\n\nThe settlement agreement specifically barred Kelly for 10 years from serving on the board of directors or as an executive at any company that would, essentially, fundraise. TechCrunch saw a version of this agreement that had not yet been finalized. It stated that Kelly agreed to these stipulations without admitting to or denying the allegations.\n\nAlthough Kelly remains a major shareholder and will remain an adviser, she told TechCrunch that “stepping aside was truly the only decision that I could make just to keep the company alive and thriving,” she said.\n\nKelly founded the company in 2021. Curastory is a platform that helps content creators monetize their videos and has grown to about 400,000 creators using it, she said. It lets advertisers buy in-video ads from creators, while tracking metrics and supporting other features, like video editing.\n\nIt has raised around $3 million to date from investors, including Lightspeed’s Scout Fund, Feld Ventures, and Mindspring Capital, according to PitchBook, which also listed it as having participated in a few accelerator programs like Techstars and the SPARK Program, held by AMEX Ventures and Project W, according to PitchBook.\n\nTechcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | WAITLIST NOW\n\n“It’s been a wild ride,” she admitted. As part of the settlement, Kelly also agreed to pay a fine.\n\nShe told TechCrunch that she did not know what triggered the SEC investigation. She said she received a subpoena in June and in January was issued the violations notice from the SEC.\n\nShe hopes for time and grace. “It’s interesting having and being forced to step down,” she said. She still has majority ownership in the company but said she’s happy that fundraising and finances are off her plate.\n\nShe said she’s also happy she was able to pick her successor, finding Dickman through an executive recruiter. Many other ousted founders are not able to do so. She asked the recruiter to find someone who was a good person, who wouldn’t strip and sell the company for quick cash, and who would understand the technology.\n\n“Early-stage companies have all kinds of challenges across the board. In the end, it happened. It’s been resolved,” Dickman told TechCrunch. He compared him and Kelly to yin and yang, as he spent decades in the creator space and has worked at a few early-stage startups. She is analytical, he said, and very product-focused, while he likes having more of a leadership role.\n\n“I feel like we’re a good combo and complementary to drive this forward,” he said.\n\nKelly, meanwhile, is already seeing some changes, as Dickman has been CEO for a few weeks already. She said his fundraising deck made it to the desk of a VC fund, and they forwarded it to someone else, nudging them to take a look at the product.\n\n“I have not had that experience with fundraising, as you could probably imagine,” she said, referring to the experience that women, especially Black women, often face when raising venture money. “So that has been eye-opening.”\n\nUnder Dickman, she hopes for a bright future for the company. Curastory already has plans to expand into Canada, Australia, and the U.K. soon.\n\n\n\nThe company is working on new features to target creators on other platforms like Spotify video and to add AI to the product to make their advertising technology a bit more agentic, she said. Its current video enablement tools include YouTube, TikTok, and Facebook Watch.\n\nIt also plans to add a more enhanced attribution model for advertisers that would eliminate the need for influencer promo codes.\n\n“Those are the immediate, near-term product, sales, globalization things,” Kelly said.\n\nDespite this shocking end to her run as the CEO of her company, she told TechCrunch, “Being a founder and CEO is one of the most humbling and rewarding experiences I think anyone can have.” She hopes to share her lessons learned and experiences with others, “especially women and people of color.”",
  "authors": [
    "Dominic-Madori Davis",
    "Senior Reporter",
    "Sarah Perez",
    "Julie Bort",
    "Lorenzo Franceschi-Bicchierai",
    "Ram Iyer",
    "Connie Loizos",
    "Anthony Ha",
    "Rebecca Bellan",
    "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var"
  ],
  "url": "https://techcrunch.com/2025/11/20/after-sec-investigation-curastory-founder-resigns-hires-replacement/"
}