{
  "title": "Trump administration plans to roll back EPA regulations could harm health",
  "text": "Environment & Climate Health Trump administration plans to roll back EPA regulations could harm health Karen Feldscher Hide caption Show caption eric1513 / iStock\n\nJump to Section Share Post LinkedIn\n\nFacebook\n\nWhatsApp\n\nEmail\n\nCopy link\n\nThe Trump administration has proposed rolling back several Environmental Protection Agency (EPA) regulations related to air quality. These changes could have significant negative impacts on population health, according to Harvard T.H. Chan School of Public Health’s Mary Rice, Mark and Catherine Winkler Associate Professor of Environmental Respiratory Health and director of the Center for Climate, Health, and the Global Environment (Harvard Chan C-CHANGE), and Amruta Nori-Sarma, assistant professor of environmental health and population science.\n\nWhat are the EPA regulations the administration wants to roll back?\n\nRice: There have been a number of proposed rollbacks to EPA air quality protections and I would like to focus on two. One is the proposal to eliminate the endangerment finding. This finding was issued in 2009, based on research showing the health dangers of greenhouse gases. It obligates the EPA to take steps to limit these emissions from motor vehicles and trucks. The second proposal would repeal the greenhouse gas emission standards for fossil fuel-fired power plants.\n\nHow might these rollbacks harm health?\n\nMary Rice\n\nRice: Greenhouse gas regulations help protect health because they reduce unhealthy, even deadly air pollution in the short term, and they curb climate risks in the long term.\n\nGreenhouse gases like carbon dioxide harm health because of their effect through climate change, which itself causes significant public health harms, including increased temperatures, more frequent and severe wildfires, and more severe weather events like hurricanes and flooding. These exposures have harmful health effects, especially for certain groups, like children and the elderly.\n\nFor example, higher temperatures are linked to adverse health outcomes including preterm births and excess respiratory and cardiovascular health-related hospitalizations. Warmer temperatures also drive the formation of ground-level ozone, an air pollutant—which has been shown to worsen respiratory health and is also associated with higher risk of mortality.\n\nNori-Sarma: On days when temperatures get very high, we see increases in the risks of emergency department visits, we see worsening mental health as well as physical health, and we see a lot more need for in-depth outpatient care. Every tenth of a degree really matters when it comes to trying to reduce the health impacts of continued climate change.\n\nRice: Greenhouse gas emissions increase the long-term risk of wildfires, which exacerbate respiratory conditions, including asthma, and which are also linked to increased mortality, especially among the elderly. In fact, a recent paper co-authored by Harvard Medical School’s Nicholas Nassikas, a C-CHANGE core faculty member, has found that climate change caused approximately 15,000 excess deaths from wildfire particulate matter between 2006 and 2020.\n\nNori-Sarma: In Massachusetts, it didn’t use to be a standard that we would provide guidance and advice to patients around wildfire-specific smoke exposure. That has changed, because now it has become more of a regular occurrence that we experience wildfire smoke from the long-range transportation of particulate matter from wildfires happening in Canada.\n\nRice: Greenhouse gas emissions also increase the frequency of flooding, which causes death due to drowning, and interferes with the ability of hospitals to deliver care for people.\n\nAmruta Nori-Sarma\n\nNori-Sarma: We use terms like hundred-year flood or thousand-year flood, but these events are no longer only happening once every hundred or thousand years. In areas that now get flooded regularly, there are very real health impacts. Flooding is associated with increased risks for hospitalizations and emergency department visits. And people who live in homes that are regularly flooded may experience mold and some of the adverse outcomes associated with that, such as increases in respiratory events and asthma and allergic reactions.\n\nI want to highlight that these aren’t issues that are only impacting coastal areas. People in rural communities and in heartland cities across the U.S. are also at risk.\n\nHow would hospitals be impacted?\n\nNori-Sarma: With increases in extreme heat and air pollution, we would expect increases in emergency department visits and hospitalizations, but hospitals have capacity limitations. We’re limited by the number of hospital beds that we have available.\n\nExtreme heat is a good example. Right now, we might think about the five hottest days every summer, but as the climate continues to change, the temperatures that we experience on those five hottest days will become the temperature on the seven hottest days, or the 10 hottest days, or the 15 hottest days. And all of a sudden, you have to compound the number of people who are going to seek emergency care or other types of clinical care. And they’re going to need those resources more frequently.\n\nThe stress on the health care system is one of the most acute impacts of all of the different types of extreme weather that we’re starting to see.\n\nWhat is so dangerous about air pollution that comes from greenhouse gases?\n\nRice: Fine particulate matter and gaseous pollutants from fossil fuel combustion, especially from the burning of coal and from traffic, are toxic. They’re linked to increased morality risk, chronic respiratory disease, ischemic heart disease.\n\nIn my own research in Boston, I’ve found that kids who are highly exposed to traffic pollution have three times the odds of asthma compared to kids who live further away. I’ve also found higher risk of lung scarring in adults exposed to traffic, and so have other studies in the U.S.\n\nOther studies have looked at the results of improved air quality due to closure of coal-fired power plants and reduced motor vehicle emissions in the U.S. and have found that both led to reduced mortality among the elderly, longer life expectancy, improved heart health, reduced risk of kids getting asthma or, among those who already have asthma, reduced risk of having potentially deadly asthma attacks. Rolling back these protections puts all of this progress at risk.\n\nIf federal air quality regulations are pulled back, are there steps that individual states can take to reduce greenhouse gas emissions?\n\nNori-Sarma: It’s very challenging unless you have a plurality of states working in conjunction with each other, because, for example, the wildfire-specific particulate matter that we’re experiencing in New England is not necessarily coming from wildfires that are happening in New England.\n\nWhen it comes to federal changes in vehicle emission standards or fossil fuel combustion standards, states might be able to create regulations to mitigate some of the acute impacts. But unless and until we have regional agreement on what these regulations should be, in the long term I think we’re still going to experience the downstream health consequences.\n\nAbout The Author Karen Feldscher Associate Director for News in the Office of Communications\n\nRelated Topics Environment & Climate Health\n\nFeatured in this article Mary Berlik Rice Mark and Catherine Winkler Associate Professor of Environmental Respiratory Health Amruta Nori-Sarma Assistant Professor of Environmental Health and Population Science",
  "authors": [
    "Karen Feldscher",
    "Associate Director For News In The Office Of Communications"
  ],
  "url": "https://hsph.harvard.edu/news/trump-administration-plans-to-roll-back-epa-regulations-could-harm-health/"
}