{
  "title": "Chiefs heir Gracie Hunt backs rival Super Bowl half-time show over Bad Bunny",
  "text": "Gracie Hunt, the daughter of Kansas City Chiefs owner Clark Hunt, is throwing her support behind Turning Point USA’s plan to stage an alternative Super Bowl half-time show, a direct counter to the NFL’s decision to feature Bad Bunny at Super Bowl LX.\n\nHunt said in an appearance on Fox News Channel’s The Will Cain Show on Tuesday that she “most definitely” backs Turning Point’s counter-programming effort, spearheaded by Erika Kirk, the widow of Charlie Kirk. The NFL’s choice of Bad Bunny for the half-time show has attracted strong pushback from many on the right, who object to his criticism of Donald Trump and US immigration enforcement.\n\n“I really respect Erika for all that she’s done, especially with creating a half-time show for America,” she said. “You know, children are young, they’re impressionable. Young women, young men and everyone, they just need someone to look up to.”\n\nHunt framed her position through the legacy of her grandfather Lamar Hunt, one of the modern NFL’s founding fathers who coined the Super Bowl name. She said the game was designed to be accessible to fans of all demographics. “When my grandfather named the Super Bowl, he intended it to be something children and families of all ages could come together and watch,” she said. “That football is the attraction and that it didn’t need to compromise its character or rely on cheap appeal to draw an audience.”\n\nShe argued that the league has a responsibility to choose performers who reflect its long-standing identity. “Football is becoming the world sport, but, at its heart, it’s America’s sport built around family,” she said. “The NFL honors women, the military, this country, celebrates communities. So I think that whoever they select going forward for the half-time show needs to reflect those values more closely.”\n\nTurning Point USA, the influential rightwing college organization co-founded by Charlie Kirk, announced in October that it would stage an “All American Halftime Show” during next year’s NFL championship game. The idea quickly gained traction among conservatives who objected to Bad Bunny’s presence at the game.\n\nHunt also floated who she’d like to see on future half-time stages. “An artist like [country music star] Jason Aldean might make sense,” she said, adding: “I’d love to see Miss Taylor Swift up there sometime once Travis [Kelce] is retired.”\n\nHer comments arrive as the league faces an escalating political dispute over its 2026 half-time headliner. Bad Bunny – a Puerto Rican superstar and US citizen who has been vocal in his criticism of aggressive immigration enforcement – addressed the uproar during his Saturday Night Live monologue last month, joking that everyone seemed thrilled about the booking, “even Fox News”. He also highlighted Latino contributions to the US and told viewers that if they didn’t understand his Spanish remarks, they had “four months to learn”.\n\nView image in fullscreen Tavia Hunt, Clark Hunt and Gracie Hunt, from left to right, attend the NFL Honors at Resorts World Theatre before Super Bowl LVIII in Las Vegas. Photograph: Ethan Miller/Getty Images\n\nThe backlash intensified after homeland security secretary Kristi Noem warned that immigration agents “will be all over” next year’s Super Bowl and said only Americans should attend. Bad Bunny has said fears of Immigration and Customs Enforcement (ICE) raids influenced his decision to exclude the mainland US from his recent world tour.\n\nThe NFL, despite the conservative outrage, made clear last month it will not reconsider its selection. Commissioner Roger Goodell said the league is standing by its decision despite criticism from Trump and his supporters. The process, he said, is “carefully thought through”, and “I’m not sure we’ve ever selected an artist where we didn’t have some blowback or criticism. It’s pretty hard to do when you have literally hundreds of millions of people that are watching.”\n\nTrump dismissed the performer in an interview on Newsmax, saying he had “never heard of” Bad Bunny and calling it an “absolutely ridiculous” pick by the NFL. But Goodell said the league chose him because of his extraordinary reach. “He’s one of the leading and most popular entertainers in the world,” he said. “That’s what we try to achieve. It’s an important stage for us. It’s an important element to the entertainment value.” He added that the NFL is “confident it’s going to be a great show”, calling it “a united moment”.\n\nHunt closed her appearance Tuesday by describing what she sees as a broader cultural shift among young Americans. “I think our generation gets a bad rap, but I am so excited by this movement I’ve seen within this younger generation,” she said. “They are hungry for a deeper ‘why’. They are hungry for Jesus. November is global Bible month, and Bible sales are up.\n\n“And I’m just seeing this massive resurgence in young women, in young men, across college campuses getting baptized, sharing the Gospel and wanting to leave this world a better place.”\n\nSuper Bowl LX will take place on 8 February at Levi’s Stadium in Santa Clara, California.",
  "authors": [
    "Guardian Sport"
  ],
  "url": "https://www.theguardian.com/sport/2025/nov/20/gracie-hunt-turning-point-bad-bunny-super-bowl-halftime-show"
}