{
  "title": "Leica’s latest black-and-white-only camera is the $7,800 Q3 Monochrom",
  "text": "is a reviewer covering laptops and the occasional gadget. He spent over 15 years in the photography industry before joining The Verge as a deals writer in 2021.\n\nPosts from this author will be added to your daily email digest and your homepage feed.\n\nLeica is announcing a Q3 Monochrom, its latest digital camera that captures only black-and-white photos and video. In many ways, the Q3 Monochrom is the same as a standard Q3, but with its 60-megapixel sensor modified to not record color, and dressed up in a stealthier logo-less design. It’s available today for $7,790, a $1,055 upcharge from the regular Q3 that captures color.\n\nLike the standard Q3, the Q3 Monochrom is a weather-resistant compact camera with full-frame sensor and fixed 28mm f/1.7 Summilux lens with image stabilization. It captures RAW photos in Adobe DNG and videos up to 4K / 60p or 8K / 30p. And it’s got a digital zoom button that can crop the lens to 35mm, 50mm, 75mm, and 90mm (if you prefer cropping as you shoot instead of in post).\n\nPrevious Next\n\n\n\n\n\n\n\n\n\n1 / 6 From the front it looks just like a Q2 Monochrom. Image: Leica Camera\n\nIt’s basically a spec-for-spec match of the standard Q3, but it’s the first Q camera to get Leica’s Content Credentials — embedding a digital signature into the files to verify authenticity. The other big difference is that the monochromatic sensor has a higher maximum ISO setting of 200,000. The color Q3 and Q3 43 cameras max out at ISO 100,000. Design-wise, the new model is much like other recent Monochroms. Its black finish is more matte, there’s no Leica red dot logo, any colorful markings are instead just white or gray, and the grip has a textured pattern more akin to M rangefinders.\n\nYou can of course set a standard Q3, or any digital camera for that matter, to black and white. But Leica has made Monochrom variant cameras since 2012 for good reason: by omitting the color filter array from the sensor, you can get slightly sharper images and better low-light performance. It’s a niche approach, but using one and working within that restriction is genuinely fun.\n\nAll killer, no filler. Image: Leica Camera\n\nI can’t help but love the Monochrom cameras whenever I get to use one, but they’re getting even harder to justify as they keep climbing in price. (The Q2 Monochrom was around $1,800 less than the Q3 Monochrom when it launched.) Though the black-and-white-only digital camera experience may open up to more people soon, since Ricoh recently announced it will release a GR IV Monochrome in 2026. That will be Leica’s first real challenger in this niche space. And though we don’t know its price yet, it’s likely to cost many thousands less than the Q3 Monochrom.",
  "authors": [
    "Antonio G. Di Benedetto"
  ],
  "url": "https://www.theverge.com/news/824295/leica-q3-monochrom-black-and-white-digital-camera-price-specs"
}