{
  "title": "New Glenn launch: NASA’s Escapade mission to Mars is the first big test for Blue Origin’s rocket",
  "text": "Blue Origin, the rocket company founded by Amazon multibillionaire Jeff Bezos, launched its towering New Glenn rocket on a mission that marked its first major test.\n\nCarrying a pair of satellites that are destined to take a long, winding trip to Mars, New Glenn took flight from Cape Canaveral Space Force Station just before 4 p.m. ET Thursday.\n\nBlue Origin also landed the first stage of the rocket back on a seafaring platform for the first time, marking a monumental stride forward in the company’s efforts to make the New Glenn rocket reusable, less expensive, and a better competitor for Elon Musk’s SpaceX.\n\nBlue Origin had been slated to launch the NASA mission, called Escapade, on Sunday, but cloud cover resulted in the decision to postpone liftoff. The company then had to work with the Federal Aviation Administration, which recently implemented a ban on most rocket launches during daylight hours amid the government shutdown, to find a new opportunity to take off.\n\nThe launch of Escapade — short for Escape and Plasma Acceleration Dynamics Explorers — marked the first flight for New Glenn with a customer payload onboard. The rocket completed its inaugural flight in January carrying Blue Origin-made demonstration technology in its cargo bay.\n\nThis footage, shown during Blue Origin's webcast of the Escapade launch, shows the New Glenn rocket's first-stage booster landing upright on a seafaring platform. The booster is designed to be recovered and reused to drive down launch costs. Blue Origin\n\nDuring that January mission, the company failed to recover New Glenn’s first-stage booster, which is the bottommost portion of the rocket that gives the vehicle its initial burst of power at liftoff.\n\nBlue Origin attributed the failed attempt to engines that did not properly reignite. But the company did not appear to experience any such issues Thursday, as New Glenn’s first stage made a clean touchdown on a seafaring barge named Jacklyn after Bezos’ mother.\n\nMuch like Blue Origin’s chief competitor, SpaceX — which has long been a dominant force in the commercial launch business — New Glenn is designed to be partially reused in order to drive down costs.\n\nFailing to land the rocket booster does not necessarily affect how companies assess the overall success of a mission, as the primary goal of any rocket launch is to safely deliver its cargo to orbit. But Blue Origin had made clear before takeoff that the steps of recovering and reflying parts of its rockets are crucial to the company’s business model.\n\nAnd Blue Origin said it has spent the past 10 months largely focused on tweaking the New Glenn vehicle in the hopes of guaranteeing a successful booster landing.\n\nA landmark Mars mission\n\nWorkers inspect and process NASA’s Escapade twin spacecraft at the Astrotech Space Operations Facility near the agency’s Kennedy Space Center in Florida in August 2024. Kim Shiflett/NASA\n\nFor this mission, New Glenn had among the most exciting tasks a rocket can be assigned. It delivered the twin Escapade satellites on a path toward Lagrange Point 2, or L2 — a cosmic balance point about 1.5 million kilometers (930,000 miles) from Earth.\n\nLagrange Points can be useful for various types of missions because they allow spacecraft to potentially stay in orbit for a very long time while using minimal fuel. The James Webb Space Telescope, for example, is in orbit around L2.\n\nThis image, taken from Blue Origin's webcast, shows the payload adapter of the company's New Glenn rocket as the Escapade satellites were deployed. From Blue Origin\n\nIn this case, however, the Escapade satellites will use L2 as a sort of orbital backroad in which to linger as they wait for their destination — Mars — to travel closer to Earth along its orbital path. In late 2026, when the next Mars transfer window opens, the satellites will then depart L2, briefly swing back by Earth, and set off on their final trek to the red planet.\n\nBoth spacecraft are slated to enter Martian orbit in September 2027.\n\nOnly then will Escapade begin its core science mission. Led by the University of California, Berkeley, a team of researchers will study the planet’s atmosphere — working to evaluate why Mars began to lose its once-dense atmosphere billions of years ago and assess radiation conditions for future explorers.\n\n“Throughout the Escapade mission, the two satellites will take simultaneous measurements from nearly the planet’s entire upper atmosphere and magnetosphere, ranging from altitudes between approximately 100 and 6,200 miles (160 and 10,000 kilometers),” according to a UC Berkeley news release about the mission. “Coordinated, multipoint observations are necessary to … unravel the chain of cause and effect within the system.”\n\nEscapade is part of NASA’s SIMPLEx — or Small, Innovative Missions for Planetary Exploration — program, which aims to spur researchers and companies to devise ways to use small, inexpensive spacecraft to carry out science investigations at far cheaper than typical price points.\n\nThe mission’s cost was estimated to be less than $100 million, compared with the roughly $300 million to $600 million price tags of other NASA satellites orbiting Mars.\n\nSign up for CNN’s Wonder Theory science newsletter. Explore the universe with news on fascinating discoveries, scientific advancements and more.",
  "authors": [
    "Jackie Wattles"
  ],
  "url": "https://www.cnn.com/2025/11/13/science/new-glenn-launch-blue-origin-mars"
}