{
  "title": "Understanding the Right’s Antisemitic Turn - The New York Times",
  "text": "What should JD Vance do about antisemitism in his coalition? O.K, look. Not tomorrow, but over the next two years. I deliver my advice to JD and to other people in Washington, not over the airwaves, and they might not appreciate it, but let’s...Fine, a hypothetical leader, of a hypothetical right of center party. Put it this way. Are you trying to. Is it more about of vocal condemnation, or is it more about institutional gatekeeping. Why is antisemitism surging on the American right? Has the America First takeover of the Republican Party undermined conservative support for Israel? The Republican Party completely betrayed its voters by obsessing over Israel. Does America really want to be Israel’s dance partner. The Israel lobby used to be all powerful. It ain’t all powerful anymore. And is it possible to have nationalism journalism without anti-semitism? My guest today is an Israeli political theorist and one of the leading advocates for political nationalism in America, in Israel and around the world. His national conservative conferences have brought together a who’s who of right wing figures and provided a roadmap for the second Trump administration. Yoram Hazony, welcome to Interesting Times. Thank you Ross. These are interesting times. People, I always like to get people to say that it’s good for the promotional trailers. So thank you for that. I want to start with a broad but basic question. You’ve just been in Washington DC having exciting meetings. I’m sure there’s a lot of talk and argument in the air about the growing influence of figures like the White nationalist and antisemitic online star, Nick Fuentes. Just how bad really is anti-Semitism on the American right now. Well, I think it’s pretty bad. The context for American Jews and for others who care, care about anti-Semitism. The context is, first of all, a dramatic increase in radical Islamic and leftist anti-Semitism, which is such a powerful force that many of my Jewish friends have come to the conclusion that the Democratic Party is not that there’s no future there for them. And so the question is whether the Republican Party is actually going to be a party that has an appropriate future for Jews that is a very big question. Now was wasn’t a question for a number of years. Of course, all sorts of people have accused Trump of anti-Semitism, but it turns out that was pretty much hot air. Donald Trump likes having Jews in his coalition. Trump turns out to have probably the most pro-Jewish administration that there’s ever been. And at the same time, it’s very clear over the last year, certainly over the last six months, that figures in the online right, who are important in this coalition. Tucker Carlson is he’s the most obvious example. Candace Owens is the less obvious example. But they and others who let’s say a few years ago, they were kind of mainstream conservatives and now they are reigning over a part of the online right that is sharply veering towards a wide variety of aggressive anti-Jewish messages. So let’s talk about who we’re talking about. Maybe beyond the specific media figures influencers my friend rod Dreher got, let’s say, a lot of attention for quoting someone telling him that 30 percent to 40 of younger Republicans working in politics in DC Nick Fuentes. I have a little skepticism of that statistic. The fact that half of Republican Capitol Hill staffers are women, I think alone should give you some reason to be skeptical. But do you see this as a phenomenon of younger conservatives and right wingers? Do you see it as a phenomenon of an audience that wasn’t antisemitic being activated or drawn in a particular direction. What are we talking about. Well, in terms of the scale of interest in anti-Semitism, I think the numbers are wrong. But I think the analysis is basically right. It’s young people who are subjected. They’re subjected to a savage antisemitic messaging all the time on the internet, on the internet. That’s New, that’s New in this generation. A generation ago, you had to look for this stuff. There’s no looking for it. All of them know. All of them know people who are strongly anti-Jewish. All of them have people in their circle of friends that are like that. They all as part of the podcast that they watch and the media that affect them. They’re confronted with. Powerful anti-black, anti-Jewish. And by the way, also anti-Christian Zionist messaging all the time. Does that make them anti-semites? No, not at all. It might make them people who are thinking about these things and saying, gosh, gosh, I don’t really know. So it’s a normal it’s essentially a normal part of the mix of arguments it is that are in their ecosystem. Absolutely yeah. There’s a clear generational divide not just on this issue, but on many issues the Republican Party over 45 is a completely different Republican Party from the Republican Party under 45. And the under 45 are, among other characteristics. They’re very, very much online. They in terms of their worldview, they’re in a rebellion against the previous generations. And there’s a good deal of resentment, some of it quite justified. Part of this rebellion is also theological, looking for a more authentic form of Christianity. And this New generation’s Christianity is one of its most powerful characteristics is rebellion against the old. Dispensationalist or that’s exactly the right word. But let’s say the forms of evangelicalism that have a clear place for the state of Israel in the end times that are unfolding, right. There is long standing evangelical Christian schools of thought that both have a narrative of the end of the world or the apocalypse, in which the state of Israel plays a concrete role, and also a theology, often where it’s assumed that the New covenant with Christians and the old covenant with Jews run in parallel. I just wanted to clarify that. But go on. Exactly so. So they’re rebelling against that, all of classical questions of why. Why is the Old Testament in the Christian Bible. What are we supposed to get out of it. Do the Jews have any role in history at all. Or was it just supposed to have ended. All of those questions are there on the table. And I would say even more than that this is parallel with just a general evaporation of Old Testament knowledge. This, this age group is looking for a. Much more stronger connection to older traditions. And they don’t necessarily know how to find that. And many of those older traditions have a history of anti-Semitism. I mean, within Christianity. The Catholic Church’s relationship to Judaism changed substantially in the 1960s, Eastern orthodoxy’s relationship to Judaism has always been complicated, to put it mildly. So you think there is a sense of you’re reaching back towards resources of the past and finding Christianity’s antisemitic past there. It’s anti-judaism. No, I think they’re reaching into the past and coming up with all sorts of resources. You’ve heard the word ressourcement. That’s a word that they use a lot is reconnecting to the sources. But when you’re restoring a tradition, you always have to interpret it. There’s no such thing as restoring exactly what it was before. And so there’s a struggle among groups, but also just like a struggle in the soul about what aspects of what’s being restored are things that are appropriate. And so just a couple more characteristics about this age group, unlike the older generation, they don’t really know Jews like they know liberal Jews. But why not. Because the entire Trump movement. The MAGA. The natcon. The entire thing is itself a rebellion against established elites. So if you were being brought up in the old established elites in the Republican Party or the Democratic Party, it was just kind of normal that all those people went on AIPAC trips or Federation trips to Israel and you got a lot of contact with Jewish members of the coalition. And it was normal. There’s New elites in town. The right has thousands of young people. Hundreds of them have gone into the administration, and they are New to a lot of things. And one of the things that they’re New to is sitting around and talking to religious Jews or national nationalist Jews. So this has not been, an important part of my job description for decades, running trips to Israel is not what I do. But in the last year I’ve started experimenting with this together with friends. And I don’t want to be too optimistic, but my experience with this so far is that many of them are open and interested to learn more. Much of what’s missing right now is making a relevant educational experiences available to those people who want it. I think that would be much more effective than a lot of what’s going on in the public debate right now where there’s all these accusations of it’s the 1930s, it’s Weimar and so on. I think that’s not accurate. So I think some of those accusations come out of what has been the dominant narrative about how Jews should think about nationalism ever since the 1930s and the Weimar era, which basically takes for granted that while maybe Jewish nationalism is good for the Jews because it’s enabled the establishment of the state of Israel, nationalism writ large is almost always bad for the Jews. And I think there’s a lot of people, mostly left wing, center left, liberal, but also some people on the center right who would look at your work, your arguments, the fact that you defend nationalism. You run a conference organized around nationalist principles. And they would say, of course he has ended up with anti-semites in his coalition. How could anyone have ever been surprised about that. Well, I’m not completely sure that I’m going to end up with anti-semites. In my coalition, I. I have discovered that a small number of people who. Were trusted members have defected to a somewhat different worldview. They don’t have the same worldview in 2025 that they had in 2022. I’m really not entirely sure what the causes of that were but I think that the assertion that national independence leads to some kind of Nazism and anti-Semitism. I think it is. Intellectually fallacious. I think what is true is that Marxists and liberals and nationalists all have their own ways of coming to find it useful to hate Jews and to make the hatred of Jews a helpful political maneuver. And the nationalist conservative movement is certainly not immune to it. The people who are in charge at this moment are not anti-semites, and they’re not sympathetic to anti-semites. So we’ll see whether five years, 10 years, 25 years from now, whether American nationalism is going to be fundamentally like the movement that Trump built, which is very welcoming to Jews, or whether it’s going to be something very different. Tell me about the virtues of nationalism. You were saying it’s good if we can get nationalist American Christians and nationalist Israeli Jews together. What is the good thing that they share. What’s good about nationalism. O.K, so there’s a kind of a set pattern of the way political order is thought about that goes all the way back to antiquity. And you see this in Hebrew Bible, but you see it in many other sources. You could say the natural way for humans to live is in a society of families and tribes and clans. Every family has its every family has its own foreign policy, basically every family’s a militia, every family. My nine-year-old son would very much endorse this view. No, but there is a state of nature in which families, families, families and tribes are in constant motion of allying and disallowing. That’s probably the way that human beings live through most of our existence on Earth. And the imperial state, the state without limits. That’s familiar from the ancient, the ancient Middle East, the Babylonians, the Assyrians, the Egyptians, and then on into Alexander and the Romans these empires with a mission to conquer the world is, not just because they get stuff out of it, but also in order to bring peace and prosperity to mankind, because the constant agitation of a world in which every family or every clan has a foreign policy, that’s what imperialism is supposed to put an end to empire in the Hebrew Bible is seen largely an evil. I could temper that, but largely it’s seen as an evil. And if you have a King that’s from your own people and prophets that are from your own people and borders that you’re not supposed to cross, because you don’t have an ambition to go conquer the whole world. That world will be more just and also more peaceful. The idea that there is a freedom. What Centuries later, people would call national self-determination. That’s part of the inheritance of the Hebrew Bible. So God in the Old Testament, God creates the Jewish nation. He calls Abraham. He establishes Abraham. He promises him limitless progeny. And then the story of the Hebrew Bible is the story of that. Divinely ordained nation’s relationship to God. So in a sense, nationalism is from the Jews. But does God create other nations in the same way. Yes say more about that. Because God doesn’t give from your perspective. God has not given every nation a scripture and made a covenant with every nation. He’s done something, something special for the Jewish nation. For sure, for sure. Everything you’re saying is true. But it’s also. It is, it is. It is a more complicated subject. And I don’t know how deep we want to go into it. But the first of all, the use of the termination nation in the old biblical traditional sense, it has an aspect of kinship, but it also has an aspect of language, and it also has an aspect of law and religion. I mean, there’s the Tower of Babel story, all the word. The world is unified. One speech, one way of looking at things. And God doesn’t like that. God likes diversity for whatever reason. He doesn’t want mankind to be unified and getting ideas. But the bottom line is God creates the nations and the. The idea seems to be that from the beginning or close to the beginning, at least since Moses. The idea is that there will be one nation that has a better way of life and a better relationship with God, and that its job is going to be to teach that to the nations of the world. It raises the question of really, was the Torah only given to the Jews. Only at Sinai. And the simple answer is you can get away with saying yes. But when you know scripture that it’s not quite so. Well, let me imagine then, an argument that some of the younger Christians you’re talking about might be interested in. Which is something along the lines of Judaism has this national identity, but Christianity is universalizing. It comes on the scene. It takes a revelation given to one nation and takes it to all people it inevitably yields a more Universalist world. America has elements of this universalism, this sense of we are a nation, but we are welcoming all peoples. We do not have an established church, all these kinds of things. And from my perspective, I think of America as a country that has both imperial, universalizing tendencies and nationalist tendencies. And I take your argument, I think you would acknowledge some of that and you would say, right now, America needs more nationalism, not more imperialism and universalism. Is that right. What kind of nationalism does America need right now. I think America is suffering terribly, or at least significant portions of America. Certainly these young people that we’re talking about on the right. Let’s start with something very basic. After World War two. There’s a project. There’s a post post-world War Ii project to replace the old Christian America. The old Protestant America replaced that framework with what we today call liberal democracy. It was going on before that. But came to its dramatic moment when God. God in scripture were removed from the public schools in the 1960s. There they grew up in a world where every choice that you make is up to you, and all the choices are equal where even their parents, even in church or synagogue, they were told, do what makes you feel good. Generate the values from yourself. Do whatever you think is right for you. O.K, which it. It’s not inherently a bad thing to say, obviously, but in a context in which nobody’s saying, listen, kids, marriage is better than not being married. Having children is better than not having children. Going to serve in the army is better than not going to serve in the army. All of these kinds of very fundamental moral and political guardrails that give you a direction, it’s all been shot away. And if once it’s all shot away, you don’t have the basis for a common national culture and you don’t have the basis for continued existence of a Nation, it is a palpably tottering in the direction of dissolution and Civil War all the time. The only way to improve that situation mission is to reassert some kind of cultural center. That doesn’t mean you have to hate anybody who’s not included. But there has to be some kind of cultural center in America, that cultural center, that there aren’t too many choices. It has to be Christianity. It has to be the common law inheritance. It has to be the English language it. These are things that exist in the tradition that can be restored and can be used in order to find a center again. If that’s not done, then, then America, it’s just a matter of time before it, it disintegrates into pieces or until you have some horrific, horrific dictator who rises to impose order by force. So I’m trying to push towards a more American nationalism now means what it means slower immigration, not no immigration, with more emphasis on assimilation and the English language, but in. Is that fair. O.K I’m sorry. So let me be first a slogan. The nationalist conservative movement. It’s got a few slogans. One of them is a national independence, national interests, national traditions, it’s not we don’t have an official committee for adopting slogans. We do. We do have a statement of principles that was negotiated painfully over many years. But I think if you want to simply understand, what does this movement stand for. That’s a pretty straightforward national independence meanings. Meaning that. The various nations of the West need to shake, shake off the oppressive international organizations, whether it’s the EU or the United Nations and to resume something that looks much more like nations determining their own destiny. National interests is referring to the purpose of national government. Its purpose is Trump says, America first to look out first and foremost for the interests of these people. And then the religion. Religion part enters into the National traditions. National traditions means both constitutional and religious traditions. You can add linguistic and others. And these discussions are happening in many countries. But in the United States, concretely, the most obvious policy issues have been. Number one, dramatically reduce immigration or possibly end it for a period. This is a framework that allows Americans to make sense of demands like we’re over 15 percent of the population is foreign born. We need to take a break. We have a right to because we want to be able to preserve what was good about our society before large scale immigration. This framework allows people to understand why it’s morally justifiable to think that way. In order to go back to your prior point, to encourage assimilation rather than to encourage racial purity Yeah right. This has nothing to do with race. There’s strong reasons when you study scripture to notice that God is really unhappy with the idea that people should just be unjustly persecuted because they belong to some other people. One one of the things that’s endlessly frustrating about these discussions, again, on the podcasts is that they talk about the Old Testament as though it doesn’t have love the stranger as yourself for you were strangers in Egypt or any of many other such passages. What does this mean in foreign policy. What is the American Alliance system look like under conditions of nationalist revival, for instance. O.K, important to emphasize I’m skeptical of big political answers that are supposed to just solve our problems. The argument is that in general, we’re better off if we have to choose whether we want to pursue world empire. Like, do we want America to be in part about sending its armed forces to Afghanistan in order to help make sure that the Afghanis have a Constitution and a worldview that looks like ours. So my view is, no, that’s terrible for Americans. It’s not good for Afghanis either. And that shouldn’t be the framework. The framework should be a world of independent nations where first of all, they each nation looks after itself. Does that mean that those are all going to be nations that I would want to live in. No, of course not. And the principle of national independence can be a good principle without having this. Deductive, because nationalism in general is good. That means there are no bad nationalists. Well, that’s ridiculous. I mean, the topic’s anti-Semitism, of course. Of course, they’re nationalists, anti-semites, but they’re also Marxist anti-semites. There’s lots of liberal anti-semites, which is something that strangely keeps getting left out of this conversation. I mean, the idea that being a liberal an Enlightenment liberal thinker makes you immune to anti-Semitism, that’s absurd. Can you say something about why people who are liberals or people who are on the left, would be tempted towards anti-semitism? I think there are listeners and viewers for whom the narrative of nationalism yields to anti-Semitism is just much more intuitive than a narrative of left wing politics leading to anti-Semitism. That’s a post-world War Ii phenomenon an intellectual spin to think, oh, Hitler was a nationalist. Therefore, nationalism leads to anti-Semitism. But liberalism has a lavish history of anti-Semitism. The liberal Enlightenment, the encyclopedists. Voltaire it is rotten with anti-Semitism. The German Enlightenment, Kant, Hegel and many, many others is just horrific in its because. Because the Jews are seen as this pre-modern holdover that resists liberalism. What is all the Enlightenment rationalists? All of them. They think that what they’re doing is they’re moving the world towards reason. They’re dropping tradition, they’re dropping God, and specifically they’re dropping they’re dropping the Bible for all sorts of reasons. They’re extremely aggressive against the Hebrew Bible and against the Jews, whereas they’re more careful with how they handle the New Testament than Christianity. And so what you get is, I mean, this should sound familiar because these people are still around today. You get the view that the Old Testament, it’s about genocide, it’s about tribalism, it’s about war, it’s about vengeance. It’s about an obsession with the land. It’s about the claim of specialness and superiority of a particular people and the Enlightenment. They hate particularism. They hate it. It drives them completely bananas to have a particularistic religion. And so the hatred of Jews is because the Jews are the number one the classical example of a particularism. And they want particularism destroyed. They think you can’t get close to God if you don’t drop your particularism and use reason to get to a universal truth that’s accessible to everybody. And then this is transferred to contemporary debates where Israel as a particularist nation is seen as an affront to liberal, left wing, universalizing sentiments. Absolutely so I’m not trying to solve all the problems with this idea of a world of independent nations. I’m trying to solve some problems. Let me editorialize at you for a moment, please. I think that whether or not a listener is persuaded by your case for nationalism, the reality of nationalism right now, the reality of a nationalist turn all around the world is just overdetermined by tons of different forces. So I think it’s tremendously important to figure out what a virtuous nationalism looks like, because we’re going to have nationalisms in the 21st century. But I also pretty much take it for granted that an effect of a more nationalist world and a more nationalist America is a deep change in the relationship that the US has had with Israel for the last 50 to 70, 25, whatever period you want to suggest. Protestant Americans looked at Israel and saw a country that had a similarly biblically rooted religion. That was all we were both settler societies and so on. There were these commonalities of nationalism, but a big part of the us-israel bond that some of that universalism that you were talking about after World War two that was related in revulsion against the Holocaust and Hitler that was related in of evangelical Christian universalism that went beyond American borders. And I just don’t see how you can have a world or an America that retreats from universalism, retreats from liberal empire without having a lot more skepticism about the us-israel special relationship. Am I wrong Well, I think that the relationship is going to change for the reasons that you’re saying. I’m not sure it’s exactly correct to frame it as a Americans had faith in the relationship and now they have skepticism. I think we are in a transitional time on many, many issues. And one of the issues is the way America conducts foreign policy, America’s old way of conducting foreign policy for two generations was to see itself as kind of a global policeman with responsibilities to everything in the world and specifically with regard to countries that were labeled liberal democracy whether they were correctly labeled or not. But once they got labeled that way, then there was an attitude of America’s in charge. And there have definitely been benefits to Israel of this, but it is worth emphasizing that since right now there are all these people saying, Israel could never survive without the United States. Israel was created by the United States. It’s not true. Israel and America have an extremely special, special relationship for the reasons that you said. But it’s no nobody should be thinking that Israel has to be an American protectorate forever. I’m not only talking about, the feelings on the American right where the aid to Israel has been an issue for forever. I mean, since I was a kid, that’s been an issue for the American right. I’m pretty sure that after the Biden administration, most Israelis have figured out that the aid is it’s a two edged sword. And I don’t think Israel’s Israelis want to have forever to be being told what to do down to the level of which street in Gaza should you send troops to from across the Atlantic. I think it’s a disaster for America to be involved in other people’s wars at that level. So I’m not going to say how much of what we’re seeing on the American right now is driven by the Gaza war. But clearly it’s not irrelevant to the story. And you have a number of American conservatives, nationalist politicians like Marjorie Taylor Greene standing up and saying, I think that the war in Gaza is unjust, or I think Israel is committing war crimes and things and things like that. How do you navigate that kind of tension, I guess, from the point of view of America or Israel. Well, if the United States feels that. War crimes are being committed, I think it’s pretty normal for ambassadors to protest. And if things are bad enough to take steps to try to change things. But I don’t think that’s the right way to look at the antisemitic. Let me just give it a label because anti-Semitism certainly doesn’t cover the entirety of what’s going on. There’s always been an Alt right. I don’t always, but ever since there was an internet, there was an Alt right. Everybody knew what it was. It’s not a coherent set of ideology or something. It’s a bunch of different ideas and different movements, which in general, some of them are sick of the American Constitution. They want to overthrow it. Some of them are sick of God in scripture. They want to overthrow that. Some of them are, and some of them are sick of having Jews involved in coalition politics in the United States. And they’d like to end that. But that Alt right was always a pretty peripheral for all the years that I’ve been involved in this up until 2023. O.K, now 2023, as you say, it’s overdetermined. I mean obvious obviously that that’s when October seven happened. And that was the beginning of Israel’s war. And it affects everything. But other things were going on. Tucker Carlson did not he didn’t leave Fox News early 2023 because of the war, which started in October. Tucker’s Tucker’s move into the Alt right space, it preceded this war. So there are other things going on and. I’m not. Well, let me say this. Well, let me say let me say this somewhat forcefully. I have not discovered that the openness to antisemitic messaging on the right under the age of 45. I have not noticed that it is a reaction almost at all to supposed Israeli genocide or accusations of war crimes in Gaza. When you talk to the actual people, the relevant people that we’re talking about, honestly, they have no interest. It’s true that Carlson’s program and Dave Smith and a whole bunch of other people are importing the arguments of the left. I mean, they’re basically reading Haaretz. They’re reading Israel’s Bolshevik lefty, lefty newspaper, which is it’s strange to have people who are supposed to be conservatives learning these things from Bolsheviks. It’s a little bit weird, but. The actual people that we’re talking about, the people like we’re worried about 10 years from now, 20 years from now, these elites, they’re going to be in government in the United States. Those people do not. They don’t, as far as I can tell, they don’t buy the Gaza line. They do have openness to Jewish skepticism and to possible anti-Semitism. But it’s not about Gaza. See, to me, that’s a very pessimistic reading from my perspective, because it seems to suggest the Gaza war is hopefully a temporary foreign policy crisis that has yielded all kinds of concerns about the US relationship to Israel, all kinds of concerns about Israeli policy. But those concerns could be time bound. They could be removed from the stage. And if I’m being optimistic about the trajectory of anti-Semitism on the right or left, I would say. Remove remove the Gaza war and the arguments about its Justice and injustice from this debate. And a bunch of people who are not hardcore anti-semites, but are peripherally drawn to those arguments, the kind of people who might read about Jeffrey Epstein and say, oh, this Jewish financier and people are saying he was blackmailing the US and that maybe that explains why the US isn’t doing more to stop the Gaza war. Like, that’s train of thought. You cut off some of those trains of thought change the foreign policy dynamic, and anti-Semitism doesn’t go away, but it diminishes. If that’s not the case, then it seems to me that we’re talking about more something that’s fundamentally rooted in the culture of the internet, maybe the culture of parts of my own religion. You’re suggesting that seems to me to be a darker narrative, a reason to be more pessimistic than you can. I’m sorry. I wasn’t, I was. I know you weren’t trying to be optimistic. No, I was just trying to be factual. This is not. This tremendous hurricane of a fight that we’re seeing on the right between Jews and Zionist Christians against an emerging faction which is hostile to Jews and Zionist Christians being part of the coalition. This fight is not about foreign policy. It was I don’t think it was ever about foreign policy, but it doesn’t matter. It’s very easy to see that it’s not about foreign policy. Because when the issue was. Trump is about to start World War 3 because the Jews are dragging him into war with Iran. The United States is going to occupy Iran. Thousands of people are going to die. China is going to enter. Russia is going to enter. We’re going to lose. Like those were very, very prominently stated views about what was going to happen up until June 22, after June 22. If this were a foreign policy issue, then what should have happened is that people should say, wow, this isn’t the old neocon foreign policy. It’s not about conquering the whole world and turning it into liberal democracies. It’s something else. It’s much more realistic. It’s much more a about, say, placing some American power at into play in contexts in which American allies have been doing most of the fighting themselves. June 22 could have happened. We could have been June 23. And all the people who said these totally crazy things about World War 3 and all that they could have just said I was wrong. The Trump nothing, nothing ever happens that fast. No in fairness, in political debates, fine. It could. It could have been three weeks later. Whatever a month later, right. There wasn’t. No something did happen that was fast. What happened was that with that, instead of saying, oh, the Trump team, they’re actually pretty good at this. They actually know what they’re doing. They’re not the old neocons. Instead of saying that they immediately the same complex of podcasters. They immediately switched to Epstein. They immediately went to I mean, yeah, but so doesn’t that but part of it just got it got much worse. The anti-Jewish messaging over the summer was much worse than before the Iran attack because it went to Epstein, and after Epstein it went to Charlie Kirk. And did the Jews kill Charlie Kirk. There has been all year long a nonstop anti-Jewish campaign to differing degrees in different podcasts. And that campaign is not about foreign policy. “Foreign policy is one of the tools in its arsenal and I but then I feel like you are in a way making a version of what would be the typical liberal argument about the problems of nationalism, because these podcasters who you’re talking about, not all of them, but many of them, I think a lot of people would just say, these are part of the constellation of nationalism and populism in American politics. Certainly, Carlson himself was a speaker at natcon. And so aren’t you then left with the conclusion that if it’s not foreign policy that’s doing it, then a resurgent nationalism in America was always just going to develop an anti-Semitism problem. I mean, do you think do you estimate the liberal critique of nationalism slightly higher. I guess in a world do you give it any more credit than you would have three years ago. And then I’ll ask what you do about it. But no. I’m sorry. I mean, I really want to help with that, but I can’t no, I don’t. As I said before, I think that hating Jews is a useful tool and ideologically makes sense. For some people within the Marxist framework, within the liberal framework, and within the nationalist framework. I mean, the Jews are never going to stop being a potentially useful target because it’s a small group of people with a lot more influence than their numbers suggest, which is annoying. It’s annoying to people that that’s the fact, the specific context of Western history in which Jews Jews continue to represent the mosaic law and the Old Testament as a living religion, which is lots of Christians admire it. Lots of Christians feel like it. We’re brothers and I feel that way. But many people are always going to say no. The religion is challenging to my Christianity. I’ve got to suppress it somehow. I just I don’t think that that’s intrinsic to nationalism, but. Well, but maybe it’s but maybe it’s this then each form of politics has specific things intrinsic to it that are picked up by anti-semites. So maybe liberal and left wing anti-semites say Jews offend against our cosmopolitan universalism by remaining particularist. But within the context of nationalism, it turns out to be Christianity a certain kind of conspiratorial anxiety about elites and then the internet supercharging it. And maybe I mean, that’s how I’m interpreting what you’re saying. So what. We’ll end here. What do you but not just you. What do leaders of a nationalist conservatism who aren’t anti-semites do about it. What does Donald Trump. What do you think Donald Trump or JD Vance should be doing about this. What you’ve just described as a roiling battle. Look, Trump already gave us a model like he already did something. He built a nationalist coalition which had many different groups in it. And he very skillfully made sure that the different parts of the coalition were honored and to a large degree, giving honor to one another. A political coalition like this, it’s a lot like a marriage. If The two parties, the husband and wife. They’re always going to have different opinions and to a certain extent, different interests. And if they honor one another despite the differences, then you can get through it and you can have a beautiful marriage if they’re not willing to honor one another. And instead, each side feels like I’ve just got to say everything I think about now sit and listen. I’m going to tell you all about what I think, O.K. So that’s what’s happening on these podcasts. The Trump coalition was built on, trying to give honor to everybody, which meant that everybody’s unhappy at certain moments because you can’t honor everybody equally all the time. But he made it work. Trump made it work. What’s happening on these podcasts is a completely is an exhortation to a completely different kind of politics. Let me just a few examples quickly so that it’s clear what I’m talking about. Podcasts that say repeatedly that the Old Testament is about violence and genocide, or the repeated claim that Jews are demonic, the Jews are a demonic force in history, or the repeated claim that Jews are trying to kill every Christian in the Middle East, and they have a plan to do it or the repeated claim that the Jews rule the American government, or that the Jews shot Kennedy, or I mean, you could just keep going on and on that Zionist Christians that they’re heretics and that it’s idolatry. All of these messages, they are fine. It’s people have a right to their opinion, but they’re abusive, wild slanders. And in a context in which the political coalition is constantly having to absorb these attacks on one or another part of the coalition, you’re not going to be able to maintain it. But so how that’s placing the agency with people offering antisemitic arguments online. But presumably they’re not. Candace Owens is probably not going to listen to this podcast and say, Yoram Hazony has convinced me to stop saying that Israel was involved in Charlie Kirk’s assassination. The people who are listening to you, presumably, are the leaders of conservative institutions like the Heritage Foundation, which has been in the news for its difficulty navigating this but also Donald Trump. JD Vance would be future leaders of the Republican Party. And I will say one thing about Trump is that he has a unique kind of charisma that I have come to appreciate, in reluctantly over his years. But Trump got people to vote for him in 2024, who wanted the US to do more to support Israel in its war in Gaza, and who wanted the US to stop the war tomorrow, right. He got Arab Muslims in Dearborn, Michigan, and right wing Jews in greater New York City. That’s a unique political talent. And maybe it creates tensions that are just really hard to manage for his successors. So I want you to give advice. Just give advice to JD Vance. What should JD Vance do about anti-Semitism in his coalition. O.K, look, in the next not tomorrow, but over the next two years, I deliver my advice to JD and to other people in Washington, not over the airwaves. And they might not appreciate it. But let’s a hypothetical, a hypothetical leader of a hypothetical right of center party, is it. Put it this way. Are you trying to or is it more is it more about of vocal condemnation. You need people to draw a bright line. Or is it more about institutional gatekeeping making sure you are making decisions about who is occupying leadership positions, who you’re hiring, and so on. The basic, the fundamental skill that you and I are admiring in Donald Trump and we’re hoping can help us Yeah no and no. But he’s got it. He does. And he has that skill. We’re hoping to see in JD or whoever is going to be the next Republican or conservative leader. We’re hoping to see a similar skill. What exactly is that skill. That skill is the skill of determining what the boundaries of the coalition are. That means it has a boundary to the left. It has a boundary to the right. Every coalition has boundaries. There’s no such thing as a coalition that’s just open on one side. It doesn’t exist. So it means determining. It means determining who’s in and who’s out. This is not the same thing as canceling them or making them illegal. The question is who’s sitting at the table when you’re making decisions. Nick Fuentes does not have to sit at the table when you’re making decisions. Part of that job of deciding who’s in and who’s out is giving honor. But part of it also is laying down the law. It means that if particular individuals or politicians or streams look like they could be in, they’ve been in before, they could be in again. But if they’re causing too much trouble, then the person who’s heading the coalition, the person who’s building it, maintaining it every day has to be able to say, look, I need your help. I need you to knock it off. Here are the things I want you to stop doing. Or here are some things that I want you to do in order to make it possible for this coalition to survive. Do you think it’s hard for Republican leaders to do that right now. Do you think people again, generic Republican leaders, do you think that they’re. Do you think that they’re afraid of the forces. Yes, but part of what we’re seeing, and this is a crucial point. They didn’t understand until very, very recently that this dynamic exists at all. Most of the people in the administration and other significant figures the Heritage Foundation. Turning Point USA. All these other big pieces of the nationalist right. Many, many of them. Almost all. In fact, almost all of the leaders have been silent so far in trying to navigate this summer’s explosion of. Anti-Jewish messaging. I mean, it is a hurricane. And I already said what their job is, but I didn’t say anything about timetable. Kevin Roberts from Heritage is a close friend. He stepped stepped forward to try to make order in this and destabilized his institution because the hurricane forces are too strong and he didn’t completely understand what it was that he was stepping into. Now, Kevin virtually everyone else that I know in Washington is fundamentally ecumenical in his worldview. He wants to see a coalition that’s Protestants, Catholics and Jews working together to make America great and he’s got all these people attacking him and saying that he’s an anti-Semite. It’s extremely unnerving. And it’s unnerving for everybody. I think it’s going to take some time. Look, I know that people are many people. Many, many people feel such terrible things are being said. Jade’s got to speak up. Kevin’s got to speak up. The leaders have to speak up. Trump has to speak up. I understand it, I sympathize, but that’s not the way it works. What needs to happen is for an appropriate set of decisions to be made over and over time, responsibly about who’s going to be in the coalition. Who’s going to be outside of the coalition. That means hearing people out. That means learning about this crisis, which most of the relevant players, they didn’t know until a few weeks ago that there was such a crisis. So now they’re learning for the first time that they have this problem. And I assume that heritage is going to solve the problem. I know a little bit about what steps they’re taking, and I think it’s very, very likely that heritage is going to get on an appropriate and excellent path. And I think that’s true for the other institutions we’re talking about. People need to learn this subject. Nobody thought that anti-Semitism on the right was going to be one of the top three or four things that American political leaders had to think about six months ago. So now it is. Now they have to think about it. There’s a lot of good people really, really, really good people who are in the administration and in these think tanks and they’re working on it. And from what I saw in the last two weeks in Washington, I believe that they will eventually come to appropriate conclusions. All right. I imagine we’ll have chances to revisit this argument in the not too distant future. But for now, Yoram Hazony, thank you so much for joining me. Thank you for having me. My pleasure.",
  "authors": [],
  "url": "https://www.nytimes.com/video/opinion/100000010528982/understanding-the-rights-antisemitic-turn.html"
}