{
  "title": "Nintendo is making a live-action Zelda movie",
  "text": "Posts from this author will be added to your daily email digest and your homepage feed.\n\nNintendo’s foray into movies isn’t stopping anytime soon: the company has confirmed that it’s working on a live-action adaptation of The Legend of Zelda. The movie will be directed by Wes Ball, best known for the Maze Runner trilogy and the upcoming Kingdom of the Planet of the Apes. Zelda creator Shigeru Miyamoto will serve as a producer, much as he did on this year’s animated Super Mario Bros. movie. He’ll be producing alongside Avi Arad.\n\n“This is Miyamoto. I have been working on the live-action film of The Legend of Zelda for many years now with Avi Arad-san, who has produced many mega hit films,” Miyamoto said in a statement posted on X, formerly Twitter. We might be waiting a while for the movie, however; Miyamoto said, “It will take time until its completion, but I hope you look forward to seeing it.”\n\nWhile there aren’t many details on the movie itself, Nintendo says that it will be co-financed by itself and Sony, with Nintendo footing more than 50 percent of the bill.\n\nThe announcement comes at a pivotal time for Nintendo, as the company has made its ambitions to become a broader entertainment company clear. That includes not only the Super Mario movie but also a line of theme park attractions. This year also saw the release of the latest major entry in the Zelda series with Tears of the Kingdom.\n\n“By producing visual contents of Nintendo IP by itself, Nintendo is creating new opportunities to have people from around the world to access the world of entertainment which Nintendo has built, through different means apart from its dedicated game consoles,” the company said in a statement about the Zelda film. “By getting deeply involved in the movie production with the aim to put smiles on everyone’s faces through entertainment, Nintendo will continue its efforts to produce unique entertainment and deliver it to as many people as possible.”\n\nIt was previously rumored that Nintendo was working on a live-action Zelda series for Netflix, though that project never came to pass.",
  "authors": [
    "Andrew Webster"
  ],
  "url": "https://www.theverge.com/2023/11/7/23951339/the-legend-of-zelda-movie-live-action-nintendo"
}