{
  "title": "Don’t buy the M1 MacBook Air when the M4 model is just $150 more",
  "text": "is an editor covering deals and gaming hardware. He joined in 2018, and after a two-year stint at Polygon, he rejoined The Verge in May 2025.\n\nPosts from this author will be added to your daily email digest and your homepage feed.\n\nThis is just a little public service announcement ahead of Black Friday. Walmart will once again tout the M1 MacBook Air as an unbeatable deal for laptop shoppers. It sure is tempting at $599, especially if you haven’t seen the deal before. It might even be the right choice for some people.\n\nBut for most Verge readers buying either for themselves or for someone who needs to get stuff done, it’s not a great value. Not when the 2025 M4 model, with its spec enhancements, design tweaks, and processing speed improvements, is just $150 more. You can currently get one of those on sale starting at $749.99 from Amazon and Best Buy.\n\nApple’s M-series processors have gotten more powerful every year, and the M4 represents the fourth generation. That’s not to say the M1 MacBook Air is a bad machine. You can do a lot worse with $600. Compared to some of Apple’s Intel-based laptops, the 2020 model raised the bar for performance and battery life. But its compromises become more apparent with each passing year. You should also just buy the laptop that will get more software updates.\n\nThe $599 M1 MacBook Air includes just 8GB of RAM, which is less than most flagship smartphones have these days. It’s surprisingly speedy when handling a light load, but my spouse owns one, and it’s a pretty sluggish experience when you load it with a lot of browser tabs. The newer MacBook Air comes with 16GB of RAM by default, and the M4 processor lets it fly through tasks faster. It has a similar array of ports (two USB-C ports, one headphone jack), though its USB-C ports are faster with Thunderbolt 4 support. It also has a dedicated MagSafe charging port, so you don’t have to sacrifice one of the precious USB-C ports for charging.\n\nAnd those are just the biggest spec differences; Apple ditched the wedge-shaped design of the M1 and earlier MacBook Air models starting with the M2 model. They look more sophisticated, almost like a MacBook Pro. The screen is bigger thanks to smaller bezels, and there’s a notch that contains the 12-megapixel Center State webcam — another big improvement over the M1 model.\n\nLook, I could go on and on. Our reviews do a great job of spelling out every little difference, including in-depth metrics from testing processing-intensive applications. But, in short, the M4 runs laps around the M1, and for just $150 more, the M4 MacBook Air is the clear winner if you’re looking for a semi-affordable MacBook this holiday.\n\nVerge Deals Sign up for Verge Deals to get deals on products we’ve tested sent to your inbox weekly. Email (required) Sign Up By submitting your email, you agree to our Terms and Privacy Notice . This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.",
  "authors": [
    "Cameron Faulkner"
  ],
  "url": "https://www.theverge.com/gadgets/824237/m4-macbook-air-apple-m1-laptop-black-friday-deal-sale"
}