{
  "title": "Ro Khanna explains how he helped engineer the vote that ‘ripped MAGA apart’",
  "text": "Washington —\n\nThe House vote to release the Jeffrey Epstein files was, in the end, 427-1. That’s a margin typically reserved for proclamations and post office namings, not for what was perhaps the biggest defeat of President Donald Trump’s second term, a fight that GOP Rep. Marjorie Taylor Greene declared on Tuesday had “ripped MAGA apart.”\n\nA group of Epstein’s survivors, sitting together in one section of the House gallery, applauded. Democrats applauded. Some Republicans applauded. No one seemed to say much to Rep. Ro Khanna as he stood in the center of the floor, toward the front, chitchatting with colleagues. When Illinois Rep. Joshua Jackson patted Khanna on the back a moment later, it wasn’t clear if he was acknowledging Khanna’s work or just trying to squeeze by to get to someone on the other side.\n\nThat morning, Khanna had noticed that Greene and Rep. Thomas Massie, his Republican co-sponsor on the discharge petition leading to Tuesday’s vote, were trending on X and he wasn’t. He is trying to be fine with that, as playing down the Democratic role to woo Republican support was always part of the plan. He offered a “Schoolhouse Rock”-like optimism about legislating, saying, “It feels like you can make a difference in Congress.”\n\nBut Khanna doesn’t hide his belief that Tuesday’s triumph proves he should be taken seriously as a party leader and maybe even for the long-shot 2028 presidential run he is always happy to talk about. He argues the vote vindicates the value of his long relationships with Republicans – he and Massie connected years ago working on legislation to halt US military support to Saudi Arabia for its war in Yemen – and his willingness to talk to almost any party.\n\n“I make no secret about wanting to be part of shaping the national future of the Democratic Party of this country. I make no secret about the fact that I believe I have the best economic vision for this nation,” he said in an interview with CNN before the vote, ticking through his emphasis on forgotten communities abandoned by billionaires he says have rigged the system.\n\n“The knock on me from some — I mean, there are many knocks on me — but one of the knocks on me has always been: ‘Okay, Ro, you can write books on this, you can write op-eds on this, but can you really, brass tacks, get things done?’ And it’s easier if you’re a mayor or a governor or a Cabinet member to show you can get things done. And what this is showing is, you know what? On one of the biggest things, which is getting MAGA on board, it’s not just ideas. I’m able to get things done.”\n\nOthers are willing to give him credit too.\n\n“It took him on his side and me on my side, and our working relationship before this, to be able to do this,” Massie said after finishing thanking the survivors at their press conference outside the Capitol on Tuesday morning. “Our chance of success was about 4 percent at the beginning, and we’re going to succeed. So I am a little bit surprised. I’m used to fighting battles and not winning.”\n\n“I think Ro Khanna is a brilliant human being. I think he stands for justice. He’s on the right side of history,” said Haley Robson, an Epstein survivor helping organize the trembling “sister survivors” who tend to arrive holding up pictures of themselves when they first met Epstein, speaking to CNN after the vote. “If it wasn’t for Massie, Marjorie Taylor Greene and Ro Khanna, I don’t think any of this would have been possible. They are just incredible people who genuinely care.”\n\nFrom left: Rep. Ro Khanna, Rep. Thomas Massie, and Rep. Marjorie Taylor Greene speak during a news conference as the House prepares to vote on the Epstein Files Transparency Act, at the US Capitol on November 18, 2025. J. Scott Applewhite/AP\n\nHow he strategized\n\nKhanna, a 49-year-old who represents Silicon Valley, has gotten used to often getting a better reception as the token Democrat on right-wing media than he does from some of his colleagues. This time, he’d like a little more credit for being ahead of the curve.\n\n“In the beginning,” he told CNN, “I’m not going to say who, but some of the folks in our own party were like, eyerolls, ‘There goes Ro on one of his issues…’ ‘Why aren’t we talking about the price of eggs?’ ‘Why aren’t we talking about the price of health care?’ ‘What’s up with this?’ And I said, ‘No, there is something legitimate here.’”\n\nThat included building a relationship with Greene, whom he said he barely knew before – but had never blasted on Twitter like so many of his colleagues – and now texts with. Or carefully maneuvering how to get Colorado Rep. Lauren Boebert in September to sign the discharge petition that forced the vote. Massie relayed that she’d do it if she didn’t have to wait in line, so Khanna pulled the paper away from a Democratic colleague on the House floor and let her walk over and do it.\n\nTo report about Khanna is to inspire exasperation from political journalists and operatives who’ve rued for years how many stories the congressman always manages to put himself into as the hinge point.\n\nBut it’s also to hear from a person who speaks to Barack Obama often that the former president keeps an eye on Khanna as an administration alumnus (Khanna was a deputy assistant commerce secretary in the first term, before launching a primary against an incumbent whom Obama endorsed). Without overstating it, the person said, Obama “appreciates that Ro is willing to show up across all varieties of platforms.”\n\nThat gives Khanna a phone full of contacts to promote himself and his ideas, from MAGA podcaster Steve Bannon to forever never-Trumper Bill Kristol to Larry Summers, the former treasury secretary and Harvard president whom Khanna is now disgusted to think he was on the phone with arguing about economic policy just weeks ago. The batch of Epstein estate emails released last week revealed Summers had been asking Epstein for advice on how to sleep with a mentee of his until just before Epstein’s final arrest.\n\n“If there was no media attention to this,” Khanna said, “this thing would never have gotten a vote. So the idea of politicians being ambitious to raise issues they care about to the American public is a good thing, if the ambition is for a good public purpose. This idea that we should not be savvy about getting our message out in the media is setting us up for being ineffective.”\n\nA spokesperson for Rep. Hakeem Jeffries, who voted for and touted the win, didn’t respond when asked what the Democratic leader made of Khanna’s pushing the bill through.\n\nRep. Don Bacon, the retiring Nebraska Republican who’s become friendly with Khanna through their subcommittee work, argued Republicans always wanted to release the files, despite Speaker Mike Johnson in a floor speech on Tuesday calling the vote a distraction from “urgent legislative work.”\n\n“It could have been anybody” leading the charge, Bacon said. Then he reconsidered.\n\n“He was smart enough to get on it,” he said.\n\nRep. Ro Khanna speaks to reporters on the steps of the US Capitol on November 18, 2025, after the House passed the Epstein Files Transparency Act. Julia Demaree Nikhinson/AP\n\nAnger and regrets\n\nAt first, Khanna says, he took up the Epstein files cause because it was another way of sticking it to the elite class, the ones he travels the country talking about under his “economic patriotism” umbrella for shipping out their jobs and selling out their communities. But he was changed by what he calls the “emotionally horrific” meetings with survivors who started to come through his office — the guilt of having recruited friends, the trauma of being coerced, the women breaking down about how they’ve blocked memories of their own rapes and wanting the records of what happened so they can at least reclaim their own experiences.\n\nHe should have listened sooner, he said Tuesday. He shouldn’t have let it slide when he says he brought up releasing the Epstein files with former Rep. Elijah Cummings, the Democrat and House Oversight chair who died in 2019. He shouldn’t have waited until Trump’s backing off his promise to release them got him going in the spring.\n\n“Had I met the survivors in 2019 or 2020,” Khanna told CNN. “I would have been more vocal in the Biden administration. I think it is a fair point that all of us should have been more vocal earlier.”\n\nKhanna’s father taught him to be stoic, he said, so tears don’t tend to flow, but the anger does. This was insidious, he felt, “a rottenness in our civilization that allowed this to happen — like, how are we allowing these people to get away with this stuff?” he said.\n\nThis wasn’t about billionaires rigging the system, Khanna started to say. Men so rich and powerful and interconnected that they had means and the gall for a “rape island” and then to try to intimidate away any consequences represented something more: This, he argues, was about “the Epstein class.”\n\nA ‘proof of concept’\n\nKhanna doesn’t know if he’ll be invited to the bill signing Trump is now promising. He hasn’t talked to the president since January 6, 2021, not that their relationship was ever much more than hellos at first-term bill signings and one chat in the Oval Office about a new term-limits law. He thinks Trump won’t be able to wiggle out of his promise, or of complying, and believes there are too many survivors’ lawyers and former Justice officials who’ve seen the files to know if they get selectively scrubbed.\n\nKhanna is already talking to Greene about joining together to try to ban private equity firms from buying up single-family homes. He wonders if he can get a few Republicans to extend Medicare to people starting at 55, even though he still favors Sen. Bernie Sanders’ Medicare for All. Cutting defense budgets seems to have some crossover appeal. Maybe they can come up with a billionaire’s tax that they’ll say is all about taking on the Epstein class.\n\n“My point is, if your goal is just, ‘How do Democrats win,’ maybe anti-Trump is enough for a moment. If your goal is, ‘How do we build an enduring majority, which is what progressive Democrats like me want to do?’ This is absolutely essential,” Khanna said. “This is a proof of concept that we need to actually figure out how we bring disaffected MAGA voters into our coalition, that we need to focus much more on railing against a system that has screwed Americans and offering a hopeful message about how we help them, more than just meme-ing against Donald Trump.”\n\nCORRECTION: This story has been updated to correct Khanna’s age. He is 49, not 47.",
  "authors": [
    "Edward-Isaac Dovere"
  ],
  "url": "https://www.cnn.com/2025/11/19/politics/epstein-files-ro-khanna"
}