{
  "title": "Is the universe’s expansion slowing down? Astronomers cast doubt on Nobel-winning theory",
  "text": "The universe’s expansion might not be accelerating but slowing down, a new study suggests.\n\nIf confirmed, the finding would upend decades of established astronomical assumptions and rewrite our understanding of dark energy, the elusive force that counters the inward pull of gravity in our universe.\n\nTwo separate teams of astronomers, while observing bright, exploding stars called Type 1a supernovas, put forth the idea in 1998 that dark energy might enable the universe to expand at an accelerating rate.\n\nThe scientists had noted that some of the most distant supernovas were dimmer than expected and concluded that they had moved away from Earth faster than anticipated. The discovery won them a Nobel Prize in physics in 2011.\n\nHowever, the nature of dark energy has remained a mystery, and its role in the universe’s expansion has been called into question before.\n\nLast year, a consortium of hundreds of researchers using data from the Dark Energy Spectroscopic Instrument (DESI) in Arizona, developed the largest ever 3D map of the universe. The observations hinted at the fact that dark energy may be weakening over time, indicating that the universe’s rate of expansion could eventually slow.\n\nNow, a study published November 6 in the journal Monthly Notices of the Royal Astronomical Society provides further evidence that dark energy might not be pushing on the universe with the same strength it used to.\n\nThis Hubble Space Telescope image features a supernova in the constellation Gemini. ESA/Hubble/NASA/R. J. Foley (UC Santa Cruz)\n\nThe DESI project’s findings last year represented “a major, major paradigm change … and our result, in some sense, agrees well with that,” said Young-Wook Lee, a professor of astrophysics at Yonsei University in South Korea and lead researcher for the new study.\n\nLee and his colleagues’ work builds on the evolving understanding of dark energy, suggesting that the universe’s expansion has already started to slow down — something that could alter the fate of the universe itself. “Dark energy is there, but the present universe has already entered a decelerating phase, today,” Lee said. “So the fate of the universe could change. And if you can change the fate of the universe, that is really important progress in cosmology.”\n\nAging supernovas\n\nTo reach their conclusions, the researchers analyzed a sample of 300 galaxies containing Type 1a supernovas and posited that the dimming of distant exploding stars was not only due to their moving farther away from Earth, but also due to the progenitor star’s age.\n\n“Before our work, Type Ia supernovae were thought to explode with nearly identical intrinsic brightness, making them highly reliable ‘standard candles,’” said study coauthor Junhyuk Son, a doctoral candidate of astronomy at Yonsei University. “However, we found that their luminosity actually depends on the age of the stars that produce them — younger progenitors yield slightly dimmer supernovae, while older ones are brighter.”\n\nSon said the team has a high statistical confidence — 99.99% — about this age-brightness relation, allowing them to use Type 1a supernovas more accurately than before to assess the universe’s expansion.\n\nThis detailed view from the James Webb Space Telescope reveals thousands of distant galaxies, some dating back to the earliest periods of cosmic history. ESA/Webb/NASA/CSA\n\n“If confirmed, this would represent the most significant shift in cosmology since the discovery of dark energy in 1998,” Son said. “It would suggest that the (expansion of the) universe is no longer accelerating today and that dark energy is not a constant force but something that evolves over time. This discovery would open an entirely new chapter in our understanding of the physical nature of dark energy, how it has changed throughout cosmic history, and what it ultimately means for the fate of the universe.”\n\nEventually, if the expansion continues to slow down, the universe could begin to contract, ending in what astronomers imagine may be the opposite of the big bang — the big crunch. “That is certainly a possibility,” Lee said. “Even two years ago, the Big Crunch was out of the question. But we need more work to see whether it could actually happen.”\n\nExtraordinary claims\n\nThe 2011 Nobel Prize laureates in physics (from left) Saul Perlmutter, Adam Riess and Brian P. Schmidt chat during a news conference at The Royal Swedish Academy of Sciences in Stockholm in December 2011. Janerik Henriksson/Reuters\n\nThe new research proposes a radical revision of accepted knowledge, so, understandably, it is being met with skepticism.\n\n”This study rests on a flawed premise,” Adam Riess, a professor of physics and astronomy at the Johns Hopkins University and one of the recipients of the 2011 Nobel Prize in physics, said in an email. “It suggests supernovae have aged with the Universe, yet observations show the opposite — today’s supernovae occur where young stars form. The same idea was proposed years ago and refuted then, and there appears to be nothing new in this version.”\n\nLee, however, said Riess’ claim is incorrect. “Even in the present-day Universe, Type Ia supernovae are found just as frequently in old, quiescent elliptical galaxies as in young, star-forming ones — which clearly shows that this comment is mistaken. The so-called paper that ‘refuted’ our earlier result relied on deeply flawed data with enormous uncertainties,” he said, adding that the age-brightness correlation has been independently confirmed by two separate teams in the United States and China.\n\nOther experts in the field who were not involved with the study echoed some of Riess’ concerns. Dan Scolnic, an associate professor of physics at Duke University in Durham, North Carolina, noted that the study makes a leap from host galaxy age to supernova age that isn’t physically justified. “The authors are proposing ideas that the community has already tested and corrected for with much larger data sets. The universe is still accelerating just fine,” Scolnic said.\n\nDillon Brout, an assistant professor in the departments of astronomy and physics of Boston University, pointed out via email that the paper raises a fair question about how the ages of supernova progenitors change over cosmic time, adding that it is always important to challenge our way of thinking in order to a better understand of the universe. “However, the way they model that evolution is not supported by observations nor by our understanding of how these systems form. Modern supernova analyses already account for the connection between brightness and the environments where these stars originate, which captures most of the effect they discuss,” he added.\n\n“Extraordinary claims require extraordinary evidence,” Dragan Huterer, a professor of physics at the University of Michigan in Ann Arbor, said in an email, noting that he does not feel the new research “rises to the threshold to overturn the currently favored model.”\n\nLee is aware that the work might be controversial. “We have a long way to go to convince everyone in the supernova cosmology community,” he said. “There are still many people who are strongly against (our results), so a lot of debate and discussions should happen in the near future.”\n\nHowever, he added, more clarity on the issue might be around the corner. The new Vera C. Rubin Observatory, which started operating this year, is set to help settle the debate with the early 2026 launch of the Legacy Survey of Space and Time, an ultrawide and ultra-high-definition time-lapse record of the universe made by scanning the entire sky every few nights over 10 years to capture a compilation of asteroids and comets, exploding stars, and distant galaxies as they change.\n\nThe night sky dazzles above the Vera C. Rubin Observatory in Cerro Pachon, Chile on June 8. Beginning in early 2026, the observatory's decade-long Legacy Survey of Space and Time will generate an ultra-wide, ultra-high-definition time-lapse record of the universe. Vera Rubin Observatory/Handout/Anadolu Agency/Getty Images\n\n“Vera Rubin will discover more than 20,000 new supernova host galaxies with very high-precision age measurement,” Lee said. “It will take three or five years, and it will allow a more direct cosmological test without worrying about this age bias effect.”\n\n“Dark energy is getting weirder and weirder,” Lee concluded. “But there is no good theory that can explain this very weird behavior. So I think we are missing something. Maybe, in five years, an even more surprising result can come up.”\n\nSign up for CNN’s Wonder Theory science newsletter. Explore the universe with news on fascinating discoveries, scientific advancements and more.",
  "authors": [
    "Jacopo Prisco"
  ],
  "url": "https://www.cnn.com/2025/11/20/science/universe-expansion-slow-down-dark-energy"
}