{
  "title": "My Husband Was Gay And In The Closet During Our Marriage",
  "text": "The night before I left my husband, I taught him how to make mashed potatoes. Our friends had offered him a place to stay for the night so I could be alone. I wanted to gather my thoughts and my belongings for a flight back to my hometown the next morning. We both knew he was about to walk out the door, leaving me in our tiny apartment in Chicago, alone for the first time in seven years. He was in love with a man he’d met at work. I was done trying to pretend he wasn’t.\n\nIt was over.\n\nPart of me dreaded our separation viscerally, and I could feel the tendrils of that bit of my heart grasping toward my husband the way I can remember reaching out, panicked, toward my father, when he was teaching me to swim and slowly backing up, just inches beyond the farthest reach of my fingers. Another part of me was relieved that it was all ending — months and months of insomnia and misunderstanding and isolation and wounding on both sides. I was ready for peace, no matter how lonely it might be.\n\nAs my husband was grabbing his jacket and backpack, prepping himself to say goodbye to me, he paused for a moment in our kitchen and asked what I put in my mashed potatoes. It wasn’t that he didn’t know how to cook. He was just never the one who made our mashed potatoes.\n\nAdvertisement\n\nSo, I showed him. Waxy red potatoes, unpeeled. Tony Chachere’s in the water with a few garlic cloves. A stick of butter. A mayonnaise and sour cream slurry, sometimes with horseradish, sometimes not.\n\nWhen he turned up his nose at the thought of all the mayonnaise he’d unknowingly consumed over the years, we both laughed until we cried. The crying persisted for a bit, but nevertheless, the laughter shook something loose in us and helped us both endure those final moments with a bit more resilience.\n\nThe author and her ex-husband in 2001. Courtesy of Vicki Foster\n\nAdvertisement\n\nIn the 22 years that have elapsed from that night, I’ve heard so many similar stories from friends and family who’ve been divorced. How there sometimes comes a moment when you’re done fighting to save or to revenge anything, and all the logistics have been settled. Suddenly, you’re just two people who don’t hate each other because you no longer have to love each other the way you’ve been trying and failing to.\n\nAnd it’s just easy again. Quieter. Sweet.\n\nSeven years before that last night of our marriage, my first husband and I met at a conservative Christian summer camp where we were both counselors. Within a week of meeting one another, we stayed up until 5 a.m. talking. Over the course of that first summer, we’d do that dozens of times, and that constant, easy communication would continue when we returned to our separate college campuses, and we often stayed up until daylight talking for hours and hours on the phone.\n\nWhile my first husband was the one who spent his adolescence in “reparative” therapy for “same-sex attraction” (a fact I didn’t know until well into our marriage), we both began our relationship believing that the depth of our friendship and love could transmogrify us into norms we desperately wanted to embody.\n\nAdvertisement\n\nFor me, that meant starving myself into a kind of symmetrical beauty I thought might make me feel more like a main character in my own life. I’d spent my late childhood and early adolescence as a child actor, being reminded nearly constantly how much I looked like Judy Garland, who was famously made to feel as if her face and body disqualified her from being anyone’s romantic lead.\n\nMy first husband looks uncannily like Montgomery Clift, the square-jawed actor whose queerness the Hollywood studio system did its best to hide. These resemblances are coincidental and always shifting as we age, of course, but the narratives that accompany them — the ways we interpret and value particular symmetries — had shaped our lives dramatically by the time we met.\n\nThe only film Clift and Garland ever appeared in together was “Judgment at Nuremberg,” a film that interrogates collective and individual moral responsibility in the wake of genocide.\n\nAdvertisement\n\nMy absolute favorite picture of the two of them on set was snapped behind the scenes. They are gazing worshipfully at one another. Five-foot-nothing Judy has her big brown eyes raised 10 inches upward toward Monty’s gray eyes. He drapes his arms on both her shoulders, inclining his head toward hers as if they are about to kiss.\n\nLike Monty’s eyes, I am also gray. That is to say, my middle name is actually Gray. It was given to me in honor of my grandmother’s surname, but I’ve always thought of it as being a kind of metaphor because perhaps the primary thing I learned from my first marriage was how to relinquish my own hunger for black-and-white absolutes — to embrace and value my own gray.\n\nWe crave black-and-white patterns and categories, the predictability of them, the ways we think that anticipating the repetition of them might save us from pain.\n\nAdvertisement\n\nThe author and her ex-husband on their wedding day (1999). Courtesy of Vicki Foster\n\nDuring the last 22 years, the number of people who’ve said to me, “But you HAD to know he was gay, right?” exceeds a hundred by a good bit.\n\nAnd yes, there are some stereotypically ironic elements of the depth of my not-knowing, which I usually do my best to lean into when telling this tale, often as a way of inviting people to laugh with rather than at me.\n\nAdvertisement\n\nFor his first birthday after we started dating, my ex requested a pink Oxford shirt and a tube of sun-ripened raspberry hair gel from Bath & Body Works. He went back to school after we split up and became an interior designer. He loved divas (when we were together, it was mostly Faith Hill and Celine Dion). He meticulously ironed ALL his clothes. ALL of them. Even his underwear. He had an alphabetized VHS catalog of “90210” tapes. Just yesterday, he texted me to let me know that the second track on Taylor Swift’s album was titled “Elizabeth Taylor,” which, to be fair, he did more because I’m as obsessed with Elizabeth Taylor as he has ever been with Taylor Swift, but there you have it. To be clear, I’ve known plenty of straight men who are interested in all of these things, and even more gay men who would be interested in none of them, but if you’re looking for signs I missed, they aren’t not present.\n\nThe ironies deepen when you realize that the night before he got outed to me, I was dressed as Liza Minnelli at the annual Halloween on Halsted parade in Chicago’s historically queer Boystown neighborhood, where we lived at the time. We were with five of my closest friends, who were all gay men.\n\nAdvertisement\n\nAfter years of finding more inspiration and depth in literary studies than in most of the churches I’d attended, I had begun the long process of deconstructing from the conservative faith I was raised in. I was getting my Ph.D. in queer theory, which my friends and I jokingly referred to as “getting a Ph.D. in boys.”\n\nIf I’m being honest, there are a hundred different reasons I might have begun that degree, and even after taking 20 years to write about that time, I’m still not sure which one was most true. Was I trying to supercharge my deconstruction? Was I trying to understand my ex-husband? Was I trying to change him through that understanding? All valid guesses, but the fact remains that for all of my supposed expertise in theories of sexual identity, I didn’t realize until several years into our marriage that my first husband was gay and that he’d fallen in love with someone else.\n\nWhat people assume when they assume I knew about my ex-husband’s sexuality varies from person to person, but here’s a short list of just a couple of things I’ve heard:\n\nAdvertisement\n\nYou must have known he was gay when you never had sex (we had sex all the time).\n\nGay men who are otherwise only attracted to men are universally repelled by women’s bodies (see above).\n\nEveryone always knows from childhood on whether they are gay or straight or bi or any of the dozens of other possibilities (no, they don’t).\n\nThe subject of my dissertation in queer theory was 19th century American poet Walt Whitman, whose most famous quote is arguably, “Do I contradict myself? / Very well then I contradict myself / (I am large, I contain multitudes).”\n\nAdvertisement\n\nFor a little Judy Garland-looking kid who grew up in an extremely black-and-white religion devoted to the binary absolutes of right and wrong, heaven and hell, beautiful or plain, saved or damned, it’s impossible to overstate how much I clung to that beautiful gray complexity in Whitman — the shrug of the shoulders it conjured for me, the bird it flipped to the soul-killing need for rigid ideological purity.\n\nAnd it was largely because of Whitman, largely because of Boystown, because of the boys I met in Boystown, because of the beautiful, beloved boy I married first, that I learned I could reject all that black and white I was raised with, and that my ex-husband and I could release each other from the hell our marriage had gradually become for us both. We didn’t walk into any kind of heaven after we got out, but boy, has each day since been better for us both.\n\nThe author and her ex-husband in Chicago in August 2025. Courtesy of Ben Lundquist\n\nAdvertisement\n\nOf course, some black-and-white judgments about right and wrong are unavoidable and necessary, like the one depicted in Judy and Monty’s film about Nuremberg. So are the judgments we must continue to make about ongoing genocides, even the quieter ones occurring domestically. The systems that police the shapes of bodies and desires still threaten to cannibalize. Disordered eating kills. Conversion therapy kills. Full stop.\n\nBut as defense attorney Hans Rolfe (played brilliantly by Maximilian Schell) argues in one of the climactic scenes of “Judgment at Nuremberg,” while the evil done by the Nazis is undeniable, when it comes to navigating complicity for that evil, things get a little murkier. In Rolfe’s case, he reminds the judges that the Russians once signed a pact with Hitler, that Churchill once praised Hitler, that American Industrialists were the ones who helped fund and then profit off the militarization of Germany, and the Jim Crow laws of the South helped inspire Nazi racial laws.\n\nOne of the primary things that drew me to write about my complicated first marriage was teasing out a similar idea of complicity — identifying those moments when, despite my best intentions, I was culpable in the systems that wounded us both. I never sent him to conversion therapy, of course.\n\nAdvertisement\n\nBut I was his conversion therapy.\n\nIt’s a harder love story to tell than the one where only he messed up because he wasn’t always honest. It’s a harder love story to tell than the one where it’s everyone else’s fault that either of us ever got hurt. But that harder love story has been the better one to tell, and I’m thankful daily for all the gray it gave me. The gray has grown me in ways black and white never did.\n\nI am lucky that over the years my ex-husband and I have become friends again. Despite everything, it is as easy to talk now as it once was when we stayed up all night at camp. And he has always graciously supported my writing about our marriage and what came before and after it. My book is dedicated to him for that and so many other reasons. He will be at my book launch, and he’s bringing friends.\n\nThis past weekend, I was back in Chicago, where he still lives. We met up again in Boystown for brunch. We discussed Taylors of all sorts, both Swift and Elizabeth. He met my second husband for the first time. The three of us talked for hours.\n\nAdvertisement\n\nIn a classic comedy (especially of the romantic sort), the story ends with a wedding. Our story began with a wedding that ended in divorce, but the friendship and love we’ve found on the other side of it has been so much more real and meaningful to me than any romantic comedy.\n\nWe’ll see each other again in Chicago in a couple months, and who knows? Maybe we’ll even order mashed potatoes.\n\nThe cover of the author's memoir. Courtesy of Eerdmans\n\nAdvertisement\n\nKelly Foster Lundquist teaches writing at North Hennepin Community College in Brooklyn Park, Minnesota. She is originally from Mississippi. Kelly’s poetry and nonfiction can be seen in many places, including Villain Era Lit, Last Syllable Lit, Whale Road Review, and Image Journal. Her work has been nominated for 2024 and 2025 Best of the Net Awards as well as a Pushcart Prize. She is the recipient of grants from the Minnesota State Arts Board as well as the Central Minnesota Arts Board. Her book, “Beard: A Memoir of a Marriage” (Eerdmans), debuted on Oct. 30, 2025. She lives in a little red house in Minnesota with her spouse and daughter.\n\nDo you have a compelling personal story you’d like to see published on HuffPost? Find out what we’re looking for here and send us a pitch at pitch@huffpost.com.",
  "authors": [
    "Guest Writer"
  ],
  "url": "https://www.huffpost.com/entry/husband-gay-conversion-therapy-marriage-divorce_n_68f91b42e4b01e35ba16e92d"
}