{
  "title": "American Hindus Call Out JD Vance For Wanting Wife To Convert",
  "text": "LOADING ERROR LOADING\n\nDuring a Turning Point USA-sponsored event at the University of Mississippi, the vice president admitted that he hopes his wife will one day be “moved by the same thing that I was moved in by church.”\n\nAdvertisement\n\nThe comment drew backlash online, so much that Vance felt obliged to post a response on social media.\n\nVance said that his wife “is the most amazing blessing I have in my life,” and noted that “she herself encouraged me to reengage with my faith many years ago.”\n\nAlthough Vance noted that his wife “is not a Christian and has no plans to convert,” he said that “like many people in an interfaith marriage ― or any interfaith relationship ― I hope she may one day see things as I do.”\n\nAdvertisement\n\nWhat a disgusting comment, and it's hardly been the only one along these lines.\n\n\n\nFirst off, the question was from a person seemingly to my left, about my interfaith marriage. I'm a public figure, and people are curious, and I wasn't going to avoid the question.\n\n\n\nSecond, my… https://t.co/JOzN7WAg3A — JD Vance (@JDVance) October 31, 2025\n\nThe Hindu American Foundation felt obliged to respond to Vance’s post with a lengthy post suggesting that the fair thing for Vance to do would be to reciprocate his wife’s support “and engage with Hinduism too?”\n\nThe post said if Vance did study the religion more, “you may well learn that Hinduism doesn’t share the need to wish your spouse comes around to see things as you do in terms of religion.”\n\nAdvertisement\n\nThe post also noted the history of Christians denigrating Hindus, and “attempting to convert Hindus through sometimes unethical means,” before pointing out that “in recent months we’ve seen an outpouring of anti-Hindu sentiment online, often coming from explicitly Christian sources.”\n\nThe note also suggested that Vance could do more in supporting his wife’s faith to members of his base.\n\n“Some of the most vocal voices in your base seem to not actually believe religious freedom — one of the core concepts this nation was founded upon, as you well know — should extend to Hindus,” the note said. ”You are the VP. It’s more than reasonable (and well within precedent) for a Christian public figure such as yourself to acknowledge the positive impact of Hinduism on Hindus and the rights of Hindus to practice.”\n\nAdvertisement\n\nWith respect @JDVance, if your wife encouraged you to re-engage with your faith, why not reciprocate that and engage with Hinduism too?\n\n\n\nIf you did you may well learn that Hinduism doesn’t share the need to wish your spouse comes around to see things as you do in terms of… https://t.co/fkQQgclNDl — Hindu American Foundation (@HinduAmerican) October 31, 2025\n\nWill Vance have a come-to-Jesus moment regarding defending the faith his wife was raised in?\n\nProbably not, if his past actions are any clue.\n\nBack in February, Vance was mocked online for defending an employee of Elon Musk’s cost-cutting Department of Government Efficiency who made racist posts on social media attacking Indians.\n\nIn January, he came under fire when he defended his wife against white supremacist attacks in the weirdest way possible.\n\nAdvertisement\n\n“Obviously, she’s not a white person, and we’ve been accused — attacked — by some white supremacists over that,” he told Megyn Kelly. “But I just — I love Usha. She’s such a good mom, she’s such a brilliant lawyer, and I’m so proud of her.”\n\nOn Friday, after Vance’s Turning Point comments went viral, a clip from March where Vance “joked” about how public life is affecting Usha resurfaced.\n\n“Here’s the thing,” he said. “The cameras are all on; anything I say, no matter how crazy, Usha has to smile and laugh, and celebrate it.”\n\nAdvertisement",
  "authors": [
    "Senior Reporter"
  ],
  "url": "https://www.huffpost.com/entry/american-hindus-call-out-jd-vance-for-wanting-wife-to-convertamerican-hindus-call-out-jd-vance-for-wanting-wife-to-convert_n_69051ccde4b00c26f07189ed"
}