{
  "title": "Charlie Hunnam Answers The Web's Most Searched Questions",
  "text": "Transcript\n\nHi, I am Charlie Hunnam.\n\nand this is the Wired Autocomplete Interview.\n\n[upbeat music]\n\nLet's see what Google wants to know.\n\n[upbeat music]\n\nDoes Charlie Hunnam actually ride motorcycles?\n\nI did ride motorcycles because like you know,\n\nI'm an actor and we just like try to do the stuff\n\nthat the characters that we play do.\n\nSo I was riding a motorcycle thinking\n\nI was like a little biker for many years\n\nwhile I was doing Sons of Anarchy.\n\nI put, I don't know, maybe like 65,000 miles on my bike.\n\nI rode it a lot for 10 years\n\nand then I kind of got the fear.\n\nAnd I live in LA,\n\nand for those of you don't live in LA,\n\neveryone who lives in LA kind of sucks at driving.\n\nAnd so I kind of got in my head about it\n\nand felt as though it was just like a little whisper\n\nin the back of my head that said\n\nmaybe I should chill a little bit on the motorcycle riding.\n\nSo, I chilled a little bit.\n\nBut I have been riding a little bit recently.\n\nBut you know, there's like a lot of Teslas\n\nand Priuses on the road that will definitely kill you.\n\nStone dead if you're not careful, so.\n\nDoes Charlie Hunnam have tattoos?\n\nI have one tattoo that I got when I was 18,\n\nwhich was like a mistake. [laughs]\n\nSo yeah, it's like some tribal thing that I dreamt\n\nand I thought it was like profound\n\nso that I should get it tattooed.\n\nAnd then you realize like not all dreams are profound.\n\nSome of them are just like shit tattoos.\n\nDoes Charlie Hunnam know martial arts?\n\nYeah, I studied Brazilian jiu-jitsu,\n\nso yes, I know a little bit of jiu-jitsu.\n\nI messed my back up\n\nso I've not been training, practicing\n\njiu-jitsu as much as I'd like,\n\nbut I got pretty ninja there for a minute or two,\n\nso don't try me out.\n\nDoes Charlie Hunnam live on a ranch?\n\nI do not live on a ranch,\n\nbut I do have a ranch\n\nthat is undeveloped land without a house or anything on it.\n\nSo I got a caravan but I don't sleep in the caravan.\n\nI got a pickup truck and just sleep\n\nin the back of my pickup truck.\n\nIt's cool, if I ever go missing,\n\ncome look for me on the ranch\n\n'cause there is a mountain lion\n\nthat lives on the ranch that I've seen twice\n\nand seen its paw prints a lot.\n\nHopefully, it's well fed and not interested in me,\n\nbut I am delicious so you never know.\n\nAlright, here we go.\n\nWhen did Charlie Hunnam move to America?\n\nI moved to America I think in 1998.\n\nI'd just done a TV show called Queer as Folk\n\nthat got a lot of attention in the UK\n\nand I managed to get an agent\n\nand didn't really like living in England\n\nand always wanted to live in America.\n\nSo got invited to come out here.\n\nThis agent said, Would you like to come out for a trip\n\nand you know, do some auditions, I'll represent you.\n\nAnd I said, Yeah, I'll be there next week.\n\nIt was either that or go back to college.\n\nI was at college and I left to do this TV show\n\nand I was supposed to go back to college\n\nbut I came to America instead, so.\n\nWhat has Charlie Hunnam written?\n\nI would say I'm the most-\n\nOne of the most successful writers\n\nwho's never made anything.\n\nI've written several films\n\nand a couple of TV shows,\n\nnone of which has been produced yet,\n\nwhich I'm trying not to get disheartened\n\nand believe that means that I suck as a writer.\n\nBut first film I wrote was\n\nabout Vlad the Impaler, Vlad Tepes,\n\nwho is the inspiration for Bram Stoker's Dracula.\n\nSo we'll see if some point we can get that made.\n\nWhy is Charlie playing Ed Gein?`\n\nWell that's a good question.\n\nI'm not quite sure myself, or at least I wasn't.\n\nI thought I'd made a horrible mistake initially,\n\nbut Ed Gein's a really interesting character\n\nin that he's somebody that I didn't know anything about.\n\nIt seems a lot of people don't really know\n\nwho he is directly,\n\nbut had this enormous cultural impact,\n\nin that he was the inspiration\n\nfor Alfred Hitchcock's Psycho\n\nand Toby Hooper's Texas Chainsaw Massacre\n\nand Silence of the Lambs\n\nand all of these films,\n\nwhich really transformed the way we\n\ntold stories about monsters.\n\nYou know, prior to Psycho, Hitchcock's Psycho,\n\nmonsters were werewolves and Dracula\n\nand vampires and stuff like that.\n\nAnd after Psycho we became the monsters.\n\nAnd so he had this huge cultural impact.\n\nIt wasn't even as much the Ed Gein of it\n\nthat I was interested in.\n\nIt was working with Ryan Murphy who was wanting\n\nto ask the question like What makes a monster?\n\nWe were interested in why Ed did what he did,\n\nand he did some pretty wild, despicable things,\n\nrather than what he did.\n\n'Cause what he did was-\n\nAlthough like pretty out there\n\nand extreme and some people might be interested in that,\n\nit's you know, pretty gross and despicable.\n\nBut thankfully we spend most of our time trying\n\nto understand the man behind the monster.\n\nWhat does Charlie Hunnam like doing?\n\nNot Googling myself, I'll tell you that much.\n\nI like working a lot. I think I'm a workaholic.\n\nI like cooking, I like hiking, I like, I dunno.\n\nAlright, we're cooking.\n\nDo these get progressively weirder and more upsetting?\n\nLet's see.\n\nHow does Charlie Hunnam change his accent?\n\nI guess, you know, I just-\n\nWell I mean I do it for work consciously.\n\nI think I'd probably do it when I travel\n\naround the world subconsciously.\n\nI get a lot of flack\n\nfor having a half English, half American accent, which,\n\nyou know, I'm half English and half American.\n\nI lived in England for 18 years\n\nand I lived in America for 27 years.\n\nSo what are you gonna do?\n\nI'm half English, half American,\n\nbut in terms of how I changed my accent for work,\n\nI work with a dialect coach\n\nand I run the lines lots and lots of times\n\nand try to figure out how to do it.\n\nHow did Charlie Hunnam get the role of Jax?\n\nI- going back to my earlier question,\n\nhad just finished writing a screenplay\n\nfor the first time about Vlad the Impaler,\n\nwhich took longer than I thought it was gonna do.\n\nI was broke and so I had to go back to work as an actor\n\nand it was the time before you got emailed scripts\n\nwhere you get printed, hard copy like of scripts\n\nand like 120 pages long.\n\nAnd I had this big pile of scripts to read\n\nand the the thinnest one was Sons of Anarchy\n\n'cause it was only about 50 some pages long.\n\nAnd so I said, All right, I'll read that one first.\n\nAnd just thought it was amazing.\n\nI loved the script\n\nand thought the character was like super cool\n\nand the world just felt like fresh and original\n\nand like nothing I'd really seen before.\n\nAnd so I called my agent and I said,\n\nI really like the script.\n\nAnd he is like, Yeah, well we sent that\n\nto you like three months ago, so you know,\n\nit's probably too late.\n\nBut the writer, Kurt Sutter,\n\nhad really wanted you to read it,\n\nlike he'd sent it to you specifically.\n\nAnd I said, Well yeah, but it'd be nice\n\nif you told me that.\n\nAnd he said, Yeah, well you weren't\n\nanswering your phone, dickhead.\n\nSo I went, Okay.\n\nAnd so I said, Well just call him\n\nand find out if the role's still available.\n\nSo he called him and they hadn't cast yet\n\nand so I went and auditioned.\n\nIt was interesting as he'd see me in a film\n\nwhile he was writing this about hooligans,\n\nabout British football hooligans called\n\nGreen Street hooligans.\n\nAnd he thought if that guy can do an American accent,\n\nthen he's maybe my guy.\n\nWhat does Charlie Hunnam use in his hair?\n\nI add a little bit of Tancho,\n\nwhich I guess is maybe Japanese.\n\nIt's like a lavender wax. Check it out, you can Google it.\n\nCan Charlie Hunnam dance?\n\nThe answer is no.\n\nOkay, I'm not sweating yet, so this is good. Right.\n\nWhat is Charlie Hunnam's best movie?\n\n[laughs] I don't know, I guess that's subjective.\n\nI would say my best movie is The Lost City of Z,\n\nfollowed by maybe The Gentleman.\n\nI don't know, but I'll let you decide for that yourself.\n\nWhat are Charlie Hunnam's hobbies?\n\nWorking, mainly.\n\nWhat did Charlie Hunnam keep from SOA?\n\nEverything that I could steal, I kept the bike,\n\nI kept the cut, I kept the knife, I kept the rings,\n\nI kept weird shit that made no sense.\n\nLike a red plastic dragon that I didn't even like\n\nand didn't even really know was in the set till the last day\n\nand it wasn't nailed down, so I stole that too.\n\nWhat music does Charlie Hunnam listen to?\n\nI listen to everything.\n\nSo the fundamentals, the like cornerstone\n\nof my musical journey would be Bob Dylan, Tom Waits,\n\nLeonard Cohen, [babbling] Van Morrison.\n\nVan Morrison was huge. That's when I was young.\n\nAnd learning to smoke pot and learning the meaning of life\n\nand all of those artists helped me a lot in, I don't know,\n\nfiguring out life.\n\nThat's all the boards. That's all my bullshit.\n\nThanks for having me. See you next time. [kisses]\n\n[upbeat music]",
  "authors": [
    "Condé Nast"
  ],
  "url": "https://www.wired.com/video/watch/google-autocomplete-inverviews-charlie-hunnam-answers-the-webs-most-searched-questions"
}