{
  "title": "Opinion | It’s Deeper Than Nick Fuentes",
  "text": "I’m pretty sure that after the Biden administration, most Israelis have figured out that the aid is a two-edged sword, and I don’t think Israelis want to be told what to do forever, down to the level of which street in Gaza should you send troops to from across the Atlantic. I think it’s a disaster for America to be involved in other people’s wars at that level.\n\nDouthat: So, I’m not going to say how much of what we’re seeing on the American right, right now, is driven by the Gaza War, but clearly it’s not irrelevant to the story. And you have a number of American conservatives, nationalist politicians like Marjorie Taylor Greene, standing up and saying: I think that the war in Gaza is unjust, or: I think Israel is committing war crimes — and things like that.\n\nHow do you navigate that kind of tension, I guess, from the point of view of America or Israel?\n\nHazony: Well, if the United States feels that war crimes are being committed, I think it’s pretty normal for ambassadors to protest and, if things are bad enough, to take steps to try to change things. But I don’t think that’s the right way to look at the antisemitic right.\n\nLet me just give it a label, because antisemitism certainly doesn’t cover the entire entirety of what’s going on. There’s always been an alt-right. I don’t know always, but ever since there was an internet, there was an alt-right. Everybody knew what it was. It’s not a coherent ideology — it’s a bunch of different ideas and different movements. In general, some of them are sick of the American Constitution. They want us to overthrow it. Some of them are sick of God and Scripture. They want to overthrow that. And some of them are sick of having Jews involved in coalition politics in the United States, and they’d like to end that. But that alt-right was always pretty peripheral for all the years that I’ve been involved in this, up until 2023.\n\nOK. Now, 2023, as you say, it’s overdetermined. Obviously that’s when Oct. 7 happened, and that was the beginning of Israel’s war and it affects everything. But other things were going on. Tucker Carlson didn’t leave Fox News in early 2023 because of the war, which started in October. Tucker’s move into sort of the alt-right space preceded this war. So there are other things going on.",
  "authors": [
    "Ross Douthat",
    "Sophia Alvarez Boyd"
  ],
  "url": "https://www.nytimes.com/2025/11/20/opinion/right-antisemitism-yoram-hazony.html"
}