{
  "title": "'There was no holding on': The trail-blazing aerial photos of a daredevil WW1 pilot",
  "text": "Having survived nine crash landings, aviator Alfred Buckham created some of the earliest and most awe-inspiring bird's-eye images. To achieve them, he risked his life, employing perilous, death-defying acts of ingenuity.\n\n\"What scenes of Grandeur and Beauty!\" exclaimed Thomas Baldwin in his 1786 account, Airopaidia, of a balloon journey over Chester during which he created one of the earliest aerial drawings. Everything was \"brought up in a new manner to the eye… The imagination… was overwhelmed\". Today, we take aerial views for granted. The advent of drones has popularised amateur aerial photography, while tools such as Google Earth supply bird's-eye views in seconds. However, in the Victorian era, aerial images were the result of extraordinary acts of ingenuity involving hot air balloons, pigeons, and even rockets.\n\nCollection of Richard and John Buckham Alfred Buckham pictured in 1918 – he was a serving pilot during World War One (Credit: Collection of Richard and John Buckham)\n\nBut a new and exciting way of taking to the skies was just around the corner, as goggles were donned for the first forays into aviation. This emergent industry, coupled with the outbreak of World War One – where mapping and intelligence gathering became mission-critical – offered radical new possibilities for aerial photography. One remarkable pioneer was fearless World War One aviator Alfred Buckham (1879-1956), an irrepressible risk-taker who survived nine crash landings. Though the last of these resulted in a serious throat injury that required a laryngectomy and reduced his voice to a whisper, he continued to take to the air, combining his love of flying with his passion for photography, leaning perilously out of aeroplanes to capture some of history's earliest and most awe-inspiring aerial photographs.\n\nHis death-defying images are the subject of a major new exhibition, Alfred Buckham: Daredevil Photographer, at the Scottish National Portrait Gallery in Edinburgh. The exhibition shares Buckham's dramatic perspective on landmarks in Britain and the Americas, from the snaking, sun-streaked path of the Thames in The Heart of the Empire (1923), loaned from the V&A, to newly completed monuments such as the Empire State Building in New York and the Christ the Redeemer statue in Rio de Janeiro, both photographed for Fortune magazine during a series of flights in 1931 of record-breaking length. More than 100 photographs and objects are on display, including Buckham's letters, passport and camera – all telling the story, voiced by his grandson Richard, of his madcap aerial adventures and innovative post-production.",
  "authors": [],
  "url": "https://www.bbc.com/culture/article/20251030-the-trail-blazing-photos-of-a-daredevil-wwi-pilot"
}