{
  "title": "Credit risk automation platform Kaaj raises $3.8M seed from Kindred Ventures",
  "text": "Shivi Sharma spent a decade working in credit risk at places like American Express and Varo Bank.\n\nAt some point, she realized teams were spending equal amounts of time analyzing all types of loans — regardless of whether it was worth $100,000 or $5 million — meaning assessing smaller loans was ultimately an unprofitable and time-consuming process for lenders.\n\nShe and her husband, Utsav Shah, realized there was an opportunity here.\n\n“She watched as the vast majority of small business owners couldn’t access the capital they needed to grow, simply because the economics didn’t work for banks,” Shah told TechCrunch.\n\n“Between our skills in building AI-powered decision-making systems at scale and our expertise in credit risk and fraud risk assessments in banking in financial services, we realized we could apply next-gen AI agent workflows to solve this decades-old problem,” he continued.\n\nThe married couple decided to launch Kaaj in 2024, a company that helps automate credit risk analysis so that underwriting no longer takes days, but minutes. Kaaj said it’s processed more than $5 billion worth of loan applications, with clients including Amur Equipment Finance and Fundr. The company announced on Wednesday a $3.8 million seed round from Kindred Ventures and Better Tomorrow Ventures.\n\nThe product works like this: A small business applies for a loan, submitting all the needed documents (like financial statements, bank statements, and tax returns) — typically, when this happens, underwriters spend days manually verifying all this information and logging it into their loan origination system (LOS).\n\nTechcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | WAITLIST NOW\n\nKaaj uses AI to identify, classify, verify, and organize information into LOS. It also runs assessments to check for document tampering for the underwriter fraud team. It integrates into existing customer relationship management (CRM) systems like Salesforce, HubSpot, or Microsoft and even shows a lender if a business is meeting the criteria of a lender’s policy.\n\n“This allows a team processing 500 applications monthly to handle 20,000 applications with the same staff, making smaller loans economically viable,” Shah, the company’s CEO, said.\n\nThe hope is that more small businesses will be able to access loans from banks because it becomes more cost-efficient for a bank to investigate them.\n\nOthers in the market include Middesk, Ocrolus, and MoneyThumb. Sharma hopes that Kaaj will stand out from the competition by automating the entire credit analysis process rather than parts of it.\n\n“We do this by deploying agentic AI workflows that mimic their teams, to help lenders analyze end-to-end loan packages,” she said.\n\nThe fresh capital will be used to help accelerate product development and expand across independent and small business lenders. “We’re focused on enhancing our AI agent capabilities, expanding our module offerings, and scaling our customer base of lenders and brokers beyond our current footprint.”\n\nOverall, Shah and Sharma hope Kaaj can in some ways “revolutionize” small business lending, bringing automation to what is still a very paper-heavy process.\n\n“By automating the science of credit analysis, we free up human underwriters to focus on the art of deal-making and subjective assessment, which is their true competitive advantage,” he said.",
  "authors": [
    "Dominic-Madori Davis",
    "Senior Reporter",
    "Sarah Perez",
    "Julie Bort",
    "Lorenzo Franceschi-Bicchierai",
    "Ram Iyer",
    "Connie Loizos",
    "Anthony Ha",
    "Rebecca Bellan",
    "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var"
  ],
  "url": "https://techcrunch.com/2025/11/19/credit-risk-automation-platform-kaaj-raises-3-8m-seed-from-kindred-ventures/"
}