{
  "title": "Colombia recovers first treasures from 300-year-old ‘holy grail of shipwrecks’",
  "text": "Colombia has recovered gold and bronze coins, a porcelain cup and a cannon from a sunken Spanish warship dubbed the “holy grail of shipwrecks.”\n\nThe artifacts are the first treasures to be recovered from the wreckage of the San José, a Spanish galleon that was sunk by the British Royal Navy in the Caribbean more than 300 years ago.\n\nAt the time of its sinking, during the War of the Spanish Succession, the San José had been carrying large amounts of gold, silver and emeralds from Spanish colonies in Latin American back to the Spanish king.\n\nCollectively, those treasures are believed to be worth billions of dollars in today’s money and they are at the center of a heated legal dispute between the Colombian government and a US-based marine salvaging company named Sea Search-Armada (SSA).\n\nColombia maintains that it discovered the San José in 2015 with help from international scientists, but SSA, formerly known as Glocca Morra, claims to have found the shipwreck in the early 1980s and has launched a legal battle in the Permanent Court of Arbitration, claiming it is entitled to approximately $10 billion – roughly half the estimated value of the shipwreck’s treasure.\n\nArtifacts found in the wreckage of Spanish galleon San Jose are seen in this undated handout photo provided by the Colombian Ministry of Culture on December 5, 2015. Colombian Ministry of Culture/Reuters\n\nThe Colombian government says its recovery of the treasures is part of a research project that could provide clues about Europe’s economic, social and political climate during the early 18th century. It also says the galleon is significant to Colombia’s culture and identity.\n\nIn a statement Thursday, Colombian Culture Minister Yannai Kadamani Fonrodona described the recovery as a “historic event” that demonstrated the country’s capacity to protect its underwater cultural heritage.\n\nAlhena Caicedo Fernández, director of Colombia’s Institute of Anthropology and History, said it “opens the possibility for citizens to approach, through material evidence, the history of the San José galleon.”\n\nThe government says the items, which were recovered using underwater robots, will now undergo a lengthy conservation process at a lab and will be used for archeological research.\n\nHistorical records show that the San José was part of a shipping fleet known as the Flota de Tierra Firme.\n\nIt was one of several ships in the fleet that left Peru in 1707 carrying a large amount of royal cargo, but records show that it never reached Spain, instead sinking off Colombia following a battle with British forces the following year.",
  "authors": [
    "Michael Rios"
  ],
  "url": "https://www.cnn.com/2025/11/20/americas/colombia-holy-grail-shipwreck-san-jose-treasures-latam-intl"
}