{
  "title": "Why 'Love Is Blind' Season 9 Was So Hard To Watch",
  "text": "By many accounts, the latest season of Netflix’s “Love is Blind” has been one of the messiest yet. And as unserious as every couple has been, there’s one whose dynamic was particularly difficult to watch.\n\nYes, I’m talking about the super-uncomfortable storyline involving an Asian male contestant, Patrick Suzuki, and a white female contestant, Kacie McIntosh.\n\nIf you’re not up to speed, here’s a quick summary: Suzuki and McIntosh formed an emotional bond in the show’s “pods,” where contestants can talk to each other and form a connection but can’t see each other.\n\nAdvertisement\n\nIn Episode 5, Suzuki hesitantly reveals that he’s Asian, and McIntosh seems shaken but willing to continue the experience. When the two meet face-to-face for the first time, Kelcie calls off the engagement almost immediately, telling the show’s crew that she doesn’t believe her attraction toward Suzuki can grow. It’s painfully obvious that this is largely because of his race.\n\nPart of the pain of witnessing this trainwreck is that I sympathize with Suzuki: When I was younger and dating, I treated my Asian identity as a handicap. I didn’t grow up around other people of Asian descent, and in high school, the only girls who liked me tended to be obsessed with anime. Besides that clear fetishizing, I wasn’t getting much action. When I came out as queer at 19, I found similar attitudes prevalent in the gay community and on apps, where it was normal for people to write “no Asians” on their Grindr profiles.\n\nIn college, I found empirical evidence that validated my experience. One 2014 OKCupid study revealed how Asian men and Black women were the two groups least likely to get responses on dating apps. Although it might be tempting to dismiss this trend as “personal preference,” sociology says otherwise.\n\nAdvertisement\n\n“Individuals have a right to their preferences, but preferences are shaped by what we see in society, and if all members of a particular group are having a similar experience, it’s something bigger,” says Grace Kao, a professor of sociology at Yale University. In other words, if a majority of Asian men experience similar obstacles when dating, no matter how different we might look and be from each other, then there’s clearly an overarching narrative about us coming from outside the house.\n\nWhile Asian men are victims of a long American tradition of dehumanization — and while I sympathize and deeply understand Suzuki’s predicament — I also refuse to believe that we’re completely powerless in this situation. To me, taking our power back begins with how we genuinely perceive ourselves.\n\nTwo things can be true at once. The treatment Asian men face in the dating scene can be unfair, and we as Asian men are sometimes complicit in perpetuating that unfairness by preemptively rejecting our own Asianness.\n\nAdvertisement\n\nEven more jarring than McIntosh rejecting Suzuki was how Suzuki talked about himself and other Asians, using the self-deprecating language I’ve heard other Asians use growing up. One of the first jokes Suzuki made after revealing his race to McIntosh was that he had no body hair and was smooth like “a baby seal” — marine mammals that are decidedly not sexy.\n\n“In the process of revealing his race and ethnicity, he telegraphed an enormous amount of insecurity and lack of self-respect,” Kelly H. Chong, professor and chair of sociology at the University of Kansas, says of Suzuki. “That is not a good look for any person, whatever race, ethnicity, or gender, because as we know, people are attracted to people who are confident and comfortable in their own skin.”\n\nWhile I think it’s totally fine to poke fun at yourself with members of your own community, making these types of jokes for the white gaze (or on TV, for everyone to witness) only serves to degrade us. Suzuki also flexed that he had been called “hot for an Asian guy” and mentioned how, despite his race, he was just a “normal” Colorado guy and was “mixed,” minimizing his Asianness at every turn.\n\nAdvertisement\n\nWhile this bothered me, Chong says that we have to be careful not to simply place individual blame on Suzuki. “He is a product of his environment and the history of psychological colonization of Asian people,” she says. This resonates. Two things can be true at once. The treatment Asian men face in the dating scene can be unfair, and we as Asian men are sometimes complicit in perpetuating that unfairness by preemptively rejecting our own Asianness.\n\nCase in point: Suzuki and Anna Yuan, the other Asian contestant on the show, both admitted that they had only pursued white partners in the past. When we are actively rejecting each other, why would we expect the dominant culture to find our value for us?\n\nInstead of continuing to perpetuate this idea that proximity to whiteness validates both our attractiveness and our relationship value, we have the option of studying how other racial minorities have turned the tide.\n\nAdvertisement\n\nIn the ’60s and ’70s, for example, some Black Americans chose to de-center white aesthetics and beauty standards through a global “Black is beautiful” movement. Among their core tenets was a desire to embrace Black identity and art, focus on self-love and push for representation. By changing how they spoke about themselves and their community, they started to change how they and the world perceived them — and influenced other groups, including Asian Americans, to start celebrating their own histories and identities as well.\n\nThe branches of this movement have manifested in abundant ways, and we all get to witness how Black culture and pride influences every single aspect of American art and lifestyle — and is co-opted by other races.\n\nI don’t mean to say the experiences of Asian immigrants are equivalent to those of Black Americans, many of whom descended from enslaved people robbed of their identities and bodily autonomy. Our fraught histories in this country differ vastly in levels of disenfranchisement and privilege. Still, it would be enlightening — as Asian Americans continue to struggle with self-acceptance outside of the white gaze — to examine the power of reclaiming and redefining our physical existences and expressions.\n\nAdvertisement\n\nAnd so, it’s my generation’s task to keep shifting our narrative. That involves learning about our history and changing the language we use to talk about ourselves. Someone else created a perception about us — we don’t have to perpetuate it.\n\nTo Suzuki’s credit, there was one moment in the season that offered a glimpse into a potential breakthrough. He did form a connection with Yuan, the other Asian contestant. The two seemed excited about each other’s heritages, and seemed open to changing their usual “preferences,” which, for Suzuki, may have largely been about who he saw as “the standard” growing up in a predominantly white Colorado town.\n\n“The biggest predictor for who you date is your environment,” Kao says. “Let’s say you’re Asian and you live in a town that’s 90% Asian. The [chance] of finding an Asian partner is very likely.”\n\nAdvertisement\n\nIn other words, the more we expose ourselves to positive images of a group of people, the more likely we are to be attracted to them. This made me realize that, in order to find pride in who we are, we have to start by finding each other.\n\nIdeally, we’d have the option to be around people who look like us but also to forge an identity we can be proud of when we’re not around the people who look like us. When we create our own stratosphere of sexiness, so to speak, I’m certain that confidence will lead to plenty more wins for our community far beyond dating. It’s time we take control of how we talk about ourselves, tap into our collective power, and decenter the white gaze once and for all.\n\nUltimately, on TV and in the world, I want to see a version of ourselves that we can be proud of — one that revels in our own hotness, regardless of what anyone else thinks.",
  "authors": [
    "Contributing Writer"
  ],
  "url": "https://www.huffpost.com/entry/love-is-blind-asian-internalized-racism_n_68f7af79e4b0dbac459119c0"
}