{
  "title": "Halo: Campaign Evolved is a gorgeous remake that debuts on PS5 and Xbox in 2026",
  "text": "is a senior editor and author of Notepad , who has been covering all things Microsoft, PC, and tech for over 20 years.\n\nHalo Studios has created something special for the 25th anniversary of Halo next year. Halo: Campaign Evolved is a full remake of the original Combat Evolved that launched alongside Microsoft’s first Xbox console in 2001. It has a fully rebuilt campaign with 4K visuals, new weapons and vehicles, a four-player online co-op mode, and brand-new story content.\n\nAnd it’s all coming to the Xbox Series X / S, PC, and — for the first time — PlayStation 5 in 2026.\n\nI’ve been playing a prerelease demo section of The Silent Cartographer mission this week to get a feel for all the changes. It’s the same level that was used as the demo version of Halo: Combat Evolved for both Mac and PC, but this remade version opens immediately with updated cinematics, improved voice lines, and greatly overhauled visuals and animations.\n\nIt looks and feels distinctively Halo, but then I started sprinting toward a rebuilt Warthog that has an extra seat at the rear and I realized there’s a lot going on in Campaign Evolved beyond its Unreal Engine 5-powered visuals.\n\n“We did this work on Halo Anniversary. There were certain things that we weren’t able to achieve at that time, there were certain things we weren’t able to do,” says Greg Hermann, technical director at Halo Studios. “As we were building this out, we didn’t just put a coat of paint over the original cinematics. We ended up revisiting exactly how they were blocked out, how they were sequenced, and how they were put together. We’ve done that across the board.”\n\nHalo Studios even brought in the core voice actors of Combat Evolved to re-record their lines. It was something I noticed immediately as The Silent Cartographer mission loaded in. “This really provides a degree of fidelity that we weren’t able to do for Halo Anniversary,” says Hermann.\n\nUnreal Engine 5 powers the visual overhaul of Combat Evolved. Image: Halo Studios\n\nThe iconic vistas in Halo have also been rebuilt, as well as the alien architecture and environments. It’s really designed to be the ultimate remake of the original campaign that’s both welcoming to new players and also built in a way that respects Bungie’s original creation and story.\n\n“Whenever we make a change, the number one thing is to be true to the original game,” says Dan Gniady, lead game designer at Halo Studios. Gniady joined Halo Studios last year and previously worked on the original releases of Bungie’s Destiny and Destiny 2 titles.\n\nHalo Studios has access to the original source assets and code for Halo, as well as the original storyboards. That’s allowed the team to remaster and remix the music alongside the cinematic change and huge visual upgrades. All of the new content in the game is created in UE5, and it’s layered on top of the systems and code used for the original game to maintain that unique Halo feel.\n\nCampaign Evolved includes three new bonus missions. “It was really important that we preserved the original story as it is, so these missions are meant to be a prequel setup for the main chorus,” says Max Szlagor, studio design director at Halo Studios. “These new missions are going to offer some new opportunities for character interactions between Chief and Johnson.” The missions will include new environments, gameplay, characters, and enemies.\n\nThere are also new mechanics and AI behaviors. Perhaps the most obvious is the ability to sprint in the game, which makes everything from combat to moving around missions feel a lot faster. There’s even a new seat in the Warthog, affectionately referred to as the golf cart seat or bumper seat by Halo Studios’ developers. It will be ideal for co-op missions, as someone can now hang off the rear of the Warthog.\n\nUp to four people can play this campaign together online, regardless of what platform they’re on, thanks to crossplay and shared progression across console and PC. There’s also two-player split-screen co-op local play on consoles, just like the original game. “We will make some of the spaces larger, and we also want to make sure we’re authentic to the encounters themselves,” says Szlagor. “So it’s a balancing act between that difficulty tuning and making those encounters the right size for the right space.”\n\nHalo Studios has rebuilt every part of the original game so movement, aiming, and weapons and look and feel like a modern Halo game.\n\nAll of the weapons have been remodeled and rebuilt with higher fidelity, so the look, feel, and sound of weapons is far better than what Halo Studios achieved with the remastered versions; the plasma effects from guns will even fully light up the indoor environments. You can also aim down sights with all guns now, and there are nine additional weapons from across the Halo series available in Campaign Evolved — including the ability to pick up an Energy Sword after you’ve killed an Elite. If you’re a fan of the vehicles in Halo, you’ll even be able to hijack enemy ones, so you can pilot a fully drivable Wraith in this campaign.\n\nIf you want to amp up the difficultly, Halo Studios is leaning even more on skulls in this remake, the gameplay modifiers from Halo: The Master Chief Collection. There are dozens of skull options in Campaign Evolved, “the most we’ve ever had in a Halo game,” says Szlagor. There are so many that the developers don’t think it will even be possible to complete the game on legendary mode with all skulls turned on. “There’s a lot, so if you can do a true legendary all-skulls-on run, let us know because I’d love to see it,” says Gniady. I’m sure a hardcore Halo fan will find a way next year, though.\n\nHalo Studios has remade entire environments in Campaign Evolved.\n\nThe one thing that’s missing from Campaign Evolved is multiplayer. The original game had local multiplayer and maps, but it launched before Xbox Live, so there was never any official online multiplayer. While the PC version added online play, Halo Studios is sticking purely to the campaign element of the original Halo game. The Halo franchise is known for its multiplayer, but this really started with Halo 2. I did ask Microsoft to comment about the lack of multiplayer, but the company refused to discuss it.\n\nEven without multiplayer, Campaign Evolved is a blueprint for future Halo games. “For future titles, we will continue to push the boundaries of technology while ensuring the core Halo gameplay for that game can be seen, felt, heard, and evolved where needed,” says Hermann.\n\nHalo: Campaign Evolved is coming in 2026 to the Xbox Series X / S, PC, and PS5. It’ll be a day one game with Game Pass Ultimate / PC Game Pass, and will also support Xbox Cloud Gaming and Xbox Play Anywhere.",
  "authors": [
    "Tom Warren"
  ],
  "url": "https://www.theverge.com/news/805174/halo-campaign-evolved-remake-xbox-ps5-release-date"
}