{
  "title": "Serious Fraud Office decided not to look into diamond scam",
  "text": "Serious Fraud Office decided not to look into diamond scam\n\n31 minutes ago Share Save Rory Tinman BBC Panorama Share Save\n\nBBC\n\nThe Serious Fraud Office (SFO) failed to investigate a £170m diamond scam despite receiving a report from a whistleblower almost a year before the scheme collapsed, BBC Panorama has learned. Investors' cash was used to prop up Vashi Dominguez's diamond retail business, known as \"Vashi\". After the firm went bust, a stock of diamonds supposed to be worth £157m - which investors had been told would act as security for their investments - was sold for £158,000. The company's former chief technology officer contacted Panorama after we reported on the story in September. He shared documents that show he warned the SFO in May 2022 that Vashi was defrauding investors and falsifying accounts.\n\nThe SFO closed his complaint one day after receiving it, the documents show, and the company was allowed to continue raising money under false pretences until it collapsed with debts of £170m in April 2023. The SFO told Panorama: \"When we don't progress a referral, we're not dismissing concerns about potential criminality. It simply means that it is assessed as not meeting the criteria for the SFO to investigate.\" Vashi Dominguez claimed to offer customers bespoke high-end jewellery at affordable prices. There were Vashi shops across the UK, including a flagship store in Covent Garden, central London. The day the company went into liquidation, Mr Dominguez left the UK for Dubai. He has not been heard from since. Panorama has made several attempts to contact Mr Dominguez through various means but has not received any response.\n\nJohn Ames joined Vashi as chief technology officer in July 2021. He first became suspicious of the company's activities a few months later, he says, when he saw financial claims being made on marketing documents given to potential investors as part of a fundraising round seeking £75m. The documents claimed Vashi had made sales of £53.6m in the year 2020, while internal reports showed sales were really just £5.5m that year. The marketing material also claimed monthly sales of about £8.5m up until August 2021, but internal records for the same period showed sales for the whole year of £5.5m.\n\nJohn Ames contacted the Serious Fraud Office with his concerns about the Vashi jewellery business\n\nMr Ames told Panorama he began to ask Vashi management some awkward questions and then planned to leave the company. In a video call from December 2021, recorded by Mr Ames and seen by the BBC, a senior manager confirmed he was happy with Mr Ames' performance. But the following month, Mr Ames' contract was terminated at the end of his six-month probation period. In May 2022, Mr Ames contacted the SFO via an online form and urged it to investigate Vashi - which is known by its full name of Diamond Manufacturers Ltd at Companies House. In the form, seen by the BBC, he wrote: \"I discovered [Vashi] to be defrauding their investors, they are also likely to be misstating information on their statutory reporting, both through inflated stock holdings and failing to provide details on revenue sources\". If the SFO had checked Vashi's most recently filed accounts, it would have seen reported sales of £53.6m in 2020.\n\nInstagram Vashi Dominguez opened a shop in a prime site in Covent Garden, London\n\nSFO documents obtained by Mr Ames through a subject access request, and seen by the BBC, show that although SFO staff believed Mr Ames to be a genuine whistleblower, they closed his case the following day without contacting him. The internal document says: \"Source referred to AF [Action Fraud]\" - the UK national reporting centre for fraud and cybercrime, run by City of London Police. But Mr Ames says he didn't hear back from the SFO or Action Fraud, and Action Fraud told Panorama it never actually received a referral about the case. The SFO has now confirmed it did not pass on Mr Ames' referral. \"I thought I would get a phone call from someone, in shock and horror that this sort of thing was happening,\" Mr Ames says. \"I really did think somebody would take some kind of action.\" In May 2022, Mr Ames also reported Vashi to the Insolvency Service, the government agency that investigates liquidations but can also look at active trading companies and has the power to disqualify directors for misconduct. It responded to Ames telling him: \"It is not appropriate to use the powers available to the Insolvency Service to investigate the company at this time.\" The Insolvency Service's letter to Mr Ames shows there was no meaningful referral to the legal authorities - although there was a link to the Action Fraud website at the end of the letter. The Insolvency Service opened an investigation into Vashi the following year after the company's collapse.\n\nMichael Moszynski says he lost tens of thousands of pounds invested in Vashi",
  "authors": [],
  "url": "https://www.bbc.com/news/articles/cqx3vr7ln78o"
}