{
  "title": "Ministers call on Nigel Farage to address ‘repulsive’ teenage racism allegations",
  "text": "Cabinet ministers have described detailed and multiple allegations of racism by Nigel Farage as a teenager as “repulsive” and doubled down on Keir Starmer’s call for Farage to address the claims.\n\nLiz Kendall, the secretary for science and innovation and technology, said she was appalled by the descriptions reported by the Guardian.\n\nThe Welsh secretary, Jo Stevens, asked how far the Reform leader had changed his views. “People can form their own judgment on what kind of character he is,” Stevens said.\n\nThe Guardian has now heard testimony from about 20 individuals who claim they either witnessed or were victims of abusive behaviour by Farage at Dulwich college in the late 1970s and early 1980s\n\nAides to the Reform UK leader dismissed the allegations as “entirely without foundation” and claimed they are “one person’s word against another”.\n\nThe concern among a number of the group of school contemporaries who spoke to the Guardian is the blanket denial made by aides to Farage to the allegations.\n\nThe wholesale rejection of the claims appears to be a change of tack by Farage, who responded differently to allegations of racism reported by Channel 4’s Michael Crick in 2013.\n\nBack then he claimed he may have said “some ridiculous things … not necessarily racist things … it depends on how you define it”.\n\nFarage is yet to comment in person on the new claims, which include those made by Peter Ettedgui, 61, an award-winning director, who has said Farage would sidle up to him and growl “Hitler was right” or “gas them”.\n\nAfter the Guardian’s initial report, Ettedgui told the Guardian’s Today in Focus podcast: “If he was here right now, I’d want to know if that racist mindset of 13/14, and right up to the end of his Dulwich career, the age of 18, that, that racist mindset, does it have a role to play in his statements about rounding up and wanting to deport hundreds of thousands of migrants, including people with legally settled status? I’d want to know that, and I think that’s a very important question for him to answer.”\n\nEttedgui, whose credits include Kinky Boots, McQueen and Super/Man: the Christopher Reeve Story, went on: “Once he found out I was Jewish, you know, that was it. I have this incredibly clear memory of him persistently heckling and hectoring me as a Jew.\n\n“He’d kind of come up to me wherever we were. Might be in the classroom. It might be in the school grounds. And he’d say things like ‘Hitler was right’ and ‘Gas em’ and ‘ssssss’, the sound of gas escaping, basically.”\n\nEttedgui said he could not understand why Farage had not simply apologised for his alleged past conduct.\n\nHe said: “The easiest thing for him to have said when these allegations first came up would have been: ‘Yes, I did say some extraordinarily upsetting things to people that were racist. And I unreservedly apologise to them for that. But I can assure them and the general public that this has nothing to do with my politics today.’ He’s never said that.\n\n“I mean, there was a statement that went out from someone from Reform, a spokesperson from Reform. He says there’s no primary evidence, it’s one person’s word against another. If things like this happened a very, very long time ago, you can’t necessarily recollect what happened. I mean, that makes me really, really angry.\n\n“Because of course you can, you know, of course I can. And it’s about making sure that before someone goes into a voting booth and casts a vote for Nigel Farage as their prime minister, their leader, the person who’s going to affect policy for the next years to come, that there’s a full understanding of who he is.\n\n“And, as I say, that doesn’t mean to say that he’s racist today, but the question needs to be asked and the repeated denials from both himself and his spokespeople. [I] mean that the question is still very much there.”\n\nStevens, the Labour MP for Cardiff East, who became Welsh secretary in 2024, said: “I think [Farage] needs to explain himself, because if he doesn’t explain himself, what [the Guardian] has reported is there for everybody to see.\n\n“If he doesn’t, the assumption will be that he did say that. And then you do wonder if he’d formed those views at that age, how much has he changed, if at all? Do you want that sort of man running the country? In a million years, I wouldn’t want Nigel Farage running the United Kingdom.”\n\nA Reform spokesperson said on Thursday, in response to Starmer’s calls in the House of Commons for Farage to address the issue: “If things like this happened a very, very long time ago, you can’t necessarily recollect what happened.”\n\nA recent YouGov poll had Reform 10 percentage points ahead of Labour in the polls.",
  "authors": [
    "Daniel Boffey",
    "Robert Booth"
  ],
  "url": "https://www.theguardian.com/politics/2025/nov/20/ministers-call-on-farage-to-address-alleged-repulsive-teenage-racism"
}