{
  "title": "Un sistema de corrientes oceánicas clave podría colapsar. Este país lo declaró \"amenaza\" para su seguridad nacional",
  "text": "CNN —\n\nEl clima relativamente templado de Islandia se debe a una crucial red de corrientes que serpentea por el océano Atlántico, llevando calor hacia el norte. Sin ella, la isla sería mucho más gélida y tormentosa. A medida que se acumulan pruebas de que estas corrientes podrían colapsar, el Gobierno de Islandia ha tomado la inusual medida de declarar este riesgo como una amenaza para su seguridad nacional, lo que ha impulsado una respuesta de alto nivel sobre cómo prepararse para esta “amenaza existencial”.\n\n“Nuestro clima, economía y seguridad están profundamente ligados a la estabilidad de las corrientes oceánicas que nos rodean”, declaró Jóhann Páll Jóhannsson, ministro de Medio Ambiente, Energía y Clima de Islandia.\n\nLos glaciares de Vatnajökull, a unos 200 km al sur de Reikiavik, la capital de Islandia, el 23 de febrero de 2025. Evrim Aydin/Anadolu/Getty Images\n\nLa Circulación Meridional de Retorno del Atlántico (AMOC, por sus siglas en inglés) es un sistema de corrientes que funciona como una gigantesca cinta transportadora, llevando agua cálida del hemisferio sur y los trópicos al hemisferio norte, donde se enfría, se hunde y fluye de regreso hacia el sur.\n\nCuando se pregunta a los científicos qué impacto climático potencial les aterra más, el colapso de la AMOC suele encabezar su lista de preocupaciones.\n\nUn creciente número de investigaciones indica una ralentización de la AMOC, a medida que el aumento de las temperaturas globales altera el delicado equilibrio de calor y salinidad del que depende su fuerza. La ciencia aún no ha llegado a una conclusión definitiva sobre la probabilidad y el momento de un posible colapso, pero algunos estudios han proyectado que podría ocurrir durante este siglo.\n\nUn colapso de la AMOC “ya no puede considerarse un riesgo de baja probabilidad, dada la evolución de la ciencia en los últimos años”, afirmó Stefan Rahmstorf, oceanógrafo físico y climatólogo que ha estudiado la AMOC en la Universidad de Potsdam, Alemania.\n\nLas repercusiones serían catastróficas: provocarían enormes cambios climáticos y meteorológicos a nivel mundial, incluyendo el aumento del nivel del mar en partes de Estados Unidos y Europa, la alteración de los sistemas monzónicos que afectarían a países de Asia y África, y un invierno gélido en Europa, con la posibilidad de que el hielo marino se extienda hacia el sur hasta el Reino Unido.\n\nIslandia “estaría cerca del epicentro de un enfriamiento regional grave”, lo que significa que el país podría quedar rodeado de hielo marino, declaró Rahmstorf a CNN.\n\nEs “una amenaza existencial”, afirmó Jóhannsson a CNN. La AMOC regula el clima de Islandia, y su colapso podría devastar la infraestructura, el transporte e industrias vitales como la pesca, añadió.\n\nJóhannsson informó al Gobierno sobre los últimos avances científicos después de que una investigación publicada en agosto suscitara “serias preocupaciones” sobre la futura estabilidad de la AMOC. En septiembre, el Consejo de Seguridad Nacional de Islandia designó el posible colapso de la corriente como un riesgo para la seguridad nacional, siendo la primera vez que un factor climático recibe esta designación en el país.\n\nLa decisión “refleja la gravedad del problema y garantiza que el asunto reciba la atención que merece”, afirmó Jóhannsson. En la práctica, esta designación implicará una respuesta gubernamental coordinada de alto nivel para comprender la amenaza y determinar cómo prevenir y mitigar las peores consecuencias, añadió.\n\nRahmstorf felicitó a Islandia por su decisión e indicó que otros países deberían seguir su ejemplo. El impacto de un colapso de la AMOC se sentirá en todo el mundo. Los científicos están intentando comprender el alcance total de los posibles impactos en las sociedades y las economías, pero las investigaciones han señalado la destrucción de cosechas e inundaciones catastróficas.\n\nLa decisión de Islandia marca un cambio en la forma en que el país comprende los riesgos climáticos, concluyó Jóhannsson.\n\n“Lo que sí sabemos es que el clima actual podría cambiar tan drásticamente que nos resultaría imposible adaptarnos”, afirmó. “En resumen, no se trata solo de una preocupación científica, sino de una cuestión de supervivencia y seguridad nacional”.",
  "authors": [
    "Laura Paddison"
  ],
  "url": "https://cnnespanol.cnn.com/2025/11/15/clima-y-tiempo/islancia-colapso-corrientes-oceanicas-amenaza-trax"
}