{
  "title": "Was Bitcoin Created by This International Drug Dealer? Maybe!",
  "text": "The messages started arriving on a Sunday afternoon in mid-May. “Just wanted to draw your attention to this,” one began. “Rumors are starting to surface,” another informed me. “I’d be very interested in getting your thoughts,” a third suggested. My correspondents, mostly strangers, were polite but insistent. They wanted my take on a theory, newly circulating online, that offered a resolution to one of the most alluring digital mysteries of the past decade, the real identity (or identities) behind the persona of Satoshi Nakamoto.\n\nThe question, as someone in my Twitter DM’s articulated it, was this: “Do you think that Paul Le Roux is bitcoin creator Satoshi?”\n\nIn one sense, they’d all come to the right place. I spent five years tracking Paul Calder Le Roux, a South African pro­grammer who built a global drug and arms dealing empire, and transformed himself into one of the 21st century’s most prolific and pursued criminals. I’d obsessively catalogued his life, from his early history as an encryption coder; through his creation of an online prescription drug business worth hundreds of millions of dollars; to his diversification into smuggling, weapons, and violence; to his 2012 capture by, and cooperation with, the Drug Enforcement Agency.\n\nAlong the way he had, among other endeavors, simulta­neously fed the American opioid epidemic; built his own base operations in Somalia, protected by an armed militia; run gold and timber extraction operations in a half-dozen African countries; laundered millions of dollars through Hong Kong; plotted a coup in the Seychelles (later abandoned); bought off law enforcement in the Philippines, where he was based; trafficked methamphetamine out of North Korea; and overseen a team of engineers building missile guidance systems for Iran and drones for drug delivery.\n\nI’d traveled into the Manila underworld and found former employees, including ex-military mercenaries who’d worked as Le Roux’s enforcers. I’d distilled hundreds of interviews and tens of thousands of pages of records into a 400-page book, The Mastermind, detailing Le Roux’s epic rise and fall.\n\nThese questions about Satoshi, however, filled me with a special kind of dread. I’d traveled down the Satoshi rabbit hole before and returned empty handed. “I’ve got a secret theory that Paul invented bitcoin,” I’d written in 2016 to Mathew Smith, Le Roux’s cousin. Smith, along with over a hundred other Le Roux–connected people I interviewed, from employees to cops, had seen or heard nothing to support my theory. By the time I finished the book, in late 2018, I’d largely discarded it. “I wasted countless hours trying to determine if there was any connection” between Le Roux and Satoshi, I wrote in the final manuscript. “As far as I could tell, there wasn’t.”\n\nThere was some relief in this. I’d seen the ignominy when people went Satoshi hunting in the past. The siren song of bitcoin’s progenitor had been calling out to journalists since Satoshi seemed to exit the cryptocurrency world in 2011, leaving behind a technology that—even today, after all the hype cycles—promises to shape the future of everything from money to contracts. Whoever Satoshi was, the person (or persons) was sitting on a fortune, roughly a million bitcoins that analysts estimated Satoshi had mined at the currency’s inception in 2009. (At current prices that stash would be worth more than $10 billion.) There had been many attempts to unmask the creator, unresolved.",
  "authors": [
    "Evan Ratliff"
  ],
  "url": "https://www.wired.com/story/was-bitcoin-created-by-this-international-drug-dealer-maybe/"
}