{
  "title": "Fifa bingo! World Cup playoff draw checks all boxes as Irelands and Wales plot paths",
  "text": "DRAWN OUT\n\nAn audience full of middle-aged and elderly men almost certainly preoccupied with what’s for lunch? Check. Constant reminders that football unites the world? Check. A charming hostess and former Miss Switzerland, Melanie Winiger? Check. Numerous ornate plinths bearing see-through bowls, a trophy or a football. Check. More montages from World Cups passim than were strictly necessary? Check. A dizzying array of acrylic multi-coloured draw balls? Check. “Fifa legends” Christian Karembeu, Marco Materazzi and Martin Dahlin? Checkity-check-check. A shiny floor? Check. Fifa competition manager Manolo Zubiria explaining protocol? Check. Self-important claptrap from an increasingly obsequious and craven “haunted cue-ball” Fifa president? Check.\n\nSuch were the mandatory ingredients for the usual over-stuffed and undercooked helping of pure, concentrated Fifa that eventually revealed – at least for the parochial purposes of Football Daily – that Wales will be at home to Bosnia and Herzegovina, Northern Ireland will be away to Italy, and the Republic of Ireland will face Czech Republic in Prague as they attempt to negotiate the next steps of their meandering “paths” to next summer’s Geopolitics World Cup. Working on the almost certainly misguided assumption that all three nations win, Wales will then host Northern Ireland in a mouthwatering winner-takes-all eliminator, while O’Ireland will welcome Denmark or North Macedonia to Dublin to see who gets to compete in North America. In Europe’s other two obstacle-strewn pathways, Ukraine will entertain Graham Potter’s Sweden (presumably on neutral ground) with the winners hosting Poland or Albania. Slovakia or Kosovo will stage the remaining final against Romania or global football’s not so much dark, as increasingly-dappled grey horses Turkey.\n\nMeanwhile in Scotland, nobody cares who anyone got in the playoffs because everyone is still watching replays of that Kenny McLean goal from the halfway line, listening to that BBC Radio Scotland commentary of that Kenny McLean goal from the halfway line, or in some cases gradually coming around and wondering where they left their troosers. They will be unconcerned with the news that the draw involving six teams from five continents to see who will take the two remaining places at next summer’s finals has pitted New Caledonia or Jamaica against DR Congo for one spot and Bolivia or Suriname against Iraq for the other. All four of those games are scheduled to be played in the Mexican cities of Guadalajara or Monterrey in March. And with that, as the final Geopolitics World Cup pathways were etched in bureaucratic bronze, the Zurich audience rose as one, not in a standing ovation for the dazzling complexity of the draw through which they had just snoozed, but because in a nearby hospitality suite the canapes, vol-au-vents and pre-packaged salmon mousse sandwiches were finally being unveiled.\n\nLIVE ON BIG WEBSITE\n\nJoin Sarah Rendell from 8pm GMT for piping hot, minute-by-minute coverage of Chelsea 1-2 Barcelona in Women’s Bigger Cup.\n\nQUOTE OF THE DAY\n\nI was 34, I’d spent nine years at Arsenal and there had been a fair amount of discussions with the club. I wanted to go back to France with my family. There were deteriorated relationships with people at the club, although not with Unai Emery” – Laurent Koscielny, now the sporting director at Lorient, talks to Raphaël Jucobin about his controversial exit from Arsenal and that Bordeaux announcement video.\n\nView image in fullscreen Laurent at Lorient. Photograph: Damien Meyer/AFP\n\nI can claim a pathetically weak link to Scott McTominay (yesterday’s Football Daily). For one term he attended the same high school in Lancaster that I attended for seven years. During compulsory games, if it was football, the two best players picked their teams. Me and another lad were always last to be picked, usually being ‘full-backs’, ie standing around shivering and wondering what we were supposed to do when the opposing team came running past us. But I can claim to have pretended to play on a pitch on which Scott, of course, excelled” – Paul Henry.\n\nSince Curaçao (population 155,826) is now the smallest nation to have qualified for the men’s World Cup instead of Iceland, may I take this chance to update my comparison (15 October letters) in that the former has a population smaller than the London borough of Hackney (population 266,758) and less than half the size of Croydon (population 397,741)” – Derrick Cameron.\n\nSend letters to the.boss@theguardian.com. Today’s prizeless letter o’ the day winner is … Paul Henry. Terms and conditions for our competitions, when we run them, can be viewed here.",
  "authors": [
    "Barry Glendenning"
  ],
  "url": "https://www.theguardian.com/football/2025/nov/20/fifa-bingo-world-cup-qualifying-playoff-draw-northern-republic-of-ireland-and-wales-football-daily"
}