{
  "title": "Israeli former hostage Bar Kupershtein describes 2 years in captivity in Gaza",
  "text": "Bar Kupershtein smiles and laughs as if he hasn’t spent the last two years in “hell,” as he describes it, his demeanor belying the time he spent in Hamas’ captivity in Gaza.\n\n“I prefer to take things with humor and laughter, to be happy with my family, and to look forward, not back,” the 23-year-old security guard who was kidnapped from the Nova Festival on October 7, 2023, told CNN, hours before boarding a flight to meet US President Donald Trump at the White House on Thursday.\n\nIt’s the same resolve that made him stay behind during the terror attack, aiding the wounded partygoers, until he was ultimately shot and kidnapped by Hamas. Despite the enormous hardship he endured, he says he would do the exact same thing again.\n\n“I was responsible for the safety of all the partygoers”’ he said. “If I ran away and saved myself, knowing that others were there and I could have helped them –– I wouldn’t have been able to live with myself.” Survivors have called him a hero. “I just did my job,” he insists.\n\nThat decision cost him 738 days.\n\n“In your head, you count every day, that’s how you keep yourself busy,” he told CNN. In the beginning, he recalls, blindfolded and forbidden from speaking, counting was one of the only activities available. Days became weeks, months, two years.\n\n“There were moments when they tried to execute us, when they starved us, when they abused us, whether with beatings, physically, verbally, depriving us from basic human conditions,” he recounts. “You feel like the most miserable person in the world.”\n\n‘Just endure it’ or ‘It can’t get any worse than this’\n\nHeld underground with five other hostages, in what he described as “a small dungeon,” Kupershtein recalls an especially violent period, following statements by far-right Israeli National Security Minister Itamar Ben Gvir on Palestinian prisoners. “They came to us, beat us and hit us, and when we asked why, they said it was because of Ben Gvir and because of our government,” he said.\n\nIn April 2025, Hamas released a propaganda video showing Kupershtein and another hostage, Maxim Herkin, appearing emaciated and distressed, begging to be brought home. “All I was thinking about was that my family would know that I am alive, that’s it,” he said. “I didn’t care what they told me to say, I would say everything – just for my family to see me safe and sound and speaking.”\n\nIn that hell, Kupershtein says his anchor was his faith.\n\n“God gave me the strength to be strong. I truly believed and knew that I would get out safe and sound,” he said. “From day one, I had this inner feeling. I kept telling myself not to give up and stay strong – for the family – because one day I will get out and go back to being Bar. I told myself that it can’t get any worse than this – so just endure it.”\n\nGaza hostage Bar Kupershtein arrives at Chaim Sheba Medical Center at Tel HaShomer in Ramat Gan, Israel, on October 13. Alexi J. Rosenfeld/Getty Images\n\nHis faith grew even stronger during captivity.\n\n“I wasn’t very religious beforehand, only traditional, but in captivity, one really connects to God, you talk to him. He saved me – not once or twice. Every day that I stayed alive was a miracle.”\n\nIn captivity, Kupershtein had little access to the outside world and was only occasionally aware of what was happening. Even then, it was often what his captors wanted him to know.\n\nBut a radio transmitter brought in to broadcast Quran passages to the hostages gave them an unexpected link to the outside.\n\nKupershtein managed to locate an Israeli military radio station and get updates from home. “I remember waking up every morning, looking at the radio and waiting to listen to it,” he says. “It really is a miracle. Imagine you’re 30 meters (98 feet) underground and you’re listening to the radio.”\n\nA father’s fight for his son\n\nFrom that radio, he heard about his family’s efforts to secure his release. Kupershtein’s father, Tal, was a former volunteer paramedic for United Hatzalah, Israel’s largest volunteer emergency medical service organization. He suffered a severe stroke in a motorcycle accident three years prior to the kidnapping. The accident made Bar, the eldest of five siblings, the family’s breadwinner, managing their falafel stand while also working as a security guard at events. He also followed in his father’s footsteps, volunteering as a paramedic.\n\nDuring his son’s captivity, Tal – who was in a wheelchair and had been unable to speak for years – engaged in an intense recovery effort with speech therapists and regained his ability to speak so he could advocate for his son’s freedom.\n\nAt center, Tal Kupershtein, father of Bar Kupershtein, speaks as family members and supporters of hostages who were kidnapped during the deadly October 7 attack, stand near the kibbutz defence on the day they speak to their captive loved ones over the border between Israel and Gaza, at Kibbutz Nir Oz, in southern Israel, April 20, 2025. Amir Cohen/Reuters\n\n“I saw my father sometimes at demonstrations, they even brought me a picture of him standing at a demonstration,” Kupershtein says. “I also heard my mother organized a birthday for me at Hostages Square.”\n\nHe didn’t believe his release was coming until the last minute. “There were so many deals that didn’t go through, so we thought here’s another one that won’t go through, something will mess up,” he said. “Even when I was on my way home, I didn’t believe we were actually getting out.”\n\nNow, he is on his way to the Oval Office, where the US president invited all 20 newly- freed hostages. Kupershtein, who calls Trump “an emissary of God,” plans first and foremost to thank him. “God said we needed to get out of there and he was the emissary,”, he says. “He played a big part in us getting out of there.”\n\nAsked if he believes in peace, Kupershtein is measured. “Personally, yes, but after these two years I was there, I know that the other side is really not interested in peace, so as much as we as a state can want peace – I don’t think it can happen with Hamas.”\n\nHe describes himself now as an “upgraded version” of who he was before and says being back in Israel is like a daily dream.\n\n“There is an excitement every day to wake up in the morning here – and not there in the tunnels – and to be alive and breathing,” he said. “I thank God for this every day.”\n\nStill, underneath the smiles and the laughter, he acknowledged the wounds remain.\n\n“Of course, there are moments when I can’t fall asleep at night with hard thoughts and a need to go out for fresh air,” he admits. “Sometimes I find myself in situations where I see everyone around me happy, but I’m just regular, and it’s not true happiness.”\n\nHe says he tries “to surround myself with a loving, supportive environment so that I don’t reach those situations and just be happy. It’s part of it, I believe it will heal.”",
  "authors": [
    "Tal Shalev"
  ],
  "url": "https://www.cnn.com/2025/11/20/middleeast/israeli-hostage-kupershtein-gaza-captivity-intl"
}