{
  "title": "How Chinese gamblers created a secret pipeline for illicit cash through Las Vegas’ biggest casino",
  "text": "Lei Zhang walked out of the desert heat into the cool air of a Las Vegas casino floor, his eyes hidden behind sunglasses. Zhang strolled past the buzzing crowds around the blackjack tables, skirted the clanging slot machines and headed to a hotel room.\n\nHe carried with him a satchel full of cash and a dark secret: He was a key player in a suspected global money-laundering scheme – one that catered to high-rolling Chinese gamblers and that investigators would later tie to some of the world’s most dangerous criminal gangs.\n\nFor years, authorities have battled an illicit black market for US dollars fueled by strict Chinese government restrictions on its citizens. Affluent Chinese nationals looking to bypass those rules pay middlemen to procure millions in cash – often sourced from Mexican cartels looking to rinse clean their illicit profits from fentanyl and other drug sales.\n\nNow, a CNN investigation that included a review of hundreds of pages of court documents and interviews with more than half a dozen law enforcement sources reveals new details about a little recognized participant in this booming market: American casinos.\n\nAt one high-profile casino, some of the staff were even in on the scheme.\n\nVideo Ad Feedback From fentanyl to the felt: How drug money from Mexican cartels flowed to a Las Vegas casino 5:21 • Source: CNN From fentanyl to the felt: How drug money from Mexican cartels flowed to a Las Vegas casino 5:21\n\nLast year, Wynn Las Vegas agreed in a non-prosecution agreement to pay the federal government $130 million for essentially helping to put illegal money in the hands of big-stakes gamblers in the largest criminal forfeiture by a casino in US history. The casino, which was founded by Steve Wynn, who stepped down as the CEO of Wynn Resorts in 2018, was fined another $5.5 million by state regulators in May to resolve the same case.\n\nBut the details of the multiple criminal cases that sparked those massive fines have largely been kept under wraps – until now.\n\nA key factor in those settlements, investigators said, was evidence gathered in the case against Zhang and three other defendants, all of whom admitted to helping wealthy Chinese gamblers avoid currency restrictions so they could spend tens of thousands of dollars at Wynn and other casinos. At Wynn, the fraud was often facilitated by employees.\n\nLaw enforcement officials told CNN they had evidence that money provided by Zhang and others — none of whom were employed by the Wynn casino, but rather worked as middlemen providing gamblers with cash — came from prostitution, human smuggling and the street sale of deadly drugs.\n\nAt the casino, gamblers skirted “foreign and U.S. laws governing monetary transfer and reporting,” including the Bank Secrecy Act or Anti-Money Laundering laws, the Department of Justice said.\n\nNeither the casino nor the four defendants admitted to knowingly laundering money for cartels or anyone else. But some investigators said that their actions helped bad actors hide the source of their illicit money.\n\n“Federal laws that regulate the reporting of financial transactions are in place to detect and stop illegal activities,” said Carissa Messick, the special agent in charge for the Internal Revenue Service’s criminal investigations unit in Las Vegas, in a statement at the time. “Deliberately avoiding Bank Secrecy Act requirements is a form of money laundering.”\n\nIn a statement to CNN, Wynn Resorts said the company fully cooperated with the investigation and “immediately terminated the few employees involved because their actions violated the Company’s compliance program.”\n\n“Wynn is committed to upholding the highest standards of integrity, compliance, and regulatory responsibility,” the Wynn casino said. “We accept responsibility for the historical deficiencies identified, have taken meaningful remediation, and are dedicated to ensuring that such failures do not reoccur.”\n\nThe cases of the four defendants that helped lead to Wynn’s historic settlement show how casinos have profited from having dirty money come through their coffers, and how drug cartels seek to legitimize the huge profits they generate from the sale of fentanyl and other drugs through legal gambling establishments, experts and investigators said. One prosecutor in Zhang’s case estimated that at least a hundred million dollars annually was being laundered through American casinos.\n\n“Forty-eight hours ago, that was the proceeds of fentanyl,” said Chris Urben, a former assistant special agent in charge with the Drug Enforcement Administration’s Special Operations Division, speaking about some of the cash that Zhang and others moved through the Wynn and other casinos.\n\nAlthough federal regulators and authorities have cracked down on banks and demanded tighter scrutiny on the cash deposits favored by cartels, regulators have been slower to apply that same pressure to casinos — despite their financial interest in looking the other way or even facilitating these crimes.\n\n“They haven’t received as much scrutiny as financial institutions have in the past,” said Ian Messenger, founder and CEO of the Association of Certified Gaming Compliance Specialists in Toronto. “That is changing, with cases like Wynn.”\n\nHunger for cash\n\nThe schemes to move illicit money at Vegas casinos traced back to a simple problem: High-rolling gamblers from China — who are known to drop up to a million dollars on a single hand of blackjack — were having problems accessing their funds in the US.\n\nA corruption crackdown by the Chinese government starting around 2016 led to stricter enforcement of rules prohibiting individuals from taking more than $50,000 a year out of the country.\n\nFor US authorities, this rule has created supersized demand among well-heeled Chinese visitors and expats. When they need large sums for purchasing real estate, buying a luxury car or other big expenses, many turn to underground bankers.\n\nThese illicit bankers, who are also often Chinese, have turned to criminal gangs such as Mexican drug cartels and prostitution rings, law enforcement officials told CNN.\n\nIn exchange for cash, the cartels and other providers are paid back through Chinese bank accounts that face no US financial scrutiny.\n\nIn recent years, these Chinese middlemen have essentially become the go-to bankers for the biggest players in the US drug trade, authorities have said, wresting control from Latin American interests in what has amounted to a bloodless coup.\n\nAnd high-stakes Chinese gamblers quickly became important players in the financial scheme, authorities say.\n\nThe big break\n\nIn late 2018, Dave Mesler, a special agent with the Internal Revenue Service’s criminal investigation unit, got an intriguing tip from employees at another Las Vegas casino.\n\nThey’d noticed a strange pattern: A man would walk into the casino carrying a satchel and then would meet a host — a casino employee in charge of keeping high-value gamblers happy. The host would summon a high-roller, and the trio would disappear to a private setting like a hotel room. Then the man who came with the satchel would depart, often without having gambled.\n\nStaff at the casino, which Mesler confirmed was not Wynn but declined to identify due to DOJ policy, eventually notified law enforcement about a handful of men all following the same pattern.\n\n“The casino didn’t quite figure out what they were up to,” Mesler said, but “they realized these guys were up to something.”\n\nMesler and other investigators soon learned the IDs of four of the men: Lei Zhang, Bing Han, Liang Zhou and Fan Wang. All were Chinese nationals in their late 30s or 40s living in Las Vegas. (None of the men responded to CNN’s multiple efforts to reach them. )\n\nDave Mesler speaks during an interview. CNN\n\nMesler, who at the time led the IRS’s Las Vegas Financial Crimes Task Force, subpoenaed their cell records. The results excited him so much he flew from his office in Las Vegas to San Diego to meet with a federal prosecutor.\n\n“I found that these guys were talking to Wynn casino hosts multiple times a day every day,” Mesler said. “Hundreds a week. … I mean, I don’t even talk to my girlfriend this much.”\n\nInvestigators had already been interested in Wynn, a high-end resort with a sleek glass design with locations worldwide, including Macao – the only place in China where gambling is legal.\n\nInvestigators had earlier looked into bank accounts they suspected were being used by drug cartels to fund gambling at the casino, DEA sources said, but none of those probes led to any charges being filed. (Wynn said in its statement that the accounts were “established to allow out-of-state guests to make normal and customary payments to the Company” and that the casino followed all proper financial reporting procedures.)\n\nMesler believed something bigger was afoot with the new evidence involving the four Chinese men.\n\n“It was happening now – it didn’t happen years ago,” Mesler said. “This breathed a lot of new energy into the case.”\n\nMesler started reviewing surveillance footage from Wynn, and sure enough, the four men were making regular visits with casino hosts and high-rolling gamblers there.\n\nWith the evidence mounting in early 2019, other agencies joined the case: the US attorney’s office in San Diego, the DEA, the Department of Homeland Security and even the Las Vegas Metropolitan Police Department.\n\nThrough surveillance footage, undercover assignments and interviews with informants and the defendants, investigators were able to piece together a more complete picture of the sophisticated scheme.\n\nWynn casino and Mexican cartels\n\nInvestigators began watching as the four underground bankers or couriers working for them drove in and around Las Vegas and Los Angeles making cash pickups, law enforcement sources told CNN.\n\n“They would take cash from anybody that had cash they didn’t want to deposit in a bank account for various reasons,” Mesler said.\n\nThe men would then shuttle the ill-gotten cash to Wynn and other casinos in Vegas, where they would meet with a casino host and an elite gambler from China for a hand-off.\n\n“It didn’t always happen in a hotel room, but it could. It could happen in the hotel bathroom as well,” said Peter Fuller, a former detective in the Las Vegas police department who worked on the case. “It also happened in vehicles.”\n\nPhone data seized from the four suspects showed they were frequently communicating with Wynn casino hosts, said Urben, the former DEA official — but also that some of their communications traced back to Mexican cartel operatives. He added that other intelligence, including surveillance and post-arrest interviews, also pointed to cartels as a significant source of cash.\n\nCNN obtained an unclassified internal DEA document, which reported that agents suspected money launderers were feeding cash from Latin American drug cartels to Chinese gamblers, who were “reliable customers to purchase cash drug proceeds.” The intelligence report, which was shared with field offices across the country in 2021, also linked Vegas casino hosts with members of US-based drug trafficking organizations “seeking to launder drug proceeds.”\n\n“The majority and the driver of this was Mexican cartel proceeds,” said Urben, who now works as a managing director at Nardello & Co., a private global investigations firm that specializes in corporate matters. “When I say that, I mean fentanyl, heroin, cocaine, methamphetamine.”\n\nA Homeland Security investigator, who worked closely on the case and asked that his name not be used out of safety concerns, said much of the cash being sold by underground bankers to Chinese gamblers in Vegas at the time appeared to come from cartels.\n\nIt’s unclear how much the casino hosts or Chinese gamblers knew about the source of the money when coordinating the transactions, officials said.\n\nBut they all knew enough to be secretive about the activity, the Homeland Security investigator said, “so they must have known they were doing something bad.”\n\nAfter using a Chinese social-messaging and mobile-payment app called WeChat to make a quick money transfer, the gambler would often take the cash, bring it inside the casino and exchange it for chips, officials said.\n\nThe end result was that everybody got what they wanted. The casino host got the golden-goose gambler to play at Wynn, the gambler received the cash, the “third-party” source was able to replace their dirty cash with a clean deposit in a financial institution, and the underground banker got his fee, all without having to send hefty dollar amounts across international borders.\n\nIn May 2019, investigators on the case carried out the first sting operation. It targeted Zhang.\n\nZhang had been lured to a Las Vegas casino hotel room by an undercover federal agent who called the money mover posing as a wealthy gambler looking to obtain $150,000 in cash.\n\nAs he made his way through the casino floor to the hotel room, agents working with Homeland Security Investigations waited in an adjoining room. Zhang had been instructed to show up alone, but he came with a woman. Zhang knocked on the door and the undercover agent answered.\n\nThe agents barged in.\n\n“He looked very cool and suave,” said the Homeland Security investigator. “Cool sunglasses and hair. … Very Vegas.”\n\nThe agents opened the satchel and discovered four brick-sized stacks of cash, the investigator said.\n\nCash confiscated from the sting, in an image provided by the IRS. Jeremy Moorhead/CNN\n\nJeremy Moorhead/CNN\n\nThe woman, who had a handful of cell phones on her, was a “madam” who ran an escort service, he said. Two-thirds of the cash belonged to her, and she wanted to make sure the transaction went smoothly. The agents seized the cash; the woman was not arrested, he said.\n\nThat bust, he added, helped lead investigators to the other three suspects, who were arrested in similar stings throughout Las Vegas that summer.\n\nThe four defendants\n\nWith the evidence collected by Mesler and others, Zhang, Han, Zhou and Wang were charged in federal court between May and September of 2019 with operating an unlicensed money transmitting business.\n\nProsecutors said their scheme was just a fraction of the illicit money moving through casinos.\n\n“The total magnitude of this problem, especially in Las Vegas, catering to high-roller Chinese gamblers who come into Las Vegas without easy access to United States cash, is certainly in the nine figures on an annual basis,” said prosecutor Mark Pletcher during Zhang’s sentencing hearing in 2020. “We’re talking about a problem in the hundred-million dollar range” yearly, he added.\n\nIn court, the defendants — who had all emigrated from China — described how they’d been drawn into the underground banking schemes because they needed money to help care for children or elderly parents, in a country where they had few connections and spoke little English.\n\nBy fall of 2020, all four pleaded guilty to a lesser crime than money laundering: operating an “unlicensed money transmitting business.” Investigators told CNN the money-laundering charge would require proving that the defendants themselves knew the source of the dirty cash they were bringing into the casino.\n\nBut another prosecutor, Daniel Silva, told the court that the activity “totally undermines the United States’ anti-money laundering laws.”\n\nThe networks, he added, “are a huge, huge problem in the United States” and “will not be tolerated.”\n\nZhou, now 42, was ordered to repay the government $446,000. He was sentenced to six months in prison.\n\nThe lightest sentence went to Wang, who received three months in home detention and was ordered to repay $225,000 for his role in the scheme.\n\nA former professional poker player who also worked in the “junket” industry that brought Chinese gamblers to Las Vegas, Wang, now about 43, was charged last year with lying about his felony conviction while trying to purchase a semiautomatic assault rifle in Las Vegas, court documents state. He pleaded guilty to the weapons charge in April and was sentenced to time served.\n\nThe steepest forfeiture penalty went to Han, now 50, who was ordered to repay $500,000. Han told the courts he was granted asylum in the US in 2019 after suffering religious persecution in China for starting a church in his home, according to court records.\n\nThe stiffest prison sentence went to Zhang, now about 45, who’d claimed through his lawyer in court that he had no idea he was doing anything wrong. The judge handed Zhang 15 months in prison and ordered him to repay $150,000 – a formality as authorities had already seized that amount in the raid.\n\nFuller, the former detective with the Las Vegas police department, said it’s important to recognize the harm in the crime.\n\n“You just can’t go take cash from anybody, because what ends up happening is, you end up taking it from Pablo Escobar,” said Fuller, who now works as a special agent for the IRS. “It’s basically the same thing that took place in the ’30s with Al Capone and all that, all the bankers and everybody. ‘Oh no, I, I don’t sell drugs. I’m not in organized crime. I just set up companies for people. I just move money.’”\n\nLast fall, a little over two years after the last of the four men were sentenced, Wynn casino signed the non-prosecution agreement and admitted to its employees’ involvement in a range of schemes, including those catering to high-rolling Chinese gamblers. The casino, in a statement to CNN, said it was unaware of the details of the four individual criminal cases as they played out in court.\n\nThe Wynn Plaza Shops are seen in Las Vegas. Jeremy Moorhead/CNN\n\nThe agreement also highlighted earlier cases dating back to 2014 in which the Wynn casino “knowingly and intentionally conspired” with individuals – some with connections to Latin America – to set up illicit ways to get money to gamblers at the casino and to recruit foreign gamblers from places the US has identified as “major money laundering countries.”\n\nIn another scheme – referred to in the document as “human head gambling” – patrons who were prohibited by anti-money-laundering laws from gambling would stand behind a proxy gambler and give orders. One such patron had suspected connections to a transnational organized crime group.\n\nWynn casino’s involvement in the illicit activity wasn’t limited to casino hosts – it also included a company marketing executive and a senior executive of a company affiliate, the agreement says.\n\nIn its statement, Wynn said it has since made improvements outlined in its settlement, including adding high-level staff members to an office dedicated to enforcing anti-money-laundering laws, and establishing an independent compliance committee whose members are unaffiliated with the company.\n\nAn ‘explosion’ of Chinese money laundering\n\nWhen Zhang and Han pleaded guilty in early 2020, they were the first in the US to be prosecuted for this form of underground banking, according to the DOJ.\n\nToday, networks of Chinese underground bankers are the primary money launderers for not only the Mexican drug cartels, but organized crime groups around the world, including various Italian mafia groups, said Vanda Felbab-Brown, an expert on international organized crime with the Brookings Institution.\n\n“Over the past eight years or so, you have this big explosion of Chinese money laundering in the states, in Mexico, in Europe,” she said.\n\nWynn isn’t the only casino that has been caught aiding criminals who evade banking laws.\n\nIn Australia, Crown Resorts casino was hit with a $300 million fine (in US dollars) in 2023 for running afoul of anti-money-laundering laws and continuing a business relationship with a junket operator despite the casino’s awareness of allegations the firm was connected to Chinese organized crime. “The company that committed these unacceptable, historic breaches is far removed from the company that exists today,” Crown Resorts said in a statement at the time.\n\nThe Crown Melbourne casino and entertainment complex is seen in Melbourne, Australia, on March 25, 2024. Carla Gottgens/Bloomberg/Getty Images\n\nIn Canada, where this kind of crime has been rampant, a 2022 report by a government commission established to look into the issue revealed a common scheme in Vancouver that closely mirrors what investigators say was happening at Wynn: drug traffickers and Chinese loan sharks selling hockey bags filled with cash to Chinese gamblers who would wheel them into casinos to play a card game called baccarat.\n\nMessenger, the gaming-compliance expert, said he wasn’t surprised that the historic Wynn settlement and similar cases haven’t attracted much public interest.\n\n“The general public don’t typically have high expectations when it comes to the casino industry,” he said. “Everyone has Netflix. They’ve seen ‘Casino’; they’ve seen the other movies.”\n\nThe casino industry, however, has taken notice, and the culture of compliance with laws to prevent money laundering is improving, he said.\n\nEven so, Messenger said, casinos – with their large volumes of cash and intensifying pressure to boost foot traffic and bring in high-rollers as online gambling gains in popularity – remain a rich venue for rinsing criminal proceeds.\n\n“We see many, many cases of criminal funds or criminals attempting to deposit funds into the casino environment,” he said. “Not for the purposes of entertainment, but for the purposes of creating layers, creating explanations.”\n\nThose criminal funds come from a business that has left a trail of devastation.\n\nDEA official Brian Clark noted that the rise of Chinese money laundering coincided with a drug epidemic that in recent years has claimed over 100,000 lives annually in the US – the vast majority from opioids such as fentanyl.\n\n“It’s all being fueled from this money laundering trade,” he said, “and it results in the death of Americans.”",
  "authors": [
    "Rob Kuznia"
  ],
  "url": "https://www.cnn.com/2025/11/18/us/chinese-gambling-wynn-casinos-cash-middlemen-invs-vis"
}