{
  "title": "$2M vs. $63,000: Luxury Racing Simulators",
  "text": "Transcript\n\n[car zooming sounds]\n\nJesus Christ!\n\n[upbeat music]\n\nI'm Jeremy White,\n\nand I write about luxury tech for Wired.\n\nAnd today, I'm testing two machines in the racing sim space.\n\nI wanna find out exactly what you get when you spend 60k\n\non a racing sim like this,\n\n[classical music] [bell dinging]\n\nversus a $2 million machine like this.\n\n[bell dinging] [techno music]\n\nSo why are we looking at racing simulators?\n\nWell, motor racing is a rich boys' club.\n\nYou need to be loaded, or from a loaded family anyway,\n\nto get access to this world.\n\nBut racing simulators democratize this space.\n\nPeople like Jann Mardenborough,\n\nwho trained on Grand Turismo,\n\nhave now broken into the pro racing world for real.\n\nRight, let's go and test the 60,000 pound\n\nProdrive Racing Simulator.\n\nIt's the most beautiful racing sim I've ever seen.\n\nIt's designed by the guy who designed Jaguars,\n\nfor heaven's sake!\n\nIt's made of the materials that they used\n\nto make luxury super yachts.\n\nIf this isn't luxury tech, then I don't know what is!\n\n[bright music]\n\nWe're in a very lucky person's garage\n\nand this is the Prodrive Racing Simulator.\n\nIt is a thing of beauty.\n\nSo the main feature here of the Prodrive Simulator\n\nis the bent beech frame that goes all the way around\n\nand that is holding the suspended\n\ncarbon fiber monocoque frame.\n\nYou've got the shutoff power button\n\nfor the power steering wheel,\n\nand then this button here turns the PC,\n\nwhich is hidden in the nose, on and off.\n\nThen inside, you've got the racing steering wheel,\n\nand a racing seat.\n\nAnd that, with the super wide screen,\n\nis everything you need\n\nfor a luxurious home racing simulator.\n\nI've gotta be careful because a very kind Prodrive customer\n\nhas let us test his own unit.\n\nI'm gonna try and get in very gingerly. Here we go.\n\nOh, it's comfy! [seat whirring]\n\nIt's got sensors in the seat,\n\nso you can only adjust the pedals\n\nonce you're actually sitting down in the seat.\n\nOkay, pit lane limit, active.\n\nOkay, already getting some feedback from the wheel.\n\nPedals are good. The pedals feel authentic.\n\nEspecially the brake pedal.\n\nNice and stiff, as it would be, in the racing pit.\n\nOoh.\n\nOh dear!\n\nThe screen is wide enough really,\n\nto be almost at the edges of my field of view.\n\nIt's got really strong buttons\n\nthat you would get on a racing car for changing gear.\n\nI mean, basically it feels like a really expensive Xbox.\n\nFeels incredibly responsive.\n\nOh god!\n\nWith the Prodrive, the luxury element here\n\nis about as much about the design as the driving experience.\n\nIn fact, probably more so.\n\nIt's probably more about how this machine looks\n\nand how it can be part of your luxury home experience.\n\nSo the Prodrive, and undoubtedly a beautiful thing.\n\nBut the trouble with it was it's like a rich boys' toy.\n\nThe pedals, the steering wheel, the cabinet,\n\nthat's all something that you could possibly replicate\n\nat home for a few hundred bucks.\n\nIt's not really pushing the envelope.\n\nI look at luxury tech like this.\n\nIt's about the intersection\n\nbetween price, design, and innovation,\n\nand that middle sweet spot, where all those converge.\n\nThat's Wired luxury. But, there's a catch.\n\nYou've gotta consider the law of diminishing returns.\n\nAnd this states that the value you get decreases\n\nthe more money you spend.\n\nLook at it this way.\n\nYou spend 500 bucks on a Sonos speaker,\n\na high-end speaker will cost 200 times that,\n\nbut it'll only be 20 times better.\n\nAs we're looking at two luxury racing sims,\n\nthe Prodrive will be up at the top here,\n\nabout halfway through, 60k.\n\nThe $2 million Dynisma will be all the way along at the end.\n\n[upbeat music]\n\nSo I wanna see what the Dynisma is like.\n\nAnd this is F1 grade that you can now buy yourself.\n\nFerrari has one, for heaven's sake.\n\nFor a few million, you can have one too!\n\nAnd I want to know what that's like.\n\nThe clever thing about it, the innovation is the latency,\n\nthe delay in inputs for using the racing simulator.\n\nThey've managed to get their racing sim down\n\nto four milliseconds.\n\nMost of the time they're 50 milliseconds or 60,\n\nand that's brilliant.\n\nThis thing costs up to $12.6 million.\n\nAnd yes, you will be able to get one of these\n\nfor your home one day.\n\nThis is the motion generator.\n\nThe secret to why this is so realistic.\n\nThis is the rig that allows it to move around.\n\nThen you've got the struts.\n\nI shouldn't be able to do this on a normal simulator rig,\n\nbut because it's so low friction, look, I can,\n\nI can shift this on my own.\n\nThat's how low the friction is on this.\n\nAnd then you've got the carbon fiber tub, an F4 tub.\n\nThe pedals that you reach through to around here\n\nare actually higher than your lower body in the seat,\n\nso you've got that different driving position.\n\nAnd then as you step back,\n\nwe've got a massive wrap-around screen.\n\nSo I'm gonna try this out now to see how it really performs.\n\nLet's do it. Come on!\n\nOh my word.\n\nOh, okay.\n\nIt does actually feel like you're there.\n\nOh, blimey!\n\nOh, there goes a curb strike.\n\nMind you, the brakes are unbelievable.\n\nGod, is this what it's really like\n\nto drive in a Formula car round Monaco?\n\nOh my god.\n\nJesus Christ!\n\nYeah! We're never gonna make that chicane.\n\nNo, no, that's again, did it again.\n\nI can't make that, that's ridiculous.\n\nI'm feeling absolutely humbled, really.\n\nBut it's superbly convincing.\n\nVery quickly, you feel like you're actually there.\n\nIt's like the,\n\nyou can feel the back end of the car going out.\n\nThe acceleration is absolutely phenomenal.\n\nAll you can see is this massive screen.\n\nAnd I have no idea how humans drive faster\n\nthan that round this course, basically.\n\nThe thing is, Dynisma is so pro,\n\nthat I don't think I can test it all on my own.\n\nWe need a pro racing sim driver, and that is George.\n\nGeorge is not only a pro racing sim driver,\n\nhe's also a pro driver in the real world.\n\nOh!\n\nThis is mega. [George laughing]\n\nThis feels amazing. Oh, it's feeling really good.\n\nLike you say,\n\nyou feel everything on the rear of the car.\n\nEvery time I go over a curb, it feels so realistic.\n\nI'm so used to static sims,\n\nand I've never experienced a sim like this before\n\nwith the motion.\n\nSo in a weird way,\n\nit was training my brain that this is real.\n\nThe more I'm going around now,\n\nthe more visually and mentally my brain's accepting it.\n\nAnd this is quite easily the closest\n\nI've ever driven to anything.\n\nI think my heart rate is probably,\n\nI'm even sharing these right now.\n\nOh god, it's just fantastic.\n\n[car zooming sounds]\n\nThey've just changed the settings for George,\n\ngiving him less grip on the tires, because annoyingly,\n\nhe's doing much better than I was.\n\nThe value of this system is evident here.\n\nLike, look at it going on.\n\nLook at everything that's taking place here\n\nto make this as realistic as you possibly can.\n\nThe structure there providing information to the driver\n\nat incredibly low latency, three to four milliseconds,\n\nall the grease movement, the massive screen,\n\neverything taking place,\n\nthis is where the van has gone, and this,\n\nif you look at that graph of how much you get,\n\nhow much money you spend,\n\nthis is right on the end of that graph.\n\nThat's how much money you have to get and spend\n\nand develop to actually get something\n\nas sophisticated as this.\n\nWow, there we go. Thank you.\n\nAre there any parts of driving around the track\n\nthat particularly stood out for you?\n\nI think I definitely struggled a little bit at first\n\nwith like the tighter corners\n\nbecause that sense of speed is there, unlike at home,\n\nand you go from hundreds of miles an hour,\n\ndown to like really slow speeds in a second on the brake.\n\nSo I definitely struggled with those tight hairpins.\n\nBut then after a few laps, just the feeling,\n\neverything about this sim just made it feel\n\na lot more natural and I was able to get to grips of it.\n\nHow much do you reckon it would improve your driving?\n\nI think it would help so much,\n\njust in terms of learning the track,\n\nlearning the characteristics of the car,\n\nthen even setting up the car.\n\nYou can trial it in the sim\n\nand then apply it to the real world\n\nand I think that's where the market is,\n\nand that's what's gonna be a game changer.\n\nThe things that strike me about this simulator\n\nis that it is really is super realistic.\n\nYou really do feel like you're driving.\n\nYes, it's massively expensive,\n\nbut the value here is the money's all in that machine there.\n\nSo yes, it costs millions,\n\nbut the experience is priceless, really.\n\n[gentle music]\n\nSo testing over, and what have we learned?\n\nWell, we've learned that luxury tech is very expensive.\n\nThat's hardly a surprise.\n\nBut the difference between the Prodrive and the Dynisma\n\nis that Prodrive is going for aesthetic\n\nover all else, really.\n\nDynisma is really trying to push the boundaries forward.\n\nGo back to that Venn diagram. Design, money, innovation,\n\nProdrive does two of those. Dynisma does all three.\n\nAnd that's what makes it the best in the world.",
  "authors": [
    "Condé Nast"
  ],
  "url": "https://www.wired.com/video/watch/wi-wired-desired-racing-simulators"
}