{
  "title": "Vocal Coaches Share Their Best Advice For Singing 'Defying Gravity' Like A Pro",
  "text": "LOADING ERROR LOADING\n\nWhen the first half of the film adaptation “Wicked” dropped last year, the rest of the world was introduced to something the theater kids have known since the musical’s Broadway debut in 2003: “Defying Gravity” — and especially that final “battle cry” riff — is really, really fun to sing.\n\nBut it’s also really, really hard to sing.\n\nBefore you get discouraged or stop reading because you consider yourself a “bad” singer, this is your forever PSA that singing is something anyone can learn to do — and the pervasive idea that singing is only something you should do if you can quit your job and do it full time is dumb and unhelpful. Birds sing because they’re birds; humans sing because they’re human.\n\nAdvertisement\n\nGetty Images/Huffpost It's hard not to want to belt out the \"Defying Gravity\" battle cry. Voice teachers want you to know that anyone can learn to do it.\n\nBut that said, it’s an athletic endeavor to sing this song. To help you bust out your best attempt, whether to an audience, a karaoke bar or your steering wheel, HuffPost spoke with experts in vocal performance (including two former Broadway Elphabas) to get some pro tips on how to absolutely nail that big finish.\n\nDon’t skip the warm-up.\n\nIf you’ve ever been in a choral group or taken voice lessons, there is a permanent choir director in your head that will bully you for failing to properly warm up. Trying to execute a big chesty belt without giving your body a fighting chance to prepare first will seldom benefit your voice — or the ears of your audience.\n\nAdvertisement\n\n“I always warm up, but some days I warm up more than others. I do a lot of sirens to check my voice [at] the beginning of the day to see where my potential ‘problem’ areas for that day may be. When I figure out what they are, I just try to lightly and easily warm up,” said Christine Dwyer, who has played the role of Elphaba more than 1,000 times on Broadway and on tour. “I do lip trills, I gargle with saltwater if I am feeling like I need to clear anything out. And most importantly, I do a body warm-up.”\n\nDwyer said that she thinks it can be easy for singers to “over sing” and end up exhausted by the time they perform, but it’s essential to check in with your body.\n\n“Everything is connected, and this song is a really physically challenging song to sing as well. You’re not just using your voice, you really have to embody the most vulnerable parts of yourself,” she said. “So it’s important to make sure you warm up everything, not just the notes you have to sing.”\n\nAdvertisement\n\nDon’t take the whole song at a 10.\n\nWe all love a good scream-sing moment, but if you want to be able to make it to the final riff in “Defying Gravity,” you’ll need to pace yourself. Singing’s a marathon, not a sprint.\n\nAs Aimée Steele, a vocal coach and vocologist working with the cast of Buena Vista Social Club on Broadway, told HuffPost, the song is really a “contemporary pop aria.”\n\nThe song has a lot of range, she explained ― some low, low recitative parts (in opera, this is the speech-style talk that moves the plot forward), all the way to these high belted notes in the battle cry that close it out.\n\nAdvertisement\n\n“This has such a big vocal range, it starts very low and ends very high, and you have to navigate everything in between,” Steele said. “I call my Elphabas ‘vocal athletes’ for sure, because of the control, the colors of their voice they’re using, the range, the flexibility, the nuance.”\n\n“I call my Elphabas ‘vocal athletes’ for sure, because of the control, the colors of their voice they’re using, the range, the flexibility, the nuance.” - Aimée Steele, vocal coach and vocologist\n\nSteele explained how the intervals (the way you shift between two sounds) can especially get you.\n\n“A flat to a D, on ‘through with playing by the rules’ is specifically one of the hardest intervals,” she said, “and so you don’t want to bring a lot of chest-dominant weight or volume there. You want to switch from chest to head.”\n\nAdvertisement\n\nYou’ll hear those phrases a lot when people are describing vocal techniques: Your “head voice” is the higher, softer and more flexible sound that you feel in your head, your “chest voice” is the lower fuller notes that you feel in your chest and your “mix” is what you develop when you learn to shift between these two techniques.\n\n“All of these things, they’re leading up to that riff at the end. If you’re bringing up all this chest weight, singing at a volume 10 the whole time because it’s so much fun to let loose, then you’re not crafting, you’re not having the road map, and by the time you get to that riff — which is a high D, even an E in certain cases — you’re gonna be vocally fatigued,” Steele said.\n\n“Your larynx is going to be too high, and you’re not going to be able to have caught your breath because you’re over-singing. That’s one of the biggest components to not being able to survive through to the end. It’s the runway before the high notes to make sure that you have an easy take-off.”\n\nAdvertisement\n\nFor Steele, all of these components are key to cultivating “vocal wisdom.” Knowing how to develop a “road map” to the song that identifies where you can breathe (in singing, your air really is everything!) and what you’re trying to emphasize emotionally in the story is key. This is how you’ll know that your voice will get you to the big finish.\n\nWhile we aren’t all trying to have a recital moment (though maybe more of us should?!), this same principle is helpful for folks who just want to get through the song. If you know there are parts of the song that just feel really good in your voice or make you happiest to play around in, this can help you really eat up those moments.\n\nLearn how to get into “the pocket” where it feels and sounds good.\n\nSo much of singing is learning where you feel each sound and the air move through your body. And when you’re doing it right, you absolutely feel the difference.\n\nAdvertisement\n\nFor Kristy Cates, another former Broadway Elphaba and current chair of performing arts at New York Film Academy, good, healthy singing “feels like nothing.”\n\n“It feels like pressure in my face, versus my throat,” Cates explained. “I’m not tired, and it’s also way easier to warm up to that place because I’m not trying to think, ‘Oh my vocal cord’s coming together and this and this.’ I’m thinking ‘I feel the F in ‘Defying Gravity’ right here in my face.”\n\nShe said she found that one trick that helped her get into the “pocket” where she could nail the notes she needed was to practice singing with her mouth closed. Citing a Graham Norton interview with Jessi J, she said that it was a great way to learn how to get the sound you want and really feel that correct placement in your body.\n\nAdvertisement\n\n“This really set off this idea for me that we should be able to hit all of the notes with our mouth not open. I mean, like, sure, you’re going to open it. You’re going to do all sorts of stuff to create the sounds you want,” she said. “But the true thing is, is that once you’re in that spot and your muscles understand how to hold it there, it’s a mind game.”\n\nAnother way Cates describes how to move through that final riff is “pulling taffy” or “stretching” into the notes: “It’s like pulling a rubber band, so that it’s not your vocal cord slamming together.”\n\nAnother visualization she uses for herself and her students? “I think of the Eiffel Tower, and I think of a jellyfish swimming upwards in the Eiffel Tower. I know it’s bizarre, but I’m a very visual person, and that’s what I think when I’m singing.”\n\nAdvertisement\n\n“While it is a cry, it is also a release for the character.” - Christine Dwyer, former Broadway Elphaba\n\nSteele also has a “checklist” or “mantra” for her singers taking on big belts that gets singers to a similar place, particularly her Elphabas: “You want fast released air, through an open tube (which is the larynx), through the sinus cavity. You want to send the sound through the top of the head.”\n\nOne way to get your larynx lower and ready for that big belt is to practice a “surprised breath,” Steele said. Like a fun little gasp. “It fills the lungs, it opens up the back space, it lowers the larynx,” Steele said.\n\nAdvertisement\n\nAnd for accessing the sinus cavity, it’s as easy as practicing talking while holding your nose.\n\n“When I want clients to feel the space, not necessarily nasal, closing your nose with your fingers and start talking so you can feel it. All of a sudden, you’re speaking in this more resonant, fuller space. You’re off of the vocal cords and your air is being channeled into the sinus cavity, which is where we are meant to be speaking and singing.”\n\nAnd for that big final riff moment, Dwyer noted that her own challenges as she was first learning the song came from “gripping [her] shoulders and throat so tight that it became only a yell and not a ‘battle cry’ as it is stated in the music.”\n\n“While it is a cry, it is also a release for the character. You have a second to take a deep breath, relax your shoulders as much as possible and allow your neck to be free,” she said. “One of the major things that can hurt a voice is not over singing, but tight muscles around the neck and shoulders. So freeing yourself up as much as possible from that is helpful. I know once I started paying attention to that, the singing of the song got a lot easier.”\n\nAdvertisement\n\nGareth Cattermole via Getty Images Cynthia Erivo's now-iconic take on the \"Defying Gravity\" battlecry riff is just one way to approach the song, experts say.\n\nDon’t be afraid of looking, feeling or sounding stupid.\n\nFor folks who haven’t dabbled in vocal performance before, a good thing to do out the gate is learning to “sing ugly” and get comfortable with feeling (at least temporarily) very silly doing exercises like holding your nose or singing with your mouth open or even singing the song while hanging upside down. Steele even has a sign in her studio for her students that says “sing ugly, care less.”\n\n“That is up there because we walk in as a vulnerable place as singers; it’s our voice, our instrument, and people are judging it. But we’re the ones that judge it the most,” Steele said.\n\nAdvertisement\n\nIn your warm-ups and practices, trying out the closed-mouth singing and nose-holding tricks can really help you get the sound where you want it.\n\nSome other sounds that can be helpful? Getting whiney.\n\nYou can sing that last like “never gonna bring me down” and the riff with a “nyah nyah” sound (or dramatic baby crying “wahs”), Steele explained, and it can help you connect the sinus cavity with your diaphragm on these vowels. She also recommends an exercise she calls the “cat fight” where you can literally put your paws up and let out some whiney “mreow” cat noises.\n\nDwyer said there’s really no winning in “being afraid to move around and look stupid.” “What I always tell my students is that musical theater is whimsical. It is silly, even in its most serious states,” she said. “So there is no need to feel stupid using your body while telling a story through song.”\n\nAdvertisement\n\nUltimately, embrace the story and sing like yourself.\n\nThere have been at least 46 Broadway Elphabas and countless musicians who have taken on this song in their own way. If you, like me in my college dorm a million years ago, listen to a riff compilation, you’ll notice the individual flair and color that each singer brings to the role.\n\nThere’s Cynthia Erivo’s now-iconic rendition, the Idina Menzel riff that started it all, and various others that fans love to listen to and learn. But it’s important not to get too bogged down in trying to sound just like some other performer and not to get discouraged if your voice isn’t doing exactly what theirs does.\n\n“That ending is so iconic, but it really is tailored to each artist, each performer, each storyteller who does it. On Broadway, they have a more specific set of rules that you have to follow because everybody who comes to see the show, they want to get that authentic ‘Wicked’ ending,” Steele said. ”But Cynthia did her own thing on the movie. So I like to start out by saying to my students, ‘Who are you as a singer when you come to tell this story and how do you want to end it?’ Let’s be truthful to your own voice, what your own voice does well.”\n\nAdvertisement\n\nCates added that the story the song is telling really lends itself to performers to interpret.",
  "authors": [
    "Senior Editor",
    "Family"
  ],
  "url": "https://www.huffpost.com/entry/vocal-coach-elphabas-singing-defying-gravity_n_691b74e1e4b0b43a45c17359?origin=home-life-feed-unit"
}