{
  "title": "Fish, cheese or chicken? Ravinder Bhogal’s recipes for warming winter pies",
  "text": "When the temperature takes a nosedive, few things compete with a just-baked pie. Don’t be daunted by social media images of perfect, artistic ones; a pie will taste just as good whether it’s rustically homespun or exactingly decorated and carved. Ultimately, what is more important is the integrity of the ingredients (both the casing and the filling). As pastry or potatoes are such a large part of the equation, invest in the best, and make sure puff pastry is all butter and filo is generously lubricated with melted butter. And, if you’re serving your pie with mash, you want it lump-free, properly seasoned and enriched with butter and cream.\n\n‘Flu-fighting’ filo chicken pie (pictured top)\n\nThis is packed to the brim with ingredients to make you well: anti-inflammatory ginger, turmeric and nuts, warming spices and cranberries, which are a source of antioxidants and vitamin C.\n\nPrep 15 min\n\nCook 2 hr, plus cooling\n\nServes 6\n\n2 tbsp ghee\n\n2 onions, peeled and finely sliced\n\n4 fat garlic cloves, peeled and crushed\n\n1 thumb-sized piece ginger, peeled and finely grated\n\n1 thumb-sized piece fresh turmeric, peeled and finely grated or 1 tsp ground turmeric\n\n1 tsp ground coriander\n\n1 tsp allspice\n\n1 tsp cinnamonNutmeg\n\n8 bone-in chicken thighs, skinned\n\n400ml chicken stock, or chicken bone broth\n\nSea salt and black pepper\n\n100g walnuts or almonds, roughly chopped\n\n50g dried cranberries\n\nZest and juice of 1 lemon\n\n3 eggs, beaten\n\n1 small bunch coriander, finely chopped\n\n1 small bunch tarragon, finely chopped\n\n75g butter\n\n½ tsp ground turmeric\n\n6 filo pastry sheets\n\n\n\nMelt the ghee in a casserole dish or large frying pan over a low heat, then fry the onions slowly for 10-15 minutes, until caramelised. Add the garlic, ginger and fresh turmeric, fry for two minutes, until fragrant, then add the ground spices and a good grating of nutmeg – if you are using ground turmeric, add it now.\n\nAdd the chicken, stir to coat in the onions and spices for two minutes, then pour in the stock and season. Bring to a simmer, then cook, partially covered, for 30 minutes. Lift the chicken out of the pan and leave to cool.\n\nBring the stock back to a boil, then reduce for eight minutes, until slightly thickened; leave to cool for 15 minutes. Stir in the nuts, cranberries, lemon juice and zest, followed by the eggs, to make a rich sauce.\n\nWhen the chicken is cool enough to handle, pull out and discard the bones from the thighs, shred the meat and stir it through the sauce. Stir in the coriander and tarragon and leave to cool completely (I often make the filling the day before).\n\nOnce the filling is completely cool, melt the butter and turmeric in a pan and heat the oven to 200C (180C fan)/390F/gas 6. Brush a 23cm springform cake tin with the melted butter, then brush one sheet of filo with melted butter, lay it butter side up over the tin and push it into the tin to line it, leaving an overhang. Repeat with four more filo sheets, buttering and layering them at different angles so the whole cake tin is well lined.\n\nSpoon the filling into the pastry lined tin, lay over the final sheet of buttered filo to cover the surface, then fold over the overhanging filo to enclose the filling. Brush with the remaining butter, then bake for 30 minutes, until golden and crisp. Remove and leave to stand and rest for 15 minutes, then remove the pie from its tin and serve.\n\nCoconut and curry leaf fish pies\n\nView image in fullscreen Ravinder Bhogal’s coconut and curry leaf fish pie.\n\nA fish pie with a south Indian lilt that will transport you to sunnier climes even when skies are grey.\n\nPrep 20 min\n\nCook 1 hr 30 min\n\nServes 6\n\n200g spinach\n\n2 tbsp coconut oil\n\n1 tsp brown mustard seeds\n\n1 star anise\n\n½ tsp asafoetida (hing)\n\n15 fresh curry leaves\n\n½ tsp cumin\n\n¼ tsp ground cloves\n\n1 red onion, peeled and very thinly sliced into crescents\n\nSea salt, to taste\n\n2cm piece ginger, peeled and cut into julienne strips\n\n1 fresh long red chillies, sliced seeds and all\n\n1 tsp turmeric\n\n400ml coconut cream\n\n2 tbsp tamarind paste\n\n1 tbsp light brown sugar\n\nJuice of 1 lemon\n\n1 handful coriander, finely chopped\n\n450g cod, haddock or other white fish fillets, skinned and pin-boned\n\n200g peeled raw prawns\n\n2 hard-boiled eggs, shelled and quartered\n\nFor the topping\n\n40ml whole milk\n\n40ml double cream\n\n1 garlic clove, peeled and bruised\n\n½ tsp black peppercorns\n\n1 small onion, peeled and studded with 4 cloves\n\n1 bay leaf\n\n1 tsp ground turmeric\n\n750g floury potatoes, peeled and diced\n\n75g butter\n\n2 egg yolks\n\nFirst make the topping. Put the milk and cream in a small saucepan and drop in the garlic, peppercorns, clove-studded onion, bay leaf and turmeric. Slowly bring to a simmer, then turn off the heat and leave to infuse while you heat the oven to 200C (180C fan)/390F/gas 6 and get on with the potatoes.\n\nBring a large saucepan of salted water to a boil, add the potatoes and cook until tender. Meanwhile, steam the spinach for the filling in a colander above the pan of potatoes until wilted, leave to cool slightly, then squeeze out any excess moisture and chop roughly.\n\nDrain and mash the potatoes until smooth, then beat in the butter and egg yolks. Strain the infused milk and cream, discarding the solids, then slowly pour the milk mix into the mash and stir to combine thoroughly.\n\nFor the filling, heat the coconut oil in a frying pan on a high heat. Scatter in the mustard seeds and star anise and, as soon as the mustard seeds pop, add the asafoetida and curry leaves, followed by the cumin seeds and cloves. Turn down the heat, add the onions and some sea salt, and saute until pale and translucent.\n\nAdd the ginger, chillies and turmeric and fry briefly until fragrant. Add the coconut cream, tamarind and sugar, simmer for eight minutes, then take off the heat and finish with the lemon juice and coriander.\n\nPut the spinach, fish, prawns and boiled egg quarters in a pie dish and pour the coconut sauce all over them. Top with the mash, then bake for 30 minutes, until bubbling and golden on top. Serve at once.\n\nThe Guardian aims to publish recipes for sustainable fish. Check ratings in your region: UK; Australia; US.\n\nSupergreens and cheese pot pie\n\nView image in fullscreen Ravinder Bhogal’s supergreens and cheese pot pie.\n\nThe iron-rich mixture of greens and cheese is blanketed in filo pastry that crisps up beautifully. Use any greens you like – chard or turnip tops work beautifully.\n\nPrep 10 min\n\nCook 1 hr, plus cooling\n\nServes 6\n\n320g puff pastry sheet\n\n1 egg, beaten, for the egg wash\n\n1 tsp sesame seeds, to sprinkle\n\n½ tsp fennel seeds, to sprinkle\n\nFor the filling\n\n2 tbsp olive oil\n\n1 onion, peeled and finely sliced\n\n3 garlic cloves, peeled and very finely crushed\n\n200g kale, tough ribs removed and discarded, leaves roughly chopped\n\n200g spinach\n\n250g broccoli, cut into florets, boiled until tender and roughly chopped\n\n4 eggs\n\n60g pine nuts\n\n60g currants, golden raisins or barberries\n\n250g feta\n\n250g ricotta\n\nZest and juice of 2 lemons\n\n150g soured cream\n\n1 handful each of dill and parsley, roughly chopped\n\n1 good grating of nutmeg\n\nSea salt and freshly ground black pepper\n\nHeat the olive oil in a large pan and saute the onion until sweet and caramelised. Add the garlic and, once that’s smelling fragrant, add the kale and cook until it’s softened. Add the spinach, cook until that’s well wilted, then take off the heat and leave to cool.\n\nTransfer the cooled greens to a large bowl and add the chopped broccoli, eggs, pine nuts, currants, feta, ricotta, lemon zest and juice, soured cream, parsley and nutmeg. Season with salt and pepper, then mix thoroughly to combine.\n\nPour the filling into a deep pie dish – I use a 34cm baking dish. Lay the pastry over the top to cover, then press gently all around the edges to seal. Brush with egg wash then freeze for 15 minutes. Meanwhile, heat the oven to 180 C (160C fan)/350F/gas 4. Scatter the top of the pie with sesame seeds, fennel seeds and some flaky sea salt, then bake for 30 minutes, until golden and puffed. Serve with a light, leafy salad.",
  "authors": [
    "Ravinder Bhogal"
  ],
  "url": "https://www.theguardian.com/food/2025/nov/19/fish-cheese-chicken-pie-recipes-ravinder-bhogal"
}