{
  "title": "Scenes from TechCrunch Disrupt 2025",
  "text": "Thanks to everyone who made this year’s San Francisco event what it was — and to the 10,000 of you who filled the halls, made the connections, and left with more than you came with. Couldn’t make it? The images below offer a glimpse into what you missed.\n\nUntil next year.\n\nVinod Khosla, telling attendees he doesn’t buy the argument that powering AI will doom climate efforts. Geothermal energy is nearly here, he said, while fusion remains further out. He also touched on his alignment with President Donald Trump (deregulation) and his disagreement (immigration): “The only thing I will say is this administration won’t last forever,” he said with a grin.\n\nImage Credits:Kimberly White / Getty Images\n\nThat’s Roelof Botha on the stage, and that’s the crowd that came to hang on his every word. The Sequoia partner talked through how his firm picks winners and what government ownership in startups could mean, and warned founders not to get cute with timing, telling them to raise now if they’ll need money six months from now. Bubbles pop.\n\nKevin Damoa of Glīd Technologies, winner of this year’s Battlefield competition, with Battlefield chief Isabelle Johannessen. She and TC’s Michael Schick work with many dozens of startups for months to prepare them for this stage. The hug is earned.\n\nImage Credits:Slava Blazer Photography\n\nRoy Lee, the founder of Cluely, the app best known for its mantra “cheat at everything,” entertains the crowd with his f-bomb-laden take on how to win at marketing. “Every day, people are doing crazier and crazier things, which is why to stand out, you have to do something even crazier.” (Pictured left, Maxwell Zeff, holding his own.)\n\nImage Credits:Kimberly White / Getty Images\n\nIf former Cleveland Cavaliers Tristan Thompson misses the NBA, he’s not showing it. He’s building a business empire and raising pointed questions about the league he left behind. When asked about whether players could manipulate Basketball Fun — a web3 platform that turns NBA players into tradable tokens — he offered a counterpoint: “It’s the same question we ask about referees. Are they not gaming the system?” When moderator Rebecca Bellan pressed whether he meant NBA referees take bribes, Thompson shrugged. “It’s just a question to be asked,” he said.\n\nTechcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | WAITLIST NOW\n\nImage Credits:Kimberly White / Getty Images\n\nOur own Sean O’Kane shares a moment with Wayve co-founder and CEO, Alex Kendall. Kendall may also be smiling because his U.K.-based self-driving startup — whose software acts as “brains for cars” — is in talks to raise a fresh $2 billion from SoftBank and Microsoft at an $8 billion valuation.\n\nImage Credits:Slava Blazer Photography\n\nPhoebe Gates and Sophia Kianni, founders of the AI-powered shopping assistant Phia, dazzled the audience at Disrupt with their enthusiasm for making high-quality, secondhand clothing a lot easier to find. Gates, daughter of Bill and Melinda Gates, was also sporting when asked by moderator Amanda Silberling what her famous parents have learned from her. Said Gates with a laugh, “Hopefully style! I don’t even consider myself that stylish; I just like building in the consumer space, but now I get random emails from my family asking, ‘Should I wear this to this?’”\n\nImage Credits:Kimberly White/Getty Images for TechCrunch\n\nWaymo co-CEO Tekedra Mawakana with TechCrunch’s Kirsten Korosec, fielding questions about autonomous vehicles, including whether society will accept deaths caused by self-driving cars. “I think that society will,” Mawakana said. “The challenge is making sure society has a high enough bar on safety that companies are held to.”\n\nImage Credits:Kimberly White/Getty Images for TechCrunch\n\nKevin Rose talking Digg’s reboot and the future of venture capital (Rose is also a general partner at the early-stage venture firm True Ventures). I’m smiling because that’s what you do when someone won’t answer your questions about a buzzy, wearable startup that’s still in stealth. (We’ll have more on Sandbar soon.)\n\nImage Credits:Kimberly White / Getty Images\n\nHugging Face co-founder Thomas Wolf hydrating between questions about building the future of AI, including as it relates to LeRobot, the Hugging Face project that’s trying to democratize robotics with affordable hardware, open source tools, and shared datasets.\n\nImage Credits:Slava Blazer Photography\n\nFinals judges Marlon Nichols of MaC VC and Aileen Lee of Cowboy Ventures during the last stages of our highly competitive Startup Battlefield. Somewhere off-camera, a founder is sweating through their pitch deck.\n\nImage Credits:Kimberly White/Getty Images for TechCrunch\n\nAaron Levie of Box in conversation with TC’s Russell Brandom. Levie has graced the Disrupt stage numerous times over TC’s 20 years at the center of the startup ecosystem, and he always brings it.\n\nImage Credits:Kimberly White/Getty Images for TechCrunch\n\nNetflix CTO Elizabeth Stone on the streamer’s expanded remit from simple binge-watching to interactive programming (think voting on live shows and gaming via your phone): “It hasn’t changed the way we tell stories,” she told a rapt crowd.\n\nImage Credits:Kimberly White/Getty Images for TechCrunch\n\nTC’s Dominic-Madori Davis talking community building with Tade Oyerinde of Campus, who’s rethinking community college, and Teddy Solomon of Fizz, the anonymous social app that’s spreading across college campuses and occasionally getting banned, which some might view as a badge of honor.\n\nImage Credits:Slava Blazer Photography\n\nA whiteboard of wants: developers needed, contacts offered, deals proposed. We love it when founders lean into old-school tactics. (Some still work!)\n\nImage Credits:Slava Blazer Photography\n\nDavid George, who leads the growth investing team at Andreessen Horowitz, came to the show to talk with Julie Bort about what startups need to weigh as they’re eyeing the public market. It was his birthday, as it turns out; the crowd takes a moment here to celebrate it with him.\n\nImage Credits:Slava Blazer Photography\n\nHere’s San Francisco mayor Daniel Lurie discussing his call with President Trump regarding why not to send the National Guard to the city — a proposal floated by Salesforce CEO Marc Benioff. “What I said to him was what I say to everybody: This is a city on the rise,” Lurie said. “Three days of Disrupt here should prove that.” On whether he made concessions with the deal-making Trump, he was definitive. “No, absolutely not. No ask.”\n\nImage Credits:Kimberly White/Getty Images for TechCrunch\n\nA lot of people come from around the world for programming about how to put their startups together. We covered all the bases on our Builders Stage, which was packed every day, all day.\n\nPost-show elation from TC’s Jessica Barrera, who handled ticketing for 10,000 attendees. She saves our bacon routinely.\n\nImage Credits:Slava Blazer Photography\n\nFor many more photos from the event, visit our Flickr stream.\n\nYou can also find our full video coverage: here is Day 1, Day 2, and Day 3.",
  "authors": [
    "Connie Loizos",
    "Editor In Chief",
    "General Manager",
    "Sarah Perez",
    "Julie Bort",
    "Lorenzo Franceschi-Bicchierai",
    "Ram Iyer",
    "Anthony Ha",
    "Rebecca Bellan",
    "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var"
  ],
  "url": "https://techcrunch.com/2025/10/30/scenes-from-techcrunch-disrupt/"
}