{
  "title": "Biomedical Scientist Answers More Pseudoscience Questions",
  "text": "Transcript\n\nI'm Dr. Andrea Love, biomedical scientist,\n\nand I'm back to fact check false health claims.\n\nLet's answer your questions from the internet.\n\nThis is Pseudoscience Support 3.\n\n[upbeat music]\n\nChamath says, Advice I gave my son,\n\nwhich I need to follow more myself.\n\nRead the ingredients when you buy food.\n\nIf you don't know what it is or can't pronounce it,\n\ndon't buy it and surely don't eat it.\n\nWhether you can pronounce a word or not\n\nhas nothing to do with what the thing is.\n\nI mean, it took me years to figure out\n\nhow to pronounce acai,\n\nand that doesn't mean that it's harmful.\n\nThis is 5R-1S-1,2-dihydroxyethyl-3,4-dihydroxyfuran-25H-one.\n\nNow, if you saw that word on a label,\n\nyou might be scared of it based on Chamath's logic,\n\nbut the colloquial word is just vitamin C.\n\nThe name of chemicals tell scientists\n\nimportant information about them,\n\nhow many molecules are in them, how they're organized,\n\nand their properties.\n\nThis logic about avoiding foods or ingredients\n\nwith chemical names you don't understand or can't pronounce\n\nis just an example of chemophobia,\n\nirrational fear of chemicals,\n\nand this has been a clever marketing ploy\n\nby many in the wellness industry\n\nto scare people away from things\n\nthat have no potential risk to their health.\n\ndecor_throwaway wants to know,\n\nHave you all seen the Dirty Dozen list?\n\nWhat are we supposed to feed our families?\n\nThe Dirty Dozen list is an annual list\n\nwritten by the Environmental Working Group or the EWG,\n\nand they claim it is the 12 most contaminated\n\nconventionally grown fruits and vegetables,\n\nand they're covered in pesticides,\n\nand you should avoid them, scaring people away\n\nfrom very safe and nutritious, conventionally grown\n\nfruits and vegetables that are half the cost\n\nof organic options, in order to direct people\n\nto buy organic versions of those items.\n\nAccording to this year's list,\n\nspinach is the dirtiest of the Dirty Dozen.\n\nThey fail to include the fact that the amount of spinach\n\nyou'd have to eat in order to hit the safety threshold\n\nfor pesticide levels is 145 pounds of spinach.\n\nThis is just two pounds of spinach.\n\nWhat the USDA's annual pesticide residue report\n\nactually says is that in 99% of all sampled foods,\n\nthose trace levels of pesticides\n\nare well below the safety thresholds\n\nfor each of those different substances.\n\n@calleymeans asks, While 40% of modern humans\n\nwill get cancer, our closest relatives, chimpanzees,\n\nrarely get it, despite sharing nearly 99% of our genes.\n\nWhy is that?\n\nWell, Calley, I'll help you\n\nsince you're a wellness industry lobbyist\n\nand have no scientific or medical expertise,\n\nchimps do get cancer.\n\nCancers are diseases of aging, broadly.\n\nIn humans, the median age of cancer onset is 60 years old.\n\nAs you get older, your cells get older too,\n\nand cancer occurs because of mutations\n\nin very specific families of genes.\n\nThere's one tumor suppressor gene called P53\n\nthat is very differently expressed\n\nin people versus chimpanzees, and that's a big reason\n\nwhy more chimpanzees don't get cancer.\n\nBut the biggest reason is that in the wild,\n\nchimpanzees only live to be between 25 and 33 years old.\n\nBut we know that in captivity, when chimps live to 40, 50,\n\nand beyond, they do develop cancer.\n\nGrassfedguru48 wants to know, Genuine question,\n\nwhy has Red dye 40 not been banned?\n\nLiterally everyone knows it's bad for you.\n\nWhy are we willfully allowing poison in our food?\n\nRed 40 is a coloring that's used in a variety\n\nof food, drinks, and medicines,\n\nincluding some gummy candies, medicines.\n\nThey're colored so that people don't misdose them,\n\nas well as meal replacement shakes.\n\nColorings are really important for people's perception\n\nof foods and flavors,\n\nparticularly those with sensory issues.\n\nAnd if you look at the acceptable daily intake\n\nof something like Red 40, in the U.S.,\n\nit's seven milligrams per kilogram per day,\n\nwhich is the same as it is in Japan,\n\nthe same as it is in Europe, the same as it is in Canada,\n\nand the same as it is in Australia.\n\nAnd there's no way that you would be eating\n\nan excess in your daily diet,\n\neven if you only ate red-colored gummy candy\n\nfor your entire daily intake.\n\nWe're not just gonna remove colorings.\n\nThey're going to be replaced with other colorings,\n\nnaturally derived chemicals.\n\nFor example, one of which is cochineal,\n\nwhich is a red coloring that is extracted\n\nfrom scale insects.\n\nSo it's very ecologically damaging\n\nbecause these insects live on certain cacti species,\n\nand they're harvested by farm workers.\n\nThey have high rates of allergenicity.\n\nWe don't have that with Red 40.\n\nAnd on top of that, vegans and people that adhere\n\nto Muslim or kosher dietary habits cannot eat foods\n\nthat are colored using insect-derived coloring.\n\nSo you're not actually solving a problem.\n\nIn many ways, you're making a worse problem.\n\nEast-Illustrator-225 wants to know, What does MAHA mean?\n\nMAHA is the acronym for RFK Jr.'s former slogan\n\nof his failed presidential campaign.\n\nIt stands for Make America Healthy Again.\n\nThe problem is that the whole MAHA platform\n\nand the movement are actually in direct opposition\n\nto what would make us healthier.\n\nWe could be expanding healthcare access,\n\nbut instead we're actually removing that\n\nfrom the most vulnerable people\n\nwith cuts to Medicaid and Medicare.\n\nAnd with unfounded accusations about the harms of vaccines,\n\nwe're seeing resurgence\n\nin many of these preventable diseases.\n\nThey're also trying to cut funding for SNAP,\n\nwhich provides food access and financial support\n\nfor lower-income families.\n\nSo if we really want to address\n\nsome of these chronic illnesses that are the leading causes\n\nof death in the U.S., we might want to continue to develop\n\nnovel and innovative cancer screenings and treatments.\n\nUnfortunately, this current administration\n\njust gutted funding for cancer research,\n\nwhich is certainly going to have the opposite effect.\n\nRobynInWellness says, High-dose vitamin C\n\nis lethal to cancer while leaving healthy cells unscathed.\n\nCancer cells can't survive it. They implode from within.\n\nYeah, none of this is true.\n\nJust like with most pseudoscience claims,\n\nthat nugget of truth that vitamin C is incredibly important\n\nat a small level has been wildly exaggerated.\n\nNow, vitamin C is a water-soluble vitamin,\n\nso if you overdose on it, it will be excreted in your urine.\n\nThe claims that relate to megadosing\n\nor intravenous doses of vitamin C and killing cancer cells\n\nare all based on Petri dish studies\n\nwhere they're growing cancer cells on a piece of plastic\n\nand they're blasting them with vitamin C.\n\nBut you can kill cells on a piece of plastic with anything.\n\nIf you pour pure water on cells\n\nin a Petri dish, they'll explode.\n\nUnfortunately, people who believe this information\n\noften will then forego proven cancer treatments\n\nbefore the cancer progresses to a later stage.\n\nloshed says, I just spent the past hour\n\nreading about why fluoride is bad and freaking out.\n\nFreaking out. Tin-hatting like a mother.\n\nThey're killing us!\n\nGood news is, they're not killing us.\n\nFluoride is everywhere. It's ubiquitous in nature.\n\nDecades ago, some dentists noticed that in areas\n\nwhere people had discolored teeth,\n\nthey had extremely low rates of cavities.\n\nIt was because of naturally high levels\n\nof fluoride in their water.\n\nWe fluorinate water at a very, very small level,\n\n0.7 parts per million.\n\nSo to put that in context,\n\na gallon of water is about 3.78 kilograms.\n\nWe would be adding about 2.6 microliters\n\nof fluoride solution, 1/20 of a drop of water.\n\nIf you tried to drink enough water\n\nwhere you might experience fluoride toxicity,\n\nyou would have to be drinking 357 liters of water\n\nor 94 gallons in a day.\n\nYou would die from water toxicity\n\nway before you would experience\n\nadverse effects from the fluoride.\n\nFluoridated water has over 75 years of data\n\nto show that it prevents cavities\n\nand improves dental health.\n\nThe studies that are cited to suggest that fluoride\n\nlowers IQ or can cause neurodevelopmental issues,\n\nthey're not correcting for other variables\n\nthat can impact the outcome, such as high levels of arsenic\n\nor asbestos in the environment within those communities.\n\nThose exposures can credibly cause\n\nsome of those issues that they're observing.\n\nLotsName wants to know,\n\nSo we should stop giving kids milk at school\n\nbecause of the hormones that are in milk, right?\n\nNo. You don't need to fear milk because of hormones.\n\nThe current body of evidence suggests that among children\n\nwho enter puberty earlier than normal,\n\nit's often linked to obesity or excess adiposity.\n\nIt has nothing to do with hormones in milk.\n\nMilk generally always contains hormones because cows,\n\njust like humans and other animals, produce hormones.\n\nSometimes you might see on the label,\n\nno RBST added to the milk.\n\nThis is referring to bovine somatotropin,\n\na hormone that's already naturally produced by cows.\n\nDairy cows, sometimes they're given\n\nadditional amounts of bovine somatotropin\n\nbecause it can increase milk production.\n\nBovine is the key word there.\n\nThis is a cow-specific hormone.\n\nIt has no biological effect on people,\n\neven if you were to deliberately consume it.\n\nClaims about all sorts of other growth hormones\n\nor sex hormones is just patently false.\n\nEven if there were a biological effect,\n\nif you pasteurize your milk, which you all should be,\n\nit's not gonna have any biological impact.\n\n@driptechh says, I developed EDS and POTS\n\nwithin the year that I got the vaccine,\n\nand my heart health has been in steady rapid decline.\n\nI really urge anyone who thinks mRNA is safe\n\nto really think about why you think restructuring DNA\n\nis any way safe or healthy.\n\nmRNA, particularly mRNA in COVID vaccines,\n\nis not restructuring DNA.\n\nIn reality, every single one of your cells\n\nis producing mRNA at all times\n\nbecause that's how you make proteins.\n\nIn order to do that, DNA is converted\n\nthrough a process called transcription into RNA.\n\nAnd that RNA leaves the nucleus,\n\nthat's a one-directional process,\n\nthen it hooks up with a protein complex called the ribosome\n\nwhere it's converted into an amino acid sequence\n\nthat then folds into a protein.\n\nSo in the case of the mRNA vaccine,\n\nthat vaccine contains the mRNA sequence,\n\nin the case of COVID vaccines, for the spike protein.\n\nThat RNA hooks up with the ribosomes,\n\nand our cells create that spike protein,\n\nwhich then our immune system mounts a defense against.\n\nSo nothing ever enters or approaches the nucleus\n\nwhere our DNA is located to even change the DNA.\n\nPeople who still believe that the mRNA vaccines\n\ncan change DNA often cite this paper from 2022.\n\nThey look at the ability of an enzyme called LINE-1,\n\ninstead of going DNA to RNA, it converts RNA to DNA.\n\nAnd they say that the mRNA in the COVID vaccine\n\nis being converted into DNA.\n\nThey never show that any of that mRNA\n\never interacts with cellular DNA.\n\nBut beyond that, they're using a liver cell line,\n\nmeaning these are cells growing on a piece of plastic,\n\nand these are cancerous,\n\nmeaning they are not behaving normally,\n\nand they express this reverse transcriptase enzyme,\n\nwhereas our healthy cells do not.\n\nSo this model isn't biologically plausible\n\nin the way that these vaccines work in our bodies.\n\nNo other studies have shown anything similar,\n\nand we have orders of magnitude, higher data points\n\nwith actual human clinical data to show that mRNA vaccines\n\nare not changing our DNA, and they're safe,\n\nand they save millions of lives.\n\nIvan Loans asks,\n\nWhy do we have so many kids with diabetes?\n\nWe actually have very low rates\n\nof diabetes amongst children.\n\nOnly 0.35% of people under the age of 20\n\nhave diagnosed diabetes.\n\n86.6% of those are type 1 diabetes,\n\nwhich is an autoimmune disorder where the pancreatic\n\ninsulin-producing cells are destroyed.\n\n0.046% of people under the age of 20 have type 2 diabetes.\n\nThat's not a lot of children with diabetes.\n\nazurricat2010 asks, RFK Jr. removes all members\n\nof CDC panel advising U.S. on vaccines.\n\nHow is this beneficial to America?\n\nIt's not.\n\nThe Advisory Committee of Immunization Practices, or ACIP,\n\npreviously consisted of 17 members,\n\nall of whom were vetted very thoroughly before appointment.\n\nAnd they are an outside, impartial committee\n\nthat reviews FDA and CDC data.\n\nOnly ACIP-recommended vaccines have to legally be covered\n\nby your health insurance.\n\nWell, what RFK Jr. did was he removed all 17 members\n\nof the previous ACIP, and he replaced them\n\nwith eight people of his own choosing.\n\nAnd these include people like Robert Malone,\n\nwho you probably heard of during the COVID pandemic.\n\nBut since then, he's also said that people were hypnotized\n\nby mass-formation psychosis,\n\nthat COVID vaccines killed 17 million people.\n\nJust to be clear, all of those things\n\nthat Robert Malone has said are objectively false,\n\nand he is now one of the members of CDC's ACIP panel.\n\nAnother one would be Martin Kulldorff.\n\nHe was the co-author along, with Jay Bhattacharya,\n\nour head of NIH, of the Great Barrington Declaration,\n\nan opinion piece that basically said\n\nwe should just let COVID run rampant.\n\nYou also have Retsef Levi,\n\nwho has a PhD in operations management.\n\nIt has nothing to do with vaccine science,\n\nregulatory expertise, and he has repeatedly said\n\nthat mRNA vaccines cause serious harm, including death,\n\nespecially among young people.\n\nSo when you have these individuals\n\non what should be our leading advisory panel,\n\nyou can understand why that's not going\n\nto improve the health of Americans.\n\nWhenYoureStraaange asks, How can I avoid\n\nfalling into the traps of pseudoscience?\n\nIt can be really hard to discern pseudoscience,\n\nwhich maybe looks like science\n\nor uses science-sounding language,\n\nbut does not have evidence to support it.\n\nWatch for buzzwords instead of evidence.\n\nSo if you see claims about gut-healing,\n\nimmune-boosting, brain health,\n\nusually those are gonna be followed by products or claims\n\nthat don't have clinical evidence to support them.\n\nCheck your source, but then also check your source's source.\n\nPubMed is often used because it's a repository\n\nof peer-reviewed papers.\n\nBut it's not a fact checker.\n\nIt's basically like a library\n\nthat's storing all these papers,\n\nand it doesn't automatically score them\n\nfor whether they're reliable,\n\nwhether they've been reproduced.\n\nThe best way to be able to discern what's real\n\nand what's not is to go to a trusted expert in that field.\n\nBecause scientists and scientific experts are trained\n\nto pick apart these studies and understand whether\n\nwhat they're saying is actually supported by their data.\n\nThere's never going to be a situation\n\nin which a single paper is going to disrupt\n\neverything we know about a given scientific topic.\n\nAnd if that were the case, it would not be circulated\n\nby a popular press article.\n\nIt would be something that would be\n\ntaking the scientific field by storm.\n\nWasteofspace778 wants to know,\n\nWhat is the obsession with glucose spikes?\n\nThe wellness industry have created this notion\n\nthat non-diabetics should be tracking, monitoring,\n\nand trying to manipulate their blood glucose levels\n\nby wearing what's called a continuous glucose monitor.\n\nIt tracks blood glucose levels after you eat,\n\nbefore you eat, and so on and so forth.\n\nDoing this is not going to offer you\n\nany sort of health benefits\n\nif you don't have type 1 or type 2 diabetes.\n\nNon-diabetic people typically have blood glucose levels\n\nthat range between 80 and 140 grams per deciliter of blood.\n\nThroughout any given day,\n\nyou're gonna have fluctuations within that range.\n\nYou don't actually have to monitor it\n\n'cause your pancreas is already doing it.\n\nCasey Means, for example, founded the company Levels\n\nwhere she sells a continuous glucose monitor\n\nand a list of supplements and a recipe book,\n\nand it costs several hundred dollars a month\n\nto kind of stay on the subscription plan\n\nthat she claims is going to improve your overall health.\n\nThe Glucose Goddess recently launched a supplement\n\nthat she calls Anti-Spike.\n\nThere have been studies where they tracked non-diabetics\n\nwearing continuous blood glucose monitors.\n\nIn 99% of the cases, the blood glucose levels\n\nwere always within that normal excursion range.\n\nThere has been no clinical data that suggests\n\nthat wearing this or trying to reduce the number\n\nor range of these blood glucose excursions\n\nis offering any sort of health benefit.\n\nIt's not preventing the development of diabetes.\n\n@RobertKennedyJc, a commentary account, says,\n\nWhen JFK was in the White House, America was strong,\n\nhealthy, and full of energy,\n\nfree from today's epidemic of chronic disease.\n\nSince then, illness has skyrocketed, draining our vitality.\n\nLet's make America healthy again.\n\nJFK was in the White House in the early 1960s.\n\nSince then, we've actually improved health in a lot of ways.\n\nSee these really thick bars,\n\nthe most predominant causes of death in the early 1900s?\n\nThese were infectious diseases.\n\nTuberculosis, pneumonia caused by bacterial infections\n\nand influenza, respiratory viruses, and viral diseases,\n\nand gastrointestinal infections.\n\nThese are all gone from our causes of death\n\nin the U.S. today, and that's because of vaccines,\n\nsanitation, water treatment, antibiotics,\n\nthe ability to do surgeries\n\nin aseptic environments, blood transfusions.\n\nToday, we deal with mostly diseases associated with aging.\n\nHeart disease, things like atherosclerosis,\n\nheart blockage, cancers,\n\nand cancers are hundreds of different diseases\n\nwith a median age of onset of 60 years old.\n\nSo when we were dying in our 40s, in our 50s,\n\nwe were not living long enough for cancers to even develop.\n\nAnd then we're also dealing with accidents\n\nas a leading cause of death.\n\nWhen were we healthy in these people's estimation?\n\nWhen life expectancy of humans was 47,\n\n31% of those deaths were in children under five.\n\nWell, that was what it was like in the 1900s.\n\nPenicillin, the very first antibiotic,\n\nwas not available until 1945.\n\nSo it might be really appealing to romanticize\n\nback in the day, but the reality is we're living longer,\n\nhealthier, more vital lives today than we were\n\nwhen JFK was in the White House.\n\n@u_dnt_get_it_85 wants to know,\n\nWhat's your take on germ theory denialism?\n\nGerm theory denialism is the false belief\n\nthat diseases are not caused by viruses,\n\nbacteria, fungi, and so on.\n\nThis belief started in the 1800s\n\nby a gentleman named Antoine Bechamp,\n\na counterpart to Louis Pasteur, the founder of germ theory.\n\nAnd Antoine Bechamp believed in something\n\ncalled terrain theory, in that your environment\n\nand your overall physiology determined\n\nwhether you would become sick or not.\n\nIf you're healthy, you won't get measles.\n\nOr if you were taking the right supplements,\n\nyou won't develop cancer.\n\nBut unfortunately, our bodies are a lot more complicated\n\nthan that, and we know these microorganisms\n\nthat cause many of these infectious diseases,\n\nand because we know them, we can either treat them\n\nor we can prevent them through vaccination.\n\nAnd so the fact that there are still people\n\nthat promote this, people like Joe Rogan and Bill Maher\n\nand RFK Jr. and many of their allies,\n\njust goes to show that there's no amount of scientific data\n\nthat's going to get people to concede that their beliefs\n\nand their strongly held opinions are wrong\n\nbecause we've been collecting this data\n\nfor over 200 years now.\n\nSunflowerSeedsO wants to know, Are IV lounges,\n\ndrip bars, therapies a scam?\n\nYes.\n\nJust like all dietary supplements,\n\nIV dietary supplements are also unregulated,\n\nmeaning they do not have to have evidence\n\nof efficacy or even safety.\n\nIV bags can contain some vitamins that you maybe need,\n\nbut they also can contain a lot of things\n\nthat you may not even know.\n\nYou're now allowing an untrained person\n\nin a med spa to put an IV line directly into your vein,\n\nwhich opens the door for opportunistic infections.\n\nWhile many people report feeling better\n\nafter receiving an IV drip at one of these bars,\n\nusually it's because they're getting hydration,\n\nnot because this mystery cocktail of supplements\n\nis offering any sort of health benefits.\n\nEat a healthy diet, eat your fruits and vegetables,\n\nand if you're feeling dehydrated,\n\nmaybe drink some Pedialyte instead.\n\nmirawaaa wants to know, How to convince your family\n\nthat these vaccines are safe?\n\nPlease help.\n\nThe risk of getting into an accident in your car\n\nare actually orders of magnitude higher\n\nthan the risk of an adverse event from a vaccine.\n\nMild adverse events are what we call reactogenicity.\n\nThose are signs that your immune system\n\nis doing what it's supposed to do.\n\nSwollen lymph nodes near the vaccination site,\n\na low-grade fever, some fatigue, sore arm.\n\nSerious adverse events happen very rarely,\n\nless than one time out of every 100,000 doses of a vaccine.\n\nAnd very serious adverse events,\n\nlike an anaphylactic allergic reaction,\n\nhappen around one in 1 million doses of a vaccine.\n\nSo these risks are incredibly rare.\n\nBefore the smallpox vaccine was developed,\n\nwe had over 110,000 cases of smallpox every year in the U.S.\n\nSmallpox had about a 30% mortality rate.\n\nSolely because of the smallpox vaccine,\n\nwe have eradicated smallpox from human existence.\n\nPertussis caused about 175,000 cases\n\nof whooping cough every year.\n\nNow, because of the vaccine, we've reduced it by 89%.\n\nMeasles used to cause millions of deaths globally\n\nevery single year before the measles vaccine,\n\nbut the vaccine globally has reduced measles by 99%.\n\nUnfortunately, because of refusal to vaccinate,\n\nwe're now seeing reemergence of measles.\n\ngodless_mom wants to know, Acupuncture.\n\nWe've had a discussion in our parenting group on Facebook.\n\nSome say it worked for them,\n\nothers arguing from the side of science.\n\nWhat do you think?\n\nWhen you look at robust randomized and blinded\n\nclinical studies, the effect most people are reporting\n\nis more placebo than therapeutic benefit.\n\nNow, it's important to note that acupuncture\n\nis a multi-billion dollar industry,\n\nand while insurance companies often do cover\n\nacupuncture treatments, it's not inherently\n\nbecause there's science to support it.\n\nIt's because there's a market for this practice.\n\nThere's no strong evidence that acupuncture\n\nis going to offer something\n\nthat science-based physical therapy\n\nor musculoskeletal rehab is going to offer you.\n\nBut people often report a benefit\n\nbecause they want to feel a benefit.\n\nBurtRigg asks, Robert F. Kennedy Jr. says beef tallow\n\nis healthier than seed oils.\n\nIs he right? No, he's wrong.\n\nLike he is about most things.\n\nBeef tallow is a type of rendered fat derived from cows,\n\nand it is high in saturated fatty acids\n\nlike myristic and palmitic acid.\n\nWe actually have decades of robust evidence\n\nthat show that a diet high in polyunsaturated fats,\n\nlike those in seed oils, compared to a diet\n\nhigh in saturated fats, like those found in beef tallow,\n\nreduce your risk of heart disease, atherosclerosis,\n\nhigh levels of LDL cholesterol, that's the bad one,\n\nand triglycerides, and actually promote heart health.\n\nA lot of people have been misled to believe\n\nthat the process of extracting oils from seeds is harmful\n\nor it's leading to toxic substances in the seed oils.\n\nAnd that's just objectively false.\n\nThese oils are purified, and any sort of materials\n\nthat are used for the extraction\n\nare not present in the seed oil.\n\nAnd finally, some people claim that seed oils\n\nare inflammatory because when they're heated\n\nat really high temperatures,\n\nthey generate these harmful byproducts.\n\nThese seed oils would have to be heated\n\nto well above 400 degrees Fahrenheit for any of these\n\npotentially harmful byproducts to be generated.\n\nAnd that's not going to be happening\n\nif you're cooking with them or using them in your foods\n\non a day-to-day basis.\n\nSome people promote the use of beef tallow for skincare,\n\nand this all hearkens back to this appeal to ancestry,\n\nbecause the ancestors used beef tallow,\n\na false belief that natural chemicals are better.\n\nAnd so beef tallow, it's a natural fat,\n\nit must be good for your face.\n\nBut science has given us knowledge\n\nof all of these different molecules\n\nthat help to hydrate your face,\n\nreduce aging signs, things like sun damage.\n\nBeef tallow is not gonna replace that.\n\nUwStudent98210 asks, Anybody heard of chlorine dioxide?\n\nYeah, so chlorine dioxide is the same thing\n\nas Miracle Mineral Solution.\n\nThis was promoted by a guy named Jim Humble,\n\nwho was a Scientologist, and he wrote a book\n\nin the early 2000s called, The Miracle Mineral Solution,\n\nwhere he essentially told parents\n\nthat they should feed their children\n\nthis chemical chlorine dioxide.\n\nNow, chlorine dioxide colloquially\n\nis known as industrial bleach.\n\nEven at a relatively low dose,\n\nit can cause severe complications and health issues,\n\nincluding nausea, vomiting, kidney failure.\n\nIt can also interfere with their ability\n\nto transport oxygen,\n\nand it can also cause severe GI distress.\n\nIf you inhale it, it can cause pulmonary edema\n\nor fluid filling in your lungs.\n\nHowever, you have wellness influencers\n\nwho tout it as a cure-all for autism, HIV, cancer.\n\nAll of our scientific and regulatory agencies\n\nexplicitly warn against the use of chlorine dioxide\n\nfor any therapeutic use.\n\nThe problem is, is because this falls into this loophole\n\nof wellness products, people are still able\n\nto find chlorine dioxide,\n\nwhether through industrial chemical supply\n\nor through wellness companies,\n\nand they're using it to cause harm\n\nto themselves or to other people.\n\nric4100 asks, Why are we injecting newborns\n\nwith a vaccine for a disease they can't catch?\n\nSo this is referring to the hepatitis B vaccine,\n\nwhich is given to newborns.\n\nAnd Ric, they can catch hepatitis B.\n\nContrary to the claims of anti-vaccine activists\n\nand our recent surgeon general nominee, Casey Means,\n\nhepatitis B is not just a sexually transmitted infection.\n\nThe hepatitis B virus is spread to children perinatally,\n\nso during the process of birth,\n\nor through direct contact with any bodily fluids,\n\nusually from a close family member.\n\nHepatitis B infection in childhood\n\nleads to chronic hepatitis in 90% of the cases.\n\nAnd chronic hepatitis due to hepatitis B\n\nis the cause of 60% of all liver cancers.\n\nSo you would think that knowing that we could prevent\n\n90% of chronic hepatitis cases in kids\n\nand all the subsequent liver cancers that would result,\n\nwe would be shouting from the rooftops, This is great,\n\nwe're preventing chronic illness, right?\n\nWrong.\n\nUnfortunately, because this has become this battle cry\n\nof anti-vaxxers that we're harming all these newborns\n\nby giving them this vaccine.\n\nBut we didn't always vaccinate against hepatitis B at birth.\n\nIn the 1980s, we had thousands and thousands\n\nof hepatitis B infections every year.\n\nBut in 1991, the U.S. adopted\n\na universal newborn vaccine recommendation,\n\nand since then, we have reduced the prevalence\n\nof chronic hepatitis B to less than 0.1%\n\namong kids under five.\n\nAcute hepatitis B infections themselves has declined by 82%,\n\nand it is incredibly safe and effective.\n\nnzt48nootropics wants to know,\n\nWhy does everyone swear by lion's mane?\n\nLion's mane is touted in the wellness spheres\n\nas a cognitive performance enhancer,\n\nthat it's going to improve focus,\n\nit's gonna improve brain function.\n\nThe problem is, all the evidence to suggest\n\nthose sorts of things have been done in mice\n\nor in cells growing on a piece of plastic.\n\nThere's no actual evidence in humans\n\nthat lion's mane supplements are actually offering\n\nthose sorts of cognitive or brain health benefits.\n\nYou'll often find lion's mane mixed in a cocktail\n\nalong with instant coffee.\n\nAnd so they'll say that the lion's mane\n\nis boosting your focus, but they ignore the fact\n\nthat coffee, which has caffeine,\n\nactually improves your focus.\n\nNow, lion's mane is an edible mushroom,\n\nand mushrooms are a great part of a healthy diet.\n\nBut don't be misled to believe that it's a miracle panacea\n\nthat's gonna somehow reverse normal aging of your brain\n\nor improve your cognitive function,\n\nbecause the data just aren't there.\n\nbrand_air asks, Is it really that bad to eat at night?\n\nFood is food, right? And besides, it's daytime somewhere.\n\nI mean, the earth is forever rotating,\n\nso late night eating could be daytime at any time.\n\nOur bodies function on a circadian rhythm,\n\nmeaning we have these 24-hour sleep-wake cycles.\n\nDuring the day and through the night,\n\nyou have different levels of certain hormones\n\nand signaling molecules that can alter\n\nor change processes that are occurring in your body.\n\nIn the evening, people generally have a little bit\n\nreduced insulin sensitivity, meaning if you ate\n\nthe same exact thing at night that you did\n\nmaybe first thing in the morning,\n\nyour normal blood glucose excursion\n\nmight be slightly higher, but still normal.\n\nIt's not gonna be super impactful.\n\nThe reason that some people experience weight gain\n\nor issues with eating late at night\n\nis because the quality of the food they're eating\n\nis generally calorie-dense, not nutrient-dense.\n\nSo they're eating an excess number of calories\n\nbeyond what they should be eating\n\nfor their overall metabolic rate.\n\nSo those are all the questions for today.\n\nRemember, always verify your sources.\n\nTake every piece of information you come across\n\nwith a grain of salt.\n\nSensational claims always get more attention\n\nthan the more nuanced reality.\n\nThanks for watching Pseudoscience Support 3.\n\n[upbeat music]",
  "authors": [
    "Condé Nast"
  ],
  "url": "https://www.wired.com/video/watch/tech-support-biomedical-scientist-answers-more-pseudoscience-questions"
}