{
  "title": "Bose Ultra Earbuds 2nd Gen review: chunky design, incredible ANC",
  "text": "is a senior reviewer covering TVs and audio. He has over 20 years experience in AV, and has previously been on staff at Digital Trends and Reviewed.\n\nBose has built its modern reputation on noise-canceling performance, offering the best in class for a good two decades, since the launch of the QuietComfort headphones in 2000. But Sony and Apple caught up in 2023 and the race has gone back and forth since. The $299 Bose QuietComfort Ultra second-gen earbuds aim to top the competition again, and this time with improvements to sound and call quality, both of which have been issues for the QC earbuds in the past.\n\nWhile the gap between “great” and “the best” noise canceling has been narrowing with each new earbuds iteration, Bose has somehow continued to improve. The noise canceling of the second-gen Ultra Earbuds is phenomenal. Its attenuation of low-frequency sounds in particular virtually eliminates the distraction of airplane engines, especially with the addition of music or dialogue from a movie.\n\nThe noise canceling also takes the edge off of loud conversations in a cafe or on the street. It doesn’t completely remove the chatter around you (and no noise-canceling earbuds do), but it significantly reduces the sound. And unlike the AirPods Pro 3, the Bose ANC doesn’t have a higher-end hiss. The high level of noise canceling can cause the Bose to feel almost disconcertingly isolating, but is impressive nonetheless.\n\nIf the highest level of noise canceling feels like too much, the Bose app allows for adjustment to the intensity — a control absent from AirPods — with 11 steps, including full on and full off. You’ll need to create a custom listening mode to have adjustable ANC, as the included presets (Quiet, Aware, Immersion, and Cinema) have that option locked, but once you do you can adjust to taste. Adding a preset is easy. Just hit the “+” button in the Modes menu, select from 10 different names — including Commute, Music, and Run — and adjust the noise canceling intensity and Immersive Audio setting. The settings you choose aren’t locked in and can be changed as necessary.\n\nBose has improved the way the QuietComfort Ultra 2nd Gen handle transparency mode, or Aware mode, as it’s called in the app. On most earbuds, including earlier QuietComfort models, transparency mode lets in all the sound around you, making it seem like you don’t have the earbuds in, so you can hear your surroundings and hold conversations. The second-gen Ultra, though, still tamp down low-end frequencies while in Aware mode, which allows your ear to better focus on voices. Hearing a barista’s questions as I order my coffee is easier because the thump of the background music isn’t as present.\n\nBose added wireless charging to the second-gen Ultra Earbuds’ case.\n\nIn previous Bose earbuds, I’ve found call quality to be subpar, struggling with even light breezes. While testing the QuietComfort Earbuds II a few years ago, a car alarm a block and a half away caused the person on the other end of my call to shriek in agony. The second-gen Ultra don’t have those issues, though as the Bose adjusts to outside noises, it affects my vocal quality a bit, so my voice isn’t pristine and clear. The ANC was able to block most of an exceptionally loud sports car that revved its engines as it passed, though it caused a bit of compression that sounded unnatural, according to an audio industry friend on the other side of my call. And when I listened back to a recording I made outside, I could hear the compression adding a raspy quality to my voice. That raspiness wasn’t present in a recording made inside my home where the noise suppression wasn’t needed.\n\nWhile the second-gen Ultra don’t compete with Apple or Sony for call quality, they perform as well as they need to. “The earbuds let you sound like you,” my audio industry friend commented during a call. He could tell from the compression whether I was outside or inside, but it wasn’t a distracting enough change to pull him out of the conversation.\n\nWhen playing music, the second-gen Ultra sound similar to the past few iterations of Bose earbuds. The bass is a bit heavy, and higher frequencies are overemphasized with certain tracks. “Super Bon Bon” from Soul Coughing’s Irresistible Bliss includes lots of metallic, industrial sounds to help build the song throughout, which can get fatiguing at higher volumes. Still, there’s nothing about the Bose sound that’s bad, and the majority of people are sure to enjoy it.\n\nThere are EQ controls in the app, but they’re not that helpful, only allowing 3-band adjustments to bass, mid, and treble. Bringing the treble down while listening to the Soul Coughing track slightly tamed the high end, but it also removed some of the life from the song.\n\nThere’s an Immersive Audio option in the app designed to “enhance and add depth to your content.” Like Apple Spatial Audio, there’s a virtual speaker positioning that can follow your head positioning, so the front of the soundstage is always the direction you’re facing, as with regular audio signals, but with a bit more virtual depth. It can also be static. In that case, turning to your left would move the center of the soundstage into your right ear, as would happen if you were listening to a band at a club and turned to talk to your friend. In either mode, there’s an added depth to the front, but not much beyond that. I preferred it off.\n\nThe second-gen Ultra Earbuds look identical to the first generation.\n\nBose’s earbud design has hardly changed since the QuietComfort Earbuds II in 2022, and that’s their biggest drawback. The QuietComfort Ultra Earbuds 2nd Gen case now supports wireless charging, which is a welcome addition, but beyond that, there’s not a lot of difference. The case is about three quarters of an inch taller than the AirPods Pro 3 case and just over an inch taller than the Sony WF-1000XM5 case.\n\nThe earbuds’ bulbous bodies extend out of the ears and don’t look or feel as sleek as their competitors. The overall shape makes handling them clunky. Even getting a grip to remove them from the charging case can be difficult — an issue I’ve had with the design since it was introduced. The wide capacitive surface for touch controls is prone to inadvertent taps as you reposition. The touch controls can be disabled in the app, but that also removes the convenience.\n\nThe buds come with three tips and three wings to customize the fit, and they stayed secure in my ears throughout testing. They can feel a bit uncomfortable after a few hours, but with a battery life that tops out at six hours — which is just average — long listening sessions will require a charge, allowing your ears to get a short rest. A 20-minute quick charge will get you two hours of listening, while fully charging the battery takes two hours. (The case, which now has wireless charging capability, holds enough charge for up to 18 additional hours of listening, for 24 hours total.) They’re not workout earbuds; they have an IPX4 rating, which is protection from splashing, so be cautious using them for more than light exercise. (The case isn’t rated at all.)\n\nExcellent ANC make the Bose Ultra Earbuds 2nd Gen best for those who travel a lot.\n\nEven without drastic design changes, the improved noise canceling and aware mode performance, better call quality, and addition of wireless case charging keep the Bose QuietComfort Ultra Earbuds 2nd Gen in the discussion as one of the best pairs of noise-canceling earbuds. I’d even put them above the AirPods Pro 3 when it comes strictly to ANC performance (the AirPods are still all-around better, especially for Apple users). Do I wish Bose had updated the design to be smaller and easier to handle, with better battery life? Absolutely. But until then, the Ultra 2nd Gen earbuds are an excellent choice for non-Apple users, frequent flyers, or anyone looking for a break from our busy, noisy world.\n\nPhotography by John Higgins / The Verge",
  "authors": [
    "John Higgins"
  ],
  "url": "https://www.theverge.com/tech/809154/bose-ultra-gen-2-earbuds-review"
}