{
  "title": "US approves $93m arms sale to India amid easing trade tensions",
  "text": "US approves $93m arms sale to India as trade tensions ease\n\nThe move comes as India seeks to diversify arms supplies away from Russia, amid reports that Trump urged it to buy more US-made weapons.\n\nIn October, it led to the signing of a framework agreement to expand defence co-operation over the next 10 years.\n\nIt comes nine months after India's Prime Minister Narendra Modi met Donald Trump in Washington, where both leaders committed to \"advance defence ties\".\n\nThe US has approved two arms sales to India worth $92.8m (£71m), including Javelin anti-tank missiles and Excalibur precision artillery projectiles, the US state department says.\n\nWhile Russia remains India's top source for arms supply, its share has dropped from 62% to 34% between 2017 and 2023 as India shifts toward US procurement.\n\nIndia's defence trade with the US, on the other hand, has surged from near zero to $20bn, making the US its third-largest arms supplier, after Russia and France.\n\nThe Department of State's Defense Security Co-operation Agency (DSCA) said the weapons will \"improve India's capability to meet current and future threats\".\n\nIn a statement it said a $45.7m sale of the Javelin Missile System, including 100 FGM-148 Javelin rounds, one \"fly-to-buy\" missile and 25 lightweight command launch units, had been cleared.\n\nThe package also covers simulation rounds, trainers, spare parts, technical assistance and other logistical support.\n\nIn a separate notification, the department approved a $47.1m sale of up to 216 M982A1 Excalibur tactical projectiles, along with fire-control systems, primers, propellant charges, technical data and repair services.\n\nThe proposed sales would \"support the foreign policy and national security objectives of the United States\" by strengthening its strategic relationship with India, the DSCA said, describing it as \"an important force for political stability, peace, and economic progress\" in the Indo-Pacific and South Asia.\n\nThe DSCA said that India would have \"no difficulty absorbing\" the equipment into its armed forces.\n\nThe development coincides with the two countries trying to close a trade deal and tide over tensions after Trump slapped 50% tariffs on India, including a 25% penalty for buying Russian oil and arms.\n\nBut the tensions appear to be gradually letting up after months of uncertainty.\n\nFollow BBC News India on Instagram, YouTube, X and Facebook.",
  "authors": [],
  "url": "https://www.bbc.com/news/articles/cdeger2k625o"
}