{
  "title": "Riot is shutting down studio behind its Minecraft-like game",
  "text": "is a senior editor and author of Notepad , who has been covering all things Microsoft, PC, and tech for over 20 years.\n\nPosts from this author will be added to your daily email digest and your homepage feed.\n\nRiot Games is closing the studio behind Hytale, its Minecraft-like game that has been in development for nearly a decade. Hypixel Studios, which Riot acquired in 2020 for an undisclosed sum, is shutting down “over the next few months,” according to Hypixel CEO Aaron “Noxy” Donaghey.\n\n“After years of pushing forward, adapting, and exploring every possible path, it became clear we couldn’t bring Hytale to life in a way that truly delivered on its promise,“ says Donaghey in a post on X. ”This is a painful decision. We still believe in Hytale. We believe in the team, and are forever grateful to every member, past or present, who poured their love into the game.“\n\nHytale has been in development since 2015, when Hypixel was founded as a small indie studio by members of a popular Minecraft server network. A trailer was released in late 2018, and Hypixel was supposed to deliver a beta of Hytale in 2021 following the Riot acquisition a year prior. That beta never arrived, and in 2021 there was a major change to the game engine powering Hytale that set development back.\n\n“Our technical ambitions grew more complex, and even after a major reboot of the game engine, the team found that Hytale still wasn’t as far along as it needed to be,“ says Donaghey. ”It became clear we’d need a lot more time to get it to a place where it could support the ambitious vision for the game.“\n\nThe Hypixel closure won’t affect the Hypixel server on Minecraft, which is run separately from Hypixel Studios. Despite the studio closure, Donaghey says he’s “deeply grateful to Riot” and that the team is being “supported with generous severance and resources to help them find what’s next.”",
  "authors": [
    "Tom Warren"
  ],
  "url": "https://www.theverge.com/news/691791/riot-games-hypixel-studios-hytale-closure"
}