{
  "title": "In Norvegia hanno costruito un supercomputer dentro una miniera. Siamo andati a vedere come funziona",
  "text": "Måløy (Norvegia) - Era la miniera di olivina più grande del mondo, ora è il “Fort Knox europeo dei dati” e ospita uno dei supercomputer più green del mondo, sicuramente il più potente della Norvegia. Si chiama Olivia e si nasconde nelle anse di uno dei tanti fiordi di questo Paese, 700 metri all’interno della montagna, sfruttandone il potenziale idroelettrico per funzionare e l’acqua fredda per raffreddarsi.\n\nPer visitarlo occorrono giacche e caschetti, e un po’ di immaginazione per coglierne il livello d’avanguardia: si cammina in corridoi di terra e roccia nuda come i minatori di un tempo, ma ogni struttura a cui si accede custodisce futuro. Dati sensibili, fili ordinati, sistemi di raffreddamento e di protezione unici, per non parlare della nuova arrivata potenza di calcolo con oltre 64.512 core cpu e 304 delle gpu capaci di supportare anche software e linguaggi di programmazione rari e fondamentali per la ricerca. Specialmente in ambito AI e clima.\n\nUn computer di livello\n\nLa stessa miniera che ospita questa scommessa di supercalcolo a basso impatto ambientale, accoglie già un data center con un’efficienza energetica considerevole, certificata da un pue inferiore all’1,15 (indice di efficienza energetica). Costruito nel 2016, infatti, il Lefdal Mine Data Center offre oggi 75 sale sotterranee ben raffreddate dove ospita i dati di chi guarda al nord Europa in cerca di soluzioni sicure e sostenibili al tempo stesso.\n\nTra i clienti più recenti c’è Bnp Paribas, ce ne sono altri tedeschi, ce ne saranno presto altri, man mano che saranno realizzati i nuovi spazi personalizzati. Passeggiando per la avenue principale, al terzo livello della miniera, sia a destra che a sinistra si aprono 14 corridoi trasversali. Tranne i primi due, dedicati ai sistemi di raffreddamento, in questi antri cavernosi stanno sorgendo “spazi bianchi” da 400-700 metri quadrati. Costi e capienza dipendono dai desideri del cliente, tempi di realizzazione anche, ma il massimo è 16 mesi.\n\nAffacciata a questo lungo corridoio centrale, c’è anche Olivia. È dietro un vetro, appare come un neonato in una incubatrice, con le sue file di armadi densi di fili, persi in un grande spazio apparentemente vuoto. È quello che le permetterà di ospitare entro il 2028 tutta l'attuale potenza di calcolo della Norvegia, e in futuro molto di più. “Olivia è un sistema flessibile con il potenziale per significative espansioni, che può ospitare fino a 119.808 core cpu o 224 gpu aggiuntive - spiega Helge Stranden, Senior Advisor hpc & Storage​ di Sigma 2, azienda realizzatrice del supercomputer - e può essere facilmente aggiornata per soddisfare la crescente domanda di potenza di calcolo”.",
  "authors": [
    "Marta Abbà"
  ],
  "url": "https://www.wired.it/gallery/supercomputer-olivia-norvegia-miniera/"
}