{
  "title": "Torna Grande Giove, il video-podcast powered by Wired che dà voce all'innovazione",
  "text": "Dalla teoria della relatività all’arte di far ridere, dai cyberbulli ai content creator: l’innovazione è ovunque e continua. Il video-podcast Grande Giove torna per raccontarla nella seconda stagione powered by Wired ricca di nuove storie, passando dai laboratori di ricerca al palco di spettacoli comici live, senza mai perdere di vista come il digitale che li trasforma.\n\nDi puntata in puntata, ogni ospite accompagna gli ascoltatori a scoprire le tante evoluzioni tecnologiche in corso e dove ci stanno portando. Tutte parleranno di innovazione, ma non sempre di intelligenza artificiale. La vera sfida del Grande Giove e di chi lo ascolta è infatti quella di trovare nuove tecnologie dove non ce le si aspetta e capire su quali grandi promesse scommettere.\n\nDi cosa parla la stagione\n\nNelle oltre 20 puntate di questa terza stagione, Grande Giove ha scelto di raccontare innovazione inaspettata e, a volte, quasi insperata. Nel settore dell’idrogeno, per esempio, scoprendo come può essere prodotto e stoccato in modo sostenibile, sicuro e circolare. Oppure nella mobilità, dove non sempre la soluzione più veloce è la più sostenibile, ma sempre più frequentemente accadrà. Anche il mondo della musica riserva molte sorprese, per non parlare di quello della comicità e dei social network. Parlando con artisti e content creator, si possono trovare alcuni pionieri dell’uso delle tecnologie nella comunicazione capaci di sorprendere e interrogare anche chi fa formazione.\n\nL’evoluzione digitale assumerà forme sempre nuove e le sveleremo un po' alla volta assieme al palinsesto e ai nomi degli ospiti. Le puntate si possono trovare ogni domenica sul sito di Wired e su tutte le principali piattaforme audio, da Spotify ad Apple Podcast ad Amazon Music. Ma non solo: il podcast avrà anche una programmazione video, che potrete recuperare lo stesso giorno sul sito di Wired o su Youtube.\n\nGrande Giove è una serie videopodcast su tecnologia, scienza e innovazione, powered by Wired. Ai microfoni Daniele Ciciarello e Matteo Imperiale. Alla produzione Ludovico Casalone e Federico Meneghini. Il coordinamento editoriale è di Tommaso Perrone e Riccardo Saporiti. In redazione: Marta Abbà, Samantha Colombo e Nicholas David Altea. Supporto YouTube: Martina Bellet. In segreteria: Elena Lotto.\n\nLe puntate\n\nTutte le puntate di Grande Giove.\n\nLa metafisica di Einstein\n\nHa rivoluzionato la fisica e la nostra comprensione dell'universo, tutti lo ricordano per la teoria della relatività. C'è però anche un lato nascosto del genio di Albert Einstein, che oltre allo spazio-tempo ha esplorato anche la dimensione spirituale dell'essere umano. Insieme ai divulgatori scientifici Luigi Civalleri e Massimo Temporelli, un viaggio alla scoperta di un lato tranto affascinante quanto sconosciuto di una delle menti più brillanti che il Novecento abbia regalato alla storia dell'umanità. Dal 12 ottobre.",
  "authors": [
    "Marta Abbà"
  ],
  "url": "https://www.wired.it/article/grande-giove-nuova-stagione-puntate/"
}