{
  "title": "I Cheated At Poker By Hacking A Casino Card Shuffling Machine",
  "text": "Transcript\n\nTo win big in poker, you need skill, luck,\n\nand it helps if you somehow know the cards\n\nin every other player's hands.\n\nI'm a terrible poker player,\n\nbut I teamed up with this casino cheating expert\n\nand this hacker who uncovered a high tech way\n\nto digitally rig this common card shuffling machine used\n\nin casinos across the US.\n\nTogether we designed a scheme\n\nto hack a card shuffling machine.\n\nLet's make some money. I'm in.\n\nAnd win big in Vegas. It's a crazy little hand.\n\nI'm Andy Greenberg.\n\nI investigate the strange, dark,\n\nand subversive sides of technology for Wired.\n\nThis is Hack-Lab.\n\nI cheated at poker by hacking\n\na casino card shuffling machine.\n\nThis experiment takes me to Las Vegas, Nevada.\n\nFor DEF CON, America's biggest hacker conference.\n\nI'm meeting Joseph Tartaro,\n\na researcher and consultant with the security firm IOActive.\n\nJoseph. Hey Andy, how's it going?\n\nTwo years ago I wrote a story for Wired\n\nabout Joseph's technique for hacking card shufflers\n\nto take full control over a poker game\n\nfor perfect undetectable cheating in a casino environment.\n\nAnd in a moment I'll put his technique to the test by trying\n\nto cheat these unsuspecting poker players\n\nin a real game of Texas Hold'em.\n\nBut first I want to understand how the shuffler works.\n\nThis is the Deckmate 2 card shuffler\n\nthat you hacked two years ago.\n\nThis is the most popular card shuffler you're gonna see\n\nin every major poker room.\n\nIt's even used in the World Series of Poker.\n\nIt actually sits flush.\n\nThis is what's next to your knees under the table.\n\nHow does the Deckmate 2 work internally?\n\nLike is it actually the same way\n\nthat I would like take a deck\n\nand riffle shuffle it, like this?\n\nIs it doing that mechanically inside?\n\nNo, actually it has 20, 23, or 26 different shelves\n\nand it will generate a random number.\n\nSo I'll say, okay, this first part I'm gonna process.\n\nI'm gonna put that in position three.\n\nNext one, I'm gonna put that in position 12\n\nand it'll eventually just produce a deck.\n\nIt's really used to make sure\n\nthat the casino just gets more hands an hour.\n\nTechnically the shuffler has the capability\n\nto completely sort a deck in order ace to king every suit.\n\nLet me show you.\n\nSee the door opened here.\n\n[Deckmate whirring] And now we wait.\n\nAnd the dealer just pulls the deck out\n\nof this little container at the top.\n\nCorrect, there's your deck.\n\nYeah, here we go.\n\nPerfectly consecutive now.\n\nSo obviously like if the shuffler can order the whole deck\n\nas a kind of feature that it shows you by default,\n\nthen that means that if you can hack it,\n\nyou can reorder the deck and fully control the placement\n\nof every card, right?\n\nYeah, 100%.\n\nI actually have a fun hand that I could show you\n\nfrom James Bond's Casino Royal.\n\n[dramatic music]\n\nHave you seen the movie Casino Royal?\n\n[Andy] I have.\n\nIn this scenario, Joseph was able\n\nto hack the Deckmate's code\n\nso that it would reorder the deck\n\nso that the dealer would deal out exactly the hands\n\nfrom the poker game in that movie scene.\n\nI will be James Bond in this scenario.\n\n[Joseph] So here we go.\n\n[tense music]\n\n[Andy] The villain in the movie draws a full house,\n\njust like Joseph.\n\n[Joseph] Aces, fours, sixes.\n\n[Andy] The Bond has a straight flush.\n\n[Joseph] Correct.\n\nAnd Joseph had hacked the shuffler\n\nto give me that same winning hand.\n\nYou did this with code alone? Yes.\n\nIn Texas Hold'em, like any kind of poker,\n\nthe winner is determined by who has the best hand.\n\nThree of a kind beats two pair\n\nor a straight flush beats a straight.\n\nIf a player can control the deck order, they can make sure\n\nthat they get the best hand every time.\n\nBut there's one big challenge to that approach to cheating.\n\nSo wouldn't cutting the deck ruin\n\nthis whole like perfect reordering you've done?\n\nYeah, exactly.\n\nNo, you spotted it.\n\nI did not cut the deck here.\n\nSo what if the deck is cut?\n\nWhat do you do then?\n\nI actually have an interesting scenario for you.\n\nI have a mathematically solved deck.\n\nSo if we have four players at the table,\n\nno matter what the person sitting\n\nat the dealer button will always win.\n\nCool, okay, let's see that.\n\n[tense music]\n\nGo ahead and give you the dealer button.\n\nSo the way this works is a computer program was written\n\nto try to solve an order of a deck\n\nthat no matter where a dealer would cut it,\n\nthat position would always win.\n\nIt's a bit counterintuitive,\n\nbut mathematicians have determined the way to order a deck\n\nso that a specific person at the table will have\n\nthe winning hand every time, even if the deck is cut,\n\nso long as you know where at the table they're going\n\nto be sitting.\n\nSurprising that's possible.\n\nSo I'm gonna go ahead and cut the deck\n\nand we can deal.\n\nThat solves deck trick meant Joseph had\n\nactually reprogrammed the shuffler to order all the cards\n\nsuch that no matter where the deck is cut,\n\nI would have the best hand.\n\nIn this case, two pair.\n\nQueens and nine, so you're two pair of beats mine.\n\nSo this does solve the problem of cutting the deck,\n\nbut it does seem like if you kept doing\n\nthat then players would get suspicious like\n\nwhy does this guy keep winning?\n\nWhy does he keep having the best hands?\n\nYeah, 100%, they would start asking questions.\n\nThere's a much better way we can cheat.\n\nThe way the sorting works is there's actually a camera\n\ninside the shuffler and it will read the cards.\n\nAnd it's kind of funny because it's put in there\n\nfor security purposes so that if somebody were\n\nto remove an ace of spades\n\nand add another seven of diamonds,\n\nit would alert the dealer.\n\nIn this case, we're actually gonna take advantage\n\nof there's a camera in there to cheat.\n\n[tense music]\n\nSo this would be our cheating strategy.\n\nTake advantage of the incredible fact\n\nthat there's a camera inside the shuffler.\n\nHack the machine to get access to that camera,\n\nlearn the exact deck order,\n\nand send it via Bluetooth to a phone app.\n\nAfter all, the Stealthiest way\n\nto win in poker is not to have the best hand.\n\nIt's simply to know whether or not you have the best hand\n\nso you can bet or fold accordingly.\n\nWhat was it that led you to wanna hack the Deckmate 2\n\nin the first place?\n\nIt really actually started with a really suspicious hand\n\nin televised poker that just had a lot\n\nof people talking about it.\n\n[Andy] In September of 2022, a scandal blew up the world\n\nof high stakes live streamed poker\n\nin a hand at Los Angeles's Hustler Casino Live\n\na relative novice holding nothing but a jack of clubs\n\nand a four of hearts successfully called the bluff\n\nof a veteran player.\n\nNo player could possibly have thought\n\nthat her weak hand would be good enough to call a bluff,\n\nthousands of outraged poker players argued,\n\nunless the person holding it had some extra knowledge\n\nthat her opponent's hand was even worse.\n\nIn other words, she must have been cheating,\n\nwhich she denied.\n\nThe casino responded with an investigation\n\nwhich concluded that there had been no evidence\n\nof foul play.\n\nBut one little detail in the report\n\nabout the card shuffler stuck out to Joseph.\n\nIt specifically said it could not be compromised.\n\nAnd in my world, when people start saying things\n\nare unhackable or very difficult to do,\n\nwell to us, that's a bait to prove 'em wrong.\n\n[Andy] Joseph and a couple\n\nof colleagues spent months reverse engineering the shuffler.\n\nThey bought their own Deckmate 2\n\nfor testing from a secondhand seller,\n\nand the researcher's hacking technique took advantage\n\nof how detonate shuffler are designed\n\nto prevent their code from being altered.\n\nThe machine's firmware is designed to take a hash\n\nof its code on startup, a mathematical function\n\nthat converts the code into a unique string of characters\n\nand then checks whether that string is different\n\nfrom the known hash value of the unaltered code.\n\nBut Joseph and his collaborators found\n\nthat they could simply change that hash value too,\n\nso that the hash of the altered code matches\n\nand no change is detected.\n\nEven then though, a poker cheating hacker would still need\n\na way to get access to a shufflers internals\n\nto install their code.\n\nJoseph found one, the USB port.\n\nIt turns out that the Deckmate 2 has a USB port\n\nthat often sits exposed under the table.\n\nSo as long as we're able to reach under\n\nand plug this little device into the USB port, we're golden.\n\nSo how does this work?\n\nSo essentially this is just a miniature computer\n\nand what it will do is we'll plug it into the machine\n\nand it will compromise it, rewrite the code,\n\nand start communicating with the cell phone.\n\nSo the way we do that is right here on the back\n\nof the shuffler is a USB port.\n\nSo we could either walk up to a live game\n\nand plug the device in, or if we had access to the device\n\nbefore any player showed up, we could even hide it\n\ninside internally, all we have to do is reach down\n\nand plug this thing in.\n\nThe shuffler shufflers gonna actually be flush\n\nwith the table and the ports are gonna be down by your knee.\n\nIn a poker room, there's so much going on,\n\npeople changing seats,\n\nso it's really common to drop some chips or something.\n\nReach down and just plug something in.\n\nI chose to use this device,\n\nbut we could even use a malicious Android phone\n\nand just plug a phone in. Say we're charging it.\n\nSo you can charge your phone in\n\nthat port in the middle of a game.\n\nYeah, people in poker tournaments will regularly plug\n\ntheir phones into casino equipment.\n\n[Andy] So then how does it help you cheat?\n\nThis device has a Bluetooth module\n\nand it will wirelessly connect to this phone\n\nand every time a deck gets shuffled,\n\nit will get the exact order\n\nfrom the camera and send it to me.\n\nSo then you know the order\n\nafter the deck has been shuffled,\n\nbut doesn't it get cut again?\n\nActually the app solves that problem.\n\nOnce we receive our hand, we can look at it,\n\nenter the details we need and we'll know the order.\n\nIn other words, Joseph's app has a way around the problem\n\nof a dealer cutting the deck.\n\nThe cheater or their partner can enter\n\ninto the app the two cards in their hands.\n\nWith just the knowledge of those cards.\n\nThe app can determine where in the deck\n\nthe dealer has cut to.\n\nThat's enough for the app to tell the cheater every hand\n\nthat the players will end up with\n\nafter all the cards are dealt.\n\nA player messing with their phone in the middle\n\nof a game is often against casino rules.\n\nSo we decided to try a scheme\n\nwhere Joseph looks at his two cards and then folds.\n\nOnce he's outta the game, he's allowed to pick up his phone\n\nand then he can use the app to see who will win\n\nand signal to me how to bet.\n\nThe moment it comes out and I see my two cards,\n\nwe'll know every single person's hand.\n\nWhen Joseph and his team presented\n\nthis vulnerability two years ago,\n\nI reached out to the manufacturer,\n\na firm called Shuffle Master.\n\nA spokesperson for Shuffle Master's parent company,\n\nLight & Wonder, told me at the time\n\nthat Joseph's hacking technique was unrealistic\n\nin an actual casino setting.\n\nThe company didn't even mention whether a plan\n\nto fix the shufflers security vulnerabilities.\n\nAs we prepared to test out how a hacked shuffler can\n\nin fact let a player cheat in a real game of poker.\n\nAs you'll see in a moment.\n\nIt's a crazy little hand.\n\nI reached out to the company again\n\nto see if they had fixed their security flaws\n\nin the two years since they were revealed.\n\nThis time, a spokesperson for Light & Wonder responded\n\nand said they've now patched those security flaws\n\nin virtually every shuffler in use in casinos today\n\nby updating their firmware.\n\nBut Joseph was still skeptical.\n\nAfter all, the machines have no mechanism\n\nto receive software updates over the internet.\n\nThey would need a technician to go\n\nand apply a firmware update.\n\nNow maybe that happened, they could also just be implying\n\nthat they disabled the USB port,\n\nbut in reality we could use the ethernet port.\n\nThere's a number of ways to pull this off\n\nand even if they do that, that does not fix the issue\n\nof a maintenance person pulling this off.\n\nBecause once you have access to the internals,\n\nit's kind of game over.\n\nTo get another opinion about this, I spoke to Doug Polk,\n\na YouTuber and cardhouse owner in Austin, Texas.\n\nSo these shuffle machines,\n\nI've seen them all over the place, frankly.\n\nI've seen them from the largest,\n\nmost legitimate established casinos all the way down\n\nto people's home games.\n\nSo Doug, how do you feel\n\nabout the Deckmate 2 card shuffler?\n\nLike do you trust this thing?\n\nThe Deckmate 2 in a casino location\n\nyou shouldn't be too scared of.\n\nThey have all these casino contracts,\n\nso they have licensed people fixing problems\n\nthat there might be.\n\nThe problem is once someone has a Deckmate 2\n\non a black market or a secondary market,\n\nthey're now no longer being upkept by the company itself.\n\nSome guy is just basically in the back fixing the machine\n\nand then putting it on the table.\n\nI have heard so many cheating stories\n\nof people using these to cheat players out\n\nof their money when it's not happening at a casino location.\n\nIn fact, I've even heard of stories\n\nwhere at major casinos there were issues at play\n\nwith the Deckmate 2.\n\nIf there's a camera that knows the cards,\n\nthere is always some kind of underlying threat.\n\nCustomers are gonna be essentially at the mercy\n\nof the person setting up the machine.\n\nWhat if you like show up to somebody's private game\n\nor you're in an unlicensed cardhouse of some kind\n\nand you see that there's a Deckmate 2 being used,\n\nwhat do you do?\n\nIf you're showing up in a private game\n\nand there's a shuffler?\n\nI would say you should run for the hills.\n\nWe weren't given permission by any casino\n\nto replicate the test on their property.\n\nSo we're going off the strip to set up a private game\n\nin a casino-like environment,\n\na dealer training school in Las Vegas\n\nwhere I'm going to play against real players who don't know\n\nthat the odds are stacked against them.\n\nBut before we try this experiment, I need a game plan\n\non how to cheat like a pro.\n\nSo I went to see Sal Piacente,\n\na security consultant who advises casinos on cheating.\n\nSo how are people cheating in casinos in the real world?\n\nDepends on the game.\n\nYou know in dice you're switching dice, you're sliding dice.\n\nIn baccarat you're doing false shuffles\n\nwhere a dealer has a mix of cards.\n\nThere are so many ways of cheating at poker.\n\nHow do you deal with the fact\n\nthat the deck's gonna get cut?\n\nWell, there's a way beating the cut.\n\nThey call it a pass.\n\nSo a pass looks like this.\n\nI just set the deck up.\n\nThere's my jack of spades on top.\n\nSo now you would cut the deck.\n\nWhen you cut that jack of spade now goes\n\nright into the middle.\n\nSo now when I get ready to deal...\n\n[cards flicking]\n\nI don't know, how did you do that?\n\nIt's a pass.\n\nI actually recut the cards.\n\nI'll do it face up so you can see it.\n\nWhen you cut the cards, I complete the cut,\n\nbut I leave it sticking out just a little bit in the back.\n\nWhen I square the deck up, I get a break above it.\n\nAnd then real quick, I just transpose those two halves.\n\n[Andy] Oh my god, that was so slick.\n\nI really didn't catch that the first time at all.\n\nI see a lot of surveillance footage in poker\n\nyou're switching cards with another player,\n\nyou're marking cards,\n\nyou have the deal doing false shuffles.\n\nWhat is a false shuffle?\n\nI'll just give you a quick example of one card.\n\nThe jack of spades.\n\nI want to keep that card on top.\n\nIf you shuffle this way in the hands,\n\nthis is an old style of shuffle\n\nwhere they were shuffling just like this\n\nand this deck, it looks like it's getting mixed\n\nand I'm only controlling one card here.\n\n[cards flicking]\n\n[Andy] And that card never moves?\n\nNo, well it did move, but I'm keeping track of it.\n\nIt goes to the bottom, back to the top.\n\nAll these devious ways that dealers can cheat\n\nis one reason casinos have started\n\nto use shuffling machines in the first place.\n\nAutomating the shuffle takes\n\nthe dealer's motivations outta the equation.\n\nHave you heard\n\nabout people rigging Deckmate 2 shufflers to cheat?\n\nWell, it's happening a lot in private games.\n\nI've never heard of being done in the casino.\n\nAnd what about cardhouses in, you know,\n\nTexas or other states where you might have\n\nthese gambling establishments that are not regulated\n\nin the same way they are here in Vegas?\n\nAnything goes. [chuckles]\n\nThen anything goes.\n\nHave you talked to people who have done it?\n\nCorrect, so these cheaters were able to get the machines\n\nand gaff 'em before they hit the table.\n\nI personally have never heard\n\nof it being done in the casino.\n\nHowever, if there's money involved,\n\nbelieve me, someone's staying up late at night\n\nto figure out how to steal that money.\n\nSo there seemed to be a lot of ways\n\nto compromise a card shuffler before a game,\n\nbut that was only half of our scheme.\n\nNow I needed a way to communicate\n\nwith Joseph secretly during the game.\n\nA system of signaling with my cheating partner.\n\nThe number one scam that happens\n\nin poker rooms every day\n\nthroughout the world undetected is signaling.\n\nHow do you send these covert signals?\n\nThere's a couple of ways of doing it.\n\nFor example, a common gadget in the old days would be this.\n\nThis is called a thumper.\n\nAnd what happens is you would wear this on your body\n\nand this would go up to your thigh.\n\nI'd have this like down my pant leg or something?\n\nCorrect. Right.\n\nAnd then this would be in my shoe\n\nand this would be on my big toe.\n\nAnd when I want to give you a signal, I just press down\n\nand that'll vibrate in your hand.\n\n[Andy] Yeah, in the movie Casino\n\nthere's a really clear example of a cheating team using\n\na thumper and getting caught.\n\n[stun baton zapping] [man grunting]\n\nI needed a more subtle approach.\n\nSo what are some other innovative ways\n\nthat you've seen people cheat?\n\nAnother innovative way where people communicate\n\nis a device that looks like this.\n\nThis is a loop that goes around your neck.\n\nAll this wiring is underneath your clothing.\n\nThis goes through a hole in your pants\n\nand plugs into your iPhone.\n\nAnd then, I dunno if you can see that,\n\nthat's the earpiece. That is tiny.\n\nThis little thing goes in your ear?\n\nYeah. This is an earpiece?\n\nI would take it like this\n\nand before you go onto the casino floor,\n\nyou just take it and now it's right next to my eardrum.\n\nAnd now when my partner is talking to me,\n\nI can hear her like a third voice in my head.\n\nThat's crazy, Sal.\n\nI feel like I was told in kindergarten not\n\nto do this kind of thing.\n\nSo how do you actually get it out then?\n\nThere only one way to get that out with a magnet.\n\nWow. And you could see...\n\nThere it is.\n\nBut I wasn't sure if this voice in my ear approach\n\nwould work an our cheating scenario.\n\nI needed a partner at the table\n\nwho could see the cards in their hands,\n\nenter a couple of them into an app\n\nand then silently tell me what to do.\n\nSo I laid out our whole scheme to sell.\n\nOkay, so we're actually gonna do this.\n\nWe are going to set up a game with unsuspecting players.\n\nWe're gonna hack the Deckmate 2 shuffler\n\nand we'd love your advice about how to do this\n\nso we don't get caught.\n\nOh, I'm definitely interested in being involved in this.\n\nI'd love to introduce you then to Joseph Tartaro,\n\nwho is our hacker here. Hi, Sal.\n\nHey. So nice to meet you.\n\nPleasure, my pleasure. Thanks for having me.\n\nWe'd appreciate your advice about how\n\nto actually pull this off.\n\nIs the machine telling you who's gonna win?\n\nIt's going to tell every hand in rank\n\nof which seat's going to win.\n\nSo Joseph is gonna have on his phone\n\nan app that he created.\n\nThe Hack Shuffler is gonna transmit the full exact deck\n\norder to his phone.\n\nI need to be able to communicate\n\nto him if he has the top hand to stay in\n\nor just fold right now.\n\nI'm an absolutely terrible poker player.\n\nI'm gonna depend entirely on Joseph to tell me what to do\n\n'cause he's my cheating partner.\n\nThe question is how should he signal?\n\nChips, how many chips in your hand.\n\nCould the signal be raise, fold, call?\n\nYeah, if you just play with one chip\n\nthat's telling him to fold.\n\nTwo chips, that means call.\n\nYou play with all your chips, that means raise.\n\nSo this would be our signaling system.\n\nJoseph picks up one chip, I fold.\n\nTwo, I call.\n\nThree, I raise.\n\nYou're an experienced poker player.\n\nI'm not.\n\nI would like to be told like exactly what to do\n\nlike an idiot poker robot.\n\nThree chips, three commands,\n\nand I will just follow it like a computer\n\nthat you're programming.\n\nYou think that'll work?\n\nWhy not?\n\nLet's give it a try.\n\nLet's make some money. I'm in.\n\n[Andy] And now it's time to test\n\nif Joseph's exploit can be pulled off\n\nin an actual high stakes game of Texas Hold'em.\n\nAnd Sal will be watching us on monitors in another room.\n\nAs we settle into our places at the table\n\nand mentally run through everything\n\nto make sure we're straight,\n\nJoseph's USB hacking device is in place.\n\nHe has the app running on his phone.\n\nWhen everything was ready we brought in\n\nour unsuspecting poker players,\n\na couple of friendly Las Vegas locals,\n\nnamed Elle and Fernando.\n\nThey're unaware of the experiment,\n\nthat Joseph and I know each other,\n\nor that anyone will be cheating.\n\nThe dealer pulls a freshly shuffled deck\n\nfrom the Deckmate 2 and cuts it.\n\nIt's time to play.\n\nMy strategy at the moment will be\n\nto look at my two cards fold,\n\nand then I can pull out my phone, enter the details I need,\n\nand then I can start signaling to Andy\n\nand make sure that he wins as much money as we can.\n\nIt's up to you. [tense music]\n\nAnd I'm folding. Fold, okay.\n\n[Andy] Early on I could see\n\nour Hack Shuffler cheating system was working.\n\nJoseph folded, picked up his phone\n\nand started playing with three chips in his hand.\n\nHe was signaling to me to bet.\n\nSo it's up to you.\n\nCheck, Andy?\n\nI think I will actually bet.\n\nSix to stay in.\n\nHe's playing. Six to stay in.\n\nYeah. Okay. [tense music]\n\nTurn these. [tense music]\n\nOkay. Hold that.\n\nSix. [tense music]\n\nAction to you.\n\nOkay, check. Check.\n\nSix. I don't like it.\n\n[chuckles] I fold. [tense music]\n\nIt's all yours. All yours, buddy.\n\n[Andy] And sure enough, I won the hand with a straight.\n\nMoney is not real.\n\nI'm still sweating though, I dunno why.\n\nEven though I was cheating or maybe because I was cheating,\n\nI found I was incredibly nervous.\n\nOn other hands, Joseph and I flubbed our communications.\n\nAt one point, I misread his signal\n\nand folded when I had a winning hand\n\nand he looked at me like I was an idiot.\n\nI'll fold.\n\nI'll fold.\n\nI'll fold.\n\nI'm out.\n\nMore than an hour into our three hour game,\n\nI kept drawing nothing but bad hands.\n\nI'll fold. [tense music]\n\nJoseph this loosening up.\n\nIt was clear to me that even though I had a hacker\n\non my side, luck was not.\n\nAfter all, we hacked the shuffler to let me know\n\nwhen I had a good hand not to actually deal me one.\n\nFernando on the other hand, seemed to be on a hot streak.\n\nJust from paying antes and folding on all my losing hands.\n\nMy pile of chips was dwindling and his was growing.\n\nTo make matters worse, Joseph forgot at one point\n\nthat he was supposed to signal to me with his left hand\n\nand I couldn't see how many chips\n\nhe was holding in his right hand.\n\nI had to not so subtly remind him.\n\nJoseph, are you left-handed?\n\nHmm? No. Okay.\n\nWere the other players onto us?\n\nWould Sal, who was on the security cam,\n\nspot what we were doing?\n\nMost worrying of all,\n\nit started to seem like I might cheat and still lose.\n\nAfter more than an hour of watching my stack\n\nof chips shrink, I finally got the hidden signal\n\nfrom Joseph to raise.\n\nI could see this might be my last chance,\n\nand Fernando feeling confident,\n\nseemed ready to match my bets.\n\nI went all in. [tense music]\n\n10, 8, what do you have? Ace high.\n\nSome pretty hands, but... All work.\n\n[Joseph] Getting spicy over here.\n\nYou see the ace and you're just like,\n\nNah, I'm not faulting this thing.\n\nWas just feeling lucky. Nice hand.\n\n[Andy] A few minutes later, thanks to Joseph's signal,\n\nI called a big bet from Elle.\n\nThat's 40,000. Even if I didn't go...\n\nI think that's the rest, she's all in.\n\n[Joseph] You're kind of all in on the next hand anyway.\n\nYeah. [tense music]\n\nWhat you guys got?\n\n[Elle groans] Pair of fours, take it.\n\nYou weren't scared of the jack, huh?\n\nNo. All right, thanks guys.\n\nThank you, Elle. Good luck.\n\n[Joseph] Thanks for all the money. [chuckles]\n\nNot long after that I got the signal\n\nfrom Joseph to bet big again.\n\nI'll do 40. 40,000.\n\nSpicy game. [Fernando chuckles]\n\nI'll call that. [tense music]\n\nYou can do whatever I want, right?\n\nYeah, pretty Much. So I'll make it a hundred.\n\nHundred thousand's the bet. [tense music]\n\nYikes, here we go. The moment of truth.\n\nIt's a crazy little hand.\n\nI'm gonna do another hundred thousand.\n\nAnother a hundred thousand. You guys are aggressive.\n\nRight. All right.\n\nYou're calling too? Yeah, I'm calling.\n\nHe's calling. What do you guys have?\n\nWhen the cards came out, Fernando had a pair of aces,\n\nbut I had surprised him with a straight on the river.\n\nA pretty shocking hand that nearly cleaned Fernando out.\n\nYou got so lucky.\n\nWere you bluffing the whole time?\n\nHe got lucky at the end.\n\nI'm sorry, that was kind of ridiculous.\n\nI owe you an apology, but I'll take it.\n\nIt's the semi bluff.\n\nYou know you bluff until you make it.\n\nBefore long... Go all in.\n\nAll in. [tense music]\n\nIt was all over.\n\nTwo pair. [tense music]\n\nAnd that's that.\n\nYep, it was time to bring Elle back in and come clean.\n\nWelcome back.\n\nI have to confess, both of you are far better poker players\n\nthan I am and I was cheating this whole game.\n\nI guess the question is, can you tell how I was cheating?\n\nI did not tell anything that was up.\n\nMaybe you looked at your phone a couple times.\n\nI don't know.\n\nActually it was Joseph who was looking at his phone.\n\nIt was the shuffler.\n\nThe shuffler was hacked.\n\nIt transmitted via Bluetooth,\n\nthe exact order of the deck to Joseph's phone.\n\n[chuckles] Wow.\n\nHe was then signaling to me whether I should bet\n\nor fold because honestly I'm a terrible poker player.\n\nI have no idea what I'm doing.\n\nAfter our players left,\n\nwe brought in Sal to get his thoughts.\n\n[chuckling] That was fantastic.\n\nHow's it going? Gentlemen, that was great.\n\nIt worked beautifully.\n\nYou're a dangerous individual, my friend.\n\nI wouldn't want to be against you.\n\nSal, you have seen thousands of hours\n\nof actual surveillance footage,\n\nincluding of people cheating.\n\nWatching this as you were this whole time.\n\nHow do you think this rates?\n\nLike what did you think of this as a scam?\n\nI thought it was right on top.\n\nI mean, there's nothing to see.\n\nWe were playing it very aggressively.\n\nIf we had had more time and just like played\n\nmore conservatively with a smaller edge,\n\nI think it could have been even stealthier, right?\n\nTotally, totally.\n\nThere's no doubt this would've went on undetected.\n\nThe real story here isn't just about cheating at poker,\n\nit's about trust.\n\nAs we add more digital smart components to everything\n\nfrom our household products to cars to medical devices,\n\nall of it becomes more vulnerable\n\nto surveillance and manipulation.\n\nIf a smart card shuffler can let a hacker rig\n\na game of poker, it's worth asking,\n\nWhat other digital devices in our lives might be a risk?\n\nWho else can manipulate the machines around us\n\nto get an unfair advantage?\n\nAnd it's worth remembering that sometimes\n\nthe old analog approach can even the odds.\n\n[bright music]",
  "authors": [
    "Condé Nast"
  ],
  "url": "https://www.wired.com/video/watch/hacklab-i-cheated-at-poker-by-hacking-a-casino-card-shuffling-machine"
}