{
  "title": "Josh Allen sacked eight times as late interception dooms Bills in loss to Texans",
  "text": "Little went right for Josh Allen in a frustrating game Thursday night against the Houston Texans.\n\nAnd still he came close to willing the Buffalo Bills to a victory before an interception in the final minute sealed their fate in a 23-19 loss.\n\nAllen took consecutive sacks on the Bills’ final possession, leading to a fourth-and-27, but Buffalo (7-4) gained 44 yards on a short pass from Allen to Josh Palmer, who tossed a lateral to Khalil Shakir.\n\nAfter a false-start penalty created a fourth-and-6 for Buffalo (7-4), Calen Bullock picked off Allen’s pass at the Houston 9 with 24 seconds left.\n\n“We had a chance to win it there at the end,” Allen said. “We did a good job of staying in it and our defense bailed us out a couple of times. We’ve got to find a way, and we didn’t.”\n\nIt was tough for Allen to get anything going on a night he was sacked a career-high eight times and hit four other times. Allen threw for 253 yards with two interceptions and no touchdowns after accounting for six touchdowns in a win over Tampa Bay last week.\n\n“When they hit our quarterback 12 times, I don’t like that,” Bills coach Sean McDermott said. “I don’t like that stat at all. It’s just not a healthy way to play and it’s not a good way to keep our quarterback healthy for the rest of the season. We’ve got to play better.”\n\nAllen was slow to get up after a sack in the first half. He said he was OK and that his left shoulder “went a little numb” after he landed on it awkwardly. He was asked about being hit so many times on Thursday.\n\n“It’s not fun,” he said. “I ran into a couple myself. I’ve got to be better at throwing the ball away. Too many times, I was going backwards.”\n\nAllen lost 70 yards on the eight sacks. Will Anderson Jr. had two and a half sacks to lead the Texans. His second one came when he almost took Allen down near the line of scrimmage, but he wriggled away and Anderson got up and chased him across the field to drop him for an 18-yard loss to force a punt early in the third.\n\nThe Bills played for a second straight game without receiver Keon Coleman after he was again a healthy scratch after he was late to a team meeting before their last game. He was previously benched for the first series of a loss to New England in Week 5 after also being late for a meeting.\n\n“Nothing new. We’re just taking it one day at a time,” McDermott said. “I thought he had a better week, but we’re taking it one day at a time. It wasn’t that it wasn’t thought about, but we went with the guys that give us the best chance.”\n\nShakir led the Bills with eight receptions for 110 yards and James Cook had 116 yards rushing and a touchdown.\n\nAllen was disappointed that the Bills couldn’t make plays down the stretch.\n\n“Ultimately, we’ve got to execute, and we didn’t do a good job of that tonight,” he said. “Whatever situation and whatever circumstance, we’ve got to find a way, and we didn’t.”",
  "authors": [],
  "url": "https://www.theguardian.com/sport/2025/nov/21/nfl-bills-texans-josh-allen-sacked-eight-times-interception-loss"
}