{
  "title": "David Tennant and Siobhan Finneran star in third series of Jimmy McGovern’s award-winning drama Time",
  "text": "The BBC have announced the third series of Jimmy McGovern’s BAFTA-winning hit drama Time, set in a young offenders' institution. The three-part drama will be led by David Tennant (Rivals, Thursday Murder Club) as Prison Officer Bailey with Siobhan Finneran (Happy Valley, Out of the Dust) reprising her role as Marie-Louise, a prison chaplain.\n\nTime series three is written by multi-award-winning screenwriter Jimmy McGovern (Unforgivable, Cracker, The Street) and Samuel Bailey (Shook). It is made by BBC Studios Fiction for BBC iPlayer and BBC One, in co-production with BritBox. Filming will take place in Belfast.\n\nSet within a Young Offenders Institution, the series will explore the impact of locking up teenagers and the effects on those who look after them.\n\nPrison Chaplain Marie-Louise comes to the YOI having lost her faith. When tragedy strikes within the prison, Marie-Louise clashes with veteran officer Bailey, a man in the midst of his own crisis. Bailey knows more about the circumstances that led to this major incident – but will he come clean before the guilt gets too much?\n\nMeanwhile, two teenage young offenders, Peter and James, struggle through the terrifying first weeks and months of their incarceration. Can James ever face his broken parents after an unforgivable act of violence and will Peter tell the truth about the death of an innocent man, or does family loyalty mean more? An unlikely friendship between them looks to shift the trajectory of their futures, but in an increasingly unstable environment, is change ever possible?\n\nSeries creator and writer Jimmy McGovern says: “Siobhan Finneran is back! And we've got a wonderful leading man in David Tennant. And a brilliant director in Paul Whittington. I think it's going to be wonderful.”\n\nAndrew Morrissey, Executive Producer for BBC Studios Fiction says: “It is a privilege to be making a third series of Time with such a fantastic team. We are excited to introduce the audience to a whole new part of the prison system. Once we started the research, we knew there were stories that demanded to be told.”\n\nLindsay Salt, Director of BBC Drama, says: “Jimmy McGovern is a master at creating brave, thought-provoking dramas that deeply resonate with BBC viewers, so we are thrilled to be back for a third run of Time. With David Tennant and Siobhan Finneran leading the cast, Samuel Bailey co-writing, Paul Whittington directing and the team at BBC Studios Fiction producing, we are all set for another powerful and memorable piece of work from Jimmy.”\n\nRobert Schildhouse, President, BritBox says: “BritBox is committed to delivering great television to our subscribers, and Time is a perfect example of that promise. We’re excited to partner with the BBC on this next chapter of the acclaimed series, featuring David Tennant and Siobhan Finneran in roles we know will be powerful and unforgettable. With Jimmy McGovern and Sam Bailey’s masterful writing and an exceptional cast coming together, this third season will be a must-watch.”\n\nTime series three (3x60’) is a BBC Studios Fiction production for BBC One and BBC iPlayer, co-produced by BritBox for North America with support from Northern Ireland Screen. The series is written by Jimmy McGovern and Samuel Bailey, directed by Paul Whittington (This Town, The Crown) and produced by Amanda Black (Blue Lights, World on Fire). The executive producers are Josh Cole, Andrew Morrissey and Michael Parke for BBC Studios Fiction, Lucy Richer for the BBC, Jon Farrar and Jess O'Riordan for BritBox, and Jimmy McGovern. BBC Studios is handling global sales. Time series one and two are available to stream on BBC iPlayer and BritBox.\n\nMF3\n\nFollow for more",
  "authors": [],
  "url": "https://www.bbc.com/mediacentre/2025/time-series-three-david-tennant-siobhan-finneran"
}