{
  "title": "Fundraisers warn of ‘catastrophic’ drop in donations to Gaza since ceasefire",
  "text": "Fundraisers collecting for Palestinian civilians in Gaza are seeing a “catastrophic” drop-off in donations since the ceasefire was announced in October.\n\nDonations collected by volunteers and funnelled to needy families living in temporary shelters and struggling with illness, hunger and malnutrition have been harder to raise since then, according to organisers, many of whom have been running volunteer initiatives for Palestinians in Gaza on third-party crowdfunding platforms over the past two years.\n\nMegan Hall, based in Australia, runs 95 such mutual aid funds across social media accounts for individual families in Gaza, and has raised more than $200,000 (£152,700) since February 2024.\n\nHall said that although donations started slowing down in September, they declined significantly after the 10 October ceasefire came into effect. During the war, Hall said she was consistently able to send about $5,000 a week to people in Gaza. For the month of October, she said she raised just over $2,000 across all of her campaigns.\n\n“The drop in donations is catastrophic. It feels like with the so-called ‘ceasefire’ the world thinks Palestinians don’t need our help any more,” Hall said.\n\n“Mutual aid has kept people alive for two years. And now going into winter, and having been displaced so many times, many don’t even have winter clothing or blankets.”\n\nFour other mutual aid fund organisers told the Guardian they had also seen sharp drops in the money coming in across their campaigns in the past month.\n\nUnlike mainstream or grassroots humanitarian organisations with large state and private donor bases, mutual aid funds rely on small donations, with volunteers using social media to raise visibility of Palestinians – who, when internet access and battery power permit, have also been using social media accounts to encourage donations.\n\nView image in fullscreen Megan Hall, who is based in Australia, runs 95 mutual aid funds for individual families. Photograph: megan.palestine/Instagram\n\nSome nonprofit organisations are also observing a dramatic shift downwards in support. Gaza Soup Kitchen has raised more than $5.8m on GoFundMe since February 2024, serving 10,000 meals daily to people living in Gaza. From September to October, it saw donations drop by 51%.\n\nHani Almadhoun, the charity’s co-founder, said: “It has virtually no impact now, or the next 30 or 60 days; we are not changing our plans. But long term, maybe. As of now we press on, no changes, but our minds are on the future.”\n\nAccording to an assessment by SARI Global, cited by the World Health Organization, more than 70% of Gaza’s population, nearly 1.9 million people, are confined to parts of the territory that are exposed to rain, strong winds and coastal surges with no functioning infrastructure.\n\n“Most of the agricultural land has been destroyed, most of the livestock has been destroyed and the healthcare system is decimated. And of course, the fact that people have been displaced over and over again over these two years means that their coping mechanisms have been degraded to nothing,” said a spokesperson for the UN Office for the Coordination of Humanitarian Affairs (OCHA).\n\n“The ceasefire means that it is quieter in terms of bombs falling on people’s heads. It doesn’t mean that overnight people’s lives became wonderful because most of Gaza is completely destroyed.”\n\nLarger, mainstream humanitarian organisations are also concerned at the drop-offs in donations since the ceasefire. Oxfam is reporting a decline and Save the Children UK said donations coming in from its social media marketing had gone down by a third.\n\n“We market but when there’s not enough media coverage, the marketing doesn’t become cost effective, and so it is like a self-perpetuating cycle,” said Alison Griffin of Save the Children UK. She said other revenue streams – from high-income and legacy donors – were holding up but stressed that the need in Gaza was high.\n\nView image in fullscreen Children play among the rubble in northern Gaza. Some families are sheltering in bombed-out buildings but still paying rent. Photograph: Mahmoud Issa/Reuters\n\nSome aid convoys have been allowed into Gaza by Israel since the ceasefire. Israel has opened only three of the seven border crossings, which OCHA said had limited aid distribution.\n\n“Around 2,000 tonnes of food assistance should be entering on a daily basis,” said the spokesperson. “If we’re looking at the amount that is entering through the UN-coordinated mechanism, it is around 60% of that target.”\n\nFor individuals and families in Gaza reliant on mutual aid funds, life was very difficult, said Ahmed al-Deeb, 28, from Gaza City. He has depended entirely on a mutual aid fund to feed and house his extended family of 14, including his sick two-year-old niece, since Hall established it six months ago.\n\nTo date, the fund has raised about $6,500 for the family. From May to September, donations grew every month to nearly $3,000 for September. However, in October, donations dropped back to about $300. In November, just slightly more than $150 has been raised so far.\n\nDeeb’s family was displaced to Deir al-Balah in central Gaza after Israel’s ground invasion of Gaza City in September. For a tent on a plot of land with 10 other families, he paid a landlord the equivalent of $300 a month. In October, he was only able to pay the rent by borrowing money from a friend.\n\nWorried about living in a tent during winter, he decided to take his family back to Gaza City to search for a bomb-damaged apartment to live in. He has found one but still has to find $400 a month – money he does not have.\n\n“I cannot even start describing to you how bad it is,” he said. “If I don’t pay, the landlord will evict me.”\n\nView image in fullscreen A displaced Palestinian, Hanan al-Joujou, sits with her child at the entrance of their tent in Nuseirat camp. Photograph: Mahmoud Issa/Reuters\n\nDeeb said more food was becoming available in markets and prices had decreased. His family largely survives on lentils and pasta. Humanitarian aid is hard to find and he has not been able to access any for eight months.\n\nOther Palestinians in Gaza told the Guardian of similar struggles, all pointing to a decline in donations.\n\nFundraisers suspect the decline is largely due to public belief that Palestinian suffering has ended. But Hall said other factors were at play. She said that after two years of donating, and the high costs of evacuating people from Gaza City in September, she and other small donors and activists were running out of money. Hall has been selling her furniture to be able to raise the money to pay one family’s rent.\n\nOthers pointed to financial strain on ordinary people. In the US, the government shutdown stopped salaries for many public employees and affected social security benefits, while people in the UK and other countries are facing a cost-of-living crisis.\n\nLeading social-media companies such as Meta had algorithmic biases against pro-Palestinian content that made it difficult for fundraisers to be seen outside existing advocacy circles, according to the chief executive of Tech for Palestine, Paul Biggar.\n\nFor the 2 million people in Gaza, another uncertain winter has arrived. Deeb said his first rent payment was due soon and if he was evicted, he and his family would have to sleep on the streets.\n\n\n\n",
  "authors": [],
  "url": "https://www.theguardian.com/global-development/2025/nov/21/fundraisers-warn-catastrophic-drop-donations-aid-palestinians-gaza-israel-ceasefire"
}