{
  "title": "2025 NFL Week 12 Expert Picks",
  "text": "Carolina Panthers (6-5) at San Francisco 49ers (7-4)\n\n14 of 14\n\nAP Photo/Ross D. Franklin San Francisco 49ers running back Christian McCaffrey\n\nDavenport: Panthers ( 7)\n\nThat the Panthers are 6-5 after 11 weeks is one of the more surprising records in the league this year. But here's an even bigger surprise: Carolina is 7-4 against the spread.\n\nWhile the 49ers have impressed with their resilience in the face of a never-ending onslaught of injuries, the team has the third-worst defensive success rate in the league. The Niners have allowed 306 passing yards and 3.5 passing touchdowns per game with a completion percentage against north of 75 percent over the last month.\n\nBryce Young keeps this one close.\n\nMoton: 49ers (-7)\n\nAt 6-5, the Panthers look like a team that's on the rise, but they're pretenders. Sure, they went on the road to beat the Green Bay Packers, who have struggled offensively, and swept their season series with the three-win Atlanta Falcons. However, San Francisco is a team with an established offensive identity.\n\nExpect Christian McCaffrey to post gaudy rushing numbers in the first game against his former team.\n\nThe Panthers have allowed an average of 149 rushing yards over the last four weeks. Don't be surprised if McCaffrey surpasses that number in the bright lights of Monday Night Football.\n\nPredictions\n\nPanthers: Davenport, Sobleski\n\n49ers: Gagnon, Hanford, Knox, Moton, O'Donnell\n\nIf you or someone you know has a gambling problem, crisis counseling and referral services can be accessed by calling 1-800-GAMBLER (1-800-426-2537) (IL).\n\nGambling problem? Call 1-800-GAMBLER (NJ/WV/PA), 1-800-9-WITH-IT (IN), 1-800-522-4700 (CO), 1-800-BETS OFF (IA), or call or text the TN REDLINE: 800-889-9789 (TN).",
  "authors": [
    "B R Nfl Staff",
    "Bleacher Report"
  ],
  "url": "https://bleacherreport.com/articles/25299507-2025-nfl-week-12-expert-picks?utm_source=cnn.com&utm_medium=referral&utm_campaign=editorial"
}