{
  "title": "You need to listen to the searing noise pop album Forever in Your Heart",
  "text": "is the Verge’s weekend editor. He has over 18 years of experience, including 10 years as managing editor at Engadget.\n\nPosts from this author will be added to your daily email digest and your homepage feed.\n\nThere’s something irresistible about music that sounds as if it’s coming apart at the seams. The Black Dresses are masters of barely contained chaos. All of their records feel as if they’re in danger of collapsing into pure noise at any moment. But never have they so expertly woven the various threads of their sound — glitchy percussion, pummeling guitars, irresistible pop hooks — together as they do on Forever in Your Heart.\n\nThe Canadian duo of Ada Rook and Devi McCallion crafts something undeniably catchy from abrasive electronics, metallic percussion, death-metal screams, and off-key warbling. The opening track, “PEACESIGN!!!!!!!!!!!!!!!!!” jumps out of the speakers with such viciousness that the riff basically trips over itself before settling into a groovey shoegaze verse. When the riff returns, Devi screams, “Can we make something beautiful with no hope?”\n\nBoth Rook and Devi’s screams are explosive, but nowhere is that more true than on “Silver Bells.” Halfway through the song, after a particularly melodic passage backed by Pretty Hate Machine-esque synths, Rook shreds her vocal chords, delivering the lines:\n\nI’m tired\n\nI’m out of breath\n\nI’m scared of everything that’s left\n\nI just want some gentleness\n\nBut tension and despair\n\nIs all we ever get\n\nThe performance is so intense that Devi actually chimes in to make sure her friend is ok. It’s a moment of levity in an album that can often feel bleak. But it’s also probably born out of genuine concern for Ada’s larynx.\n\n“Silver Bells” gives way to the glitchy mid-tempo “Ragequitted” and the lo-fi indie-rock tinged “Waiting42morrow,” which offer a respite before the slow build of “Gone in an Instant,” which climaxes with more vocal histrionics from Rook.\n\nLyrically, the album is filled with sentiments of alienation and self-loathing. People who don’t “remember she was еven in their lives” and Rook declares that “I wish I was a faker, so people would hate the fake me.” The heavy themes could feel clunky in less skilled hands. But the lyrics exploring the pressures they face as trans women are balanced by moments of hope. At the end of “Heaven” Rook finds beauty and acknowledges there’s a way out of the darkness.\n\nAnd all brokеn creatures are\n\nPеrfect just the way they are\n\nBut it’s easy to be disillusioned\n\nWhen you don’t know who you are\n\nAnd the album even ends on a vaguely positive note as Devi intones “I couldn’t keep it together, but it’s not that bad” at the end of the almost power ballad-esque “(Can’t) Keep It Together.”\n\nThe production throughout the record is also impeccable. Musically, there is rarely a dull moment. Kick drums erupt with enough force to rattle your spine even through headphones, glitchy synths dance in and out of the mix, and guitars sputter to life in unexpected places. The chaos extends not just to the sound palette but also to the actual song arrangements. While there are obvious hooks, Black Dresses don’t seem particularly interested in standard verse-chorus-verse song structures.",
  "authors": [
    "Terrence O'Brien"
  ],
  "url": "https://www.theverge.com/entertainment/821782/you-need-to-listen-to-the-searing-noise-pop-album-forever-in-your-heart"
}