{
  "title": "Google cracked Apple’s AirDrop and is adding it to Pixel phones",
  "text": "is a senior reviewer with over a decade of experience writing about consumer tech. She has a special interest in mobile photography and telecom. Previously, she worked at DPReview.\n\nPosts from this author will be added to your daily email digest and your homepage feed.\n\nGoogle just announced some unexpected and welcome news: Pixel 10 owners can now send and receive files with Apple devices over AirDrop. And equally interestingly, the company engineered this interoperability without Apple’s involvement. Google says it works with iPhone, iPad, and macOS devices, and applies to the entire Pixel 10 series. While limited to Google’s latest phones for now, Google spokesperson Alex Moriconi says, “We’re bringing this new experience to Pixel 10 first before expanding to other devices.”\n\nIn order to send a file from a Pixel 10 phone over AirDrop, the owner of the Apple device will need to change their settings to make their device discoverable to anyone — there’s an option to do this with an automatic limit of 10 minutes. Then, the Pixel 10 owner should be able to see the device using Quick Share and send it. On the other side, it seems that it’ll look just like any other AirDrop request that the user can approve to start the transfer.\n\nDidn’t have this on my bingo card when I got up this morning. Image: Google\n\nAccording to support documentation, it goes the other way, too. Likewise, the Pixel 10 device will need to be discoverable to anyone or in receive mode. Then the Apple device owner starts an AirDrop transfer, the Pixel owner accepts, and voila: cross-platform sharing.\n\nA post on Google’s security blog goes into greater detail about how it’s implemented, claiming “This feature does not use a workaround; the connection is direct and peer-to-peer, meaning your data is never routed through a server, shared content is never logged, and no extra data is shared.”\n\nWhen we asked Google whether it developed this feature with or without Apple’s involvement, Moriconi confirmed it was not a collab. “We accomplished this through our own implementation,” he tells The Verge. “Our implementation was thoroughly vetted by our own privacy and security teams, and we also engaged a third party security firm to pentest the solution.” Google didn’t exactly answer our question when we asked how the company anticipated Apple responding to the development; Moriconi only says that “…we always welcome collaboration opportunities to address interoperability issues between iOS and Android.”\n\nThe security blog post also details Google’s reasoning for why this implementation is secure, along with mentioning an independent security assessment from NetSPI (pdf), preemptively pushing back on reasons Apple might cite to block compatibility. Apple hasn’t yet responded to our request for comment on this development.\n\nNotably, this isn’t an Android feature yet — it’s currently limited to Google’s own phones, and the latest generation at that. Still, it’s kind of huge news for Android users. Seamless sharing between Apple devices with AirDrop is one of those extremely helpful features that’s been kept inside the walled garden until now. With RCS now widely in use on iPhones, making cross-platform messaging easier, it seems like another meaningful step forward to lowering those garden walls.\n\nUpdate, November 20th: Added a quote from a Google spokesperson confirming that Apple was not involved in the development of this feature.",
  "authors": [
    "Allison Johnson"
  ],
  "url": "https://www.theverge.com/news/825228/iphone-airdrop-android-quick-share-pixel-10"
}