{
  "title": "NFL Week 12: Shedeur starts, the Chiefs need a win and the Bengals can’t catch a break",
  "text": "Week 12 of the NFL season brings about a big game for Patrick Mahomes and Co., injury intrigue and a sneakily important Monday Night Football game.\n\nFrom Shedeur Sanders starting for the Cleveland Browns to the Cincinnati Bengals never seeming to catch a break, here are five things to know about Week 12.\n\nRodgers’ wrist clouds Steelers’ week\n\nPittsburgh Steelers fans can breathe – at least a little. Head coach Mike Tomlin said Tuesday that Aaron Rodgers will not need surgery on the fracture in his left, non-throwing wrist. Whether he actually plays Sunday in Chicago? Still a coin flip.\n\nAaron Rodgers' wrist is the talk of Steel City. Justin Berl/Getty Images\n\nThe 41-year-old’s practice status on Friday will likely decide everything. Rodgers said his ability to protect himself is going to be the deciding factor, not pain management.\n\nAnd make no mistake: Rodgers would love nothing more than another crack at the Bears. During his Packers days, he saw them twice a year and went 24-5 against Chicago, famously telling fans – multiple times – that he “owns” the Bears.\n\nIf Rodgers can’t go, Mason Rudolph is expected to step in.\n\nBengals defense reaches historic lows\n\nJoe Burrow could return on Thanksgiving night against the Baltimore Ravens – but the Bengals may already be out of runway.\n\nAt 3-7, Cincinnati can’t afford another slip if it wants any shot at the postseason. The defense, in particular, has put them in a historic hole. The Bengals have allowed 27 or more points in each of the last nine games, becoming the first team in NFL history to do so.\n\nThe Bengals' defense is in the midst of a historic run of defensive ineptitude. Charles LeClaire/Imagn Images/Reuters\n\nNow, they get a New England Patriots team that’s quietly rolling. Rookie quarterback Drake Maye leads the NFL with 2,836 passing yards, and here’s the wild part: He hasn’t had a single 300-yard game. No explosions – just relentless, efficient production every week.\n\nThe Patriots are 9-2 and suddenly staring at a possible No. 1 seed if they keep stacking wins.\n\nChiefs-Colts: A season-defining test\n\nThe AFC’s game of the week features the 5-5 Chiefs hosting the 8-2 Indianapolis Colts, and nothing about Kansas City’s season has gone the way anyone expected.\n\nKansas City Chiefs quarterback Patrick Mahomes is facing adversity this 2025 season. Jack Dempsey/AP\n\nJonathan Taylor and the Indianapolis Colts are flying this year. Andy Lyons/Getty Images\n\nA year after going 11-0 in one-score games, the Chiefs are 0-5 in those same situations this season. The late-game Mahomes magic just hasn’t shown up. The three-time Super Bowl winner has bluntly put the blame on himself: “We haven’t been consistent enough to win games. It starts with me.”\n\nSince becoming the Chiefs’ starter, Mahomes has never failed to reach at least the AFC Championship Game. A loss on Sunday would drop Kansas City to 5-6, and the margin for error the rest of the way becomes razor-thin.\n\nAnother week, another Browns QB\n\nThe more things change, the more they stay the same: A new QB is going to be under center in Cleveland. The Browns are turning to rookie Shedeur Sanders on Sunday in Las Vegas, making him the 42nd starting quarterback the franchise has used since returning in 1999 – a staggering reminder of the instability that has defined the position in Cleveland for over 25 years.\n\nSanders will start the first game of his young NFL career on Sunday. Nick Cammett/Getty Images\n\nSanders was thrown into the fire last week against the Ravens after Dillon Gabriel exited with a concussion, and the results were rough. The rookie finished just 4-of-16 for 47 yards and an interception, struggling to find any rhythm against a tough Baltimor defense.\n\nNow, he gets his first full start – and his first real opportunity to rewrite the narrative.\n\nFor Sanders, it’s a chance to show the Raiders, and every team that passed on him in the draft (which is all other 31 franchises considering he was selected with the 155th pick in the 4th round), that they misjudged him. For the Browns, it’s yet another hope that maybe this time they’ve found a spark.\n\nNiners-Panthers take the MNF stage\n\nCarolina Panthers tight end Tommy Tremble runs with the ball in OT against the Atlanta Falcons. Brett Davis/Imagn Images/Reuters\n\nMonday Night Football brings a sneaky-important NFC matchup: the 7-4 San Francisco 49ers hosting the 6-5 Carolina Panthers.\n\nBrock Purdy returned from his toe injury last week and hardly missed a beat, throwing 19-of-26 for 200 yards and three touchdowns in a 41-22 win over Arizona. With the NFC wild card picture tightening, this one carries real postseason weight.\n\nSan Francisco 49ers QB Brock Purdy (13) had a solid outing back from injury against the Arizona Cardinals. Ross D. Franklin/AP\n\nSan Francisco’s path is tougher – the NFC West has been the best division in football with the Los Angeles Rams (8-2), Seattle Seahawks (7-3), and Niners (7-4) all above water.\n\nThe Panthers are coming off a huge overtime win in Atlanta that saw Bryce Young throw for a career-high 448 yards. He could be in for another big game as the Niners’ banged up secondary gives up the fifth-most passing yards per game in the league.\n\nAnd here’s your weird stat of the week: the Panthers are 6-0 when winning the coin toss and 0-5 when losing it. So, we may know how this one goes before the ball ever leaves the tee.\n\nFull NFL Week 12 schedule\n\nAway @ home\n\nThursday\n\nBuffalo Bills @ Houston Texans, 8:15 p.m. ET\n\nSunday\n\nIndianapolis Colts @ Kansas City Chiefs, 1 p.m. ET\n\nSeattle Seahawks @ Tennessee Titans, 1 p.m. ET\n\nMinnesota Vikings @ Green Bay Packers, 1 p.m. ET\n\nNew York Jets @ Baltimore Ravens, 1 p.m. ET\n\nNew York Giants @ Detroit Lions, 1 p.m. ET\n\nPittsburgh Steelers @ Chicago Bears, 1 p.m. ET\n\nNew England Patriots @ Cincinnati Bengals, 1 p.m. ET\n\nCleveland Browns @ Las Vegas Raiders, 4:05 p.m. ET\n\nJacksonville Jaguras @ Arizona Cardinals, 4:05 p.m. ET\n\nPhiladelphia Eagles @ Dallas Cowboys, 4:25 p.m. ET\n\nAtlanta Falcons @ New Orleans Saints, 4:25 p.m. ET\n\nTampa Bay Buccaneers @ Los Angeles Rams, 8:20 p.m. ET\n\nMonday\n\nCarolina Panthers @ San Francisco 49ers, 8:15 p.m. ET",
  "authors": [
    "Andy Scholes"
  ],
  "url": "https://www.cnn.com/2025/11/20/sport/football-nfl-week-12-five-things"
}