{
  "title": "Alice Guo: Philippines sentences former mayor, alleged Chinese national, to life in prison for human trafficking",
  "text": "Manila, Philippines AP —\n\nA Philippine court on Thursday convicted a former mayor, who officials say is a Chinese national, of human trafficking charges for helping establish an illegal online gaming complex in a northern province where hundreds of Chinese and other foreign nationals were forced to conduct scams.\n\nThe Pasig city regional trial court in metropolitan Manila sentenced Alice Guo to life in prison with seven other Filipino and Chinese co-accused, and ordered them to pay a fine of 2 million pesos ($34,000) each and compensate several trafficking victims, who filed the complaints.\n\nGuo denied all allegations against her and says she is a Filipino citizen.\n\nVast online scam centers have flourished in Southeast Asia in recent years, especially in the border areas of Cambodia, Laos and Myanmar. The UN has estimated that hundreds of thousands of people have been trapped in virtual slavery by gangs who force them to financially exploit people around the world through false romances, bogus investment pitches and illegal gambling schemes.\n\nIn the Philippines, scam operations rapidly built vast compounds with buildings or rented upscale offices in Manila’s financial districts and moved around large numbers of workers by bribing authorities.\n\nPhilippine authorities allege that Guo is a Chinese national named Guo Huaping, who faked Filipino citizenship to run for mayor of the town of Bamban in northern Tarlac province, where she ran a sprawling illegal scam compound near the town hall.\n\n“They used the parcels of land and buildings to house the trafficked workers and to force them to work as scammers,” the court said in its decision.\n\nLast year, Philippine President Ferdinand Marcos Jr. ordered a ban on hundreds of mostly Chinese-run online gaming operations, which proliferated under the administration of previous President Rodrigo Duterte. Marcos accused the gaming operations of crimes including financial scams, human trafficking, torture, kidnapping and murder.\n\nMany have been raided and shut down since then, with tens of thousands of trafficked workers rescued and sent back to their home countries. But more scam centers remain in operation, officials said.\n\n“The conviction of Alice Guo, also known as Guo Hua Ping, is a victory against corruption, human trafficking, cybercrime and many other transnational crimes,” said Sen. Risa Hontiveros. “But it is far from over.”\n\nHontiveros led televised Senate inquiries last year that exposed underground online scam operations in the Philippines, along with Guo’s alleged criminal involvement.\n\nPhilippine security officials and Hontiveros have said the scam centers operated by Guo and other Chinese nationals may have also been used for espionage by China, which has had increasingly fierce territorial conflicts with the Philippines in the South China Sea and has strongly opposed the presence of American forces in the country. The Philippines is the oldest US treaty ally in Asia.\n\n“We will continue to demand accountability from every government agency that failed in their duties, and we will continue to investigate the full extent of Chinese intelligence operations in our country,” Hontiveros said. “And to all others who enabled Alice Guo’s criminal empire: the Philippines is not a playground for exploitation, infiltration and espionage.”\n\nGuo has not been charged with espionage and she denies any connection to spying.\n\nThe town of Bamban is located several kilometers (miles) from a Philippine air force base, where American forces have been allowed to maintain a rotating presence with their aircraft and weapons under a 2014 defense pact.\n\nGuo was dismissed from her post as mayor last year by a state Ombudsman, who cited grave misconduct. She fled the Philippines in July 2024, but was tracked down in Indonesia, where she was arrested and deported to the Philippines. She has been in detention since last year.",
  "authors": [
    "Story The Associated Press"
  ],
  "url": "https://www.cnn.com/2025/11/20/asia/philippines-alice-guo-jailed-scams-intl-hnk"
}