{
  "title": "NVIDIA’s Global Takeover: A Conversation with Jensen Huang",
  "text": "Transcript\n\nI don't think I really need to introduce Jensen Huang.\n\nBut a little backstory.\n\nJensen founded Nvidia in 1993.\n\nHe has served as its CEO since then,\n\nleading the company to become a global leader\n\nin accelerated computing.\n\nIts invention of the GPU in 1999,\n\nrevolutionized computer graphics,\n\nsparked the growth of PC gaming,\n\nand now it's basically shaping the modern era\n\nof artificial intelligence.\n\nLet's give a warm welcome to Jensen Huang.\n\n[audience cheers and applauds]\n\nHi. Hi, Jensen.\n\nCan you hear me?\n\nHey Lauren. I wish I was there.\n\nI wish you were here too,\n\nbecause it's really hard to get the,\n\nit's hard to get the vibes of that\n\nleather jacket over Zoom.\n\nI could do it.\n\n[Lauren laughs]\n\nAlright, Jensen, you are joining us today from Thailand,\n\nand I know that you've been on\n\na bit of a world tour recently,\n\ntalking about Sovereign AI,\n\nwhich is I think what you're doing in Thailand, correct?\n\nTell us about this.\n\nWell, first of all, it's great to be with you.\n\nI'm here in Bangkok.\n\nIn fact, it's really great to be back here,\n\nbecause you probably don't know this,\n\nbut I lived here for about five years when I was a child,\n\nand from about, from about five or so.\n\nAnd I went to school,\n\nan international school here.\n\nIt was called Rudi Internationals.\n\nIt's a couple of blocks away.\n\nAnd so, it's really, it's really terrific to be here.\n\nJensen, I'll also note you're the only guest\n\nwho's technically joining us from the future,\n\nbecause it's already December 4th there.\n\n[Lauren and the audience laugh]\n\nI think this is very fitting.\n\nIt it is. It is.\n\nAnd I could, I could provide some insight\n\nand some, you know, some warnings,\n\nand keep you out harm's way.\n\nExcellent. We need that.\n\nOkay, so tell us about this.\n\nTell us about Sovereign AI.\n\nYeah, so what's going on is,\n\nis countries are awakened to\n\nthe incredible capabilities of AI,\n\nand the importance of AI for their own nations.\n\nThey realize that their data\n\nis part of their natural resource.\n\nTheir data, of course, encodes their,\n\ntheir society's knowledge and culture,\n\nand common sense, and, you know,\n\ntheir hopes and dreams.\n\nAnd, they now realize that they really\n\nshould take a role in processing that data,\n\nharvesting that data,\n\nand refining it into intelligence,\n\nand providing their native intelligence to their society.\n\nAnd so that's one observation.\n\nThe other observation is that,\n\nthat people are starting to realize\n\nthat AI in a lot of ways is like\n\nthe energy infrastructure,\n\nthe communications infrastructure,\n\nand now there's going to be an intelligence,\n\na digital intelligence infrastructure.\n\nAnd these AI factories,\n\nthese data centers are part of that\n\ninfrastructure that they have to be mindful about,\n\nand play a role in forming.\n\nAnd this infrastructure is necessary for,\n\nof course, their industry,\n\nbut it's also really important for their society,\n\nand for their education, for their colleges,\n\nfor research and startups and so on and so forth.\n\nAnd so I'm here in Thailand to celebrate\n\nthe partners that we have here.\n\nWe have an AI cloud company here\n\ncalled SIAM AI that is starting.\n\nWe have some 56 or so AI startups\n\nthat I'm gonna be meeting,\n\nI'll be meeting today,\n\na whole bunch of Professors- Just today, 56?\n\nYeah. Is there like a Jensen AI\n\nthat you deployed?\n\nI mean, how do you fit those, how do you,\n\nliterally, how do you fit that many meetings in?\n\nLauren, you just gotta go fast, you know.\n\n[audience laughs] You just do things fast.\n\n[Lauren laughs] It's like our computers,\n\nyou gotta do things fast.\n\nAnd so they're professors that I'm meeting,\n\nthere are companies that I'm meeting,\n\nand of course had the benefit\n\nof meeting the prime minister,\n\nand she's really, really impressive.\n\nAnd she's 38 years old, and leading our,\n\nleading this country.\n\nAnd really believes in technology,\n\nand wants the country to lean forward in AI.\n\nAnd so it's really terrific to be here.\n\nThe way that you're,\n\nthe way that you're describing this is,\n\nI mean, I'm sure it's nice if you\n\nget to sell more GPUs as well, but\n\nit also sounds like you're, you know,\n\nreclassifying this era of generative AI as infrastructure.\n\nAnd I'm wondering what that means\n\nfor the development of AI models.\n\nWell, let's see.\n\nThere are a couple of questions in there.\n\nFirst of all, it is infrastructure in the sense that,\n\nthat so many different parts of society needs it.\n\nYou know, universities need it, researchers need it,\n\nstartup companies need it, large companies need it.\n\nAnd, and so when every aspect\n\nof a society needs something,\n\nit's generally recognized as infrastructure.\n\nAnd I think that artificial intelligence\n\nwill be a layer above the internet,\n\na layer above, above the way\n\nwe interact with computers today.\n\nAnd, and your question about large language model\n\nis it's essentially the new operating system,\n\nyou know, whereas the way that we used to use computers\n\nis to program it and retrieve files,\n\nand manage files, and so on, so forth in the past,\n\nin the future, the way we'll use computers,\n\nof course, is to, to prompt it,\n\nto ask it a question,\n\nto ask it to do something for us.\n\nAnd at the core of that,\n\ninstead of the operating systems of the past,\n\nthe core of that is now large language models.\n\nIt's not one large language model,\n\nbut it's a system of large language models.\n\nAnd, but at the core of it is the large language model.\n\nYour question about, about large language models here\n\nand around the world...\n\nFor example, I was, I was in Denmark,\n\nand they're building,\n\nthey're building the large language model of Denmark.\n\nAnd I was in Sweden,\n\nand they're building the large language model of Sweden.\n\nAnd I was in Japan,\n\nthey're building the large language model of Japan.\n\nAnd of course Indonesia is building it.\n\nIndia is building several.\n\nAnd here in Thailand,\n\nit's called ThaiGPT.\n\nAnd so, there are these language models\n\nthat are, that are being created.\n\nI think the availability of understanding\n\nof how to build these large language models\n\nis fairly well documented,\n\nand the systems are available,\n\nand people are doing a really good job.\n\nPeople are also realizing that,\n\nthat it's not one giant model that needs to be built,\n\nbut in a lot of ways,\n\nyou could create very effective AIs\n\nthat are systems of large language models,\n\nAnd the systems of large language models.\n\nof course, some of it's related to reasoning,\n\nsome of it is related to tool use,\n\nsome of it's related to retrieval of information,\n\nand guard railing, and you know,\n\nthe synthetic data generation\n\nfor reward models and reflection models,\n\nand, you know, all kinds of different,\n\ndifferent types of models are involved in a,\n\nin a system of AIs,\n\nand the knowledge of how to do that,\n\nand the frameworks and tools\n\nof how to do that that is widely available.\n\nAnd so I think every country should be able to do it.\n\nFascinating. One of the things\n\nthat you've been talking about lately,\n\nand I think it's it's broadly\n\nkind of a buzzword right now in AI, is agents.\n\nYou spoke about this a little,\n\na little bit on your most recent earnings call too.\n\nI think this is probably one of those things\n\nwhere people are like maybe even\n\nsaying it in conversation and not fully sure what it means.\n\nSo like, what is an AI agent to you?\n\nWhat does it, what does it do?\n\nAnd why are some folks saying that this is the next,\n\nthis is the next wave of generative AI?\n\nSimple. So the first, the first,\n\nthe first wave was the development of-\n\n[Lauren] And you don't have to go back to like\n\n1993 by the way.\n\nWe're on a, we're on a timeframe here.\n\n[audience laughs]\n\nOkay. Alright. Alright.\n\nOkay, 2012. The first wave started around-\n\n[indistinct] Yeah, yeah, yeah.\n\nAnd that first wave was perception AI, right?\n\nRemember all of a sudden we,\n\nwe were good at computer vision,\n\nand speed recognition,\n\nand all kinds of perception related models.\n\nThe second generation with generative AI,\n\nand that was really about three,\n\nfour or five years ago,\n\nof course, GANs were the beginning of that,\n\nGPT is an example of that,\n\ndiffusion models, so on and so forth.\n\nGenerative AI. Now agentic AI,\n\nwhich is where we are today,\n\nis really the combination of all that.\n\nAnd it's really the fundamentals of intelligence,\n\nwhich is perception, reasoning and planning.\n\nAnd if you could say, if I replace planning with,\n\nwith generation, perception, of course, perception AI.\n\nSo really what's missing is the ability to do reasoning.\n\nAnd we now have models that are,\n\nare doing a better job with reasoning.\n\nYou could give it a basic mission,\n\nand break it down to step-by-steps.\n\nIt could be a chain of thoughts,\n\nit could be a chain of trees,\n\nit could be all kinds of different ways\n\nof coming up with a reason through a problem.\n\nMaybe even inviting other,\n\ninviting other Ais to help you do a job.\n\nFor example, an AI that could be good\n\nat generating images,\n\nor good at generating music,\n\nor retrieving a file, you know,\n\ngenerating citations, doing search,\n\nso on and so forth so that you could,\n\nyou now have a system of AI's\n\nthat together are essentially agentic,\n\nor otherwise robotic, or otherwise intelligent.\n\nAnd so I think those words are somewhat interchangeable,\n\ndepending on their context.\n\nBut basically it's really about\n\nperception, reasoning and planning.\n\nAnd the idea too is that we're shifting from this world\n\nwhere we used computers to do work,\n\nbut now the computers are doing the work for us.\n\nYou could use an agent to perform a task\n\nfor you on your computer, right?\n\nThus freeing up time.\n\nAre you personally using AI agents\n\nin that way right now?\n\nLike, could you describe an example?\n\nI use AI, I use several AIs,\n\nand I use 'em all just because I enjoy them all.\n\nI use Gemini, I use ChatGPT.\n\nBut is it actually doing your work\n\nfor you at this stage?\n\nI use it to write a lot.\n\nI give it a, I give it a basic outline,\n\ngive it some PDFs of my previous talks.\n\nAnd I give it, get it to write my first draft.\n\nIt's really fantastic.\n\nSo, so anytime I write you an email,\n\nand you actually respond, that's an agent,\n\nyou're saying, Jensen? [audience laughs]\n\nNo. Well, I have a filter,\n\nso when Lauren writes me, I write back.\n\nIt goes right to the top.\n\nGoes right to the top. Alright.\n\nLet's talk about the future of NVIDIA's business.\n\nYou have a lot of partners around the world\n\nas you're describing,\n\nand I'm wondering how vulnerable, if at all,\n\nyou're feeling to political instability right now?\n\nHow are you thinking about this?\n\nWell, the world is changing.\n\nThe world is changing, but, and, but,\n\nbut also simultaneously,\n\nthe fundamental technology trends are so incredible.\n\nAnd so in our, in our industry, in our business,\n\nthis fundamental trend of artificial intelligence,\n\nthis new layer of computing,\n\nthis reinvention of the computer,\n\na reset of computing as we know it\n\nover the last 60 years,\n\nis just an extraordinary opportunity.\n\nAnd the type of problems we're able to solve now,\n\nthe type of, the type of products and solutions,\n\nand capabilities we can offer to the world\n\nis just extraordinary.\n\nAnd I think that's one of the reasons why\n\nartificial intelligence is so central\n\nto your conference today.\n\nAnd so I think we all recognize that.\n\nThat's probably, that fundamental force,\n\nthat dynamic, that tailwind, if you will,\n\nis just so incredibly strong,\n\nthat the technology industry\n\nand all of the software industries that sit on top of it,\n\nand all the industries that sit on top of that,\n\nare gonna go through some extraordinary\n\ntransformations over the next decade.\n\nHmm. To specifically drill down to politics, though,\n\nI'm thinking about something like,\n\nfor example, this Monday,\n\nthe US Department of Commerce\n\njust expanded its export controls.\n\nAnd that's something that has\n\nthe potential to affect NVIDIA's business\n\nbecause the export controls apply\n\nnot just to semiconductors,\n\nbut also to more broadly, more componentry,\n\nand that goes into your GPUs.\n\nSo, you know, when you look at something like that,\n\ndo you think the export controls are,\n\nthe reasons for them are justified?\n\nHow concerned are you about China, for example,\n\nyou know, rising up in AI,\n\nand the competition that China poses?\n\nYeah, several questions there.\n\nI think first of all, our job is to,\n\nto do our best to inform, to address,\n\nand make aware the dynamics of our industry,\n\nand how it works,\n\nand how our company works in\n\nvarious markets around the world,\n\ndo our best to explain those things to the administration.\n\nAnd it's up to them to come up\n\nwith the best po possible policies.\n\nAnd then after that, our job is,\n\nis to continue to do our best to innovate,\n\nand drive our technology forward,\n\nsupport our customers, and continue to be successful.\n\nAnd so, so, you know,\n\nthose are things within our control,\n\nand I think that our interactions\n\nwith the administration has been great.\n\nIn terms of the incoming administration,\n\npresident-elect, why are you guys laughing?\n\n[audience laughs]\n\nPresident-elect Donald Trump has said\n\nin the recent past that he believes that\n\nTaiwan has taken some of the chip business from us.\n\nYou work very closely with Partner TSMC based in Taiwan.\n\nWhen you hear remarks like that, I mean,\n\nhow concerned are you about what that\n\ncould mean for your relationship with TSMC?\n\nWell, TSMC, TSMC's role in the industry,\n\nand role in the world is fairly unquestionable.\n\nI I think they're,\n\nthey're obviously a very important technology innovator,\n\na very critical part of the world's supply chain,\n\nan extraordinary company with excellent leadership,\n\nand a culture that that was really built by hand\n\nover the course of some 40 years,\n\nand a relationship and a partnership\n\nthat is really critical to us.\n\nAnd not just to us,\n\nto companies that that everybody knows all over the world.\n\nI think all of that is gonna remain true.\n\nAnd if anything, you know,\n\nTSMC as a company gets better and better\n\nevery single year that we work with 'em.\n\nAnd, and so, so our relationship\n\nwith TSMC is gonna continue,\n\nand our, the world's dependency on TSMC\n\nis going to continue for quite a long time to come.\n\nHave you spoken yet with\n\nPresident-elect Donald Trump since the election?\n\nI've reached out to President Trump\n\nand congratulated him, and wished him success,\n\nand told him that we'll do everything we can\n\nto help the administration succeed.\n\nOkay. Do you anticipate having\n\nextended conversations about your business with him?\n\nWell, artificial intelligence is\n\nobviously really important.\n\n[Lauren] Huge topic. And yeah, huge topic.\n\nAnd it's important on a whole bunch of dimensions.\n\nOne dimension, just tech technological reasons\n\nwhy it's important,\n\nbut it's also important because it's a brand new industry.\n\nThis is an industry that's never existed before.\n\nYou know, we're producing intelligence, and manufacturing,\n\nmanufacturing intelligence at scale for the very first time.\n\nAnd the reason why I chose that word,\n\nmanufacturing is, is because it, usually,\n\nan industry is formed,\n\nwhen it manufactures something that didn't exist before.\n\nAnd so, for example,\n\nmy generation was responsible for the,\n\nfor the manufacturing at scale of software.\n\nBefore my generation, there was no such thing as software.\n\nAnd then after this generation of technologists,\n\nand all of us working in the computer industry,\n\nthere's now a concept called software\n\nthat you could manufacture.\n\nThere's common sense about manufacturing at best practices\n\nand all the technology necessary manufacture software.\n\nAnd, and we do it at an incredible scale,\n\nand a it's multi-trillion dollar industry.\n\nWell, we have a brand new industry now,\n\nand this industry is not about producing software,\n\nit's about producing intelligence.\n\nAnd this industry requires energy,\n\nand requires a lot of factories,\n\nand has great implications to\n\ngreat social impact, industrial impact,\n\nand the economic and technological success of a country.\n\nAnd so I'm certain that\n\nthe new administration and President Trump\n\nwould be quite interested in this industry,\n\nand I'll be more than delighted to provide any support,\n\nand answer any questions that I can.\n\nThere's also been a lot of excitement about Blackwell,\n\nwhich is your newest chip.\n\nIt is being delivered right now, right?\n\nYou've delivered it to some of the hyperscalers, correct.\n\nBlackwell is a, is a whole system.\n\nYes. A bunch of switches,\n\nand networking, and computing, and so and so forth,\n\nand a whole mountain of software,\n\nand it is in full production,\n\nit's going quite well.\n\nAnd we have Blackwell systems\n\ninstalled all over the world now.\n\nAnd what would you say is the,\n\nlike the number one biggest difference\n\nfrom Blackwell that your customers are going to see?\n\nI mean, it's assumed that it's faster,\n\nbut what are the, what are the downstream effects of that?\n\nThere are several things.\n\nFirst, because in training,\n\nbecause of its performance is so incredible,\n\nit's a leap in performance.\n\nAnother way of thinking about that,\n\nis instead of waiting months\n\nto process the data necessary to train a model\n\nand then train a model,\n\nyou could reduce that time,\n\nyou know, by, by three x, by four x.\n\nAnd so it could have been six months,\n\nand now it's month and a half.\n\nAnd with everybody racing to the\n\nnext plateau of AI capability,\n\nthe difference between three months\n\nfrom one company to another company could be a game changer.\n\nAnd so everybody is really racing\n\nto reach that next level.\n\nIn inference, this is one of the extraordinary things\n\nthat we've done with Blackwell.\n\nBecause we realize that inference is not\n\ngoing to be just zero shot or one shot,\n\nbut inference is going to be,\n\nit's gonna include long thinking.\n\nAnd it's a, it's gonna be essentially\n\nan AI coming up with all kinds\n\nof different scenarios in its mind.\n\nAnd then of course,\n\nwith more compute, offer a better answer,\n\nwhich is a new way of scaling.\n\nWe call it test time scaling,\n\nor inference time scaling.\n\nAnd so because of that,\n\nwe invented new technologies so that,\n\nso that inference can continue to be super fast,\n\nsuper energy efficient.\n\nIt's like 30 times more energy efficient than,\n\nand faster than previous inference capabilities.\n\nSo all these capabilities are now possible.\n\nJensen, we have less than five minutes left,\n\nand I wish we could cover a million more topics,\n\nbut I wanna ask you about the future of Nvidia.\n\n[Jensen] I got all day.\n\nYou have, do you? [audience laughs]\n\n[Jensen] Yeah. You really are dispatching\n\nyour AI to take those 56 meetings.\n\nI'm still gonna, I'm gonna think about that\n\nfor a long time, 56 meetings in a day.\n\nYou've had this incredible run.\n\nI mean, truly incredible run.\n\nNvidia is at the top.\n\nAnd I'm wondering how you think about maintaining that.\n\nAnd I think this was probably on\n\na lot of people's minds this week,\n\nas we saw that the, you know,\n\nthe CEO of Intel, Pat Gelsinger stepped down,\n\nand some reported he was forced out.\n\nAnd, you know, I don't think anyone would've\n\nthought of Intel, you know,\n\nin the same way 20 years ago.\n\nAnd so how do you ensure that NVIDIA\n\ndoesn't end up in the same boat 10, 20 years from now?\n\nWhat are the, what are the actual\n\nstrategic steps you're taking to ensure that?\n\nYeah, a really good question.\n\nFirst of all,\n\nI've worked with Pat for several decades,\n\nand really appreciated his friendship and partnership.\n\nAnd we've got all kinds of things\n\nthat we're working on with Intel.\n\nAnd we've selected their CPUs\n\nfor many of our programs that are upcoming.\n\nAnd this is a really important company.\n\nAnd, and they're still just,\n\nif I could put it out there,\n\njust the teams that we work with,\n\non their CPU side, on their PC side,\n\non the data center side are really extraordinary.\n\nAnd so we've got a lot of great friendships there,\n\nand I wish 'em well.\n\nAt the core, at the core,\n\nthis is the challenge when,\n\nwhen something fundamental happens to an industry,\n\nand that force is so incredible.\n\nAnd you have to keep remembering this,\n\nthat in fact, the central processing unit\n\nwas described in 1963, 1964.\n\nIt was literally called the central processing unit.\n\nAnd the IBM system 360,\n\nfairly clearly describes modern computing as we know it.\n\nAnd it lasted about 60 years.\n\nAnd so all of a sudden, not all of a sudden,\n\nbut over, because of deep learning,\n\nand because of the incredible pace of innovation\n\naround deep learning and machine learning,\n\nthe world went from coding,\n\nand coding instructions that ran on CPUs\n\nto machine learning of neural networks\n\nthat run on GPUs.\n\nThis force is so incredible.\n\nIt's not as if,\n\nit's not as if you can compete against this.\n\nYou're either, you're either in this force,\n\nyou're either on this wave,\n\nor you've missed that wave.\n\nBut no CPU could ever,\n\nno matter how good it is,\n\ncould overcome machine learning.\n\nThis is no different than,\n\nno disk drive can overcome\n\nthe power of cloud computing.\n\nYou just, you're not gonna build a better computer.\n\nBecause the fundamental trends and the benefits\n\nof cloud computing is so incredible.\n\nYou're not gonna overcome the trend of mobile computing.\n\nIt's just too fundamental, mobile cloud.\n\nAnd so, so machine learning is even more powerful than that.\n\nThe fundamental way that we do software has changed.\n\nAnd the result of that has fundamentally changed.\n\nInstead of creating tools, software tools,\n\nwe're now developing AIs.\n\nAnd, and so the way you build it,\n\nhow you process it,\n\nwhat you can build as a result of it\n\nhas all fundamentally changed.\n\nAnd this all happened in 10 years.\n\nSo you're either preparing for that 10 year trend,\n\nor you get caught off guard by that.\n\nAnd this is, this is, you know,\n\nbecause of, because of the success of CPUs\n\nin the last 60 years, it's not,\n\nit's not, it's probably not unexpected.\n\nAnd it's probably even understandable\n\nthat an organization that is so focused\n\non building CPUs and and its leadership\n\nin that area would be caught off guard.\n\nAnd so I think first of all,\n\nI think that that's really at the core of it.\n\nThey're, of course, a lot of other,\n\nother people could criticize their circumstance,\n\nbut I think foundationally it's really about\n\na seismic change in technology,\n\nand that the future of computing\n\nis gonna fundamentally change.\n\nAnd so how do you ensure that 30 years from now,\n\nwe're not saying that about GPUs,\n\nand NVIDIA's position?\n\nWell, there's no guarantee, Lauren.\n\nFirst of all, we just gotta put it out there,\n\nthere's no guarantee.\n\nI will say that because of the way\n\nthat NVIDIA was born and built by hand,\n\nthe company was really designed for agility.\n\nYou know, remember, this is a company\n\nthat started out with a fundamental\n\ntechnology architecture that two years\n\nafter we were founded, we completely changed.\n\nWe admitted the fact that recognized,\n\nand admitted the fact that the architecture that we had,\n\nthe technology we had was just, was just wrong.\n\nWe understood why we did it,\n\nbut it was fundamentally the wrong approach.\n\nAnd completely changed the company\n\nto go after a new way of doing computer graphics.\n\nWe also reinvented the company several times,\n\nas, you know, people know well,\n\ninventing Cuda, and then after that,\n\npursuing deep learning,\n\ngoing from a chip company to a systems company,\n\nsystems company to an infrastructure company.\n\nAnd so as we, as we make those, those changes,\n\nit's in response to wanting to realize\n\nour hopes and dreams of being an impactful company\n\nin an industry that we care so deeply about,\n\nthe computer industry.\n\nAnd so, so long as,\n\nso long as the computer industry\n\ncontinues to be important,\n\nand we continue to be agile,\n\nand be surrounded by amazing\n\ncomputer scientists and talent,\n\nwe'll continue to, you know,\n\nto shape shift ourselves,\n\nto be impactful in the future.\n\nAnd so that's my hope.\n\nWe'll see how it turns out.\n\nJensen, I can only speak for myself,\n\nbut I think I speak for others here when I say\n\nI can't wait to see what you come up with next,\n\nwhat your next pivot shift.\n\nI mean, you are in the future right now.\n\nSo. I am.\n\nYeah. And we really appreciate you\n\ntaking the time to be here. A couple of hours.\n\nYou are. Yeah.\n\nSo save us all, please.\n\nLauren, I gotta tell you, the future is bright.\n\n[audience laughs] Everything's fine.\n\nThe water's safe. That's Excellent. Thank you.\n\nI think your stock just went up as you said that.\n\nSo, thank you so much, Jensen.\n\nWe really appreciate it. Thank you, Lauren.\n\nThank you. [audience applauds]\n\nI wish I could be there with you.\n\nTake care. Have a great conference.\n\n[audience applause continues]",
  "authors": [
    "Condé Nast"
  ],
  "url": "https://www.wired.com/video/watch/nvidias-global-takeover-a-conversation-with-jensen-huang"
}