{
  "title": "Nvidia earnings: AI is about to face an enormous test. The market is already nervous",
  "text": "New York —\n\nGrowing concerns about an artificial intelligence bubble have, in large part, caused the stock market’s recent bout of volatility. So the AI industry will face an enormous test when Nvidia, the world’s most valuable company and backbone of the AI boom, reports earnings after the bell on Wednesday.\n\nThe stock market rally — ﻿that had been going practically nonstop since April until this month’s blip — largely depends on Nvidia. The chipmaker, which is the gold standard for AI computing power, has propelled the market higher across the past three years.\n\nInvestors are now eager to know whether demand for Nvidia’s chips — and its optimism about the future — are continuing to grow or if there are signs of AI fatigue.\n\nEarnings this month from tech company Palantir (PLTR), which uses AI for its government contracts, beat Wall Street’s estimates. However, concerns about the stock’s expensive valuation and nerves about a bubble gave investors pause — and fueled a sell-off in AI stocks over the past several weeks. Nvidia’s stock (NVDA) has fallen more than 8% this month, although it’s still up 37% this year.\n\n“The market for the first time is questioning whether the hype will turn into reality,” Bob Elliott, CIO at asset management firm Unlimited Funds, told CNN.\n\nNvidia’s chips power part of practically every major AI venture, meaning investors will scrutinize its earnings as well as chief executive Jensen Huang’s remarks.\n\n“Nvidia takes on even greater weight than normal,” Elliott said. “If it doesn’t confirm high expectations built into the market, then watch out below.”\n\nNvidia CEO Jensen Huang makes a keynote speech in Taipei, Taiwan, on May 19, 2025. Ann Wang/Reuters\n\nMarket-moving earnings\n\nEvery investor should care about Nvidia’s earnings this afternoon: Nvidia accounts for roughly 8% of the S&P 500, which is weighted by market value. That means investors — and those with 401(k)s — are increasingly exposed to the company’s strong gains. Similarly, they are more exposed to a drop in Nvidia’s stock price.\n\nAs of Tuesday, Nvidia shares’ gains have accounted for 18% of the S&P 500’s total return this year, according to Howard Silverblatt, senior index analyst at S&P Dow Jones Indices.\n\nSince Nvidia last reported earnings in August, concerns have been rising about circular financing, with tech companies entwined in a massive web of extraordinarily lucrative deals.\n\nNow nerves are fraying about whether the money being poured into the AI boom will be justified. On top of that, tech stocks have become relatively expensive.\n\n“Nvidia’s earnings on Wednesday are particularly important given the rising skepticism regarding the longevity of the AI cycle and current AI stock valuations,” James Demmert, CIO at Main Street Research, said in an email. “Anything less than a stellar report and outlook could make stock indexes vulnerable.”\n\nAnd it’s bigger than just Wall Street. There are concerns that the AI boom — which has helped boost US economic growth this year — is now masking signs of weakness in the economy.\n\nAt its market value of $4.4 trillion, Nvidia is currently larger than every country’s economy except the United States, China and Germany.\n\nNvidia’s fate is interlinked with other big tech companies that depend on its products. A sign of a slowdown in demand could signal that the other tech companies are less confident about the AI buildout.\n\nSome Wall Street analysts are optimistic that Nvidia will continue to deliver impressive earnings. AI chatbots like ChatGPT — and the data centers powering AI — depend on the company’s chips. It’s the foundation of the current AI wave.\n\n“That is why everyone listens to every word that Jensen Huang has to say, because it’s a good gauge of the health of the AI ecosystem,” said Angelo Zino, a tech analyst at CFRA Research.",
  "authors": [
    "John Towfighi"
  ],
  "url": "https://www.cnn.com/2025/11/19/markets/nvidia-us-stock-market"
}