{
  "title": "Alice Zaslavsky’s recipe for garlic red peppers with a creamy white bean dip, AKA papula",
  "text": "This week, I’ve been putting the finishing touches on an interview I recorded with legendary Australian cheesemaker Richard Thomas, the inventor of an ingredient you may not even realise is Australian: marinated feta, AKA “Persian fetta”. An unexpected stop on a trip to Iran in the 1970s gifted Thomas a chance meeting with a Persian doctor and his breakfast: fresh labneh with soft, still-warm lavash. It was a revelation. On his return, Thomas got to work creating a fresh cheese from goat’s milk (similar to chèvre) and from cow’s milk, marinated and preserved in oil, with an extra “t” to avert confusion with the Greek-style feta, that’s still being utilised by cooks and chefs right across the world.\n\nPersian fetta is a shapeshifter, capable of remaining both firm and steadfast when crumbled across the top of a platter or salad, and of yielding to a soft, velvety cream, enhancing all manner of dishes from pasta to pesto to whipped dips and schmears – and, of course, as a topping for that Aussie cafe staple, avocado toast.\n\nWhen cafe culture ground to a halt during the rolling Covid lockdowns, Persian fetta producers were left with bucketloads (literally) that would normally have been used by the city’s cafes, so instead they offered them to independent grocers and supermarkets. Stuck at home with my bucket of cheese, I’d plonk some into anything savoury I was testing – and I mean anything.\n\nIn this recipe from my book Salad for Days, I incorporate that fetta funk into a creamy Balkan white bean dip known as papula, which I first came across via Olia Hercules. Adding cheese to the dip pumps up the flavour, and whip it into the kind of creamy bed we’ve come to see (and love) under medleys of roast veg, from modern restaurants and modern cooks (such as Meera Sodha in a recent Guardian recipe).\n\nBlanketed with strips of silky, crimson roast capsicum, this dish is packed full of beany, plant-forward protein that’s surprisingly substantial, whether you’re serving it for a decadent brunch, lunch, or light dinner, especially if it’s all mopped up with soft bread (lavash, pide, pitta or the like).\n\nIf you can’t find butter beans, any tinned or jarred white bean will work. Putting the garlic inside the capsicum while it’s roasting helps to flavour the pepper and keeps the garlic from burning, but you could use a quarter-teaspoon of garlic powder instead. And if you can’t find marinated feta where you are, you can totally use a block of soft feta (such as a Danish-style one) for this, instead.\n\nHeat the oven to 220C (200 fan)/425F/gas 7. Grab four to six medium red peppers (I go with one per person), lop off the tops and then halve them lengthways. Pull out the seeds and pith. Oil the capsicum halves, then pop them cut side down on a lined tray, tucking four garlic cloves underneath. Roast for 35-40 minutes, until the capsicums are blistered and browning and the garlic is buttery inside.\n\nTo make the papula, blitz 400g cooked and drained butter beans, with a tablespoon of sherry vinegar, 60ml olive oil and a good pinch of flaky sea salt, then add two-thirds of a jar of marinated fetta (or 200g soft Danish-style feta; reserve the rest of the block for garnish) and blitz again until smooth. Once the garlic is cooked and cool enough to touch, squish the flesh into the bean mixture, blitz again and season to taste.\n\nOnce the peppers are out of the oven, cover them with a second (inverted) oven tray or a few sheets of foil, then leave for 15 minutes to steam and relax. When they are cool enough to handle, slip off and discard the skins, then slice the cheeks into thin slivers with a sharp knife.\n\nWrap the soft bread in foil and pop into the still-hot oven to warm through while the capsicum cools.\n\nTo serve, scoop the whipped papula on to a large platter in undulating waves. Arrange the pepper slices on top in bright red, glossy strips. Dress with the tray juices, sprinkle with a good handful of finely chopped parsley, then blob or crumble on the last of the feta. Sprinkle with some sweet or smoky paprika, a handful of roasted almonds (roughly chopped, flakes or slivers), an extra drizzle of olive oil and a sprinkling of salt flakes. Pop the warm bread nearby and encourage everyone to scoop and dip to their heart’s content.",
  "authors": [
    "Alice Zaslavsky"
  ],
  "url": "https://www.theguardian.com/food/2025/nov/20/garlic-red-peppers-creamy-white-bean-dip-recipe-papula-alice-zaslavsky"
}