{
  "title": "'It was an escape into excellence': How music saved the life of a teenage Jewish cellist in Auschwitz",
  "text": "When she first arrived at the Auschwitz unloading platform known as the ramp, her casual comment that she played the cello was enough to change the direction of her life. \"Music was played to accompany the most terrible things,\" she said.\n\nThe then Anita Lasker barely spoke German in public again for 50 years after World War Two, but when she was growing up, her hometown of Breslau was part of Germany. Now known as Wrocław, it has been part of Poland since the end of the war. Lasker's mother Edith was a talented violinist and her father Alfons was a successful lawyer. As the youngest of three daughters, she grew up in a happy home where music and other cultural pursuits were encouraged. She knew at an early age that she wanted to be a cellist, but outside the sanctuary of her family home, darker forces were stirring.\n\nShe recalled on a BBC television documentary in 1996: \"We were the typical assimilated German-Jewish family. We went to a little private school, and I suddenly heard, 'Don't give the Jew the sponge,' and I thought, 'What is all this?'\"\n\nBy 1938, as antisemitism took hold in Nazi Germany, Lasker's parents couldn't find a cello tutor in Breslau who would teach a Jewish child. She was sent to Berlin to study, but had to rush back to her parents after a night of murder and mayhem. On 9 November 1938, the insidious persecution of Jewish people turned violent as Nazis smashed the windows of homes, businesses and synagogues on Kristallnacht or \"the night of broken glass\".\n\nBack at home, Lasker's parents continued to instil a love of culture in their children, as \"nobody can take that away from us\". Her eldest sister Marianne escaped in 1939 on the Kindertransport, the mission which took thousands of children to safety in Britain just before the war. By 1942, even as \"the world was falling to pieces\", her father still had Anita and her sister Renate discussing sophisticated works such as Friedrich Schiller's tragic play Don Carlos. However, it was \"obvious what was going to happen\", she said.",
  "authors": [],
  "url": "https://www.bbc.com/culture/article/20250123-how-music-saved-the-life-of-teenage-jewish-cellist-in-auschwitz"
}