{
  "title": "The 27 Best Movies on Apple TV, WIRED’s Picks (November 2025)",
  "text": "When it comes to originals, Netflix and Amazon have the deepest libraries of prestige movies. But ever since CODA won the Best Picture Oscar, it’s become clear that some of the best movies are on Apple TV.\n\nAs with any streaming service, not every film on the roster is a winner, but from the Billie Eilish documentary to Sundance darlings, Apple’s streaming service is building up a strong catalog to run alongside its growing slate of beloved TV shows.\n\nBelow are WIRED’s picks for flicks you should prioritize in your queue. Once you’re done, hop over to our list of the best movies on Netflix and the best movies on Disney+. If you’re feeling a little more episodic, our guide for the best shows on Amazon might be just the ticket.\n\nIf you buy something using links in our stories, we may earn a commission. This helps support our journalism. Learn more.\n\nCome See Me in the Good Light\n\nWhen poet Andrea Gibson found out they were facing an incurable cancer diagnosis, they wrote a new bucket list of things to do in the time remaining. Director Ryan White’s Come See Me in the Good Light chronicles Gibson’s life during that time: the moments spent with partner and fellow poet Megan Falley; performances of their life's work; and “happiness being easier to find once we realize we do not have forever to find it.” An audience favorite at the Sundance Film Festival, White's documentary may be heart-wrenching, but it's also funny—and full of joy.\n\nThe Lost Bus\n\nSet during the Camp Fire in Paradise, California, in 2018, The Lost Bus tells the story of a school bus driver (played by Matthew McConaughey) who manages to get 22 children to safety as their community goes up in flames. Directed by Academy Award nominee Paul Greengrass, the movie is about the heroism of average people and the possibility of second chances. You know, all the good stuff.\n\nHighest 2 Lowest\n\nDirector Spike Lee's latest teams him up once again with longtime collaborator Denzel Washington to tell the story of David King, a music mogul who believes his son has been kidnapped and must figure out how to get him back. Also starring A$AP Rocky, this reimagining of Akira Kurosawa's 1960s classic High and Low is both a tense thriller and—like many of Lee’s best movies—a love letter to New York City and the music it makes. The film opened in theaters this summer and hit Apple's streaming service in September.\n\nBono: Stories of Surrender\n\nBono has a long history with Apple—one that goes back to the days when his silhouette marked the “Artists” icon on iTunes and the company was selling special U2 iPods. Now he’s working with the company to release Bono: Stories of Surrender, a movie version of his one-man show, in which he performed U2 songs and told the stories of his life. It also features some behind-the-scenes footage from the tour. You can also watch it in an immersive format on Apple Vision Pro.\n\nDeaf President Now!\n\nBilled as “the greatest civil rights moment most people have never heard of,” Deaf President Now! chronicles an eight-day standoff on the campus of a Deaf university in Washington, DC, in 1988. At the time, Gallaudet University’s board of trustees had named a hearing president over a pair of qualified deaf candidates. In response, the students staged a week-plus of protests, walkouts, rallies, and boycotts. Eventually the hearing president resigned and deaf dean I. King Jordan was named president. This documentary from Nyle DiMarco and Davis Guggenheim chronicles the students’ efforts using photography and sound design meant to immerse the audience in the Deaf experience.\n\nNumber One on the Call Sheet\n\nFor anyone who doesn’t know, “number one on the call sheet” just means “the star”—the most vital performer in any production. It’s a status that has eluded Black actors for generations. In this two-part documentary, some of Hollywood’s most well-known stars talk about their time trying to get to that coveted spot. Angela Bassett, Denzel Washington, Viola Davis, Jamie Foxx, Michael B. Jordan—Number One on the Call Sheet’s own call sheet is stacked with legendary performers telling the stories of how they got to the top, and what it means to be there.\n\nBlitz\n\nWritten and directed by Oscar-winner Steve McQueen (12 Years a Slave), Blitz shows World War II through the eyes of a 9-year-old boy named George (Elliott Heffernan). Sent by his mother Rita (Saoirse Ronan) to the safety of the English countryside, George escapes in an attempt to be rejoin his mom and grandfather in East London. What ensues is George’s harrowing quest to be reunited with his mom, but this is a McQueen film, so that’s only part of the story.\n\nFly Me to the Moon\n\nSo, you know that conspiracy theory about Stanley Kubrick faking the Apollo 11 moon landing? If you don’t, you really should go down a Wikipedia rabbit hole on that one. When you’re done, watch this Scarlett Johansson, Channing Tatum comedy about a marketing whiz (Johansson) who gets hired to film a mocked-up version of Neil Armstrong’s famous giant leap for mankind on the off chance the mission didn’t go as planned. This one has been on Apple TV for a while now and is still one of the service's most popular films currently. Probably with good reason. It's wild stuff, but no less wild than looking for clues to Kubrick’s secret involvement with NASA in The Shining.\n\nThe Last of the Sea Women\n\nOn the coast of South Korea's Jeju Island, women rule the sea. They're called haenyeo, and for centuries they have gone diving to harvest seafood. Sue Kim's new documentary follows these women—often referred to as real-life mermaids—as they struggle to keep their way of life in the face of societal and environmental changes. Emboldened by a new generation that wants to amplify haenyeo on social media, they may find a path after all. Produced by Malala Yousafzai, it's a journey into cross-generational unity and the value of tradition.\n\nThe World’s a Little Blurry\n\nWhen it originally came out in 2021, The World's a Little Blurry proved to be an unprecedented look into the life of pop phenom Billie Eilish as the then-teenager recorded her debut LP When We All Fall Asleep, Where Do We Go? Director R. J. Cutler got amazing access for the film, which chronicles everything from Eilish’s songwriting process with her brother Finneas to her frank talk about her Tourette’s. It also was only a small chapter of the singer's life. Now that she has won multiple Grammys and Oscars, started singing about eating girls for lunch, and performed at the Olympics Closing Ceremony, watching Blurry feels like opening a time capsule—in all the best ways. It’s the kind of music documentary that redefines the music documentary.\n\nThe Velvet Underground\n\nYou may think that director Todd Haynes only makes intense dramas like Carol and May December, but for this film he went deep into the art scene in New York City in the 1960s to unearth what happened when the Velvet Underground exploded a lot of people’s ideas of music. Piecing together new interviews with archive footage and even old Andy Warhol films, it captures a moment in music history that changed things forever.\n\nFancy Dance\n\nSet on the Seneca-Cayuga reservation in Oklahoma, Fancy Dance follows the journey of Jax (Killers of the Flower Moon’s Lily Gladstone), a woman who has been caring for her niece Roki ever since her sister, Roki’s mother, went missing. After the authorities deem Jax unfit to care for her niece, Roki is sent to live with her grandfather. Looking for answers, Jax takes Roki on the road to try to find her mother and ends up trying to escape the same authorities, who aren’t putting the same effort into finding her missing sister as they are in trying to find her. An examination of life on colonized land, Fancy Dance is also a thoughtful look at protecting community.\n\nGirls State\n\nDo you remember the 2020 documentary Boys State, about a group of young men in Texas who attend a summer program where the are challenged to form their own government? Girls State is similar—it even comes from the same filmmaking team of Jesse Moss and Amanda McBaine—but it follows a group of people who have never seen someone of their gender hold the office of US president. It's also set in Missouri, not Texas. Expect all the same wild ambition and heartbreak—and more than a few life lessons learned.\n\nNapoleon\n\nOK, so Napoleon didn’t exactly get critics’ pens flying, but sometimes you’re just in the mood for a big, prestige-y Ridley Scott historical drama, you know? This one stars Joaquin Phoenix as the title character, following his quest to conquer, well, as much as he possibly can. Rather than being a sprint to the Battle of Waterloo, however, this pic gives attention to the French emperor’s emotionally rocky relationship with his wife Joséphine de Beauharnais (Vanessa Kirby). What happens when a man can conquer most of Europe but not his own feelings? Watch and find out.\n\nKillers of the Flower Moon\n\nMartin Scorsese’s epic film is based on David Grann’s 2017 book about a member of the Osage Nation, Mollie Burkhart, who sought to get to the bottom of the deaths in her family. Set in 1920s Oklahoma, a time when many Osage were being killed for the money made from oil on their land, Scorsese’s film follows the relationship between Mollie (played by Lily Gladstone, who won a Golden Globe for her performance) and Ernest Burkhart (Leonardo DiCaprio) and what happens when the FBI comes to investigate the Osage deaths. When WIRED named it one of 2023’s best movies, we called it “a feel-bad masterpiece,” and we stand by that.\n\nFingernails\n\nCan technology determine whether you've found The One? Probably not, but in the latest from writer-director Christos Nikou, an institute run by Duncan (Luke Wilson) claims that it has found the formula for true love anyway—and Anna (Jessie Buckley) wants to figure out if it's real. The institute, you see, has determined that Anna and her boyfriend Ryan (Jeremy Allen White) are a match, but has doubts. While working at the institute, though, she meets Amir (Riz Ahmed) and finds someone who actually might be her match.\n\nFlora and Son\n\nRemember Sing Street, that charming indie about a kid in Dublin who starts a band as an escape from his complicated home life? What about Once, that charming indie about a pair that spends a week in Dublin writing songs about their love? If you enjoyed either of those—or if they just sound like something you might enjoy—let us suggest Flora and Son, a charming indie about a mother in Dublin trying to connect with her son through song. Like Sing Street and Once, Flora and Son comes from director John Carney and has all of his signature moves, plus something else: Eve Hewson, who plays the movie's titular mom. She's a force, and she hits all of her musician notes perfectly. Makes sense; she's Bono's daughter.\n\nStephen Curry: Underrated\n\nGolden State Warriors point guard Stephen Curry might be one of the most beloved players in American basketball—and he is definitely one of the best players, if not the best player, in the league. He has been named the NBA's Most Valuable Player twice and has won four championship rings. He also has more career three-pointers than anyone in the league. But in the late aughts, he was a kid at a small school, Davidson College, just trying to live up to the potential his coaches saw in him. Underrated, directed by Peter Nicks (Homeroom), chronicles that journey, showing how Curry bested the predictions of his own NBA draft (many said he didn't have the size necessary for the league) to become one of the greatest to ever play the game. For basketball fans, it's a must-watch.\n\nCODA\n\nThis is the one that put Apple TV on the map. The movie’s title is an acronym for “child of deaf adults.” It’s the story of Ruby, the only hearing person in a family that includes two deaf parents and one deaf sibling. When Ruby discovers a love of music, she's forced to reconcile her own aspirations with those of her family, who run a small fishing business and often need her to help communicate. Warm and gripping, CODA is the kind of movie that will have you cheering and crying at the same time.\n\nStill: A Michael J. Fox Movie\n\nIn 1985, Michael J. Fox was one of Hollywood’s biggest names as the star of a hit TV show (Family Ties) and the year’s highest-grossing movie (Back to the Future). Just a few years later, at the age of 29, Fox was diagnosed with Parkinson’s disease. In Still, Oscar-winning documentarian Davis Guggenheim offers a poignant portrait of Fox’s personal and professional life and his journey from teen idol to advocate for a cure.\n\nSwan Song\n\nMahershala Ali stars alongside, well, Mahershala Ali in this romantic-sci-fi-drama. Yes, it’s all of those things. Cameron (Ali) is a loving husband (to Naomie Harris) and father who, after learning he has a terminal illness, must decide just how far he’ll go to protect his family from having to know the truth, or deal with the devastating aftermath.\n\nSharper\n\nSharper is one of those movies where the less you know about it going in, the better. Just know that no one is what they seem or who they say they are in this neo-noir starring Julianne Moore, Sebastian Stan, Justice Smith, and John Lithgow. This twisty little thriller flew largely under the radar when it was released in theaters for a half-second in early 2023.\n\nCha Cha Real Smooth\n\n“Sundance hit starring Dakota Johnson”s are almost a dime a dozen, but this one, about a young bar/bat mitzvah party-starter is the, ahem, real deal. It also proves that Cooper Raiff—who writes, directs, and stars in the movie—is one to keep your eye on.\n\nThe Tragedy of Macbeth\n\nYes, most people already know the story of Macbeth—Scottish lord with an eye toward ruling his country—but not everyone has seen it through the eyes of director Joel Coen. Shot entirely in black and white and starring Denzel Washington as Macbeth and Frances McDormand as his powerful wife, the film was nominated for three Oscars and brought a very new twist onto a classic Shakespearean tale.\n\nTetris\n\nOne of the most popular video games of all time, Tetris was a phenomenon for Nintendo Game Boy owners in the 1980s. But Tetris (the movie) is the story of the people who made the game and brought it from the Soviet Union to the rest of the world. Part historical dramedy, part espionage flick, the movie doesn’t always hit its marks, but if you’ve never heard the story of how Tetris got out from behind the Iron Curtain, it’s worth a watch.\n\nCauseway\n\nCauseway kind of came and went when it was released in 2022, but that’s also the sort of movie it is. Focused on a soldier (Jennifer Lawrence) who returns home after suffering a brain injury in Afghanistan, the film from director Lila Neugebauer is about trauma and how people lean on each other to get through it. A worthy watch for the times when you have your own stuff to work through.\n\nSidney\n\nSidney Poitier died in 2022, the same year Apple TV released this documentary looking at the actor’s long-running career—In the Heat of the Night, Guess Who’s Coming to Dinner—and his impact on American culture and politics. With interviews ranging from Spike Lee and Morgan Freeman to Harry Belafonte, the film goes beyond his time in Hollywood, starting with his upbringing in the Bahamas and ending with his massive impact on the civil rights movement and elsewhere.",
  "authors": [
    "Angela Watercutter"
  ],
  "url": "https://www.wired.com/story/best-apple-tv-plus-movies/"
}