{
  "title": "The Polestar 4 takes EV minimalism to the next level",
  "text": "Since the launch of its Polestar 2 sedan in 2021, Swedish EV company Polestar has launched two additional models: the spacious 3 compact crossover SUV, and now the 4, a sporty, even more compact crossover SUV. The 4 slotting in between the 2 and 3 in size may confound some consumers, but one of its features — or lack thereof — may confound them even more. It has no rear windshield.\n\nStarting at $57,800, the 2026 Polestar 4 may have some mildly brain-twisting attributes, but I found it to be one of the most compelling and fun-to-drive EVs this year. It just took a little getting used to.\n\nIt just took a little getting used to.\n\nIts core trait is its minimalistic and very Swedish exterior design. The 4’s muscular figure, unique headlights, and interesting body lines give it solid presence. But the real elephant in the room is no glass on the rear hatch, which no doubt makes it stick out on the road. The reasoning, though, is fairly straightforward: it’s the only way that Polestar could give a compact crossover SUV such a sleek figure without sacrificing rear-seat passenger head or legroom.\n\nMission accomplished; my lanky stature fit surprisingly well with the seat just slightly reclined, and cargo volume is a respectable 19 cubic feet,with a high floor for easy loading and unloading that expands to 54 with the rear seats down. Up front, head, leg, and shoulder room were excellent.\n\nPrevious Next\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n1 / 9\n\nWhen it comes to tech and materials, there’s a 15.4-inch center touchscreen laid horizontally, a 10.2-inch digital gauge display, and a single physical knob in the center console for hitting play / pause and volume control. It may sound contradictory, but its Swedish minimalism is truly on full blast. Additionally, materials quality is solid, with substantial-feeling hard surfaces, negligible use of metal, and two types of opulent, synthetic woven materials comprising a large percentage of surface area. Finally, the infotainment software was logically laid out and easy to get used to, and sports custom lighting themes based on our solar system — this might be a subtle strategy for converting Tesla Model Y owners.\n\nThe Polestar 4 comes in two drivetrain configurations: single-motor rear-wheel drive and dual-motor all-wheel drive (tack on an additional $6,500 for this setup), with the former putting out 272 horsepower and 253 pound-feet of torque, whereas the latter produces 544 and 506, respectively, and 0–60s clock in at 6.9 and 3.7 seconds. The sole battery available is a 400-volt lithium ion pack with 100kWh of usable capacity, and will DC fast charge up to 200kW. Range reaches 310 miles for the single-motor, whereas the dual-motor tops out at 280.\n\nPrevious Next\n\n\n\n\n\n\n\n\n\n\n\n\n\n1 / 8\n\nIn standard dual-motor form, the 4’s ride quality was comfortable and steering was well weighted, though chassis response felt too sluggish for something marketed as a performance-oriented crossover. However, with Polestar’s $4,500 Performance Pack thrown in, adding performance-focused chassis tuning, Pirelli summer tires, and massive Brembo brake calipers, every input sharpened up nicely and with no sacrifice to ride quality.\n\nFinally, the head-scratcher of the Polestar 4’s driving experience: the lack of a rear window. Normally, I’m not a fan of having a rear-facing camera fed into a screen in the rearview mirror, but the 4’s wasn’t too bad. The camera shifts slightly left or right with a corresponding turn signal swipe, and the side-view mirrors do a good job at minimizing blind spots.\n\nStill, it felt odd to look over my right shoulder before changing lanes and, well, not see anything. And while Polestar personnel were particularly proud of the rear camera’s low-light resolution and performance in wet / wintry conditions, consumers’ mileage may vary depending on how icy and snow-laden their climates get.\n\nPrevious Next\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n1 / 11\n\nOverall, the 2026 Polestar 4 is a unique and compelling luxury EV compact crossover with enough fun-to-drive panache to make a spirited driving enthusiast out of anyone. But in light of the federal government ending EV tax credits, is this the best time to debut a more niche, sporty EV crossover?\n\nI asked Dean Shaw, PR and communications director for Polestar North America, what the company’s plan is. “We equate it to the December sales push. Sales slow down afterward in January, but then they start to slowly pick back up again,” he said. “We expect this month to be a complete reset, but then we expect sales to start building.”\n\nHe also pointed out that there are very few EV-only car brands; in light of other automakers backing off on their EV plans, he sees it as an opportunity for Polestar to really secure its place in the market. With the 4 sporting fun-to-drive personality, a heavy focus on design, and intuitive features throughout, he may be on to something. Even if there’s no glass behind the rear seats.\n\nPhotography by Peter Nelson",
  "authors": [
    "Peter Nelson"
  ],
  "url": "https://www.theverge.com/transportation/814717/polestar-4-review-specs-price-rear-windshield"
}