{
  "title": "Major League Baseball signs deals with Netflix, ESPN and NBCUniversal",
  "text": "Major League Baseball signs deals with Netflix, ESPN and NBCUniversal\n\nThe three-year agreements will help the league expand its reach, said Baseball Commissioner Robert D Manfred Jr.\n\nMedia companies ESPN and NBCUniversal also have acquired rights to other MLB-related programmes.\n\nNetflix, the world's largest streaming service, will air special baseball events that draw millions of viewers each year. These include the league's opening night exclusive and its Home Run Derby, where players compete to hit the most home runs.\n\nAmerica's Major League Baseball (MLB) has signed a slew of deals with broadcast and streaming giants to show select games for the next three seasons.\n\nStarting with the 2026 season, the new deal will grant ESPN the rights to MLB.TV, its on-demand service that lets viewers watch teams outside their local region, said MLB on Wednesday.\n\nIt did not give details on the expected subscription fees for MLB.TV or on the value of the three agreements.\n\nComcast-owned NBCUniversal, meanwhile, will take over the Sunday night games, bringing back regular games to its network for the first time in a quarter of a century.\n\nAs part of the deal, Netflix will also air the World Baseball Classic in Japan.\n\nThe agreements will spread MLB coverage across a variety of platforms.\n\nFox Sports will continue to air the World Series and other games, while Apple TV will stream Friday Night Baseball's back-to-back matches.\n\nThe deals were a result of ESPN reportedly opting out of the final three seasons of its contract this year, which would have given the channel the rights to many of these MLB programmes.\n\nThe contract would have cost ESPN more than $1.5bn (£1.15bn) over the next three seasons.\n\nESPN's opting-out led to drawn-out negotiations with the league and multiple platforms to show its matches.",
  "authors": [],
  "url": "https://www.bbc.com/news/articles/c4gjg38zyd8o"
}