{
  "title": "A Divisive Side Dish Finds Redemption",
  "text": "Advertisement\n\nA Divisive Side Dish Finds Redemption Sweet potato casserole wants to be loved. Halving the marshmallows lengthwise helps balance the sweetness on this traditionally sweet side. Credit... Ryan Liebe for The New York Times. Food Stylist: Simon Andrews.\n\nIn the brackish marshes of the American Northeast grows Althaea officinalis, the marsh mallow plant, whose tough, tan-white roots can be boiled and used in place of egg whites in a meringue, or gelatin in homemade marshmallows.\n\nThe Ancient Egyptians once harnessed the plant’s thickening powers, mixing its sap with honey and nuts for a confection considered a candy for the gods. Later, in the 19th century, when European confectioners replaced the sap with gelatin and figured out how to mass produce it, the marshmallow came down to earth.\n\nAnd lucky for us.\n\nWatch Eric Kim Make His Sweet Potato Casserole\n\nCredit... Matthew Young\n\nNow, every year on Thanksgiving, the grocery-store shelves are rife with marshmallows, ready to top many a sweet potato casserole. For some, that plush-topped Thanksgiving staple is a yearly burst of saccharine sunshine. For others, it’s a repulsion of gastronomic proportions. Why top an already sweet dish with sugary candy? To understand, it might help to look at the recipe’s creation.\n\nIn 1917, the Angelus Marshmallow company hired Janet McKenzie Hill, a prolific cookbook author, food scientist and the founder of The Boston Cooking School Magazine, to create recipes that used its marshmallows. One of those inventions was the casserole we know today: mashed DayGlo-orange sweet potatoes topped with bloomed and burnished snowy marshmallows.\n\nThe sweet potato casserole’s origin is closely tied to marshmallows. Credit... Ryan Liebe for The New York Times. Food Stylist: Simon Andrews.\n\nThis year, I wanted to create a decidedly savory version that made a case for marshmallows’ rightful place on top of the casserole — and alongside the turkey, stuffing, green bean casserole and macaroni and cheese. My reasoning was not just because the original called for them, but because there’s something satisfying about a root-vegetable dish topped with a candy with origins in nature.\n\nHere are my must-do recommendations for a dish that’s sweet, but not too sweet:\n\n1. Bake — don’t steam — your sweet potatoes\n\nThe Idaho Potato Commission recommends not wrapping your spuds in foil, since trapped steam can cause sogginess. Instead, bake them whole, naked on a sheet pan, to reduce their moisture, and look for caramelly bubbling — that’s how you know your sweet potatoes are truly cooking. Cooking them this way results in a fluffier mash and concentrates their naturally honeyed flavor. Your final casserole will taste even more sweet potatoey.\n\n2. Anchor the sweet with some savory\n\nBorrowing a little flavoring trick from the chef Nick Anderer of Anton’s and Leon’s in New York, I add woodsy bay leaves and fruity black pepper, steeped in heavy cream, which give the sweet potatoes an undeniable savoriness. You could use sage or thyme or rosemary, as well, but there’s nothing like the combination of mentholly bay leaf and sugar-white marshmallows.\n\n3. Halve the marshmallows vertically\n\nIn this recipe, the marshmallows are a necessary ingredient rather than a quirk: Halved vertically and toasted under the broiler, they create a thin, bittersweet shell that crackles and complements the potatoes, providing most of the dish’s sweetness.\n\n4. Finally, consider a nut, any nut\n\nThe sweet potato casserole might be associated with the American South, but Ms. Hill, its creator, was based in the North. When the root-on-root delicacy arrived in the South (most likely via her recipe booklets), the too-sweet marshmallows were swapped out for nuts, often in some form of streusel or praline. A handful of pecans, which are native to North America, scattered atop the marshmallows lends necessary richness and crunch.\n\nFollow New York Times Cooking on Instagram, Facebook, YouTube, TikTok and Pinterest. Get regular updates from New York Times Cooking, with recipe suggestions, cooking tips and shopping advice.",
  "authors": [
    "Eric Kim",
    "Eric Kim Is A Food Columnist For The New York Times Magazine",
    "A Recipe Developer",
    "Video Host For Nyt Cooking. A Native Of Atlanta",
    "He Is Also The Author Of The Cookbook",
    "Korean American."
  ],
  "url": "https://cooking.nytimes.com/article/sweet-potato-casserole-marshmallows-thanksgiving"
}