{
  "title": "Tussles break out between protesters and security at Cop30 in Brazil",
  "text": "There were tussles between protesters and security guards at the Cop30 climate talks late on Tuesday night, when a group of Indigenous and non-Indigenous people stormed the conference centre in Belém.\n\nSeveral dozen men and women, some in brightly coloured feather headdress, ran through the entrance, pushing at least one door off its hinges, before striding through the metal detectors and entering the Blue Zone.\n\nUN security guards rushed to stop them, leading to grabbing, shoving and yelling. At least one non-Indigenous man in the area was carrying a banner that read “Our forests are not for sale”. Others wore T-shirts saying “Juntos” (Together).\n\nThey waved banners and chanted until being forcibly removed. A UN climate spokesperson said two security guards received minor injuries, and there was minor damage to the venue.\n\nAfter the confrontation, the protesters left the venue and uniformed fire brigade officers formed a cordon to block the entrance.\n\nIt is not yet clear who was responsible for the intrusion. But at least one observer was impressed: “At last, something has happened here,” said Juan Carlos Monterrey-Gómez, a Panamanian climate negotiator.\n\nAgustin Ocaña, from the Global Youth Coalition, told the Associated Press some of the people entering were chanting “they cannot decide for us without us,” referring to tensions over participation of Indigenous people in the conference.\n\n\n\nAs security and marchers clashed, Ocaña said he saw protesters and security hitting each other with small plastic bins used to hold items near secure entrances. One guard was bleeding from being hit in the head, he said.\n\n\n\nOcaña said some Indigenous communities had been frustrated watching resources pour into building “a whole new city” in Belém when spending was needed on education, health and forest protection elsewhere. “They were not doing this because they were bad people. They’re desperate, trying to protect their land, the [Amazon] river,” he said.\n\n\n\nThe UN spokesperson said Brazilian and UN security personnel had taken “protective actions to secure the venue, following all established security protocols” and were investigating the incident. “The venue is full secured and Cop negotiations continue,” they said.\n\nUnlike the past three Cops, which were held in countries with varying degrees of authoritarian government, the Brazilian hosts are actively encouraging civil society and street demonstration to play a role in this conference.\n\nIndigenous groups and NGOs have already been more visible inside and outside the venue, helping to balance out the armies of lobbyists that have dominated recent climate gatherings. A “people’s summit” will be held on Thursday and Friday and a global youth rally will take place on Friday, with the biggest demonstration scheduled for Saturday.\n\nActivists have been growing in number over the past week and are already organising up to four events a day, all of which had been peaceful, until now. On Tuesday, there were protests by a feminist collective, pro-Palestine supporters and a health-and-environment group.\n\nMany more activists will arrive tomorrow in a flotilla, estimated at about 100 vessels, led by two of the Amazon rainforest’s most respected Indigenous leaders, Raoni Metuktire and Davi Kopenawa Yanomami.",
  "authors": [
    "Jonathan Watts",
    "Oliver Milman",
    "Dharna Noor"
  ],
  "url": "https://www.theguardian.com/environment/2025/nov/12/tussles-break-out-between-protesters-and-security-at-cop30-in-brazil"
}