{
  "title": "Telling a reporter ‘quiet, piggy’ was shocking – even for Trump | Margaret Sullivan",
  "text": "Catherine Lucey, who covers the White House for Bloomberg News, was doing what reporters are supposed to do: asking germane questions.\n\nHer query to Donald Trump a few days ago during a “gaggle” aboard Air Force One was reasonable as it had to do with the release of the Epstein files, certainly a subject of great public interest. Why had Trump been stonewalling, she asked, “if there’s nothing incriminating in the files”.\n\nHis response, though, was anything but reasonable.\n\nIt was demeaning, insulting and misogynistic.\n\nHe pointed straight at Lucey and told her to stop doing her job.\n\n“Quiet. Quiet, piggy,” said the president of the United States.\n\nFrom what I could tell, none of her colleagues in the press corps immediately rose to her defense. Things just moved on – business as usual, in a sense.\n\nAnd yet, if I were making a timeline of Trump’s use of the press as a punching bag, this moment would deserve a place on it. Maybe it was his pointing. Maybe it was his direct command, as if he were in charge of what a reporter is allowed to ask.\n\nMaybe – probably – it was the nasty name-calling, which is meant to put a reporter in her place in front of the world. Maybe – probably – it was the lack of protest from other reporters.\n\nThis, after all, is life in Trump’s America. Consider just the past day or so.\n\nTrump celebrated the Saudi crown prince, who, according to a 2021 US intelligence report, approved the killing of a Washington Post journalist, Jamal Khashoggi. (The crown prince has denied involvement in the killing.) The US president gave him a hero’s welcome to the White House.\n\nTrump insulted and threatened ABC News and its fine reporter Mary Bruce, who also asked germane questions, about Khashoggi as well as the Epstein files. “I think you are a terrible reporter. It’s the way you ask these questions,” he said. He called ABC a “crappy company” and said its license “should be taken away from ABC because your news is so fake and it’s so wrong”.\n\nWe’re supposed to be used to this by now.\n\nClearly, the president’s fervid supporters must approve of this sort of thing; they seem to see it as a way the president is using his power and position to diminish the “elite”, who he has taught them to despise.\n\nBut getting used to it is dangerous. We all get worn down. “What can you do?” shrug even the caring among us.\n\nBut, for me, “quiet, piggy” somehow breaks through. It should be a bridge too far, not business as usual.\n\nWouldn’t it have been something to see the entire press corps shout back at Trump, in defense of their colleague? Wouldn’t it have been something to see them walk away from the gaggle?\n\nWhy didn’t they?\n\n“Because access beats out solidarity, every day of the week,” Bill Grueskin, a former Miami Herald and Wall Street Journal editor who is a professor at Columbia Journalism School, posted on Bluesky. If any members of the press corps had somehow managed to push back and defend their colleague, they undoubtedly would have been punished by exclusion from these press briefings.\n\nSo, yes, the access problem.\n\nAnd I’m sorry to say, they also don’t push back because they’re so used to it. After all, it’s nothing new. It’s just an especially egregious example of what’s been going on for years.\n\nI’ve been watching these moves of Trump’s for a long time. I was the Washington Post’s media columnist during the entire first Trump term, so I got an up-close look at how he constantly disparaged the press and its representatives – especially women, and even more especially, women of color.\n\nHe often clashed, for example, with Yamiche Alcindor, who then covered the White House for the PBS NewsHour, condemning her supposedly “nasty” questions. This year, he called Alcindor, who now works for NBC, “second rate” and demanded that she, too, “be quiet”. He publicly called April Ryan, a longtime White House reporter, “a loser”.\n\nNothing changes – it only worsens – because Trump gets away with it. His stalwart supporters don’t seem to care. The members of the press corps may write a sternly worded letter (or not), but they normalize it, too, by their inaction.\n\nWill this “quiet, piggy” moment make a difference? Only for those who care about decency in public officials and in American society.\n\nMaybe that’s an old-fashioned notion. And I’m not sure there are enough of us who remember that it matters.",
  "authors": [
    "Margaret Sullivan"
  ],
  "url": "https://www.theguardian.com/commentisfree/2025/nov/20/trump-quiet-piggy-reporter"
}