{
  "title": "Vance pleads for ‘patience’ on the economy in sharp departure from Trump’s rhetoric",
  "text": "Vice President JD Vance on Thursday acknowledged that the Trump administration faces growing skepticism over its economic record, issuing a plea for patience ahead of what he predicted would be an eventual “economic boom.”\n\n“We get it and we hear you, and we know that there’s a lot of work to do,” Vance said during a Breitbart News event. “As much progress as we’ve made, it’s going to take a little time for Americans to feel that.”\n\nThe conciliatory tone represented a sharply different approach from the one taken in recent weeks by President Donald Trump, who has continued to insist that the economy is thriving while dismissing cost-of-living concerns as little more than a Democratic talking point.\n\nIt also underscored the White House’s ongoing efforts to calibrate its messaging on the economy ahead of next year’s midterm elections — and in the aftermath of GOP losses in New Jersey and Virginia earlier this month that voters indicated were driven in large part by deep disappointment with Trump’s domestic agenda.\n\nVance during his remarks conceded that Americans remained unhappy over the affordability issues that have weighed on those approval ratings, such as the price of groceries. At one point, he went as far as to undercut one of Trump’s key barometers of economic success — a decline in the price of eggs since January — by admitting that the food staple is still too expensive for many people.\n\n“If you’re an American who’s just struggling to get by, you work hard, you pay your taxes, you want your kids to have good opportunities. And then the price of eggs goes from $2 a dozen to $8 a dozen under the Biden administration, and then it goes from $8 a dozen to maybe $6.50 a dozen,” Vance said. “Well, to you that is still a major problem.”\n\nBoxes of eggs are seen at a Walmart supermarket in Houston, Texas, on May 15, 2025. Ronaldo Schemidt/AFP/Getty Images\n\nThe vice president sought to cast much of the blame for voters’ sour mood on former President Joe Biden, complaining that the prior administration had “put us in a very tough spot.” He also blamed Democrats for any near-term economic fallout from the record-long government shutdown.\n\n“I do think that actually pumped the brakes a little bit on all the economic news that we’re seeing,” Vance said of the shutdown. “That’s going to cause a little bit of damage.”\n\nThe vice president also celebrated a stronger-than-expected September jobs report released earlier on Thursday, calling it evidence that Trump’s policies were working.\n\nYet he allowed that the Trump administration still has plenty of work to do to convince voters that those policies stand to benefit them, departing from the president’s preferred approach of touting his agenda as an unqualified success.\n\nAt a US-Saudi Investment Forum a day earlier, Trump dismissed the focus on affordability, calling it a “new word” that Democrats have latched on to since he took office.\n\n“The only thing that we’re going up in is our stock market, okay, we’re bringing prices down,” Trump said, despite the rise in the cost of key products like beef and coffee that economists have blamed at least in part on the administration’s tariffs. “But they came up with a new word that they’re using: affordability.”\n\nThe president in speeches and social media posts since Democrats’ electoral victories earlier this month has also called affordability concerns a “con job,” urging voters to credit him for falling gasoline prices and an inflation rate that’s come down from its Biden-era peak — but begun over the last several months to slowly climb once again.\n\nThe White House has floated a range of initiatives aimed at reining in the cost of living despite Trump’s insistence that prices are falling, including rolling back tariffs on hundreds of products and raising the prospect of sending $2,000 checks to Americans at some point next year. Trump is also expected to step up domestic travel in the coming months focused on promoting his economic agenda, as aides try to boost voter awareness of the administration’s accomplishments.\n\nTrump aides are also planning to pitch a new health reform plan ahead of the expiration of enhanced Affordable Care Act subsidies amid GOP fears that the party will pay a hefty political price if voters’ health insurance costs skyrocket.\n\nBut the administration has offered few details about what that plan will look like. Though Vance on Thursday claimed the eventual proposal would get bipartisan support, he did not provide specifics.\n\nThe vice president also offered few new strategies for ushering in the booming economy that he said “we really do believe is coming,” arguing only that the administration needed a bit more time to realize its goals.\n\n“The thing I’d ask from the American people is to ask for a little bit of patience,” Vance said. “We just gotta keep it going.”",
  "authors": [
    "Adam Cancryn"
  ],
  "url": "https://www.cnn.com/2025/11/20/politics/jd-vance-economy-patience-trump"
}