{
  "title": "Amazon’s grocery store dreams are reshaping Whole Foods",
  "text": "is a news writer who covers the streaming wars, consumer tech, crypto, social media, and much more. Previously, she was a writer and editor at MUO.\n\nPosts from this author will be added to your daily email digest and your homepage feed.\n\nAmazon built a portal to Kraft Mac & Cheese, Goldfish crackers, and Nestlé Drumsticks inside one of its Whole Foods stores — and it plans to do the same at others. In a blog post on Wednesday, Amazon details a Whole Foods concept store in Plymouth Meeting, Pennsylvania, where shoppers can order grocery items from Amazon using QR codes scattered throughout the supermarket.\n\nThe Pennsylvania concept store has a built-in “microfulfillment center” packed with products that you wouldn’t normally find inside Whole Foods. When a customer places an order from Amazon, autonomous “ShopBot” robots developed by a company called Fulfil will begin to retrieve the products. Customers will then receive a text notification when their order is ready for pickup at the Amazon pickup and returns counter inside the store.\n\n“As we gather customer feedback from this first location, we plan to refine and expand this offering to additional stores over time,” Amazon says.\n\nA report from The Wall Street Journal first highlighted the Pennsylvania-based Whole Foods concept store last year. This new post from Amazon provides even more information about the format, which attempts to sneak more products into Whole Foods without tarnishing the store’s reputation for selling natural and organic goods. Amazon also launched a separate experiment in Chicago that puts an Amazon Fresh store right next to a Whole Foods.\n\nAmazon’s grocery business has only become more intertwined with Whole Foods over the past year. In January, Amazon appointed Whole Foods CEO Jason Buechel as the VP of Amazon’s grocery business, and it plans to turn Whole Foods’ corporate workers into Amazon employees in December.\n\nAlong with allowing shoppers to place orders while inside the Plymouth Meeting Whole Foods, Amazon says local customers can also place orders online, which they can then pick up in store or have delivered. “We’re making grocery shopping more convenient for customers by thoughtfully blending our grocery offerings and leveraging new fulfillment capabilities in creative ways,” Buechel says.",
  "authors": [
    "Emma Roth"
  ],
  "url": "https://www.theverge.com/news/814454/amazon-whole-foods-fulfillment-concept-store"
}