{
  "title": "Come il caso Epstein è esploso tra le mani di Trump",
  "text": "Quando Greene ha iniziato a promuovere Qanon, diversi anni prima di essere eletta al Congresso, la cospirazione stava ancora muovendo i primi passi e aveva solo un manipolo di seguaci convinti. Trump è diventato in breve tempo l'eroe di questa narrazione, l'uomo che combatteva il \"deep state\" per dare il via alla “tempesta” che avrebbe smascherato i membri della congrega – da Epstein ai Clinton – e portato alla loro esecuzione pubblica. Il presidente americano, che ha dichiarato di aver chiuso i rapporti con Epstein intorno al 2004, ha usato la comunità di Qanon per il suo tornaconto personale, elogiandone i seguaci nella campagna presidenziale del 2020 e sostenendo la corsa al Congresso di Greene.\n\nNel tempo, Q è tornato ripetutamente a parlare di Epstein, sostenendo per esempio che il finanziere avesse una \"cella sotterranea\" sulla sua isola, oltre a \"stanze del sesso e della tortura\". Nel frattempo, la comunità di Qanon si è convinta che Trump fosse sul punto di denunciare pubblicamente la congrega segreta (Q e i suoi seguaci hanno convenientemente tralasciato il fatto che Trump era già presidente all'epoca, e teoricamente avrebbe potuto smascherare chiunque volesse).\n\nNel luglio del 2019, Qanon ha festeggiato il nuovo arresto di Epstein per traffico sessuale di minori: la tanto attesa \"tempesta\" era finalmente arrivata. Ma in diversi post, Q ha invitato i suoi adepti alla cautela, lasciando intendere che stava per accadere qualcosa di brutto. Quando il mese successivo Epstein è stato trovato morto nella sua cella a Manhattan, molti hanno visto nell'episodio la conferma dell'affidabilità di Q. Altri, ormai condizionati a non credere a nulla, si sono convinti che in realtà Epstein fosse ancora vivo, salvato dai membri della congrega per evitare che le loro identità venissero alla luce.\n\nIl tradimento delle promesse di Trump\n\nDopo la rielezione nel 2024, Trump – che in campagna elettorale aveva ripetutamente promesso di rendere pubblici i cosiddetti Epstein files – ha continuato ad assecondare i più complottisti tra i suoi sostenitori. Su Truth, il suo social, il presidente ha fatto da megafono a contenuti legati a Qanon quasi mille volte. Le teorie del complotto su Epstein erano tracimate: diverse figure di rilievo nell'orbita di Trump promuovevano le cospirazioni di Qanon anche senza il “brand” Qanon. E al centro di tutto questo c'erano gli incessanti appelli a divulgare i documenti sul caso Epstein. Tra le voci più forti della destra americana che richiedevano a gran voce la pubblicazione dei file c'erano Kash Patel e Dan Bongino, due ex influencer conservatori che Trump ha nominato rispettivamente direttore e vicedirettore dell'Fbi.",
  "authors": [
    "David Gilbert"
  ],
  "url": "https://www.wired.it/article/caso-epstein-trump-proteste-destra-americana-qanon-complotti/"
}