{
  "title": "Colossal Biosciences Acquires Viagen, the Leader in Animal Cloning",
  "text": "DALLAS--(BUSINESS WIRE)--Colossal Biosciences, the world’s de-extinction company, today announced its acquisition of Viagen Pets and Equine, the global leader and expert in animal cloning. Viagen provides genetic preservation and cloning services for pets, equine, and some of the world’s most endangered species. The Texas-based company will continue to operate under its current leadership as a wholly owned subsidiary of Colossal while expanding its endangered species cloning platform to additional threatened species and countries worldwide.\n\nThis marks Colossal’s first acquisition, following the successful gestation of two announced companies — Breaking and Form Bio —since the company’s launch in 2021.\n\n“Colossal is thrilled to welcome Viagen, the world’s leading cloning company, into our portfolio,” said Ben Lamm, Founder and CEO of Colossal. “No other company comes close to what Viagen has achieved. Their unmatched expertise and cloning technology stack have become the world’s standard and their application of these critical and proprietary technologies to endangered species conservation makes them an invaluable partner in advancing our global de-extinction and species preservation mission.”\n\nFounded in Austin, Texas in 2002, Viagen has grown from a livestock and genetic preservation company into the global leader in animal reproduction and preservation services for pets, equine, livestock, and endangered species. Over the years, the company expanded through key acquisitions and partnerships, gaining exclusive licensing and access to the breakthrough technologies developed by the Roslin Institute of Edinburgh, best known for cloning Dolly the sheep.\n\nViagen will continue to be led by President Blake Russell, who has had a successful 25-year career in the animal genetics business and responsible for general management and operations. “Joining forces with Colossal — the only de-extinction company and leader in biotechnology — gives Viagen the scale, resources, and shared vision to expand what we can do,” said Russell. “Together, we can accelerate breakthroughs in genetic preservation, animal health, and endangered species recovery through biobanking and cloning at a scale that simply wasn’t possible on our own.”\n\nUsing groundbreaking technology to advance animal conservation, Viagen’s team has successfully cloned 15 species — including many world-firsts such as the black-footed ferret and Przewalski’s horse; and the Grevy’s zebra is currently in gestation. Viagen has optimized protocols that deliver success rates approaching 80% in multiple species, far exceeding published averages of 2%. They have also cultured and bio banked more than 40 unique species including 22 threatened or endangered species such as the White rhino, Black rhino, Florida bonneted bat, Perdido beach mouse and Indiana bat. These achievements firmly establish Viagen as the global leader in animal cloning, setting unmatched benchmarks for innovation, efficiency, and conservation impact.\n\nViagen has also been at the forefront of cryopreservation, a process that preserves biological samples by freezing materials at extremely low temperatures to halt their metabolic activity and degradation. This technique also allows for the later revival of the frozen materials. Cryopreservation is an essential tool in biobanking for ensuring the long-term quality and integrity of stored samples. Using a combination of its advanced cloning technology and its ability to reanimate frozen cells, Viagen achieved another historic first when they successfully cloned two critically endangered Przewalski’s horses (one in 2020, another in 2023) from tissue that had been cryopreserved at the San Diego Zoo back in 1980.\n\n“At Colossal we believe cryopreservation and cloning are essential tools to preserve, revive and restore biodiversity,” said Matt James, Chief Animal Officer and Executive Director of the Colossal Foundation. “Viagen’s proprietary technology will fuel Colossal’s de-extinction efforts and allow us to restore more endangered species populations as well as preserve their genetic diversity in Colossal’s Bio Vaults.\"\n\nDr. Shawn Walker, Ph.D., Chief Science Officer of Viagen and one of the world’s leading cloning experts for more than twenty years said, “Partnering with Colossal Biosciences presents an extraordinary opportunity to apply our advanced cryopreservation and cloning techniques to the ambitious goals of de-extinction and species restoration. Colossal’s innovative approach aligns with our mission to preserve genetic diversity and support conservation efforts globally. We are excited to see how this collaboration can advance science globally.”\n\nIn 2022, Viagen expanded beyond cloning into advanced reproductive technologies for horses. The company introduced Intracytoplasmic Sperm Injection (ICSI) services to the equine market — a specialized technique in which a single sperm is injected directly into an egg, empowering breeders with the ability to select the sex of foals. Leveraging Viagen’s leadership in the work of Somatic Cell Nuclear Transfer (SCNT), and decades of experience in the U.S. horse industry, Viagen seamlessly entered the ICSI space with unmatched expertise and innovation. Today, through cutting-edge technology, personalized care, and an exclusive license for Sexed Semen Technology from ST Genetics in the U.S. and Canada, Viagen continues to lead the field of advanced equine breeding science.\n\nViagen and its 25 employees will maintain their Texas headquarters while integrating its team and expertise into Colossal’s technology platform and its broader de-extinction and species preservation pipeline.\n\nABOUT VIAGEN\n\nFounded in Austin, Texas, in 2002, Viagen is the world’s leading cloning company, specializing in advanced animal reproduction and preservation services for pets, equine, and endangered species. After two decades as the exclusive licensee of Somatic Cell Nuclear Transfer (SCNT) technology from the Roslin Institute of Edinburgh, the team behind Dolly the sheep, Viagen has expanded its reach globally, offering cutting-edge cloning services supported by a strong portfolio of proprietary technologies. At the forefront of cryopreservation and genetic innovation, Viagen is driven by a commitment to the health and well-being of every animal. Its team of leading scientists continues to advance animal genetic research to safeguard biodiversity and benefit species worldwide.\n\nABOUT COLOSSAL\n\nColossal was founded by emerging technology and software entrepreneur Ben Lamm and world-renowned geneticist and serial biotech entrepreneur George Church, Ph.D., and is the first to apply CRISPR technology for the purposes of species de-extinction. Colossal creates innovative technologies for species restoration, critically endangered species protection and the repopulation of critical ecosystems that support the continuation of life on Earth. Colossal is accepting humanity's duty to restore Earth to a healthier state, while also solving for the future economies and biological necessities of the human condition through cutting-edge science and technologies. To follow along, please visit: www.colossal.com.",
  "authors": [],
  "url": "https://www.businesswire.com/news/home/20251104133137/en/Colossal-Biosciences-Acquires-Viagen-the-Leader-in-Animal-Cloning"
}