{
  "title": "Emma Stone and Jesse Plemons Go Together Like Spaghetti and Meatballs",
  "text": "Advertisement\n\nEmma Stone and Jesse Plemons Go Together Like Spaghetti and Meatballs The stars of “Bugonia” dropped by the New York Times kitchen studio to make a familiar favorite. Credit... Taylor Miller for The New York Times\n\nIn “Bugonia,” Emma Stone stars as a high-powered chief executive taken hostage by a conspiracy theorist, played by Jesse Plemons, who thinks she is an alien sent to destroy the planet. The film has a pivotal scene involving spaghetti and meatballs, so we asked the actors to make the dish from scratch.\n\nWatch the full video below (or on YouTube) to see them make a classic take on the recipe from a friend of the “Bugonia” press team, and read ahead for excerpts from the interview and the outtakes, which have been edited and condensed.\n\nCredit... Victoria Chen\n\nDid you actually eat the dish on set?\n\nEMMA STONE I ate a little bit of it on set. Although I did think later on “Why was I eating this?” because you could have done anything to that food. So why would Michelle have eaten that? Michelle is my character.\n\nJESSE PLEMONS Considering what we had just been through right before that, maybe you were just a little hungry. Or were scared not to eat it. I made it look so nice.\n\nSTONE You did, it was beautiful.\n\nDo either of you like to cook?\n\nSTONE I do like to cook. I don’t do it often enough. I love to bake.\n\nPLEMONS I cook a great soft-boiled egg for breakfast. But that’s kind of it.\n\nHave you ever cooked for each other?\n\nPLEMONS No, but you’ve turned me onto Hippeas though.\n\nSTONE Oh yes Hippeas are excellent. That’s not really cooking, though.\n\nPLEMONS We share snacks.\n\nSTONE We snack.\n\nEmma, what’s your go-to baking recipe?\n\nSTONE I have a chocolate chip cookie recipe that I found, that I make the most lately, because I have a kid who loves chocolate chip cookies. I’m sure most people have heard of this one that you drop on the door of the oven.\n\nJesse, besides your soft-boiled egg, is there anything else you like to make?\n\nPLEMONS Soft scrambled.\n\nSTONE Hard-boiled eggs? All eggs.\n\nPLEMONS That’s pretty much it. And then my kids’ lunches. You know, you have to get creative.\n\nSTONE What do you do for the lunches?\n\nPLEMONS It took me … I’m curious, if Lou [Emma’s daughter] has any food phobias.\n\n[Emma nods yes]\n\nPLEMONS Yeah? Because when our oldest was going into kindergarten, my wife made this whole beautiful array of sandwiches to see what was his favorite pack in the school lunch. And he has some fear of sandwiches where it almost caused a breakdown. Finally we just gave up and then, maybe six months ago, we tried again. Just a dry ham and cheese sandwich [shrugs] he’ll eat.\n\nCan we talk about how Yorgos [Lanthimos, director of “Bugonia”] suggested adding mustard to the meatballs you’re making?\n\nPLEMONS He knew that we were doing this and was like: [Jesse impersonating Yorgos’s Greek accent] “You should add mustard. It’s the Greek way. They’ll be impressed.” I don’t know if anyone was impressed when I said mustard.\n\nHave either of you worked in the food industry?\n\n[both laughing]\n\nSTONE Uh, yeah!\n\nPLEMONS Does it look like it?\n\nSTONE Yup!\n\nPLEMONS What if we said yes?\n\nEmma, do you have any family signature dishes?\n\nSTONE We make some amazing rolls. My great-grandmother was Swedish, and my grandfather always made — we call them granny’s rolls — they’re like a beautiful kind of crescent roll with an almond vanilla glaze that we make each Christmas and Thanksgiving. That’s a tradition. And there was a tradition for a good amount of time that my grandma would make, which is ham loaf. Have you ever had ham loaf? It’s like meatloaf made of ham. We always had it at Christmas, and I don’t really need to eat ham loaf again.\n\nIf you were a food dish, what would you be? Can you answer for each other?\n\nPLEMONS OK, I’m trying to think of something that is sort of elegant, refined, yet not too stuffy. Not too serious but tastes great. Oh, you know one of those Japanese omelets?\n\nSTONE Oh yeah.\n\nPLEMONS God those are good. It’s like, simple but lotta technique going on.\n\nSTONE I was going to say for you.\n\nPLEMONS Just a peanut butter and jelly sandwich.\n\nSTONE Peanut butter and jelly sandwich! No, I was going to say a steak. Like a gorgeous steak, because you can cook it so many ways. It can be very rare, raw, vulnerable, but then it can be tough. Anyway you slice it, it’s always delicious.\n\nFollow New York Times Cooking on Instagram, Facebook, YouTube, TikTok and Pinterest. Get regular updates from New York Times Cooking, with recipe suggestions, cooking tips and shopping advice.",
  "authors": [
    "Victoria Chen"
  ],
  "url": "https://cooking.nytimes.com/article/emma-stone-jesse-plemons-bugonia-spaghetti"
}