{
  "title": "Those Dire Wolves Aren’t an Amazing Scientific Breakthrough. They’re a Disturbing Symbol of Where We’re Heading.",
  "text": "Sign up for the Slatest to get the most insightful analysis, criticism, and advice out there, delivered to your inbox daily.\n\nOn Monday, the biotechnology company Colossal Biosciences revealed, with much fanfare, that they have created a trio of white wolf hybrids. Named Romulus, Remus, and Khaleesi, these wolves, Colossal says, were created by making 20 edits on 14 gray wolf genes. These were used to generate hybrid cell lines that were placed in donor eggs, carried to term by domestic dogs. Four pups were born, one of which died. The surviving three now run around a 2,000-acre private facility in the United States where they are “continuously monitored.” It seems that the wolves may never know life outside some kind of confinement.\n\nThe company calls these creatures dire wolves, claiming to have brought the species Aenocyon dirus back from extinction. Exactly what Colossal accomplished, however, is opaque. The private company did not publish a scientific, peer-reviewed paper along with its media blitz—there was a flurry of credulous articles that I’m sure you’ve seen on your news feeds—though they promise that a paper is coming next week. A spokesperson told Slate on Wednesday afternoon that the paper has been submitted for peer review, and a preprint version “is being submitted” and should be posted in a day or two. For now, we have precious little to go on outside of the company’s own claims.\n\nSo, did Colossal actually de-extinct a long lost species? Well, the dire wolf is in the details.\n\nFirst, dire wolves and gray wolves, like the ones whose genes Colossal modified, evolved independently from each other over millions of years, though the exact degree to which they are related might depend on whom you ask. In 2021 a multidisciplinary group of researchers found that fossil dire wolves, like those found by the thousands in L.A.’s La Brea asphalt seep, were not closely related to the wolves that roam our planet today. Dire wolves appeared to be descendants of an older line of canids (the larger family that includes everything from domestic dogs to foxes) that split off from other canids about 5 million years ago. Though they are genetically closer to jackals, they convergently evolved to resemble gray wolves. The skeletal resemblance can be close enough that even experts sometimes have difficulty properly identifying a dire wolf fossil from a prehistoric gray wolf one. When dire wolves went extinct about 10,000 years ago, gray wolves became more numerous and expanded to fill the niches dire wolves left open.\n\nAdvertisement\n\nAdvertisement\n\nAdvertisement\n\nAdvertisement\n\nThat’s the current thinking, anyway—as with anything in science, new evidence can change things. Now, Colossal’s own researchers have claimed to journalists that their research has again adjusted the picture, proposing that dire wolves arose from interbreeding between two different wolf lineages between 2.5 million and 3.5 million years ago. This would put them a bit closer to gray wolves. It will be useful to see their reasoning for this shift outlined in a scientific paper, in a format where their techniques can be critiqued by other experts, which is a crucial part of scientific research. But even so, it’s hard to imagine that even a “mere” 2.5 million years of evolutionary change can be captured by 20 gene edits. (According to a statement from Colossal Biosciences sent to Slate, the company aimed “to resurrect the key traits that defined dire wolves.” Its team stopped at 20 edits“[b]ecause we didn’t need more” and because every edit poses some risk to the goal of birthing a health animal.)\n\nAdvertisement\n\nThen there’s the Biology 101 fact that an organism is not just its genome. Even if Colossal did make a wolf with a complete Aenocyon dirus genome, those genes would not dictate every choice and every behavior of the creatures they belonged to. The reality is that genes interact with environments, and organisms emerge from the interplay from the two. We know from the fossil record that dire wolves were social creatures, but we’re too late to observe exactly how each generation of pups learned skills from the one before it. Romulus, Remus, and Khaleesi do not have dire wolf parents to learn from—and we have absolutely no way of knowing whether they are truly behaving like dire wolves at all.\n\nAdvertisement\n\nAlso, it doesn’t necessarily make sense that these wolf pups have snowy white coats! It can easily go unquestioned that a wolf alive in the Ice Age would have a snowy coat, but the fact is that real dire wolves ranged widely and often lived in habitats, like prehistoric La Brea, that were warmer and more shrubby than snowy. After all, the pups of gray wolves—which Colossal suggests are nearly identical genetically to dire wolves—are often born with darker, brown coats that shift as they age. We don’t know for sure what color dire wolves were. Neither does Colossal. The discovery of a dire wolf mummy could help settle the uncertainty—Ice Age gray wolf pups have been found before, so it’s a possibility—but such a fossil has not been uncovered yet.\n\nAdvertisement\n\nWhat we’re really looking at, it seems, are gray wolves modified to be dire wolves of George R.R. Martin’s books rather than living, breathing replicas of the actual prehistoric carnivores that hunted bison, horses, camels, and baby mammoths in packs during the Pleistocene. They look like the animal actors on the HBO adaptation of Game of Thrones. Given that Martin is both an investor in and adviser to Colossal, it feels awfully convenient that the company is heavily promoting wolves that are the spitting image of those in his fantasy series. The canids might be “dire wolves” in the fictional sense, but they are not literally dire wolves. Romulus, Remus, and Khaleesi are, at best, a shaky hypothesis of what dire wolves might have looked like. As creatures that were created by modifying modern organisms, and who live in modern times, they are untethered from the evolutionary history embodied by the real dire wolves who now rest in the fossil record. Sure, Colossal has, perhaps, done something here. But Colossal’s wolves are not dire wolves, and they never will be. “As one of our founders stated, ‘this is the moon landing of synthetic biology,’ ” Colossal told Slate in a statement. But the fact is that gene editing can’t reconnect the social lives and ecological roles of animals that have been extinct for thousands of years. Trying to “bring back” dire wolves by modifying gray wolves is like saying you can reach the moon if you jump really high on a trampoline. Maybe you can get an inch closer than you could before. Maybe you can put the trampoline on a platform, too. But you’ll never arrive.\n\nAdvertisement\n\nAdvertisement\n\nAdvertisement\n\nAdvertisement\n\nTo put it another way, Colossal’s dire wolves are like Tesla’s disastrous Cybertruck. I don’t think it’s a coincidence that the co-founder of Colossal is a billionaire. Someone rich felt a pang of nostalgia and made a demand. The infamous and ugly Cybertruck was inspired by video game vehicles. Colossal’s wolves are prestige TV creatures. This kind of thinking is everywhere: Blue Origin is sending Katy Perry way high up into the sky, a stunt to help sell a sci-fi daydream of one day taking a bus to Moon. This isn’t progress; it’s a bunch of toys. Meanwhile, the government is actively gutting science and health agencies, and firing people who do the challenging and often-unglamourous work that research involves—not for personal glory and a shiny press treatment, but simply to advance knowledge and make the world better for the humans and creatures who already live here. Careful and painstaking conservation work, such as the work restoring wood bison herds to Alaska, is overlooked in favor of designer species given meme-sprinkled promo reels.\n\nAdvertisement\n\nFacts, as we have bitterly learned over the past two decades, count for little right now. Colossal’s very questionable marketing of its genetic tinkering has already prompted Donald Trump’s oil-friendly Secretary of the Interior Doug Burgum to insinuate that the endangered species list will be a thing of the past if we can just refresh and resurrect species at will. “[T]he status quo is focused on regulation more than innovation,” he posted on X. To say Colossal is the future of conservation is to task the offensively wealthy with deciding the future of life on Earth. Any number of environmental injuries and insults can be justified if we believe that everything can be placed back how it was with a little innovation. Looking at Colossal’s wolves, I don’t even feel a “wow” moment like Ellie Sattler had spotting an InGen-made Brachiosaurus in Jurassic Park. I hurt for these wolves, creatures wholly unaware that they were created to be trophies.",
  "authors": [
    "Riley Black",
    "Shannon Palus"
  ],
  "url": "https://slate.com/technology/2025/04/dire-wolf-colossal-de-extinct-conservation-science-research-paper.html"
}