{
  "title": "Tassa sui contanti, Fratelli d'Italia vuole alzare ancora il limite, ma stavolta introducendo un balzello per chi li usa",
  "text": "La maggioranza di governo di destra ha presentato una proposta che sta facendo discutere. Una sorta di tassa sui contanti. Un emendamento di Fratelli d'Italia alla legge di bilancio 2026 prevede infatti di alzare il tetto ai pagamenti in contanti da 5.000 a 10.000 euro a partire dal primo gennaio 2026, introducendo però un vincolo rilevante: chi usa banconote per pagamenti tra 5.001 e 10mila euro dovrà versare una tassa fissa di 500 euro ogni volta. La proposta, firmata dal senatore Matteo Gelmetti, permette dunque di usare più contanti rispetto a oggi ma rende l'operazione costosa, richiedendo anche una fattura cartacea da consegnare al venditore in modo da permettere all'Agenzia delle entrate di effettuare i controlli necessari.\n\nUna proposta che spacca la politica\n\nL'Italia ha cambiato spesso negli anni il limite massimo per pagare in contanti, riflettendo le diverse sensibilità politiche sul tema della tracciabilità finanziaria. Dopo essere sceso a 1.000 euro nel 2020, il tetto era già stato alzato a 5mila euro dal primo gennaio 2023 dal governo Meloni attraverso il decreto Aiuti-quater, invertendo così la tendenza dei governi precedenti che avevano ridotto progressivamente l'uso delle banconote. La nuova proposta della destra andrebbe ancora più avanti in questa direzione e si pone in contrasto diretto con le indicazioni della Banca d'Italia, che nel dicembre 2022 aveva avvertito che allentare i vincoli sull'uso del contante avrebbe fatto crescere l'economia sommersa in un paese dove dove l'evasione fiscale (il cosiddetto tax gap) vale ogni anno circa 100 miliardi di euro.\n\nLa tassa sui contanti da 500 euro rappresenta tuttavia una novità rispetto alle proposte passate, dal momento che prova a dare più libertà nell'uso dei contanti cercando al contempo di scoraggiarlo attraverso un costo fisso che potrebbe anche portare soldi nelle casse dello stato. Tuttavia, proprio l'efficacia di questa tassa fissa solleva però dubbi sulla sua capacità di fermare i movimenti illegali di denaro. Per chi ha infatti bisogno di spostare soldi senza lasciare tracce, pagare 500 euro per muovere fino a 10mila euro in contanti rappresenta un costo contenuto, soprattutto se confrontato al fatto che un bonifico bancario costa zero o quasi.\n\nL'Europa vuole regole comuni\n\nAl di là del dibattito nazionale, la proposta italiana arriva in un momento particolare per le regole europee sui pagamenti in contanti. Il Regolamento Ue 2024/1624, approvato dal Parlamento europeo nell'aprile 2024 e dal Consiglio nel maggio successivo, ha infatti stabilito un limite uguale di 10mila euro per tutti i paesi dell'Unione che diventerà obbligatorio dal dieci luglio 2027. Il regolamento fa parte di un pacchetto più ampio contro il riciclaggio di denaro sporco e vuole rendere più difficile usare i contanti per attività criminali, lasciando comunque ai singoli paesi la possibilità di tenere limiti più bassi se lo ritengono necessario.\n\nPiù nel dettaglio, l'articolo 80 del Regolamento 1624 del 2024 stabilisce che le aziende nell'Unione europea non potranno accettare pagamenti in contanti sopra i 10mila euro, né in una sola volta né attraverso più operazioni collegate. Il regolamento precisa però che il limite non vale per le vendite tra cittadini privati che non agiscono per lavoro o per affari. Le nuove regole europee impongono inoltre ai commercianti di chiedere il documento d'identità per pagamenti in contanti sopra i 3mila euro.",
  "authors": [
    "Riccardo Piccolo"
  ],
  "url": "https://www.wired.it/article/tassa-contanti-manovra-proposta-fratelli-italia/"
}