{
  "title": "Luxury expeditions set sail into Indonesia’s remote east",
  "text": "EDITOR’S NOTE: This CNN Travel series may have adjacent ads by the country it highlights. CNN retains full editorial control over subject matter, reporting and frequency of the articles and videos, in compliance with our policy.\n\nIt’s only taken a few hundred years, but the “Spice Islands” region of eastern Indonesia — now known as the Maluku Islands — is once again attracting attention.\n\nVirtually off-the-grid for global travelers just two decades ago, the archipelago and its hundreds of islands, along with several surrounding regions, are now on the bucket list of travelers craving new and unusual adventures at sea — all complemented by modern, high-end amenities.\n\nRanging from some of the most famous names in luxury hospitality to posh private yachts, there are more than a dozen options to explore the islands that sparked a 16th- and 17th-century “spice rush” for cloves, nutmeg and mace by Portuguese, Dutch and British traders, who could fetch high prices for their flavorsome commodities back in Europe. Most of these cruises also include journeys into neighboring regions like Raja Ampat, which is often referred to as ‘the last paradise on Earth’.\n\n“The far eastern isles of Indonesia are a true frontier,” says hospitality consultant Jason Friedman, who works with the Kudanil Explorer, a steel-hulled luxury expedition yacht that offers charters for $23,000 per night.\n\nRaja Ampat's Karawapop Lagoon. Lamima\n\nFilled with astonishing biodiversity, he says they offer a true sense of remoteness that can only be explored by boat.\n\n“It’s a place where coral reefs explode with color, volcanoes rise from untouched seas, and ancient cultures thrive in isolation,” adds Friedman.\n\n“Every island tells a different story, with traditions and languages found nowhere else. There’s simply no other place on Earth that feels this wild, authentic and alive.”\n\nCarolyn Coenen, an Asia-Pacific regional specialist for Wilderness Travel, says the region has become increasingly popular with people “who want to be blown away” by the insane amount of underwater life.\n\n“Coral reef fishes that you wouldn’t see elsewhere and in large quantities,” she describes. “Just an overload to the senses.”\n\n‘Relaxed but highly curated’\n\nThe Aqua Blu is a long-range ocean explorer yacht. Stevie Mann/Aqua Expeditions\n\nAqua Blu's main deck salon. Stevie Mann/Aqua Expeditions\n\nAmong the big names offering journeys to eastern Indonesia is National Geographic Expeditions, including a two-week Spice Islands/Raja Ampat cruise on the 28-passenger Aqua Blu, which once served as the private yacht of an aristocratic European family. The all-inclusive price, $27,000 per person, includes upscale amenities like Balinese massages, gourmet meals, scuba diving and other water sports, and a National Geographic certified photo instructor to help you snap perfect pictures.\n\n“With Aqua Blu, we made a deliberate choice to offer an intimate, yacht-style experience rather than a traditional cruise,” says CEO & founder Francesco Galli Zugaro.\n\n“Most vessels in the region carry larger groups and follow fixed routes. Aqua Blu carries just 30 guests, which allows us to access remote lagoons and lesser visited islands that larger ships simply can’t reach. We offer the perfect combination of scale, flexibility and service.”\n\nThe region has become increasingly popular with people “who want to be blown away” by the insane amount of underwater life, says Carolyn Coenen of Wilderness Travel. Diana Himmelspach/Wildnerness Travel\n\nGuests can spend more time in the water or exploring ashore, without the feeling of being on a timetable, he adds.\n\n“We designed the vessel and the itinerary to feel relaxed but highly curated, everything from the dive operations to the cuisine reflects the same level of attention.”\n\nAnother option is an Indonesian phinisi, a traditional two-masted vessel used for centuries by Spice Islands traders, pirates and fishermen.\n\nToday’s phinisi are nothing like the boats of old. A prime example is the 14-passenger Lamima, available for charter at a cool $27,000 per night (plus tax). Made of wood, it was constructed by traditional boat builders on a beach in Sulawesi, then outfitted with modern safety features and luxury amenities in Bangkok by a team that included sail riggers from the United Kingdom and engine room specialists from Germany.\n\nLamima’s all-inclusive rate includes access to an array of watersports gear. Lamima\n\n“Because of the way she was built and the way she is run — with an all-Indonesia crew — Lamima has a soul,” says co-owner Dominique Gerardin, who hatched the idea of building the $50 million vessel and saw it through to completion.\n\n“From the very start we wanted this boat to reflect the heritage of Indonesia.”\n\nLamima’s all-inclusive rate includes unlimited massage and beauty treatments at the onboard spa, as well as yoga and meditation sessions, and an array of watersports gear from jet skis, underwater scooters and e-foil boards to surfboards, paddleboards and kayaks.\n\nThe Lamima was constructed by traditional boat builders on a beach in Sulawesi, then outfitted with modern safety features and luxury amenities. Lamima\n\nMichael Travers of SeaTrek Sailing Adventures, one of the oldest tour companies in the region, says businesses offering boat journeys have had to radically change their products over the years to appeal to high-end travelers with sky-high expectations.\n\n“We started off more than 30 years ago as a bit of a high-end backpacker operator with shared bathrooms and fan-cooled rooms when there was no other way to see and explore Indonesia,” Travers explains.\n\nHe says that while the islands of Bali and Java were the only destinations that most non-diving travelers were able to easily visit in the 1990s and early 2000s, his company has adapted to cater to those seeking more variety. “But even though en-suite bathrooms and air conditioning and quality gourmet food are now standard on our boats, our original ethos of adventure — and we’re all in this together — is still at the core of what we do.”\n\nRaja Ampat: Indonesia’s biodiversity hotspot\n\nIt’s not hard to see why eastern Indonesia is attracting adventurous, well-heeled travelers.\n\nFirst and foremost, it offers a blend of sea and land that seems downright unreal. It’s a mosaic of turquoise coves and lush green islands that looks like something generated by computer graphics or artificial intelligence rather than a real-life place on planet Earth.\n\nBelow the surface are pristine coral reefs that swarm with millions of tropical fish and other denizens of the deep. The islands also harbor unique cultures found nowhere else in Indonesia, small but vibrant societies that blend aspects of both Asia and the Pacific.\n\nRaja Ampat, an archipelago of more than 600 tiny islands off the west coast of West Papua — the Indonesia half of the island of New Guinea — and adjacent to the Spice Islands, draws the most raves (and ship itineraries).\n\nDiver training organization PADI ranks Raja Ampat as one of the world’s best scuba spots. Brendan Veary/Lamima\n\nIndonesia offers a blend of incredible experiences on sea and land. Brendan Veary/Lamima\n\nDeclared a Global Geopark by UNESCO in 2023, Raja Ampat is a biodiversity hotspot both above and below the surface. Among its treasures are more than a thousand species of fish and more than 500 types of hard coral.\n\nTravers of SeaTrek says that multiple factors make Raja Ampat so alluring.\n\n“The remoteness, the beauty, the resilience and health of the corals, the fact that it’s so hard to get to and consequently all but devoid of tourists. The only way to see it is by boat … it’s just too vast to see otherwise.”\n\nBoth diver training organization PADI and Dive Magazine rank Raja Ampat as one of the world’s best scuba spots. The archipelago also boasts a world record for the most fish species spotted on a single dive: 374 species recorded during a 90-minute dive in 2014.\n\nThe jagged jungle-shrouded karst islands are known for spectacular and colorful birdlife including photogenic species like the red bird of paradise, Blyth’s hornbill, white-bellied sea eagle and palm cockatoo.\n\nDeclared a Global Geopark by UNESCO in 2023, Raja Ampat is a biodiversity hotspot both above and below the surface. Lamima\n\n“The water is crystal clear in Raja Ampat and this is a part of the world where there is very limited coral bleaching,” says Gerardin.\n\n“So you see incredible marine life if you are diving or snorkeling or even from a paddleboard. You hear a noise, you lift your head and see a big hornbill flying out of the jungle. Suddenly you don’t know where to look — up or down!”\n\nMany cruises also include visits to Komodo island for an up close glimpse of the world’s largest lizards and bats (flying foxes), or a shore landing on Sumba island to watch local horsemen race along the beach on sturdy little sandalwood ponies.\n\nFor instance, Wilderness Travel offers six seagoing itineraries in eastern Indonesia on three different ships. Their menu ranges from a popular Raja Ampat snorkeling cruise and an expedition-style voyage between Komodo and Bali to more uncommon journeys like swimming with whale sharks in super-remote Cenderawasih Bay in West Papua and a snorkeling expedition to the Wakatobi islands off Sulawesi.\n\n“We kind of pride ourselves in finding more off-the-beaten-path destinations,” says Coenen.\n\n“Dropping anchor at night in places and motoring along during the day and not seeing another boat. You may not see anyone else for several days. That’s one of the things that people really love about cruising eastern Indonesia.”\n\nTravers says that despite the growing popularity of the eastern Indonesian islands, there are still many areas that are virtually untouched by tourism.\n\n“Like the Kei and Aru island chains in the Arafura Sea between Raja Ampat and Australia.”\n\nSeaTrek has created a brand new trip for 2026 and 2027 that will visit both of those secluded island chains and the Banda Islands before finishing in Triton Bay in West Papua, where passengers will be able to swim with whale sharks.\n\n“People come back from our trips feeling changed on many levels,” says Travers. “At least that’s our aim.”",
  "authors": [
    "Joe Yogerst"
  ],
  "url": "https://www.cnn.com/travel/east-indonesia-spice-islands-raja-ampat-luxury-expeditions"
}