{
  "title": "The Evolution of Airbnb: A Conversation with Brian Chesky",
  "text": "Transcript\n\nHi Brian.\n\n[Brian] You want me to sit?\n\nYeah, you can sit down.\n\nWhile we're doing this,\n\nI'm gonna tell you just a little bit about Brian and Airbnb.\n\nI won't be long, but I will just say Airbnb,\n\n4 million hosts,\n\n1.5 billion guests\n\nacross more than 220 countries.\n\nPretty incredible.\n\nTransformed the entire travel industry, no big deal.\n\nVery happy to have you here\n\nfor our last conversation of the day\n\nbefore we have some drinks.\n\nAnd let me start by backing up,\n\nwhich is something I maybe tend to do in interviews.\n\nI apologize, I'm a linear thinker,\n\nbut I've been thinking a lot lately,\n\nfor reasons that are probably obvious,\n\nabout time in four year increments.\n\nAnd if you think back four years, 2020,\n\nthe world in the midst of a devastating pandemic\n\nand an event that for your company was,\n\nI mean, I will,\n\nthe word that comes to mind for me is existential, right?\n\nCatastrophic.\n\nI think you laid off at the time\n\nsomething like 25% of your staff.\n\nAnd yet here we are today talking about,\n\nor we are going to be talking about,\n\nthe evolution of Airbnb, what's next?\n\nSo I'm curious, from your point of view,\n\nI will not make you relive that whole experience,\n\nbut from 2020 to now,\n\nwhen you think about everything that has changed\n\nfor your company,\n\nwhat stands out?\n\nWhat are sort of like the big milestones\n\nor the big moments in Airbnb's,\n\nlike recent history\n\nfrom that really sort of like existential moment\n\nfour years ago,\n\nSo it was January, 2020,\n\nwe were working on our IPO\n\nand it was gonna be one of the big IPOs since like Uber.\n\nAnd I remember I was in a meeting\n\nand it was late January and we saw our business in China,\n\nwe had a business in China,\n\nand it fell off a cliff.\n\nIt dropped like 80%.\n\nAnd I said, what, what is this?\n\nWhat happened?\n\nAnd they said,\n\nOh, there's this thing called the coronavirus.\n\nAnd I had never heard of it and probably none of you had\n\nbecause it hadn't made the front page of the newspaper yet.\n\nAnd I remember saying something kind of innocently like,\n\nwow, if if this thing spread beyond China,\n\nit would be really bad.\n\n[Interviewer] We would be real screwed. Yeah.\n\nAnd within eight weeks we lost 80% of our business.\n\n[Interviewer] That's so crazy.\n\nAnd to lose 80% of our business,\n\nand we were doing about $35 billion a year,\n\nso that was more than the sales of Starbucks,\n\nand when you're doing that much business\n\nand you lose almost all of it,\n\nit's like you're in a 18 wheeler,\n\nyou're going 80 miles an hour\n\nand then you slam on the brakes.\n\nThere is no easy nonviolent way that,\n\nlike everything just is smooth.\n\nAnd there were actually articles,\n\nlike Is this the end of Airbnb?\n\nWill Airbnb exist?\n\nAnd I think we were one of the,\n\nlike the tips of the spear of this kind of crisis.\n\nAnd you know,\n\nthere's nothing,\n\nlike I've thankfully I've never had\n\nlike a near death experience\n\nand I don't think we ever had\n\na near death business experience,\n\nbut we didn't know it at the time.\n\nAnd there's something about your business flashing\n\nbefore your eyes that makes,\n\ngives you a clarity that you don't have in any other time.\n\nAnd at that moment,\n\nlike I think that became the defining moment of the company.\n\nThe first thing we had to do is,\n\nwe had to like cut the company almost in half by size.\n\nWe did a layoff of about 25% employees,\n\nbut we also had a lot of contingent workers, contractors.\n\nSo we really lost about a third of the company.\n\nWe had to then go,\n\nI had to go through like a thousand different projects\n\nin the company line by line,\n\ncutting as many things as possible.\n\nAnd so it's like your house is on fire,\n\nyou go in a house and you can only take out\n\nlike a handful of things outta the house.\n\nThat is really, really clarifying.\n\nAnd I suddenly just changed how I operated,\n\nbecause I think I had been operating\n\nlike in a totally different way.\n\nSee I was told that like the way you should run a company\n\nis you should hire great people\n\nand you should just trust them\n\nand get outta their way to do their job.\n\nAnd that sounds nice on the surface.\n\nI don't think Jensen, who was just before me, does that.\n\nHe has 40 direct reports, I believe.\n\nAnd what I had done,\n\nwas I thought like,\n\nfounders are in the details\n\nand you are involved in all decisions\n\nand over time you step out.\n\nAnd that was the biggest mistake I ever did.\n\nAnd many of the founders\n\nand many of the leaders I've met,\n\nthe biggest mistake they make\n\nis they step outta the details.\n\nBecause what I've learned\n\nis that great leadership is presence, not absence.\n\nAnd that people can be empowered\n\nwith you being very involved,\n\n'cause you can actually put your entire weight behind them.\n\nAnd so I got really, really hands-on.\n\nWe made the company much smaller.\n\nWe felt like we wanted to be\n\nnot the Navy but the Navy Seals.\n\nWe went back to a functional organization,\n\nwe moved to like these release cycles\n\nwhere we started doing software updates,\n\nkind of like an operating system.\n\nWe almost started developing software like hardware\n\nbecause I felt like we were a free for all organization,\n\nwe were like divided into all these different divisions,\n\ngoing in a thousand different directions,\n\nand you open the app every year and you're like,\n\nwhy does the app look no different the year before?\n\nSo we really simplified, we got back to the basics,\n\ngot back to like,\n\nand the first thing we did is I said,\n\nalright, we're gonna expand beyond a core business,\n\nwhich I know you'll ask about,\n\nbut we have to have permission\n\nto expand beyond the core business.\n\nSo before we do new stuff,\n\nwe're gonna figure out all the things people don't like\n\nabout Airbnb and we're gonna start\n\nto address them one by one.\n\nSo people said prices are too high.\n\nSo we started working on,\n\nlike working on making Airbnb more affordable.\n\nPeople started saying like,\n\nwell the quality is not really good.\n\nSo we started working on a lot of quality issues.\n\nPeople said the app was too difficult to use,\n\nit'd become pretty much a Frankenstein of an app\n\nbecause you had all these different teams\n\npushing code every hour, every day.\n\nThere was no cohesive vision.\n\nSo we started focusing on that\n\nand over the last three years,\n\nwe do these releases twice a year,\n\none in May, one in November,\n\nthe entire company rose in one direction.\n\nWe have this two year roadmap.\n\nSo we look out two years,\n\nalmost no other software company does that,\n\nand we've made over 535 features in upgrades and fixes,\n\nthe service is by no means perfect,\n\nbut the results are today the company is stronger than ever\n\nand a company that people thought was going outta business\n\ndoes more money as a free cash flow,\n\nas a percent of revenue,\n\nthan almost any company in Silicon Valley.\n\nAnd I think this really just comes back to this,\n\nyou know, quote that Andy Grove, you know,\n\nhe was CEO of Intel, he said,\n\nA bad company's destroyed by a crisis.\n\nGood companies survive a crisis,\n\nbut great companies are defined by a crisis.\n\nAnd I always wanted the pandemic to be our defining moment,\n\nand I think it probably was.\n\n[Interviewer] Fantastic.\n\nSo you're now in this position\n\nwhere you've effectively sort of rebuilt\n\nand reoriented Airbnb and you're right,\n\nI am gonna ask you about moving beyond the core business.\n\nYou've launched some really interesting features\n\nrelatively recently, right?\n\nLike the icons program is one,\n\nwhere you can stay in all sorts of wild\n\nand crazy different places.\n\nYou recently launched a co-host program\n\nand I noticed I'm taking my daughter\n\non a trip in the spring,\n\nI can't tell you where because she doesn't know yet,\n\nbut when I booked the trip on Airbnb,\n\nall of these different experiences came up,\n\nwhich is the experiences program,\n\nlike make cheese with this person, go drink wine,\n\nwhich she's young,\n\nwe're not gonna go drink wine with anyone,\n\nbut it genuinely did to me as a user feel like,\n\noh there's like something different is happening here\n\nand now I'm on stage with Brian Chesky\n\nand I can ask him what it is and where it's going.\n\nWhere is this all taking us in terms of Airbnb,\n\nthe core business,\n\nhow we think about it now, you go,\n\nyou book a room or you book a place to stay on vacation\n\nor a business trip,\n\nwhere are we headed?\n\nSo when we started Airbnb\n\nand it originally took off,\n\nI thought we would like expand beyond housing.\n\nI thought we could take the Airbnb model, you know,\n\npeople were saying like the Airbnb for this,\n\nthe Airbnb for that.\n\nThere was an entire ecosystem of startups\n\nstarted around this kind of idea.\n\nAnd I thought that we were gonna do that.\n\nAnd we tried to do it in the early, the 2000 teens,\n\nlike 2014, 15, 16.\n\nAnd it was a little premature.\n\nWe were still in hypergrowth, we weren't really ready.\n\nAnd then of course the pandemic occurred\n\nand then we decided to get back to our foundation.\n\nSo I've looked at a couple companies for inspiration,\n\nmaybe one company that is a decent\n\nreference point is Amazon.\n\nAnd we're a pretty different culture than Amazon, you know,\n\nwe're probably closer in our product development philosophy\n\nto Apple than Amazon,\n\nbut the business that Amazon had in the late nineties,\n\nit was a bookseller\n\nand the only thing you could buy on Amazon was books.\n\nNow books are not nearly as big a market\n\nas vacation rentals.\n\nYou were approaching a hundred billion dollars a year.\n\nBut because books isn't a very big market,\n\nthey had to go into other adjacencies very, very quickly.\n\nAnd so baked in the early days of Amazon\n\nwas what do they do after books?\n\nThey did DVDs and they needed CDs\n\nwhen people used to buy those.\n\nAnd then they moved on and on and on\n\nand eventually they sold everything.\n\nAnd I don't know\n\nif we will sell everything on Airbnb,\n\nbut I think one day you'll be able\n\nto Airbnb a lot more than just an Airbnb,\n\nand you know, we're gonna, you know,\n\nwe don't really disclose ahead of time what we're gonna do,\n\nbut the one thing I've already said\n\nis we are gonna reimagine experiences.\n\nI think it's an underrated product.\n\nPeople generally like it,\n\nbut it never really like caught on.\n\nAnd I think that we can totally reimagine that product\n\nand I'm just like so excited\n\nbecause I very rarely,\n\nlike maybe here's a way of saying it,\n\nlike there are so many founders\n\nthat like they have this idea like,\n\nand if you're lucky, if you're lucky,\n\nyou have an idea and it just takes off.\n\nAnd I was 26, my parents are social workers,\n\nI didn't think I would have an app that ever took off.\n\nAnd my life completely changed.\n\nEverything about my life changed\n\nbecause of this rocket ship I went on,\n\nand I went on this rocket ship\n\nand there's been a couple other dozen people,\n\nif you've like how many people like me are there\n\nthat like go on this rocket ship, a few dozen,\n\nAnd you get to know them, they're at the same conferences,\n\nand you talk to them\n\nand then we all go through this like trough of despair.\n\nMost of us do.\n\nIt's almost like corporate adolescence.\n\nAnd it was probably almost as awkward as my real adolescence\n\nand only a few people,\n\nJensen before us, the greats,\n\nthey get to the other side\n\nand they get an opportunity to have a second act.\n\nThey get an opportunity to reinvent themselves.\n\nAnd that's what I hope next year is the beginning of Airbnb.\n\nI hope it is.\n\nI hope people say that that was one\n\nof the biggest reinventions of a company in recent memory.\n\nReinvention is a big word to use. I'm bookmarking that.\n\n[Brian] Reinvention. That's an aspiration.\n\nI'm gonna be checking in on this.\n\n[Brian] That's an aspiration.\n\nFantastic.\n\nI saw you speaking earlier this year,\n\nit was an off the record session\n\nso I can't share what you said,\n\nbut you talked about sort of your theory\n\nof the case around the value of physical experiences\n\nand the value of physical community.\n\nParticularly in an environment where, you know,\n\nwe're spending a lot of time\n\ntalking about digital experiences, we're talking about AI,\n\nwe're talking about the intridification of the internet,\n\nwhich Jay Graber talked a little bit about earlier.\n\nCan you talk us through a little bit of sort of that,\n\nI mean obviously your company is very well positioned\n\nto capitalize on the resurgence\n\nof physical experience,\n\nbut just give me your,\n\nlike your thesis on that topic, briefly.\n\nLet me, yeah.\n\nSo very briefly, up until two years ago,\n\nvery few people were talking about AI\n\nand then of course Chat GPT launched\n\nand then the generative AI revolution basically started.\n\nAnd while it's been so exciting, I bet you very few of you,\n\nyour daily life has any differences because of AI.\n\nHere's a test, take your phone out,\n\nlook at all the apps in your home screen\n\nand ask what of them have changed two years later\n\nbecause of generative AI.\n\nLike truly changed.\n\nI doubt there are, other than using an AI native app,\n\nI bet you none of the apps you use,\n\nincluding Airbnb are fundamentally\n\ncompletely different in a world of AI.\n\nAnd then ask yourself,\n\nwhat did you do today that was different because of AI,\n\nzero I saw in the audience.\n\nWhat did you,\n\nwhat have you done today or yesterday\n\nthat changed fundamentally because of AI?\n\nMaybe some things,\n\nbut I think it leads to this bigger topic.\n\nI remember when the internet came out like,\n\nand I mean I was born in 1981,\n\nso my memories of the internet were like 1993,\n\nit was before search engines,\n\nand before search engines, some of you might remember,\n\ndo you know how you found a website,\n\nthere was a phone book\n\nand there was this like actual phone book\n\nwith these like websites\n\nand you would say, oh if I wanna learn about this,\n\nyou go to the phone book and you type in the browser.\n\nAnd the reason I say that is I feel like we are in\n\nthe like phone book stage of AI.\n\nWe are still that early\n\nand I think it is starting to begin\n\nto change our digital world,\n\nbut it has not yet changed the most important part\n\nof our lives,\n\nwhich is the physical world.\n\nAnd that's maybe one of the reasons\n\nwhy your life hasn't completely changed by AI\n\nis even when it does change on the phone,\n\nour physical reality is still exactly the same\n\nas it was before.\n\nAnd then the question is,\n\nwell when does the physical world start to change?\n\nOr when does the physical world\n\nstart to be enabled in a completely different way\n\nbecause of AI?\n\nAirbnb's kind of unique because like, you know,\n\nthere's this word that Silicon Valley uses, product,\n\nyou know, you have product managers,\n\nand product managers are basically software managers,\n\nproduct means software,\n\nwhat's our product?\n\nIt's not our app, it's the home, it's the experience,\n\nit's the wine tasting,\n\nit's all these things we're gonna be launching.\n\nSo I am so excited about what we can do\n\nand I think that like AI\n\nand all these different revolutions that are gonna,\n\nI mean certainly AI I think is gonna enable a lot more.\n\nAnd I think if you think about AI, like maybe in a stack,\n\nyou have what Jensen's doing,\n\nwhich is the GPUs on top of, that's the second layer,\n\nwhich is the LLMs.\n\nThere's been a lot of innovation,\n\nbut the world will change at the layer above that.\n\nAnd the layer above, that's the applications.\n\nAnd so when the apps in your phone are totally different,\n\nwe have reached the application layer\n\nand when we reach the application layer,\n\nthe world will completely change.\n\nBut it's kind of like AI is,\n\nthe infrastructure is like the highways.\n\nWe need to still build the cars.\n\nAnd 10 years ago everyone thought\n\nwe'd all be in self-driving cars right now.\n\nAnd there are a bunch on my street.\n\nBut there aren't a lot on a lot of streets.\n\nAnd so I think the point is,\n\nwe overestimate how much technology can change\n\nin the short term,\n\nbut we probably underestimate\n\nhow much it will change in the long term.\n\nAnd it is gonna take some time I think\n\nto permeate the physical world.\n\nBut once it does,\n\nI think it's gonna change everything\n\nand it's not gonna be limited to asking the agent something\n\nand getting an answer.\n\n[Interviewer] Interesting.\n\n[audience applauding]\n\nI mean, yeah, I like this vision.\n\nNo it's really, it's interesting.\n\nI mean, is there other technological progress?\n\nI think one of the recurring jokes of this day\n\nis that every session,\n\nthe person in my chair asks the person in your chair\n\nabout AI, right?\n\nThere's a lot of-\n\n[Brian] It was like 1995 you'd say the word internet.\n\n[Interviewer] Right?\n\nYes or as Stephen Levy pointed out earlier,\n\nfive years ago it was the metaverse, right?\n\nIs there other technological progress,\n\nwhether it affects your company\n\nor whether it's just something you are seeing\n\nas a leader in the tech industry\n\nthat you think is really salient,\n\nthat you think is important,\n\nthat you think maybe has implications for Airbnb\n\nthat we are not talking about\n\nbecause we are spending so much time talking about AI?\n\nOr is AI really deservedly sucking up\n\nthis much oxygen?\n\n[Brian] I mean maybe the way to think,\n\nI mean there are so many different technologies\n\nthat will probably impact the world.\n\nMaybe the way to think about it is that AI will be enabler,\n\nyou know,\n\nI think that like one part of AI\n\nthat I think will be massive\n\nis when AI can do software development.\n\nBecause I think like right now,\n\nlike there are only so many people\n\nthat can like hire software engineers.\n\nLike a small ski company can't have a like a,\n\ncan't have an app,\n\nbecause they can't hire engineers.\n\nBut when software development\n\nbecomes much more like prompting,\n\nthen software can be completely ubiquitous.\n\nAnd as software's completely ubiquitous,\n\nthen suddenly the physical world can start to change,\n\n'cause everything could have software in it.\n\nAnd so that's just like a very small example.\n\nSo I think that AI is an accelerant.\n\nI don't know,\n\nI think a lot of times when we say AI\n\nand we say like AI is gonna change the world,\n\nI wonder if we're using AI,\n\nwe're really saying is technology,\n\nI wonder if we're just saying that technological progress\n\nis going to speed up\n\nand that the next 20 years are gonna feel like the last 50.\n\nAnd that probably is true,\n\nand it probably is in large part for AI,\n\nbut AI is built on a lot of other technologies.\n\nAnd so if AI is built on other technologies,\n\nthen wouldn't other new technologies emerge\n\nthat are built on AI that will also accelerate technology?\n\nAnd so I just think that there's gonna be a huge amount\n\nof technological progress.\n\nAnd I'm not like a,\n\nI'm a designer at heart, not a technologist,\n\nso I'm not probably the best person to ask\n\nwhat the specific technologies are.\n\nBut I think when we say AI,\n\nI think sometimes or AGI,\n\nthink we kind of mean technological progress.\n\n[Interviewer] Yeah, yeah.\n\n[Brian] Make sense?\n\nI think AGI is at the center of it,\n\nbut it's gonna probably lead to the,\n\nthere's gonna be a lot of other developments.\n\nLike AI is only possible with like,\n\nprocessing power increasing and like, you know,\n\nlike AI is gonna lead to discovery\n\nof a lot of new areas\n\nand a lot of new fields that are gonna be self-reinforcing.\n\nYeah, no, it makes sense.\n\nWe have a few minutes left.\n\nI wanted to make sure to spend a little bit\n\nof time on your leadership style.\n\nI was telling you backstage\n\nthat of all of sort of the tech CEOs,\n\nthe leaders in this industry,\n\nI see Brian Chesky's name associated the most\n\nwith leadership advice tidbits of, you know,\n\nyou no longer believe in one-on-one meetings,\n\nit's founder mode, baby.\n\nLike, it's just,\n\nit's all this sort of noise about how you run your company\n\nand how you sort of have evolved as a leader,\n\nyour sort of theory of leadership.\n\nWhich brings me to the question,\n\nnot so much about leadership advice,\n\nI kind of wanna know what a day in the life\n\nof Brian Chesky is like,\n\nlike a work day.\n\nYou know, when you think about founder mode,\n\nsweating the small stuff, being in the details,\n\nnot sort of trusting,\n\nnot sort of delegating and operating\n\nin sort of manager mode.\n\nWhat does that look like every day?\n\nI ask as a manager and someone who really-\n\nThat's great question by the way,\n\nlike I love this,\n\nthis term founder mode has become pretty ubiquitous,\n\nand yet most like I know, Paul Graham-\n\nIt's not, you didn't say it.\n\n[Brian] It wasn't, Paul Graham said it,\n\nand he never actually explained what it was.\n\nAnd one time when it like first went viral,\n\nsomebody said,\n\nI'm going founder mode on this burrito.\n\nAnd yeah that was-\n\n[Interviewer] It's so good.\n\nThat was the moment I realized\n\nwe probably should clarify what this means.\n\nOtherwise, like I don't,\n\n'cause otherwise I feel bad for the burrito.\n\nYeah, it is a little bit threatening.\n\nI think it means a lot of things,\n\nbut just to be very simple, like at its crux,\n\nI think it means to be in the details.\n\nI think it means that great leadership is presence,\n\nnot absence.\n\nAnd I think a lot of us are taught to delegate,\n\nbecause the opposite of delegation\n\nis this horrible ill\n\nthat you can commit to on your employs,\n\nwhich is micromanagement.\n\nAnd no one wants to be a micromanager.\n\nNo one good wants to work for a micromanager.\n\nAnd I think it's way more nuanced than that.\n\nI remember there was an executive\n\nthat once asked me,\n\nIs this your decision or is this my decision?\n\nAnd I kind of exaggerated when I said this,\n\nbut I kind of said like,\n\nit should never be either.\n\nIn other words, everything is a dialogue.\n\nIt's a partnership.\n\nIt's not about me telling you what to do\n\nand it's not about you doing your own thing,\n\nit's about being involved.\n\nAnd the way I basically spend my time\n\nis I basically review the work.\n\nI basically say like,\n\nI don't like managers,\n\nand I put managers in quotes,\n\nmeaning people who manage the people absent the work.\n\nLike if you're not managing the work,\n\nwhat are you doing all day?\n\nAre you like doing one-on-ones?\n\nAre you acting like their therapist?\n\nAre you dealing with bureaucracy all day?\n\nAnd so I think the best way\n\nto manage people is through the work.\n\nAnd that's actually how they learn.\n\nThey learn by doing, by watching,\n\nand you mentor them through the work.\n\nSo what I do all day is I basically review work.\n\nSo like every day is a little bit different,\n\nbut I might wake up\n\nand like every Sunday night\n\nI have a head of program management at Airbnb,\n\nprogram management, unlike most companies,\n\nis a tier one function.\n\nAnd they basically,\n\nwe have 75 to 80 projects that I'm monitoring\n\nand I review every project\n\nand the company that's customer facing.\n\nAnd I review everything every week, every two weeks,\n\nevery four weeks, every eight weeks,\n\nthere's like a cadence\n\nand I'll probably do like 30 hours of reviews\n\nand maybe that's like approximately half of my schedule.\n\nI don't know exactly how many hours I work,\n\nMaybe some weeks I work more than that, but,\n\nand so I'll basically be in reviews.\n\nAnd so the reason I don't do one-on-one meetings,\n\nI mean if somebody needs to talk to me,\n\nI'll talk to them and I do a lot of calls.\n\nI'll call somebody and I'll ask 'em a question.\n\nWhat I don't do is recurring scheduled one-on-ones\n\nwhere the employee owns the agenda.\n\nAnd I find, I know Jensen said he doesn't do that either.\n\nAnd what I do is I basically run the company in groups,\n\ngroup meetings where I'm reviewing work\n\nand I have the boss, like the person doing the work,\n\ntheir boss, their boss and their boss.\n\nSo no one can ever have to go,\n\nno one ever has to go up the chain to get to me.\n\nYou could get to me in front of everyone\n\nand I'll ask everyone's opinion\n\nand then I might disagree with them,\n\nbut I'll like ask them to talk me out of it,\n\nchange my mind.\n\nAnd that's probably the main thing I do.\n\nIn other words, a simple way I run a company,\n\nis we have a release, a big product release,\n\nwe set a big goal\n\nand then we review the work every few weeks\n\ntowards that goal.\n\nAnd we're either on track or we're either off track.\n\nAnd if I'm not doing that,\n\nI'm probably trying to find great people\n\nto work on the next thing.\n\nAnd by hiring them, developing talent or promoting them.\n\nWho do you lean on as a leader? Who do you learn from?\n\nWho do you look up to?\n\nI mean, it changes,\n\nbecause when I was starting out I like,\n\nI think my investors,\n\nwhich were my board members,\n\ntaught me a lot.\n\nI had Reid Hoffman and Mark Andreessen on the board\n\nand you know,\n\nand then eventually Alfred Lynn\n\nand I had all these different people join the board\n\nand your investors are kind of like your mentors.\n\nThen I started learning from the executives I hired,\n\nI hired these executives and I learned from them.\n\nThen I started learning,\n\nI became like shameless about seeking out other CEOs.\n\nSo like I went to this conference called Sun Valley,\n\nall the like big shots of Silicon Valley were there,\n\nso I would,\n\nI like remember one time like there's this duck pond outside\n\nof Sun Valley and I like,\n\nit's like a pond with all these ducks,\n\nand I was chasing Jeff, not chasing,\n\nbut like trying to practically chase Jeff Bezos down\n\nto get advice from him in the duck pond.\n\nNo it's a good visual, let's go with that.\n\nAnd so I would, people like that,\n\nand now I, you know,\n\nlast night I had a dinner with like 20 other founders\n\nof companies like Airbnb size\n\nor maybe a little smaller,\n\nsome were a little bigger,\n\nand I do a lot of like,\n\nwe do a lot of comparing notes now\n\nand we were talking about like how we run our companies\n\nand I do look at like historical references.\n\nI think Walt Disney and Steve Jobs I like in particular\n\nbecause they were creative people\n\nrunning technology companies.\n\nI think of myself like that.\n\nSo those are kind of who I learn and lean on.\n\n[Interviewer] That's interesting,\n\ninteresting to hear about how it has evolved over the years.\n\nAnd speaking of time,\n\nwe are coming to the end of ours,\n\nand as you are the last speaker of the day,\n\nwe've asked a couple folks this throughout the day,\n\nbut parting words from Brian Chesky,\n\nwhat I wanna know\n\nand what I think you could leave everyone here with is,\n\nthat little bit of optimism I promised all of you\n\nat the beginning of the day,\n\nBrian, what gives you hope?\n\nWhat makes you feel optimistic?\n\nWhat can these fine people\n\ntake away from you today?\n\nOh, that's a great question.\n\nMaybe I can put it in the context\n\nof like what's happening in the world today.\n\n[Interviewer] Yeah.\n\nI don't know if people today in this world\n\nare super optimistic\n\nor that's, first of all,\n\nthere seems to be a lot of despair.\n\nThere seems to be a lot of pessimism.\n\nThere seems to be a lot of division.\n\nI mean, I remember when I came to Silicon Valley\n\nthere was another election going on, 2008.\n\nSenator Barack Obama against Senator McCain.\n\nAnd in hindsight they both looked a lot more purple\n\nthan the kind of red and blue divide of today.\n\nI mean, to give you an example,\n\nlike we sold collectible cereal boxes\n\nand we had like this Barack Obama themed cereal\n\nwith this John McCain theme cereal,\n\nyou know the outrage there would've been\n\nif we had like Trump and Harris cereal,\n\nlike both sides would've been completely,\n\nhow dare you make cereal by the other candidate.\n\nThat is how divided we are.\n\nAnd I'm like pretty concerned about that.\n\nBut I wanna bring it just back to Airbnb,\n\n'cause that's like kind of my only point of reference.\n\nWhen I started Airbnb with my two friends,\n\nI remember telling one of the first people\n\nI told about the idea\n\nand he looked at me with a straight face,\n\nBrian, I said, Yes?\n\nHe goes,\n\nI hope that's not the only idea you're working on.\n\nAnd the reason he said that,\n\nand it was, you know,\n\nlike a completely reasonable rational thought\n\nis he said strangers will never trust one another.\n\nThey'll never be able to do this.\n\nAnd I've learned since that day,\n\nmore than 2 billion people have stayed in the Airbnb\n\nand 220 countries and regions in a hundred thousand cities.\n\nAnd people have asked me,\n\nwell what have you learned about human nature\n\nbecause of these 2 billion people staying together?\n\nAnd I said,\n\nI think what I've learned\n\nis that at some fundamental level,\n\npeople are fundamentally good and we're 99.9% the same.\n\nAnd I think that we live in these echo chambers\n\nand these bubbles where we other everyone\n\nand we tend to identify as one group\n\nand then everyone else becomes the other group.\n\nAnd I think one of the best ways\n\nto change your mind about someone, I mean first of all,\n\nno one's ever changed someone else's mind\n\nin the YouTube comment section.\n\n[Interviewer] Not yet.\n\nI guarantee you, I guarantee you,\n\nhere's a way to change someone else's mind.\n\nLike have them walk in your shoes or walk in their shoes.\n\nAnd there's many ways to do that,\n\nand one way is, you know,\n\nobviously to be minorly solicitous,\n\nlike stay in Airbnb.\n\nBut we're not the only way.\n\nBut like get out into the world,\n\nmeet the kind of people you disagree with,\n\nand you'll start to realize\n\nthat they're not so different than you\n\nat some fundamental level.\n\nAnd when you start to believe that,\n\nand if you believe we're in the phone book era of AI,\n\nthat we're about to have the biggest engine\n\nfor curiosity and possibility in the world.\n\nAnd that technology can permeate the physical world.\n\nAnd if we can get out people back into the physical world\n\nconnecting back together with one another,\n\nI think that's the ultimate promise of the internet.\n\nThat the internet was always meant to bring us together.\n\nBut I think the physical version\n\nof bringing us together is in the physical world,\n\nwhy is everyone here physically here right now?\n\nYou could just watch YouTube videos,\n\nbut you all chose to come here.\n\nAnd I think that's what I'm optimistic about.\n\nI'm optimistic that I think this is maybe\n\none of the greatest times in human history to be alive,\n\nwith one of the biggest technological revolutions\n\nin front of us,\n\nand if we can just see besides our differences,\n\nwe can come together\n\nand I think we can create\n\nsuch a wonderful world together.\n\nAnd when I say world, I mean a real world,\n\na physical world that we can live in together.\n\n[audience clapping]\n\nI hope we see that come to pass.\n\nBrian, thank you so much.\n\nThank you very much.\n\nThank you.\n\n[audience clapping]",
  "authors": [
    "Condé Nast"
  ],
  "url": "https://www.wired.com/video/watch/the-evolution-of-airbnb-a-conversation-with-brian-chesky"
}