{
  "title": "New Rolls-Royce technology prevents sand damage to jet engines",
  "text": "New technology prevents sand damage to jet engines\n\n47 minutes ago Share Save Matthew Barlow Derby Share Save\n\nBBC Rolls-Royce's Trent XWB-97 powers the Airbus A350 on long haul flights\n\nRolls-Royce is testing new technology in Derby in a bid to prevent sand and dust damaging its jet engines. The issue has affected airlines operating across the Middle East, which is one of the company's most important markets. Sand and fine dust which are ingested during take-off can enter the hottest parts of an engine, causing it to corrode, and can make the engine even hotter when coolant holes become blocked. The issue does not affect flight safety, but it reduces efficiency and increases the frequency of maintenance, as the coating around the engine parts can wear out quicker.\n\nRolls Royce's head of test facilities Pat Hilton said the Middle East market was \"crucial\" to its future\n\nPat Hilton, Rolls-Royce's head of test facilities, said: \"The dust can penetrate the hottest parts of the engine and wear that part out at a quicker rate than it would if it wasn't flying through sand.\" Under the testing programme, the firm has changed the metals the parts are made of to make them more resistant to heat and the corrosive effects of dust. In addition, it has changed the location of some of the coolant holes so they are less likely to become blocked. The work is part of a wider £1bn durability programme which covers several engines, including the Trent XWB-97, the company's most powerful engine and one that runs hotter than its other models.\n\nRolls-Royce When dust gets into the turbine part of the Trent XWB-97 engine it causes damage to the parts\n\nThe testing is taking place in three phases at Rolls-Royce's Testbed 80 facility in Sinfin. Engines tested in the first two phases are back in service and able to fly 60% longer between overhauls, according to the company. As part of the work, the University of Manchester produced a synthetic dust which matched the fine, talcum powder-like particles found in the Middle East. Mr Hilton added: \"What we're looking to do by enhancing the fleet is to fly [the engines] for double the length of time. \"It is fantastic being part of that journey knowing that something we have been doing today will run for many years to come.\"\n\nChanges have been made to the Trent XWB-97 after testing in Sinfin in Derby\n\nA Trent engine is currently able to fly the equivalent of 500 times around the world before key parts need to be replaced. This is expected to double when final testing is completed in 2028. Last year, Emirates Airline president Sir Tim Clark questioned the durability of the Trent XWB-97, which powers the Airbus A350. The Airbus is used long haul by the likes of Emirates and Etihad. Rolls-Royce said its ongoing programme was addressing the issue across the fleet.\n\nExperts at the University of Manchester have re-created the type of dust that aero engines have to cope with in the Middle East\n\nFollow BBC Derby on Facebook, on X, or on Instagram. Send your story ideas to eastmidsnews@bbc.co.uk or via WhatsApp on 0808 100 2210.",
  "authors": [],
  "url": "https://www.bbc.com/news/articles/cj0e3npg7e4o"
}