{
  "title": "'York dementia dance class takes me back to 80s youth club disco'",
  "text": "'Dementia dance class takes me back to 1982 disco'\n\n57 minutes ago Share Save Seb Cheer York Share Save\n\nBBC/Seb Cheer Paul and Nicola Furness travel from Beverley to the sessions in York\n\nA new dance project is under way in York for people living with young-onset dementia and their loved ones. The sessions, run on Fridays by not-for-profit organisation Moving Minds, will continue for a year and are supported by Sport England. The Momentum project was created to \"fill a gap\" in dementia care provision, according to Moving Minds director Elaine Harvey. She said: \"What was missing was more tailor-made services for younger people with dementia.\n\n\"People in their forties and fifties and sixties require something different, something that reflects their cultural interests and identity, their level of fitness and general mobility.\" \"You really see the connection with music and with memory, and how powerful it is,\" said Paul Furness, who takes part in the sessions alongside wife Nicola. \"It's fun, you get to meet people who are on the same journey.\"\n\nBBC/Seb Cheer People can refer themselves to the project, while others are referred by healthcare professionals\n\nMrs Furness, 55, said the sessions were \"brilliant\". \"There's so many people that don't know what they need to do or want to do, things like that.\" Mr Furness, 58, added that the couple \"do a lot\". \"We do yoga, we do park runs, we do gym classes, we go and see lots of music nights. We've been to 14 George Michael tribute acts in the last two years.\" \"We're living life to the fullest as we possibly can, providing moments of happiness and connection,\" he added. He joked that Mrs Furness was \"back at a youth club disco in Hull in 1982\" during the dance sessions.\n\n'In it together'\n\nThe project is unusual, as there are \"not often\" groups designed specifically for younger people living with dementia, according to Debby Lennox, from the charity Dementia Forward. She said the sessions were \"important\", as a destination for people to go on a regular basis. \"Physical exercise is fantastic for the brain but it's also about that connection, reminiscing, listening to music. \"It's that eye contact across the room. \"It doesn't matter if you don't get the moves right, it's just about everyone being in it together.\"\n\nBBC/Seb Cheer Siân Whitley and Elaine Harvey, from Moving Minds\n\n\"We think about the sessions as being co-created with the people who are in the space,\" Ms Harvey said. She said participants gave feedback about the \"music that moves them\" and their creativity, through \"simple choreographic structures\". \"Creativity is a wonderfully healthy thing for everyone, and a basic human right.\" Dance practitioner Siân Whitley, who also works in hospitals, said the Momentum project offered a way of connecting with people on a different level to talking. \"Dance is a very powerful way to connect with somebody physically, emotionally, through eye contact, through physical touch, even through the movement of materials together and that is why something like this is really powerful,\" she added. \"We've laughed like there's no tomorrow.\"\n\nListen to highlights from North Yorkshire on BBC Sounds, catch up with the latest episode of Look North.",
  "authors": [],
  "url": "https://www.bbc.com/news/articles/c5ypy63l6vpo"
}