{
  "title": "Wicked nail artist hopes success will boost craft's profile",
  "text": "Wicked nail artist hopes success will boost craft\n\n60 minutes ago Share Save Neve Gordon-Farleigh Share Save\n\nJohn Fairhall/BBC Shea Osei was first approached to create nails for Cynthia Erivo in 2022\n\nA nail artist whose work with Cynthia Erivo on the Wicked films became a viral sensation hopes it will help boost the profile of her craft. Erivo's character Elphaba's nails were brought into the spotlight in the first Wicked film, and so was her manicurist, Shea Osei. The 34-year-old from Basildon, Essex, said: \"Nails are not so much of a talked-about thing but ever since the first movie [when] she moves her hand behind her hair and everyone sees the nails, that was an epic moment.\" She said the film had provided her with a platform, and she hoped to show other nail artists \"greater things can happen\".\n\nUNIVERSAL STUDIOS Ms Osei says the point at which Elphaba's nails are glimpsed is an \"epic moment\"\n\nSince starting a career as a nail technician at the age of 18, Ms Osei has built up a celebrity client base and created nails for film and television. After knowing Erivo for more than 15 years, she received a call in 2022 asking her to create nails for the upcoming Wicked film, released last year. For that movie, she created more than 35 sets of press-on nails, with each taking up to 90 minutes. She was hired again to create new designs for the sequel Wicked: For Good, released on Friday. \"The nails tell a story, along with her character Elphaba. It definitely defines growth and confidence,\" she said. \"Her nails go from being short to a bit longer and the colour changes and it gets a bit more daring… it just flows seamlessly together with who she is as Elphaba.\"\n\nShea Osei Ms Osei said seeing fans recreate her nail designs had been \"more meaningful\"\n\nMs Osei also feels she has been on her own journey with the character. \"I'm pretty sad it's over now,\" she said. \"It's just been great being a part of it and especially being at the premieres... and seeing how each country takes in the movie, and that is what's rewarding to everyone.\" She said while she had dreamed of her success, she had not expected it. \"This is where I can say hard work truly pays off; the sleepless nights and the crying at times.\" Erivo has been complimentary of her work and said the recognition should be \"expected\". Ms Osei followed the star on the film's premiere world tour and said it had been \"more meaningful\" to see \"talented\" fans recreate her designs.\n\nShea Osei Shea created Erivo's black foiled nails in the first film (left) and toured with the cast for the film's premiere world tour\n\nShe said before the first film, nails had been an \"afterthought\". \"It's not something that's top or middle of the list; it comes at the bottom,\" she said. \"Hair is always there, make-up is always there, because these are things that people are seeing on screen straightaway. \"I'm hoping when it comes to the movie and film industry and when it comes to the theatre and anything to do with the arts and music videos, that nails can be more prominent.\"\n\nUNIVERSAL STUDIOS Ms Osei said compared to hair and make-up, nails had been an \"afterthought\" in the industry\n\nWhile the film has given Ms Osei a platform, she hopes to show up and coming nail technicians \"greater things can happen\". She said: \"I didn't really have anyone to look up to in the nail industry when I started out at the age of 14. When I started out, it was just the blind leading the blind. \"You are only going to be your biggest cheerleader… I will be in rooms where I think I can't be in, but I absolutely belong there, and you just have to have faith in yourself.\"",
  "authors": [],
  "url": "https://www.bbc.com/news/articles/c2lp2lr709vo"
}