{
  "title": "Cluely’s Roy Lee hints that viral hype is not enough",
  "text": "While Roy Lee, the founder of Cluely, argues that startups should be thinking harder about social media virality, he also admits that brand awareness alone won’t lead to sustained growth.\n\n“I can’t say if it’s a mistake, but maybe we launched too early,” Lee said onstage at TechCrunch Disrupt 2025 last week. “The whole idea [was] let’s launch something that barely works, and if we can get enough initial users, they will find out the use cases for us.”\n\nCluely burst onto the tech scene in April with rage-bait marketing for a product it claimed would help users “cheat on everything.” Lee first made headlines when he was suspended from Columbia University for building a tool used for cheating on coding job interviews. He channeled that notoriety into Cluely, a startup that claimed to help users “cheat on everything” by delivering undetectable information during online conversations.\n\nIn late June, Cluely introduced its enterprise product, which claimed to serve multiple use cases, including helping with sales calls, customer support, and remote tutoring.\n\nBut earlier this week, the startup shifted and narrowed its scope when it introduced a new website that calls its product an AI assistant for meetings. The company’s plan now is to “become the best AI note taker, starting with the consumer,” Lee said onstage. As an AI notetaker, Cluely is clearly entering a crowded market but Roy touted functionality such as “sending follow-up emails.”\n\nBut he deflected questions on how well sales and retention were going, except to say: “I’ll say we’re doing better than I expected, but it’s not the fastest growing company of all time,” Lee said.\n\nThe startup’s ability to grab attention helped it secure a $15 million Series A from Andreessen Horowitz in June. That month, a16z partner Bryan Kim said on the firm’s podcast that he backed Cluely because Lee had figured out how to convert the attention into paying customers.\n\nTechcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | WAITLIST NOW\n\nWhen the company introduced its product this summer, Lee boasted that the startup’s ARR skyrocketed from $3 million to $7 million within just one week. “Every single person who has a meeting or an interview is testing this out,” Lee told TechCrunch then.\n\nBut four months later, Lee is no longer eager to flaunt his company’s financial metrics. “What I’ve learned is you should never share revenue numbers.”\n\nLee claimed that there’s no upside to revealing his company’s performance: “If you’re doing well, nobody is going to talk about how well you’re doing, but if you’re doing poorly, then everybody will only talk about how poorly you’re doing.”\n\nHowever, dozens of founders at fast-growing AI startups have no qualms about publicly revealing their ARR numbers, making the sharing of explosive growth a standard practice amid the AI boom.\n\nCluely’s experience thus far suggests that when it comes to software, social media attention only goes so far if the company doesn’t have a strong product to keep customers once it intrigues them.",
  "authors": [
    "Marina Temkin",
    "Reporter",
    "Sarah Perez",
    "Julie Bort",
    "Lorenzo Franceschi-Bicchierai",
    "Ram Iyer",
    "Connie Loizos",
    "Anthony Ha",
    "Rebecca Bellan",
    "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var"
  ],
  "url": "https://techcrunch.com/2025/11/05/cluelys-roy-lee-hints-that-viral-hype-is-not-enough/"
}