{
  "title": "A moment that changed me: I broke my foot – and took up a sport that led to stratospheric success",
  "text": "I couldn’t pinpoint the exact moment that I broke my foot. The injury didn’t seem like a big deal at first, because stress fractures sneak up on you. It just hurt, and wouldn’t stop hurting, except while running. Maybe because running was the only time I felt good about myself. But in the end the pain intruded there, too. I ran on stubbornly, with a limp.\n\nEventually I had to go to the doctor, and that’s when it hit me. She said it would take eight weeks to heal – no running. I couldn’t imagine even one week without running. I had run every single day for nearly 10 years and I loved it. I tried to find the words to explain, to say that this “rest” was just not possible, but I was too embarrassed. It was a minor injury by clinical standards – and self-inflicted, too. But afterwards, in the corridor, I cried.\n\nI couldn’t have known then, in 2002, that those eight weeks would take me from cross-country runner mediocrity (because, despite my obsessive training, I wasn’t fast) to an Olympic podium. All I knew was that I couldn’t cope without running.\n\nIt was like a state of grief. After the denial came depression and bargaining with myself. OK, running was banned, but what about cross-training? Swimming helped with my frustration at the inactivity but I was soon fed up with the stuffy air, the chlorine, with slogging back and forth without ever getting anywhere or seeing anything or a sniff of nature. I decided cycling would be better: fresh air, low impact. I borrowed an oversized road bike and began to ride it every day with the same dedication I’d put into running. Except I was even worse at cycling. Also, I hated it.\n\nAny new sport has its challenges, but road cycling is especially tough. It links together all the discomforts of weather, traffic, mechanical problems and a bewildering variety of tech, plus everything is eye-wateringly expensive. On top of that, you have the very personal discomfort of a saddle. I was counting the days until I could run again.\n\nView image in fullscreen ‘Group rides were always planned around where to get tea and cake.’ Photograph: Thomas Lecomte\n\nI was also missing the sociability of club training, and wondered if cycling with a group might help. On a grey Saturday morning I showed up for my first club ride, cold and nervous. The other cyclists were sleekly wrapped in Lycra, their bikes gleamed, and no one else had a rucksack. I looked down, past ski gloves and a flappy jacket, to my trusty trainers. My jogging tights had sagged, bunching up above my bare ankles. That was the day I found out that there are right socks and wrong socks in cycling. I also found out what a cross wind is, and that fixing a puncture in the rain with frozen hands (and ankles) is harder than at home in the warm. Cycling was still miserable. I couldn’t wait to ditch the bike and never see that saddle again.\n\nAnd yet somehow, almost unnoticed, a little bit of fun crept in. First it came via cafe stops. The club regulars knew every garden centre and village cafe within a 100km radius of Cambridge, and group rides were always planned around where to get tea and cake. Over pint mugs of tea clutched in bluish hands, I began to enjoy the social side of cycling. Words were used sparingly out on the road – especially on windy days – but at the cafe stop it was different. Kind people and interesting conversation can improve even the most tedious hobby.\n\nIf it had been a choice, I still would have ditched cycling straight away. But the stress fracture meant I stuck at it and, after nearly two months, when running was allowed again, I didn’t abandon the bike. It helped that I found a better saddle.\n\nLiving near mountains allowed me to find my strength as a climber – a cyclist who specialises in uphills\n\nA month later, I did my first time trial, in which I got beaten by a guy wearing a gorilla suit. After a year, I bought a bike that fitted me. A friend dragged me along with her to a road race. Soon after, I entered the national championships and finished fourth.\n\nTwo years later, a research job and a PhD took me to Zurich. I left behind the friends who had helped me become a cyclist, as well as those scones from my favourite cafe, but living near mountains allowed me to find my strength as a “climber” – a cyclist who specialises in uphills.\n\nIn 2008, five-and-a-half years after my unwilling detour into cycling, I waited to start the Olympic time trial. Below the ramp, the road shimmered with heat, red flags hanging in the heavy air. Only Kristin Armstrong, winning the first of her three Olympic gold medals, would ride faster that day.\n\nIt wasn’t a straightforward route to Olympic success. There’s so much to learn to get anywhere close to elite level, and bike racing is not gentle on late starters. I lost a lot of races, slogged through many thousands of kilometres of training, and crashed countless times along the way. Sometimes I wondered why I carried on; a career as a professional cyclist hadn’t been my plan. But I’d found a lot to enjoy in cycling, and that was more motivating than brute ambition.\n\nAfter the Beijing Olympics, I signed for a pro team and assisted teammates in winning the Giro and the Tour de l’Aude. With their help, I went on to win some stage races myself. In 2010, I won the British championships in both time trial and road racing, and then the rainbow jersey as time trial world champion. I was part of two more Olympic teams in London and Rio. When I switched to triathlon, cycling came in useful at Alpe d’Huez in 2015 and for four duathlon world champion titles (2014-2017). And when I went back to competitive running, I found the cycling had made me stronger – I became Swiss trail-running champion in 2021 and finished 11th at the uphill world championships in 2023.\n\nI still love running; it’s the time when I feel best about myself. But now I love cycling, too. My bike has taken me to quieter places with more awesome views than a start ramp, and while winning races has been fun, long rides in the mountains with friends still feel even better.\n\nOat to Joy: Recipes and Somewhat of an Oatobiography by Emma Pooley is available now (YouCaxton Publications, £29). To support the Guardian buy a copy at guardianbookshop.com. Delivery charges may apply.\n\n\n\n\n\n",
  "authors": [],
  "url": "https://www.theguardian.com/lifeandstyle/2025/nov/19/a-moment-that-changed-me-i-broke-my-foot-and-took-up-a-sport-that-led-to-stratospheric-success"
}