{
  "title": "The flop that finally flew: why did it take 40 years for Sondheim’s Merrily We Roll Along to soar?",
  "text": "I have made enough mistakes as a critic to feel mildly chuffed when a verdict is vindicated. In 1981 I wrote excitedly about a new Stephen Sondheim musical, Merrily We Roll Along, that I had seen in preview in New York; reviled by reviewers and shunned by the public, it then closed two weeks after opening. In 2023-24 the very same musical ran for a year on Broadway, won four Tony awards and was hailed by the critics. Fortunately a live performance of that Maria Friedman production was filmed and I would urge you to catch it when it’s released in cinemas next month.\n\nI say “the very same musical” but that is not strictly accurate. Based on a 1934 play by George S Kaufman and Moss Hart, it is still the same story, told in reverse chronological order, of dissolving relationships: a success-worshipping composer and movie producer, Franklin Shepard, looks back over his life and sees how time has eroded both his creative partnership with a dramatist, Charley, and their mutual friendship with a novelist, Mary.\n\nBut, after the show flopped in 1981, Sondheim and the writer of the book, George Furth, made various structural changes. It no longer opens with a student song written by Franklin but with a gaudy party celebrating his latest movie success. The approach to casting has also changed. The 1981 cast was made up of fresh-faced performers who started by simulating middle age and eased naturally into youth as the evening progressed. Now it is standard practice to cast mature actors as in the Friedman production where Jonathan Groff, Daniel Radcliffe and Lindsay Mendez straddle the years with minimal adjustments.\n\nI should come clean and admit that I was moist-eyed for much of the Friedman film: my tears were prompted partly by the emotional heft of the story and partly by my pleasure in the music. The virtue of the narrative is that it will have different resonances for each individual. As in Pinter’s Betrayal, which also uses reverse chronology, it shows how life inevitably involves compromises, adjustments and a sense of loss. Not many of us, like Franklin, go from being songwriting tyros to showbiz sell-outs but we can all understand how the idealistic optimism of youth gets tarnished by time. Some may find a more sexual meaning to the story. Scott F Stoddart in an essay on Queer Sondheim sees a homoerotic element to Franklin and Charley’s friendship symbolised by what he calls the latter’s manic meltdown in a number, Franklin Shepard Inc, where he bewails being deserted by his creative partner.\n\nIf we each find what we want in the story we can all agree on the skill with which it is told. In his book, Finishing the Hat, Sondheim explains the techniques he uses. He points out that in most musicals you get a song followed later by the reprise. Because of the unusual structure of Merrily, the reprise comes first. He cites the example of Not a Day Goes By where Franklin’s estranged wife, Beth, initially sings “But you’re still part of my life / And you won’t go away” with a controlled fury. When we hear the song a second time it is actually a celebration of Beth and Franklin’s marriage as well as of Mary’s unarticulated love for him. The words are much the same but acquire new meaning because of the dramatic context.\n\nView image in fullscreen Jenna Russell, Damian Humbley and Mark Umbers in Merrily We Roll Along at the Harold Pinter theatre, London, directed by Maria Friedman in 2013. Photograph: Tristram Kenton/The Guardian\n\nThis is a show where Sondheim also subtly takes revenge on his critics. There is a lovely moment when a Broadway producer lectures the young Franklin and Charley on the need to provide hummable melodies in musicals, adding: “I’ll let you know when Stravinsky has a hit.” The ultimate irony is that Merrily We Roll Along itself is full of treasurable tunes, such as Old Friends, Good Thing Going and the title number that for me have been earworms for more than 40 years. I am always astonished by the accusation that Sondheim is a great lyricist but a deficient tunesmith for, although his songs always derive from a specific dramatic situation, they lodge permanently in the memory.\n\nIf there is a just charge against Merrily, it is that its hero, Franklin, is unsympathetic. But in this version Groff intelligently plays him not as an egomaniac monster but a tragic innocent who sails through life always taking the easy option. Mendez captures perfectly Mary’s unfulfilled romantic longings but the most eye-catching performance comes from Radcliffe, who lends Charley both an angsty neurosis and a passionate belief in the power of art to improve lives.\n\nWhether Merrily itself does that is up to you to decide. But Friedman’s production, closely based on the one she did at the Menier Chocolate Factory in 2012, is a constant joy and one that shows exactly why a famous flop is now a palpable hit.",
  "authors": [
    "Michael Billington"
  ],
  "url": "https://www.theguardian.com/stage/2025/nov/17/stephen-sondheim-merrily-we-roll-along-became-a-hit-after-40-years"
}