{
  "title": "Saudi Arabia has stood in the way of climate action. It’s quietly building a clean energy empire",
  "text": "A dark geometric sprawl breaks up an expanse of ocher-hued sand in Saudi Arabia. Close up, the structure is made up of row after row of solar panels, glimmering in the intense sun as it beats down on this scrubby, arid land about 60 miles south of the city of Jeddah.\n\nAl Shuaibah 2 is Saudi Arabia’s largest solar farm, with a capacity of more than 2 gigawatts, enough to power around 350,000 homes. But it won’t keep its crown for long. Even larger installations are already in development as mega solar farms proliferate across the country’s desert lands.\n\n“There is a solar boom, no one can deny that,” said Nishant Kumar, renewable and power analyst at the research firm Rystad Energy. Saudi Arabia has pledged to generate 50% of its electricity from renewable sources by 2030 and the race is on to meet it.\n\nAt first glance, it may seem an unlikely reinvention; this is oil country after all. Saudi Arabia boasts the world’s second-largest oil reserves, is the largest oil exporter and has consistently pushed back against global efforts to move away from fossil fuels. But what’s happening here shows even the planet’s ultimate petrostate is making a bet on clean energy — just as the Trump administration seeks to strangle it.\n\nThe pace of Saudi Arabia’s solar boom has been breathtaking. “No country is going faster,” said Dave Jones, co-founder of the climate think tank Ember.\n\nIn 2020, the country had next to no renewables. By the end of this year, it’s predicted to have 12 gigawatts of solar, Kumar told CNN. Saudi Arabia has added so much in 2025 that it’s broken into the top 10 global markets for annual new solar for the first time, according to BloombergNEF data.\n\nThe boom shows no signs of slowing. ACWA Power, the country’s utilities giant, which jointly owns the Al Shuaibah complex, announced in July — along with companies including state-owned oil and gas firm Saudi Aramco — an investment of $8.3 billion into 15 gigawatts of renewables, dominated by solar.\n\nBy 2030 solar will be growing “at a very fast pace,” Kumar said. Rystad projects more than 70 gigawatts will be installed by the end of the decade. “On top of that, they’re installing onshore wind as well,” he added.\n\nThere are plans to power huge infrastructure developments with clean energy, including the $500 billion futuristic city of NEOM and a luxury Red Sea tourism project.\n\nArrays of solar panels help power the Jazlah Water Desalination plant in Jubail, Saudi Arabia, in 2024. Iman Al-Dabbagh/The New York Times/Redux\n\nWorkers manufacture photovoltaic modules in Suqian City, Jiangsu Province, China, in July 2025. Saudi Arabia was among the top importers of Chinese solar panels last year. CFOTO/Future Publishing/Getty Images\n\nA man stands in the shade underneath a solar panel at a plant in Uyayna, Saudi Arabia, in 2018. Fayez Nureldine/AFP/Getty Images\n\nIt’s a striking move for a country built on oil. “Black gold” funded Saudi Arabia’s transition from nomadic desert country to a significant global power in just decades.\n\nBut experts say its solar surge makes sense for several reasons, one of the biggest being economics. Simply put: it’s cheap.\n\n“Solar is so cost competitive, it makes financial sense,” said Karen Young, a senior research scholar at the Center on Global Energy Policy at Columbia University. This is especially true given the accelerating electricity demand in the kingdom, driven by cooling needs and water desalination.\n\nCosts of solar have plummeted thanks to a flood of cheap Chinese-made solar panels into the market. The last two years have seen “just unprecedentedly low prices,” Ember’s Jones said. Battery costs have fallen, too, with average prices dropping by 40% in 2024 alone, according to Ember. Batteries make solar, which is otherwise only available when the sun shines, more flexible and even more attractive.\n\nAnd solar suits Saudi Arabia: The sun reliably shines throughout most of the year, it has cheap and plentiful land, and grid connection is inexpensive, as there is space for huge solar farms near big cities, Jones said.\n\nThe country also benefits from economies of scale. “All of their installations are vast” allowing them to negotiate down equipment and construction costs, said Abdullah Alkattan, Middle East and North Africa energy transition analyst at BloombergNEF.\n\nAnother key reason for Saudi Arabia’s renewables push, experts say, is to displace oil from electricity generation at home — and instead sell it overseas.\n\nAn employee walks past crude oil storage tanks at the Juaymah Tank Farm, part of Saudi Aramco's Ras Tanura complex in Ras Tanura, Saudi Arabia, in 2018. Simon Dawson/Bloomberg/Getty Images\n\nUnder its Vision 2030 strategy, aimed at diversifying its economy away from reliance on oil, Saudi Arabia pledged to source 50% of its electricity from clean energy and 50% from gas by the end of this decade.\n\nThere are big economic drivers for this. Burning oil domestically is inefficient and taking it out of the electricity mix frees it up to be sold on global markets, Alkattan said. “That’s where the profit is.”\n\nThis doesn’t mean climate considerations are absent from the country’s clean energy policies, Alkattan added. “To argue that ‘50% renewables, 50% gas’ is the cheapest electricity system available to Saudi Arabia is false,” he said. “This is part of the Saudi green initiative.”\n\nSome experts, however, urge caution about the extent of Saudi’s solar ambitions. “It is significant in the sense that they were doing absolutely nothing… and then in the last couple of years, you could really see a shift,” said Ana Missirliu, a climate policy analyst at Climate Action Tracker, which monitors governments’ climate policies. “But I would say, compared to what’s needed, it’s really still very, very insufficient,” she told CNN.\n\nSaudi Arabia’s overall climate policies and action are rated “critically insufficient” by CAT. Renewables only made up around 2% of Saudi Arabia’s electricity mix at the end of 2024, Missirliu said. Large amounts have been added through 2025 but she believes the 2030 target is far from feasible.\n\nOthers take a more optimistic view. Rystad projections show Saudi Arabia is on track to get more than a third of its electricity from renewables by 2030 and that its 50% goal will be achievable a few years later.\n\nSaudi’s solar aspirations can still send a message, regardless of whether the renewables goal is met, Missirliu said. “Even a petrostate like Saudi Arabia knows and recognizes that renewables are unavoidable.”\n\nIt’s a striking contrast to what’s currently happening in the US, where the Trump administration is trying to strangle solar and wind projects in the name of “energy dominance,” a strategy that is shorthand for ramping up fossil fuels only.\n\nSaudi Arabia’s approach is “truly an ‘all of the above’ energy strategy, which is where (it) is actually more engaged on clean tech and renewables than the US (is now),” Columbia University’s Young said. The country is also interested in developing a domestic solar manufacturing supply chain, including battery storage, and producing electric vehicles, she added.\n\nThis attraction to clean energy isn’t just a Saudi phenomenon. Other Middle East countries are building out renewables, including the United Arab Emirates and Oman. Even Iran, another major petrostate with huge oil and gas reserves, is turning to solar in an attempt to navigate power crunches linked to aging infrastructure, mismanagement and sanctions.\n\nNone of this signals the end of the fossil fuel era, however, not least in Saudi Arabia. There might be a solar surge, but the country remains a petrostate.\n\nThe Natural Gas Liquids facility stands among desert dunes in Saudi Aramco's Shaybah oilfield in the Rub' Al-Khali desert in Shaybah, Saudi Arabia, in 2018. Simon Dawson/Bloomberg/Getty Images\n\nSaudi Arabia is still planning to get 50% of its electricity from planet-heating natural gas, for example, “so we are seeing a surge in gas capacity,” Kumar said. Power consumption in the kingdom is also increasing so quickly that even with the rush of renewables, it’s not yet displacing large amounts of fossil fuels, he added.\n\nMeanwhile, the country remains a standard-bearer for oil, both in business and at the diplomatic negotiating table. Saudi Arabia, along with the US, played an important role in helping scupper a tax on the shipping industry’s climate pollution last month. It may be solar domestically, Kumar said, but “globally, they are pushing that oil is not going to go anywhere.”\n\nAs COP30 unfolds in Brazil, experts will be watching Saudi Arabia closely. The country “has always had a very disruptive role in climate negotiations,” said Missirliu. Whether that might now shift “is still something that we are waiting to see.”",
  "authors": [
    "Laura Paddison"
  ],
  "url": "https://www.cnn.com/2025/11/17/climate/saudi-arabia-solar-energy-empire"
}