{
  "title": "Apple Vision Pro with M5 review: Better than the first, still lonely",
  "text": "Apple’s Vision Pro remains the best VR headset by a mile, and there are many moments when it feels magical to use. I love staring at 3D photos, watching movies on huge screens, and working across a bunch of floating windows. But I noticed something weird after I wrote my first review in 2024: I took the headset off, put it back in its box, and didn’t put it back on again.\n\nThe new M5 model remains a very good headset, now slightly faster and more comfortable than its predecessor. But I’ve still found it hard to return to instead of just watching a movie on my iPhone or TV, or working right from my Mac. It requires putting something on my head, over my eyes, and creating an environment that I haven’t gotten used to yet.\n\nThat’s the struggle Apple and other companies will face trying to sell these: using it feels a little isolating — like I’m removing myself from the real world. It’s a neat device, but I can live without it.\n\nPerhaps the single most noticeable upgrade to the Vision Pro this year is the addition of the new Dual Knit Band. The new strap, which also works with the original, is a big deal. It adds a band across the top of your head and embeds weights into the strap behind it. This helps to balance the headset so it doesn’t feel as front-heavy, a complaint many had with the first version and its single-band strap. The whole setup is a hair heavier, but the better balance on my head is easily worth the tradeoff. The strap can be tightened in two places — on the top of your head and on the back — using a single knob on the righthand side. Twist to tighten one strap, and then pull out that knob and twist to tighten the other. It’s a clever design.\n\nMy colleague Jake Kastrenakes checking out the Vision Pro. Note the new headstrap.\n\nAs for the actual hardware, not much has changed: it’s the Vision Pro with an M5 processor inside. What does that mean in practice? Turns out the M5 enables some quality-of-life upgrades. Apple now allows the micro-OLED displays inside to refresh even faster, at 120hz compared to the max of 100hz in the first edition. I don’t remember feeling like the screens in the M2 version were blurry when I scrolled through websites or photos or moved my head quickly across a Mac display in the headset, but this should make that experience even smoother if it bothered you.\n\nBattery life is a hair better thanks to the M5, too. I streamed three episodes of Severance in a row before I hit a 10 percent warning, right in the range of Apple’s promise of three hours of video playback. That drops to two-and-a-half hours of “regular use,” which means just browsing the web, playing around in apps, and checking out some movies.\n\nWidgets are new since I last used the Vision Pro in 2024, though not limited to the M5, and I like that I can pin them to specific spots around my house and leave them there. So, I have a couple of photos and a playlist sort of “hanging” on the wall in my living room, and they’re always there when I put the headset back on.\n\nLooking at photos remains one of my favorite uses for the Vision Pro. The M5 uses artificial intelligence to turn regular photos into immersive pictures in just a few seconds — a bit faster than the M2, I’m told (I don’t have the original anymore to compare). These immersive photos and videos, which you can also record with the headset or a modern iPhone, feel close to being back in the moment, bringing people and scenes to life in 3D with a sort of colorful blur around them. Right now, it’s as close as I can get to loved ones who’ve since died. And I love seeing my daughter’s baby toes from a year ago in 3D.\n\nYou can see your phone, but passthrough is still blurry. Model Jake Kastranakes testing the Vision Pro.\n\nThere are lots of these “you have to see it to believe it” moments. It’s wild watching Apple’s immersive videos of animals in the wild or helicopters soaring over mountain tops. I’m bummed the library is still small and the videos are all relatively short. Apple continues to add more clips and “shows” that are sort of mini-documentaries, demonstrating how the headset can make you feel transported to another world. But I’d love a larger library of longer feature-length films. Most of what’s there feels a bit like demo content, generally lasting anywhere from a few minutes to 30 minutes. It’s relaxing to sit inside a huge movie theater and watch these on a massive display that looks crisp and real with high-quality spatial audio pumping into my ears. It’s just a bit sad there’s nobody to share it with (unless you’re a household with enough dough for several of these!)\n\nThe new chip also renders 10 percent more viewable pixels. This doesn’t mean there are more pixels on the displays — those are the same — it’s that the chip can show more of them to your eyes at once. This is part of the foveated rendering used by headsets like the Vision Pro. The pixels that your eyes are focused on are sharp, while the system seamlessly reduces the quality in your periphery. Text on sites and in apps is sharper as a result, but it wasn’t such a dramatic change that I could pick it out.\n\nSome of the widgets on my walls. They’re much clearer inside the headset.\n\nPersonas — the 3D versions of people that launched on the first version — look much more detailed and lifelike than ever. That makes the solitary feeling a bit better! But the only people I could chat with were Apple employees in a briefing. My friends don’t own Vision Pros. And they probably won’t until they cost a lot less.\n\nThen there’s the big promise of the Vision Pro: that this is a new, serious, and productive way of working for professionals. You really can get work done using it. Most of the apps I needed were available in the App Store or worked fine enough in the browser. I was able to see all of my open apps very clearly, edit the text of reviews in Google Docs, Slack with colleagues, and more. And I did it for several hours without eye strain. To the extent that Apple wanted to build a computer for your face, it’s done that.\n\nIt’s pretty fun working on a massive ultrawide monitor connected to your Mac.\n\nBut I also don’t really like using it for long periods. It starts to feel a little claustrophobic having something so significant on my face after a few hours. I also just prefer to be able to do regular human motions, like rub my nose bridge when I’m frustrated, cover my eyes and ruffle my hair when I make a mistake, or pace around the room without something on my head.\n\nI much prefer sitting here on my couch with my dog snuggled next to me, typing this review and seeing the real world without a headset on my face. The Vision Pro passthrough may be clear enough for many things — and slightly sharper thanks to M5 — but I will always lift it to speak with someone face-to-face, answer the phone, pet my dog, or walk around. To do anything, really.\n\nPhoto by Amelia Holowaty Krales / The Verge\n\nThe new Vision Pro is fun and sometimes magical, just like the first one was. But as Nilay Patel and I said in our first reviews back then, it’s lonely in there. I want to share the experience and feel less like I’m in another world and more like I’m in this one.\n\nApple needs to give me a reason to keep coming back. Maybe the company’s push into live sports is one way to help with that. It’ll offer NBA games in 2026 that will make you feel like you’re sitting courtside. But Apple needs a much smaller and lighter product if it truly wants to remove the friction between “I’ll watch this movie in the Vision Pro” and “I’ll just use my Mac.” Hopefully I’ll look less dumb in it, too.\n\nPhotos by Amelia Holowaty Krales / The Verge",
  "authors": [
    "Todd Haselton"
  ],
  "url": "https://www.theverge.com/tech/807963/apple-vision-pro-m5-review-specs-release-date"
}