{
  "title": "CEO Answers Startup Questions",
  "text": "Transcript\n\n[Cameraman] There's a whiteboard,\n\nin case, you want to do some math or something.\n\nNo, I'm not gonna do that. [Michael laughs]\n\nI'm Michael Mager, CEO of Precision Neuroscience.\n\nLet's answer your questions from the internet.\n\nThis is Startup Support.\n\n[upbeat music]\n\nNoooofun asks, How do you hire the right people?\n\nThis is a matter of life and death.\n\nFor any startup company,\n\ngetting the right people into the organization,\n\nis absolutely critical to success.\n\nPrecision Neuroscience is developing,\n\na brain computer interface.\n\nWe need people really\n\nwith deep knowledge around a certain technical area,\n\nand a demonstration that they've been successful,\n\neither in academia or in another company.\n\nThe X factor is real dedication to the mission.\n\nAny startup company has ups and downs.\n\nThere are good times and there are bad times,\n\nand the folks who really stick with it,\n\nwho really contribute over the long-term,\n\nare those who have bought into the mission\n\nof why the company exists in the first place.\n\nHere's one from the NoStupidQuestions subreddit.\n\nWhat does a CEO actually do?\n\nWould regular workers notice\n\nif the company didn't have one?\n\nI hope so.\n\nI think that sometimes,\n\na CEO's work doesn't maybe look like work,\n\nlike, you know, in terms of recruiting the team.\n\nHow do you do that?\n\nWell, you gotta get the word out.\n\nSometimes you get the word out by doing things like this.\n\nMy view of leadership is setting a goal\n\nand convincing other people that it's a worthy mission,\n\nand that they want to be involved\n\nin helping to achieve that mission,\n\nand inspiring them to work incredibly hard alongside you\n\nto achieve the mission.\n\nIt's really about summoning resources beyond just yourself\n\nor a small group of people in order to do something big.\n\nExitfund wants to know, I'm 21 years old.\n\nWhat skills should I start to develop\n\nfor becoming a CEO or an entrepreneur in the future?\n\nThose are really two separate questions.\n\nIf you wanna become a CEO,\n\nthere are a few pretty well-trodden paths.\n\nYou can go to business school, and get an MBA.\n\nYou can go into a management training program\n\nin a company that offers one.\n\nYou can work in a company for a long period of time\n\nthat you think you have the prospect of moving up over time\n\nand getting promoted eventually to the top job.\n\nIn order to be an entrepreneur,\n\nit's simple, you gotta start a company.\n\nIf you start a company,\n\nand you're able to convince investors to fund it,\n\nand you're able to convince people to join the company\n\nand work for you to help realize your vision,\n\ncongratulations, you're an entrepreneur.\n\nFuzzyloulou asks,\n\nWhat's the fastest way you've seen a CEO ruin a company?\n\nMy answer on this is a little bit counterintuitive,\n\nbut I've seen a lot of entrepreneurs focused on getting\n\nto good enough and moving on because there's so much to do.\n\nThis mindset of just sort of adequate,\n\nis incredibly dangerous for any startup for two reasons.\n\nI think the first is that with any new company\n\nthat is pitching a new product or a new service,\n\nyou are trying to change people's behavior.\n\nIt is hard to get people to spend money on new things.\n\nIn order to do so,\n\nyou should be shooting in every respect for amazing.\n\nThe product that you're offering\n\nor the service has gotta be absolutely fantastic.\n\nAnd I think the second reason is competition.\n\nThis is an incredibly, incredibly competitive world,\n\nand if the company that you are building is operating\n\nin a space that has the potential to be big,\n\nthere is the very strong likelihood\n\nthat you have several competitors\n\nwho are trying to do the same thing.\n\nAnd if you come out with a product or a service\n\nthat is good enough, that is adequate,\n\nthere is a very good chance\n\nthat one of your competitors usurps you in short order,\n\nor that one of your competitors already has,\n\nand you just don't know about it, because they're in stealth\n\nor because they're in a different geography,\n\nand you haven't heard about it.\n\nBuzz Mightyears asks,\n\nWhat the helly is a startup mentality?\n\nIs it something you are just born with?\n\nWhen I think about a startup,\n\nI think about two words, urgency and chaos.\n\nUrgency because, in general,\n\nyou know, a startup company needs\n\nto hit a certain amount of milestones\n\nto unlock its next round of funding.\n\nAnd if it can't hit those milestones,\n\nit's most likely gonna fail.\n\nAnd so there's a tremendous sense of urgency\n\nto make progress as fast as possible.\n\nChaos, because the rate of growth of companies,\n\nespecially, when they're gaining traction\n\nand being successful, is really unlike anything\n\nthat people are used to.\n\nWhen you think about a school or a religious institution\n\nor other organizations that you're part of,\n\nthey tend to grow a few percent a year, maybe 10% a year.\n\nStartups will often grow 100, 150, 200% in a year,\n\nand that puts a strain on everything, all of the processes,\n\nall of the systems in a company.\n\nFundamentally, startups often are operating\n\nin a state of chaos,\n\nand people who are comfortable with that, I think,\n\nreally thrive in the environment\n\nbecause you get opportunity to do all sorts of things.\n\nStartups, like any company,\n\ninevitably make a ton of mistakes.\n\nI think you have to get more right,\n\nthan you get wrong ideally.\n\nBut I do think it's an opportunity to be really creative.\n\nYou know, most startups are trying to sell a product\n\nor a service that either doesn't exist yet\n\nor to do it really differently from what's been done before.\n\nAnd I think it gives people a tremendous opportunity\n\nto really think outside of the box.\n\nAnd I think some amount of that thinking,\n\nis really necessary for success.\n\nAnd then also, you know,\n\nstartups have a culture of shared ownership.\n\nEvery employee is actually a shareholder in the company.\n\nAnd so I think that that really helps people feel bought\n\ninto the mission.\n\nUltimately, you know that if the company's successful\n\nthat you're gonna do really well.\n\nToocynicaltocare wants to know.\n\nWhy does HR exist?\n\nI think it's a typical mistake to actually discount HR.\n\nYou know, you're building a new product,\n\nyou're building a new service, you want all the money,\n\nyou want all the resources to go into building\n\nthat new product or service.\n\nAnd HR is viewed as something that is a nice to have,\n\nbut not a need to have.\n\nAnd as a result, it's often neglected for far too long.\n\nIf you think about what a startup is,\n\nwhat does it require?\n\nIt needs capital and it needs people.\n\nAnd HR is all about people.\n\nHow do you attract the best people?\n\nHow do you retain the best people?\n\nIt's about creating and disseminating\n\nand supporting the culture of the company.\n\nIt's about allowing people at the company\n\nto be well taken care of in terms of the benefits,\n\nadministering those benefits,\n\nand making sure the benefits are appropriate.\n\nBringing great people into the company,\n\nis really one of the absolute most important things\n\nto do on day one,\n\nand building an awesome HR function is critical to that.\n\nIt's important to have some part\n\nof the HR function in-house,\n\ngiven how core is to a company's operations.\n\nThat said, there are a lot of aspects\n\nof HR which are best partnered and outsourced.\n\nHealthcare is a great example of that, generally,\n\nsort of benefits management and administration.\n\nOften it's helpful to partner with an organization\n\nthat really specializes,\n\nand so you can benefit from pricing that's only available,\n\notherwise to larger companies even as a smaller company.\n\nTry to take some of the administrative burden off\n\nof the team's plate,\n\nand put it onto a specialized outsourcing partner.\n\nMonetaryWonk wants to know,\n\nWhy is it that Silicon Valley is a startup incubator?\n\nOn the capital side,\n\nSilicon Valley is still home to most of the best\n\nand deepest-pocketed investment firms\n\nthat fund early stage companies, venture capital firms.\n\nSo there's the famous Sandhill Road,\n\na very famous road in Silicon Valley, in the Bay Area,\n\nwhere so many of the best firms are based.\n\nThere are other areas that have emerged,\n\nthere's New York, there's Miami,\n\nthere's Austin, there's Europe.\n\nParts of the Middle East are also developing funding\n\nfor startup companies, but still the most capital\n\nand the most famous firms are based in Silicon Valley.\n\nSo many of the most successful companies,\n\nthe products that we love using in technology were created\n\nin Silicon Valley to raise capital from great firms.\n\nAnd you need to hire fantastic people,\n\nnot just in the United States,\n\nbut globally to help realize your vision.\n\nThere's still a tremendous amount of pull\n\nto that specific area.\n\n@Abbas_fkhrdine asks,\n\nWhy do you think most startups fail?\n\nStarting something new is hard.\n\nGetting people to part with their hard-earned cash\n\nor an organization to do so is difficult.\n\nYou also need to change people's behavior on some level.\n\nThe number of startups that actually succeed are\n\nin the single digits in terms of percentages.\n\nMost startups fail\n\nbecause they can't sustainably generate a profit.\n\nYou might ask then why people start companies,\n\nand I think that there's some aspect\n\nof hope over common sense that inspires entrepreneurs\n\nto do what they do.\n\nJiN88reddit asks, What's the difference\n\nin job description among CEO, CFO, COO and VP,\n\ncompared to an owner of a company?\n\nCEO, CFO, COO,\n\nthose are all functional roles within a company.\n\nThey have some management responsibilities,\n\naround finance, around operations.\n\nThe people who fulfill those roles,\n\ncould themselves be owners of the company.\n\nThey could own 100% of the company,\n\nthey could own a share in a company,\n\nbut those roles really describe\n\nwhat somebody does functionally at a company.\n\nThe owner of a company is someone who owns the equity\n\nof that business.\n\nTheoretically, an owner of a business,\n\ncan do absolutely nothing in that business.\n\nTheoretically, an owner can lie on the beach\n\nand eat bonbons all day,\n\nand watch the dividend checks roll in.\n\nIn practice, in my experience,\n\nespecially with smaller companies,\n\nthey tend to be more fragile.\n\nYou know, owners of businesses tend to be very involved\n\nin overseeing them either as one of the functional roles,\n\nCEO, COO, CFO, or as just a very active owner.\n\nBut if you think about it like anyone who owns shares\n\nin a publicly traded company is an owner,\n\nand there's no expectation of any functional involvement\n\nin the business,\n\nCEO is in charge of the entire enterprise\n\nto make sure that the company is on the right track,\n\nthat's executing on its deliverables,\n\nhas adequate funding, the buck stops with the CEO.\n\nThe CFO is in charge of all of the finances of the company.\n\nIf the company has any debt,\n\nmaking sure that it gets serviced,\n\ncashflow issues really spin up to the the CFO.\n\nAnd the COO is the chief operating officer.\n\nIt's an operating role,\n\nmaking sure that the company is executing on its plan,\n\nand projections efficiently.\n\nBobFredIII is asking, How does A CEO get fired,\n\nwho fires the boss?\n\nThe board fires the boss.\n\nThe board's job is fundamentally oversight.\n\nThe board makes sure that the company is executing\n\non its broad strategic goals.\n\nThe board also can make decisions\n\non major questions of strategy,\n\nyou know, financings, acquisitions, divestitures,\n\nif the company's considering selling itself.\n\nBut in terms of actual day-to-day impact in the business,\n\nthe board's influence is actually really limited,\n\nand it's by far its most important function,\n\nis overseeing the CEO.\n\nAnd when the CEO is not executing,\n\nreplacing him or her with someone who will.\n\nI think this is actually something\n\nthat doesn't happen enough.\n\nI think some of the most high profile bus stops\n\nin Silicon Valley, in startups,\n\nwe work and Theranos,\n\nthese are examples of the board really getting overwhelmed\n\nby the CEO and not exercising their oversight responsibility\n\nand doing what had to get done,\n\nwhich is ultimately replacing a CEO\n\nwho wasn't acting appropriately.\n\nCatflap10 asks, What does it mean\n\nto take a company public?\n\nCertain startup companies require more capital than others,\n\nbut most require some amount of capital.\n\nFor a company like ours\n\nthat's developing a brain computer interface,\n\nyou know, we have to fund the company\n\nfor many years before revenue.\n\nYou have to go through the product development stage,\n\nyou have to go through the regulatory process,\n\nthat's true for any pharmaceutical product,\n\nit's true for any medical device.\n\nGenerally, the way the companies like ours raise money is\n\nfrom private funds, primarily from venture capital.\n\nBut at a certain point, you can go public,\n\nwhich really means offering shares to the public\n\nthrough an IPO.\n\nThat can be a really great way\n\nto access large amounts of capital.\n\nBut it does come with administrative burdens,\n\ncertain regulatory burdens,\n\nand so it can be actually quite expensive\n\nand resource-intensive, which is why generally,\n\ncompanies do it at a later stage,\n\nwhen they can afford the administrative overheads\n\nthat it requires.\n\nThat said, it can impose,\n\na really healthy discipline on companies.\n\nIn general, companies are more successful going public,\n\nwhen they have demonstrated revenues which are growing,\n\nand where they can predict what they're going to generate\n\nin terms of revenues and earnings\n\nfor the next quarter and the next 12 months.\n\nFor us at Precision, I think our ambition is\n\nto go public when we're commercial.\n\nHouseplantshustle wants to know,\n\nWhat is my startup worth?\n\n25 million runrate, 58% gross margins.\n\nI wish it were that simple\n\nthat you could just plug in a few numbers\n\nto an Excel spreadsheet,\n\nand it would spit out a business value.\n\nThere's a lot more that goes into valuing a business.\n\nYou know, think about how defensive is the business,\n\nwhat are the growth prospects of the company?\n\nAre the margins sustainable?\n\nHow subject to disruption is the industry?\n\nIf you look at the stock market,\n\nyou can see that people's perception of value\n\nin companies is a lot more volatile,\n\nthan the actual earning streams of the companies themselves.\n\nAnd that just gives you a sense that valuing a company,\n\nthere is a science to it, there is math associated with it,\n\nbut there's also a lot of judgment, and you know,\n\na lot of volatility around people's expectations.\n\nRun rate is, generally,\n\nif you sort of take the last month or last three months,\n\nthat's the run rate at which revenue is right now\n\nif it stays at that same rate over time.\n\nSo hopefully, the revenue run rate is going up over time.\n\nIt's a way of basically looking at revenue,\n\nnot for the trailing 12 months,\n\nwhich is often, how much revenue do you generate in 2024,\n\nor how much are you gonna generate in 2025?\n\nThis is a way\n\nof doing a sort of more up-to-date approximation\n\nof what the company is generating.\n\nGross margins are the revenue, less the cost of goods sold.\n\nSo it gives you a sense of what the unit economics are,\n\nbut there's a lot not explained by the gross margins.\n\nLike, did you have to build a $500 million factory\n\nin order to generate $24 million of revenue\n\nin 58% gross margins?\n\nOr did you start a software company,\n\nand you only needed to invest a million bucks\n\nto get to 25 million of revenue and 58% gross margins?\n\nThose two questions really helped determine\n\nwhat the company is worth,\n\nand what the future value is likely to be,\n\nwhich unfortunately, Houseplantshustle,\n\nhas not given us insight into.\n\nGlittering_Flan1049 wants to know,\n\nHow do I raise pre-seed funding for my startup?\n\nPre-seed funding really meaning,\n\nhow do I raise the initial capital to get off the ground\n\nfor a company?\n\nIt really depends on the business.\n\nSo if you want to start something like a restaurant\n\nor a storefront,\n\nthere are ways of raising either a loan from a bank\n\nor through the SBA, the small business administration,\n\nfor money in the sort of tens of thousands of dollars\n\nto get off the ground.\n\nIf you have an idea for a business\n\nthat has the potential to be big,\n\nand that requires significant amounts of capital,\n\nthen you're likely a good candidate for venture capital.\n\nSo you know, I'm the CEO\n\nof a company developing a brain computer interface,\n\nthat will likely cost somewhere between four\n\nand $500 million from start to finish.\n\nThat is way more money than friends or family could fund,\n\nor anybody can fund out of their own savings.\n\nSo we have gone to the venture capital community\n\nto fund the business,\n\ngoing to investors and convincing them\n\nthat the idea that you have is worth funding,\n\nand that the team around you have the capability\n\nof executing on that.\n\nAnd if you can do that, you know,\n\nyou can raise capital and get going.\n\nCodemon_ wants to know how does startup funding,\n\nsuch as Series A, B, C, et cetera, work?\n\nWe're developing a brain computer interface.\n\nIt will cost somewhere between four and $500 million\n\nto develop from start to finish.\n\nIf we tried to raise all of that money all at once,\n\ninvestors would've laughed us outta the room.\n\nWe were a couple of guys\n\nand a PowerPoint presentation pitching a dream.\n\nThe way that investors tend to look at a company,\n\nis over the long-term to make sure\n\nthat it's hitting its milestones.\n\nAnd if companies are making progress,\n\nthen they are able to generally raise money\n\nin different rounds,\n\nand at subsequently higher and higher valuations.\n\nSo we raised an initial round of $12 million,\n\nwe hit a bunch of milestones,\n\nthe value of the company increased,\n\nand then we did another round, our Series B round,\n\nin this case, at a higher valuation.\n\nAnd when that works,\n\nwhen you're able to raise subsequent rounds\n\nat higher valuations,\n\nwhat that means is that the existing owners of the business,\n\nthe employees and the existing investors,\n\nhave to give away less and less ownership\n\nin order to raise capital.\n\nHad we tried to raise all $500 million at once,\n\nwe would've had to give investors 90% plus\n\nof the business right off the bat\n\nif investors had been willing to do it.\n\nAnd so that would've been bad for us,\n\nand it would've been bad for the investors.\n\nAVGuy42 says, Screw your success.\n\nTell us your greatest failure!\n\nStarting a company is never a straight line.\n\nYou hope that the successes outweigh the failures,\n\nbut there are inevitably gonna be a bunch of both.\n\nOne of the core assumptions\n\nthat we made when we started the company,\n\nPrecision Neuroscience, was that the array\n\nthat we're developing,\n\nwhich is actually the part of the system\n\nthat sits on the brain,\n\nthat we would be able to manufacture it\n\nin the United States.\n\nIt turned out that the supply chain\n\nthat we had expected to be there, didn't exist.\n\nWe had finite resources, an early stage company,\n\nwe spent over a million dollars working with a supplier\n\nthat said they could do it, that had made some progress\n\nin validating that they could do it.\n\nAfter spending seven figures, they delivered six arrays,\n\nwhich on average, about 30% of the electrodes or sensors,\n\nin our case, actually worked.\n\nThat is not the basis of a successful company.\n\nWithout a path to manufacturing at commercial scale,\n\nyou know, hundreds and thousands a month\n\nin a sustainable way,\n\nthere was no way to continue to build the technology.\n\nThere was a facility in Texas, we moved really quickly,\n\nwe ended up acquiring it.\n\nIn a process that usually would take six months,\n\nwe were able to do it in six weeks.\n\nAnd in the end,\n\nthis facility has become a really important strategic source\n\nof strength for the company and competitive differentiation.\n\nBut staring into the gun barrel of no clear supply solution,\n\nwe had no idea that that was gonna be possible.\n\nSo if everybody knew all the things they didn't know,\n\nwhen starting a company, no one would ever do it.\n\nI think at a certain point,\n\nyou just have to have the courage to jump off the cliff,\n\nand figure it out On the way down.\n\nBlackdognick82 wants to know,\n\nBut the gap between top earners and lower earners,\n\nhas got wildly out of control.\n\nThe percentage difference between CEOs\n\nand workers is higher than it's ever been.\n\nHow do you address that imbalance?\n\nIt's true that the gap between CEOs\n\nand the median worker has expanded enormously\n\non the order of 10X in the past 40 years.\n\nBeing in a startup company,\n\nit's actually quite a different dynamic.\n\nStartups are generally cash-starved,\n\nand so you have to be incredibly careful\n\nabout where finite resources are allocated.\n\nCash salaries being in the millions of dollars,\n\nis absolutely not the rule.\n\nI also think it depends a little bit on the industry.\n\nThe technology that we're developing,\n\na brain computer interface,\n\nrequires an incredible amount of scientific\n\nand medical expertise.\n\nWe have a lot of PhDs on staff.\n\nFor us, having a very wide discrepancy between pay\n\nof the average worker and the pay of the seam suite,\n\nhas the potential to be very corrosive\n\nto the culture of the company.\n\nFor a company like Precision,\n\nevery employee is an owner in the business.\n\nAnd I think that's incredibly important\n\nin terms of alignment around a common mission,\n\nbut it also means that if we as a company,\n\nend up being very successful,\n\nevery employee in the company is also gonna share\n\nin that success.\n\nOur ambition is to make a lot of people millionaires,\n\nand I think that that would feel wonderful\n\nin addition to doing something good in medicine\n\nand in science to actually make sure\n\nthat the people who really build the company,\n\nend up benefiting from it.\n\nI think that that really is the Silicon Valley model,\n\nand I think it's one that we're really excited to pursue.\n\nThejanaymichele wants to know,\n\nHow tf do stock options work for a company?\n\nAnd equity stock options the option,\n\nbut not the obligation to buy stock in the company,\n\ngenerally, the exercise price,\n\nso the price at which you have to pay\n\nto acquire the stock is set at a low value\n\nso that if the company ends up being enormously valuable,\n\nyou can pay a relatively small amount.\n\nFor equity in the company,\n\nthat ideally should be worth a great deal more.\n\nIf a company ends up being acquired,\n\nwhich actually happens more frequently,\n\nthan a company going public,\n\nemployees typically exercise their options,\n\nright before the acquisition,\n\nand so get their pro-rata proceeds from the acquisition,\n\nor if the company goes public,\n\nand you exercise your options before the IPO,\n\nand then there's a liquid market\n\nin which you can sell your equity,\n\nhopefully, at a much higher price than the exercise price.\n\nSkyballads says, Looking at the KPI sheet,\n\nand what the actual hell is this?\n\nKPIs are determined by management teams\n\nto gauge the health of the company,\n\nthe trajectory of the company, the prospects of a company,\n\nand those actually even within a company,\n\ncan change over time.\n\nThere are some that I think are pretty universal,\n\nlike, you know, burn very important.\n\nYou need to look at the amount of cash you have on hand,\n\nand the amount of cash that is being depleted,\n\nand the rate at which it's being depleted,\n\nand keep a very close eye on that.\n\nI think that's true for virtually any business,\n\nbut I think KPIs otherwise really depend on the business\n\nand the industry that you're in.\n\nIf you have a software company,\n\nyou might be looking at retention.\n\nWhat percent of the people who sign up\n\nfor your product continue to pay\n\nfor it 12 months afterwards?\n\nIf you have a media company,\n\nyou're probably focused on how many people view your video\n\nor listen to your podcast.\n\nFor a company like ours,\n\nwhich is developing a medical device,\n\nwe have regulatory milestones,\n\nwe have product functionality milestones,\n\nthe ability to measure the things that really matter is one\n\nof the most important judgment calls\n\nthat a management team can make.\n\nKkw16 wants to know,\n\nCan someone help me understand the different phases\n\nof FDA approval process?\n\nWell, the FDA approval process really depends on\n\nwhether you're developing a drug,\n\nlike a pharmaceutical product,\n\nsomething that's in digital health,\n\nso like a software program.\n\nThey all have slightly different regulatory pathways,\n\nbut they all generally are intended really\n\nto gauge two things, that the product is safe,\n\nand that the product is effective.\n\nIn a series of tests,\n\nfirst, in the lab, and eventually,\n\nwhen the system has demonstrated a significant amount\n\nof reliability and underlying safety, you implant patients.\n\nI think the FDA provides an incredibly,\n\nimportant regulatory regime in which to operate.\n\nBut ultimately, I think,\n\nyou know, any company that's developing technology\n\nand they're trying to do it the right way,\n\nalso has those same goals in mind.\n\nThey want to develop something\n\nthat's gonna make a positive impact on human health.\n\nAnd in order to do that, you gotta do something that's safe,\n\nand it's gotta actually fulfill what's on the label.\n\nIggy says, Acronyms used to mean something, man.\n\nWTF is EBITDA or EBITDA.\n\nEBITDA stands for earnings before interest,\n\ntaxes, depreciation, and amortization.\n\nSort of a quick and dirty calculation\n\nfor a cashflow that a company is generating,\n\nirrespective of its capital structure.\n\nSo if it has lots of debt,\n\nif it has no debt, you're not focused on that,\n\nand you're not focused on non-cash charges,\n\nlike depreciation and amortization.\n\nIn some cases, it can make sense.\n\nSo if you think about building a building,\n\nif the accounting rules force you\n\nto depreciate the entire building in 15 years,\n\nbut actually, the building's gonna last for 75 years,\n\ndepreciation can overstate the charges,\n\nand really understate the underlying cashflow of a business\n\nor of a project.\n\nAnd so it can make sense to either adjust\n\nor even eliminate certain charges.\n\nI think this is often used by the private equity industry,\n\nbut it has some pretty obvious flaws.\n\nYou build a factory, it does depreciate,\n\nthings break, you gotta replace the widgets.\n\nI often look at operating cashflow,\n\nless capital expenditure,\n\nbecause capital expenditure is often really required\n\nin order to maintain and grow a business.\n\nRight-Juice-6079 wants to know,\n\nIf you had to start your business again from scratch today,\n\nwhat would you do differently?\n\nI'm not sure I would do a lot differently,\n\nbut I think my perspective has changed in some regards.\n\nI think when you start a company,\n\neverything seems like it's life and death,\n\nand in a startup, there is a lot that's life and death.\n\nYou really need to move with urgency in the day to day.\n\nAnd yet, you know,\n\nI think knowing what I know now,\n\nit's really about perseverance over a long period of time.\n\nThis is very much a marathon, not a sprint.\n\nTrying to focus on the things that really matter,\n\nand focusing a little bit less on putting out every fire\n\nas quickly as possible is something\n\nthat will help sustain people over longer periods of time,\n\nand really avoid burnout.\n\nIn the first few years of precision,\n\nI felt that I could never be the bottleneck for anything.\n\nAnd so anytime an investor reached out,\n\nanytime a prospective partner reached out,\n\nanytime a prospective employee reached out,\n\nI was the first to respond.\n\nI never left the office with any in my inbox.\n\nI felt a tremendous sense of urgency\n\nto move the organization forward in every way\n\nthat I possibly could.\n\nAnd in retrospect, some of those things were important,\n\nand a lot of them really weren't.\n\nThey could wait a day,\n\nthey could even wait two or three days.\n\nSo those are all the questions for today.\n\nThanks for watching Startup Support.\n\n[bright upbeat music]",
  "authors": [
    "Condé Nast"
  ],
  "url": "https://www.wired.com/video/watch/tech-support-ceo-answers-startup-questions"
}