{
  "title": "The Fight Against Surveillance Capitalism: A Conversation with Meredith Whittaker",
  "text": "Transcript\n\nHi, thank you all for being here today,\n\nto echo what Katie said.\n\nI'm so excited to be talking with Meredith Whittaker.\n\nMeredith is the President of the Signal Foundation,\n\nwhich for those who don't know overseas and runs\n\nand maintains the Signal Messenger,\n\nwhich is an encrypted messaging app and platform\n\nthat is used by hundreds of millions of people globally.\n\nAs far as WIRED's concerned,\n\nthe gold standard in encrypted messaging,\n\nwe all use it, recommend that you do too.\n\nBut Meredith also co-founded the AI Now Institute at NYU,\n\nwhich focuses on the social implications of AI and tech\n\nand spent over a decade at Google,\n\nwhich I think is also especially relevant\n\ngiven what we're talking about today, which is the idea of,\n\nit says surveillance capitalism.\n\nOh, it did.\n\nThe name of the talk Does it.\n\n[Brian] Where? is about\n\nsurveillance capitalism, if you check your program,\n\nif there's a program.\n\nBut I think we wanna draw a little bit of distinction there\n\nabout what we're really talking about today, Meredith,\n\nwhich is more of a surveillance business model\n\nthat has kind of defined the last couple of decades of tech.\n\nYeah, well, it's great to be here with you, Brian,\n\nand thank you everyone.\n\nI think, you know,\n\nas someone with a bit of an academic background\n\nwho really pays attention to definitions,\n\nthis is just a clarification I often make,\n\nsurveillance capitalism is an more or less academic term\n\nthat is very freighted with sort of disciplinary histories.\n\nAnd when we at Signal,\n\nwhen I talk about the surveillance business model,\n\nwe're being a bit more diagnostic and a bit more, I think,\n\nschematic about what we're talking about.\n\nUltimately, Signal exists in an industry\n\nwhere the profit incentive is defined by surveillance,\n\nand that's not a scary term.\n\nIn this case, we're talking about data collection.\n\nYou collect as much data as you can\n\nabout whatever your domain is, your customers,\n\nyour environment, what have you.\n\nYou use that to create models, to target ads, perhaps,\n\nor to train AI models or what have you.\n\nOr if you don't do that, you provide goods and services,\n\ntool chains and libraries to those who do.\n\nSo there's a flywheel,\n\nthere's sort of a center of this industry\n\nthat is defined economically\n\nby the collection and creation of data\n\nwith this sort of the more, the better paradigm.\n\nAnd in Signal's case, we reject that out of hand,\n\nof course, because we are motivated and dedicated\n\nto preserving privacy, to creating technology\n\nthat maintains the hundreds of thousands of years of,\n\nyou know, private communications as a norm\n\ninto an age where privacy is vanishingly scarce\n\nin our daily lives and communities and activities.\n\nSo when we talk about the surveillance business model,\n\nwe are talking about a paradigm\n\nwithin which Signal both exists and which it rejects.\n\nAnd I think what we see here\n\nis Signal almost as the acid test for what's wrong\n\nwith the current incentive structure in tech,\n\nwhen something as valuable as Signal\n\ncan't figure out how to make a profit.\n\nWhen we can be core infrastructure for human rights work,\n\nfor journalism, for every military in the world,\n\nif we're gonna be frank, for governments, for boardrooms,\n\nwhen it's clear we are the gold standard\n\nfor a value that everyone cares about.\n\nThe Apple Billboards proclaiming privacy,\n\nMeta's sort of turned to privacy.\n\nThis is something,\n\nit is clear there is a market for and people want,\n\nand yet we have to squeeze ourselves into a nonprofit shape\n\nthat is not quite conducive\n\nfor the high availability realtime tech\n\nwe are maintaining and developing,\n\nsimply because there's no real way to make a profit\n\nin the tech industry given the surveillance incentives.\n\nSo I think that introduces\n\nwhy we focus on that paradigm so much\n\nand kind of the distinction practically speaking\n\nbetween how we use it\n\nand how it might be used in different academic discourses.\n\nWell, and I think that is the central question, right?\n\nIs you are presenting a model\n\nof how to do things differently\n\nand beyond just messaging,\n\nbut you are providing the messaging, a messaging model\n\nand then maybe other people can follow that.\n\nBut I think what's interesting\n\nand why I'm glad to talk to you\n\nis that it's not just hypothetical,\n\nyou are currently making it work\n\nand you genuinely have this sense that things are changing.\n\nYou wrote for WIRED in an essay\n\nthat we published a couple weeks ago,\n\nNext year will be big tech's finale.\n\nDo you feel like we are at a sea change?\n\nDo you feel like we are that close\n\nto things unwinding for big tech or, you know,\n\nis that a little more hyperbolic\n\nand it takes a little more step,\n\na few more steps to get there?\n\nYeah, well, look, y'all asked me in the middle of 2024\n\nto write a prediction for 2025, like, you know,\n\npast data does not necessarily predict a volatile future.\n\nAnd what I really wanted to write was,\n\nyou know, like I sat down and I thought,\n\nwell, what is there to be optimistic about right now, right?\n\nLike, how do I actually\n\nsort of sincerely communicate optimism?\n\nAnd what I came to is, well, you know,\n\nlet's write something that is half manifestation\n\nand half optimism as invitation, right?\n\nThat's not a prediction where we say,\n\noh, it looks like, you know, probability approaching one,\n\nwe can all sit back\n\nand let the gears of the world take shape.\n\nNo, this is an invitation to action\n\nand to marshal the forces that I do truly see fomenting\n\nin which I have never seen a broader\n\nand more heterogeneous coalition\n\nlooking at concentration of power in tech,\n\nlooking at the deep dangers of pooling vast dossiers\n\nof surveillance data on every person on earth\n\nin the hands of a few companies,\n\nlooking at these choke points and single points of failure\n\nwhere, you know, one bug and a kernel driver\n\ncan take down core infrastructure globally across medicine,\n\ntransportation, governments, you know, what have you.\n\nLike, none of those things are chill or nice.\n\nNo one is championing them,\n\ncertainly not in the way they were 10 years ago\n\nor even five years ago,\n\nso, you know, the first step to a strategy for change\n\nis an honest map, and that's what I think we have now.\n\nNo one is pretending this is okay.\n\nAnd so that is the opportunity\n\nand the invitation for change.\n\nAnd again, to take things like Signal,\n\nwhich is, you know, we're existing as a nonprofit.\n\nWe exist on donations.\n\nWe persevere at being kind of the keystone species\n\nin the tech ecosystem around privacy and tech\n\nthat is rights preserving and works with integrity,\n\nbut we're not looking to be alone, right?\n\nWe don't wanna be the outlier that proves the rule.\n\nWe want to be a new set of rules\n\nleading the way to a much more open\n\nand diverse tech ecosystem that,\n\nagain, isn't reliant on like,\n\nyou know, 5 companies and 15 guys\n\nin a paradigm that is very, very stale,\n\nand ultimately not healthy for the world or the future.\n\nWell, and I wanna talk about Signal and how it is,\n\nyou know, it is ubiquitous,\n\nespecially among the privacy conscious.\n\nBut that ubiquity is expensive, right?\n\nSignal cost about $36 million to run last year\n\nand about 50 million to run now, which is a pretty big jump.\n\nAbout two thirds of that,\n\nby my understanding at least in 2023,\n\ncame from contributions.\n\n[Meredith] Is that? It all came\n\nfrom contributions.\n\n[Meredith] All, okay. It's fully\n\ndonor supported. So as you grow,\n\nthings get more expensive, you need more donor support\n\nto fund all of this, these features, these servers,\n\nhow sustainable is that?\n\nDo you feel like you're on a flywheel right now\n\nwhere as you grow the donations grow in kind\n\nor does there need to be another model that steps in\n\nthat makes you sustainable for the long term?\n\nWell, I mean, it's kind of a,\n\nit's a bit of a tricky question\n\nbecause it's sustainable right now\n\nbecause there are a lot of people who value privacy\n\nand who get why what we're doing is so critical, right?\n\nLike, one thing to take home, we couldn't make Signal again\n\nif the heartbeat stopped, right?\n\nIf Signal went away for a year, you can't just restart\n\na globally interconnected communications network\n\nwhere you can pick up your phone\n\nand knew your friend also has it installed on their app.\n\nThat network effect is huge, it is not replicable.\n\nAnd when Signal came up over 10 years ago\n\nwhen it emerged as two apps, then one app,\n\nand the sort of history of Signal\n\nand the masterful work of its founder, Moxie Marlinspike,\n\nwho basically carried this thing through for a decade,\n\nit was coming up in an environment\n\nwhere its competition was web clients.\n\nLike remember Jabber and Google Chat, right?\n\nIt was coming up in an environment\n\nwhere less than 30% of human beings had a smartphone.\n\nMost people left their desktop at their work\n\nwhen they went home.\n\nA vastly, dramatically different ecosystem\n\nthan what we have today where we have incumbent monopolies\n\nwho've saturated the market, right?\n\nAnd so we're talking about preserving something\n\nthat grew through the cracks into sort of a mighty tree,\n\nlet's use that metaphor,\n\nand needs to continue to be fed and watered\n\nbecause without that, you know,\n\nwe can't just snap our fingers and introduce tech\n\nthat will actually serve the purpose of Signal, right?\n\nBecause everyone has to use Signal for you to use it.\n\nYou can be the most, you know,\n\nthe most virtuosic cryptographer\n\nwho created the most elegant\n\nand beautiful private communications technology.\n\nYou go out there, you're like, hey, use it, right?\n\nBut if your friend doesn't use it,\n\nit doesn't matter to you, right?\n\nSo that network effect is hugely important\n\nand the reputation that Signal has developed\n\nbecause of the care and attention\n\nand sometimes agitation of the hacker and InfoSec community\n\nis equally important, 'cause we develop all in the open,\n\nour cryptographic implementations and our core technologies\n\nare open source, every change to our repo get scrutinized\n\nby like communities of dudes\n\nwho are like trained spotters for signal code pushes, right?\n\nAnd that like, we love them for it\n\nbecause they will find a little bug and they will report it,\n\nso it's really making good on the promise\n\nthat many eyes make more secure code.\n\nAnd again, that's, you know, similar to CUDA\n\nor some of the other standards and infrastructures\n\nyou might hear about in other sectors like AI,\n\nwhat we're talking about is a community of practice,\n\na community of labor norms, and a sort of,\n\nyou know, standardized understanding of tech\n\nthat has come through this, you know,\n\nSignal as infrastructure over about 10 years,\n\nand again, can't just be recreated, right?\n\nI can publish anything on GitHub,\n\nbut I can't force anyone to read it or care about it, right?\n\nSo these things are very, very precious\n\nand they need to be maintained.\n\nThey need to be supported,\n\nand right now we do have support.\n\nWe're looking to diversify that,\n\nyou know, now is a very critical moment for privacy,\n\npreserving communications.\n\nYou know, the more geopolitically volatile the world is,\n\nthe more it's important for us to be able to have real talk\n\nthat is not interrupted by surveillance.\n\nAnd so I think, you know,\n\nwe're working on growing the base of supporters\n\nand thinking through are there models\n\nthat can marshal the type of money we need, right?\n\nIt's absurd that we are a core infrastructure,\n\nyou know, from everything to human rights and defense,\n\nand then you see these companies\n\nthat are basically white labeling some like AI API\n\ngetting billion dollar valuations,\n\nand we can't figure out how to like make money on that\n\nto sustain a thing that if it went away\n\nwould literally change the fates of nations,\n\nlike y'all, right?\n\nWell, and can I, you wrote also,\n\nI know you wrote it a little bit ago, but about this idea\n\nof this nonprofit critical infrastructure ecosystem, right?\n\nSo not just Signal, but other aspects\n\nwhere we are too reliant on private companies.\n\nWhere's the, where's the nonprofit version of that?\n\nAnd as part of that,\n\nyou mentioned a need for state capital to get involved\n\nat some point.\n\nIs that when you talk about\n\nalternative and diversifying funding,\n\nis that something that Signal's looking at?\n\nAnd are there any concerns with that too\n\nabout taking money from governments\n\nthat you're also protecting people from with,\n\nyou know? Yeah,\n\nnone of this is simple friend.\n\nYeah, oh yeah, no for sure.\n\nLike what I'm looking at\n\nis there's the type of capital we need,\n\nhow do we get it?\n\nNot how do we partner with states, absolutely not,\n\nnot how do we sort of enter into shady agreements.\n\nI think there is, you know,\n\nthe issue here is not nonprofit or for-profit.\n\nNonprofit is a tax status,\n\nit's not actually like comfortable or amenable.\n\nLike we are constantly, you know,\n\nI feel like we're like fitting inside a dollhouse.\n\nWe're like a massive, you know, like tech,\n\nnot massive in size, but like, we have to maintain,\n\nwe have to act and function like a tech company.\n\nWe are for all intensive purposes a tech company.\n\nWe are a nonprofit tech tax structure,\n\nbecause again, that means that my board\n\nisn't gonna go to Davos\n\nor isn't gonna be pushed to have sort of,\n\nyou know, a profit motive come back to me\n\nand be like, I love you Meredith.\n\nI love this privacy thing real cool, real nice,\n\nbut ultimately I have a fiduciary duty\n\nand just as the board sold Twitter,\n\nour board is gonna have to strip some privacy protections\n\nbecause you have to be making some revenue, right?\n\nThat's the risk that we are warding against\n\nwith the nonprofit structure.\n\nWe are not celebrating nonprofit\n\nas some sort of alternative to private enterprise,\n\nand those are the two,\n\nyou know, the cage match there, right?\n\nThis is a structure that we have to have\n\nif we're gonna preserve our obsessive mission on privacy,\n\nbecause otherwise it would be whittled away\n\nbecause those dudes on my board\n\nultimately have no choice or they want an AI strategy\n\nor they're, you know, whatever, whatever.\n\nThere's a lot of ways we could make money\n\nthat we simply are not gonna make money doing\n\nbecause we're privacy preserving.\n\nSo the call here is not everyone come be a nonprofit.\n\nNonprofit is not the perfect form.\n\nIt is a prophylactic from the incentives,\n\nthe perverse incentives that define the industry we're in.\n\nAnd that, you know, how do we create better incentives?\n\nHow do we marshal things like state capital, which is,\n\nyou know, let's be clear\n\nthat's going to tech all day every day.\n\nIf you look at the subsidies,\n\nif you look at the research history,\n\nif you look at the massive cloud contracts\n\nthat are now ultimately the pipeline of revenue\n\nfor most of these companies, or a big pipeline of revenue,\n\nlike there's no state capital involved here.\n\nI mean, you look at their government sales departments\n\nin any one of these large companies,\n\nthey, you know, [indistinct] has a magnitude\n\nbigger than Signal's team, right?\n\nSo we also have to stop with these bright lines\n\nas if there's some, you know,\n\nclear I guess difference between sort of private industry\n\nwith state control, what have you, yeah.\n\nSo I think the question then is how do we marshal that,\n\nyou know,\n\nhow do we marshal state capital without state control?\n\nHow do you get long-term commitments, guarantees?\n\nHow do you do things like the sovereign tech agency\n\nin Germany, which was set up ultimately\n\nto take government appropriations,\n\nbut then has a lot of clear, a lot of clear boundaries\n\nwhere they independently allocate those\n\noutside of state control.\n\nSo we're, you know, we're interested there,\n\nbut I had to, I had to kind of go into a long digression,\n\nI think to explain what we're actually talking about,\n\n[Brian] which is not, It was a good one.\n\nnot a clean schematic, not a clean divide\n\nbetween for-profit\n\nand non-profit. Clean is boring.\n\nI think that was a really\n\n[Meredith] illuminating. Yeah,\n\nclean is boring. Yeah, right?\n\nWhile we're on the topic of governments,\n\nwe obviously had an election here in the US recently.\n\nDonald Trump, yeah. What, when?\n\nIt's true, it's true.\n\nRead about it on wired.com.\n\nIs that a website? It is, it is.\n\nSo, but I wanna talk to you about it.\n\nI think a, there's, well, the Trump administration,\n\nthe last go round was hostile to encryption,\n\nnot, you know, several governments worldwide are.\n\nYou've got Kash Patel coming in potentially as FBI director.\n\nHow does this affect Signal, its users?\n\nLike what is Signal's role in this moment?\n\nHow are you feeling about the incoming administration,\n\nboth for your users and for Signal itself?\n\nI mean, look, Signal knows who we are.\n\nSignal will continue being Signal.\n\nSignal has one thing we do and we do it really well\n\nand we do it pretty obsessively, and that is provide\n\ntruly private communications infrastructure\n\nto everyone everywhere globally, full stop.\n\nWe're not changing.\n\nThat's how I feel.\n\n[audience applauds]\n\nIs Signal going to stay in the United States\n\nno matter what in terms of where it's based?\n\nI mean, we're a global, we're a global operation\n\nin so far as we, you know,\n\npeople use Signal everywhere around the world,\n\nacross the globe.\n\nWe're an open source project.\n\nWe have people who, you know,\n\nwe don't routinely take third party commits,\n\nand when we do, we scrutinize them really closely, right?\n\nBut we do have people who sort of,\n\nyou know, contribute to Signal globally.\n\nWe're a jurisdiction in the US and we don't, you know,\n\nwe don't have plans to share on that, but we are, you know,\n\nwe are not a globally interconnected communication network\n\nhas to touch as many people as possible,\n\nso you can make that call from like Bangkok\n\nto Kingston, Jamaica,\n\nand then make it from Kingston to London\n\nand then London to New York.\n\nSo, you know, we don't have any plans to move.\n\nWe are focused on markets around the globe\n\nand we are of course aware of the way that,\n\nyou know, geopolitical volatility\n\ninforms our ability to function in one or another market.\n\nWe've been fighting things like the online safety bill,\n\nNow Act in the UK, which threatened to,\n\nand still sort of threatens, but much more in the distance\n\nto mandate back doors in end-to-end encrypted communication,\n\nyou know, a disastrous cybersecurity vulnerability\n\nthat would ultimately undermine Signal anywhere it's used\n\nirrespective of jurisdiction.\n\nWe're fighting Chat Controls,\n\nwhich is the European version of that law.\n\nIt's sort of like this, it's this zombie that honestly,\n\nyou know, since 1976 when Diffie and Hellman\n\ntried to publish their paper\n\nintroducing public-key cryptography\n\nand the US government freaked out\n\nand tried to suppress publication of that paper\n\nhas been this sort of, you know,\n\never present specter behind the idea\n\nthat there could be private communication networks\n\nor other privacy preserving technology\n\nthat would protect interpersonal communications\n\nand activities,\n\nnot simply government or corporate activities.\n\nAnd this is a tension that threads\n\nthrough the crypto wars in the nineties\n\nwith the specter of evil\n\nthat encryption is said to be protecting,\n\nchanging over time, you know, it's terrorists,\n\nit's people who harm children, it's what have you.\n\nBut with the goal remaining steadfastly focused\n\nultimately on destroying the only technology we have\n\nto preserve the human right of privacy\n\nin an age of unprecedented mass surveillance.\n\nSo we fight that wherever it emerges.\n\nWith the time we have left,\n\nI want to talk a little bit about the future for Signal\n\non a product level,\n\nwhich it sort of feels less grand than,\n\nyou know, global fights against [indistinct],\n\nbut is fundamentally what it is, it is Signal itself.\n\nWhat I wanna ask is, as you grow out features you have,\n\nit feels more complicated\n\nbecause you have to build them out in a secure way\n\nwhereas your competitors do not,\n\nso it's more expensive, more timely,\n\nharder to keep parity in certain ways.\n\nWhat do you see as future, as Signal's future as a product?\n\nWhat's next on the roadmap?\n\nWhat do you care about, parity about?\n\nWhat do you not care about?\n\nWhich is really a way to ask about AI,\n\n'cause no one has yet, I get to be the first person today.\n\nEveryone's gonna do it, so I just, I get to do it here.\n\nWhat does Signal need to do to keep up with and expand\n\nand get to a billion users that it's not doing right now?\n\nWell, we have to provide a product\n\nthat when anyone picks it up, looks and feels normal,\n\nthat works, that when you wanna send\n\na cat dancing on a birthday cake to your auntie thread,\n\nyou can go to gift search\n\nand type in cat birthday cake dance\n\nand the right little thing will pop up\n\nand you send it to your aunties, right?\n\nIt has to do that.\n\nThat is fundamental,\n\nas fundamental as ensuring that our crypto systems\n\nare robust and not susceptible to attack.\n\nBecause again, if your friends don't use Signal,\n\nit doesn't matter how ideologically committed\n\nto privacy you are, you don't use Signal either,\n\nunless you know, I don't know,\n\nyou open it to send note to self,\n\nbut note to self is a great feature by the way.\n\nSo, you know, what we are aiming for\n\nis a product that just works,\n\n'cause no one picks up their phone to use Signal.\n\nThey pick up their phone to talk to their partner\n\nor talk to their dad or, you know,\n\nthe actual imperative of messaging\n\nis human relationships and connection,\n\nand so honoring those as a first order\n\nis what Signal has to do\n\non the same level as ensuring privacy preservation.\n\nAnd this is where I think,\n\nyou know, the early Signal team, Moxie, Tyler,\n\nsome of the people who are really at the founding\n\nof this product got it right where very few people did.\n\n'Cause there was a whole crop of sort of privacy preserving,\n\ncommand line looking, PGP looking, you know,\n\ntechnology that no one used.\n\nI was a person trying as hard as I could\n\nto get anyone I know\n\nto like email me back with PGP and crickets, right?\n\nNot because people didn't care,\n\nbut because ultimately when they wanted to talk to me,\n\nthey didn't wanna do that.\n\nAnd so from its inception,\n\nSignal has really focused on usability, on design,\n\nand on being extremely stringent about making an app\n\nthat looked and felt normative.\n\nAnd so we will continue doing that and I think,\n\nyou know, that means that we're doing something, you know,\n\nyou should see in the next months or so, encrypted backups,\n\nwhich is a, you know, that's a gap, you know,\n\nso you can back things up\n\nand if your phone falls in a river,\n\neverything isn't on device and lost, right,\n\nwhich is a, you know, a thing that we wanna do.\n\nIt's obviously much harder to do in a privacy preserving way\n\nwhere we have full deniability around,\n\nyou know, our ability to, you know, see people's data,\n\nbackups are tricky there.\n\nso we're looking at improving some of those gaps.\n\nI don't, you know, AI,\n\nwhat I see across a lot of these apps right now is a,\n\nI would say almost a glassy-eyed company imperative\n\nthat is coming down from the top\n\nto integrate AI into everything.\n\nAnd I can imagine how the OKRs get written,\n\nyou know, it's the year of AI and then your little VP,\n\nright, is like, Okay guys, it's the year of AI.\n\nIntegrate this into your group level or your product level.\n\nOkay, well then there's somebody here who has to take on,\n\nyou know, integrating an AI feature into this,\n\nbut like, that's not how good innovation happens, right?\n\nAnd that's why we have these little prompters,\n\nthese little like, Hey, let me write your mom for you.\n\nAnd I'm like, You don't need to write my mom.\n\nLike stop it, right?\n\nAnd so I think what we're seeing is like this,\n\nlike it's annoying at this point.\n\nIt is cluttered, it is swirly and swoopy and unclear\n\nand it doesn't actually solve a problem for me.\n\nThe problem it solves is AI takes vast amounts of capital\n\nin the bigger is better form we have,\n\nand there is a need for a consumer market fit, right?\n\nAnd they're trying, right?\n\nThey have people who are like,\n\nwell, they said, it's the year of AI.\n\nLet's try to shoehorn this into an interface\n\nthat ultimately would serve us better if it were cleaner,\n\nwould serve us better\n\nif it weren't cluttering up with suggestions\n\nand like little prompts, right?\n\nAnd so that's the thing Signal's not gonna do.\n\nAnd Signal doesn't have to, again, 'cause we, you know,\n\nwe didn't go out and invest a trillion dollars\n\nin data centers on a bet that this stuff was gonna,\n\nyou know, return as a good product feature,\n\nwhich is another benefit of kind of our model.\n\nSo we're laser focused on doing one thing\n\nand doing it very, very, very, very, very well,\n\nand when you know, something comes along\n\nthat doesn't serve that we don't have to pick up that mantle\n\nbecause we're not chasing quarterly returns.\n\nWe're not chasing sort of investor approval,\n\nyou know, to make sure that we continue with the valuation\n\nthat we'll, you know, keep our C-suite employed, right?\n\nAnd so, you know, we do use a little bit of AI\n\nand it's an on-device face detection model.\n\nIf you go to Face Blur feature,\n\nit works kind of half the time, it's fine,\n\nbut you know, again, when we talk about AI right now,\n\nwe're talking about these bigger is better\n\nsort of transformer models, everything is generative,\n\nand ultimately I think a lot of that is gonna fade away\n\nbecause it's not proving useful in a consumer context.\n\nMeredith, thank you so much.\n\nThat's all we have time for.\n\nI really enjoyed talking with you.\n\nI really appreciate it.\n\nThank you. [audience applauds]",
  "authors": [
    "Condé Nast"
  ],
  "url": "https://www.wired.com/video/watch/the-fight-against-surveillance-capitalism-a-conversation-with-meredith-whittaker"
}