{
  "title": "Blue Origin scrubs second New Glenn launch",
  "text": "Posts from this author will be added to your daily email digest and your homepage feed.\n\nThe second launch of Blue Origin’s partially reusable New Glenn rocket was scrubbed on Sunday due to adverse weather conditions, delaying NASA’s latest Mars mission. The Jeff Bezos-owned commercial space company announced that its next launch window from Cape Canaveral Space Force Station in Florida will be attempted “no earlier” than Wednesday, November 12th, between 2:50PM and 4:17PM ET.\n\nThis is a significant launch for the 320-foot-tall megarocket, which is tasked with sending NASA’s twin ESCAPADE (Escape and Plasma Acceleration and Dynamics Explorers) probes into space — the first Mars-bound mission since NASA launched its Perseverance and Ingenuity vehicles in 2020 to explore the red planet’s surface. The ESCAPADE satellites are projected to reach Mars orbit in 2027, where they will measure the planet’s magnetic field and atmosphere.\n\nThis will also be Blue Origin’s latest attempt to land New Glenn’s reusable first-stage booster, which, much like SpaceX’s Falcon rocket boosters, is designed to vertically touch down on a sea-based platform following launch. While Blue Origin successfully launched New Glenn for the first time in January after several delays, the booster was lost during its landing descent. A successful launch and landing would help Blue Origin to prove itself as a deep-space launch provider that’s capable of competing with established rivals like SpaceX and United Launch Alliance.\n\nBlue Origin says it worked with the Federal Aviation Administration to select its latest launch window, having seemingly been given an exemption to new FAA rules that prohibit commercial rockets from being launched between 6AM and 10PM. This emergency order came into effect on November 10th to alleviate air traffic congestion during the ongoing government shutdown. If all goes to plan, the live webcast for New Glenn’s second flight will start 20 minutes prior to launch on Wednesday.",
  "authors": [
    "Jess Weatherbed"
  ],
  "url": "https://www.theverge.com/news/817466/blue-origin-new-glenn-second-launch-scrubbed"
}