{
  "title": "Leak: Valve is making a Steam Controller 2 and a ‘Roy’ for its Deckard",
  "text": "is a senior editor and founding member of The Verge who covers gadgets, games, and toys. He spent 15 years editing the likes of CNET, Gizmodo, and Engadget.\n\nPosts from this author will be added to your daily email digest and your homepage feed.\n\nTwo years ago, Valve told The Verge it wanted a successor to its cult classic Steam Controller, whose incredibly customizable buttons and touchpads paved the way for the Steam Deck handheld PC. Now, Valve watcher Brad Lynch claims a Steam Controller 2 — codename “Ibex” — is actually getting made.\n\nHis sources tell him the Steam Controller 2 is currently being tooled for mass production, and it’s apparently not the only new Valve gamepad on the way!\n\nRemember the long-swirling rumors about Valve’s standalone “Deckard” VR headset, the one that could be an inexpensive Meta Quest-like wireless alternative to the aging Valve Index? Lynch has discovered references to a new wand-like “Roy” controller in Valve’s SteamVR code, and his sources say that Roy is now aimed at mass production as well.\n\nWhat’s more, “Roy” may have enough buttons to double as a Steam Controller gamepad when it’s not acting as your hands in VR. Unlike the Index wands, they’ll apparently have a D-pad, bumpers (aka shoulder buttons), and a full set of ABXY buttons for traditional gaming as well.\n\nPresumably, Valve would ship the unannounced Deckard headset at the same time as its “Roy” wands. I’m curious how it’s evolved since the patent drawings. Might it have an Arm chip inside, as was also rumored?\n\nValve hasn’t confirmed any of this, of course — these days, it tends to wait until it’s ready to show a near-complete product before surprise-announcing everything at once. It did also partner with Hori on an officially licensed Steam gamepad that’s coming to the US, but is not really a proper successor.\n\nOh, and just in case you’re wondering why “Roy,” please familiarize yourself with tears in rain.",
  "authors": [
    "Sean Hollister"
  ],
  "url": "https://www.theverge.com/games/2024/11/19/24300757/valve-steam-controller-2-roy-deckard-leak"
}