{
  "title": "Their children depend on CBD to treat epilepsy. The government funding bill will cut off their therapy, advocates say",
  "text": "Lisa Smith’s 14-year-old daughter, Haley, had run out of options. She was having roughly two dozen seizures a day and had tried “17 or 18” different pharmaceutical regimens, different diets, and an implanted nerve simulator.\n\nThat was when Smith, in 2014, turned to the nascent but quick-growing world of cannabidiol, or CBD, a non-psychoactive component of cannabis plants increasingly used to treat epilepsy.\n\n“She just basically existed. She didn’t really live. And after our first dose of CBD, she was able to stay awake. She started to learn,” Smith told CNN. Nearly 10 years later, Haley has about two to four seizures a month. “But prior to that, there was just no hope for us.”\n\nNow, Smith and other parents of children who use CBD say they are losing hope again.\n\nA last-minute addition slipped into the sweeping legislation that reopened the federal government last week to end the longest shutdown in US history has thrown the multibillion-dollar CBD market into disarray.\n\nThe amendment bans selling products with more than a minuscule 0.4 milligrams per container of tetrahydrocannabinol, or THC, a psychoactive chemical that can be derived from cannabis and hemp, in the next year. Though it varies, many epilepsy patients take an oral dose of one milliliter of CBD up to twice a day; trace amounts of THC, are typically in those products.\n\nLisa Smith’s 14-year-old daughter Haley has used CBD to treat epilepsy. Lisa Smith\n\nThe provision was intended to crack down on the proliferation of unregulated gas station gummies, vapes and sodas containing a form of the compound. But the law will also revoke the legal status of hemp-derived CBD products.\n\nThis means the roughly 45 million Americans who are said to rely on these as an alternative treatment for certain forms of pain, depression, post-traumatic stress disorder and epilepsy that have not been successfully managed with pharmaceuticals are bracing to lose their access to CBD therapies they have used for years.\n\n“You can’t just pull a seizure treatment from a kid,” said Paige Figi, a Colorado mother whose daughter, Charlotte, used CBD to treat her epilepsy for 14 years.\n\nThe federal shift on hemp comes as at least two dozen states and the District of Columbia have made CBD fully legal, while more than a dozen others established, or are working to establish, their own regulations on medicinal use of CBD.\n\nColorado was one of the first states to set out regulations that cleared the way for legal use of hemp-derived CBD, under its cannabis legalization. Other states including Virginia, where Smith lives, have followed suit. But the federal law preempts those state policies, rendering more nuanced approaches to CBD and THC products moot.\n\nThe eleventh-hour hemp provision\n\nTucked into the 161-page government funding bill, between sections on rural housing loans and regulatory requirements for milk and coffee, the looming ban essentially narrows an earlier law that legalized hemp and cleared a path for the CBD market.\n\nIt was proposed and pushed through by Republican Kentucky Sen. Mitch McConnell, who had championed the earlier law, passed as part of the 2018 Farm Bill.\n\nBut since that bill’s passage, McConnell has expressed concerns about the rise of synthetic cannabis products, often sold in gas stations and convenience stores for recreational use.\n\nThe ban language appeared in the Senate funding bill late on Sunday night, November 9, before the chamber passed it that Monday.\n\nFew GOP members dissented, but Republican Rand Paul, Kentucky’s other senator and a longtime supporter of liberalizing cannabis access, called the move “the most thoughtless, ignorant proposal to an industry that I’ve seen in a long, long time.”\n\nSen. Rand Paul speaks to reporters on the Senate Subway platform on Capitol Hill, on November 10, 2025. Tom Brenner/Getty Images\n\nDemocrats who joined him have said the amendment would devastate the hemp industry and handicap the beneficial uses of CBD – and advocates were seething about the hasty addition, with no public input.\n\n“Congress, out of nowhere, without debate, without conference, without public input, just banned something,” said Figi, who runs the Coalition for Access Now, which advocates for CBD access. A popular CBD manufacturer, Colorado-based Charlotte’s Web, was named for her daughter, who died from Covid-19 in 2020.\n\nStudies suggest that there are therapeutic benefits of CBD for pain, anxiety, PTSD and epilepsy. The US Food and Drug Administration in June 2018 approved its first CBD-based drug, Epidiolex, to treat severe epilepsy, and biopharmaceutical companies are studying its potential in curbing opioid use disorder and Huntington’s disease. But research and the pharmaceutical pipeline have not kept pace with consumer need, so therapeutics that are being used are largely unregulated CBD products.\n\nFederal health agencies and epilepsy advocacy groups are cautiously optimistic about CBD’s use. The Epilepsy Foundation says that it supports “safe, legal access” as long as the benefits outweigh the risks, and that more research is needed. The US Centers for Disease Control and Prevention also calls for more research and notes potential side effects, including liver damage, drowsiness, loss of appetite and mood swings.\n\nFigi said she had lobbied Congress and the FDA in the years since the 2018 Farm Bill to regulate the industry so “Franken-hemp” — candies, beverages and vapes that contain THC— would not hit the market.\n\nBut federal policies around CBD remain hazy. The FDA still does not consider it a dietary supplement, a classification that would require labeling and certain manufacturing guidelines. Without any formal classification, untested CBD and THC products can be sold without all their ingredients disclosed.\n\nParents and patients, scrambling for solutions\n\nFigi became an early advocate for medical CBD after it stabilized her daughter’s Dravet syndrome, a rare form of epilepsy that caused Charlotte to have up to 50 seizures a day. The family had exhausted their pharmaceutical options when Figi’s husband saw a video online showing a California boy with Dravet responding to a low-THC cannabis treatment.\n\nFigi eventually met with a group of cannabis growers and dispensers, the Stanley brothers, to develop a low-THC strain of the plant. After her first dose of an orally administered CBD oil in 2011, Charlotte did not have seizures for seven days, Figi said.\n\nThe CBD oil named for Charlotte is now one of the best-known products used among epilepsy patients for whom other treatments have not worked.\n\nTracy Berg, a mother in Florida, came across Figi in 2013 when she was featured in a “Dateline” episode about CBD.\n\nBerg’s daughter, Riley, was diagnosed with autism as a toddler but, terrifyingly, began experiencing atonic or drop seizures when she was 8-years-old.\n\nRiley would freeze and drop to the ground, sometimes injuring herself. “There would be no warning. It was like somebody would hit a light switch, and she would hit the floor,” Berg recalled.\n\nDoctors recommended a range of epilepsy medications, but they came with concerning potential side effects — aggression, suicidal ideation — particularly for a child with severe autism who is nonverbal, says Berg, so she turned to CBD. Riley has been seizure-free in the nine years since they began using it, her mother said.\n\nRiley Berg Tracy Berg\n\nState battlelines\n\nState regulations always loomed over CBD access for the Bergs and others, though.\n\nWhen Riley began using it in late 2014, the Bergs were living in Texas. Soon afterward the following year, the state made hemp oil legal for use for people diagnosed with epilepsy.\n\nBut after the family moved back to their home state of Florida in 2022, they witnessed a state-level push to ban hemp-derived THC products – somewhat of a precursor to the federal ban now signed into law. The Florida ban was eventually vetoed by Republican Gov. Ron DeSantis last year, after he said it would hurt small businesses (and whose office Berg said she “bombarded” with calls).\n\nA nearly parallel fight happened in Virginia in 2023, when the Republican-led legislature sought to put a cap of 2 milligrams of THC per container of hemp product. Smith pressed state legislators and Republican Gov. Glenn Youngkin to abandon the plan, warning that it would bar her daughter Haley from receiving her CBD tinctures with trace amounts of THC.\n\nUltimately, Virginia passed a law that regulated the ratio of CBD to THC in hemp products, rather than placing a hard cap on THC content, which allows families like the Smiths to still have access to the therapeutic products they need.\n\n“I thought, ‘OK, now we can go on. Nothing to worry about,’” said Smith.\n\nBut the federal appropriations bill passed this month overrides states’ laws and efforts to clear pathways for legal hemp farming and CBD use.\n\nTexas Gov. Greg Abbott speaks during a bill signing, in Austin, Texas, on June 4, 2025. Sara Diggins/Austin American-Statesman/Hearst Newspapers/Getty Images/File\n\nIn Texas, a battle over hemp’s legal status played out just this year, with Republican Gov. Greg Abbott vetoing a broad ban in June. Abbott called the bill “well-intentioned” but nodded to farmer and patient concerns.\n\nVeterans who use CBD for PTSD, chronic pain and mental health stood alongside epilepsy patients in that fight.\n\n“The governor, he listened to us. He listened to the veteran community,” said Mitch Fuller, head of legislative affairs for the Veterans of Foreign Wars, or VFW, of Texas, who uses CBD to treat PTSD.\n\nTexas is moving forward with its efforts to regulate THC and hemp products with exceptions for CBD, despite the looming federal law. That is what advocates have wanted all along, says Fuller. “Don’t go (at) this with a chainsaw. Address us with a scalpel, and regulate it.”\n\nThe national VFW warned Congress last week that the latest hemp provision could “slam that door shut” on a promising alternative to sedatives, opioids and other pharmaceuticals prescribed to veterans.\n\n“We are kind of an example for the country on the success in beating back a ban,” Fuller said of Texas. But matching states’ successes on the federal level is a daunting task. Advocates have one year, and as Fuller and others pointed out, it will be a midterm election, with many representatives and senators hitting the campaign trail, meaning fewer days in Washington to legislate.\n\nIt’s left parents like Smith and Berg mulling what to do next. Smith wondered whether people would be forced to buy dozens of tiny bottles of CBD oils to evade the milligram cap.\n\nBerg half joked about her other options.\n\n“I’m not going to jeopardize her health and put her back into a situation where she’ll start having seizures again,” she said of her daughter. “So I’ll either become a criminal, or we’ll have to leave the country.”",
  "authors": [
    "Sarah Owermohle"
  ],
  "url": "https://www.cnn.com/2025/11/20/politics/hemp-cbd-government-funding-bill-ban"
}