{
  "title": "Adobe to buy Semrush for $1.9 billion",
  "text": "In Brief\n\nAdobe said on Wednesday that it has agreed to acquire search engine optimization company Semrush for about $1.9 billion in cash, as the Photoshop maker seeks to augment its suite of marketing offerings.\n\nIn a statement, Adobe said it would offer $12 per share for Semrush, almost double the latter’s closing price of $6.89 on Tuesday, before news of the deal. Semrush had a market capitalization of about $1 billion as of Tuesday’s close.\n\nBy acquiring Semrush, Adobe is betting that companies will choose to invest in optimizing their content and web pages to be more visible to AI tools, as people increasingly use AI chatbots, agents, and AI browsers to do everything from getting the news and finding recipes to shopping and booking their travel. This is a fresh, big market for existing search engine optimization players like Semrush, particularly as this change in consumer behavior drives increasing traffic to websites from generative AI tools.\n\nIndeed, as of October, traffic to retail websites from generative AI chatbots increased 1,200% compared to a year earlier, per Adobe Analytics data.\n\nSemrush has been investing in what it calls “generative engine optimization,” and recently launched a tool for tracking and improving website performance using both traditional SEO techniques and optimization for AI engines, like ChatGPT, Claude, Copilot, Grok, and Perplexity.\n\n“Brand visibility is being reshaped by generative AI, and brands that don’t embrace this new opportunity risk losing relevance and revenue,” said Anil Chakravarthy, president of Adobe’s Digital Experience Business. “With Semrush, we’re unlocking GEO for marketers as a new growth channel alongside their SEO, driving more visibility, customer engagement and conversions across the ecosystem.”",
  "authors": [
    "Ram Iyer",
    "Sarah Perez",
    "Ivan Mehta",
    "Marina Temkin",
    "Rebecca Bellan",
    ".Post-Authors-List__Authors --Font-Size Var",
    "Align-Items Center Display Flex Gap Var",
    ".Post-Authors-List__Authors .Post-Authors-List__Author-Thumbs Display Flex Flex-Shrink Margin Padding .Post-Authors-List__Authors .Post-Authors-List__Author-Thumbs Li List-Style None Margin-Left Margin-Top Important .Post-Authors-List__Authors .Post-Authors-List__Author-Thumbs Li First-Child Margin-Left .Post-Authors-List__Authors .Post-Authors-List__Author-Thumbs .Post-Authors-List__Author-Thumb Background-Color Var",
    "Border Solid Var --Wp--Custom--Color--White",
    "Border-Radius"
  ],
  "url": "https://techcrunch.com/2025/11/19/adobe-to-buy-semrush-for-1-9-billion/"
}