{
  "title": "Why Conspiracy Theories Took Hold When Charlie Kirk Died",
  "text": "Transcript\n\nConspiracy theories about the assassination\n\nof Charlie Kirk exploded online\n\nin the hours and days after his death.\n\nA month later, they still persist.\n\nIn this video, we'll unpack why they are so potent,\n\nuncover what they have in common\n\nwith past assassination conspiracies,\n\nand expose the mechanics of how they go viral.\n\nI'm David Gilbert.\n\nI write about online extremism\n\nand the crisis of truth for WIRED.\n\nWelcome to Disinfonation:\n\nThe Charlie Kirk Assassination Conspiracies.\n\nToday I'm speaking with two experts\n\non the spread of false narratives.\n\nBoth are authors and researchers.\n\nJoan, Nina, thank you for joining us today.\n\nTo get us started, can I just ask,\n\nover the last couple of weeks,\n\nwhat has been the most out-there conspiracy\n\nthat you have seen around the Charlie Kirk assassination?\n\nOne of the ones that I've seen\n\nthat I think is kind of interesting\n\nand actually coming more from the left\n\nis that Charlie Kirk and his family are a psyop,\n\nthat they aren't actually a real family\n\nand that they may be involved with the Freemasons as well.\n\nYeah, the one that I was really intrigued by\n\nhad to do with that he wasn't even there.\n\nHe was being projected as a hologram,\n\nand if he had been there,\n\nhe may have ended up being trapdoored\n\nthrough some kind of underground tunnel.\n\nI was actually at a conspiracy conference in Ireland\n\nin real life a couple of weeks ago.\n\nThey had a tarot reader from Canada there,\n\nand she did a tarot reading,\n\nand the first question she was asked\n\nby someone in the audience from Ireland was,\n\nWas Charlie Kirk really dead?\n\nAnd so she went and pulled her cards\n\nand it turns out that he's not dead\n\nand that in fact wasn't Charlie Kirk\n\nin the university being shot but someone else.\n\nI think conspiracies are often trying to give a balm\n\nto people during confusing events.\n\nThey're a way for people to make sense of what's going on\n\nand so it makes sense that folks would turn to tarot\n\nor turn to elaborate holograms\n\nto try to process what was going on.\n\nYeah, and I think we've seen this before.\n\nTupac, Biggie, Elvis, Charlie Kirk,\n\nthis idea that the people haven't really died.\n\nYou can't believe your eyes, in this case,\n\nbut also that you can't believe government.\n\nYou can't believe anything that you see or read,\n\nwhich is where you start to see the repetitive types\n\nof conspiracy theories come in.\n\nNot just Freemasons, which is a well-known trope,\n\nbut also that Israel had something to do with it\n\nor this was a military psyop from inside the government\n\nin some way to try to produce a martyr.\n\n[David] And we've literally seen President Trump\n\nand others calling Charlie Kirk a martyr.\n\nHe's a martyr now for American freedom.\n\nSo are there examples, do you think, from the past\n\nwhere we can see clearly that conspiracies from decades,\n\ncenturies ago can also be applied to what's happening today?\n\nSo, famously with the JFK assassination,\n\nthere was always this claim of a second shooter\n\nor the shot itself was something\n\nthat never could have been made.\n\nAnd immediately after Kirk's assassination, you saw people\n\nsneaking back onto the campus of this university\n\nlate at night and filming the area and trying to,\n\nthemselves, see if they could see if that shot could be made\n\nfrom the top of the building to where Kirk was sitting.\n\nAnd so this notion of the impossible shot\n\nor the magic bullet is a tale\n\nthat we've been through before.\n\n[David] That's an interesting point.\n\nAnd with JFK, there was the controversial theory\n\nthat a second shot came from the grassy knoll.\n\nAnd similarly, videos now claim that Charlie Kirk\n\nwould have been shot from a nearby window or balcony.\n\nThis would 100% line up with the actual shot\n\nfrom the backside of Charlie.\n\n[David] Which is totally improbable.\n\nAnd of course, Tyler Robinson and Lee Harvey Oswald\n\nhave both labeled as patsies or scapegoats.\n\nWell, even when we talk about Charlie Kirk's assassination\n\nfor potentially being a hologram, right,\n\nthat's just a version of a false flag conspiracy theory,\n\nwhich we've seen with many different assassination attempts\n\nfrom JFK to even the assassination attempt\n\nagainst President Trump during the 2024 election.\n\nWe had prominent voices on the left\n\nsuggesting that this might be a false flag\n\nto bolster his election chances.\n\nThere's a lot of claims that perhaps the deep state\n\nor others within the actual MAGA sphere\n\nhad used Charlie Kirk as a sacrifice\n\nand that it was to kick off this idea\n\nthat Antifa and the radical left\n\nare the real perpetrators of mass violence.\n\nAnd we've seen similar things like this happen in the past,\n\nparticularly when Lincoln was assassinated\n\nby John Wilkes Booth.\n\nThere was a lapse of security that allowed that to happen.\n\nThere was also claims that Booth had actually escaped\n\nand that the person that was caught was actually a cadet\n\nthat looked like Booth and he was quickly executed.\n\n[David] Right, and one popular conspiracy theory\n\nat the time accused elements\n\nwithin Lincoln's own government,\n\nspecifically the Radical Republicans like Edwin Stanton\n\nof somehow aiding Booth\n\nto remove a conciliatory Lincoln in order\n\nto impose harsher reconstruction punishments on the South.\n\nThat, to me, feels like a 19th-century version\n\nof a deep state conspiracy.\n\nThere's also, of course, conspiracies around the end\n\nof the Romanov Dynasty in Russia.\n\nPeople still believe today that Princess Anastasia\n\ngot out somehow, and there have been investigations\n\ninto different people who claim they're Anastasia\n\nand their ears and their DNA.\n\nOn the Freemasons, there's a huge community online\n\nthat is now claiming that Erika Kirk is secretly a Freemason\n\nand she didn't give birth to her children\n\nbecause there have never been any pictures of her pregnant\n\nor she doesn't show her children's faces.\n\nWell, as somebody who's received online harassment,\n\nI can understand why she doesn't show her children's faces.\n\nWhat Nina's saying is very true.\n\nOne actual disinformation story that circulated very quickly\n\nafter Kirk's murder was that his wife and children\n\nwere there and they weren't, so this story that is-\n\nI actually fell for that one.\n\nYeah, this story that that his daughter\n\nwas running towards him really tugs on the heartstrings.\n\nHard to believe someone would make up that kind of detail.\n\nLet's talk about X a little bit\n\n'cause that's where a lot of these conspiracies begin.\n\nI was looking back to September 10th when this happened,\n\nand I was trying to find when these conspiracies started,\n\nand I found a post, I think less than an hour\n\nafter Kirk had been officially declared dead\n\nblaming Israel for his death.\n\nAnd it didn't get much engagement.\n\nThat loads of these posts were posted,\n\nbut not much engagement,\n\nbut in hours, though, they began to go viral.\n\nCan I ask you, how does something like that go viral?\n\nHow does it get to the point or break containment from X\n\nto the point where the Israeli prime minister\n\nhas to post a video online denying\n\nthat Israel had anything to do with the shooting?\n\nHow does that happen?\n\nSo in this case, with pushing this conspiracy theory\n\nthat Israel was involved, you had a specific actor\n\nlike Candace Owens who was close to Charlie Kirk.\n\nIt's someone that is familiar\n\nto the Turning Point USA crowd,\n\nsomeone that is, quote unquote,\n\ntrusted within those circles.\n\nAnd she really came out in full force\n\nto make these associations.\n\nThe very day before Charlie Kirk died,\n\nhe expressed that he thought he was going to be killed.\n\nWhat she's been able to establish\n\nhas been very controversial, but at the same time,\n\nshe's starting to prove it out\n\nthat there was this fissure with Charlie Kirk\n\nand Israeli donors where she had received a text message,\n\nand a lot of people denied the existence\n\nof these text messages until she published them.\n\nShe claims to have more.\n\nBut when you think about the actors behind this,\n\nis that you need some kind of protagonist\n\nto get the ball rolling.\n\nAnd then it moves from X over to YouTube\n\nwhere she's primarily doing her nightly show.\n\nThen it's over on her Instagram and then it's back to X,\n\nand then people start discussing her content\n\nand then people share her content.\n\nAnd then algorithmically,\n\nyou start to see it slowly get tied together\n\nso that when you look up Charlie Kirk,\n\nyou end up with what's popular at the time,\n\nwhich is Candace Owens's explanation\n\nfor who else might have been involved.\n\nThey said that there's probably somebody else involved.\n\nThat sounds about right.\n\nSo one of the things that comes out\n\nwith these Candace Owens tweets\n\nabout Charlie Kirk's texts to her\n\nis these kind of underlying anti-Semitic tropes\n\nthat Jewish people run politics,\n\nthat they have a lot of money.\n\nAnd even Kirk himself says that,\n\nJewish donors play into all the stereotypes.\n\nSo she's releasing these things selectively,\n\nand I think it's important to note\n\nthat she is profiting from this.\n\nIt is driving up ad revenue.\n\nAnd the more salacious stuff that she shares,\n\nif she keeps the drip, drip, drip\n\nof these text messages going,\n\nI mean, frankly, she's profiting from her friend's death.\n\nI'm going to throw it to some sponsors.\n\n[Nina] And the platforms are profiting as well.\n\nRight now, you can get 20% off your first order.\n\nOne of the things that people jumped on\n\nin the wake of his death\n\nwere these kind of oddities, as people put them.\n\nFor example, George Zinn, the 71-year-old man\n\nwho was first arrested 'cause he told people\n\nthat he was the shooter.\n\nIt turns out he wasn't. He had nothing to do with it.\n\nPeople have focused on the text messages\n\nthat were in the affidavit that the police produced\n\nthat just don't look natural.\n\nThe text messages between the suspected shooter\n\nand his partner, they just don't read as natural.\n\nThere was a man who looked as if he was giving hand signals\n\nbeing pretty close to Charlie Kirk.\n\nIs that a key component to conspiracy theories generally,\n\nthat there is a nugget of truth in there\n\nthat something did happen that is real,\n\nbut people just take it in completely the wrong direction?\n\nThat's actually not only a nugget of conspiracy theories.\n\nThat's a nugget of the best\n\nand most successful disinformation.\n\nIt's not stuff that's just made up whole cloth.\n\nIt is things that happen in real life,\n\noften fueled by real people's authentic grievances\n\nthat are then taken out of context, amplified,\n\nor weaponized in some way.\n\nOne of the things that these conspiracy theories thrive on\n\nis this drive to rationalize things that are random.\n\nSo you show this little clip\n\nof someone doing something like this\n\nand you say, Oh, this is instantly some kind of signal.\n\nAnd maybe it is.\n\nMaybe it's the all-clear signal because you are a bodyguard\n\nand you're communicating to another bodyguard.\n\nI think one of the really interesting ones\n\nthat happened in the 30 seconds after the shot rang out\n\nis that someone jumped up and grabbed the camera\n\nfrom behind Kirk and pulled that down.\n\nAnd I think it was obviously to try to stop the live stream\n\nand to make sure that if there was like, God forbid,\n\nsome kind of coordinated terror attack, you don't want them\n\nto be able to be watching what's happening on the ground\n\nwhile maybe they're laying in wait somewhere else on campus\n\nto shoot at students or whatnot.\n\nSo there was this moment where anything anybody was doing\n\nwas interpreted as somehow trying to collude or hide.\n\nBut this notion of just asking questions,\n\nthere's some recent psychology research\n\nthat it does create a truth bias for people.\n\nSo if you see the same questions being asked\n\nacross different platforms and by different people,\n\nyou start to believe, Well, maybe this is true\n\nbecause everybody's asking these questions.\n\n[David] Right, and Joe Rogan in particular is a master\n\nof this rhetorical strategy of just asking questions.\n\nHere he is on his podcast,\n\nwhich reaches a huge mainstream audience.\n\nYou're telling me that this kid\n\nwho's not military trained,\n\nthis guy, first of all, how did he get to the roof?\n\nHow come nobody was looking?\n\nAnd so it's not just a rhetorical strategy\n\nto quote unquote just ask questions as part\n\nof being an online influencer and to drag the story out.\n\nBut also, it can be a way of slowly persuading people\n\nas to what you want them to conclude.\n\nSo because people no longer believe what they are hearing\n\nfrom mainstream media or even from law enforcement,\n\nat this point, because trust in these institutions\n\nhas created in recent years,\n\nthat does then leave the way open for other people\n\nto take advantage and to post videos showing things\n\nthat just didn't really happen.\n\nAbsolutely.\n\nWhen you raise the specter of just asking questions,\n\nWas this camera here?\n\nWas he wearing a blood pack?\n\nWas he wearing a bulletproof vest?\n\nYou're not only potentially driving clout\n\nand driving views on these platforms,\n\nbut many of these folks are monetizing their videos, right?\n\nSo if you raise these salacious allegations,\n\nyou know that it's playing\n\nright into the infrastructure of these algorithms\n\nwhich rewards those salacious allegations with more views,\n\nmore clicks, more engagement, and more ad revenue, frankly.\n\nSo there's an MIT study from 2018 that says,\n\nLies travel further and faster than the truth\n\non Twitter especially.\n\nPart of this is because it's so lucrative\n\nto have a scoop and to be first.\n\nAnd so we often see Photoshops, very weirdly cropped images.\n\nWe've seen quite a few different deep fakes\n\nof Charlie Kirk's voice, even from beyond the grave.\n\n[David] Right, an AI generated audio clip of Kirk\n\nwas played in various services, such as this one.\n\n[AI Charlie Kirk] Death is not the end. It's a promotion.\n\nDon't waste one second mourning me.\n\n[David] But going back to what you said, Nina,\n\nI've even seen a few altered images\n\nthat claim that Charlie Kirk was wearing a blood pack,\n\nwhich also seems to have an AI voiceover.\n\n[AI Voiceover] What's protruding out of Charlie's back?\n\n[David] But if you compare this image\n\nwith a real photo taken by a photographer\n\nat the same moment, you can clearly see\n\nthat this theory is false, but intentionally false.\n\nYou see these cheapfakes.\n\nPeople might augment the picture in such a way\n\nor stretch a frame so that it looks disproportionate.\n\nAnd knowing that things that are novel and outrageous\n\ntravel at breakneck speed due in part to the infrastructure\n\nof the algorithms rewarding that novelness,\n\nit's like we've built an entire algorithmic system\n\non many of these platforms around the idea\n\nthat whoever has the most bizarre and outrageous information\n\nare gonna be the ones that are circulated the most.\n\nAnd we know the most engaging content online\n\nis often the most enraging content.\n\nSo you have people searching for answers,\n\npeople who are shocked and scared and pissed off,\n\nand that is just the perfect fuel for conspiracy theories.\n\nWhen I saw the video, it was horrific\n\nand it really upset me, but there were dozens, hundreds,\n\nthousands of posts showing the video.\n\nTens of millions, hundreds of millions probably viewed it.\n\nIn fact, by the time Kirk was pronounced dead\n\ntwo hours later, the videos posted by people at the rally\n\nhad more than 11 million views.\n\nMy colleague at WIRED, Lauren Goode pointed out\n\nthat we are pretty much living\n\nin a post content moderation world.\n\nNina, thoughts?\n\nCertainly with the advent of the paid-for blue check on X\n\nwhere your content can be surfaced to more people\n\nand you can gain virality, gain amplification,\n\ngain credibility by posting the more inflammatory content\n\nthat does well on X, I think Musk has opened up\n\na new industry for folks to engage\n\nin harmful and violent rhetoric\n\nand in some cases even traffic in violent videos, right?\n\nThat's the moment that we're in.\n\nI think a really important point from the point of view\n\nof the shooter is that they waited\n\ntill the livestream was on, right?\n\nAnd this is a really important and salient point,\n\nwhich is that they wanted to spread the trauma.\n\nIt wasn't necessarily about just killing Kirk.\n\nIt was about doing it in front of an audience.\n\nIt was about doing it in a way\n\nthat would be mediated and distributed.\n\nOne thing that I think is important to dig deeper on\n\nis the way that these violent videos are often remixed\n\nor even people attempt to evade content moderation\n\nby flipping, inverting kind of the image,\n\nchanging a filter on it.\n\nAll of that generates what's called a different hash,\n\nso it makes it more difficult for the platforms\n\nto identify and remove these videos.\n\nAnd let's be clear, posting a video of a murder\n\nis not speech, right?\n\nThis goes against most of the platforms' terms of service.\n\nThat's an interesting point.\n\nThe platforms have stepped back in recent years.\n\nFor example, TikTok recently announced it will lay off\n\nhundreds of human content moderators\n\nin favor of increased AI-enabled content moderation.\n\nDoes that play an important role in the fact\n\nthat there is now zero friction, effectively, for anyone\n\nwho wants to spread not only those horrible videos\n\nthat you referenced, you know, but also any sort\n\nof disinformation that they may choose to post online?\n\nYeah, and I think it's important to put out there\n\nthat the same people whose job it would be\n\nto regulate these companies in this industry\n\nare the ones who are also benefiting\n\nfrom the spread of this disinformation.\n\nMusk and the platform executives know\n\nthis is how their platforms work, right?\n\nAnd with Elon Musk in particular,\n\nyou have something really peculiar going on\n\nwhere not only is this guy profiting from disinformation\n\nand from conspiracy theories,\n\nhe himself is adding fuel to the fire,\n\nand I think that's totally intentional.\n\nWe know that Elon wants X to be the place\n\nwhere news happens and news breaks,\n\nso if in the moments after the shooting he's able to say,\n\nWell, it was them.\n\nThe left did it, the violent left,\n\nthat really adds to people flocking to his platform,\n\nusing it, commenting there,\n\nand it adds to the usage metrics for them,\n\nwhich I think all of these platform executives have in mind.\n\nBut for Musk, it's particularly insidious,\n\ngiven his own usage of his platform\n\nand his recognition of how it works.\n\nSo on that point, we saw a lot of people questioning\n\nwhy the video of his actual death was posted online so much.\n\nWhat's the driving force? You've mentioned money.\n\nIs there other forces there to make people want\n\nto post about this so much that their first instinct is,\n\nI need to go on TikTok, or,\n\nI need to go on Instagram or X\n\nand give my opinion to the world?\n\nWell, even the nation's top law enforcement official\n\nfelt the need to post through it with Kash Patel.\n\nA lot of the commentary in the days after the assassination\n\nwhen they still hadn't found the shooter was,\n\nPerhaps we shouldn't have online influencers\n\nleading law enforcement.\n\nBut I really do think it's important to note\n\nwhat a cash cow this is\n\nfor so many conspiracy theorists online.\n\nThe idea that Charlie Kirk is a psyop.\n\nI found that through the Substack algorithm.\n\nThat was fed to me by somebody who claims\n\nthat they're just doing research.\n\nThis person has over 78,000 subscribers on Substack,\n\nand that's all monetized.\n\nAnd the more that they push this information out,\n\nthe more that they're driving subscriptions,\n\nthe more that they can continue to cash in\n\non these horrible events.\n\nI think also, you know, when we get down to it,\n\nimages like this, which are something\n\nthat gets massively distributed, you get called in as a user\n\nand as a witness into action.\n\nYou are now part of the manhunt.\n\nThis is what made QAnon so powerful.\n\nEvery day, you could be part of the analysis\n\nand you could be making videos like this and like,\n\ncircling this little wisp of whatever is going by here.\n\nBut what's important here is that you become a detective.\n\nI think one of the things that we really misunderstand\n\nabout the media ecosystem, especially around the right,\n\nis that if you are a right-winger,\n\none of the most important things you can do\n\nas a political participant in the world\n\nis share right-wing media contents.\n\nYou are not the audience. You are the distribution system.\n\nRight-wing media share\n\neach other's information and articles.\n\nYou would just never see The New York Times\n\nsharing The Washington Post.\n\nSo mainstream media has a different business model\n\nthan right-wing media where these kind\n\nof narratives tend to thrive.\n\nIs there specific phrases that are red flags\n\nthat people should be wary of and not look at that stuff\n\nand look maybe at more fact-checked stuff?\n\nFor me, when I hear words like\n\n100% incontrovertible proof, that's an immediate red flag.\n\nOne of the things that I think is important to recognize\n\nis that all of us are human.\n\nAll of us make mistakes.\n\nSo anybody who is claiming definitive knowledge\n\nin a breaking news situation is probably full of shit.\n\nUntil you see something corroborated on multiple sources\n\nfrom multiple people of different backgrounds\n\nand political viewpoints, I wouldn't trust it.\n\nWe have to be much more astute news consumers.\n\nI also am in favor of what I call,\n\nEveryone is a journal-ish.\n\nSo I think that most people\n\nthat use social media these days, they have to think,\n\nHow do I know if this is true\n\nand what are the stakes if I'm wrong?\n\nUnfortunately, that's all we've got time for today.\n\nJoan and Nina, thank you so much for your insights.\n\nConspiracy theories have been with us for decades,\n\nfrom Area 51 to the JFK assassination\n\nand even the Moon landing.\n\nBut the Charlie Kirk assassination has shown us\n\nthat conspiracy theories today are not only big business,\n\nthey are instant, supercharged by the algorithmic world\n\nthat we live in and given credence by some\n\nof the most powerful people in the world.\n\nSorting fact from fiction in breaking news situations\n\nis becoming increasingly difficult.\n\nAnd that's even before we have entered the era\n\nof the AI conspiracy theory.\n\nI'm David Gilbert. Thanks for watching.\n\n[lively electronic music]",
  "authors": [
    "Condé Nast"
  ],
  "url": "https://www.wired.com/video/watch/why-conspiracy-theories-took-hold-when-charlie-kirk-died"
}