{
  "title": "Marlon Wayans Answers The Web's Most Searched Questions",
  "text": "Transcript\n\nHey, what's up?\n\nThis is Marlon Wayans and I'm doing\n\nthe WIRED Autocomplete interview.\n\nLet's go.\n\n[upbeat music]\n\nI played Tiffany and Shawn played\n\nBrittany in White Chicks.\n\n[upbeat music]\n\nMarlon Wayans, how is Marlon Wayans still working?\n\n'Cause I self-employ myself, you assholes.\n\nOkay.\n\nHow is Marlon Wayans doing?\n\nAt this moment, I am really tired 'cause I didn't sleep\n\n'cause after hanging with those kids\n\non Kai Cenat Mafiathon the next day,\n\nand I had seven shots on that show.\n\nThe publicist only counted five, but they didn't know.\n\nI snuck two more in.\n\nThen the next day I worked all day\n\nand then I had Axl for the whole night\n\nand she wanted to party\n\nand break night like she was on Mafiathon.\n\nSo we did Daddy-Daughterthon\n\ntill two in the morning last night.\n\nSo love you and fuck you, Axl.\n\nBy the way, I have video of her\n\nlearning how to say fuck you.\n\nSo that's our new way of saying love you.\n\nFuck you, dad.\n\nMy baby.\n\nWhat is Marlon Wayans cigar brand?\n\nI'm glad you asked.\n\nMy cigar brand is called Liga Tridente.\n\nWe smoked them on Kai Cenat's show\n\nand they was like, Yo, am I supposed to take\n\nand cut this open and put weed in it?\n\nI was like, Hell no.\n\nYou don't do that to good cigars.\n\nCan Marlon Wayans play basketball?\n\nWhat do you consider playing basketball?\n\nCan I shoot the ball?\n\nSure.\n\nWill it go in?\n\nProbably not.\n\nCan I dribble the ball?\n\nWhich way?\n\nUp and down? Sure.\n\nFor how long?\n\nNot long.\n\nCan I go through my legs?\n\nMaybe once out of 10 tries.\n\nCan I go behind my back?\n\nBasically how much are you paying Marlon Wayans?\n\nIf you pay me enough, I could play.\n\nAnd if not, there's some stunt doubles out there\n\nthat look just like me that are damn good in basketball.\n\nCan Marlon Wayans sing?\n\nI wouldn't say I could sing.\n\nI could say I could hold a note,\n\nbut I'm a desperate performer so I love karaoke.\n\nSo that's my thing, karaoke.\n\nAnd I like to karaoke deep voice.\n\nYou give me somebody with a deep voice\n\nlike Teddy Pendergrass.\n\n♪ Turn out the lights and light a candle ♪\n\nSee what I'm saying?\n\n♪ I just wanna growl to you ♪\n\n♪ Mm, mm, mm, mm, mm ♪\n\nRick James.\n\n♪ Turned on my fire, baby ♪\n\n♪ And you show me what love can do ♪\n\n♪ Fire and desire, baby ♪\n\n♪ Feel it coming through ♪\n\n♪ And I thank you, baby ♪\n\nThat's a song that made Axl's mother fall in love with me.\n\nAnd actually that's the song\n\nthat she got herself impregnated by me too.\n\nSo how to make a bastard.\n\nRick James, whiskey, Fire and Desire equals Axl.\n\nWhat was Marlon Mayans' first movie?\n\nMy first real movie was playing the role\n\nof Seymour in Mo Money.\n\nAnd yes, that was my brother Damon's movie,\n\nbut he didn't give it to me.\n\nI actually went out and auditioned\n\nagainst everybody to go get that movie\n\nand I got it and my black ass left college to go do it\n\nbecause that was to me the perfect\n\nstarting vehicle for me at 19.\n\nWhat is Marlon Wayans' best movie?\n\nMy best movie would probably have to be, I'm gonna say two.\n\nMy best movie would probably be, actually three.\n\nI did too many movies, you asking me to choose.\n\nAll right, my best movie is definitely Him.\n\nWhite Chicks I thought was really great\n\nand that was just a really fun experience.\n\nRequiem for a Dream, great dramatic performances\n\nand a wonderful movie to be a part of.\n\nBut Him is actually the complete,\n\ncrazy, untethered, off-the-chain Marlon Wayans\n\nat his best in a wonderful movie\n\nthat's really high octane energy\n\nand you've never seen nothing like it.\n\nWhat is Marlon Wayans up to?\n\nWell, right now, jackass, I'm doing interviews\n\nand you asking me questions.\n\nSo that's what I'm up to.\n\nWhat is Marlon Wayans' next move?\n\nIf you're talking about like a break dance move,\n\nI don't know.\n\nI'm past the pop lock years.\n\nIf you're thinking movie, my next movie will be\n\nScary Movie 6 out in theaters June 12th, 2026.\n\nWho.\n\nWho was Marlon Wayans in White Chicks?\n\nBelieve it or not, I was the cute white chick.\n\nSean looked, who's a more handsome black man,\n\nwas not a good looking white chick.\n\nHe was like Shannon Sharpe's taste in White Chick.\n\nHe's like, I think that, I like that thick one.\n\nI like the thick one right there.\n\nThat one with that little mutt there.\n\nWho does Marlon Wayans play in Sextuplets?\n\nInteresting question.\n\nEvery goddamn body.\n\nIt's called Sextuplets and I was all six of the sextuplets\n\nand then I played the mama too.\n\nI was about to play extras,\n\nbut my producing partner, Rick Alvarez, stopped me.\n\nWho is Marlon Wayans' best friend?\n\nOne is my best friend Omar Epps\n\nwho I've known since high school.\n\nWe dreamt about being famous together\n\nand we made our realities come true\n\nand I think our best years' ahead of us.\n\nSo Omar Epps, he was in the movie Juice\n\nand I was in Mo Money and he became famous before me.\n\nAnd then I got famous like a year after.\n\nAnd then we was like chocolate\n\nand light chocolate and milk chocolate.\n\nAnd the girls used to go crazy for us in the '90s.\n\nSo that's my boy.\n\nBut then I had this beautiful little\n\ntwo and a half year old daughter now named Axl.\n\nAnd Axl, you are always daddy's best friend.\n\n[lips smack]\n\nSo fuck Omar.\n\nWho is Marlon Wayans' family?\n\nA lot of Negroes.\n\nMy family is a lot of Negroes, pick a Negro.\n\nSean, Keenan, Damon, Kim, Tito,\n\nJackie, Jermaine, El, Bunny.\n\nAll the black families just start blending together.\n\nSo pick one, they all family.\n\nMarlon Wayans.\n\nMarlon Wayans as George Raveling.\n\nGeorge Raveling, rest in peace.\n\nI was lucky enough to meet this legendary man.\n\nWe had produced a documentary called Unraveling George.\n\nIt's a wonderful documentary about a wonderful man.\n\nAnd I played him in the movie Air and I only had one scene\n\nand he told me I did a great job playing him.\n\nSo kudos even though he died.\n\nBut he told me that before he died.\n\nHe said, My last words,\n\nyou did a great job playing me in 'Air.'\n\nMarlon Wayans latest movie.\n\nMy latest movie is Him.\n\nIf you don't know about it,\n\nobviously you haven't driven by Sunset.\n\nIf you don't know about it,\n\nthen you haven't been to Times Square either.\n\nIf you don't know about it,\n\nthen you've been underneath a damn rock.\n\nIt's everywhere.\n\nI'm tired of seeing me.\n\nI think my role in Him as Isaiah White,\n\nI don't think it pushed me\n\nin ways I hadn't been pushed before.\n\nI think what it allowed me to do\n\nwas unstrap from every character I ever was before\n\nto become something that was bigger than the role.\n\nI had to just be untethered\n\nand allowing me the freedom to bring all this crazy\n\nand all the humor, all the darkness to this character\n\nI think makes it a special performance\n\nand a very special movie.\n\nMarlon Wayans Jordan Peele.\n\nWhat a combination.\n\nThat's like peanut butter and chocolate,\n\nand it's like, damn, they made Reese's,\n\nand it's a great combination.\n\nWhat's crazy is we have a lot of similarities.\n\nJordan and I are coming from sketch.\n\nAnd when you come from sketch,\n\nyou know that you just see the world in a very twisted way.\n\nWe're both twisted people who have a crazy diverse skillset.\n\nAnd I think him and the director Justin Tipping\n\nsaw that special thing in me,\n\nthat crazy, that little bit of crazy that I could add\n\nto Isaiah White that no other actor could apply\n\nand they chose me.\n\nWeird take but good choice, fellas.\n\nI think it worked out.\n\nMarlon Wayans Loc Dog.\n\nY'all like, who is Loc Dog?\n\nWell if you don't know who Loc Dog is, homie,\n\nyou don't know nothing about no hood movies.\n\nSo go watch Don't Be a Menace to South Central\n\nWhile Drinking Your Juice in the Hood, cuz.\n\nAnd what you say about my mama?\n\nMarlon Wayans Little Man smile.\n\nWhen was Marlon Wayans on In Living Color?\n\nProbably before your dumb ass was born.\n\nI think it was '92.\n\nI had just did Mo Money.\n\nMo Money came out in '92.\n\nAfter Mo Money, I did Above the Rim.\n\nBefore Above the Rim, I did In Living Color.\n\nAnd then we left In Living Color\n\nand I did Above the Rim.\n\nAnd then I got Batman, which was a tease.\n\nAnd then I didn't get Batman 'cause they wrote me out.\n\nAnd then depression.\n\nWhen Marlon Wayans.\n\nIs Marlon Wayans making a new Scary Movie?\n\nYou're damn right, and it's going to be a riot.\n\nY'all ain't laughing 25 years, about time.\n\nGet out your feelings, y'all get off social media.\n\nStop being a bunch of bitch-ass niggas\n\nand get ready to laugh.\n\nHow was Marlon Wayans cast in Requiem for a Dream?\n\nIt was unlike Him where they actually\n\nchose me for the role.\n\nNo.\n\nThat bushy ass Darren Aronofsky made me audition five times.\n\nAnd he was like, I don't want somebody\n\non the WB Network in my gritty drama 'Requiem for a Dream.'\n\nBut I kept coming back like a roach\n\nand I was just so committed\n\nand I just kept showing him different moves to the basket.\n\nEverything he tried to, you know,\n\nhe wanted somebody else for the role.\n\nI think he want that little short black dude Sean\n\nfrom Save the Last Dance.\n\nAnd I'm so glad he picked me for Requiem for a Dream.\n\nMm.\n\nYou give Darren a budget\n\nand he love to make a bad movie with a big budget.\n\nGive him $1.50, you will get classics.\n\nDarren, I always said you don't like money,\n\nbut when you don't have money, yo,\n\nyou really make some great movies.\n\nMy point is, I won the role as Tyrone C. Love\n\nin Requiem for a Dream and Darren and I made history.\n\nHey, that's all the board.\n\nThanks for having me.\n\nI'm out.",
  "authors": [
    "Condé Nast"
  ],
  "url": "https://www.wired.com/video/watch/google-autocomplete-inverviews-marlon-wayans-answers-the-webs-most-searched-questions"
}