{
  "title": "Cadillac copy Nasa playbook to build F1 team from scratch to hit Melbourne startline",
  "text": "Twelve months ago at the Las Vegas Grand Prix, Cadillac were finally given the green light as Formula One’s newest entry for 2026. Building the team from scratch has entailed a frenetic work rate that the team principal, Graeme Lowdon, has compared to the Apollo moon landing. As F1 descends on Vegas this weekend, Cadillac know time is getting tight.\n\nAt the final race of the season to be staged in the United Statess, with just over 100 days to go before they take to the track for the first time in Melbourne at the 2026 opener, Cadillac have come on in leaps and bounds but, in what must seem like a sisyphean task, they are aware there will never be enough hours in the day.\n\nThe chief technical officer, Nick Chester, joined the nascent operation in March 2023 shortly after it was formed, when the team were without even an approved entry. He has been at its heart ever since and enjoys a wry smile when considering the ride.\n\n“You can have five minutes looking back at what you’ve done and go: ‘Wow, isn’t this fantastic what we’ve done in less than three years,’” he says. “And then the next minute you think: ‘Yeah, we’ve still got quite a lot to do.’”\n\nChester enjoyed success at Renault in Fernando Alonso’s title-winning years of 2005 and 2006 and was in charge of technical direction at the new Mercedes Formula E team, but nothing has quite compared with the task of bringing the all-American Cadillac brand, a works entry backed by the parent company, General Motors, into F1.\n\n“Building an F1 team from scratch, when are you ever going to get a chance to do that?” he says. “It is like nothing else. In an established team you don’t get the opportunity to change cultural approach.”\n\nView image in fullscreen Sergio Pérez is one of the big-name drivers who will be racing for Cadillac in 2026. Photograph: Federico Basile/IPA Sport/ipa-agency.net/Shutterstock\n\nWith every day that passes minds are more focused on the looming moment of truth in Australia and expectations are being managed. “You have to assume that any new team coming in is going to be last but simply getting on to the grid will be an achievement in itself,” Lowdon noted this year and while Chester echoed this he felt the team had a point to prove as well.\n\n“The first thing we want to show is that we should be there,” he says. “So that we turn up and we operate well. We want to show that we’re a proper team doing the right things on the track. Once we’ve shown we’re really credible, then we want to show progression after that.”\n\nIn August they signed Sergio Pérez and Valtteri Bottas as their drivers for 2026, a pair notable for their invaluable experience in operating at the sharp end in two of the sport’s biggest teams, Red Bull and Mercedes, and Bottas reflected the mood of combative optimism. “Of course, we’re realistic,” he said. “There’s going to be a mountain of work to do, and it’s going to be probably a difficult start, because it is F1. But we’re not there to stay at the back. I believe with this structure, with this group, these people, there’s no reason why we shouldn’t be able to get relatively quickly up to the pace and enjoy some success.”\n\nTo that end recruitment has been in overdrive, with personnel now up to over 400 and planned to reach the target of 600 swiftly. Alongside their current base at Silverstone, the team are in the process of completing an HQ at Fishers in Indianapolis and there is the GM works in Charlotte, North Carolina, where they are building the facility to manufacture the new engine, set for 2029 – until then they will run Ferrari power units – and the Toyota wind tunnel in Cologne. It is a complex organisation, at odds with the trend in F1 for greater centralisation, and has prompted the new cultural approach to which Chester referred.\n\n“It’s highly modelled on the Apollo project,” said Lowdon shortly before the British GP in July. “We’re realistic, we know how difficult it is. The timelines, they’re super, super, super short. OK, we’re not putting a man on the moon, but it feels like it sometimes.”\n\nSo they have adopted, rather than the usual hierarchical system, a flat management structure similar to that of Nasa’s, where there were a range of Apollo teams all working on different aspects of the project across a variety of locations.\n\nskip past newsletter promotion Sign up to The Recap Free weekly newsletter The best of our sports journalism from the past seven days and a heads-up on the weekend’s action Enter your email address Sign up Privacy Notice: Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on theguardian.com to send you this newsletter. You can complete full registration at any time. For more information about how we use your data see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nView image in fullscreen Graeme Lowdon, the Cadillac team principal, described his approach to building a new F1 team as being ‘highly modelled on the Apollo project’. Photograph: Every Second Media/Alamy\n\n“If you have to go through a process where someone has a problem and they raise it up to their manager, that manager talks to a manager somewhere else, it goes back down the chain, it’s super slow,” says Chester. “So we empower people to really get on with it. Moving away from management approval for everything is so much cleaner and quicker.”\n\nThe effectiveness of this nimble approach will be tested in the heat of competition next season and there is no little amount at stake for F1, too. Cadillac have taken on as their test driver the 25-year-old Californian Colton Herta, winner of multiple IndyCar races, with a view to him earning a seat and he will compete in F2 next season. Vegas is one of three races in the US where the sport has recently agreed a deal with Apple for the TV rights, but a successful Cadillac with potentially an American driver would probably offer exponential growth to the sport’s already burgeoning popularity here.\n\nQuick Guide Toto Wolff sells part of Mercedes stake for £230m Show Mercedes boss Toto Wolff has sold his 15 per cent stake in the Formula One team to American billionaire George Krutz. Wolff, who owns one third of Mercedes, will remain as CEO and team principal, and is in Las Vegas for this weekend's race. The 53-year-old Austrian is set to earn close to £230million from the sale in a deal which values Mercedes at £4.57bn - a record for an F1 team. Krutz, the 55-year-old CEO and founder of cybersecurity company Crowdstrike - which currently sponsors Mercedes - becomes a co-owner of the team through his acquisition of Wolff's minority interest making his share five per cent. Kurtz also joins the team's strategic steering committee alongside Mercedes group chairman Olla Kallenius and Ineos chief Sir Jim Ratcliffe. Wolff, who oversaw six of Lewis Hamilton's record-equalling seven world championships said: \"George's background is unusual in its breadth: he's a racer, a loyal sporting ambassador for Mercedes-AMG, and an exceptional entrepreneur. \"He understands both the demands of racing and the realities of building and scaling technology businesses. That combination brings specific insight that is increasingly relevant to the future of Formula One.\" Mercedes won eight consecutive constructors' world championships between 2014 and 2021. They are second in the standings with three rounds remaining. George Russell has won two races so far this year. PA Media Was this helpful? Thank you for your feedback.\n\nFor the moment simply living up to Nasa’s “Failure is not an option” adage may be enough for a startup team come 2026.\n\n“The people who’ve joined really want the challenge of a new team and doing the first car for a new team,” says Chester. “The level of enthusiasm, excitement, collaboration is brilliant. There are a lot of smiling faces around the factory.\n\n“No doubt there’s a few little wrinkles where people are feeling a bit tired on occasion but they’re enjoying what they’re doing.”",
  "authors": [
    "Giles Richards"
  ],
  "url": "https://www.theguardian.com/sport/2025/nov/20/cadillac-copy-nasa-playbook-to-build-f1-team-from-scratch-to-hit-melbourne-startline"
}