{
  "title": "Quello di Stargate è il ritorno che non sapevi di desiderare (e ora inizia il conto alla rovescia)",
  "text": "Pronti per attraversare di nuovo lo Stargate? Nelle scorse ore Amazon ha infatti ufficializzato la volontà di mettere in produzione una nuova serie legata alla celebre saga fantascientifica. A occuparsi del nuovo progetto sarà Martin Gero, già creatore della serie Blindspot e del reboot di Quantum Leap, ma che aveva inaugurato la propria carriera proprio in una delle versioni televisive di Stargate. Al momento non ci sono dettagli sulla trama e sappiamo solo che la nuova serie sarà prodotta da Amazon Mgm Studios e sarà diffusa prossimamente sulla piattaforma streaming Prime Video.\n\n“Vent'anni fa il mio primo vero lavoro in televisione fu quello di story di Stargate: Atlantis”, ha dichiarato Gero. “Ho passato cinque anni a lavorare in questo franchise su tutte e tre le serie. Stargate mi ha insegnato tutto ciò che so sulla televisione, ce l'ho nel dna”. E ha aggiunto un ringraziamento particolare per i fan vecchi e nuovi: “A tutti coloro che hanno tenuto il portale aperto grazie a convention, rewatch e una fede indefessa - tutto questo è per voi. E per chi è nuovo in questo mondo - vi prometto che siete di fronte a qualcosa di straordinario”. Anche Nick Pepper, responsabile dello sviluppo contenuti on demand di Amazon Mgm Studios, conferma l'entusiasmo per questa nuova avventura: “Stargate è un franchise iconico e longevo che ha catturato il pubblico per decenni con la sua esplorazione del posto che l'umanità ha nel cosmo. (…) Siamo onorati di realizzare questo nuovo capitolo, onorando l'eredita della serie e spingendola verso un futuro ambizioso ed emotivamente rilevante”.\n\nL'universo di Stargate è nato nel 1994 grazie a un film di Roland Emmerich con James Spader e Kurt Russell, nel quale un gruppo di archeologi e soldati impiegano degli antichi manufatti di una civiltà aliena per viaggiare attraverso lo spazio grazie a wormhole che teletrasportano su pianeti lontani, arrivando a sventare l'attacco di una razza parassita conosciuta come Goa'uld. Lo stesso concetto, anche se con nuovi protagonisti (in particolare Richard Dean Anderson, famoso per la serie originale di MacGyver), viene ripreso nella serie sequel del 1997 Stargate SG-1, andata in onda fino al 2007. Nel corso degli anni sono arrivate altre serie spin-off, come Stargate: Atlantis e Stargate: Universe, e anche il prequel Stargate: Origins. A ciò si sono aggiunti una serie animata, Stargate: Infinity durata una sola stagione nel 2002 e due film direct-to-video nel 2008, The Ark of Truth e Continuum.\n\nIn sostanza è dal 2018 che non ci sono nuove storie originali relative a questa saga. Le prime notizie su una possibile nuova espansione erano iniziate a circolare nel 2022, dopo che Amazon aveva acquisito gli Mgm Studios, detentori dei diritti. Ora finalmente il progetto assume concretezza, con la gioia di tantissimi fan sparsi in tutto il mondo: forse quella di Stargate non è una delle serie più citate e apprezzate quando si tratta di fantascienza, ma nel corso dei decenni ha sicuramente raccolto un affezionatissimo zoccolo duro e addirittura influenzato tante altre produzioni più o meno simili (per esempio Battlestar Galactica, Firefly e persino Star Trek: Strange New Worlds). Il suo ritorno è ancora più apprezzato proprio perché in qualche modo inaspettato.",
  "authors": [
    "Paolo Armelli"
  ],
  "url": "https://www.wired.it/article/stargate-ritorno-nuova-serie-tv-amazon-produzione-prime-video#intcid=_wired-it-verso-hp-trending_9911878c-3b24-4da9-8147-d9aec1f7f41e_popular4-2"
}