{
  "title": "Why Gutting USAID Will Hurt America",
  "text": "Transcript\n\n1 billion children immunized.\n\n2.2 billion malaria cases prevented 26 million lives\n\nsaved from AIDS.\n\nFor 60 years, USAID,\n\nAmerica's Foreign Assistance Agency has fed the hungry\n\nand prevented disease worldwide.\n\n40% of total global humanitarian aid came from the US\n\nwith two thirds of that coming from USAID.\n\nRecently, president Trump and Elon Musk all\n\nbut gutted the agency as part\n\nof their so-called America First policies.\n\nBut in our globalized economy, the data suggests\n\nthat slashing upwards of 90% of USAID's budget\n\nor $60 billion may have unexpected blowback here in the US,\n\ncontributing to rising food prices,\n\nmaking us susceptible to epidemics at home\n\nand damaging the livelihoods of many Americans,\n\nespecially farmers in the heartland.\n\nWired pinpointed some critical food\n\nand medical cuts to USAID\n\nand placed their impact on the health\n\nand wealth of everyday Americans on the grid.\n\nThis was the headquarters\n\nof the USAID offices in DC.\n\nGoogle Maps list the office as permanently closed.\n\nOnly a few hundred out of the agency's 13,000 employees\n\nwill retain their jobs,\n\nbut when they were in business,\n\nUSAID wasn't spending American taxpayer funds\n\nonly on foreigners as many claim.\n\n80% of the companies that had contracts\n\nwith the agency were American.\n\nUSAID was investing money back into the pockets of as many\n\nas 50,000 American contractors employed by universities,\n\nnonprofits, and aid organizations.\n\nThis map will give you an idea of just\n\nhow many American institutions were partnering with USAID\n\nbefore the cuts.\n\nFrom Columbia University's research center,\n\nhelping countries plan for climate change to a partnership\n\nwith the Coca-Cola company, improving access to water\n\nand sanitation services,\n\nUSAID money funded American universities, businesses\n\nand charities to the tune of $28 billion annually,\n\nonly 0.7% of the total federal budget that fed a multitude\n\nof programs aimed at promoting global health, democracy,\n\nand other foreign policy aims of the US\n\nbecause so much was affected.\n\nWe can't cover it all in a single video,\n\nso we'll be focusing on the two most critical aspects\n\nof USAID, Food and Health.\n\nA huge USAID program, Food for Peace,\n\nbought surplus food from American farmers\n\nand delivered it to countries in need,\n\nbenefiting over 4 billion hungry people worldwide\n\nsince 1954.\n\nSo when malnourished children received much needed\n\nbreakfasts in Afghanistan or families\n\nand famine prone Sudan lined up\n\nfor a meal from an emergency kitchen.\n\n41% of that food was sourced directly from American farmers\n\nwho were paid about $2 billion annually,\n\n$2 billion bought everything from Iowa Soybean oil\n\nto Oklahoma Wheat, Kansas lentils produce from Virginia\n\nand Georgia Peanut products including a nutritional pace\n\nthat's a powerhouse for Friday hunger.\n\nThe products were then sent around the globe by USAID\n\nand its contractors, but by mid-February,\n\njust days after the cuts began,\n\n$489 million worth of food assistance\n\nand over 500,000 metric tons.\n\nAmerican grown food already paid for\n\nby USAID remained stranded in ports\n\nor in transit with a significant portion\n\nat risk of spoiling.\n\nIn Larned, Kansas,\n\nthe Pawnee County Cooperative Association reportedly had\n\n1.5 million bushels of sorghum,\n\na key grain in cereals in storage, with no one to buy it.\n\nPort Houston had 235,000 tons\n\nof wheat stranded in warehouses according to local sources,\n\nas well as 30,000 metric tons of cornmeal, pinto beans,\n\nlentils, rice, and vegetable oil.\n\nSimilar issues reportedly impacted ports in Boston, Miami,\n\nNorfolk, Savannah, New York, Chicago, and Lake Charles.\n\nAt Ports in Kenya,\n\nnearly 200 million in emergency food aid\n\nremained undelivered,\n\ncontractors and local USAID staff responsible\n\nfor getting the food which had already\n\nbeen bought and paid for.\n\nFrom the Kenyan ports\n\nto the South Sudanese people did not receive payment due\n\nto the USAID pause.\n\nIn South Sudan, about 7.1 million people,\n\nmore than half the population require food assistance\n\nwith 1.6 million children at risk of acute malnutrition.\n\nSouth Sudan lacks basic infrastructure like paved roads,\n\nmaking aid delivery expensive and inefficient.\n\nFor example, PGE is a remote area in South Sudan\n\nthat humanitarian workers can only access\n\nby taking a two hour flight,\n\nfollowed by a four hour canoe journey,\n\nthen a six hour trek through a swamp.\n\nAs a result, those suffering will not receive this food.\n\nThe food will go to waste\n\nor possibly be stolen from the docks.\n\nAccording to the World Health Organization,\n\nwhich the Trump administration tries to discredit.\n\nAt any given moment,\n\n733 million people are experiencing food insecurity\n\nsomewhere in the world.\n\nTo combat hunger back in the US,\n\nscientists are studying things like the\n\nresilience of specific crops like wheat and peanuts.\n\n17 food science research labs\n\nhoused at various American universities,\n\nincluding Kansas State University,\n\nthe University of Nebraska\n\nand Purdue University received millions\n\nof dollars from USAID's Feed the Future Program.\n\nBut due to the cuts they've had to pause their research.\n\nThe Soybean Innovation Lab at the University of Illinois\n\nhas laid off 30 employees\n\nand expects to close down if funding isn't restored.\n\nThey worked with farmers in Madagascar\n\nand Nigeria, as well as Pakistan, India,\n\nand Indonesia to breed soybean varieties that are resistant\n\nto diseases like soybean rust.\n\nResearch like this benefits American farmers\n\nby helping them prepare\n\nfor crop diseases we see everywhere in the world.\n\nFor example, knowing how\n\nto best grow crops in drier hot conditions will be more\n\ncrucial in a world increasingly touched by climate change.\n\nWithout this research,\n\nfarmers everywhere will be left ill-equipped\n\nin the face of a heating planet.\n\nLet's talk about rising food prices.\n\nWhat many don't realize is that USAID has helped keep prices\n\nof some products in check for Americans for years\n\nby supporting the production\n\nof specific agricultural commodities like chocolate, coffee,\n\nspices, and even rubber in developing countries.\n\nHow? Well, let's take coffee as an example.\n\nThe US coffee industry contributes 1.6% to the US GDP\n\nand supports nearly 1.7 million American jobs.\n\nFor years, USAID partnered with US coffee companies\n\nand small farmers abroad in places like Africa, central\n\nand South America and Indonesia to combat crop diseases\n\nand improve coffee supply chains by providing digital tools\n\nand training to coffee breeders with a goal\n\nof increasing capacity,\n\nensuring that US coffee businesses had access\n\nto a stable and high quality supply.\n\nWith the USAID cuts, this is no longer guaranteed\n\nand prices may spike similar programs in the Ivory Coast,\n\nGhana and Ecuador, where cacao grows were in place\n\nto ensure America's supply of chocolate flows.\n\nCacao is critical to the candy industry,\n\nwhich supports at least 70,000 American jobs in Maryland.\n\nSpice Giant McCormick and Company has benefited\n\nfrom a USAID partnership\n\nwith the Ohio based Cooperative Business Association\n\nor CBI to enhance spice production in Indonesia.\n\nThis program rehabilitated abandoned plantations,\n\nbuilt new ones, and improved yields of vanilla bean, nutmeg,\n\ncloves, cinnamon, black pepper,\n\nand of course, pumpkin spice.\n\nCBIs local affiliate Agri Spice Indonesia\n\nsupplied well priced spices to a variety\n\nof McCormick products.\n\nAlso in Indonesia,\n\nUSAID has helped Royal Lestari Utama,\n\na company owned by Michelin,\n\nget a loan for its sustainable rubber plantation,\n\nwhich feeds the US tire industry,\n\nparticularly in South Carolina.\n\nThese are just a few examples of how\n\nby strengthening supply chains\n\nand improving productivity in developing countries,\n\nUSAID funded programs maintain the availability\n\nand affordability of key raw materials\n\nfor US industries whose products then turn out to be cheaper\n\nfor American consumers.\n\nNow let's turn to the impact of USAID cuts on health Up\n\nto a million lives were saved\n\nin 2016 when a famine in the Horn of Africa\n\nwas predicted and responded to\n\nby the famine early Warning Systems network refused net\n\nusing data analysis of weather\n\nand armed conflicts to predict famines\n\nand distribute food aid.\n\nThis successful system was paid for by USAID\n\nand largely run by Chemonics,\n\na private DC based international development firm cuts\n\nby Doge have led to the program going offline.\n\nChemonics has furloughed 88%\n\nof its US-based workforce Experts warned\n\nthat without FuseNet humanitarian response efforts will\n\nbe less effective.\n\nLeading to more hunger and instability around the globe\n\nand food instability in developing nations has been closely\n\nlinked to increased file and extremism.\n\nIn northeastern Nigeria, the jihadist terrorist group,\n\nBoko Haram offers meals to attract potential recruits.\n\nThere are also reports from 2017\n\nof ISIS lowering unaccompanied child refugees out of Syria\n\nwith food and cash.\n\nSince we're talking about ISIS,\n\nthe USAID cuts affect payments\n\nand support to the Kurdish-led Syrian Democratic forces\n\nor SDF who manage camps holding ISIS members\n\nand their families.\n\nAround 10,000 suspected ISIS fighters are imprisoned\n\nin 28 jails across northeastern Syria\n\nwith the largest being the Al-Sina prison in Hisaka.\n\nUS and Syrian officials have warned\n\nthat weakened security here could lead to an ISIS revival.\n\nClearly dismantling or even pausing USAID programs\n\nnot only weakens humanitarian efforts,\n\nbut also undermines American national security\n\nand foreign policy objectives.\n\nLet's turn our attention to the impact\n\nof USAID cuts on our health.\n\nThe Trump administration revoked\n\nover 10,000 global health grants from USAID\n\nand the State Department\n\nthat played a significant role in global disease prevention.\n\nThese included outbreak surveillance,\n\nwhich means global collaboration to detect\n\nand respond to emerging infectious diseases.\n\nThe Global Bird Flu Pandemic is currently spreading\n\nthroughout the US.\n\nUSAID funded avian flu surveillance\n\nin 49 countries around the world\n\nthat involved collecting samples from farms with high levels\n\nof poultry mortality and testing them,\n\nnotifying farmers of results,\n\nmonitoring migratory birds\n\nand the cross-border poultry trade,\n\nand sharing all of that collected data.\n\nThe USAID cuts have ended that program,\n\nwhich is bad news because the response\n\nto bird flu experts warn requires global cooperation.\n\nThe previous outbreak in 2014 cost the American poultry\n\nindustry approximately $1.6 billion.\n\nThe case of an Iowa man who died recently of LASA fever\n\nafter visiting in West Africa is proof\n\nthat infectious diseases from other continents\n\nare just an international flight away.\n\nUganda is facing its eighth Ebola outbreak\n\nwith the first confirmed case being a nurse in Kampala\n\nwho died on January 29th.\n\nThe outbreak involves the deadly Sudan Street.\n\nHowever, contact tracing\n\nand traveler screenings in Uganda have been disrupted.\n\nWhy?\n\nOn February 26th, Elon Musk admitted\n\nthat Doge accidentally canceled\n\nUSAID's Ebola prevention funding,\n\nbut assured us once they discovered the error\n\nthat it was quickly restored.\n\nHowever, as I reported for wired the following day,\n\nemergency waivers meant to sustain some\n\nof USAID's humanitarian programs,\n\nincluding those focused on Ebola have been ineffective.\n\nIn part because most USAID staff have been laid off leading\n\nto delayed responses to Uganda's Ebola outbreak\n\nwith America now refusing to meet the moment\n\nin regards to Uganda's latest Ebola outbreak.\n\nCBS has reported that Russia has launched a mobile lab there\n\nto assist with outbreak containment and alarmingly.\n\nA new unidentified hemorrhagic fever has emerged\n\nin the Democratic Republic of Congo.\n\nIt is claimed over 60 lives\n\nand made over a thousand people ill.\n\nHistorically, USAID played a key role in identifying\n\npathogens by funding the testing\n\nof virus samples in laboratories.\n\nDismantling USAID made this particular illness\n\nharder to investigate.\n\nOne way to combat infectious diseases on the rise\n\naround the world,\n\nsuch as cholera and Afghanistan, polio in Yemen\n\nand dengue across Central America\n\nand the Caribbean is vaccines\n\nand they don't just save lives.\n\nVaccines also save money.\n\nAccording to a study by John Hopkins University,\n\nevery dollar spent on immunization yields a $16 return\n\nby reducing the cost of illness treatment.\n\nIn an additional analysis\n\nthat considers the wider economic impact of illness.\n\nEvery dollar spent on vaccinations could save $44\n\naccording to the CDC.\n\nThe USAID funding freeze has halted at least one notable\n\nvaccine development program, a $45 million award\n\nto the South African Medical Research Council,\n\nwhich aims to end HIV in Africa.\n\nIn late January,\n\na group of researchers from eight African countries plan\n\nto initiate a phase one clinical trial\n\nfor two experimental HIV vaccines,\n\nenrolling dozens of volunteers in South Africa,\n\nKenya, and Uganda.\n\nIf this vaccine is found to be safe and efficacious,\n\nit could help prevent millions of lives\n\nof South Africans that are currently being lost.\n\nThere are no FDA approved HIV vaccines in the US yet,\n\nso new vaccines that are developed overseas\n\ncould be promising contenders\n\nfor the first HIV vaccine in the US too.\n\nThat study is now on hold indefinitely\n\nsince the funding no longer exists.\n\nAccording to a report from the Guardian,\n\nan estimated 500,000 South Africans could die\n\nbecause of this blow to crucial research, plus the removal\n\nof other USAID funds, which assist in the diagnosis\n\nand dispensing of antiretroviral medications\n\nwhich keep infected patients alive.\n\nAnother way to stave off illness is prevention.\n\nAnd in the Amazon basin, USAID was on the forefront\n\nof initiatives to control malaria in Brazil, Columbia,\n\nEcuador, Guana, Peru, and Surinam.\n\nThrough the Amazon malaria initiative,\n\nUSAID funded tailored interventions\n\nto region specific needs\n\nwith funding cutoff in employees furloughed.\n\nThe trust in Goodwill USAID has worked hard\n\nto grow has been thwarted,\n\nand once trust is lost, it's hard to build back.\n\nIn 2023,\n\nthere were an estimated 597,000 malaria deaths worldwide,\n\nmainly in Africa, with children under five,\n\nconstituting 76% of the deaths in this region.\n\nThese food and health program cuts are just a fraction\n\nof the story of what USAID dismantling ultimately means\n\nfor our country and the world.\n\nExperts say that abruptly cutting off this work will kill\n\nuntold numbers of people around the world.\n\nThere are some people within the US who are unmoved by\n\nhow disastrous this choice will be\n\nfor people across the globe.\n\nThey say our dollars are better spent solely\n\non domestic projects,\n\nbut this viewpoint fails to consider\n\nhow interconnected we are\n\nand how deeply damaging it will be\n\nfor Americans if our country is considered\n\na callous rogue state.\n\nThe US turning its back on humanitarian aid in such\n\na sweeping and abrupt way is also an out\n\nand out win for China,\n\na country that is still eagerly pursuing\n\ninternational development projects as a way to win power\n\nand influence abroad.\n\nThey've already invested over $1 trillion in infrastructure\n\nas part of their own USAID.\n\nUltimately, the cuts\n\nto USAID will have unexpected impacts on the livelihoods\n\nof Americans and make the US less safe.\n\nThe full impact is only beginning to unfold,\n\nso stay updated with our continuing coverage on wired.com.\n\nThanks for watching on the grid.\n\n[gentle music]",
  "authors": [
    "Condé Nast"
  ],
  "url": "https://www.wired.com/video/watch/on-the-grid-why-gutting-usaid-will-hurt-america"
}