{
  "title": "Bang & Olufsen compie 100 anni, ecco i prodotti più iconici e il segreto del “danish touch” raccontato a Wired dal Ceo",
  "text": "Bang & Olufsen, esattamente oggi 17 novembre, compie 100 anni. Quando Peter Bang e Svend Olufsen fondarono l'azienda nel 1925 la loro missione era semplice ma radicale: “Una volontà incrollabile di creare solo il meglio e di tracciare costantemente nuove strade”. E in effetti il marchio ha mantenuto intatte le caratteristiche di esclusività, design e danish touch. “Per me, la nostra identità non riguarda solo il suono o la tecnologia, ma anche le emozioni. Progettiamo prodotti che muovono i sentimenti e le sensazioni delle persone e oggetti che si collocano al crocevia tra arte, ingegneria e narrazione”, spiega a Wired l’attuale Ceo Kristian Teär.\n\nNel quartier generale di Struer si lavora per donare a ogni oggetto, dispositivo e apparecchio l’intramontabilità. Non è solo un tema di funzionamento, ma culturalizzazione del tempo che scorre. “Lo paragono spesso al possedere un orologio a carica manuale o un'auto d'epoca. Un orologio meccanico di lusso non segna l'ora meglio di un orologio digitale, ma racconta una storia. Rappresenta il patrimonio, l'aspirazione, l'artigianato e il legame emotivo. I nostri prodotti hanno lo stesso peso culturale”, racconta Teär.\n\nPeter Bang e Svend Olufsen B&O\n\nI prodotti che hanno fatto la storia dell’azienda\n\nIl primo passo di B&O si è compiuto nel 1925 con l’Eliminator: ha permesso alle radio a batteria di funzionare con l'alimentazione di rete, introducendo di fatto la radio nel quotidiano. Poi nel corso dei decenni si sono affermati così tanti altri prodotti che l’azienda ha iniziato a contribuire alla storia del design. Si pensi alla radio Beolit 39 del 1939, con il suo elegante involucro in bachelite. Poi il televisore Beovision 1 del 1967 che ha dimostrato come “la semplicità e la forma scultorea potessero convivere in armonia con la funzionalità”. Nel 1972 forse c’è stato un vero e proprio cambio di passo con il giradischi Beogram 4000, secondo Teär “ancora oggi desiderabile come lo era 50 anni fa, perché rappresenta più di una semplice funzione: rappresenta longevità, arte, identità e straordinaria maestria artigianale”. Iconico anche il lettore cd Beosound 9000, che più di altri prodotti ha ridefinito il rapporto tra suono e design: l'abbiamo visto a casa di Miranda in Sex & the city. Li trovate tutti nella gallery in fondo all'articolo.\n\nIn un mondo ossessionato dalla velocità e dagli aggiornamenti, noi rappresentiamo qualcosa di diverso: l'idea che il vero lusso è fatto per durare. Comprare meno, comprare meglio non è solo uno slogan, è una mentalità che oggi più che mai sembra più attuale che mai - Kristian Teär, Ceo di B&O\n\nE il file rouge si è mantenuto intatto: l'artigianato e le prestazioni sono inseparabili, “la tecnologia dovrebbe sentirsi a casa nella vostra vita, non separata da essa […] l'innovazione, se realizzata in modo eccellente, resiste alla prova del tempo”.\n\nLa filosofia non è cambiata in 100 anni\n\nIl Ceo di B&O, quando cerca di far comprendere lo spirito dell’azienda, parla di sfida alle convenzioni: “Quell'audacia, la volontà di correre rischi creativi e di superare i confini. La nostra strategia parte ancora dalla stessa domanda che ci ponemmo un secolo fa: possiamo renderlo migliore, più bello e più significativo? Ogni decisione, che si tratti di innovazione di prodotto, direzione del design o esperienza del cliente, è guidata da questo principio”. Un gusto per l’innovazione che non è fine a stesso, ma che contribuisce a dare consistenza ai prodotti. “Suscitano emozioni e resistono nel tempo. L'artigianato e il design sono fondamentali per questa missione. I nostri prodotti sono immediatamente riconoscibili non solo per la loro estetica, ma anche perché rappresentano qualcosa. Sono diventati simboli di gusto, cultura e tranquilla sicurezza”, prosegue il dirigente.\n\nIl concetto di “minimalismo ricco” e la tecnologia come strumento\n\nB&O ha fatto del minimalismo ricco quasi una bandiera: un design mirato “in cui ogni dettaglio ha il suo posto”. Qualcosa che si distingue poiché “ricco di profondità, texture e significato”. Secondo Kristian Teär “si tratta di creare prodotti intuitivi, emozionali e vivaci, che siano immediatamente riconoscibili come Bang & Olufsen”. Come a dire che la tecnologia non è la protagonista visiva dell’oggetto, ma lo strumento funzionale che permette di ottenere prestazioni, design senza tempo e vere proprie espressioni dell’arte.",
  "authors": [
    "Dario D'Elia"
  ],
  "url": "https://www.wired.it/gallery/bang-and-olufsen-100-anni-intervista-ceo-prodotti-storici/"
}