{
  "title": "Neurosurgeon Answers Brain-Computer Interface Questions",
  "text": "Transcript\n\nI'm Ben Rapoport.\n\nI'm an electrical engineer and neurosurgeon.\n\nAnd I'm here today to answer your questions\n\nfrom the internet.\n\nThis is Brain-Computer Interface Support.\n\n[upbeat music]\n\nWinnieCherian asks,\n\nHow does brain-computer interface technology work?\n\nBrain-computer interface technology uses the fact\n\nthat the brain communicates with itself\n\nand with the outside world using electrical signals.\n\nAnd so brain-computer interfaces are implants\n\nthat use tiny little electrodes that touch the brain\n\nand transform the electrical signals from the brain\n\ninto ways of interacting with computers\n\nand external devices.\n\nThat translation of electrical signals\n\ninto useful means of communication with the outside world\n\ntakes place using machine learning algorithms\n\nthat transform the digitized bitstreams\n\nfrom brain electrical data\n\ninto means of communication with computers, smart devices,\n\nand in some cases, robotics.\n\nInskigator asks, Could somebody, anybody,\n\nexplain to me why a human being would even want\n\na brain-computer interface implanted in him/her?\n\nI only ask 'cause it's happened.\n\nWell, I think it's important to understand\n\nthat one of the early uses\n\nof brain-computer interface technology\n\nis especially for people with disorders of the brain\n\nand nervous system,\n\nand I'm talking about people\n\nwith spinal cord injury, stroke,\n\nand some forms of neurodegenerative disease such as ALS,\n\nconditions that paralyze people\n\nand leave people with totally functioning mind,\n\nunable to interact with the world\n\nin the ways that many of us take for granted.\n\nThe first generation of brain-computer interface technology\n\nis really geared towards enabling people\n\nwith those kinds of conditions\n\nto interact with other people, with the outside world,\n\nreturn to work and have a sense of dignity, independence\n\nthat many of us take for granted.\n\nGuavault asks, Can you move a cursor in your mind\n\nor draw using a cursor?\n\nThat's how BCIs for blind people work right now.\n\nEverything needs to be drawn, AKA sequential,\n\ninstead of all at once.\n\nLet me try to unpack this question.\n\nHow do you move a cursor with your mind?\n\nOr how do people with brain-computer interfaces\n\nlearn to move a cursor using their mind?\n\nFor each person who's had this experience,\n\nit's a little bit different.\n\nAt the beginning, we usually provide an instruction,\n\nthink about moving a joystick\n\nor think about moving your hand\n\nor think about moving your arm.\n\nAt first it's very laborious\n\nand eventually the brain just connects to the cursor.\n\nLike you learn to use a tool, a pencil, a baseball bat,\n\nor riding a bicycle,\n\nso that the brain-computer interface\n\nis a tool like any other.\n\nAnd we're still really learning what that experience is like\n\nand how the brain accomplishes it.\n\nBut that is the subjective experience\n\nthat people who've used this technology explain,\n\nthat it sort of clicks at some point\n\nand it starts to feel like magic.\n\nYou know, when we interact with the real world,\n\nwe don't realize it, but there's actually a delay\n\nbetween what our brain thinks and tells the body to do\n\nand when the body does it.\n\nI.n a brain-computer interface\n\nwhere the interaction takes place\n\ndirectly between the brain and electrode,\n\nwe can bring that latency down to individual milliseconds.\n\nThat's why people feel like the experience\n\nis almost like the interface is predicting their thought.\n\nThere's another question that's packed in here.\n\nCan brain-computer interfaces\n\nmanifest a fully formed thought?\n\nThat gets to the question\n\nof how we subjectively feel like we're thinking.\n\nVery often we imagine something or we have a feeling\n\nor a picture or a concept in our brains,\n\nand we don't right now have a way of expressing\n\nthat fully formed thought\n\nother than through drawing a picture\n\nor speaking in paragraph form.\n\nBut we do have this subjective sense\n\nthat thoughts exist in a fully formed way.\n\nAnd there's this question that I think Guavault is asking,\n\nwhich is, will brain-computer interfaces allow us\n\nto transmit thoughts in that fully formed way?\n\nI have a feeling that the technology will allow us\n\nto travel in that direction\n\nprobably even faster than we can imagine,\n\neven if we can't say exactly how right now.\n\nPesh909x asks, Will BCIs ever be able\n\nto record our dreams and psychedelic trips to video?\n\nAnd the answer is yes.\n\nBrain-computer interfaces already\n\ncan see activity in the visual cortex,\n\nwhich is the part of the brain\n\nthat processes visual information.\n\nAnd there has been some work showing that actually\n\nsome of that information can be decoded\n\nto recreate the visual scene.\n\nThere is some evidence that that kind of visual replay\n\nhappens during our dreams,\n\nand so it may be possible in the future\n\njust as some of these studies have begun to show\n\nthat brain-computer interfaces can record, replay,\n\nprocess the information that occurs\n\nduring imagined visual activity and dreams.\n\nStephen_Roto asks, The first human patient\n\nwith a brain-computer implant\n\nused the technology to successfully play Mario Kart?\n\nIf that isn't the definition of a '90s kid,\n\nI don't know what is.\n\nIt is true that the first Neuralink patient\n\nused his implant to play Mario Kart\n\nand seems to have had a great time doing it.\n\nThat wasn't the first human patient\n\nwith a brain-computer implant,\n\nbut he did use it to play Mario Kart.\n\nAnd I think that points to the fact\n\nthat people are gonna use brain-computer interfaces\n\nto do all the sorts of things that we take for granted\n\nand know and love can be done in the digital world.\n\nFashion Savage asks, Will BCI lead to security issues\n\nof hacking or reprogramming people's brains?\n\nThis is a really important question.\n\nIt's one that many people have asked,\n\nwhich is, given the sensitivity of neural information,\n\nwill BCI technology lead to issues involving hacking\n\nor compromising the security of people's private thoughts?\n\nCertainly in the first generation\n\nof brain-computer interfaces,\n\nwe're really interacting\n\nwith the parts of the conscious brain\n\nthat move the body and move the hands, move the arms,\n\nmove the face and the muscles that control speech.\n\nAnd these are not really areas of the brain\n\nthat we consider private thought activity,\n\nand furthermore, patients, when you ask them,\n\nwould you be concerned about a privacy issue,\n\nin this context, many of the people\n\nwho stand to benefit from this technology\n\nwould trade a little bit of privacy\n\nfor the ability to interact smoothly with the outside world,\n\nbut that doesn't minimize the possibility\n\nof real security and privacy issues\n\nwhen neural data is being transmitted wirelessly\n\noutside of the body.\n\nSo we and others involved in the industry\n\nhave taken real care to try to encrypt\n\nand secure any neural data streams that leave the body.\n\nRealEditor6 asks, I was wondering\n\nif ever a human brain merged with an LLM\n\nvia a brain-computer interface,\n\nwhat would the AI experience?\n\nWhat would that person experience?\n\nIs anyone connected already?\n\nThe answer is a qualified yes\n\nbecause people with brain-computer interfaces\n\nnow certainly have the ability\n\nusing the same means that we do\n\nof textually querying an LLM.\n\nAnd so that interaction is definitely happening.\n\nI haven't asked the AI what the AI's experience is,\n\nbut certainly we can do that.\n\nI look forward to that question.\n\nWhat would that person experience\n\nI think is actually very similar\n\nin the current form of the technology\n\nto what you and I experience when we query the AI.\n\nThose interactions right now are textual in nature.\n\nThe AI's output is not fed back\n\ndirectly into the user's brain just yet.\n\nSo the BCI users have an experience\n\nthat's similar to what every other user of an LLM has.\n\nBut I get the question is asking towards a future state\n\nin which there's a more symbiotic meld\n\nbetween artificial intelligence and humans\n\nthrough brain-computer interfaces.\n\nAnd I think this is the direction of travel,\n\nand it's hard to predict exactly what it's gonna look like.\n\nJames Rosen-Birch asks,\n\nWhat part of the brain is the BCI interfacing with?\n\nMany brain-computer interfaces to date\n\nspend a lot of time in and around the motor cortex,\n\nwhich is this area of the brain.\n\nThis is the hand motor area, this is the leg motor area,\n\nthis is the face motor area involved in speech.\n\nThose motor areas are really important\n\nfor current-generation brain-computer interfaces\n\nbecause they perform the computations in the brain\n\nthat allow us to interact with the world physically.\n\nWhen we think about things like typing or moving our hands\n\nor walking or speaking,\n\nthose are the parts of the brain\n\nthat serve those functions most directly.\n\nBut there certainly are future directions\n\nof brain-computer interface technology.\n\nWe can think about connecting to\n\nand interfacing with other areas of the brain\n\nand other areas of the nervous system,\n\nso areas that control sensation, decision-making, memory,\n\neven parts of the brain stem and spinal cord\n\nthat are involved in other types of neurological disease.\n\nOur friends at g.tec medical engineering,\n\nHow many electrodes are needed\n\nto run the brain-computer interface?\n\nThe answer to that is in the hundreds or thousands,\n\nand that just gets us off the ground.\n\nI think it's hard to say\n\nwhat the upper limit is to functionality.\n\nSo many of us are familiar in the world of communication\n\nthat basically the higher the speed of your connection,\n\nthe more sophisticated the applications you can run,\n\nor in the world of images,\n\nthe more pixels or megapixels you have in your display,\n\nthe higher fidelity the graphics you can render.\n\nAnd the same is true in brain-computer interfaces.\n\nThe more detailed and the higher resolution\n\nthe picture of brain activity you can generate,\n\nthe more smooth and sophisticated\n\nthe real-time interaction you can have with the brain.\n\nRight now we're seeing that brain-computer interfaces\n\nwith around a thousand electrodes get us off the ground\n\nto incredibly high levels of functionality\n\nthat include things like controlling a cursor,\n\nperforming the sorts of tasks that we take for granted\n\nin everyday interactions with computers,\n\nbut we can see a path towards many thousands of electrodes\n\nand even orders of magnitude higher\n\nin which smooth, intuitive connections between the brain\n\nand the outside world will be even higher performance.\n\nOk-Hunter-8210 asks,\n\nConsidering recent developments\n\nin brain-computer interfaces,\n\nI'd love to hear from experts or enthusiasts\n\nabout potential applications\n\nin assisting individuals with severe paralysis or ALS.\n\nHave we made sufficient strides\n\ntoward leveraging BCI technology\n\nfor rehabilitation purposes?\n\nYes.\n\nSevere paralysis and ALS are really the first conditions\n\nthat have received a tremendous amount of attention\n\nfor brain-computer interface technology.\n\nThere's quite a few examples of patients in clinical studies\n\nwho have had tremendous benefit from their implants\n\nquite apart from being part of the clinical studies,\n\nand it's exactly these individuals\n\nwith severe paralysis from spinal cord injury,\n\ncertain forms of stroke and ALS\n\nwill be among the first to benefit from the technology.\n\nA Reddit user in the singularity thread asks,\n\nIs there a concrete pathway\n\nto non-invasive BCI technology?\n\nMostly no in the way that we think of,\n\nbut also yes to the implied question of,\n\nis there a use for non-invasive neural interfaces?\n\nSo when I think about brain-computer interfaces,\n\nI think about systems that are being used\n\nto drive real-time interactions\n\nbetween the brain and the outside world.\n\nAnd that kind of high-bandwidth,\n\nsophisticated, smooth, high-speed interactions\n\nbetween the brain and the outside world\n\nthat really happen at the speed of thought,\n\nthat requires implanted technology.\n\nThere's no way that we know of around the need\n\nto actually be touching the brain in some way\n\nto get that kind of high-bandwidth, high-speed interaction.\n\nNon-invasive techniques and technologies\n\nhave captured scientists' and neuroscientists' imagination\n\nfor a long time,\n\nand there definitely is a use for non-invasive technologies.\n\nThey can detect brain state,\n\nthey can manipulate brain state,\n\nand they can be used to treat certain forms of disease,\n\nbut not to manipulate at high fidelity\n\nand high resolution in real time.\n\n@HowardG69263 asks,\n\nBrain-computer interfaces sound cool,\n\nbut kind of scary too.\n\nLike, what if it malfunctions or something?\n\nSo many important technologies\n\nhave these sorts of questions attached to them,\n\nwhether it's cars or airplanes\n\nor gene sequencing or artificial intelligence.\n\nThere's always this question of,\n\nit's magical when it works well\n\nand what if it doesn't work well or what if it malfunctions?\n\nIt is important,\n\nas in the development of all kinds of technology,\n\nto have ways of fixing things when they go wrong.\n\nYou know, Murphy's law is real.\n\nAnything that can go wrong will happen in some way,\n\nand so we need to try to anticipate failure modes\n\nand plan for how to fix them.\n\nWe've developed electrodes that interact with the brain\n\nin a way that doesn't damage the brain,\n\nand so these electrodes can be moved, removed, replaced,\n\nand upgraded as necessary in the future,\n\nand other components of the system\n\ncan be modularly changed out over time.\n\nFor example, the battery or the wireless\n\nor certain forms of tunneled connectors\n\nthat are implanted under the skin.\n\nSo understanding the way things obsolesce or change\n\nor may need to be switched out in the future is important\n\nto ensuring that we can safely repair a device\n\nand plan for all eventualities.\n\nQueenGwenevere asks,\n\nImagine what happens when an implant becomes obsolete,\n\nis no longer supported,\n\nand becomes increasingly vulnerable to hacking\n\nthe longer it remains installed,\n\nand you can't uninstall it without surgery.\n\nLike, imagine if you had the equivalent\n\nof Flash implanted in your brain.\n\nThis is actually a really deep question,\n\nand it gets to the notion that all technologies have a cycle\n\nand you wanna be able to plan for upgrades\n\nand plan against obsolescence.\n\nAt Precision, one of the ways\n\nthat we've thought about this question of obsolescence\n\nand the potential need for replacement\n\nis to develop an electrotechnology\n\nthat's based on thin films.\n\nThis is the Precision electrode array.\n\nIf I turn it on its side in this way,\n\nyou can see it's incredibly thin.\n\nThis film coats the brain's surface with electrodes\n\nrather than penetrating the brain.\n\nThe idea is that those electrodes\n\ncould be removed or upgraded over time\n\nand that other components of the implant\n\nalso can be removed or swapped out.\n\nThis notion that something\n\ncan't be uninstalled without surgery is an important notion,\n\nbut I would also just point out that surgery itself\n\nis not necessarily such a huge barrier.\n\nActually, almost everyone over the course\n\nof their life in the United States will have a surgery,\n\nif not more than one surgery.\n\nSo really it's a question of making sure\n\nthat it can be done in a safe manner\n\nrather than the concept of a surgery itself.\n\nDckill97 asks, Why can brain-computer interface technology\n\nonly read from the brain and not write to it?\n\nThe short answer is that brain-computer interface technology\n\ncan both read from and write to the brain.\n\nReading really means\n\nrecording neural activity and decoding it,\n\nrecording the electoral signals\n\nthat the brain uses to communicate\n\nand transforming those into command and control signals\n\nand ways of interaction with digital technology, computers,\n\nand the outside world.\n\nSo that's really a translation problem.\n\nThe other side of the coin\n\nis what people sometimes call writing into the brain,\n\nand that really means stimulating the brain in some way.\n\nIn the context\n\nof current-generation brain-computer interfaces,\n\nthat stimulation takes place\n\nusing electrical pulses, electrical stimulation.\n\nThose kinds of stimulation have been used\n\nto restore a sense of sensation, touch, vision,\n\nand also to stimulate the brain in other ways.\n\nMost of current generation\n\nbrain-computer interface technology\n\nreally is focused on the read and decode side of things.\n\nReading and writing or recording and stimulating\n\nare actually quite different problems.\n\nYou can't just sort of reverse the decoding into an encoder\n\nthat writes information into the brain.\n\nIt's not that simple.\n\nThe field of genomics is one good example of this\n\nin which the early 2000s saw an explosion\n\nin our ability to record\n\nor read and decode the human genome,\n\nand it wasn't until years later really using almost\n\na completely different form of technology,\n\nthings like CRISPR for gene editing,\n\nthat allowed gene modification\n\nin a scalable and programmatic way.\n\nUlteriorkid324 asks,\n\nHow do you get a brain chip into the brain?\n\nIs the surgery long?\n\nThe surgery is a relatively short surgery.\n\nGeneral anesthesia will not always be required.\n\nIt involves making a small incision in the scalp\n\nand an incision in the bone,\n\nbut not necessarily removing a significant amount of bone.\n\nIt will be an incision right about here.\n\nThe electrode array itself, you can see it's very thin\n\nand it gets slipped through an incision in the bone\n\nonto the surface of the brain.\n\nRight now, that whole process takes about an hour or two.\n\nIn the future, it probably will be a little bit quicker.\n\nWe foresee a future in which this can be done\n\nas a same-day surgery,\n\nmuch as a lot of surgery across the country is done.\n\nPiyushKThisSide asks, Think of a future\n\nwhere thoughts and feelings can be completely shared\n\nthrough a brain-computer interface,\n\nsurpassing the current limits of language.\n\nWill such a future be better or worse?\n\nI think we will eventually get to that future\n\nand I think it will be a better future.\n\nI don't exactly know how we'll get there,\n\nand I'm sure there'll be trade-offs,\n\nbut just like many forms of technology\n\nwhere you can't exactly predict what's gonna happen,\n\nI think that's the case with brain-computer interfaces.\n\nOlydriver asks, Is anybody using AI\n\nto create a better brain-computer interface?\n\nDefinitely, yes.\n\nActually, all brain-computer interfaces today\n\nuse forms of artificial intelligence\n\nas a core part of how the interface works.\n\nIt's important to understand that basically\n\nthe problem of translating neural data\n\ninto actions and interactions with digital technology,\n\nthat is a translation problem.\n\nAnd that translation between neural code and digital code\n\nrequires artificial intelligence and machine learning.\n\nBut there's so many other applications\n\nof how artificial intelligence is involved in BCI.\n\nIt's an extremely important and exciting area.\n\nChrome_Plated asks, How can I get involved\n\nin brain-computer interfaces and neurotechnology?\n\nThere are a number of ways to get involved,\n\nbut especially if you're a talented engineer,\n\nespecially if you're a software engineer\n\nor have experience in modern machine learning techniques,\n\nI would invite you to apply to work\n\nwith any of the companies\n\nthat are working in the space today.\n\nMany of them are hiring.\n\nAll right, that's it. That's all the questions.\n\nHope you learned something. Until next time.",
  "authors": [
    "Condé Nast"
  ],
  "url": "https://www.wired.com/video/watch/tech-support-neurosurgeon-answers-brain-computer-interface-questions"
}