{
  "title": "Laos methanol poisoning: Victim's brother pushes for answers",
  "text": "'Seeing friends drink shots brings back sister's methanol death'\n\n39 minutes ago Share Save Share Save\n\nZak White Zak White's sister, Simone, died after drinking a shot laced with methanol in Laos, South East Asia\n\nAt Zak White's family home you don't have to look far to spot a photo of his older sister, Simone. There are shots of graduations, holidays - typical reminders of special moments and milestones. Simone's passion, though, was seeing the world. Late last year, she headed out on what was supposed to be the trip of a lifetime, backpacking with mates in Laos, South East Asia. \"She was really excited because she was going out there to meet up with her friend Bethany [Clarke], who she hadn't seen for seven months,\" Zak tells BBC Newsbeat. He says his 28-year-old sister, a trainee lawyer, was a \"very experienced traveller\", so seeing her off was nothing out of the ordinary. The siblings' farewell was \"more just wishing her to go and have a nice time,\" says Zak. \"'See you when you're back', kind of thing.\" It was the last time he would see her.\n\n'We'll never get justice'\n\nSimone was one of six tourists who died after drinking free shots at a hostel in Vang Vieng, Laos' famous party town. It is thought those drinks were tainted with methanol, a toxic substance normally found in paint thinner but that is sometimes mixed with alcohol illegally to cut costs. Simone and Bethany started to feel unwell after their night at the Nana Backpacker Hostel, when about 100 guests were given free shots. After the friends were admitted to hospital and diagnosed with methanol poisoning, Simone's family was contacted. \"I remember my mum got told it was serious and she should go and fly out there. I remember it not kind of really feeling real,\" says Zak. Simone was eventually put on life support - but it was too late. \"Not really knowing what was going on, that was quite difficult,\" says Zak. \"I didn't think she was ever going to die.\" He says losing Simone still weighs heavy on him. \"I don't drink, but when I go out to bars and things with my friends I still get a bit nervous and anxious and PTSD when I'm at a bar and they drink shots and things,\" he says. \"It kind of brings it all back, really.\"\n\nWho is responsible?\n\nWhite Family Simone had been staying at the Nana Backpacker Hostel in Vang Vieng\n\nWhile the future of the Nana hostel remains unclear, Zak says Simone's family are no closer to getting answers about who's responsible for her death. Emails from the UK and Australian governments, seen by Newsbeat, claim charges have been proposed against 13 people in Laos. They're accused of offences linked to food safety breaches, which would not find anyone legally responsible for Simone's death. Reports have suggested the hostel is preparing to re-open with a new name. \"I can't believe it's trying to reopen,\" says Zak. \"It's taken six people's lives.\" \"I just feel sorry and worried for any young traveller that's going there, because they're almost playing Russian roulette with their lives if this hostel reopens.\" Backpackers have told Newsbeat Vang Vieng is a \"ghost town\" heading into high season, and tourism may have been affected by the deaths and investigation that followed. Newsbeat has attempted to contact the Nana Backpacker Hostel's owner and authorities in Laos for comment.\n\n'Let down' by Foreign office\n\nSimone's family say they've found themselves having to chase the UK government for new information on the investigation, with the last substantial update in May. Zak says the Foreign Office, the government department that deals with deaths abroad, could have done more. It says it's been \"working hard\" to raise awareness of the risk of methanol poisoning since last November. This has included highlighting 27 countries deemed high-risk, and working with content creators to spread messages on social media. But Zak doesn't think these steps are enough. He echoes the feelings of Simone's friend, Bethany, who has also expressed doubts about the effectiveness of the Foreign Office's campaign. \"I'd love for there to be a push from the prime minister to try and get some more information from the Laos government,\" he says. BBC Newsbeat put the family's criticisms of the government and concerns about the awareness campaign to the Foreign Office. In response, the department said: \"No family should endure what the campaigners' families, including the family of Simone White, have suffered. \"Their determination to prevent others facing the same tragedy has been instrumental in driving forward these vital updates to our travel advice.\"\n\nWhite family Zak says Simone was a \"kind and caring\" sister\n\nSimone's family remains frustrated with the lack of information from Laos. \"I think we've perhaps accepted we're not going to get answers, but that shouldn't be the case,\" says Zak. \"There's been no justice at all, really. \"We just want to know what's going on.\" His thoughts turn to Simone, and the memories that remain. \"She always wanted the best for me. She was really kind and caring and she always stood up for what she believed in,\" he says. \"Every day is really hard and challenging without her. People say it gets better with time, but it doesn't really. \"Just great sadness she's not here any more.\"",
  "authors": [],
  "url": "https://www.bbc.com/news/articles/c3dnd9pxpzeo"
}