{
  "title": "10 nuovi territori dell'Amazzonia sono stati riconosciuti come indigeni dal Brasile",
  "text": "Completano il quadro altri territori di rilievo come Comexatiba–Cahy-Pequi (Pataxó), Ypoi Triunfo (Guarani-Kaiowá), Pankará da Serra do Arapuá, Vista Alegre (Mura) e quattro aree Guarani-Mbya nella Foresta Atlantica meridionale, piccole ma decisive per preservare l’ultimo grande corridoio continuo di Mata Atlântica rimasto in Brasile.\n\nLa foresta che previene e che cura\n\nCon un solo atto, il governo ha protetto foresta, biodiversità e ha restituito dignità e diritti agli indigeni. Attualmente, in Brasile, i terreni nelle mani di queste popolazioni ammontano a 117,4 milioni di ettari, circa il 13,8% del territorio nazionale, un’area equivalente all’intera Colombia. Queste zone includono alcuni dei più grandi tratti continui di foresta pluviale del pianeta e sono abitate da centinaia di gruppi indigeni. La foresta amazzonica rimane tuttavia sotto pressione, con tentativi crescenti di rovesciare i divieti che la proteggono nonostante la sua salute sia fondamentale per rimuovere il carbonio dall’atmosfera e contrastare il riscaldamento globale.\n\nConsapevole della tanta strada ancora da fare, e preoccupato dei possibili stop and go dei futuri governi, Telmo Ribeiro Paulino spiega a Wired che “per noi indigeni le demarcazioni sono importanti per mantenere intreghi la nostra cultura, i nostri costumi e le nostre tradizioni. Senza terreni non abbiamo vita, né educazione, né salute”. Come rappresentante del popolo Macuxi dello stato di Roraima, Paulino sottolinea poi il ruolo che il suo e tutti gli altri popoli indigeni possono giocare nell'aiutare il Brasile a preservare il pianeta e l'Amazzonia, assicurandone una gestione sana e saggia.\n\nSecondo uno studio condotto dall’Articolazione dei popoli indigeni del Brasile (Apib), dall’Istituto di ricerca ambientale dell’Amazzonia (Ipam) e dal Comitato indigeno sui cambiamenti climatici (Cimc), l’espansione delle demarcazioni potrebbe prevenire fino al 20% di ulteriore deforestazione e ridurre le emissioni di gas serra del 26% entro il 2030. I dati confermano ciò che le comunità indigene sostengono da tempo: la loro presenza è la migliore difesa contro la deforestazione. L’annuncio fatto alla Cop30, quindi, è una conferma del ruolo centrale di questi popoli nella protezione dell’ambiente, trasformando un principio ecologico in politica concreta.​​​​​​​​​​​​​​​​",
  "authors": [
    "Marta Abbà"
  ],
  "url": "https://www.wired.it/article/terre-indigene-demarcazione-cop30/"
}