{
  "title": "Las auroras boreales iluminaron los cielos nocturnos hasta Florida. Aquí, todo sobre cómo verlas esta noche",
  "text": "CNN —\n\nUn potente estallido de energía solar, al pasar cerca de la Tierra, iluminó el cielo nocturno hasta Florida con impresionantes auroras boreales durante la noche del martes.\n\nLos tonos rojos, verdes y morados danzantes se observaron en una vasta región de Estados Unidos, e inusualmente al sur: en Texas, Alabama, Georgia e incluso Florida. Si te lo perdiste, hay otra oportunidad de verlas en algunas partes de Estados Unidos este miércoles, aunque quizás no lleguen tan al sur.\n\nEsto ocurre debido a que varias erupciones de energía solar, conocidas como eyecciones de masa coronal (EMC), han estado interactuando con el campo magnético terrestre. El Centro de Predicción del Clima Espacial emitió una alerta de tormenta geomagnética G4, de intensidad severa, para este miércoles. G4 es el segundo nivel más alto en la escala de cinco niveles. Un evento G4 fue el responsable de las auroras boreales del martes.\n\nLa foto muestra una aurora en los cielos del condado de Nelson, Virginia, el martes por la noche. Tommy Stafford\n\nLa foto muestra una aurora en los cielos de Sioux Falls, Dakota del Sur, el martes por la noche. Matthew Dux\n\nUna aurora vista en Crested Butte, Colorado el martes por la noche. Leslie Perrot\n\nQué significa una tormenta G4\n\nLas tormentas geomagnéticas ocurren cuando el viento solar atraviesa la magnetosfera terrestre. Las partículas cargadas del sol interactúan con los gases de la atmósfera terrestre y provocan las impresionantes auroras boreales, o cortinas brillantes de luz verde, roja y púrpura que ondulan por el cielo.\n\nSegún la NASA, los diferentes colores se deben a la interacción con distintos gases.\n\n😍 AURORA ALERT 😍\n\n\n\nAurora Borealis are visible at NWS Nashville! Sky conditions should remain clear for great viewing in middle Tennessee tonight, so get out and enjoy it! 🌙\n\n\n\nFor more info on space weather: https://t.co/XQppi160N9 #TNwx #MiddleTNwx pic.twitter.com/CQJFHRXVtN — NWS Nashville (@NWSNashville) November 12, 2025\n\nNo todo es belleza y asombro. Una tormenta G4 puede causar problemas de control de voltaje en los sistemas eléctricos, errores en la navegación GPS y fallas intermitentes en las comunicaciones por radio y satélite.\n\nFoto muestra una aurora en los cielos de Ankeny, Iowa, el martes por la noche. Matt Beatty\n\nEsta última ronda de erupciones solares incluye varias eyecciones de masa coronal (EMC) provenientes de un cúmulo de manchas solares activo. Shawn Dahl, pronosticador del clima espacial en el Centro de Predicción del Clima Espacial, señala que se espera una EMC adicional, aún más fuerte, al mediodía de este miércoles.\n\nEsto podría provocar más actividad auroral la noche de este miércoles, con la mayor probabilidad de observarse desde el norte de Nueva Inglaterra hasta los Grandes Lagos, el medio oeste superior y el noroeste del Pacífico.\n\nUna aurora vista en Crested Butte, Colorado el martes por la noche. Leslie Perrot\n\nSin embargo, la nubosidad será un obstáculo.\n\nLas zonas desde las Dakotas hasta el norte y centro de Minnesota, Wisconsin y Michigan podrían tener las mejores probabilidades de disfrutar de cielos despejados esta noche. La visibilidad podría verse afectada por las nubes en el noroeste, Nueva Inglaterra y el norte del estado de Nueva York.\n\nPara la mayoría de las personas, el impacto se limitará a cielos espectaculares, no a cortes de luz. Pero es un buen recordatorio de que, por muy avanzada que lleguemos a ser como sociedad, el sol sigue siendo el que manda.",
  "authors": [
    "Briana Waxman",
    "Chris Dolce"
  ],
  "url": "https://cnnespanol.cnn.com/2025/11/12/clima-y-tiempo/auroras-boreales-eeuu-florida-trax"
}