{
  "title": "‘How Are They Weapons? That’s Only a Flashlight!’",
  "text": "On the morning of August 6, 2019, merchants along Apliu Street unbolted the padlocks to their metal stalls and heaved open the heavy gates to their stores. They had resumed their place in the solar system of Hong Kong’s local economy—selling everyday items at bargain prices. At the far end of the street, a saleswoman fussed with her stock of flashlights and laser pointers. Throughout the day, the street hummed with pedestrians. That evening, Keith Fong, a 20-year-old college student at Hong Kong Baptist University, arrived to peruse the wares. It was boiling hot, and Fong was dressed in the uniform of the young: untucked dark tee, black shorts, and sneakers.\n\nIf the merchants had remained closed that day, no one would have blamed them. The day before, the city had shuddered to a halt as citizens set off the biggest labor strike in half a century. They had organized to fight a proposed amendment to Hong Kong’s extradition law. That change, citizens feared, would give China the chance to further meddle with the city's criminal justice system. Hong Kongers blocked roads with metal barriers and trash. Young people sprawled across the entrances of subway cars, jamming doors open and stopping entire train lines. Teachers skipped school; lifeguards and construction workers called in sick. Hong Kong International Airport grounded more than 200 flights, as many air traffic controllers failed to show up to work.\n\nThis anger had simmered for decades. Since July 1, 1997, when Britain transferred its colony of Hong Kong to China, the central government in Beijing has eroded boundaries and protections designed to safeguard Hong Kong’s government, which operated, ostensibly, as part of “one country, two systems.” Beijing refused to grant democratic elections that many citizens felt had been promised in the constitution.\n\nKeith Fong was an activist and the leader of one of the student unions in the city. As a child, he had lived in the Sham Shui Po district, amid the dense warren of crumbling cement tenements, where families from Pakistan squeezed into 200-square-foot apartments next door to refugees from Nigeria. Fong was quick, intense, and driven. Students elected him to the post as a freshman. Now, about to start his second year, he was preparing to recruit new blood to the union’s various councils, executive committees, and editorial offices.\n\nThis article appears in the July/August 2022 issue. Subscribe to WIRED Photograph: Jessica Chou\n\nFong stopped at the booth on Apliu Street that sold flashlights and lasers and talked with the saleswoman about the features and strengths of various models. He bought 10 laser pointers the size of handheld flashlights. Each beamed a vivid blue. Fong would later say that he went to Apliu Street to prepare for a student orientation activity. The laser pointers, he would insist, were meant to help new students gaze at the stars.\n\nWith his purchases secured in a white plastic bag, Fong headed toward a nearby 7-Eleven to buy cigarettes. When he was just outside the shop, a man in plain clothes flashed an ID. “Police. Stop.”\n\nMost of the world remembers images from Hong Kong in the summer of 2019: the young people in black packed into streets as Molotov cocktails flew overhead, the police smashing their batons, the clouds of blinding tear gas. Today, three years after the protests, Hong Kong is a city suppressed. During the Covid pandemic, government orders kept people home and gave police incentive to stop and search anyone not wearing a mask properly. After Omicron ripped through nursing homes earlier this year, the government continued to ban groups larger than four from gathering in public places.",
  "authors": [
    "Suzanne Sataline"
  ],
  "url": "https://www.wired.com/story/hong-kong-protests-things-they-carried/"
}