{
  "title": "The remastered Tomb Raider trilogy destroyed my nostalgia goggles",
  "text": "is a reporter who covers the business, culture, and communities of video games, with a focus on marginalized gamers and the quirky, horny culture of video game communities.\n\nI have been waiting for Tomb Raider I-III Remastered for 21 years. That’s when I first played the second entry in the series, it having been a “gift” from my mother’s boyfriend who gave me both his PlayStation and a handful of games — sans jewel cases — for no other reason than wanting to free up some space in his closet. I played it ceaselessly, enamored with the game’s action and puzzles and the fact it was the first game I ever owned that starred a woman. But after reconnecting with the Tomb Raider II portion of Aspyr’s remaster, I’m left asking: what in the natural hell was 15-year-old Ash thinking?\n\nPlaying Tomb Raider II on the Switch — it’s also available on Xbox, PC, and Playstation — was an exercise in self-flagellation, with the game’s controls responsible for 85 percent of my issues. I think I’m too inured with the conventions of “modern” 3D platformers to feel anything but frustration with this remake. Even with the remaster’s improvement of being able to remap buttons, choose between the original’s tank controls or what the game calls “modern” controls, and control finer settings like sensitivity and dead zones, Lara still moves like a clunky, awkward mess. There were often times when Lara or her camera simply did not move the way my button presses demanded for seemingly no good reason. This is a platformer, I’m not going to have very much fun if I can’t see where I am platforming, thank you very much!\n\nDespite that, during the moments where Lara behaved predictably, I could feel my love for the game creeping back in. In this remaster, everything remains the same right down to secret locations, key item placement, and enemy patterns. Even the graphics can remain unchanged; should you choose, a quick button press swaps from newer upscaled textures to the old-school PSX graphics.\n\nF this tiger specifically. Image: Aspyr\n\nIt felt good to turn down a random path and find one of each level’s three secrets still waiting for me as it did when I first discovered it by accident over 20 years ago. It also felt really good to whip out my pistols to finally defeat a duo of tigers that frequently took me by surprise when I was a child.\n\nTomb Raider II was and remains very good at building a tense atmosphere. Through music and sound effects, the game expertly instills suspense and dread, creating an oppressive aura of danger a treasure hunter like Lara Croft should feel. Enemies crash through glass windows; the silence of a cave is suddenly interrupted by roaring, bloodthirsty tigers; or the quiet beauty of an opera hall is ruined by rolling boulders a la Indiana Jones. This game scared the shit outta me when I was 15, and after more than 20 years, it still inspires that same level of anxiety. Even though I now know to expect something to come out of the game’s absurdly poor lighting, it still manages to find ways to surprise and terrify me.\n\nSwitching between “classic” and “modern” graphics reveals just how much improvement Aspyr put into fixing the original trilogy’s atrocious lighting. Gif: Aspyr\n\nI never officially completed Tomb Raider II as a kid. It was my first “modern” game on a “modern” console and proved simply too difficult and scary for me to complete. Despite that, I loved that game. I played the first few levels over and over and would sometimes skip to later levels with cheat codes before the difficulty spike (and the fear) made me nope out.\n\nTomb Raider II was a title that transformed me from a girl who was forced to play video games with her male cousins to someone who had such a joy and a zeal for the art form, that she would make it her profession. But now that I’m older and wiser — and with a lot more than just the scant handful of games 15-year-old Ash had to play — I’m forced to confront my inner child with her ardent, undiminished love for this game and ask her, “Damn, you lived like this?”\n\nTomb Raider II was exactly as I remembered it — but what didn’t return was my affection for it.\n\nTomb Raider I-III Remastered is out now on the Switch, Xbox, PlayStation, and PC.",
  "authors": [
    "Ash Parrish"
  ],
  "url": "https://www.theverge.com/24072931/tomb-raider-1-3-remastered-game-review"
}