{
  "title": "4 People Indicted in Alleged Conspiracy to Smuggle Supercomputers and Nvidia Chips to China",
  "text": "US authorities allege four people based in Florida, Alabama, and California conspired to illegally ship supercomputers and hundreds of Nvidia GPUs to China as recently as July. The charges, which were unsealed in federal court on Wednesday, are part of a wider government effort to crack down on the smuggling of advanced AI chips to China.\n\nOver the past few years, the US has introduced a series of export control rules designed to prevent Chinese organizations from acquiring computer chips that have become popular for developing AI chatbots. The restrictions aim to slow China in what US officials have described as a race to develop powerful AI systems, including surveillance tools and autonomous weapons. Some Chinese companies have been forced to make do with older or less capable chips, but others have allegedly turned to smugglers.\n\nThe new indictment alleges that Hon Ning Ho, Brian Curtis Raymond, Cham Li, and Jing Chen worked together to buy Nvidia chips through a sham real estate company in Florida and then resold them to Chinese companies. The hardware was allegedly shipped to China using doctored customs paperwork by way of Thailand and Malaysia, two countries that US regulators have identified as hot spots for chip smuggling.\n\nProsecutors allege that the defendants exported about 400 Nvidia A100 GPUs and attempted to smuggle about 50 of Nvidia’s newer chips, known as the H200. The defendants are also accused of trying to export about 10 Hewlett Packard Enterprise supercomputers containing Nvidia H100 chips.\n\nTwo undisclosed Chinese companies allegedly paid the defendants nearly $3.9 million in total for their efforts, according to the indictment, which was first reported by Court Watch.\n\n“This is an extremely serious offense. At the time these were being exported, these were Nvidia’s most advanced chips,” federal prosecutor Noah Stern told magistrate judge Kandis Westmore in an Oakland, California, courtroom on Thursday. Stern explained that the semiconductors could be used by the Chinese government in military, surveillance, disinformation, and cybersecurity applications.\n\nStern said that authorities arrested the four defendants on Wednesday. He said that Ho, whom he described as the ringleader, is now in custody along with Chen and Li. Raymond, who ran a company reselling Nvidia chips, is not being detained, Stern said. Amy Filjones, a spokesperson for the US attorney’s office in Tampa, Florida, said Raymond has been released on bond.",
  "authors": [
    "Paresh Dave"
  ],
  "url": "https://www.wired.com/story/smuggling-supercomputers-china-nvidia-indictment/"
}