{
  "title": "Kate Winslet's Unexpected Wardrobe Glitch With King Charles",
  "text": "LOADING ERROR LOADING\n\nKate Winslet nearly had quite the royal mishap the first time she met King Charles.\n\nThe “Titanic” actress met the then-Prince Charles at a premiere decades ago, when she said it hadn’t quite occurred to her that she was going to be in the company of a royal.\n\n“He’s a very gentle, personable individual, but he is the king, and it’s quite something to meet him,” Winslet said during an appearance on “Jimmy Kimmel Live!” on Tuesday.\n\nAdvertisement\n\nKate Winslet and King Charles meet again on June 12 — many years after their initial meeting. WPA Pool via Getty Images\n\n“The first time I met him ― oh my goodness ― he had come to support the premiere, it was a royal premiere, of ‘Sense and Sensibility,’” Winslet said, adding that she was “only 20” at the time.\n\n“I sort of hadn’t realized that we were really going to meet him, and so I forgot about the fact that I was wearing a kind of, a transparent lace outfit,” the “Avatar” actor shared.\n\nAdvertisement\n\n“And thank god I had worn a coat because as he is making his way towards me, I’m like, ‘Nipples, nipples, nipples, oh my GOD!’” she said. “And someone just went, ‘Coat!’ and I went, ‘Your Majesty!’ basically covering myself in a cape.”\n\nWhile people are often nervous to meet members of the royal family, Prince William once spoke about a celebrity interaction that still leaves him “cringing” when he thinks about it.\n\nAdvertisement\n\nDuring an episode of Apple Fitness+ series “Time to Walk” back in 2021, William spoke about a night when he was watching Jon Bon Jovi perform, while the prince was sitting next to Taylor Swift.\n\n“Little did I think what was going to happen next. I’m sat next to Taylor Swift. She’s on my left. And after Jon does his first song, there’s a pause, and she turns to me,” the royal said. “She puts her hand on my arm, looks me in the eye and says, ‘Come on, William. Let’s go and sing.’”\n\nThe prince said that “To this day, I still do not know what came over me.”\n\n“Honestly, even now I’m cringing at what happened next, and I don’t understand why I gave in,” he said, adding the caveat that “if Taylor Swift looks you in the eye, touches your arm and says, ‘Come with me,’ you basically do what she says.”\n\nAdvertisement\n\nTaylor Swift, Jon Bon Jovi and the Duke of Cambridge perform during the Winter Whites Gala on Nov. 26, 2013, in London. Ben Pruchnie/Centrepoint via Getty Images\n\nThe royal said that he then “walked up on stage in a trance,” but woke up “sort of halfway through Jon Bon Jovi’s ‘Livin’ on a Prayer’ song.”\n\n“I’m thinking to myself, ‘Am I standing on the stage singing “Livin’ on a Prayer” when I don’t even know the words?’” he said.\n\nAdvertisement",
  "authors": [
    "Senior Reporter"
  ],
  "url": "https://www.huffpost.com/entry/kate-winslet-king-charles-wardrobe-mishap_n_691f50efe4b047290e292418?origin=home-zone-d-unit"
}