{
  "title": "Charlotte officials say Border Patrol operation has ended, but DHS insists immigration enforcement will continue",
  "text": "The dayslong immigration crackdown that arrived in Charlotte, North Carolina, last week appeared to end with the same level of confusion it began with, as local officials announced the operation concluded Thursday while federal officials refuted those claims.\n\nEarlier Thursday, Mecklenburg County Sheriff Garry McFadden issued a statement saying the federal immigration enforcement operation in the city had ended. But moments later, a top Department of Homeland Security official rejected that characterization.\n\nDHS dubbed the operation in Charlotte, which led to over 370 arrests, “Operation Charlotte’s Web.” Over more than five days, enforcement actions disrupted life across the city, resulting in business closures, children kept out of school, and widespread fear in the community.\n\nAt the helm of the operation was top Border Patrol official Gregory Bovino, who, along with some of his federal agents, left Charlotte Thursday, according to a Homeland Security official, fueling confusion about the state of the operation.\n\nShortly after the sheriff’s statement was released, Homeland Security Assistant Secretary Tricia McLaughlin said, “Wrong. Operation Charlotte’s Web isn’t ending anytime soon.”\n\nCNN has reached out to DHS for clarification on the operation’s status. The Mecklenburg County Sheriff’s Office says it stands by its statement.\n\nImmigration enforcement will continue in the area, similar to what happened in Chicago after Bovino and his team departed, other law enforcement officials said.\n\nBovino and his agents are expected to launch an operation in New Orleans after the Thanksgiving holiday, as early as December 1, continuing the recent focus on city-specific immigration enforcement operations.\n\nCharlotte Mayor Vi Lyles said in a post following McFadden’s announcement that she is “relieved for our community,” and urged the city to “come together” as they move forward.\n\n“We will continue to build relationships, mend bridges, and listen to the voices of everyone in our community,” McFadden said in a statement Thursday. “As we move forward, I want the city of Charlotte to know, I will keep fighting for clarity, accountability, and trust.\n\nFederal agents leave behind a city rocked by fear and confusion\n\nIn the few days that federal agents focused their immigration enforcement crackdown on North Carolina’s largest city, fear and confusion swept through the Charlotte community.\n\nCharlotte teacher Jamie Roldan told CNN’s Gustavo Valdes she had been getting questions from students such as, “What is going to happen if I go home and my parents aren’t there?” and “What does that mean if my parents get taken away?”\n\nShe described having only nine students show up on one day this week, as parents were afraid to send their children to school or, in some cases, parents with legal status drove the children of undocumented parents to class.\n\nMore than 30,000 students — about 20% of district enrollment — were absent from Charlotte-Mecklenburg Schools on Monday as the Department of Homeland Security’s immigration enforcement mission in Charlotte continued, the district said, citing updated data from the beginning of the week.\n\n“We just understand that they were not in school receiving education, advancing their social skills and we know that there was an impact to those homes where parents had to modify their work schedules,” Charlotte Mayor Pro Tem Danté Anderson told CNN Wednesday. “They had to have an economic impact out of fear that something would occur at those schools.”\n\nWhen a CNN crew in a black SUV was parked near a school this week, an official asked them to move their vehicle because it resembled a CBP vehicle and was frightening parents picking up their children.\n\nOne nonprofit estimates about half of the mom-and-pop businesses it works with have closed at some point during the immigration crackdown.\n\nA family-run Colombian bakery, which has closed only once in its 28-year history, closed last week, with the family unsure of when it will reopen.\n\nWhile some in the community are expressing relief that the operation may be over, others remain skeptical.\n\nThe Carolina Migrant Network, a nonprofit that provides legal services to people in removal proceedings, warned the community not to “let your guard down” as ICE is still operating in the area and other parts of the state.\n\n“CBP might be leaving but ICE is still here!” the group said in an Instagram post.\n\nCharlotte and Chicago could help New Orleans prepare\n\nWhile the Charlotte operation appears to have concluded, an immigration enforcement operation in New Orleans is expected as early as December 1.\n\nSome in Charlotte’s community adopted tactics they saw activists use in Chicago, such as watching for raids, blowing warning whistles, and carrying signs advising people of their rights. In Charlotte, some also stood outside the entrance of a local ICE processing facility to block federal agents, a method frequently seen at the Broadview ICE facility near Chicago.\n\nBoth cities quickly mobilized to train community members on how to respond if they saw an immigration raid or ICE presence.\n\nCharlotte was a departure from what is typical in these operations, notably being much shorter — at less than a week — than the operation in Chicago, which started in early September.\n\nThe operation also took Charlotte by surprise, as President Donald Trump had not mentioned the city as a target. In contrast, while local and state officials in Chicago said federal officials hadn’t shared details about the operation or its timing, Trump frequently named Chicago as a target for a federal crime crackdown.\n\nThe focus now appears to be shifting to New Orleans, a city President Trump considered sending the National Guard to as early as September. New Orleans would be one of the first Democratic-led cities in a Republican-led state targeted for an immigration enforcement operation. CNN has reached out to local and state officials to see how they are preparing for the potential operation.",
  "authors": [
    "Dianne Gallagher",
    "Priscilla Alvarez",
    "Taylor Romine",
    "Chris Boyette"
  ],
  "url": "https://www.cnn.com/2025/11/20/us/border-patrol-charlotte-gregory-bovino"
}