{
  "title": "Verizon is laying off over 13,000 workers",
  "text": "Team,\n\nThank you for the many messages you’ve shared about the work we need to do to strengthen our company. I appreciate your ideas and candor. The pride you have for the role that Verizon plays in people’s lives is abundantly clear, as is your desire for us to lead the industry.\n\nAs I shared at our most recent all-employee meeting, we need to change and evolve as a company to meet the needs of our customers and expand our market leadership. Our current cost structure limits our ability to invest significantly in our customer value proposition. We must reorient our entire company around delivering for and delighting our customers.\n\nAs a customer-first culture, we have to align our teams and resources to create new value for customers and build a faster, stronger and more proactive Verizon. To do that, we must simplify our operations to address the complexity and friction that slow us down and frustrate our customers.\n\nToday, we will begin reducing our workforce by more than 13,000 employees across the organization, and significantly reduce our outsourced and other outside labor expenses. We deeply value their contributions and are committed to providing comprehensive resources to support our employees throughout this transition. Every part of the company will experience some level of change, and we will have conversations with every affected employee to ensure they are treated with the utmost respect and care.\n\nChanges in technology and in the economy are impacting the workforce across all industries. We see it in our families and within our communities. To help our people prepare for their future, we have established a $20 million Reskilling and Career Transition Fund for employees departing Verizon. This fund will focus on skill development, digital training and job placement to help our people take their next steps. Verizon is the first company to set up a fund to specifically focus on the opportunities and necessary skill sets as we enter the age of AI. It is my intent to also work with other companies and the public sector to address the opportunities and challenges in a world where technology will impact all of us.\n\nChange is necessary, but it can be difficult—especially when it affects valued teammates. It’s important that we direct our energy and resources to set Verizon on a path to success. The actions we’re taking are designed to make us faster and more focused, positioning our company to deliver for our customers while continuing to capture new growth opportunities. Being a customer-first, cost-conscious culture will be a way of life for us. And each of us is responsible for living up to that commitment.\n\nIn the coming weeks, your leaders will share new organizational structures and priorities that align with our direction as a company. As we make these changes, we must work together to ensure we end the year strong, with a running start to 2026. The fourth quarter is an extremely important one for us, so I appreciate everyone bearing down to make it a great one, even in the face of change.\n\nOur future will be defined by how we lead from here — with clarity, focus and a shared vision to win in the market and deliver meaningfully for our customers, shareholders and each other. To those colleagues who will be leaving, thank you for your many contributions. To those continuing with us, I appreciate your continued commitment as we build a stronger Verizon together.\n\nDan",
  "authors": [
    "Emma Roth"
  ],
  "url": "https://www.theverge.com/news/824970/verizon-layoffs-13-percent-employees"
}