{
  "title": "The ‘Great Meme Reset’ Is Coming",
  "text": "Memes are getting a reboot. Not like a Marvel-is-trying-to-make-Fantastic Four-happen-again reboot. More like a rewind. The Great Meme Reset of 2026, as it’s being called on TikTok, demands that on January 1 all memes revert to their 2010s glory days. Bland “brain rot” and AI-looking memes are out; Big Chungus is in.\n\nAs with anything on the internet, the origin of the Great Meme Reset is hard to place. Most sources point to a March post from TikTok user @joebro909 that called for a whole new generation of memes to save the platform from the “drought” that had engulfed it in the spring. The post said nothing of a January 1 launch date, or a return to the memes of the last decade, but the idea was planted. Now hundreds of posts are discussing the reboot—and a return to the internet’s “dank” era.\n\nWhich implies, of course, that memes lack dankness these days. If anything, Gen Z– and Gen Alpha–fueled internet culture has prided itself on somewhat meaningless content like “6 7” and absurdist, seemingly AI-generated “Italian brain rots,” but after nearly a year of memes with little humanity or depth, a backlash has begun.\n\n“Because of just how unrecognizable memes have become,” TikTok creator Noah Glenn Carter (@noahglenncarter) said in a recent video, “everyone has come to an agreement that on January 1, 2026, we are going to completely reset all memes and go back to the originals.”\n\nWhen I reach Carter via email, the creator seems pretty convinced the reset idea could take off, and he plans to make more videos promoting it. “The memes we have now are called ‘brain rot’ for a reason,” Carter says. “The ones 10+ [years older], most of the time, had a story behind them. Or they at least made sense. Now it just seems like the more random and incoherent something is the more likely it is to become a meme.”\n\nEven if you’re in the camp that understands memes like “6 7” have more significance than they’re given credit for, there’s still a sense amongst the Great Reset crowd that today’s memes are “oversaturated and unfunny,” says Know Your Meme editor-in-chief Don Caldwell. “In this context, brain rot memes are low-effort and nonsensical,” Caldwell adds, “and there's a desire to return to the memes of the past that had a bit more substance.”\n\nSubstance, as ever, remains a relative notion. Nyan Cat perhaps didn’t have the substance of an Andy Warhol image, but both sought to comment on cultural moments—and both got people talking in a way 2025’s deluge of AI slop could never. Taken at face value, a call for a massive meme reset is also a call for organic internet culture, no matter how seemingly silly.",
  "authors": [
    "Angela Watercutter"
  ],
  "url": "https://www.wired.com/story/the-great-meme-reset-is-coming/"
}