{
  "title": "Portrait of Elisabeth Lederer: Why this mysterious Klimt painting sold for $236m",
  "text": "Hidden for decades from public view, the artist's Portrait of Elisabeth Lederer has now sold at auction for a record sum. Why is it so valuable?\n\nA mysterious and relatively little-known painting by Gustav Klimt is now the most expensive work of modern art ever to sell at auction and the most expensive ever to be sold by Sotheby's. The teasingly complex canvas, a full-length portrait of Elisabeth Lederer, the daughter of the Austrian artist's most committed patrons, fetched $236.4m (£180m) in New York on 18 November, far outpacing the price paid two years ago for Klimt's Lady with a Fan, 1917-18, which broke records when it sold for $108m (£82m) in London in 2023, making it the most expensive painting ever sold at auction in Europe.\n\nThe sale saw Klimt's canvas pass Andy Warhol's portrait of Marilyn Monroe, Shot Sage Blue Marilyn, 1964 (which sold at Christie's in New York in 2022 for $195m), to become the second priciest work of art ever to go under the hammer, behind Leonardo da Vinci's Salvator Mundi (Saviour of the World), c 1500, which sold in 2017 for $450.3m (£343m). But what is it about this nearly 2m-tall likeness of a 20 year-old heiress, whose eerily elongated figure seems to chrysalise in a cocoon-like gown of shimmering white silk, that commands such a jaw-dropping price tag?\n\nOn its surface, Bildnis Elisabeth Lederer (Portrait of Elisabeth Lederer), 1914-16, may seem to lack the overt opulence of better-known paintings from Klimt's so-called \"Golden Period\", the era in which he produced such glimmering works as his Portrait of Adele Bloch-Bauer I, 1907, and The Kiss, 1907-8. Where those sumptuous masterpieces glisten with the glamour of the Vienna Secession (the influential movement emphasising artistic freedom that Klimt helped found), the lyrical likeness of Lederer, created in the last years of the artist's life (Klimt died in 1918, aged 55), pulses with a more psychologically teasing intensity. The canvas's aesthetic riches are copious, if more concealed.\n\nAlamy Klimt's Portrait of Elisabeth Lederer,1914-16, is now the most expensive painting by the artist (Credit: Alamy)\n\nSeized by Nazi officials, who confiscated the Lederer's vast collection of Klimts after Austria's annexation in 1938, the portrait resurfaced into the market in the early 1980s. It was then that it entered the private holdings of the billionaire heir to the Estée Lauder cosmetics fortune, Leonard A Lauder, who died in June 2025. Hidden for decades from public view, the portrait has, in a sense, been biding its time, waiting to return to the spotlight. Whatever the price tag, the mysterious work is poised finally to reveal its secrets. Its extraordinary story blurs fact and symbolism into a richly charged visual tapestry whose intrigue extends into and outside the painting's surface.\n\n'Culturally complex details'\n\nUndertaken in the opening years of World War One, the portrait's prismatic exaltation of Lederer – the daughter of August and Serena Lederer, one of Vienna's wealthiest Jewish families – can be read as the last glorious gasp of the Golden Age from which it emerged. At first glance, the elaborate array of deceptively ornamental East Asian-influenced motifs – that orbit the young woman in a dazzling timeless stage of celestial blue – and the implosive calm of her dark eyes transport us from the accelerating turmoil of European history, transcending time and place. The audacity of gold on which Klimt previously relied has not so much disappeared as been transmuted, in a kind of reverse alchemy, into a fearlessness of vibrant, evocative colour that borders on the boldness of Expressionism.",
  "authors": [],
  "url": "https://www.bbc.com/culture/article/20251118-why-klimts-portrait-of-elisabeth-lederer-painting-sold-for-150-million-dollars"
}