{
  "title": "Angoulême comics festival in crisis as creators and publishers declare boycott",
  "text": "One of the world’s most prestigious comic book festivals is under threat of cancellation after leading graphic novelists and publishers announced they would boycott the event and the French government withdrew a tranche of its funding.\n\nIn the biggest crisis in its illustrious history, the Angoulême festival of la bande dessinée (comic strip) may not take place in 2026 after claims of toxic management and the dismissal of a member of staff who had lodged a rape complaint.\n\nThe festival, held annually in the small western French city, hands out some of the global comic industry’s most coveted prizes. In France, bandes dessinées, known as BD, are lauded as the “ninth art” and are popular among adults as well as younger readers.\n\nAnnouncing she was withdrawing €200,000 (£176,000) of public subsidies for the event until a shake-up in the way it was run, the culture minister, Rachida Dati, said on Tuesday she hoped the 2026 festival would nonetheless go ahead. She had invited those boycotting it to a meeting, she added.\n\nThe culture ministry said on Wednesday it was hard to see it happening as scheduled in late January if the boycott was maintained. “Realistically, if there are no authors or publishers, it’s hard to see how the festival can happen in 2026,” a spokesperson said. “We are at a turning point in the history of the festival, which is in difficulty and in danger.”\n\nView image in fullscreen Cancelling the festival would be ‘a catastrophe’ for the area in ‘an already fragile economic situation’, said the local MP, Caroline Colombier. Photograph: Yohan Bonnet/AFP/Getty Images\n\nThe row centres on the way the festival, first held in 1974, is managed and organised. It is run by a non-profit association but has been put on by the private company 9eArt+ since 2007.\n\nFranck Bondoux, the director of 9eArt+, announced he was stepping down last week after it was reported that a female member of staff had been fired after going to the police to report a rape during the 2024 festival.\n\nThe woman’s sacking outraged writers, cartoonists and publishers. On Sunday, 285 female authors published a letter of support for her, and called for a “girlcott” of the festival on social media. Critics are also deeply unhappy with 9eArt+, claiming a lack of transparency in its organisation of the event. Bondoux has denied the allegations over his management.\n\nThe boycott came after the company’s association with the festival was renewed beyond 2027. Among those who have threatened to stay away in 2026 are the prize-winning comic book authors Riad Sattouf, Maus creator Art Spiegelman and last year’s winner of the grand prix of the city of Angoulême, Anouk Ricard.\n\nA letter signed by 22 former winners of the festival’s top prizes said: “It is high time to turn the page on 9eArt+ so the festival can regain the values that helped build its international reputation with new operators.”\n\nIt had been hoped that Bondoux standing down would calm critics, but the French national publishing union, which represents 24 major publishing houses, said in a statement on Wednesday: “Given this large-scale movement [to boycott], which they understand, publishers believe the 2026 edition can no longer go ahead.”\n\nCaroline Colombier, the local member of parliament, said cancelling the event would be “a catastrophe” for the local area in what she said was “an already fragile economic situation”.\n\nskip past newsletter promotion Sign up to Headlines Europe Free newsletter A digest of the morning's main headlines from the Europe edition emailed direct to you every week day Enter your email address Sign up Privacy Notice: Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on theguardian.com to send you this newsletter. You can complete full registration at any time. For more information about how we use your data see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nView image in fullscreen The author Riad Sattouf, who had an exhibition at the festival in 2024, is among those threatening to boycott the 2026 event. Photograph: Yohan Bonnet/AFP/Getty Images\n\nThe Angoulême public prosecutor’s office has opened an investigation into the rape complaint. The woman has also taken her case to the Paris industrial tribunal to contest her dismissal, which she said was a consequence of the complaint.\n\n9eArt+ said it had fired the employee for “serious misconduct” shortly before the end of her probationary period due to “behaviour incompatible with the image of the company”.\n\nIn February Bondoux told Le Parisien her dismissal was “in no way related to what may have happened in terms of an alleged rape. We were not aware of this when we decided to dismiss the individual.”\n\nHe added: “The company did not fail in its obligations … Of course, we accept and hear the employee’s account of being raped, but these events took place outside the company.”\n\nResponding to criticisms of the management culture at 9eArt+, Bondoux said: “Who is talking about toxic management? An unsourced statement … If that were the case, action would have been taken by employees.”",
  "authors": [
    "Kim Willsher"
  ],
  "url": "https://www.theguardian.com/books/2025/nov/20/angouleme-comics-festival-crisis-boycott-funding-france"
}