{
  "title": "Appeals court blocks order to release immigrants arrested in Illinois immigration crackdown",
  "text": "A federal appeals court paused the release of hundreds of immigrants who were arrested during the Department of Homeland Security’s aggressive immigration actions in the Chicago area earlier this year, according to a court filing Thursday.\n\nLast Wednesday, US District Court Judge Jeffrey Cummings ordered the Trump administration to release on $1,500 bond hundreds of detainees after he determined the arrests violated a local consent decree barring warrantless arrests of immigrants.\n\nCourt records showed last Friday the Department of Justice submitted a list of more than 600 people to be assessed for release. The list showed only a fraction of those detained were considered “high risk” by federal officials.\n\nThe list included criminal histories for just 16 defendants. Those criminal histories included convictions or arrests for aggravated assault, driving under the influence, indecent exposure, battery and enticement of a minor and kidnapping.\n\nA CNN analysis of the DOJ filing showed migrants arrested in the Chicago area were transferred to detention facilities as far away as Texas and Kentucky.\n\nThe 7th Circuit Court of Appeals on Thursday sided with the Trump administration to keep those on the list in custody, just one day before detainees were set to be released.\n\nTensions between the Trump administration and local leaders, protesters and journalists in Chicago and Illinois have boiled over since Operation Midway Blitz got underway over the summer. The government is fighting a multi-front legal battle as groups challenge agents’ use of force on demonstrators, treatment of media and clergy, and warrantless detentions.\n\nThe federal immigration crackdown has drawn pushback from community members concerned about the potential for racial profiling and constitutional rights violations – for both documented and undocumented people – as the mass deportation agenda has swept up people of all ages, from children and families to suspected criminals, by making arrests at Home Depots and farms, outside courtroom hearings, during traffic stops and in workplaces.\n\nIn its request to pause the release of migrants, the Trump administration argued Judge Cummings’ orders in the case incorrectly interpreted the law, exceeded the scope of the consent decree and the court’s “legal and equitable authority” and infringed upon the immigration officers’ ability to operate.\n\nThough the appeals court did not explain why it sided with the Trump administration in the detention case, its decision comes just a day after a three-judge panel with the 7th Circuit blocked a different judge’s order because they believed the judge had overstepped their authority by imposing strict limits on how federal agents could operate in Chicago.\n\nIn that ongoing case, US District Judge Sara Ellis responded to concerns from demonstrators, clergy and media about federal agents’ escalating crowd-control methods. Ellis prohibited agents from using several types of force, issued detailed requirements for body cameras and identification, and ordered the government to produce reams of internal records.\n\nEllis called the Trump administration’s claims of rampant violence and obstruction in Chicago “not credible” in a written order released Thursday.\n\n“Defendants would have people believe instead that the Chicagoland area is in a vise hold of violence, ransacked by rioters, and attacked by agitators – which justifies the unprecedented swath of indiscriminate uses of force unleashed on journalists, peaceful protestors, and religious practitioners. That narrative simply is untrue.”\n\nBoth cases under judges Cummings and Ellis are still ongoing. The 7th Circuit will hear oral arguments in the case on migrant detentions on December 2.\n\nThe National Immigrant Justice Center and the American Civil Liberties Union, the lead attorneys in the class-action lawsuit, said they are “deeply disappointed” by Thursday’s decision.\n\n“The Seventh Circuit stay means that Chicago-area families will face, at minimum, weeks more separation, and people will continue to languish in inhumane immigrant detention centers, at risk of deportation without due process. This is especially sad given that families already have been separated from loved ones for weeks,” the organizations said in a joint statement.\n\nEven after Judge Cummings’ order paved the way for detainees’ release, the fate of those in custody remained unclear. Several of those arrested had filed their own individual cases, and some, according to the DOJ filing, were already released.\n\n﻿Of the 3,000 people arrested between June and October, 615 – one-fifth – are not subject to mandatory detention and don’t have final orders of removal, according to Cummings’ ruling. The judge had ordered that those who remain detained out of that group, as long as they don’t pose a high public safety risk, must be granted bond by noon on November 21.\n\nMultiple attorneys CNN spoke with were unsure how Cummings’ ruling would impact their clients who were transferred out of Judge Cummings’ jurisdiction.",
  "authors": [
    "Whitney Wild",
    "Elizabeth Wolfe"
  ],
  "url": "https://www.cnn.com/2025/11/20/us/illinois-immigrants-release-blocked"
}