{
  "title": "This After-School Program Is A Blueprint For Trans Resistance",
  "text": "The United States currently sits on a wide spectrum of tolerance when it comes to queer and trans people. While bigotry exists in pockets of every region, it feels much more pronounced in some circles and regions.\n\nIn Florida, a so-called “Don’t Say Gay” bill formed in 2022, banning references to sexual orientation or gender identity in K-3 classroom curriculum. Since then, its effects have rippled through communities in scary ways. And so, some families choose to leave their homes and the lives they’ve been building in order to protect their children.\n\nEli, a 10-year-old transgender child, and her family recently relocated to New York City. In Florida, they often felt incredibly isolated despite having access to queer-affirming spaces. “There were groups of [parents of transgender kids], but it felt like everybody was afraid and in hiding,” says Eli’s mother, Rebeca, who asked to withhold her family’s last name due to security concerns.\n\nAdvertisement\n\nGiven the circumstances, Eli struggled academically, and the increasing anti-transgender rhetoric in schools only worsened her challenges after several incidents of discrimination, her mother explains. The “Don’t Say Gay” bill was only one of several intensifying anti-LGBTQ policies in the state and across the country that directly impacted transgender and queer students.\n\nWhen they moved from Florida to New York, they knew Eli would experience more progressive attitudes while in school. They soon also found Trans Formative Schools, an after-school program whose focus is to “center trans joy and social justice” — and it swiftly became a lifeline. A nonprofit organization that runs on donations and city funding, Trans Formative Schools is led by transgender and queer teachers. Powered by NYC Heritage of Pride, the nonprofit behind New York City’s Pride events, the after-school programming is free and open to all students regardless of their gender identity.\n\nWithin the first few months of the program, the impact it has had on Eli, her mother says, has been undeniable. “It has really been the greatest support that she’s ever had,” Rebeca says. “Her self-confidence has gone up so much, as a transgender child, and that translates to her confidence with reading and with school.”\n\nAdvertisement\n\nAdvocates across the country are concerned about efforts by conservative legislators to implement stricter measures on how to identify gender and what people of each gender can and cannot do. Schools in Florida, Oklahoma, Texas, and others have placed restrictions on whether teachers must use a student’s preferred pronouns, whether teachers have to “out” students to their families, what teachers can say in classrooms about gender identity and sexual orientation, and which bathrooms students can use.\n\nResearch has long found that gender diverse students are more likely to experience negative health outcomes than their cisgender peers due to stigma and marginalization. Gender diverse youth continue to experience higher rates of suicidal ideation, depression, anxiety and substance abuse, often because of the discrimination they may face in schools, at home or in their community. And alleviating this means working after hours to provide extra support.\n\nAdvertisement\n\nWhile a robust education in a classroom that feels safe is crucial, learning and emotional development goes beyond the classroom for queer and trans students. The blueprint for this, as it seems, is rooted in a holistic approach that shows kids that they are capable and worthy of pursuing their ambitions.\n\nSometimes, it’s as simple as doing a literary analysis of Chappell Roan’s Pink Pony Club. Other times, they’re learning about architecture to create buildings out of popsicle sticks. By building skills while leaning into their freedom of expression — including computer coding, engineering, theater and visual arts — the kids are learning that their gender and sexual identities are not a crime but instead simply a part of who they are.\n\n“The goal is to make a future where trans kids can just be kids, to make a future where trans kids get to feel safe enough to read, write and learn,” says Alaina Daniels, the co-founder and executive director of Trans Formative Schools, which is heading into its third year of programming. “It’s hard to learn algebra if you don’t feel safe in class.”\n\nAdvertisement\n\nThis idea that children cannot be their most authentic selves affects them profoundly during these formative years — and will inevitably follow them into adulthood. “How dare we strip our youth of their ability to express … and not be pigeon-holed by some binary idea of what a human should be,” says Ro Peña, the organization’s co-founder & director of programming.\n\nEli is particularly excited about the incoming robotics equipment that the program is looking to purchase this year, thanks in part to funding from the city council. “They’re just really supportive,” Eli says. “We make cool crafts. We plan for rallies. We make big rallies. We just have fun.”\n\nAdvertisement\n\nBex Fine-Firesheets, who has a 10-year-old and a 6-year-old in the program, found Trans Formative Schools after a transphobic incident with a teacher at a different after-school program.\n\n“That was a big realization for us that no matter what conversations you have, there really is a big difference between a place that has pride flags out front and celebrating queerness and transness, versus a place that isn’t so vocal about it or upfront about their support,” they tell me. “This is a place for educators, parents and children to come together and make a community surrounding learning, exploration and joy together.”",
  "authors": [
    "Producer"
  ],
  "url": "https://www.huffpost.com/entry/trans-children-support-after-school-programming_n_68c82bf6e4b04bfe9a6ef4ad"
}