{
  "title": "As Black Women, We Will Reclaim Our Reproductive Autonomy. For Me, This Is Where It Starts.",
  "text": "As a Black working mom who recently hit her 30s, I’ve had my fair share of conversations with my loved ones about my plans for more kids. None of them have ever included the option of freezing my eggs so I could give myself a little time before deciding if I want to expand my family. I also have had countless conversations with close friends without kids who express a fear of waiting “till it’s too late.” And none of us have ever brought up the idea of getting tested to find out our egg count. But recently, all of that has changed.\n\nA clip posted by Good Moms Bad Choices, a podcast geared toward addressing taboos and stigma in Black motherhood and womanhood, shed light on the disparity that exists between Black women and our white counterparts when it comes to awareness of our fertility options. In the clip, fertility expert and reproductive justice advocate Dr. Raquel Hammonds discusses a trend among white women who take advantage of health care services meant to position them better to get pregnant later on in life. This sometimes happens early on in women’s lives through the guidance of their mothers. But this awareness and encouragement doesn’t necessarily exist among Black women for so many reasons.\n\nAfter watching this clip, I couldn’t help but consider how little thought I’d ever given egg freezing. In the back of my mind, I considered it was probably because of how expensive it is, but also, it never really felt like the “Black” thing to do. So many of you will feel this: When the notion of egg freezing was brought to my attention, it seemed like another luxury Black birthing people somehow don’t have access to, both financially and emotionally. I had not heard of any of the women in my life doing it, and I was also fully aware of the fact that most of the time, Black women are struggling to access adequate reproductive care on the most basic level.\n\nAdvertisement\n\nHowever, after doing some research of my own, I realized there are resources that help make sense of egg freezing — and help us figure out how to take action if we want to. And even more importantly, having access to this option allows Black birthing people to assert control over their bodies and futures. This is the motif in Hammonds’ work and online presence, and it’s incredibly empowering to find this space of safety and curiosity that she’s contributed to.\n\nWhile there is no one-size-fits-all way to approach having children past the age of 35, Black women who are deciding to hold off can benefit from considering all the possibilities that exist. But in order to even consider these options, all of us need to be made aware of the advancements in science that make it safer to have children at this phase in life. This information is intentionally hoarded by the medical system at large and is often only made accessible to rich white women, which is truly a disservice. As birthing people with more agency, we can change that.\n\nHammonds told me a little more about why these disparities exist and why it’s crucial for Black women to have more discussions about unconventional approaches to reproductive health. In our community, she says, these conversations are long overdue, especially when we consider data that shows Black women may be twice as likely to struggle with fertility issues when compared to their white counterparts but less likely to get help. “One thing I always try to just normalize is writing your own story. You don’t have to have the story of everyone else,” Hammonds says.\n\nAdvertisement\n\nThe reasons why we’re less likely to seek out and receive support when it comes to fertility planning have a lot to do with the lack of access Black women have to adequate health insurance. Racist tropes that stubbornly plague our health care system also play a huge role. One stereotype that has become more apparent due to the Black maternal mortality crisis is the misconception that Black women have higher pain thresholds. This is a terrifying contributor to why health care providers often take Black women’s pain and other symptoms less seriously. This, unfortunately, fuels Black people’s distrust of health care professionals, along with their anxiety in medical settings and overall avoidance when it comes to seeking medical help.\n\nHammonds also spoke to me about the less-publicized racial tropes that show up in our behaviors and conversations about Black birthing people. There’s a pervasive belief dating back to chattel slavery that Black women were naturally good at reproducing; it was the underpinning used to justify forced reproduction that helped maintain an enslaved workforce.\n\nWhile women of all races are well acquainted with societal pressures to reproduce, Black women have experienced these expectations uniquely. “Black women have always been seen as these baby-making machines, and so typically what has happened is that we feel this sense of shame,” Hammonds tells me. “It’s like, I’m a Black woman, I have the stereotype of being able to do this thing, and if I can’t do this thing, then there’s something wrong with me.”\n\nAdvertisement\n\nTo create change and more agency for Black birthing people, Hammonds stresses exploring all of our birthing and fertility options and seeking out profession advice from experts we trust. We can find experts who are versed in Black maternal health — they’re out here and they’ll help us move forward with confidence. We deserve all the safety and options that our non-Black counterparts have in this arena. “When you have the knowledge about your body, your fertility, your reproductive health, now you’re informed to make better decisions,” Hammonds says.\n\nAnd these conversations shouldn’t be limited to freezing our eggs. It can include ovarian reserve testing to discover your likelihood of becoming pregnant. Or it can include IVF, sperm donorship or just candid conversations how ovulation cycles affect our chances of getting pregnant. We need a culture shift, one where health care professionals make Black birthing people feel they have ownership over their bodies and experiences.\n\nBy empowering ourselves, we can set in motion a plan that removes the shame, anxiety, and uncertainty from figuring out how we want to expand our families. And we deserve that.",
  "authors": [
    "Contributing Writer"
  ],
  "url": "https://www.huffpost.com/entry/black-women-egg-freezing-reproductive-autonomy_n_655386cde4b0c9f24661b9be"
}