{
  "title": "Virgin Media O2 signs landmark partnership with Starlink to boost rural UK mobile coverage",
  "text": "Virgin Media O2 and Starlink Direct to Cell have agreed a multi-year partnership that is set to boost the operator’s mobile coverage using Starlink satellite technology\n\nThe new product which will be called O2 Satellite will initially offer messaging and data services, with further improvements set to follow, giving customers reassurance and peace of mind when in remote areas\n\nThe service will provide coverage in previous not spots, with the aim to bring Virgin Media O2’s landmass coverage in the UK to 95%+ in the 12 months following launch\n\nThe operator is currently running internal trials of the technology, with it launching for customers in the first half of 2026\n\nLondon, Thursday 30th October 2025: Virgin Media O2 has today announced a new multi-year landmark partnership with Starlink Direct to Cell, marking a UK-first initiative to enhance rural mobile network coverage and improve customer experience.\n\nThe operator is the first in the UK to utilise Starlink’s leading position as the world’s largest and only satellite-to-mobile constellation with 650+ satellites in Low Earth Orbit (LEO) to deliver connectivity straight to devices using a portion of O2’s licensed mobile spectrum. The new product, which will be called O2 Satellite, will initially deliver messaging and data services, with further improvements and applications to follow in the future across a range of handsets. App support will grow over time, with a focus on targeting support for the most asked-for applications at launch, primarily messaging, maps and location services.\n\nO2 Satellite, powered by Starlink’s satellite connectivity, will allow customers to use their handsets in more rural areas, from Lands End to Inverness. This will provide peace of mind and reassurance that they can stay in contact with the wider world when travelling or carrying out activities like hiking, camping or sailing in coastal areas, building on Virgin Media O2’s industry-leading Shared Rural Network rollout.\n\nThe O2 Satellite service will complement O2’s existing mobile network and work automatically in areas with no traditional mobile coverage, known as ‘not spots’, with the aim to expand Virgin Media O2’s landmass coverage in the UK to more than 95% within 12 months of launch. This coverage is set to increase even further when next-generation Starlink satellites are deployed, alongside further enhancements in performance, application use and an expansion of use cases.\n\nThe operator is currently conducting internal trials of the satellite-enabled service, with customer rollout planned in early 2026. More details on the proposition and pricing will follow.\n\nO2 customers that are interested in signing up to the O2 Satellite service should register their interest here: https://www.o2.co.uk/satellite\n\nLutz Schüler, CEO of Virgin Media O2, said: “This UK-first partnership is another example of Virgin Media O2 innovating to provide a better experience and peace of mind for our customers on top of the £700 million we are already investing in our mobile network this year. Starlink is a clear leader in this space, operating the world’s most advanced satellite constellation, which makes it the right partner to complement our existing coverage and support Virgin Media O2’s ambition to deliver reliable mobile connectivity across the UK.”\n\nTelecoms Minister Liz Lloyd said: “This partnership demonstrates exactly how private sector innovation can deliver real benefits for people across the UK, supporting our mission to drive growth and ensure no community is left behind. Whether you’re running a farm in Cumbria or hiking in the Cairngorms, you’ll soon have the peace of mind that comes with reliable coverage.”\n\nMike Nicolls, Starlink VP of Engineering, said: “We’re excited to bring a satellite-to-mobile network to the UK with Virgin Media O2. This partnership underscores the importance of Starlink Direct to Cell’s mission to end mobile dead zones and deliver connectivity in remote areas where it wasn’t possible before. Whether it’s checking real-time weather updates, sharing a video with friends, or simply sending a text, people can stay connected when they need it most.”\n\nLast year, Virgin Media O2 announced that it was using Starlink’s satellite technology to provide mobile backhaul for some of the country’s most remote locations to accelerate its Shared Rural Network (SRN) rollout. This made use of Starlink’s satellites for broadband, a separate constellation from Direct to Cell.\n\nENDS\n\nNote to editors:\n\nThe partnership complements the £2 million a day that Virgin Media O2 is investing to future-proof its mobile network. Virgin Media O2 announced earlier in the year that it had agreed a deal with Vodafone UK to acquire 78.8 MHz of spectrum, bringing the operator’s total spectrum holding to approximately 30% of UK mobile spectrum and materially enhancing the company’s network position. Last month, the operator started deploying this new spectrum, with the switch on of a first-of-its-kind mobile Giga Site in London which will provide customers with an enhanced and more reliable mobile experience.\n\nAbout Starlink Direct to Cell\n\nStarlink Direct to Cell is the world’s only and largest constellation with more than 650 satellites in low-Earth orbit that delivers data, voice, video and messaging to devices in mobile dead zones. Connecting more than 7M customers across five continents and counting, Starlink satellites work with existing LTE phones wherever you can see the sky. Acting like a cell phone tower in space with the most advanced phased array antennas in the world that connect seamlessly across the Starlink network over lasers to any point in the globe, it enables network integration similar to a standard roaming partner. Starlink is the world’s largest 4G coverage provider and partners with Mobile Network Operators all over the world. Learn more here and follow @Starlink on X.",
  "authors": [
    "Holly Howard"
  ],
  "url": "https://news.virginmediao2.co.uk/virgin-media-o2-signs-landmark-partnership-with-starlink-to-boost-rural-uk-mobile-coverage/"
}