{
  "title": "Jueza detiene el despliegue de la Guardia Nacional por parte de Trump en Washington",
  "text": "CNN —\n\nEl presidente de EE.UU. Donald Trump y el Departamento de Defensa desplegaron ilegalmente a la Guardia Nacional en Washington, dictaminó el jueves una jueza federal.\n\nLa oficina del fiscal general de Washington había demandado al Gobierno de Trump a principios de septiembre por el despliegue de la Guardia Nacional en la ciudad, que se produjo mientras Trump aumentaba la presencia de fuerzas federales en la capital.\n\nLa administración “excedió los límites de su autoridad” en la forma en que desplegó a los efectivos de la Guardia Nacional en la ciudad y “actuó en contra de la ley” al desplegar a la Guardia Nacional de Washington “para misiones no militares de disuasión del delito sin una solicitud de las autoridades civiles de la ciudad”, escribió la jueza federal de distrito Jia Cobb.\n\nSin embargo, Cobb retrasó su orden que requeriría que la Guardia Nacional abandonara el distrito, lo que permite el Gobierno de Trump 21 días para presentar una apelación.\n\nAdemás, Cobb determinó que la administración de Trump también “carece de autoridad legal” para traer miembros de la Guardia Nacional de otros estados.\n\n“El tribunal considera que el ejercicio de poderes soberanos por parte del Distrito dentro de su jurisdicción se ve perjudicado de manera irreparable por las acciones de los demandados al desplegar a la Guardia”, escribió Cobb en su fallo.\n\nTrump y otros miembros de su Gobierno han promocionado durante mucho tiempo el despliegue de la Guardia Nacional y el aumento federal de agentes en Washington, algo que luego harían en varias ciudades del país, muchas de las cuales también han enfrentado demandas. El Gobierno ha dicho que la presencia de la Guardia Nacional añadió una medida preventiva significativa que ayudó a disminuir la delincuencia en el distrito.\n\n“El presidente Trump está completamente dentro de su autoridad legal para desplegar la Guardia Nacional en Washington para proteger bienes federales y asistir a las fuerzas del orden en tareas específicas”, dijo la portavoz de la Casa Blanca, Abigail Jackson, en respuesta al fallo. “Esta demanda no es más que otro intento —en detrimento de los residentes de Washington— de socavar las operaciones altamente exitosas del presidente para detener el crimen violento en Washington”.\n\nEn su fallo, Cobb, designada por el expresidente Joe Biden, reconoció las complejidades del caso dada “la posición constitucional única del Distrito de Columbia”.\n\nNo obstante, Cobb dijo que “en esencia, el Congreso ha otorgado al Distrito derechos para autogobernarse. Estos derechos se ven vulnerados cuando los demandados aprueban, excediendo su autoridad legal, el despliegue de soldados de la Guardia Nacional en el Distrito”.\n\n“Desde el principio, dejamos claro que el ejército de EE.UU. no debe patrullar a ciudadanos estadounidenses en suelo estadounidense”, dijo el fiscal general de Washington Brian Schwalb en un comunicado tras la decisión.\n\n“Esta extralimitación federal sin precedentes no es normal, ni legal”, agregó. “Ya es hora de que la Guardia Nacional regrese a casa, a sus vidas cotidianas, sus trabajos regulares, sus familias y sus hijos”.\n\nCobb determinó que “los despliegues en cuestión implican la presencia diaria de más de 2.000 efectivos de la Guardia Nacional”, lo que la jueza señaló equivale a aproximadamente dos tercios del tamaño de la fuerza policial local.\n\n“El tribunal no encuentra ninguna autoridad en el Título 49 del Código de Washington que respalde la capacidad del presidente para desplegar la Guardia Nacional de Washington para patrullar el Distrito bajo estas circunstancias”, escribió Cobb.\n\n“También existe el riesgo de que esta incursión se vuelva permanente, o al menos duradera, dado que se ha creado una unidad de la Guardia Nacional de Washington específicamente establecida para realizar tareas policiales en el Distrito”, lo cual, según la jueza, va en contra de los estatutos que rigen su despliegue.",
  "authors": [
    "Holmes Lybrand"
  ],
  "url": "https://cnnespanol.cnn.com/2025/11/20/eeuu/jueza-despliegue-guardia-nacional-washington-trax"
}