{
  "title": "Bonus auto elettriche 2025, c'è un nuovo click day il 22 novembre",
  "text": "Ritorna il Bonus auto elettriche 2025 con un nuovo click day organizzato ufficialmente per il prossimo sabato 22 novembre. Le modalità di accesso e i requisiti per la fruizione degli incentivi rimangono gli stessi della prima tornata. Quel che cambia è che si potranno staccare meno voucher dal valore fino a 11.000 euro per l'acquisto di una vettura a propulsione pulita. Il motivo è che questa seconda tranche riguarda tutte quelle richieste andate scadute e, quindi ritornate disponibili, così da terminare il fondo complessivo erogato dallo stato.\n\nIl nuovo click day del 22 novembre\n\nC'è dunque una nuova possibilità per chi ha intenzione di acquistare un'auto elettrica e ha una vecchia vettura fino a Euro 5 da rottamare. Per ottenere i voucher da 9.000 a 11.000 ci si dovrà preparare all'assalto degli ultimi incentivi disponibili, che si potranno richiedere il prossimo 22 novembre dalle ore 10 collegandosi al portale dedicato. Come è possibile che ci siano ancora fondi, se le ultime notizie davano la disponibilità esaurita dopo circa 24 ore dall'apertura delle richieste? Il motivo è semplice: chi era riuscito a ottenere l'incentivo, aveva 30 giorni di tempo per validarlo presso un concessionario con un acquisto. Decaduto il tempo massimo, il fondo ritornava dunque disponibile. Secondo i dati diffusi da fonti ufficiali, circa il 18.8% delle richieste non è stata poi completata – quasi una su cinque – quindi la stima è quella di circa 10.000 voucher per il prossimo 22 novembre.\n\nChi può accedere agli incentivi\n\nRimane valido quanto già confermato in occasione dell'ultimo click day quindi la possibilità di richiedere il voucher per privati e imprese. Nel caso dei privati si può ottenere uno sconto di 11.000 euro per fascia ISEE non oltre i 30.000 euro e di 9.000 euro per fasce da 30.000 a 40.000 euro. Lo sconto è applicabile direttamente in sede di acquisto di una vettura dal costo non superiore a 42.700 euro (IVA inclusa) di listino. L'incentivo ha due richieste inderogabili ovvero sarà necessario rottamare contestualmente una vettura fino a Euro 5 e si dovrà avere residenza nelle aree urbane funzionali o FUA (Functional Urban Area) ovvero in un centro abitato di almeno 50.000 abitanti e nella sua area di pendolarismo. Per quanto riguarda le microimprese, il bonus sarà di massimo 30% (IVA esclusa) sul costo di listino e di massimo 20.000 euro.",
  "authors": [
    "Diego Barbera"
  ],
  "url": "https://www.wired.it/article/bonus-auto-elettriche-2025-click-day-22-novembre/"
}