{
  "title": "WhatsApp gets its own Instagram Notes-like feature",
  "text": "WhatsApp is getting its own version of a status update feature, similar to Instagram Notes.\n\nAs on Instagram, the new feature allows users of the Meta-owned messaging app to post a short text update that can be seen by others. In this space, you could let people know what you’re up to or what’s new in your life.\n\nThe company suggests users could also post something that could serve as a conversation starter, or they could use the space to share why they might not be available to talk at present.\n\nWhile the addition may be new to many, the company points out in a blog post that this “About” feature, as it’s called, was actually WhatsApp’s first feature. Before WhatsApp focused on secure, private messaging, it allowed people to quickly share short updates like this.\n\nImage Credits:WhatsApp\n\nWith the feature’s relaunch, WhatsApp is making users’ “About” status more visible than before. Others will now be able to see your status at the top of their one-on-one chats with friends and users’ profiles. Plus, users can tap on someone’s About status in a chat to reply to it directly.\n\nLike Instagram Notes, the WhatsApp About status will disappear in a day by default.\n\nHowever, the company says users can adjust the timer if they want to have it disappear more quickly or stick around longer than 24 hours. Plus, users can decide whether their About status can be seen by just their contacts or if it’s more publicly visible.\n\nAt launch, the feature is not as robust as Instagram Notes, which also supports short, looping videos and offers integrations that let you share the music you’re streaming. But if the new feature sees wide adoption, those types of improvements could come in time.\n\nTechcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | WAITLIST NOW\n\nWhatsApp says the feature is rolling out to users on mobile devices starting this week.",
  "authors": [
    "Sarah Perez",
    "Consumer News Editor",
    "Julie Bort",
    "Lorenzo Franceschi-Bicchierai",
    "Ram Iyer",
    "Connie Loizos",
    "Anthony Ha",
    "Rebecca Bellan",
    "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var",
    "Media"
  ],
  "url": "https://techcrunch.com/2025/11/20/whatsapp-gets-its-own-instagram-notes-like-feature/"
}