{
  "title": "Winter has finally kicked in – it’s time to crack out the casserole dish and get stewing",
  "text": "At the risk of sounding like a British cliche, can we take a moment to discuss the change in the weather? This week’s sudden drop in temperature has our house excited for potential snow (the children are giddy), with everything suddenly feeling a lot more wintry. New coats are on the hooks, thermals are being dug out and a casserole dish filled with some sort of soup, stew or stock seems to be permanently ticking away on the hob. These range from quick, warming weeknight dinners to leisurely, slow-cooked weekend meals.\n\nThe Guardian’s journalism is independent. We will earn a commission if you buy something through an affiliate link. Learn more.\n\nWhatever the time of year, I always have speedy packets of wontons and gyozas in the freezer, and cook them depending on how I feel (fried and steamed versus boiled and soupy). At the moment, I am craving warmth and nourishment, and Meera Sodha’s quickish vegan wonton soup hits all the right spots; an added bonus is that it is a soup my children can get on board with, too. I rely on my brothy braised chicory and beans (pictured top) to get me through working-from-home lunches, when I don’t have much time, as well as Rukmini Iyer’s spiced black bean and tomato soup, which is equally speedy and comforting.\n\nView image in fullscreen Quick and easy … Rukmini Iyer’s spiced black bean and tomato soup with avocado and lime. Photograph: Matthew Hague/The Guardian\n\nIf we have roasted a chicken on a Sunday, I always make stock with the bones that same evening, and Mandy Yin’s recipe for chicken curry laksa is the perfect way of honouring that liquid gold. Her laksas are one of my favourite things to devour on a chilly day, so I’m thrilled that she has shared her secrets with us, and that I can now make and devour them from the comfort of my own home.\n\nAt the weekend, I cook heartier stews – and, if time allows, even indulge in a little meal prep. Any of these stews by Gill Meller would be welcome; I plan to start by making the chicken, chorizo, white bean, olive and preserved lemon number. And I have already shopped for Felicity Cloake’s perfect Irish stew, for my half-Irish husband and lamb-loving kids, picking up an extra-large jar of pickled red cabbage to go on the side. On a day when I know my extended family will pop over, I will give Rachel Roddy’s “sociable” fish stew a go, due at least in part to the number of pescatarians in our midst. While I appreciate that the name references the stew’s history and creation, rather than a claim on its ability, it’s worth a try, right? I love the idea of a hearty fish stew bringing everyone together on a cold winter day.\n\nMy week in food\n\nView image in fullscreen The late, great Rachel Cooke. Photograph: Sophia Evans/The Observer\n\nWhat I’m reading | I was never fortunate enough to meet Rachel Cooke, but was heartbroken to hear of her death. Like many food lovers, I adored her writing and witty observations about the culinary world, chefs, restaurants and more. Cooke’s 2023 book Kitchen Person: Notes on Cooking & Eating contains 50 of the best entries from her much-loved column in the Observer, and is a wonderful way to revisit her work.\n\nA touch of glass | I am a sucker for beautiful serve-ware, and am smitten with all of Ichendorf Milano’s elegant, whimsical glassware. Even just one piece would bring so much joy to any dining table. The giraffe and baobab jug is already on my Christmas list, as is the tomato tumbler that I would love to live on my bedside table. Both are from Sous Chef, but you can also find Ichendorf stocked in many other places, including John Lewis and Fortnum & Mason.\n\nMy next meal out | Ever since I first tried Amy Poon’s home-delivery wontons back in lockdown in 2021, I have hungrily followed her journey from those wontons to award-winning Chinese deli products and restaurant pop-ups. She now has a more permanent home, Poon’s, in the stunning surroundings of Somerset House in central London, and I cannot wait to try the entire menu. I’m particularly intrigued by the siu yeh, which she describes as “a late-night meal in the food culture of southern China”. Perfect for a post-theatre or after-pub feast.\n\nskip past newsletter promotion Sign up to Feast Free weekly newsletter Recipes from all our star cooks, seasonal eating ideas and restaurant reviews. Get our best food writing every week Enter your email address Sign up Privacy Notice: Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on theguardian.com to send you this newsletter. You can complete full registration at any time. For more information about how we use your data see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nSend us your cherished family recipes\n\nView image in fullscreen Tell us about a recipe that has been handed down through generations. Photograph: Viacheslav Iakobchuk/Alamy\n\nRecipes carry stories, and often when they are passed down through families, another chapter is added each time they are made. Grandmas and uncles concoct elaborate treats and seasoning mixes, which in some cases travel across oceans to end up on our dinner tables.\n\nWe would like to hear about your family recipes that have stood the test of time, and never fail to impress. Who first made it for you? Was the recipe passed down to you, or did you create it yourself? What are the stories you associate with your favourite family recipe? Click here to let us know, and we’ll feature some of the best in a future edition of Feast.",
  "authors": [
    "Georgina Hayden"
  ],
  "url": "https://www.theguardian.com/food/2025/nov/21/winter-has-kicked-in-casserole-stewing"
}