{
  "title": "Brat pack: Charli xcx’s 20 best songs – ranked!",
  "text": "20. Claws (2020)\n\nSuch was the extent of fan involvement in the How I’m Feeling Now album that the title of Claws was decided by online vote. The opposite of the album’s more fraught depictions of lockdown, it celebrates being trapped with someone you love, although the clanking rhythm track adds a vague sense of unease.\n\n19. Taxi (2016)\n\nAccording to one fan database, there are 260 unreleased Charli xcx tracks lurking around online. Taxi, from the scrapped album XCX World, remains the most celebrated for a reason: the funny, snotty saga of a midweek blind date gone wildly out of control, it’s a perfect example of Charli and producer Sophie’s skewed approach to pop.\n\n18. Apple (2024)\n\nView image in fullscreen Playing Glastonbury earlier this year. Photograph: Anthony Devlin/Hogan Media/Shutterstock\n\nThe poppiest track on Brat – nearly binned midway through recording sessions – Apple’s earworm bubblegum melody carries a lyric about strained parental relationships and intergenerational trauma. It also went on to both spawn a viral TikTok dance craze and earn a Grammy nomination. The remix, featuring the Japanese House, feels sweeter still – and equally fantastic.\n\n17. New Shapes (ft Caroline Polachek and Christine and the Queens) (2021)\n\nIt’s easy to view Brat’s predecessor, Crash, as Charli xcx trying to fit in with standard ideas about mainstream pop, rather than forging her own distinctive path. But its highlights are pretty high: New Shapes deploys both Christine and the Queens and Caroline Polachek over a fierce take on 80s electro.\n\n16. Roll With Me (2017)\n\nView image in fullscreen Sophie (left) and Charli xcx on stage in 2016. Photograph: Daniel Boczarski/Redferns\n\nThere used to be a rule of thumb that Charli xcx perversely released her best tracks not on her albums but her mixtapes. Listening to Roll With Me, you can see how that idea blossomed: producer Sophie provides relentless kick-drum thwack and sparse, super-spiky electronics, while Charli brings fabulous attitude-laden pop smarts.\n\n15. Nuclear Seasons (2011)\n\nIf you’re looking for early evidence that Charli xcx was different, then this track from her debut EP, later to become the opener for her debut album, is a good place to start. The lyrics mix up relationship trauma, post-apocalyptic imagery and the suggestion that pop culture is a state of decay; the music reboots doomy 80s synth pop. It’s also insanely catchy.\n\n14. 360 (2024)\n\n“I went my own way and I made it / I’m your favourite reference, baby … I don’t fucking care what you think”: 360 is both the sound of the Brat era swaggering (or perhaps staggering) into view and a superb pop song, whether you opt for the original or the Robyn and Yung Lean-assisted remix.\n\n13. I Got It (2017)\n\nThe Pop 2 mixtape sounded like Charli xcx and her collaborators trying to will a more interesting, provocative pop landscape into being: on I Got It, extravagantly foul-mouthed rapper Cupcakke, Brazilian drag queen vocalist Pabllo Vittar and pansexual shape-shifting US singer Brooke Candy do their thing over a minimal, thrillingly futuristic musical backdrop.\n\n12. House (2025)\n\nHowever you might have expected Charli xcx to follow up Brat, it’s unlikely that you expected this, from the forthcoming soundtrack to Wuthering Heights: a warped electronic homage to the Velvet Underground, filled with drones, shards of noise and a guest appearance from John Cale, which bursts into furious distortion-laden industrial noise at its climax.\n\n11. Club Classics (2024)\n\nPop has hardly wanted for songs about nightclubs, but few of them have captured the small hours dancefloor’s manic sense of euphoria like Club Classics. It feels chaotic, relentless and artificially accelerated, and celebrates complete abandon: “Sweat marks on all my clothes … I wanna be blinded by the lights.”\n\n10. Gone (ft Christine and the Queens) (2019)\n\nView image in fullscreen Christine and the Queens (left) and Charli xcx performing on The Tonight Show in 2019. Photograph: NBC/NBCU Photo Bank/NBCUniversal/Getty Images\n\nAnother Christine and the Queens collaboration, Gone improbably transforms the lyrical topic of crushing social anxiety – “I feel so unstable / I fucking hate these people” – into anthemic pop. There’s a powerful sense of catharsis about the way it explodes from brooding verses into a banging, exhilarating chorus.\n\n9. Backseat (ft Carly Rae Jepsen) (2017)\n\nCharli xcx and Carly Rae Jepsen once drunkenly plotted to make an album together; their solitary IRL collaboration is marvellous. Thematically, Backseat feels like two different songs – one about a breakup, the other about the alienating nature of celebrity – perfectly joined by the chorus (“I’m alone”) and shifting, inventive electronic backing.\n\n8. Boys (2017)\n\nBy latter-day xcx standards, Boys is musically and lyrically straightforward – a giddy reverie of lust set to a suitably daydreamy backing – but it’s utterly charming and joyful. Extra points for the video, which featured the lead singer of Vampire Weekend lurking among its parade of heavily muscled objects of desire.\n\n7. Anthems (2020)\n\nWritten and recorded as Covid raged, its lyrics crowdsourced with fans online, Anthems perfectly captures those lockdown moments when the urge to, as Charli put it, “go out, blow off some steam, get fucked up” became overwhelming. If its sound is intense to the point of seeming a bit nuts, well, that’s how it felt.\n\n6. Boom Clap (2014)\n\nOriginally intended for former Disney star Hilary Duff (she rejected it), the song’s author turned Boom Clap into the highlight of her second album, Sucker, and her first US Top 10 hit. No wonder: it’s hugely catchy and impressively classy, the hooky chorus set amid chugging, pulsing synths – though she hates it now.\n\n5. Next Level Charli (2019)\n\nA paean to her fans, packed with references to her past work, the brilliance of Next Level Charli lies in the gulf between the music, which lulls the listener into believing they’re going to get a dreamy, 80s-influenced ballad, and the gobby, playground-chant stridency of the vocal: “In the rave – go for ever and ever!”\n\n4. Von Dutch (2024)\n\nView image in fullscreen In Los Angeles, California, 2024. Photograph: Étienne Laurent/AFP/Getty Images\n\nYou could call Von Dutch a diss track – it’s rumoured to be aimed at FKA twigs – but it feels more like an infectious expression of self-confidence: someone who knows she has hit her imperial phase, and has created an irresistible, epochal pop single almost entirely out of grinding, revving noise to prove it.\n\n3. Vroom Vroom (2015)\n\nA step into the leftfield that got decidedly mixed reviews on release, Vroom Vroom now feels like the birth of Charli xcx 2.0, harnessing her songwriting skills to the skeletal, avant-pop sound of PC Music affiliate Sophie. A decade ago it felt completely removed from mainstream pop trends; today it sounds incredibly prescient.\n\n2. Girl, So Confusing (2024)\n\nA different class to the usual pop-star-writes-prickly-song-about-fellow-pop-star fare, Girl, So Confusing is both an amazing song and a heartwarming saga. The original version depicted a fraught relationship with Lorde, accompanied by a synthesiser that fizzes and growls; the remix featured Lorde herself answering the criticisms and movingly explaining her own issues.\n\n1. Track 10 (2017)\n\nOn the face of it, Track 10, from her mixtape Pop 2, is an unlikely list-topper. It’s a remix of a demo – eventually reworked into the Lizzo-featuring 2019 single Blame It on Your Love – with what looks like a placeholder title. But it’s also a masterpiece: an epic ballad that’s both wildly experimental and genuinely affecting. The lyrics sound like a drunken confession from someone who can’t stop her insecurities destroying a relationship. Anyone else might have been inclined to play a song like that straight, but somehow, the overload of theoretically alienating electronics – glitches and distortion, wilfully excessive AutoTune, icy maximalist rave synths – only amplifies its impact.",
  "authors": [
    "Alexis Petridis"
  ],
  "url": "https://www.theguardian.com/music/2025/nov/20/brat-pack-charli-xcx-best-songs-ranked"
}