{
  "title": "Una lista que crece: estos son los países de América Latina que participan del despliegue militar de EE.UU.",
  "text": "CNN Español —\n\nEl despliegue militar de Estados Unidos en el Caribe, que pone máxima presión sobre el Gobierno del presidente de Venezuela, Nicolás Maduro, cuenta con el creciente apoyo logístico y diplomático de varios países de la zona, con matices entre el apoyo abierto y otros que ponen límites, al menos en el discurso, en la colaboración con las fuerzas estadounidenses.\n\nLos ataques contra embarcaciones que, según Washington, transportaban drogas ya dejaron más de 80 muertos, sin que la Casa Blanca presente evidencias que respalden sus afirmaciones.\n\nTrinidad y Tobago\n\nEl respaldo más frontal ha sido el de Trinidad y Tobago, que está a solo 11 kilómetros de la costa de Venezuela en su punto más cercano, en el extremo norte de Sudamérica.\n\nCuando EE.UU. inició el despliegue en agosto, la primera ministra trinitense, Kamla Persad-Bissessar, declaró su pleno apoyo a las maniobras que Washington asegura que son para combatir el narcotráfico. Además, la mandataria advirtió que si Venezuela ataca a Guyana, país con el que Caracas tiene reclamos territoriales, concedería acceso al gobierno estadounidense para la defensa. De esta forma, mostró su disposición a abandonar la política de neutralidad que mantuvo por años con una relación pragmática por sus intereses económicos con Venezuela.\n\n“A mí, junto con la mayor parte del país, me alegra que el despliegue naval estadounidense esté teniendo éxito en su misión”, dijo Persad-Bissessar a inicios de septiembre, cuando EE.UU. lanzó su primer ataque a una embarcación en el Caribe. Todos los narcotraficantes “deberían ser asesinados violentamente”, agregó.\n\nA fines de octubre, el destructor USS Gravely, de la Armada de Estados Unidos, arribó a Trinidad y Tobago para llevar a cabo ejercicios militares durante varios días, unas maniobras que el Gobierno de Venezuela dijo que “constituyen una provocación hostil”. Además, Maduro anunció la suspensión de acuerdos bilaterales de gas por la “amenaza de la primera ministra de convertir a Trinidad y Tobago en el portaviones del imperio estadounidense contra Venezuela”.\n\nVideo Ad Feedback Maduro critica el rol de Trinidad y Tobago en la escalada de tensión entre Venezuela y EE.UU. 00:50 • Fuente: CNN Maduro critica el rol de Trinidad y Tobago en la escalada de tensión entre Venezuela y EE.UU. 00:50\n\nLas medidas de Caracas no surtieron efecto: esta semana EE.UU. inició nuevos ejercicios militares en Trinidad y Tobago, lo que Maduro describió como planes “irresponsables”. El ministro de Relaciones Exteriores de Trinidad y Tobago, Sean Sobers, dijo que los ejercicios continuarán realizándose “debido a los constantes hechos de violencia y actividad de bandas criminales”.\n\nEn medio de estos movimientos, el ex primer ministro de Trinidad y Tobago Keith Rowley negó haber sellado un acuerdo con Estados Unidos que permitiría a Washington utilizar al país como base para atacar a naciones vecinas. El Acuerdo sobre el Estatuto de las Fuerzas (SOFA, por sus siglas en inglés), firmado en 2007, regula la presencia temporal y las actividades del personal militar estadounidense en Trinidad y Tobago, y en su última actualización se eliminó una fecha de vencimiento específica.\n\nGuyana\n\nLa frontera terrestre más pequeña de Venezuela (789 kilómetros) es también la más tensa actualmente. Las disputas territoriales con Guyana se calentaron tras el referendo que impulsó Maduro en 2023 para crear el estado de Guayana Esequiba en una zona rica en petróleo que Venezuela reclama como propia.\n\nEn agosto, poco después de iniciarse el despliegue militar estadounidense en el Caribe, el Gobierno de Guyana respaldó las maniobras. En un comunicado, dijo que “reafirma su apoyo a un enfoque colaborativo e integrado para combatir la delincuencia organizada transnacional”.\n\nEl texto agregó que “considera con grave preocupación la amenaza a la paz y la seguridad en la región que representan la delincuencia organizada transnacional y el narcoterrorismo, que a menudo involucran redes criminales como el Cártel de los Soles de Venezuela”. Ese grupo, según Washington, está liderado por Maduro y sería responsable de traficar droga hacia EE.UU. y Europa, acusaciones que Caracas niega y tacha de “invento”.\n\nEl jefe del Comando Sur de Estados Unidos, el almirante Alvin Holsey, visitó Guyana este mes para “promover la seguridad y la estabilidad regional”, y se reunió con altos mandos para dialogar sobre “la larga alianza de defensa” entre ambos países, según informó la embajada estadounidense. El encuentro también sirvió para “promover la seguridad y la estabilidad regional”, agregó el comunicado.\n\nEl grupo de ataque del portaaviones USS Gerald R. Ford se desplaza por el Océano Atlántico el jueves. Oficial Tajh Pay/Marina de EE.UU.\n\nEl Salvador\n\nEn los primeros días de noviembre, un avión de ataque AC-130J operado por la Fuerza Aérea de Estados Unidos fue visto en El Salvador, en la base de seguridad cooperativa de Comalapa, según fotos e imágenes satelitales obtenidas por CNN.\n\nLa nave puede transportar el misil Hellfire, pero está armado principalmente con cañones de gran calibre. El AC-130J que aparece en las imágenes de El Salvador tenía dos cañones —incluido un obús de 105 mm— visibles en el lado izquierdo del avión.\n\nHasta hace poco, la base salvadoreña se había utilizado casi exclusivamente para aeronaves desarmadas, según el Comando Sur de Estados Unidos. Su ubicación, cerca de la costa, otorga una posición privilegiada para la campaña estadounidense en el Pacífico, ya que el alcance es limitado para las bases en el Caribe.\n\n“Operar desde Comalapa ofrece más opciones y permite vigilar y defender una franja mucho más amplia del Océano Pacífico, por donde pasa gran parte de la cocaína que se trafica hacia Estados Unidos”, explicó a CNN el Dr. Ryan Berg, director del Programa de las Américas del Centro de Estudios Estratégicos e Internacionales.\n\nEl presidente de El Salvador, Nayib Bukele, no se ha pronunciado puntualmente sobre el despligue militar estadounidense, pero tiene una relación cercana con Trump: fue el primer (y hasta hora único) mandatario de la región en ser recibido en el Despacho Oval en lo que va del segundo mandato del líder republicano.\n\nVideo Ad Feedback ¿Qué arsenal usan las Fuerzas Armadas de EE.UU. para atacar presuntos barcos de narcotráfico en el Caribe? 01:51 • Fuente: CNN ¿Qué arsenal usan las Fuerzas Armadas de EE.UU. para atacar presuntos barcos de narcotráfico en el Caribe? 01:51\n\nPanamá\n\nMilitares estadounidenses realizan entrenamientos en Panamá, aunque el Gobierno del presidente José Raúl Mulino intenta poner paños fríos al asunto.\n\nEl mandatario negó la semana pasada que su país se esté prestando para algún “acto hostil contra Venezuela” y aseguró que las maniobras militares se deben a acuerdos de cooperación bilaterales con Washington. “Con relación a lo de Venezuela, nosotros no tenemos nada que ver con eso”, recalcó.\n\nPanamá, que no cuenta con fuerzas armadas desde 1990, es frecuentemente escenario de ejercicios desde la invasión estadounidense de 1989. En abril, Panamá y EE.UU. firmaron un memorando de cooperación que habilita más presencia militar, con la autorización del uso de bases aéreas y navales para ejercicios conjuntos. Mulino, bajo un enfoque de cooperación cauta, asegura que las actividades no tienen ninguna relación con la presión de la Casa Blanca sobre Venezuela.\n\nRepública Dominicana\n\nEl presidente de República Dominicana, Luis Abinader, dijo este lunes que el país pondrá en marcha junto a la DEA de EE.UU. acciones “mucho más extensas y profundas” en la lucha contra el narcotráfico.\n\nEn la misma jornada, autoridades dominicanas informaron que abordaron una lancha con un cargamento de 806 paquetes de presunta cocaína en las costas de Pedernales. La Dirección Nacional de Control de Drogas dijo que se trató de una intervención en apoyo a la Operación Lanza del Sur, nombre que el Pentágono usa para el despliegue militar en la región.\n\nLa colaboración ya había iniciado el sábado, cuando las autoridades incautaron otro cargamento de casi 500 paquetes de cocaína en una lancha, también en apoyo a la operación estadounidense.\n\nLa importancia de Puerto Rico\n\nPuerto Rico es un territorio autónomo de Estados Unidos en el Caribe, por lo que no es un país independiente, pero la isla juega un rol clave en esta coyuntura.\n\nEs allí donde está el mayor operativo estadounidense y es el territorio caribeño con más bases militares del Pentágono. Puerto Rico llegó a tener 11 de estos centros militares y actualmente preserva la de Fort Buchanan, Fort Allen, Base Aérea Muñiz y Camp Santiago, así como parte de antiguas bases en Ramey y Roosevelt Roads.\n\nA finales de septiembre, marines estadounidenses, quienes están prestando apoyo a las misiones del Comando Sur de EE.UU., participaron en ensayos de desembarco anfibio en Puerto Rico, según imágenes oficiales.\n\nLa Estación Naval Roosevelt Roads, que había estado cerrada desde 2004, ya está de nuevo en funcionamiento, según imágenes satelitales y fotografías tomadas en la base.\n\nTal es la escala de la presencia militar estadouniense en Puerto Rico que la Administración Federal de Aviación (FAA) emitió el martes un Aviso para Misiones Aéreas (NOTAM, por sus siglas en inglés) para operadores de aeronaves en el espacio aéreo alrededor de Puerto Rico debido a lo que han descrito como una “situación potencialmente peligrosa”.\n\nEn el comunicado, la FAA resaltó un aumento en las operaciones de aeronaves del Estado o aeronaves militares hasta el 16 de febrero de 2026. “Se recomienda a los operadores exhibir precaución extrema al operar en la región de información de vuelo de San Juan (TJZS) debido al aumento de las operaciones aéreas estatales”, explica.\n\nOtras bases\n\nEstados Unidos cuenta con otras dos bases en el Caribe, aunque en esos casos dista de representar un apoyo de los países que las albergan.\n\nLa base naval de Guantánamo, en el sureste de Cuba, es un enclave militar que desde 1903 permite tareas logísticas y de vigilancia en la zona. Allí se realizan actividades militares, operaciones de inteligencia y funciones de apoyo naval en la región. El Gobierno de Cuba, aliado de Venezuela, ha rechazado en varias oportunidades el despliegue militar estadounidense de los últimos meses.\n\nWashington también cuenta con una base aérea en Honduras desde 1982, conocida como “La Palmerola”, en el centro del país. Está compuesta por más de 500 militares estadounidenses y 500 civiles hondureños y estadounidenses, según su web.\n\nEn enero, antes que asuma Trump, la presidenta de Honduras, Xiomara Castro, cuestionó mantener la base militar si EE.UU. concretaba el plan de deportaciones masivas. En agosto, la mandataria calificó de “infundadas” las acusaciones contra Maduro y posteriormente se mostró en contra del despliegue militar estadounidense en el Caribe.\n\nApoyo político: Ecuador, Paraguay, Argentina\n\nOtros países que no están en el Caribe han mostrado su apoyo a la estrategia de presión de Washington a Venezuela.\n\nEn agosto, Ecuador designó al Cartel de los Soles como “grupo terrorista del crimen organizado” al considerarlo “una amenaza para la población nacional”. El decreto fue firmado por el presidente Daniel Noboa, cercano a Washington, quien también intentó eliminar en una consulta popular la prohibición de instalar bases militares extranjeras en el país, pero su propuesta fue rechazada en la votación.\n\nTambién Paraguay declaró al Cartel de los Soles como una “organización terrorista internacional”, con un decreto que señala la obligación del Estado paraguayo de “redoblar sus esfuerzos” a fin de combatir y prevenir la delincuencia transnacional.\n\nPor su parte, el Gobierno de Argentina, otro aliado de la Casa Blanca, declaró al grupo como “organización terrorista. La Cancillería informó que la decisión “se fundamenta en informes oficiales que acreditan actividades ilícitas de carácter transnacional, entre ellas narcotráfico, contrabando y explotación ilegal de recursos naturales, así como vínculos con otras estructuras criminales en la región”.",
  "authors": [
    "Gonzalo Zegarra"
  ],
  "url": "https://cnnespanol.cnn.com/2025/11/19/latinoamerica/paises-despliegue-militar-eeuu-venezuela-orix"
}