{
  "title": "‘It’s about quality of life’: Can Birmingham’s Retrofit House help fix the UK’s terrible housing?",
  "text": "Link Road is home to an unassuming row of Victorian terrace houses in Edgbaston, but inside one of these two up, two downs, a domestic revolution is happening.\n\nAt No 33 Link Road, a property bought by community group Civic Square and named Retrofit House, it’s open week. Events include a series of talks, classes and performances – there’s a timetable pinned by the front door so you know when to head to the back bedroom to learn about biomaterials or into the garden for a workshop on mending doors.\n\nView image in fullscreen ‘A lot of people here think net zero is a waste of time’ … Retrofit House. Photograph: Paul Stringer\n\nIt’s also a chance for curious visitors to see the work that researchers and designers have produced through collaboration with locals. From top to bottom, the house is full of examples of retrofit ideas, often using ecologically sound materials such as lime, clay and straw. There are adaptations on show that improve energy efficiency and air quality, protect against flooding and encourage wildlife in an effort to combat climate change.\n\nOf course, few visitors would put it like that. The local community are here to learn DIY skills, check out the finish on clay paint (breathable, nontoxic, locally made) and attend talks on doughnut economics and “freehouse governance”. They want to lower their fuel bills and make their homes more comfy.\n\nAs Immy Kaur, co-founder and director of Civic Square, says, “A lot of people here think net zero is a waste of time, or they’ve lived through previous government-run home improvement schemes that were failures and don’t want the disruption. When we started talking to the local community about retrofit we realised we had to go at it from a different angle.”\n\nThough it’s widely seen that retrofit is a practical solution to the UK’s draughty, diverse housing, successive governments have made a pig’s ear of disseminating ideas and funding. Take-up of jolly-sounding schemes such as the Home Upgrade Grant (Hug), Local Authority Delivery (Lad) scheme and the Warm Homes Plan haven’t met targets – even though the thermal efficiency of UK housing stock is among the worst in Europe. The schemes are prescriptive or hard to navigate, while the black mould caused by incompetent installation of cavity wall insulation under the ECO4 scheme has caused national scandal.\n\nView image in fullscreen ‘This project is beyond building performance’ … one of the participants at Retrofit House’s open week. Photograph: Paul Stringer\n\nIf Civic Square and its partners can find success, that could make a real difference. Though it’s only four months since they bought Retrofit House, local engagement is promising. There’s a growing national network called Retrofit Reimagined which consists of neighbourhood groups from Bristol, Cheltenham and Wessex collaborating with organisations such as the design practice Material Cultures to share skills and knowledge so that the public not only make informed decisions about what retrofit solutions they want but will also be able to either do the work themselves or find a properly trained local builder. Retrofit House isn’t only a showroom, it’s also a workshop where builders from the West Midlands gain experience of working with natural materials and installing retrofits.\n\nView image in fullscreen ‘Everyone is really hungry for the opportunity’ … Retrofit House’s open week. Photograph: Ben Bernard Smith/Paul Stringer\n\n“As an architect, you’re conditioned to be a professional consultant,” says Summer Islam, a partner at Material Cultures, “but this project is beyond building performance. It is about quality of life, social value, environmental impact and what’s important to a household. Looking at the work through social value, it’s not about how many people use the building but how much knowledge can you embed locally through turning everything into a learning opportunity. How many apprentices can you have? How many workshops can you run? And everyone is really hungry for that opportunity. Those things usually happen behind closed doors, which is nuts when you realise how many people want to see it.”\n\nSo far Retrofit House has been funded by philanthropic organisations such as the Joseph Rowntree Foundation. Kaur’s tip is that if you’ve got a good idea, now’s the time to go to charities with large endowments. “They can see what’s happening with Reform and the far right and they want to step in and do something positive for society.”\n\nCivic Square’s mantra is “we may not have deep pockets but we have many hands”. The idea of neighbours working together is idyllic but Kaur is realistic too. “We do not think we can do this without outside help, but bringing skills and land back into the community is important.”\n\nThe organisation is not opposed to working with local government further down the line, but the idea is to use Retrofit House as an exemplar for what can be achieved, a positive project that will help policy makers be bolder or to shift council procurement rules. Collaborate too soon and Civic Square will get bogged down in current grant guidelines.\n\nAlso, as Kaur says, “Local government don’t have capacity for this – they’ve had enough of a problem sorting out the bins.”\n\nIf Birmingham council wants some good community advice on that headache, there’s probably a workshop for it at Retrofit House.",
  "authors": [
    "Alice Fisher"
  ],
  "url": "https://www.theguardian.com/artanddesign/2025/nov/17/birmingham-retrofit-house-in-ladywood#comments"
}