{
  "title": "Carrying the Torch: A Conversation with Phil Wizard",
  "text": "Transcript\n\nIf we're talking about creating the future,\n\nI will humbly posit to you\n\nthat the guest that I'm about to bring out\n\nis part of creating the future.\n\nWe're talking about somebody, once again, Phil Wizard,\n\nwho saw some breakers in 2009\n\nwhen he was in middle school.\n\nWent home, he thought it looked really cool.\n\nWent home and got on YouTube,\n\nlooked it up, and 15 years later\n\nhe won an Olympic gold medal.\n\n[crowd cheers]\n\nSo I would humbly posit to you\n\nthat the stuff that we are about to speak about\n\nand the stuff that you will see,\n\nthat you just saw, rather,\n\nthat is what a lot of this stuff is about.\n\nThat is what the technology is moving.\n\nThis is the stuff that goes into the phones,\n\ngoes into the computers.\n\nThis is the stuff that we're doing.\n\nSo I would love to bring out, once again,\n\ntop rank B-boy before the Olympics even happened,\n\nand now the first ever gold medalist B-boy,\n\nPhil Kim, AKA, Phil Wizard.\n\n[audience cheers] [upbeat music begins]\n\nMy man.\n\n[audience applauds] [upbeat music continues]\n\nGood to talk again.\n\nGood to talk to you again.\n\nYeah, man.\n\nSo I just, first off, I want to thank you\n\nfor just silencing the haters.\n\nFirst off, man,\n\nif you have not seen this person's Instagram, look at it.\n\nIt is incredible.\n\nI mean, cookies, cakes, like biscuits, baguettes.\n\nThis dude eat like,\n\nand you will see him like posting himself\n\neating like all of this, I'm not gonna say junk food,\n\nbut very, very tasty looking treats.\n\n[Phil] Soul food.\n\nSoul food.\n\n[Dexter laughs]\n\nVery tasty looking treats.\n\nAnd you got people in the comments saying, Bro, stop.\n\nWe need you good for the Olympics.\n\nYeah, I literally had people,\n\n'cause you could bet at the Olympics on who's gonna win.\n\nAnd I had people in my DMs being like,\n\nYo, I put money on you.\n\nCan you fix your diet?\n\nLike you need to eat healthy.\n\nAnd then one of my other friends messaged me\n\nbecause his friend had messaged him\n\nbeing like, Is this how he really eats?\n\nAnd one of my best friends know, he's like,\n\nYo, when he eats like this you know he's on.\n\nLike, he's ready.\n\nI think the day before you posted yourself eating\n\nlike cookies or something like that.\n\nYeah, I mean I just like to enjoy life.\n\nLike those things, obviously,\n\nlike health and nutrition is extremely important\n\nin anything physical.\n\nBut I think people don't understand,\n\nlike those aren't, it's not all I eat.\n\nMy meals are extremely healthy.\n\nI like sweets, I've always liked sweets.\n\nAnd it's not like I'm suddenly doing this for the Olympics.\n\nEvery competition, leading up to a competition,\n\nI'm eating sweets the day before.\n\nIt's my version of carb loading.\n\nI don't know if it's actually scientifically proven,\n\nbut it works for me.\n\nClearly it worked, clearly it worked.\n\nSo, man, there's so many moments from,\n\nif we are just gonna talk about the Olympics,\n\none of my favorite moments,\n\nif you could break this down for me is,\n\nit's not even the finals actually, the finals is amazing,\n\nbut it's actually the semi-finals.\n\nYou versus Shigekix.\n\nIt's semi-finals, and just picture this if you can.\n\nBy the way, who watched the Olympics?\n\nWho watched them?\n\nOkay, about half.\n\nAbout half.\n\nOkay, we're doing good.\n\nA little bit.\n\nThat's all right.\n\nYour homework isn't gonna be to watch more.\n\nWe'll talk about this later.\n\nBut this, I think the end of round three\n\nShigekix is doing his thing.\n\nAnd I mean, just imagine this guy,\n\njust power move after power move, I mean every,\n\nwhen you think of breaking, he's doing all that stuff\n\ntimes 10.\n\nIt's amazing.\n\n[Phil] He's incredible.\n\nHe's so good.\n\nAnd then right near the end of his last set,\n\nhe starts stepping and he's doing a few things,\n\nand he starts spinning, and he goes into this rotation\n\nand I see you looking at him, and the camera picks it up,\n\nand he looks at him and he goes from like fan mode\n\njust enjoying what's happening and backing up.\n\nHe says, Hold on.\n\nAnd then all of a sudden you do a handstand\n\nand like go in kind of a split V type thing\n\njust as he does the same thing.\n\nSo basically you predicted his move.\n\nWhich is incredible.\n\nTalk about that.\n\nIt's funny because I think from an outside perspective,\n\nand I didn't know, like I think this went a bit viral.\n\nI saw it on TikTok after like a bunch of times.\n\nBut it's funny, 'cause for us it's not that weird.\n\nLike I've done it to him specifically a bunch of times\n\nin other competitions,\n\nbut I guess it was a bit different\n\n'cause it was on the Olympic platform.\n\nAnd from that angle in which it was shot too, it was like,\n\nI will give myself credit, it was exactly the same move.\n\n[Dexter] It was.\n\nLike the exact same freeze.\n\n[Dexter] It's symmetrical.\n\nBut the thing in breaking is like first,\n\nfor those who don't know, it's a freestyle dance.\n\nSo we don't know what the music being played is gonna be.\n\nSo we just kind of go up there\n\nand you have to adjust to what you're doing.\n\nBut a lot of people, a lot of breakers\n\nwill still pre choreograph their movements,\n\nand so they'll just time it to the music.\n\nShigekix is one of those people.\n\nAnd so the breaking community is quite small.\n\nAnd Shigekix and myself are on the same team.\n\nWe're both sponsored by Red Bull.\n\nSo I've competed with him and against him so many times\n\nthat I know his moves.\n\nLike I know all of his moves.\n\nI knew what he was gonna do.\n\nAnd I think it's like, as a friend,\n\nI probably shouldn't have done that to him\n\nlike on the Olympic stage, but in the heat of the moment,\n\nyou're just like, ah, I know what he's gonna do,\n\nso I'm gonna do it.\n\nMyself personally, I'm a bit of a,\n\nI have a bit of a different approach.\n\nEveryone has their moves,\n\nbut the way I put my moves together\n\nare very different every single time.\n\nAnd I don't even know what I'm gonna do\n\nwhen I show up on that stage, based on the music,\n\nbased on the crowd, based on how I feel,\n\nI change my plan all the time.\n\nAnd so someone couldn't do that to me as easily.\n\nYeah, I mean it's unpredictable.\n\nYou'll go up and you'll do stuff where it's,\n\nis this, is that breaking?\n\nDo y'all do that?\n\nLike the weird rubber band legs thing you're doing.\n\nI mean it's amazing.\n\nSo I mean, again, just to put into context,\n\nI mean imagine Simone Biles, somebody says,\n\nHey, those flips are amazing.\n\nToo many of those, points off.\n\nNobody would ever do that, right?\n\nIt's completely, completely different\n\nif you're talking about it as a sport.\n\nWhich brings me into something else,\n\nwhich would make me think that,\n\nbefore we were talking, and so we spoke\n\nbefore the Olympics, and I remember one of the big\n\nconversations was, within the community,\n\nis breaking being at the Olympics even a good thing?\n\nNow I'm curious, has that,\n\ndid that conversation change before?\n\nHas it changed since?\n\nWhat's the vibe been like?\n\nYeah, I mean, again, for the people that don't know,\n\nbreaking first derives from hip hop culture,\n\nit's been part of the culture since its inception.\n\nAnd breaking traditionally within the world of breaking,\n\nhas been seen as an art and a culture first.\n\nIt's a dance, it's about self-expression.\n\nIt's difficult to go into something like the Olympics\n\nbecause there's, it's so subjective.\n\nIt still is.\n\nIt's based on opinion,\n\nbecause it's, for example, figure skating in the Olympics,\n\nit can be very subjective, it is very artistic,\n\nbut there are certain criteria they have to hit.\n\nIn breaking, there's no criteria that we have to hit.\n\nYou can go up and do whatever you want.\n\nAnd so that makes it very, very subjective.\n\nAnd so that's why that debate is so big.\n\nIs it sport, is it art?\n\nFor myself, I do think the beauty of it\n\nis that it doesn't really matter.\n\nThese are just labels to me.\n\nAt the end of the day, I think the beauty of it\n\nis that it can transcend these things.\n\nIt's extremely athletic.\n\nWe see ourselves as athletes,\n\nand we've always seen ourselves as athletes\n\nprior to the Olympics.\n\nBut at the same time we see ourselves as artists too.\n\nIt's about self-expression.\n\nIt's about finding your style, finding your individuality.\n\nAnd those are the people that are celebrated\n\nwithin the dance.\n\nAnd so we have a common saying within the world of breaking\n\nthat I kind of have adopted as well,\n\nand that I kind of live by is like train like an athlete,\n\nbut think like an artist.\n\nAnd so I think the beauty, again, of breaking\n\nis that it can transcend those labels\n\nand it can live within those two parallels.\n\nI remember you were saying, I mean,\n\n'cause some of the worry that about breaking\n\nbeing at the Olympics was that okay,\n\nis mainstreaming this going to dilute it?\n\nIs a bunch of outsiders going to,\n\nbasically we're talking about selling out here, right?\n\nSo the Olympics have come and gone.\n\nHow do people feel?\n\nWas it, because we were talking about,\n\nthis is gonna provide opportunities for people.\n\nHas it?\n\nDefinitely, I mean, I can only speak\n\nfrom my own experience and those\n\nthat I kind of have close around me,\n\nbut it definitely has opened up a lot of doors for people.\n\nIt's opened up a lot of narratives\n\nand opportunities, like speaking here,\n\nthat we never could have done prior.\n\nSo we can speak about breaking on a bigger platform.\n\nThere are opinions on breaking\n\nafter the Olympic games for many reasons.\n\nAnd we can have the opportunities to speak on that\n\nand to talk about the culture, to talk about the fact\n\nthat for us it's not just a sport.\n\nSo yes, and I will say there are messy parts to it too.\n\nOf course, going into the Olympics,\n\ncoming outta the Olympics, there are things that,\n\nwhen I look back, I was like,\n\nthat could have been done way better.\n\nThis could have been done way better.\n\nBut that's with anything.\n\nNothing's ever going to be perfect.\n\nBut at the end of the day, again,\n\nI can only speak from my personal experience.\n\nI do think it is a net positive, but you never know.\n\nOkay, you opened that window,\n\nit could have been done better.\n\nWhat do you mean?\n\nThere's a lot of things that were a bit disorganized\n\nin the process.\n\nWhen you're an athlete competing in it too,\n\nyou don't really look too deeply into it,\n\nbecause you're so focused on your competition\n\nand what you're competing at.\n\nI mean, we've always talked about this before.\n\nI know the people that kind of have been running\n\nthe Olympics, they're good friends of mine,\n\nthey're great people, but there are things\n\nthat maybe shouldn't have been done, certain judges\n\nthat shouldn't have been there, whatever.\n\nBut I also understand that I don't understand\n\nthe whole political and geopolitical like environments\n\nsurrounding that.\n\nSo I can't fully judge,\n\nbecause I don't know the full picture.\n\nBut there are things for myself as a competitor\n\nthat I think could have probably been done better.\n\nSo we've kind of danced around this a little bit\n\nand I wanna address the kangaroo shaped elephant\n\nin the room.\n\nAnd unfortunately, I mean I felt this right?\n\nI felt this when I told people,\n\nI talked to this guy who I think he's gonna get gold,\n\nand then the conversation immediately turns over to,\n\nif you're not familiar, Australian breaker Raygun,\n\nwho a lot of people had a lot of feelings about.\n\n[Phil] Yes.\n\nHow has that conversation been within the scene?\n\nYeah, I mean it's hard,\n\nbecause I get this question a lot now.\n\nI bet you do.\n\nBut it's okay.\n\nHonestly, I don't mind talking about it,\n\nlike first and foremost, I don't think anyone deserves\n\nthe amount of hate that she got.\n\nLike no one deserves to be bullied.\n\nThat's just internet culture.\n\nThat's meme culture.\n\nNo one deserves that kind of hate.\n\nBut this is probably one of the problems\n\nthat isn't necessarily just for breaking.\n\nI know it's inherent in other sports as well.\n\nIt was just more inherent in breaking\n\nbecause it was the debut of breaking.\n\nAnd again, we're going in as a sport\n\nthat no one really understands going into it,\n\nthere's a lot of negativity already being like,\n\nwhy is this even there?\n\nBut it happens in other sports.\n\nEssentially why she qualified was because\n\nthere's continental qualifiers,\n\nand they had to do continental qualifiers.\n\nSo she won the Oceania qualifier.\n\nTraditionally in breaking, there aren't a lot\n\nof breakers in Oceania in general, the scene is very small,\n\nand there's no one that's really high level.\n\nFrom my understanding too,\n\nbecause of the nature of things,\n\nit was put together very last minute.\n\nAnd so the opportunity for other people around Oceania\n\nto even go to the qualifier,\n\nwhich happened in Australia, was quite low.\n\nSo she was the best of the bunch that were there,\n\nbut the amount of people that were there\n\nI think was quite low.\n\nAnd so she rightfully earned her spot,\n\nbut she was not at the level of the other competitors\n\nat all.\n\nAnd I think the unfortunate thing is,\n\nwhen you look at the B-Girl category specific,\n\nI was there live, like it was some of the top level B-Girls,\n\nespecially on the second half,\n\nwhen you go from top eight onwards,\n\nthe level was incredible.\n\nAnd it was beautiful to watch.\n\nIt's unfortunate that the narrative was all focused on her.\n\nAnd when I say it's happened in other sports,\n\nfrom my understanding in things like swimming this happens,\n\nwhere there are certain people that shouldn't be there,\n\nbut because of how qualifications work,\n\ncertain countries get kind of like buys.\n\nBut in something like swimming,\n\nyou can see the gap.\n\nLike you can see the distance, you can see like,\n\noh, this person is significantly worse\n\nthan the other people.\n\nBut that's a little bit more difficult\n\nto understand in breaking.\n\nBut because of that meme culture,\n\na lot of things kind of came up out of it.\n\nYeah, well I guess that's what takes me\n\nto kind of wrap this question then is over,\n\nyou said that the Olympics has been a net positive.\n\nWhat I've seen is a lot of people,\n\nif you ask them about breaking in the Olympics,\n\nthe one thing they know about is,\n\nand it's not even her full set, it's like a super cut.\n\nIt's all the bad parts because yo, there's some parts,\n\nand I challenge anybody in this room\n\nto do some of the moves that she was doing.\n\nYou cannot do them unless you actually are a B-Boy B-Girl,\n\nat which point come on up and show us your thing.\n\nBut it's this really concentrated,\n\nconcentrated viral moment\n\nwhen there was so much else.\n\nIs there any concern, I guess,\n\nis what I'm asking, is that that will be\n\nwhat people have taken away from break?\n\nYeah, I mean again, that's just the reality\n\nof meme culture in the internet nowadays.\n\nLike you said, it's a super cut.\n\nNo one, it's the same thing with interviews.\n\nPeople will take things out of context.\n\nIt's the exact same thing that happened\n\nwith the Raygun thing.\n\nThey just took the super cut of her bad parts\n\nand put it on the internet.\n\nDo I think it's bad?\n\nYes, I do think it's a bad, I personally,\n\nlike I do think it's a bit embarrassing for breaking\n\nbecause people will kind of walk away\n\nwith the Olympics thinking this is what breaking was\n\nat the Olympics moving forward.\n\nSo I don't think that that is the best for us.\n\nBut again, I think there's opportunities like this\n\nto kind of change the narrative and talk about it.\n\nHopefully that happens moving forward,\n\nand hopefully, again, Raygun honestly stops getting bullied\n\nand has the opportunity to talk about it more as well.\n\nSo we'll see what happens.\n\nYeah, and another thing to be cleared up,\n\nit was already set before the Olympics even happened,\n\nthat the breaking would not be an event in 2028.\n\n[Phil] It was not because of her performance.\n\nIt was not because of her performance.\n\nBut let's be real,\n\nlike there's a lot of misinformation out here.\n\nExactly, yeah.\n\nSo let's say that you could wave a wand\n\nand breaking would be in 2028.\n\nWould you want that?\n\nIn the 2028 Olympics in LA?\n\nIt's a good question.\n\nYes, the simple answer is yes.\n\nBut I think within those four years\n\na lot would have to change.\n\nLike what?\n\nJust the way qualifications work.\n\nAnd again, I think coming in as a new sport\n\nand it coming in pretty quickly,\n\nthere are adaptations that are difficult to make\n\nin a short amount of time.\n\nI think after having experienced it once,\n\nI would be an advocate for like,\n\nthings need to change for the next one.\n\nThere has to be a lot more transparency.\n\nWe can even just talk about problems within breaking\n\nthat have been around for a long time,\n\nbut now that are pushed to the spotlight more\n\nwith a platform like this in the sense that like,\n\nwhen you go to a breaking competition,\n\nthe judging panel and the judging system\n\nfor the Olympics is just red or blue.\n\nLike it just says who the judge voted for.\n\nThat needs to be more transparent, especially for people\n\nwho don't understand breaking.\n\nNot this person won, why did they win?\n\nBy what margin, by what reason?\n\nAnd I think those kind of things need to change.\n\nThere's a lot of just technical details.\n\nBut I think again, if it were to come back in the future,\n\nI think it would be a cool thing,\n\nbut it would just mean that we would have to put in\n\na lot more work to make that more transparent\n\nand more easily understandable for people.\n\nAnd I think that's why it's almost a blessing in disguise,\n\nbecause there's a lot of problems that have been spotlighted\n\nfor us within breaking that we never thought about before.\n\nBecause for us as breakers,\n\nwe understand all of this already.\n\nI know why this person lost or won, I can see it.\n\nBut when someone else who doesn't watch breaking,\n\nit doesn't happen often that there are a lot of people\n\nwho don't watch breaking,\n\nespecially at the scale of the Olympics, recognizing like,\n\noh, right, these people don't know this.\n\nLike even the idea, people came up\n\nto me and be like, oh, you know\n\nwhat music's gonna be played, right?\n\nWhen someone first asked me that, I was like,\n\nwhat are you talking about?\n\nLike breaking's a freestyle dance?\n\nAnd it made me realize like, oh right,\n\npeople don't know about this.\n\nPeople don't understand this.\n\nSo it just addresses a lot of things that,\n\nmyself included, that I didn't know as problems\n\nuntil it's put on such a big stage like this.\n\nIt's really interesting to me that you have,\n\nnot only are you truly at the top of the game,\n\ntop level of this,\n\nbut also that you're still needing to explain this\n\nto everybody.\n\nI mean like, imagine LeBron James\n\njust like doing what he does and then jumping up\n\nin the announcer's box and saying, okay everybody,\n\nwhat I just did, this is why it was cool.\n\nLike it's amazing.\n\nYeah, but I think that's okay too,\n\nbecause I understand that, again,\n\npeople don't understand this,\n\nand it takes a lot to understand.\n\nTo the naked eye, watching breaking,\n\nyou'll be impressed by the things that are,\n\nof course, physically impressive.\n\nPeople spinning on their heads,\n\npeople doing these crazy movements.\n\nBut there are so many details and layers to breaking that,\n\nmyself included, only understand after years\n\nof being into it and actually learning the dance\n\nand understanding why other things are actually\n\nsignificantly more difficult creatively as well.\n\nBut to the naked eye, they won't understand.\n\nI'm happy to talk about that.\n\nI'm a nerd about breaking,\n\nlike I love breaking, I still watch it to this day.\n\nThe people I compete with and against, I still fanboy over.\n\nLike some of my best friends I grew up watching them.\n\nAnd so for me, it's still surreal to me.\n\nAnd I'm happy to open that door for other people if I can.\n\nSo this will be my last question then,\n\nbecause we can talk about this all day.\n\nYou already know me.\n\nSo being that breaking is a part of hip hop culture.\n\nAnd I think there's, I think the older the person is,\n\nthe more connection to that they feel, you know what I mean?\n\nAnd I think the younger we get,\n\nwe feel like rap is something different.\n\nBreaking is something different.\n\nDJing is something different, right?\n\nDo you feel like, in the future,\n\nbecause you're at the point now where you,\n\nyou still got, if Olympics come back, you still got\n\n2, 3, 4 Olympics left in you, definitely.\n\nWe'll see.\n\nNah man, but you're at the point now where there's kids\n\nwho are looking up to you,\n\nwhere maybe you are the first YouTube video that they see.\n\nAnd they're looking at you like, How can I be like Phil?\n\nAnd so is there a way for you,\n\nlooking at the next generation, that breaking, the rap,\n\nthat everything else comes together\n\nand we stop being distant cousins,\n\nand we start being more like hip hop as a culture again.\n\nIs that on the horizon for you?\n\nI mean, I think that would be cool.\n\nI will be completely honest, even for myself,\n\nI know I'm way more disjointed to hip hop\n\nthan I probably should be.\n\nAnd again, like you said, as the generations get younger,\n\nthose things tend to separate a lot more.\n\nBut I think that's not just the job of breaking,\n\nthat's the job of the rappers, that's the job of the MCs,\n\nthe DJs, and the graffiti writers\n\nto bring that all together.\n\nBut it's hard because it does get disjointed\n\nand history gets blurred as the generations kind of move on.\n\nEven within the context of breaking,\n\nthere were some hip hop artists and rappers that came out\n\nand be like, Yo breaking is in the Olympics, this is cool.\n\nBut then there are other people being like,\n\nYo, that's whack.\n\nLike artists, like rap artists.\n\nSo it does, I don't think it's just our job.\n\nI think it's something that we should push,\n\nbecause history's extremely important.\n\nAnd to recognize where this comes from is to understand\n\nwhere that energy comes from.\n\nAnd what you were saying even before\n\nthe context of break dancing and breaking,\n\nwhy it's so important is because of history.\n\nBecause the reason it's called breaking\n\nis because they would dance on the break of a record.\n\nSo they would dance, the DJ would loop the break,\n\nso they would have two records of the same song,\n\nand they would loop the break.\n\nAnd on that break was the hypest part,\n\nit was when the drums were played.\n\nAnd so the dancers would start dancing.\n\nSo they would dance on the break of the song.\n\nThat's why we're called breakers, right.\n\nAnd because of that, the reason it's so important,\n\nfor some people you might see it as just a name,\n\nbut the reason is because of is context.\n\nIt's why this dance started.\n\nAnd that gets diluted further down you go.\n\nThe reason it's called break dancing\n\nis 'cause the media saw it and they were like,\n\nyou're just break dancing, you're breaking your bones\n\nand you're doing this crazy stuff.\n\nSo we're gonna call it break dancing.\n\nThat's why it's called break dancing, right?\n\nBut as generations keep moving forward,\n\nthat history gets diluted.\n\nSo it's important to understand that.\n\nTo understand where it comes from,\n\nto understand that that's where the energy came from.\n\nThat's why it's called what it's called.\n\nThat's why history is important.\n\nAnd I know myself, I have to do a better job of looking back\n\nand understanding that even more than I do now.\n\nAnd I know for future generations,\n\nit's my job then to teach that.\n\nBecause if you don't teach it,\n\nthen you start losing it.\n\nSo I do think that's a responsibility of anyone\n\nwho has a platform like myself,\n\nor any high level breaker.\n\nBut I also understand that I can do a better job of it\n\nas well.\n\nThank you so much my man.\n\nThank you very much.\n\n[Phil laughs]\n\nThank you so much Dexter, thank you for having me.\n\n[audience applauds]",
  "authors": [
    "Condé Nast"
  ],
  "url": "https://www.wired.com/video/watch/carrying-the-torch-a-conversation-with-phil-wizard"
}