{
  "title": "Logitech’s latest keyboard dabbles in enthusiast features",
  "text": "is a reviewer covering laptops and the occasional gadget. He spent over 15 years in the photography industry before joining The Verge as a deals writer in 2021.\n\nPosts from this author will be added to your daily email digest and your homepage feed.\n\nLogitech’s Alto Keys K98M mechanical keyboard is now available in North America after its initial launch in China and other select markets. The $119.99 Alto Keys K98M is an almost full-size 1800-layout keyboard, offering a slightly compact design that maintains a number pad. But what makes the K98M special for a mass-market Logitech board is that it’s fully hot-swappable with standard Cherry MX-compatible key switches and uses an internal gasket mount for a semi-soft typing feel. Logitech is taking some belated cues from enthusiast keyboards.\n\nThe Alto Keys has a two-piece plastic case with a translucent top portion and opaque bottom that’s color-matched to its included keycaps. It comes in white, graphite, and lavender color combos, with white backlighting and shine-through PBT keycaps. It’s a simple and clean aesthetic designed for mass appeal. As are its specs and features, like a claimed battery life of up to 12 months (with white backlighting turned off) and Bluetooth / Logi Bolt wireless connectivity — each usable on Windows, macOS, Linux, ChromeOS, iOS / iPadOS, and Android.\n\nPrevious Next\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n1 / 10 The 1800 layout is a nice compromise if you want a slightly smaller keyboard but won’t budge on the number pad.\n\nI’ve spent a little time with a review unit of the Alto Keys, and I’ve been enjoying its looks, sound, and typing feel. The translucent plastic case and visible internal gasket tray swooping around the perimeter gives the keyboard a nice, airy design. It’s particularly charming in the lavender color I’ve been testing, but the more conventional graphite and white models look equally clean. I imagine those colors offer a little more flexibility in the looks department if you want to put on your own keycaps. The customization goes further, since you can hot-swap the switches with thousands of other options for a bespoke sound and feel.\n\nBut the software is a different story. Logitech’s Logi Options Plus app is easy to use and has a nice UI for basic settings (backlight levels, timeout, auto battery saver mode, etc.), and it even displays toast-like onscreen pop ups when adjusting brightness or volume, reminiscent of a Mac. But the actual keyboard adjustments it offers are very restrictive. For example, you can only customize the alternate functions of 12 F-row keys. Cheaper keyboards using software like QMK and VIA can remap any key to just about anything.\n\nThe shine-through legends aren’t quite as cleanly defined as standard legends, but they look fine. One of the advantages of a plastic case is it can be see-through, which looks fantastic here. North facing LEDs are less desirable than south facing, as it can cause issues with some switch compatibility. Logitech’s Marble switches look bland but sound and feel nice.\n\nThe Alto Keys doesn’t have as big, bold, or distinct a sound as small-brand enthusiast boards with metal cases, but it still sounds pleasant to type on. It has a light, clacky sound that’s not overly loud and should be passable in all but the quietest offices. And just as the design is light and airy, the Alto board is easy on the fingers. Logitech’s marble switches that come installed have a linear travel of 3.5mm that’s smooth and with just enough weight in its 40 grams of actuation force to not be too heavy or feathery in each key press. The UniCushion gasket underneath gives the keys a touch of flex if you push hard, but there’s still an underlying firmness, so it doesn’t feel mushy.\n\n\n\n\n\nHere's what typing sounds like on the Alto Keys K98M with Logitech Marble linear switches(opens a new window) Here's what typing sounds like on the Alto Keys K98M with Logitech Marble linear switches:\n\nI’m overall impressed by the Alto Keys, and I hope we see more enthusiast-style influences come to Logitech keyboards — especially more translucent designs, because that’s just fun. But for $120, it’s competing with nicer prebuilt keyboards from smaller brands (a bunch of which I’ve rounded up in our recent buying guide). Many of those options from the likes of Epomaker, Wobkey, Chilkey, and others cost less while offering more expansive software customization and higher-quality materials (especially if you’re partial to metal cases). And if you don’t mind a plastic case, options from Keychron or a brand like Aula are around half the price.\n\nStill, this is the first interesting Logitech keyboard I’ve tried in a while, and I’m stoked to see more. Maybe next Logitech can bring over the 75-percent Alto Keys K75M, for those of us who don’t care for number pads.\n\nPhotography by Antonio G. Di Benedetto / The Verge\n\nCorrection, November 5th: An earlier version of this article misstated the price of the Logitech Alto Keys K98M. It is $119.99, not $149.99.",
  "authors": [
    "Antonio G. Di Benedetto"
  ],
  "url": "https://www.theverge.com/tech/810124/logitech-alto-keys-k98m-mechanical-keyboard-price-specs-impressions"
}