{
  "title": "Social Media Reboot: A Conversation with Jay Graber",
  "text": "Transcript\n\n[upbeat music]\n\nHey guys.\n\n[audience applauding]\n\nHello.\n\nYes, I'm WIRED senior writer Kate Knibbs,\n\nand I'm thrilled to be joined today by the CEO\n\nof the hottest social network of the moment, Jay Graber.\n\nBefore Jay was the CEO of Bluesky,\n\nshe founded a social platform\n\nand she also was vital to the development\n\nof the privacy-focused cryptocurrency Zcash.\n\nSo she's done a real tour of Silicon Valley activities\n\nand yeah, it's gonna be great.\n\nThanks for being here.\n\nThanks for having me, Kate.\n\nYeah, so I joined Bluesky about a year ago,\n\nand at the time it was still invite only\n\nand it was, you know, really, really popular\n\namongst a certain community,\n\nbut recently it's completely exploded\n\nand grown exponentially.\n\nHow many users are on there now?\n\nWe crossed 24 million recently.\n\nAmazing.\n\nAnd since it's grown so much,\n\nI'm curious if you can explain to anyone\n\nwho is still unfamiliar with the platform,\n\nwhat distinguishes Bluesky from its competitors?\n\nYeah, so Bluesky's really focused on user choice.\n\nWe try to give users a choice in their experience,\n\ndevelopers the freedom to build,\n\nand creators the ability\n\nto own their relationship with their audience.\n\nAnd so the way that we do that\n\nis it's built on an open network underneath.\n\nAnd that means that there's lots of experiences\n\nthat you can have on Bluesky.\n\nYou can customize your feed, you can control what you see,\n\nyou can control how other people interact with you.\n\nThere's a lot of tooling under the hood for that.\n\nAnd so that means that it's a better experience for people\n\nand ultimately that's what we're trying to provide.\n\nAnd, you know, it is a crowded playing field\n\nand you are emerging as like a new star.\n\nI'm wondering why do you think, you know, it was,\n\nthe world was so ready for innovation in this space?\n\nYeah, well social has gotten kind of stagnant\n\nover the years.\n\nWhen you have really strong network effects\n\nand people feel like they can't leave\n\nand there's no alternative,\n\nthen innovation kind of comes to a halt.\n\nAlso, the social companies have closed down the ability\n\nfor developers to build on them.\n\nAnd so stuff that used to happen,\n\nlike people building, you know, TweetDeck back in the day,\n\nstuff like that, doesn't really happen anymore.\n\nAnd so what we've done is opened that back up again.\n\nSo developers are building new things\n\nand users are coming in and finding out that,\n\nhey, you can do things differently here.\n\nYou can have a model of a social network\n\nthat lets you be social again\n\nand isn't, you know, having a for-you feed\n\nthat just shows you what the algorithm wants you to see.\n\nThere's the ability for you to go in\n\nand search for whatever you want,\n\nsee whatever you wanna see,\n\nand if you can't find it, you can go build it.\n\nI really, really appreciate that the search bar\n\ndoesn't say anything about AI.\n\nI thank you for that.\n\nIs there anything that, you know,\n\npeople, developers, or other people in the Bluesky community\n\nare doing that's especially exciting to you?\n\nYeah, there's a lot of stuff that's been built\n\nthat's really cool and that we're seeing for the first time.\n\nOne of them is starter packs.\n\nSo people are using this tool we built\n\nto connect with each other.\n\nAnd so if you want to bring your friend on, you can add,\n\nyou know, your hundred most recommended accounts\n\nor however many you want to a starter pack\n\nand then give that link to your friend\n\nor even put up a QR code and give that to people.\n\nAnd so that means that people\n\nare able to find their network very quickly.\n\nThe other thing people have done is\n\nthey've built tons of custom feeds.\n\nAnd so that means that if you are just looking\n\nfor maybe cat pictures today, that's all you wanna see.\n\n[Kate] I, that's usually me.\n\nYeah, you can search for that\n\nor you can just install a feed\n\nthat just shows you cat pictures.\n\nPeople have built multiple of these.\n\nAnd so this gives people a way to customize their experience\n\nmore than they've ever been able to do before.\n\nThat is amazing.\n\nAnd I think there was a QR code showing a starter pack.\n\nHopefully you guys all held your phones up and got that.\n\nBut, yeah, it's, I love the starter packs.\n\nThat's kind of, I know WIRED has one.\n\nYeah, there we go. There we go.\n\nSo, one of the parts of Bluesky\n\nthat I've been really curious to see how it develops,\n\nis, you know, for a long time Twitter\n\nhad verification badges\n\nand that helped journalists, and government officials,\n\nand celebrities, and people who might be impersonated,\n\nor might otherwise just really wanna prove\n\nthat they are who they say they are.\n\nYou know, the verification badges were sort of the way\n\nthat most of the major social networks\n\nwent about offering that service.\n\nRight now on Bluesky, the verification process\n\nI honestly find con kind of convoluted.\n\nEven though I'm a WIRED writer and I should be tech savvy,\n\nI really struggle to understand how to verify myself\n\nbecause you have to put your own domain name,\n\nyou have to register.\n\nI'm not even gonna do a good job explaining it,\n\nbut it's kind of complicated.\n\nAnd as you're scaling up, I'm wondering, you know,\n\nare you starting to think of other ways\n\nto verify accounts that are perhaps simpler?\n\nWhat is your plan there?\n\nYeah, this has actually been a topic of discussion\n\non the network this week,\n\nbut I can back up and explain the verification\n\nthat we do have right now,\n\nwhich is intended to put user control front and center.\n\nAnd so that is the custom domain name system.\n\nSo if you are the New York Times, you know,\n\nyou can have that just be your domain, right?\n\nWIRED I think is also, you know, their own domain.\n\nAnd so that means that you're able to\n\nshow whoever owns this website\n\nis the person behind the account.\n\nAnd so that means, you know, even senators\n\ncan get a senate.gov domain\n\nand only a person who controls the senate.gov domain name\n\ncan give that to people.\n\nSo this is a way for organizations or well-known websites\n\nto self-verify without needing someone in the middle,\n\nlike us, to do that.\n\nBut that is a little bit complicated.\n\nWe have the ability for you\n\nto actually buy your own domain name through us,\n\nbut that's not necessarily what everyone wants,\n\nparticularly people already have their own domains.\n\nIs is buying your own domain name a profit center for you?\n\nIt's something that we actually just put out\n\nto try to make it easier for people\n\nbecause that way you don't have to set it up yourself.\n\nAnd also people like shorter usernames.\n\nAnd so, you know, everyone has a bsky.social\n\nif you don't have your own custom domain.\n\nAnd so if you just want like, I don't know, jay.com,\n\nI could buy that and then have that as my username.\n\nAnd so it creates a shorter link,\n\nshorter handle you can have.\n\nBut the way that we're talking\n\nabout exploring new ways of verification,\n\nand this is being done sort of in the open on GitHub,\n\non the network people are chatting about it,\n\nis putting out some form of verification\n\nwhere we will be one verifier\n\nand then others can verify as well.\n\nAnd so, because again, going back\n\nto this being an open network,\n\nthat means that, you know,\n\nwe could verify some organizations,\n\nsome people have some process for that,\n\nmaybe display a badge or something, you know.\n\nWe haven't come to a final conclusion on this yet,\n\nbut then other folks could do that as well.\n\nAnd so you could have other organizations,\n\nother people out there\n\ndoing their own verification processes.\n\nAnd then as a user you can decide which you want to trust.\n\nAnd so,\n\nif you wanna trust Bluesky's check mark system, you can,\n\nthat'll probably be a default,\n\nbut if you wanna install a different one\n\nor, you know, use a different version of it,\n\nyou can go and search for that.\n\nAnd so that means that the trust is ultimately rooted\n\nin what you as the user want to see\n\nas the verification system you believe in.\n\nSo Bluesky itself wouldn't be verifying\n\nthe other verification systems.\n\nThe app is always able\n\nto do some amount of customization over like, you know,\n\nwhat things we recommend.\n\nSo, for example, we have tons of feeds,\n\nwe have tons of moderation services,\n\nand we might recommend some\n\nbecause these have been around for a while.\n\nThese are more trusted.\n\nBut over time I think people, including us,\n\nstart to build up trust in the systems that work best.\n\nAnd so, you know, one that just popped up last night\n\nprobably won't be at the top of the search results\n\nand people won't be using it a lot.\n\nBut if there's, you know, a credible organization behind it\n\nwhere a lot of people are using it,\n\nthen that'll rise to the top.\n\nGotcha. Okay, very interesting.\n\nWIRED might have to start up its own verification service.\n\nSo Jay and I actually talked\n\nfor the first time last February,\n\nand one of the most memorable things she said to me\n\nwas that she was determined that Bluesky\n\nwould not become inshitified with advertisements.\n\nYes. [audience members clapping]\n\nA lot has happened since then though.\n\nYou know, I don't think,\n\nI've always been a fan of this service,\n\nbut I didn't expect it to take off in the way that it did\n\nin the past few months.\n\nYou've scaled in a way that is really unique\n\nand at the same time you've also, you know,\n\ntaken some venture capital investments.\n\nI just can, I can imagine\n\nthat there's more pressure than ever\n\nto figure out ways to be profitable.\n\nI'm wondering, you know,\n\nhow are you gonna be profitable\n\nwithout inshitifying the platform?\n\nYeah, I mean our goal from the start has been to make sure\n\nthat our incentives end up aligned with users\n\nand the people who've built this ecosystem.\n\nAnd so the ways that we're moving into monetization is,\n\nas we announced recently, starting with subscriptions.\n\nBut we're gonna go into, you know,\n\nexploring some other avenues here.\n\nOne of the things we really believe\n\nis that money follows value.\n\nSo we've started to, you know,\n\na lot of the effort we've put in is just showing\n\nthat there's value in having an open network\n\nand being able to build on it\n\nand other people can participate in that.\n\nSo people building feeds, building moderation services,\n\nbuilding the things that are, you know,\n\nmaking this a valuable ecosystem.\n\nAnd so our goal in moving into that\n\nis to build some network services,\n\nthings that, you know, developers can tap into,\n\nyou know, users can tap into.\n\nAnd, you know, not necessarily going to go into great detail\n\non all this right now,\n\nbut like subscriptions are the first step.\n\nAnd then from there we're gonna explore things that like,\n\nkeep our incentives aligned with the ecosystem.\n\nAre you going to roll out subscriptions soon?\n\nThat was the plan, but we've had a lot of growth recently\n\nand so right now it's a bit in flux.\n\nYeah, what has been, you know, the hardest part\n\nof growing at this rate?\n\nWell, we have a pretty small team.\n\nWe have 24 million users and a core team of 20 employees.\n\nAnd so we're focusing on scaling,\n\nwe're focusing on making sure\n\nthat it remains a good experience as we scale\n\nand really delivering the features that, you know,\n\nbecome urgent as, you know, new types of users come on\n\nand new types of problems arise.\n\nLike you mentioned, verification was something that,\n\nyou know, we've, from the start,\n\ntalked about open ways to do verification\n\nthat allows other people to participate in the process,\n\nbut that's sort of need for it now\n\nhas accelerated those discussions.\n\nGotcha.\n\nOne thing that a lot of people have brought up to me\n\nwhen I've told them that I'm gonna interview you\n\nis, you know, since Bluesky has exploded in popularity,\n\nthere are certain groups of people\n\nwho are really, really taking to the network.\n\nJournalists are one of the groups, you know.\n\nJournalists, I think, we're all so overjoyed\n\nto have a place to post links to our stories\n\nthat doesn't throttle them,\n\nthat we're like just beyond thrilled.\n\nThere has been this major exodus from X\n\nin the wake of the election,\n\nbut also even prior to the election,\n\na lot of people had issues\n\nwith the way that Elon Musk was running it.\n\nSo there's a large influx of people\n\nwho basically share a worldview, share ideologies.\n\nYou know, I'd say most people would agree\n\nthat right now the majority of people using Bluesky\n\nare liberal.\n\nAnd I've had a lot of conversations with people\n\nwho really like the app but are worried\n\nthat it's just never going to reach a network effect\n\nof bringing in people that aren't liberals,\n\nbringing in, you know, people from the right,\n\nyou know, people are worried\n\nthat it's just gonna be an echo chamber basically.\n\nAnd I'm curious if you are worried about that.\n\nLike I could see a world in which you'd just decide\n\nthat that's the lane that you're in\n\nand you're gonna stick with it,\n\nbut then that obviously limits growth.\n\nBasically I'm asking like, do you want all the people\n\nthat are still on X to come join Bluesky?\n\nDo you want people who are far right to be on Bluesky?\n\nLike what, what is your hope for what the user base\n\nis gonna look like going forward?\n\nWell, at the end of the day,\n\nwe set out to change the way social media works\n\nfrom the bottom up.\n\nThat's why we built on an open protocol,\n\nthat's, you know, how we got started.\n\nAnd so our goal is to build this for everyone.\n\nBluesky's for everyone.\n\nWe have the ability for people\n\nto create the spaces that they want.\n\nAnd even now,\n\nthere's actually lots of Blueskies within Bluesky\n\nbecause you're able to create so much customization.\n\nAnd so the way this works is we just try to give the users\n\nas many controls as possible.\n\nSo whoever, you know, posts a thread has controls over,\n\nyou know, what happens in that thread to some degree, right?\n\nBecause we're thinking about this as your Bluesky account\n\nbeing like your own blog.\n\nIt's actually similar,\n\nbecause you actually can host your own data,\n\nyour own account, on your own service if you want.\n\nAnd so just like a person who puts up a blog post\n\ncan go in and, you know, have some control\n\nover their comment section,\n\nthe person who posts a thread\n\non Bluesky, on your micro blog,\n\ngets to have that kind of control.\n\nAnd then if somebody is, you know, quote posting you\n\nand you wanna get outta this conversation,\n\nyou're not feeling it, you can remove yourself\n\nfrom those quote-posts.\n\nAnd so that means that, you know, some people say,\n\nwell this starts to create an echo chamber\n\nbecause you're not, you know, listening.\n\nBut actually there's just a lot of ways\n\nthat social media has gotten a bit tiring\n\nfor a lot of people\n\nbecause you can't necessarily get out of the conversations\n\nyou don't wanna be in\n\nunless you completely stop using the app.\n\nAnd so our goal is to get things to a point, you know,\n\nwith the way that we're building this app\n\nthat people have controls over\n\nhow they wanna spend their time online.\n\nAnd so you can go in and design a experience\n\nthat is just quiet posters and mutuals,\n\nif you really want that.\n\nAnd that's just-\n\nWhat's a quiet poster?\n\nYeah, so those are actually feeds that people have built\n\nthat mean that it just shows you posts\n\nfrom people you follow that don't post that often.\n\nSo maybe you have that friend\n\nthat uses social media like once a month\n\nand normally they'll get drowned out\n\nin the people who are posting every hour\n\nand you would never see their posts.\n\nBut if you go into that feed, then you're seeing the people\n\nwho, you know, who have just posted over the past few weeks\n\nor the past month and you catch up on that.\n\nAnd then the mutuals are people who\n\nI follow you and you follow me,\n\nand then I like to hear from the people who I already know\n\nand like, that's the conversation I wanna be in.\n\nAnd then if you wanna go dip in\n\nand see what's going on in the broader world,\n\nyou can go to say the Discover feed\n\nor the Politics and News feed,\n\nand check in on everything going by,\n\nmaybe participate in those conversations\n\nand then, you know, swipe away from that\n\nor uninstall them when you're done\n\nwith that kind of a conversation.\n\nAnd so that means that the people who come on here\n\nstart to be able to design the spaces that they want.\n\nDo you think then in that way\n\nthat people will be able to design experiences\n\nthat they want,\n\nbut that means they'll be able to exclude, you know,\n\nseeing posts that they don't wanna see?\n\nDo you think that that's gonna basically put a limit\n\non how much Bluesky can ever sort of simulate a town square?\n\nThere's the spaces where those kinds\n\nof broad town square discussions are happening as well,\n\nbut following our philosophy of just giving users control,\n\nI think it's up to the user what they want to see.\n\nBecause I think when people don't wanna participate\n\nin that kind of discussion,\n\nthey just don't use that app anymore.\n\nOr they withdraw to, you know, a text message group\n\nor a discord group or someplace where they feel\n\nlike they can be having the conversations\n\nwith the people that they want,\n\nand then they come back when they want to,\n\nyou know, talk to strangers\n\nabout all the stuff happening in the moment.\n\nWe want to make it possible\n\nto talk about everything happening in the moment,\n\nall the broader conversations going on,\n\nand have that be going by.\n\nAnd then you can dip in and out of that stream as you wish.\n\nAnd the ability to link to stuff,\n\nas you mentioned really easily,\n\nand follow through on those links, is another part of this,\n\nwhich is just seeing Bluesky as being a gateway\n\nto the open web.\n\nWe wanna make social more like the web again.\n\nAnd so that means that, you know,\n\nyou can click through, like we love links.\n\nWe want you to be able to, you know,\n\ngo through to where people are having conversations,\n\nnot even just on the app,\n\nbut if you're going to go, you know,\n\nread that news article and then comment on it,\n\nYour personal Bluesky experience when you're designing it,\n\nwhat are you prioritizing?\n\nAre you going, you know,\n\nare you treating it more like discord situation?\n\nAre you going for these mutuals and quiet posters?\n\nLike what, what are, what's your ideal, you know,\n\nscroll through Bluesky look like?\n\nI actually do both\n\nbecause I wanna catch up on what's going on\n\nand there's actually a Catchup feed\n\nthat shows you the most popular posts in the last 24 hours.\n\nAnd so I like to go through\n\nand see what everyone else has been talking about,\n\nlike get the vibe of the network that day\n\nand then see what the Discover feed shows me.\n\nBut then sometimes I actually do\n\ngo into the quiet posters or mutuals feed.\n\nThere's also one I really like called the Moss feed,\n\nwhich is just like forest pictures\n\npeople have taken on their hikes\n\nand because it's picking the stuff up in an automated way\n\nfrom everything people post,\n\nthese are people who, you know, maybe a new user came on\n\nand just posted a picture of a hike\n\nwith a mossy rock or something.\n\nAnd it's just like stepping out of the stream\n\nof all the broader conversations for a moment\n\nand just visiting a quiet corner of the network.\n\nAnd then, you know, I don't spend all day on there,\n\nbut then I go back to what else is going on,\n\nmaybe make a post.\n\nAnd so that's within my experience of the app,\n\nI can have these different corners of it for myself.\n\nI'm definitely gonna check out the Moss feed.\n\nI love a bog.\n\nIt's one of my favorites.\n\nYeah.\n\nFive years from now, where do you want Bluesky to be?\n\nI want to change the way social works.\n\nI want us to have choice over what we see,\n\nto have an open marketplace of different algorithms,\n\ndifferent timelines.\n\nI want us to have lots of people participating\n\nin building moderation services.\n\nSo these questions about how social media is moderated,\n\nwho controls what you see, gets placed back in users' hands,\n\nin developers' hands,\n\nand in the hands of anyone who's interested\n\nin helping improve the situation, right?\n\nLike civil society organizations,\n\nacademic researchers who have ideas\n\nfor how social could be different.\n\nI had a talk recently with some folks\n\nwho are exploring pro-social algorithms.\n\nSo how do we get people\n\nto have better conversations with each other,\n\nmaybe from different perspectives\n\nor different parts of political spectrum\n\nthrough the ways that we build the algorithms actually.\n\nSo instead of highlighting the most outrage\n\nor the most engagement generating things,\n\nwhich aren't necessarily\n\ncausing people to change their minds,\n\nbut maybe actually driving them further apart.\n\nWhat if we build things that find the commonalities\n\nand bring people together?\n\nAnd those kinds of experiments\n\ncan be done on Bluesky right now\n\nbecause those researchers can build a feed,\n\nspin it up, get users to try it,\n\nand they don't have to go lobby a company for change\n\nor lobby regulators for change.\n\nThey can just experiment with what if we just change\n\nthis app that's giving us the ability to get our hands in\n\nand start, you know, making changes right now.\n\nI would love to test one of those algorithms out someday.\n\nOkay, we don't have that much time left,\n\nbut I do need to ask you about something.\n\nSo I was talking\n\nto our editor in chief, Katie Drummond, earlier,\n\nand she's a big Bluesky fan too.\n\nAnd I was talking about something that I had skeeted\n\nand she like visibly recoiled\n\nand she doesn't like the phrase,\n\nand if you guys aren't aren't familiar,\n\nBluesky's user base basically took it upon itself\n\nto call what you put out into the feed a skeet\n\nIt's kind of a play on a tweet\n\nand it doesn't have any other meaning.\n\nSo, you know, and now that you're blowing up,\n\nlike are we sticking with skeet?\n\nI have always called them posts.\n\n[audience and Jay laughing]\n\nI maintain that they are called posts\n\nbecause when we set out to do this,\n\nwe were not trying to invent new words,\n\nand we were building a protocol.\n\nSo there's gonna be other apps, there are other apps,\n\nthere's other things people use\n\nand not all of them are going to call posts the same thing.\n\nOn the other hand, this is very user-driven\n\nand, you know, the ecosystem evolves as it will.\n\nSo I'm gonna keep calling them posts.\n\nThe Bluesky app, when you go to post something\n\nsays post and quote post,\n\nbut there's other apps out there\n\nthat have called them skeets.\n\nDo you have a favorite post?\n\nLike one of those that\n\nuse rent free- My, yeah,\n\nLike is there any, is there any,\n\nI was gonna say do you have a favorite skeet,\n\nbut I'll call 'em posts.\n\nLike, is there a platonic ideal of a Bluesky post\n\nthat you look at and you think like,\n\nYeah, I did a good job.\n\nLike what's your favorite skeet?\n\nLet's see.\n\nWell the one that sprang to mind\n\nis somebody made a joke about vitamin water\n\nthat I still remember,\n\nand they said, you know, Oh, it's vitamin water.\n\nWhat vitamins does it have in it?\n\nPink.\n\nAnd that's how I feel about vitamin water,\n\nbut I still love it.\n\nSo I don't know why I thought of that,\n\nbut that's one of the ones I like.\n\nThere's just a lot of posts like that\n\nthat go by and make me laugh.\n\nNo, I'm honestly very, very impressed\n\nthat you came up with one on the spot\n\n'cause I didn't tell her I was gonna ask her that.\n\nThat is all the time that we have.\n\nBut, Jay, thank you so much for joining us and-\n\n[Jay] Thank you.\n\nEveryone should get a Bluesky account.\n\n[audience applauding]",
  "authors": [
    "Condé Nast"
  ],
  "url": "https://www.wired.com/video/watch/social-media-reboot-a-conversation-with-jay-graber"
}