{
  "title": "Immigration Lawyer Answers Immigration Questions",
  "text": "Transcript\n\nI'm Charles Kuck, law professor and immigration lawyer.\n\nI'm here today to answer your questions from the internet.\n\nThis is immigration support.\n\n[upbeat music]\n\nThis is a question from @DzambhalaHODL.\n\nOkay, I realize I don't understand the difference\n\nbetween a visa, a green card, a refugee,\n\nor an asylum seeker.\n\nA visa is actually a stamp\n\nthat a consular officer at a US consulate\n\nputs in a foreign national's passport\n\nto allow them to come to the United States\n\nand apply for entry at the airport or at a border.\n\nFor a visa, there's many different bases.\n\nFor example, you can get a visa to visit the United States.\n\nYou can get a work visa.\n\nOverall, there's 24 different types of visas\n\nto just come here temporarily,\n\nas well as an additional 30 immigrant visas\n\nto immigrate to the United States.\n\nA green card is actually evidence\n\nof somebody's permanent residence in the United States,\n\nthey call it a green card\n\n'cause it's green, kind of looks like a driver's license.\n\nA refugee is an individual who is outside the United States\n\nwho goes through about a two year vetting process\n\nand ultimately can become a permanent resident.\n\nThat refugee has to show\n\nthat they've been persecuted in some way abroad.\n\nAn asylum seeker on the other hand,\n\nis someone who is in the United States,\n\neither with or without a visa\n\nor who comes to the border and asks to apply for asylum.\n\nThey have to show to an immigration judge\n\nor the immigration officials that they have a fear\n\nof persecution in their home country\n\nbecause of their race, their religion, their nationality,\n\ntheir political opinion,\n\nor because they're a member of a social group, for example,\n\nbecause they're gay or they're lesbian.\n\nThis question's from u/cooldude010.\n\nHow hard is it to legally immigrate\n\nto the United States from the Mexican border\n\nif you are not a citizen?\n\nIt's basically impossible.\n\nIf you just show up at the border,\n\nyou have no legal right to remain in the United States,\n\nnor do you have a legal right to immigrate\n\nto the United States unless you are applying for asylum\n\nand even then you're likely to be detained\n\nand at that point you will have to show an immigration judge\n\nthat you have this fear of persecution\n\nof returning to your home country.\n\nThese types of decisions usually take months,\n\nif not a couple of years to adjudicate\n\nduring which time you might be detained.\n\nThis question is from u/jsanchez030.\n\nWhy are Americans who live overseas called expats,\n\nbut everyone else who does the same as called an immigrant?\n\nExpats is simply a term used by corporate America\n\nas they send US workers abroad for temporary assignments.\n\nGenerally speaking, if somebody stays in that country,\n\nthey become immigrants to that country.\n\nThere are people on expat contracts to the United States.\n\nYou just never hear about that.\n\nThis question from u/Ra21red.\n\nIn this day and age,\n\ncan you still marry someone for a green card?\n\nI tell individuals when they come to meet with me,\n\nyou have to fall in love first.\n\nIt's not just,\n\nHey, I'm gonna go find somebody to get married,\n\nthat's called marriage fraud\n\nand that is quite illegal in the United States,\n\nso the US Immigration Service pays a lot of attention\n\nto marriage cases, especially when the couple looks like\n\nthey don't really belong together.\n\nSomebody marries someone from another country\n\nand they don't speak each other's languages,\n\nat that point, the Immigration Service may have questions\n\nabout whether this is a real marriage.\n\nGenerally speaking, when you marry a US citizen\n\nand you are approved for a green card\n\nor permanent residence, you're only approved for two years.\n\nAt the end of those two years,\n\nyou have to go back to the immigration service\n\nand prove that you physically live together.\n\nImmigration requires, generally speaking,\n\nco-mingling of assets,\n\nshared bank account statements, for example,\n\nliving in the same location\n\nwith the lease in both your names.\n\nImmigration has an entire task force of men\n\nand women who go out\n\nand check whether this documentation is real,\n\nand I will tell you,\n\nthey do find people who try to scam this system.\n\nDo some people get away with it? Absolutely.\n\nDo most people get away with it? Absolutely not.\n\nI love this question from @DirkLosman.\n\nWhere do Americans immigrate to?\n\nDid you know that today there are over a million Americans\n\nliving in Mexico.\n\nIt's the highest source country for receiving Americans.\n\nYou can go anywhere in the world\n\nand you will find a, quote, expat community.\n\nThere's been a large increase in the number of Americans\n\nleaving the country since Donald Trump became president\n\nthe second time.\n\nA lot of other countries are welcoming Americans generally\n\nbecause Americans have money, Americans create jobs,\n\nAmericans have experience that maybe their countries lack.\n\nThis question from u/RelativeIncrease2215.\n\nH1B laid off. What are my options?\n\nAn H-1B is a work visa sponsored by a US employer\n\nfor a foreign national.\n\nUnder our current immigration laws,\n\nwhen an individual who has an H-1B is fired\n\nor quits their job, they have a 60 day grace period\n\nin which to leave the United States,\n\nchange their status to visitor or file a new employer H-1B\n\nif they wanna remain here,\n\nif they don't leave before the end of the 60 days,\n\nthey'll be put into deportation proceedings\n\nand ultimately deported from the United States.\n\nThis question is from u/Mammoth_Mastodon_294.\n\nCan Trump take away green cards\n\nor make it more difficult than current?\n\nYes, permanent residents\n\ncan actually lose their permanent residence\n\nunder a variety of circumstances.\n\nFor example, if they're convicted of a crime\n\nwithin five years of getting their green card,\n\nthey can be put into deportation proceedings\n\nand their residents can be taken away.\n\nIf they stay outside the country\n\nlonger than 180 days a year,\n\ntheir green card can be taken away.\n\nThe other reason that you see today in the news\n\nis individuals who may have misrepresented themselves\n\nto get permanent residence\n\nor they didn't fill out the forms truthfully,\n\nin that circumstance, their residence can be taken away.\n\nNothing is secure until you are a US citizen.\n\nThere are circumstances under which citizenship\n\ncan be revoked.\n\nGenerally it's because you have lied\n\non your citizenship application.\n\nThere is a specific question\n\nthat most people kind of laugh at\n\nthat is all in the application.\n\nHave you committed a crime\n\nfor which you have not been arrested?\n\nIf you have committed a crime\n\nfor which you have not been arrested\n\nand you're subsequently arrested,\n\nthey can use that as a basis to take your citizenship away.\n\nThis question is from u/EOFFJIM, and I love this question.\n\nIs Trump's gold card for $5 million a good or a bad idea?\n\nIf you're asking people that wanna buy residence\n\nfor $5 million, it's probably a good idea,\n\nbut it's likely a bad idea for everybody else.\n\nWe have a visa called the EB-5 immigrant visa.\n\nThis allows individuals\n\nto invest $1 billion in a business in the United States\n\nand create 10 jobs through that investment.\n\nThat person gets a conditional green card,\n\ngood for two years,\n\nso the program already exists since 1990 individuals\n\nhave invested this amount of money into the country\n\ncreating hundreds of thousands of jobs.\n\nWhy you'd want to pay more for it? I don't know.\n\nEurope and other countries\n\naround the world have created a golden visa.\n\nPortugal has brought in thousands of individuals\n\nwilling to invest somewhere in the neighborhood of 300,000\n\nto $500,000 and obtained residents\n\nand quickly they obtained citizenship\n\nwithin about three years.\n\nThis question from @RedSmil61893898.\n\nWhat jobs do immigrants take from Americans?\n\nThey don't take any jobs from Americans.\n\nAmerica is not just a pie that's this big.\n\nAmerica is a pie that grows every time somebody else\n\ncomes to the United States.\n\nNow, immigrants do jump jobs that Americans will not do.\n\nEverybody acknowledges this.\n\nThere are very few Americans with children\n\nwho tell their children,\n\nBobby, you should drop outta school\n\nand go pluck chickens at the chicken factory.\n\nWe're constantly telling our children to get skilled jobs,\n\nto go to college, to go to trade school.\n\nWe're not telling to do unskilled jobs,\n\nwhich we still have a need for in the United States.\n\nThere are likely salaries at which you could pay individuals\n\nto do these very difficult jobs,\n\nbut then you'd have to sell the product\n\nof those jobs at prices that nobody would buy that product,\n\nby a continual supply of immigrants to the United States\n\nyou enable us to grow our economy\n\nand at the same time allow jobs\n\nthat would likely be outsourced to other countries\n\nto remain in the United States.\n\nSilicon Valley is, for example, a great example of this.\n\n49% of the companies started up in Silicon Valley\n\nin the last 30 years have been started up by immigrants,\n\npeople who bringing their ideas to a country\n\nwhere those ideas can be put into action.\n\nThis question is from @Loonatic24.\n\nHow much do immigrants contribute to the USA GDP?\n\nImmigrants generally are younger,\n\nso virtually all immigrants in America today\n\nactually work in jobs.\n\nThat's true whether they're undocumented or documented.\n\nThe undocumented population are not getting welfare,\n\nthey're not getting benefits.\n\nThey're not using free healthcare.\n\nThey're working every day in jobs that Americans won't do.\n\nA lot of people complain about immigrants\n\nthat have come to the border illegally,\n\nbut why are these individuals coming\n\nto the border illegally?\n\nNobody invited them to come except we did,\n\nand I'm not talking about politicians.\n\nI'm talking about our economy.\n\nOur economy has invited people to come.\n\nNow that has been cut off in this administration,\n\nso you're seeing far fewer people come to the border\n\nbecause they don't feel invited anymore.\n\nToday, if we were to deport all\n\nof the undocumented in the United States,\n\nwe would go into an instant recession\n\nbecause we have nobody\n\nto backfill those jobs in the United States.\n\nSo this idea\n\nthat immigrants are a drag on our economy\n\nis one of the greatest falsehoods that exist,\n\nin fact, they're a boom to our economy.\n\nThis question is from @Kram_Della_Kram.\n\nWhy are immigrants more likely to start a business\n\nthan that of the domestic population?\n\nI am a living example of that.\n\nMy own grandparents came from farms in Germany\n\nduring the depression.\n\nWhat did they do as soon as they got here?\n\nThey created businesses.\n\nThey saw opportunity\n\nbecause they can employ themselves,\n\nthey can open up a little store.\n\nImmigrants do this because they're driven,\n\nlazy people do not walk across the desert.\n\nThat's why immigrants are more likely to create businesses.\n\nThis question from an @AnAimlessJoy.\n\nWhat is chain immigration?\n\nI see people talking about it a lot.\n\nChain immigration is a derogatory term\n\nput on family-based immigration by anti-immigration\n\nand nativist activists in the United States.\n\nThe chain is this.\n\nYou immigrate to America through your job for example,\n\nwhen you become a citizen,\n\nyou can sponsor your parent to come to the United States.\n\nYou can also sponsor a child\n\nor sibling to come to the United States\n\nand they can sponsor their parent,\n\nhence the quote chain immigration.\n\nRegular people call it family-based immigration\n\nand family immigration has been the core immigration\n\nto the United States since 1952.\n\nOver 70% of our visas every year are family-based visas.\n\nThis question from @adrianbosco.\n\nWhat is the crime rate of illegal immigrants\n\ncompared to the general population?\n\nInteresting question because the data is very sparse\n\nand until recently,\n\nonly one state actually tracked that data,\n\nthe great state of Texas,\n\nwhenever they arrest anyone,\n\nthey find out their immigration status\n\nand they publish those records online for the world to see.\n\nUndocumented immigrants commit crimes at a much lower rate\n\nthan US citizens.\n\nWhy is that, well, if you're undocumented,\n\nyou don't commit crime because you know you'll be caught\n\nand sent back to your home country\n\ndespite what you see on the ICE Twitter feed every day,\n\nundocumented immigrants are generally law abiding,\n\nthey have strong families,\n\nthey go to church on Sundays, many own businesses.\n\nThis question from @mmbrenn.\n\nDo illegal immigrants vote in the United States?\n\nNo, because they can't vote.\n\nUndocumented immigrants, no, they can't vote.\n\nIn federal elections, only US citizens can vote,\n\nin state elections, only US citizens can vote.\n\nSometimes in municipalities,\n\nthey allow every person resident in that municipality\n\nto vote but for the most part,\n\nyou have to be a US citizen to vote in the United States,\n\nunder President Bill Clinton\n\nwe created a law called Motor Voter,\n\nwhen you applied for a license\n\nthey registered the vote.\n\nFrequently in the 90s\n\nand the early 2000s they registered everybody\n\nwho got a license, including individuals at the time\n\nwho were immigrants to the United States,\n\ndid a couple of those vote, yeah.\n\nEvery year you're talking about in the entire country,\n\nfewer than a couple of dozen people vote illegally,\n\nwe're constantly in search of a solution to a problem\n\nthat doesn't exist on illegal voting.\n\nThis question from @joshieyamaguchi.\n\nWhere's Anna Delvey?\n\nBetter question, who's Anna Delvey?\n\nAnna Delvey is from Inventing Anna fame.\n\nShe had defrauded a number of individuals\n\nhere in New York claiming to be a German princess\n\nof some kind.\n\nUltimately, she was convicted\n\nand served time in state prison\n\nand was picked up by ICE at the end of her sentence.\n\nShe was ordered deported by an immigration judge,\n\nbut she hired a really good lawyer, me,\n\nand we were able to overturn her deportation decision\n\non appeal.\n\nShe currently awaits a new decision from immigration judge,\n\nnot in ICE custody.\n\nShe was secured release and is living in her apartment.\n\nShe's currently under ICE detention with an ankle monitor\n\nand occasionally you see her on television.\n\nGood luck, Anna.\n\nThis question from @kdoright.\n\nCan ICE arrest people without a warrant,\n\nand if so, if they're not wearing a uniform, a badge,\n\nor an ID, how are people supposed to trust them?\n\nICE can arrest individuals without a warrant\n\nwithin a 100 mile zone around the entire United States.\n\nThis includes 70% of the US population.\n\nSo if you're in New York City,\n\nan ICE officer walks up to you on the street and says,\n\nShow me your papers, entirely legal for them to do that.\n\nThey also don't need a warrant to arrest someone\n\nwho they can positively identify as being in violation\n\nof US immigration law.\n\nNow, they do need a warrant to enter a home\n\nunless they're in active pursuit of an individual.\n\nNow, you're seeing today a lot of videos\n\nof ICE officers out there with no ID\n\nor ID that misstates who they are, the police,\n\nICE is not the police,\n\nor refusing to identify themselves\n\nas they arrest individuals,\n\nbut until you have an administration\n\nthat enforces requirements that they wear uniforms\n\nand identify themselves, you will see this continue\n\nuntil Americans get tired of it.\n\nThere are a number of US citizens that have been arrested\n\nbecause they look foreign,\n\neither they don't speak English very well\n\nor they don't have papers with them,\n\nin parts of the United States\n\nwhere that is outside the 100 mile zone,\n\nwhat ICE can do is they can surveil locations.\n\nFor example, an apartment complex,\n\nmostly populated by immigrants.\n\nICE walks around on their phones with an app,\n\nwith the photos of anyone who's ever given their photo\n\nto many DMVs, passports and immigration.\n\nIf you come up as somebody in their phone\n\nknown to be undocumented,\n\nthey will just arrest you without you saying anything.\n\nBut our advice as lawyers, as you simply remain quiet,\n\nif you're not under arrest, you ask, Am I being detained,\n\nI'm not being detained, walk slowly away.\n\nIf they say they're detaining you, you are under arrest\n\nand then you say, I'm not speaking without a lawyer.\n\nDon't resist arrest.\n\nDon't run away, but you have no obligation to talk to them.\n\nICE did in January revoke guidance\n\nthat prohibited them from going to places like schools\n\nand churches and hospitals.\n\nThey're not going to those places generally speaking\n\nbecause there was a lot of pushback\n\nand a lot of litigation that was mostly filed\n\nagainst the Trump administration\n\nfor revoking those policies.\n\nBut they are arresting people outside of schools\n\nso people just don't send their kids to school.\n\nThis question from @B1llyHossness.\n\nWhat is inhumane about ICE deportations?\n\nHow are they different from Obama's 3 million?\n\nDeporting people has been part of our immigration laws.\n\nAt the same time,\n\nthe conditions under which individuals are held\n\nand the places to which they are sent\n\nare inhumane in some circumstances.\n\nFor example, sending an individual from Vietnam\n\nor Cambodia who cannot be deported to their home country,\n\nto Sudan, a country in the middle of a civil war,\n\nthat is inhumane\n\nbecause this is done to punish people in ways\n\nthat a regular deportation,\n\nwhich is terrible for many people, does not do.\n\nObama is known in the Latino community\n\nas the Deporter In Chief,\n\nhe deported more people than Trump could ever hope to deport\n\nbecause he was first of all in for eight years.\n\nBut they can't deport people very fast\n\nbecause even immigrants are entitled to due process.\n\nThat means they're entitled to go in front\n\nof an immigration judge\n\nand present their case for staying in the United States.\n\nThe Obama administration weaponized the immigration laws\n\nby deputizing sheriffs around the United States\n\nwho detain people for traffic violations.\n\nThey would detain them\n\nand then Obama's ICE would arrest them.\n\nKeeping people in these immigration facilities,\n\nwhich are not prisons, they are worse.\n\nThese are holding facilities\n\nwith nothing but three crummy meals a day\n\ngenerally under very terrible conditions,\n\nand people who are stuck there for 3, 4, 5 months\n\neventually give up.\n\nThat's what Obama was successful at\n\nand what Trump is trying to repeat\n\nwith places like Alligator Alcatraz and Speedway.\n\nThey're trying to make it so bad for people\n\nthey will just give up their due process rights and leave.\n\nThis question from @contempathy916.\n\nAre legal immigrants being deported?\n\nAbsolutely, they're being deported.\n\nLegal immigrants are individuals\n\nwho are in the United States on work visas or travel visas\n\nafter they go through a process.\n\nNow there's different processes depending on where you are.\n\nIf you show up at an airport\n\nand you have a permanent resident or a green card,\n\nbut you've been gone for a year,\n\nthese officers will generally threaten individuals\n\nand say, You've been gone too long,\n\nI'm taking your green card away and sending you away,\n\nif you wanna fight this, I'm gonna keep you in jail.\n\nNo permanent resident who's legal wants to stay in jail\n\nso they turn around and go away.\n\nOr individuals in the United States,\n\nlegal permanent residents\n\nwho it has found out obtain their residence unlawfully\n\nor who commit a crime,\n\nthey're absolutely being put into deportation proceedings\n\nand being deported, can they ultimately be deported?\n\nFederal courts are ruling\n\nagainst the Trump administration on this\n\nand saying, Look, the First Amendment\n\ntrumps the immigration laws.\n\nResidents have rights including First Amendment rights\n\nin the United States.\n\nQuestion here from u/Sad_Analyst_4470.\n\nShould someone show up to court and risk deportation?\n\nThis question really focused on the reports\n\nthat we're seeing of ICE officers in the hallways\n\nof immigration court arresting people\n\nafter they come out of their immigration court hearing.\n\nIn 1996, while Bill Clinton was president, he signed a law\n\nthat said, Anyone who's in the United States\n\nless than two years can be deported without a trial.\n\nThis is called expedited removal.\n\nThese people show up in immigration court\n\n'cause they have a pending asylum case.\n\nICE lawyers are telling the judge,\n\nJudge, we no longer wanna pursue this person's deportation,\n\nwe wanna cancel the case.\n\nSo the person walks out thinking for some reason,\n\nnot understanding why their case is canceled,\n\nand then they encounter the ICE officer outside\n\nwho has their name on a sheet and has their picture\n\nand says, Oh, we're here to arrest you\n\n'cause your case was terminated,\n\nand then haul 'em downstairs in the building\n\nand off to ICE detention center.\n\nIf that's gonna happen to you,\n\nshould you show up for your deportation hearing?\n\nAs a lawyer, I have to tell you,\n\nyou have to show up for your hearing,\n\nbut are people not showing up for their hearing?\n\nAbsolutely.\n\nFailures to appear are skyrocketing in immigration courts\n\nbecause what's worse,\n\nnot showing up for your court hearing\n\nand getting a deportation order\n\nor showing up to your court hearing and being arrested?\n\nThis question from u/throwaway 102013.\n\nWhat should you do if you are a US citizen\n\nand get deported by ICE?\n\nOne, you should call your family\n\nand have them talk to reporters right away\n\n'cause you need to get press on this issue right away.\n\nPress solves problems.\n\nHas this happened? Absolutely it's happened.\n\nThere have been US citizens\n\ndeported from the United States by accident.\n\nWhat they need to do is go to the US Embassy\n\nin whatever country they were deported to\n\nand say, I'm a US citizen,\n\nhere's proof of my US citizenship.\n\nIf you don't have your passport, which you likely don't,\n\nthey will give you a travel document\n\nto return United States.\n\nThat will not happen overnight.\n\nThat will likely take weeks,\n\nbut that absolutely happens today\n\nand will continue to happen under the Trump administration.\n\nThis question from r/AskAnAmerican.\n\nHow dangerous is it really crossing the border?\n\nOur side of the border in all the cities like El Paso,\n\nSan Diego, Brownsville, very safe.\n\nOn the Mexican side of the border,\n\nthat opposite side is dangerous, it is run by gangs.\n\nThere's extortion, there's rape.\n\nPeople die crossing the border\n\neither because of drowning along the Texas border\n\nor die in the desert of thirst crossing the Arizona\n\nand California deserts.\n\nI would not recommend it to anybody.\n\nIt's just very, very dangerous.\n\nQuestion from @yaafacomadre.\n\nSo if I get deported, what happens to my debt?\n\nNothing happens to your debt. It's still your debt.\n\nIf you're able to come back one day,\n\nthat debt will still be there.\n\nLikely that debt is tied to a social security number,\n\nwhich you will always have even if you come back legally\n\n20 years from now, sorry.\n\nThis question from u/mtmag@dev52.\n\nThoughts on the differences between Jus Soli\n\nand Jus Sanguinius bases for citizenship and nationality,\n\nor how they are misused by modern politicians?\n\nWhat do you think is the best form of citizenship?\n\nJus Soli means citizenship is based\n\non where you are born,\n\nand Jus Sanguinius is citizenship based on blood or family.\n\nThe United States has a system based on both.\n\nIf you are born in the United States, you are a US citizen.\n\nUnless your parent is a diplomat,\n\nmaybe you don't like that idea.\n\nI personally think it's a good idea\n\nbecause it establishes continuity.\n\nThere are a number of countries around the world,\n\nmainly in the Middle East\n\nwhere if you're born there, you're not a citizen.\n\nSo there are workers, three generations old in Saudi Arabia.\n\nTheir parents were born there, they were born there,\n\nthey are not Saudi.\n\nIf they leave for six months, they can't go back,\n\nwhich creates stateless people, which creates refugees,\n\nwhich creates broader problems around the world.\n\nOh, this is a great question.\n\nThis question from u/NoEggNoPlan.\n\nWhat would revoking birthright citizenship look like?\n\nFirst of all, you could not do it retroactively.\n\nWhat Trump has done is revoke it going forward,\n\nsaying, As of originally February,\n\nanybody born in the United States\n\nwhose parents weren't citizens or permanent residents,\n\neven if their parents were legally here are not citizens\n\nof the United States,\n\nwhat would that look like going forward?\n\nCreating an entire class of stateless individuals.\n\nOur immigration laws don't let those kids\n\nsponsor those parents until those parents\n\nare out of the country for 10 years\n\nso the parents aren't getting any benefit\n\nout of their kids being born here\n\nthat is any way immediate\n\n'cause you can't even sponsor your parents till you're 21.\n\nAt the same time, what are you gonna tell the kid?\n\nThe kid's not going anywhere now they won't have papers.\n\nAre you gonna make them a resident?\n\nAre you gonna give them a visa?\n\nWhat are you gonna do for those kids?\n\nThis is a terrible idea whose time I hope will never come.\n\nThis question from u/Arktikos02.\n\nHow would you define the difference\n\nbetween assimilation and integration?\n\nAssimilation is an individual who adopts the mannerisms\n\nand the culture of the society in which we come.\n\nIntegration is just being part\n\nof the society of the economy.\n\nIt's not necessarily adopting every characteristic\n\nof that society.\n\nThere's a lot of complaint in 2025\n\nthat immigrants don't assimilate.\n\nThis is simply not true.\n\nIf you're looking for immigrants the day they get here\n\nto start having barbecue in their backyard with hot dogs\n\nand hamburgers and abandon their culture\n\nthat they grew up with\n\nand live with for a big part of their lives,\n\nyou would be going against the entire cultural history\n\nof the United States, and it's not like you come to America\n\nand are sworn in as a citizen\n\nand we say, Hey, here's all these classes\n\nto teach you to be American.\n\nImmigrants come to America\n\nand they integrate into our economy through jobs.\n\nThey integrate into our schools through their kids,\n\nwhether their own education, but assimilation takes time.\n\nSometimes it takes a generation\n\nand if you wanna help people start a class in your area\n\nto teach them English, start a culture class,\n\ndo things to help them assimilate.\n\nI remember as a child in the 1960s\n\ngoing with my grandparents to German social halls\n\nwhere individuals only spoke German, played German music,\n\nhad German food.\n\nThose social halls do not exist today, assimilation.\n\nAnd Quora User asks,\n\nWhat happens to all the paper forms you fill out\n\nfor immigration and customs?\n\nI'm sorry I'm laughing 'cause yes,\n\nthey're still using paper.\n\nNow, USCIS, which is the Immigration Service Agency\n\nthat runs and deals with most of the visas\n\nand green cards and citizenship,\n\nthey are moving towards an online filing system,\n\nbut there are still billions\n\nof paper records in immigration vaults around the world.\n\nICE on the other hand, ICE is all paper\n\nand it's a paper nightmare,\n\nis actually causing problems for the Trump administration\n\n'cause they can't get the paper process fast enough\n\nto get people into removal proceedings,\n\nin respect to data protection in filing paper forms,\n\nprobably the least protected form of data\n\nis a piece of paper which can be copied or photographed\n\nand sent around the world.\n\nThe USCIS actually has a very robust\n\nonline filing system that is protected\n\nby several different layers\n\nand likely complies with every governmental standard\n\naround the world for protection of data.\n\nIt'd be much better for them to move more quickly\n\nto online data filing,\n\nbut the reality is they simply don't have\n\nthe physical capability of doing that yet.\n\nAs a follow-up question from @Phonex2717.\n\nCan you explain what an F1 visa is and can it be revoked?\n\nWell, we just saw a mass revocation\n\nby the Trump administration in March\n\nand April of this year of a number\n\nof F1 visa holders actively studying the United States.\n\nThe Trump administration ran all 1.4 million students\n\nwho are here in the United States through the NCIC\n\nto see if they'd ever been arrested for anything,\n\nand approximately 6,000 fingerprint hits came back.\n\nThe Trump administration sent out notices,\n\nHey, we're revoking your visa\n\nbecause you showed up in the hit.\n\nThe problem was, and I don't know if you know this or not,\n\nbut the police do arrest innocent people\n\nand the vast majority of these individuals\n\nhad no convictions\n\nand thus no legitimate basis to have their visas revoked.\n\nLawyers in more than 200 lawsuits\n\naround the country in April, including myself\n\nand our firm were able to reinstate these students\n\nand get their status put back into place.\n\nWe are now litigating the actual visa revocation\n\nin federal court in Washington DC for these students.\n\nVisas can also be revoked if you are convicted of a crime,\n\nif you get bad grades, if you take too few classes,\n\nall those are reasons to revoke a student visa\n\nin the United States.\n\nThis question from u/Budabing.\n\nWhat were the main reasons\n\nfor the age of mass migration from 1850 to the mid 1900s?\n\nAnd we can answer it with this chart.\n\nIn 1850, we were coming up on the Civil War\n\nin the United States.\n\nAt the time, there were approximately 2.4 million immigrants\n\nin the United States, 10% of the US population,\n\nstarting in 1865 shortly after the Civil War,\n\nour population increased to more than 15%\n\nof immigration doubling during that timeframe\n\nin actual population, for the next 40 years,\n\nimmigration continued at a very rapid pace.\n\nIn 1924, our Congress passed laws\n\nthat limited legal immigration\n\nto the United States from everywhere in the world\n\nother than Western Europe.\n\nWhat happened after 1924 up until 1965 is\n\nthat the percentage of immigrants in America went down.\n\nThere were no immigrants coming\n\nand we went down to about 5%,\n\nbut since 1965 with the passage of the Immigration Act\n\nand the restoration of worldwide immigration\n\nto United States our numbers of immigrant population\n\nhas increased dramatically\n\nwhile we have many more immigrants in America today\n\nthan we did in 1860,\n\nwe have many more people in the United States as well,\n\nsuch that today the percentage of population\n\nis basically a little bit less than it was in 1860,\n\neven though we have many more immigrants in America.\n\nThis next question is from u/AppropriateDebt9.\n\nHow were previous immigration peaks perceived\n\nat the time in the United States?\n\nPeople who lived in the United States as Americans in 1910\n\nto 1924 had the same reaction as we're having today.\n\nAn anti-immigration fervor\n\nbecause people are generally afraid of things that are new\n\nand when they see signs in Chinese going up\n\nor people in school speaking Spanish to their kids,\n\nthey get afraid of that.\n\nThis is human nature\n\nand it's something that America has typically overcome\n\nafter a period of time.\n\nHopefully, we've learned from our history\n\nand we'll overcome that more quickly today.\n\nThis question is from @chicojuanito395.\n\nHow do undocumented immigrants pay taxes?\n\nI would gladly hire undocumented,\n\nwhich by the way would be a crime,\n\nbut everybody else pays taxes\n\nso you're not getting away with not paying.\n\nIf you have work authorization documents\n\nthat really isn't undocumented, right?\n\nSomebody explained like I'm five.\n\nFirst of all, undocumented immigrants pay billions\n\nof dollars in taxes every year in the United States,\n\nnot just through income tax\n\nbecause they do pay income taxes with a taxes ID number.\n\nThese individuals do pay taxes as well on their food.\n\nThey pay taxes on their rent. They pay property taxes.\n\nThey pay taxes just like Americans do\n\nat every level of society.\n\nSo undocumented immigrants are not getting away\n\nwith not paying taxes.\n\nAnd finally,\n\nif somebody does have work authorization document,\n\nthat means they have the ability to work\n\nand have a social security number and you can hire them\n\nand they will pay taxes.\n\nOur next question is from @DonovanVice.\n\nWhat if we just stopped immigration for a year\n\nand saw what happened, see how things go,\n\nand then we can decide the right balance.\n\nWhy would that be so terrible?\n\nAsk the guy in love with the British woman\n\nif he could just wait a couple years to bring her over.\n\nAsk the employer who wants to bring in the lead scientist\n\non his project to create thousands of jobs for his company.\n\nAsk the family who wants to bring dad to the United States\n\nso they can take care of him as he enters Alzheimer's.\n\nThe reality is we need immigration\n\nand we need it every year.\n\nWe need to grow our country\n\nto remain competitive around the world.\n\nYou cut that off\n\nand it'll be like cutting off your nose to spite your face.\n\nHopefully our politicians in 2025\n\nwill continue to understand that.\n\nThat's all the questions for today, until next time.\n\n[upbeat music]",
  "authors": [
    "Condé Nast"
  ],
  "url": "https://www.wired.com/video/watch/tech-support-immigration-lawyer-answers-immigration-questions"
}