{
  "title": "Yes, You Can Cook A Completely Frozen Turkey — Here's What To Do If Yours Is Still Frozen",
  "text": "The days leading up to Thanksgiving usually go something like this: You pull your turkey out of the freezer over the weekend and leave it in the refrigerator to thaw until the holiday. You unwrap and prep the bird on Wednesday night so it’s ready to go into the oven Thursday morning.\n\nBut what if you forget all of these steps? Are you absolutely doomed? Or is it possible to just put the turkey straight into the oven from the freezer?\n\n“You can cook a turkey straight from frozen,” said Olivier Palazzo, head chef at Sendero Hotel & Villas in Costa Rica. “It’s not ideal, but it works.”\n\nAdvertisement\n\nCooking a fully frozen turkey should be a “last resort thing,” Bill Nolan, a chef and Butterball Turkey Talk-Line supervisor, told HuffPost. “It’s not something I would plan on doing or saying, ‘I think I’ll save some time not thawing my turkey.’”\n\nStill, you may run into this situation. Maybe you forgot to thaw your turkey, or you just didn’t feel like dealing with it. In these instances, you probably have lots of questions about cooking the bird from frozen, and we asked chefs and turkey experts to offer their best advice.\n\nElena Veselova / 500px via Getty Images It may not come out quite as good, but you can still get the job done.\n\nAdvertisement\n\nWhat temperature should you set your oven?\n\nNolan, who’s gotten questions about cooking frozen turkeys at the Talk-Line, recommends cooking a fully frozen turkey at the same temperature that you’d cook a thawed turkey: 325 degrees Fahrenheit.\n\n“It really works best if it’s just a constant temperature of 325,” he said.\n\nHeidi Diestel, a fourth-generation farmer at Diestel Family Ranch, a turkey farm in Sonora, California, told HuffPost that she agrees low and slow is a good recommendation, as you’re “going to be thawing the bird as it’s roasting.”\n\nHowever, others have different suggestions. Eric Rowse, lead chef-instructor of culinary arts at the Institute of Culinary Education’s Los Angeles campus, told HuffPost that he’d start a frozen turkey at 350 degrees Fahrenheit and then crank it up to 450 to crisp the skin, “if for some unholy reason I was going to put a frozen bird in the oven.”\n\nAdvertisement\n\nHow do you unwrap the turkey and remove the bag of giblets?\n\nThe wrapper should easily peel off a frozen turkey, Rowse said.\n\nAs for the giblet bag typically found inside the turkey, he suggested running cold water inside the cavity to help defrost the area around the bag to remove it. But, Rowse added, “Be wary of splashes. You don’t want droplets of potentially salmonella-laced turkey juice all over your kitchen or in other food.”\n\nAnother option is to wait until the turkey cooks a little bit, Palazzo said. After a couple of hours, it should be thawed enough to remove the giblet bag. Be sure to use tongs or a spoon, he said.\n\nYou can leave the neck to roast inside the cavity, Diestel added.\n\nHow long will it take to cook?\n\nA 12- to 14-pound thawed, unstuffed turkey will likely take 3 hours to 3 hours and 45 minutes to cook, according to the U.S. Department of Agriculture.\n\nAdvertisement\n\nA fully frozen bird of the same size may take “one-and-a-half times as long,” said Nolan, adding that the Talk-Line’s test kitchen has tested cooking a fully frozen turkey. That means a frozen 12- to 14-pound turkey may take 4 1/2 to 5 hours or longer.\n\n“It’s an all-day, slow roast kind of situation,” Palazzo said.\n\nAnd if you’re worried about safety, have no fear — as long as the turkey eventually reaches a safe temperature, you’re fine. The USDA recommends the breast be cooked to 165 degrees Fahrenheit.\n\nWhat are some other tips for cooking a frozen turkey?\n\nExperts offered a few other suggestions for cooking a fully frozen turkey:\n\nPlace it breast-side up on the roasting pan, Palazzo said.\n\nConsider cooking the bird in an oven bag , Diestel added. This helps keep it from drying out, as frozen birds need to cook longer.\n\nAvoid stuffing a frozen turkey, Palazzo said. Stuffing increases the cook time and could pose some extra safety risks.\n\nNever deep-fry a frozen turkey, Diestel said. “That will cause a fire.”\n\nWill the turkey come out the same?\n\n“It’ll be pretty good,” Nolan said.\n\nBut your turkey could come out drier, Rowse said. “By the time the interior gets to a safe temperature, the outside is going to be so overcooked and dry.”\n\nThe skin also might not crisp up, especially if you’re using a cooking bag, Diestel noted.\n\nTo help prevent dryness and soggy skin, Palazzo said, “Keep rubbing it with butter, and as it starts to thaw, season with salt, pepper and cover with foil for the first few hours, so it doesn’t dry out.”\n\nShould you cook a fully frozen turkey?\n\nWhile it’s doable, the experts we spoke to don’t recommend it.\n\nInstead, they suggest taking the time to thaw the turkey, which Nolan said you can actually do quickly the day before. Submerge an unopened frozen turkey breast-side down in enough cold water that covers it completely. Change the water every 30 minutes. This method takes about 30 minutes per pound to thaw, which equates to about seven hours for a 14-pounder.\n\nAdvertisement\n\n“You might have to stay up late, but you can get it thawed,” Nolan said.\n\nAnother option, Diestel said, is to host Thanksgiving another day and let the turkey fully thaw in the fridge.\n\n“To me, it would be really stressful to have this frozen bird in the oven,” she said. “You’re trying to roast it. It’s going to take double the amount of time.”\n\nIf you do plan to cook a fully frozen turkey this Thanksgiving, know that it needs a little extra care, Palazzo said.\n\nAdvertisement",
  "authors": [
    "On Assignment For Huffpost"
  ],
  "url": "https://www.huffpost.com/entry/how-to-cook-a-frozen-turkey_l_6913639ee4b0d0f8e6ce557d?origin=life-featured"
}