{
  "title": "FBI-wanted 'Cryptoqueen' issued court ultimatum",
  "text": "Court ultimatum for 'cryptoqueen' wanted by FBI\n\n16 hours ago Share Save Rob Byrne Channel Islands Share Save\n\nFBI Ruja Ignatova has until 16 December to object to her assets being seized\n\nA fugitive wanted by US authorities has been given 28 days by Guernsey's government to object to her assets being confiscated. Ruja Ignatova, 45, known as the Missing Cryptoqueen, has until 16 December to object to a forfeiture order being brought at Guernsey's Royal Court. Ms Ignatova has not been seen in eight years, disappearing days after an arrest warrant was issued for her in the United States. In 2014, she founded the fraudulent OneCoin cryptocurrency, which saw investors lose more than $4bn (£3.2bn), according to the Federal Bureau of Investigation (FBI).\n\nThe order is being sought on behalf of German authorities in the city of Bielefeld. A Bulgaria-born German citizen, Ms Ignatova is also wanted by prosecutors there. With the co-operation of Guernsey authorities, Bielefeld's prosecutors are seeking to recover funds from the sale of two London properties once owned by Ms Ignatova through Guernsey shell companies. The companies were used to buy a penthouse apartment and a smaller apartment in London.\n\nThe apartments have been subject to a Guernsey Royal Court restraint order since 4 November 2021, the day after a BBC report revealed how shell companies obscured their purchases. A restraint order aims to preserve assets so that they may later be confiscated.\n\nBielefeld chief prosecutor Carsten Nowak confirmed Ms Ignatova's penthouse apartment in Kensington had since been sold for £10m, and the smaller apartment for £1.4m. However, as of May 2024 only £8.8m remained due to costs, fees and taxes. The amount may have been further reduced since, he added. \"According to German law, the money is intended to compensate OneCoin victims,\" Mr Nowak said. The Guernsey legal notice seeks to \"realise assets held in an account with the Royal Bank of Scotland\". The application will be heard by Guernsey's Royal Court on 13 January 2026. Ms Ignatova is also subject to a worldwide asset freeze, brought on behalf of investors seeking compensation at London's High Court.\n\nGoogle Abbots House, in leafy Kensington, seen from Addison Road\n\nThe search for Ms Ignatova, who is on the FBI's Ten Most Wanted list, has achieved global notoriety and is the subject of a popular BBC podcast and multiple TV documentaries. A reward for information leading to her arrest was increased twenty-fold in 2024, up to $5m (£3.8m), under the US Transnational Organized Crime Rewards Program. The FBI believes Ms Ignatova travels with armed guards and may have had plastic surgery to alter her appearance. Reports of sightings have come as recently as 2024, in South Africa. However, that same year the BBC uncovered Ms Ignatova's ties to a suspected Bulgarian mafia boss who was in charge of her security when she disappeared and allegedly responsible for her murder.\n\nFollow BBC Guernsey on X and Facebook and Instagram. Send your story ideas to channel.islands@bbc.co.uk.",
  "authors": [],
  "url": "https://www.bbc.com/news/articles/ce3k31z3j09o"
}