{
  "title": "The Devastating Decline of a Brilliant Young Coder",
  "text": "On Friday, September 13, 2019, Matthew Prince and Michelle Zatlyn, cofounders of the San Francisco internet security firm Cloudflare, stood on a slim marble balcony overlooking the floor of the New York Stock Exchange. A cluster of the company's executives stood near Prince, ready to shout out a countdown. “Louder! Loud!” Prince urged them. “Five! Four! Three! …” At 9:30 am sharp, the founders reached down to ring the exchange's famous bell, kicking off the day's trading and offering their 10-year-old company on the public market. It was a rite of passage and also their payday, a moment that unlocked many millions of dollars in newfound wealth.\n\nMore than 100 employees and investors cheered from the trading floor below, their phones held high to capture the scene. Kristin Holloway, employee number 11, looked up at the balcony and snapped photos, then popped them into a text to her husband, Lee Holloway, the company's third cofounder. He was home in California. Every so often, a familiar face pushed through the throng to say to her, “Lee should be here.”\n\nIn Cloudflare's early years, Lee Holloway had been the resident genius, the guy who could focus for hours, code pouring from his fingertips while death metal blasted in his headphones. He was the master architect whose vision had guided what began as a literal sketch on a napkin into a tech giant with some 1,200 employees and 83,000 paying customers. He laid the groundwork for a system that now handles more than 10 percent of all internet requests and blocks billions of cyberthreats per day. Much of the architecture he dreamed up is still in place.\n\nBut some years before the IPO, his behavior began to change. He lost interest in his projects and coworkers. He stopped paying attention in meetings. His colleagues noticed he was growing increasingly rigid and belligerent, resisting others' ideas, and ignoring their feedback.\n\nLee's rudeness perplexed his old friends. He had built his life around Cloudflare, once vowing to not cut his hair until the startup's web traffic surpassed that of Yahoo. (It took a few short months, or about 4 inches of hair.) He had always been easygoing, happy to mentor his colleagues or hang out over lunch. At a birthday party for Zatlyn, he enchanted some children, regaling them with stories about the joys of coding. The idea of Lee picking fights simply didn't compute.\n\nHe was becoming erratic in other ways too. Some of his colleagues were surprised when Lee separated from his first wife and soon after paired up with a coworker. They figured his enormous success and wealth must have gone to his head. “All of us were just thinking he made a bunch of money, married his new girl,” Prince says. “He kind of reassessed his life and had just become a jerk.”",
  "authors": [
    "Sandra Upson"
  ],
  "url": "https://www.wired.com/story/lee-holloway-devastating-decline-brilliant-young-coder/"
}