{
  "title": "Uber Eats and Nuro sign a 10-year deal to do robot food delivery in California and Texas",
  "text": "is transportation editor with 10+ years of experience who covers EVs, public transportation, and aviation. His work has appeared in The New York Daily News and City & State.\n\nPosts from this author will be added to your daily email digest and your homepage feed.\n\nUber Eats customers in California and Texas may soon have their takeout delivered by a driverless delivery pod after the company signed a 10-year deal with autonomous driving startup Nuro.\n\nToday’s announcement is the culmination of over four years of start-and-stop negotiations between the two companies. Uber wanted to use Nuro’s vehicles to make deliveries in Houston back in 2019, but those plans never panned out. Now, the two companies have struck a decade-long deal to expand robot deliveries to more customers than ever.\n\nStarting this fall, Uber and Nuro will deploy autonomous delivery vehicles in two cities: Mountain View, California, and Houston, Texas. Neither company would disclose the number of vehicles nor the expected number of customers who will participate in these early tests, but they did say they eventually hope to expand the service area to the greater Bay Area in California.\n\nAvailable in Mountain View, California, and Houston, Texas\n\nNuro’s second-generation R2 vehicle is not your typical delivery robot designed only for sidewalk travel. It’s much larger, about half as wide as a compact sedan, but shorter than most cars. And there’s no room inside for human passengers or drivers, making it fully driverless in the truest sense. It has a top speed of 45 mph, making it ideal for residential travel but not allowing it to go on highways. It can carry a total of 500 lbs, with space for about 24 grocery bags in its compartments.\n\nThe permit, issued by the California DMV, only allows the company to operate its delivery service in parts of Santa Clara and San Mateo counties, which would mean most of the Silicon Valley and its tech workers would be within its domain but not San Francisco or Oakland. That means the company will need to obtain additional permission from the DMV before expanding its service area.\n\nNuro isn’t the only autonomous delivery company to work with Uber. The company is also working with Serve Robotics and Motional to test out robot deliveries. Serve Robotics operates delivery robots that travel on sidewalks, while Motional uses electric Hyundai Ioniq 5 SUVs with two safety drivers in the front seats. Serve and Motional’s respective pilots with Uber Eats are available to customers in the Los Angeles area.",
  "authors": [
    "Andrew J. Hawkins"
  ],
  "url": "https://www.theverge.com/2022/9/8/23339830/uber-eats-nuro-robot-delivery-ten-year-deal-california-texas"
}