{
  "title": "James Jones All-Black Boys Gymnastics Team Needs New Location",
  "text": "As he packs up his floor mats and gymnastics equipment, James Jones is stressed.\n\nSince 2019, Jones has been inviting Black boys in Georgia’s Clayton County to join his James Jones Gymnastics Academy, an operation he primarily runs solo.\n\nNow, the gymnastics coach is searching for answers as the lease for his current Metro Atlanta gym expires this week. Some of the boys he currently trains have outgrown the current space, a former office within a shopping plaza.\n\n“The ceiling is only 13 feet high. And so when we first came here, the boys were small. These boys are teenagers, and most of them are almost 6 feet,” Jones, who also works as an attorney, says as he packs up his things. “They’re literally kicking the ceiling.”\n\nAdvertisement\n\nStringent zoning restrictions are preventing him from moving elsewhere within the county, he explains.\n\n“For a year, I’ve been trying my best to relocate us to another location in Clayton County because this is one of the cheaper counties for commercial real estate,” Jones, who operates the all-Black boys gymnastics club, says. “There are so many warehouses and buildings that are vacant and empty, but we can’t move to any. And at this point, I’m constructively being forced to close down because I can’t relocate the gym anywhere else.”\n\nCoach James Jones with his gymnastics team. James Jones Gymnastics Academy\n\nAdvertisement\n\nDespite only having been in action for nearly six years, the gymnastics team has become a pillar of its community. Around 600 boys and teens have participated in his academy for free or reduced rates, he says. The Clayton County Board of Commissioners honored Jones and his gymnastics team with a proclamation during its July meeting, celebrating the team’s recent victory at the Louisiana State Championships.\n\n“We really want to keep this program going for the community,” Kecia Blackmon, whose child participates in the academy, told WSB-TV. “It means a lot to us. It means a lot to the community. So please help us if you can.”\n\nJones works with low-income families, which means parents aren’t able to take their children to other areas of Georgia to participate in gymnastics programs due to the cost of travel and traffic. “If you go to the city of Sandy Springs, if you go to Cartersville, if you go to Roswell, they have fully funded gymnastics programs that are paid for by their citizens through Parks and Rec programs,” he says, mentioning cities in nearby counties.\n\nAdvertisement\n\nJones put out a call for assistance on social media. Donations started to pour in, and even celebrities like actor Viola Davis and Olympic gymnast Jordan Chiles are sharing the effort. Chiles sent a donation of $1,000 to the program.\n\nBut Jones says finances aren’t necessarily the issue — though donations are appreciated due to the high costs associated with gymnastics.\n\n“This isn’t an issue about money. It is an issue about zoning. A gym supporter posted an old fundraising campaign from a competition that took place a couple of months back. And people started donating there,” Jones explains. “That just became the new fundraiser to try to get us into a new location.”\n\nAdvertisement\n\nBoys practicing a routine. James Jones Gymnastics Academy\n\nA Clayton County spokesperson said Tuesday the properties James proposed did not meet their zoning requirements. Warehouses, which are preferable locations due to space and size, are largely in areas zoned for heavy industrial use, meaning they are designated for manufacturing or disposing of junk, for example — not sports activity.\n\n“The County is committed to working with Coach James or any applicant to find solutions in line with the County’s zoning policies,” the spokesperson said in a statement.\n\nAdvertisement\n\nSince his initial post on social media, however, the gymnastics coach says he is feeling hopeful. Jones is currently in talks with local leaders and is heartened by the outpouring of support.\n\nHe is still on the hunt for a property that will accommodate his team. Jones hopes the support will encourage more parents to consider putting their young Black boys in gymnastics.\n\n“I think that there is a huge misconception amongst parents that their sons would not like gymnastics,” he says. “I think that a lot of parents stifle the interest of their sons because they don’t even give them a chance to develop an interest in the sport.”\n\nAdvertisement",
  "authors": [
    "Senior Front Page Editor"
  ],
  "url": "https://www.huffpost.com/entry/black-gymnastics-team-location-james-jones_n_688a4d86e4b0a1d180af28d0?origin=top-ad-recirc"
}