{
  "title": "The Guardian view on Nigel Farage’s youthful views: the past still matters | Editorial",
  "text": "For one contemporary, it is the hectoring tone of today that evokes what it was like to be at school with Nigel Farage. “He would sidle up to me and growl: ‘Hitler was right’ or ‘Gas them’,” Peter Ettedgui recalls when asked about life at fee-paying Dulwich College in the late 1970s and early 1980s. Later, he adds: “I’d hear him calling other students ‘Paki’ or ‘Wog’ and urging them to ‘go home’.”\n\nFor others, including some in the college’s combined cadet force (CCF), what lingers is the image of the young Mr Farage in uniform and his renderings of a racist anthem titled “Gas ’em all”. Tim France, a CCF member from those years, remembered Mr Farage “regularly” giving the Nazi salute and strutting around the classroom. “It was habitual, you know, it happened all the time,” he recalls.\n\nJean-Pierre Lihou was a school friend of the future politician. He too confirms that the teenage Mr Farage would say things like “Hitler was right” and “gas ’em”. Mr Ettedgui would be addressed as “Jude”, two syllables as in German. “He used to stomp around the playground and chant ‘Oswald Mosley’,” adds Mr Lihou. Another contemporary, Andy Field, says that he saw Mr Farage set fire to the school roll after it was said that there were more Patels than Smiths among the pupils.\n\nSome material on this period of the Reform UK leader’s life was already public, notably in Michael Crick’s biography, which revealed a highly charged staff discussion over whether Mr Farage should be made a prefect or not. Back then, Mr Farage admitted having said “some ridiculous things … not necessarily racist things … it depends how you define it”. After the Guardian dug deeper this week into Mr Farage’s schoolboy years, that comment seems like an evasion. The claims in our reporting suggest instead that the\n\nyoung Mr Farage said things that were clearly racist.\n\nNot everyone contacted could recall the incidents cited in our reporting. And no one to whom we spoke claims, any more than we claim ourselves, that Mr Farage the man must still hold the same views that Mr Farage the teenager is alleged to have held more than 40 years ago. Nevertheless, extreme views in any person’s history matter, particularly if that person may be a future prime minister. Mr Farage cannot expect public interest and scrutiny to go away, especially if Reform UK continues to dominate the opinion polls and to edge closer to power.\n\nYet Mr Farage is doubling down on his denials. Through his lawyers, he is now denying saying anything racist or antisemitic when he was a teenager. In the House of Commons this week, challenged by the prime minister to explain himself in the light of the Guardian’s reporting, Mr Farage dug in. The allegations, according to his spokesperson, are “one person’s word against another”.\n\nBut that is not true. Mr Farage’s outright denials need to be judged against the testimonies of the more than a dozen people who claim they were either victims of, or witnesses to, racist and antisemitic behaviour. The public has a right to ask: who is telling the truth? Mr Farage’s fitness for office may rest on the credibility of the answers he gives.\n\nThe rise of Reform UK raises many issues besides Mr Farage’s character. But individuals matter a lot in politics. They shape moods, opinions and eras. Their truthfulness must be held up to the light. Mr Farage’s media interrogators must press further. He, meanwhile, has a duty to provide further answers.",
  "authors": [],
  "url": "https://www.theguardian.com/commentisfree/2025/nov/20/the-guardian-view-on-nigel-farages-youthful-views-the-past-still-matters"
}