{
  "title": "Battlefield 6 is a pivotal moment for the series — and EA",
  "text": "Battlefield 6 is one of EA’s most important launches in years. As the company becomes laser-focused on big, bankable franchises and looks to compete with the beast that is Activision’s Call of Duty, EA needs Battlefield 6 to be a hit when it debuts on October 10th — especially after the previous game in the series had a rough release — and it’s putting an incredible amount of effort into making it successful. The recently announced $55 billion deal to take EA private has only upped the stakes.\n\n“EA’s fate is tightly tied to Battlefield,” New York University games professor Joost van Dreunen tells The Verge. “If Battlefield 6 underperforms, it will call into question the strength of EA’s non-sports portfolio. At that point, the company faces pressure to rethink its strategy, perhaps even to divest and lean more heavily on the dependable sports business. It makes Battlefield a bellwether that will tell us if EA can still compete in blockbuster shooters.”\n\nThe pressure for Battlefield 6 started building almost immediately after Battlefield 2042’s disastrous 2021 debut. The multiplayer-only 2042 added huge, 128-player battles to a franchise already known for epic multiplayer skirmishes. But the game had a rough, bug-filled launch that necessitated multiple patches shortly after release. EA moved quickly to put Vince Zampella, cofounder of Apex Legends-maker Respawn Entertainment and former head of Call of Duty studio Infinity Ward, in charge of the Battlefield series to help right the ship. But the damage was already done. A few months after 2042 came out, EA CEO Andrew Wilson put things bluntly on an earnings call: “The launch of Battlefield 2042 did not meet expectations.”\n\nThe Battlefield series kicked off with Battlefield 1942 in 2002, and even that first game had a reputation for its big multiplayer battles. I have a memory of a hectic, shenanigans-filled match in an older Battlefield at a LAN cafe when I was a teenager. But the franchise has been steadily overtaken by Activision’s Call of Duty as the multiplayer shooter — especially because COD now has an enormous amount of resources behind it for annual releases and major Warzone updates.\n\nDespite the rocky launch, EA has kept 2042 going, even releasing a surprise update in August that added new weapons, vehicles, and a map. But it’s been clear for a long time that EA has been focusing much more on the future of the Battlefield franchise. Activision has several dedicated studios focused on Call of Duty that lets it launch a new blockbuster game nearly every year. Battlefield has historically been developed by Dice, but EA roped in three additional studios — Criterion, Motive, and Ripple Effect — to create a new Battlefield Studios structure so that it can make a better push to compete. (EA reportedly wants to get Battlefield on a similar type of annual release cadence as Call of Duty.)\n\nEven though EA is also known for titles like Mass Effect and Plants vs. Zombies, most of its money comes from a small number of franchises, along with add-ons like microtransactions and battle passes. Live service revenue is already big money for EA; according to its most recent quarterly earnings report, 83 percent of its net revenue came from “live services and other.” If Battlefield 6 is successful over the long term, that potentially makes the game a big cash cow for EA.\n\nEA has its work cut out\n\nBeyond overcoming the stigma of 2042’s poor launch, Battlefield 6 also has the uphill battle of competing with the many other enduring multiplayer shooters on the market like Fortnite, Counter-Strike 2, and Valorant (a lesson Sony learned the hard way). Those also all have the advantage of being free-to-play games, while EA has to convince people to shell out a minimum of $69.99 for Battlefield 6, something that’s especially challenging when a third of video game players buy a new game less often than once per year, according to Circana data. It’s not an impossible hurdle — the annual Call of Duty releases still do numbers — but EA has its work cut out.\n\nAnd this was all the case before EA announced a $55 billion deal to take the company private — a deal that includes $20 billion of debt financing. Should the deal go through, that debt adds a lot of money that the new version of EA will have to pay down, and the company could lean on Battlefield 6 — and the in-development Battlefield battle royale as well as future Battlefield titles — to help. The deal could also eventually mean cost-cutting measures like layoffs, like what Microsoft did following its Activision Blizzard acquisition.\n\nFrom what I’ve played of Battlefield 6, I feel like EA’s efforts may have paid off. I’ve spent the most time with the single-player campaign, a gripping thriller where an unstable NATO has to fight back against a shadowy private military group called Pax Armata. So far, it’s filled with chaotic firefights where I almost always feel like I survive by the skin of my teeth. One memorable mission involved night vision goggles, rising tensions between the city’s citizens and Pax Armata, and, eventually, taking down a helicopter. Though, in a chilling moment that made me lose some appetite to keep playing, the in-game helicopter once flew by at the same time a real military helicopter flew over my home in Portland.\n\nI’ve only dabbled a bit in multiplayer, but the matches I’ve played have been frantic and exciting, and I really like playing with a lot of other soldiers around me. (Even if, because of the relatively small playerbase during the review period, I was usually playing mostly against bots.) I’m a poor shot, so when I would get frustrated dying over and over again, I’d focus on reviving my teammates. And while the sandbox Portal mode wasn’t available during the review period, I’m guessing players will create some wild, imaginative new experiences that could be worth coming back for.\n\nEarly signs look good for Battlefield 6, and it has all of the pieces in place for a successful launch. But Battlefield 6 needs to be more than that — it needs to be a hit long after it first comes out. The future of EA depends on it.",
  "authors": [
    "Jay Peters"
  ],
  "url": "https://www.theverge.com/games/795232/ea-battlefield-6-hit-launch-deal"
}