{
  "title": "‘Betrayed His Country’: Fugees Star Pras Gets 14 Years Over Obama Donation Plot",
  "text": "LOADING ERROR LOADING\n\nWASHINGTON (AP) — Grammy-winning rapper Prakazrel “Pras” Michel of the Fugees was sentenced on Thursday to 14 years in prison for a case in which he was convicted of illegally funneling millions of dollars in foreign contributions to former President Barack Obama’s 2012 reelection campaign.\n\nMichel, 52, declined to address the court before U.S. District Judge Colleen Kollar-Kotelly sentenced him.\n\nAdvertisement\n\nIn April 2023, a federal jury convicted Michel of 10 counts, including conspiracy and acting as an unregistered agent of a foreign government. The trial in Washington, D.C., included testimony from actor Leonardo DiCaprio and former Attorney General Jeff Sessions.\n\nPrakazrel \"Pras\" Michel, a member of The Fugees hip-hop group, and defense lawyer David Kenner, right, arriving at federal court in April 2023. via Associated Press\n\nJustice Department prosecutors said federal sentencing guidelines recommended a life sentence for Michel, whom they said “betrayed his country for money” and “lied unapologetically and unrelentingly to carry out his schemes.”\n\nAdvertisement\n\n“His sentence should reflect the breadth and depth of his crimes, his indifference to the risks to his country, and the magnitude of his greed,” they wrote.\n\nDefense attorney Peter Zeidenberg said his client’s 14-year sentence is “completely disproportionate to the offense.” Michel will appeal his conviction and sentence, according to his lawyer.\n\nZeidenberg had recommended a three-year prison sentence. A life sentence would be an “absurdly high” punishment for Michel given that it is typically reserved for deadly terrorists and drug cartel leaders, Michel’s attorneys said in a court filing.\n\nAdvertisement\n\nPras Michel performing in 2023. via Associated Press\n\n“The Government’s position is one that would cause Inspector Javert to recoil and, if anything, simply illustrates just how easily the Guidelines can be manipulated to produce absurd results, and how poorly equipped they are, at least on this occasion, to determine a fair and just sentence,” they wrote.\n\nMichel, a Brooklyn native whose parents immigrated to the U.S. from Haiti, was a founding member of the Fugees along with childhood friends Lauryn Hill and Wyclef Jean. Their hip-hop band won two Grammy Awards and sold tens of millions of albums.\n\nAdvertisement\n\nMichel obtained over $120 million from Malaysian billionaire Low Taek Jho — also known as Jho Low — and steered some of that money through straw donors to Obama’s campaign.\n\nMichel also tried to end a Justice Department investigation of Low, tampered with two witnesses and perjured himself at trial, prosecutors said.\n\nLow, who has lived in China, was one of the primary financiers of “The Wolf of Wall Street,” a movie starring DiCaprio. Low is a fugitive but has maintained his innocence.\n\nAdvertisement\n\n“Low’s motivation for giving Mr. Michel money to donate was not so that he could achieve some policy objective. Instead, Low simply wanted to obtain a photograph with himself and then-President Obama,” Michel’s attorneys wrote.\n\nIn August 2024, the judge rejected Michel’s request for a new trial based in part on his defense attorney’s use of a generative AI program during his closing of the trial’s arguments. The judges said that and other trial errors didn’t amount to a serious miscarriage of justice.",
  "authors": [
    "Michael Kunzelman"
  ],
  "url": "https://www.huffpost.com/entry/fugees-pras-sentenced-obama-donation-scheme_n_69200ebde4b071a086babe74"
}