{
  "title": "Jeffrey Epstein's Brother May Have Exposed A Trump Lie On Their Friendship",
  "text": "LOADING ERROR LOADING\n\nPresident Donald Trump’s long-ago claim that he hadn’t spoken to Jeffrey Epstein in 15 years got challenged by the late financier’s brother on CNN Thursday. (Watch the video below.)\n\n“OutFront” host Erin Burnett played a 2019 clip of Trump insisting after Epstein’s arrest for sex trafficking that he hadn’t “spoken to him in probably 15 years or more” and that he wasn’t a big fan of Epstein. That would place their last conversation in 2004.\n\nAdvertisement\n\nBut Burnett noted that Mark Epstein had claimed they had a conversation in 2016. The sibling elaborated that it was after Trump had beaten Hillary Clinton to become president for the first time.\n\n“After the election, I usually speak to Jeffrey regularly, and in one of the calls .. Jeffrey told me that ... it was after the election that Trump called him and it was sort of like, ‘Can you believe this?’ Because nobody believed Trump was going to win,” Mark Epstein said. “Trump was sort of surprised himself that he won. So Jeffrey said [Trump] called him like, you know, ‘Could you believe this?’ type of a phone call.”\n\nTrump allegedly wanting to share his joy and surprise ― or just to brag ― to Epstein paints a different picture of why and when Trump and Epstein’s friendship soured.\n\nAdvertisement\n\nMark Epstein even asserted to Burnett that it was Epstein who canceled their relationship because he thought Trump was a crook.\n\nThere are many conflicting reports about the falling-out between Trump and the late sex offender, some dating it to 2007 or 2008.\n\nAdvertisement\n\nNow that Trump has signed off on the release of the publicly unread files, perhaps the country will learn even a few more.\n\nThe White House wasn’t buying Mark Epstein’s assertion.\n\n“Instead of amplifying baseless claims, the media should start asking real questions: why was Democrat Stacey Plaskett live texting Epstein in 2019 during a congressional hearing after he was a convicted sex offender and why did she accept thousands of dollars from him?” spokeswoman Abigail Jackson wrote to HuffPost. “Why did President Bill Clinton travel on Epstein’s plane 26 times? And why did one of Epstein’s victims write that she saw Clinton on Epstein’s island with two young women? These are just some of the many questions that the American people deserve to have answered.”",
  "authors": [
    "General Assignment Reporter"
  ],
  "url": "https://www.huffpost.com/entry/mark-epstein-trump-called-2016-election-jeffrey_n_691f3b71e4b071a086b9fb09?origin=home-zone-c-unit"
}