{
  "title": "Documents reveal Gerald Ford’s effort to block report on CIA assassination plots",
  "text": "The White House under Gerald Ford tried to block a landmark Senate report that disclosed the CIA’s role in assassination attempts against foreign leaders and ultimately led to a radical overhaul in how the agency was held to account, documents released to mark the 50th anniversary of the report’s publication reveal.\n\nThe documents, dating from 1975, were posted on Thursday by the National Security Archive, an independent research group, as it sought to highlight the report’s significance amid conjecture that Donald Trump may have authorized the agency to assassinate Venezuela’s president, Nicolás Maduro, amid a massive US military build-up against the country.\n\nTrump has pointedly refused to confirm or deny such speculation but said of Maduro “his days are numbered” in a recent interview with CBS’s 60 Minutes.\n\nAmong the documents posted by the National Security Archive is a “secret/sensitive” options paper addressed to Dick Cheney, then chief of staff to Ford, that included a recommendation of outright opposition to publication of the report, led by the Democratic senator Frank Church.\n\nThe memo records Ford accepting the recommendation “opposing publication of the report in its present form and stressing that the [Senate select] committee [chaired by Church] must assume responsibility for damage to the nation” that publication would supposedly cause.\n\nStrong White House opposition might have the benefit of “persuade-[ing] the committee to revise the most harmful areas of the report”, the memo added.\n\nThe newly posted documents also include the CIA director, William Colby, and Henry Kissinger, the secretary of state and national security adviser, recording their strong antipathy to Church’s investigations.\n\nA memorandum of a conversation that took place in February 1975 concerning Church’s investigation into the CIA’s domestic spying activities records Kissinger voicing fears that it “could be as damaging to the intelligence community as McCarthy was to the foreign service”.\n\nHe adds: “The result could be the drying up of the imaginations of the people on which we depend.”\n\nAs it happened, the Church committee’s first report – entitled Alleged Assassination Plots Involving Foreign Leaders – was published on 20 November 1975 and exposed the CIA’s covert actions overseas.\n\n“The evidence establishes that the United States was implicated in several assassination plots,” the 285-page report asserted. “The committee believes that, short of war, assassination is incompatible with American principles, international order, and morality. It should be rejected as a tool of foreign policy.”\n\nThe report, pulling back the cover on CIA attempts to kill the Cuban leader Fidel Castro and its involvement in the assassinations of Congo’s first post-colonial prime minister, Patrice Lumumba, and Gen René Schneider, the commander-in-chief of Chile’s armed forces, provoked a wave of revulsion. The following year, Ford signed the first of several executive orders expressly banning the agency and other US forces from trying to assassinate foreign leaders outside war situations.\n\nPeter Kornbluh, senior analyst with the National Security Archive, said highlighting the Church report’s historical significance had become more urgent in the context of the speculation surrounding Maduro, who the White House has accused of “narco-terrorism”.\n\n“Fifty years after the scandal of the revelations of the Church committee report, we’ve come a long way in the wrong direction, where we have US presidents who now seem to feel they can openly discuss assassination plots against foreign leaders,” he said.\n\n“We can’t have an honest and full discussion of the merits of assassinating the head of state of Venezuela without going back and reading the Church committee report. People have forgotten what a scandal this report generated, and the discussion of morality and US foreign policy it created.\n\n“There was a public consensus of repudiation for this tactic of US foreign policy. It was deemed immoral, unethical and not in keeping with the character of the United States public.”\n\nAt least 83 people have been killed in 21 US drone strikes against alleged drug-trafficking boats in the Caribbean and Pacific since early September, as pressure on Maduro has intensified, with Washington offering a $50m bounty for his arrest.\n\nThe justice department’s office of legal counsel has reportedly been tasked with drafting an opinion that could render any assassination of Maduro legally justifiable, according to the New York Times.\n\nThe state department has announced it will declare the Cartel de los Soles, a shadowy cartel whose existence has been doubted by some drug experts but which the Trump administration insists Maduro heads, a terrorist organization as of 24 November.\n\nThat could pave the way for assassination strikes on a similar legal basis as applied to the strikes on al-Qaida leaders, including Osama bin Laden, during the post-9/11 “war on terror”, and on Qassem Suleimani, the senior commander of Iran’s Islamic Revolutionary Guard Corps, after the US designated the unit a terrorist group.\n\nKornbluh said the 9/11 attacks changed public perceptions on whether assassinations – at least of terrorists – were acceptable.\n\n“If someone was designated a terrorist, they could then legitimately be taken out, and that is why you today see the Trump administration doing linguistic and legalistic somersaults,” he said.\n\nApplying it to Venezuela would violate the principles established by Church and may ill-serve US foreign policy goals, Kornbluh warned.\n\n“It doesn’t necessarily advance your foreign policy agenda to create instability and chaos in a country. Just because the Trump administration somehow finds a way to drop a drone bomb on Nicolás Maduro in Venezuela doesn’t mean that his regime collapses necessarily.”\n\nFulton Armstrong, a former CIA analyst for Latin America, said the principles established by Church’s report had been eroded.\n\n“Frank Church was the man who on the Hill did more to rescue [the] CIA from itself and demand transparency and accountability,” he said. “The ethics that Church in his sometimes clumsy ways, introduced into [the] CIA along with the levels of accountability and oversight – those things have have been reversed. And they are desperately needed.”",
  "authors": [
    "Robert Tait"
  ],
  "url": "https://www.theguardian.com/us-news/2025/nov/20/senate-report-cia-assassination-plots-gerald-ford"
}