{
  "title": "Cosa ci racconta la storia evolutiva del bacio, dal primo dato 21 milioni di anni fa ai Neanderthal ‘affettuosi’",
  "text": "La data del primo bacio non si scorda facilmente. E ora sappiamo che a darlo per la prima volta nella storia è stato l'antenato comune delle grandi scimmie già ben 21 milioni di anni fa. A raccontarlo in un nuovo studio pubblicato sulla rivista Evolution and Human Behavior è stato un team di ricercatori coordinato dall'Università di Oxford, che è riuscito a ricostruire per la prima volta la storia evolutiva del bacio, suggerendo che presumibilmente anche i nostri parenti estinti, i Neanderthal, si scambiassero baci.\n\nL'evoluzione del bacio\n\nSebbene il bacio abbia assunto un significato culturale ed emotivo nella nostra società e sia una pratica presente anche in altri animali, presenta tuttavia un problema di carattere evolutivo: potrebbe infatti comportare rischi elevati, come la trasmissione di malattie, senza offrire alcun evidente vantaggio riproduttivo o di sopravvivenza. Finora, inoltre, pochi studi si sono dedicati a studiarne la storia evolutiva e l'origine del bacio è quindi rimasta un mistero. \"Sebbene il bacio possa sembrare un comportamento ordinario o universale, è documentato solo nel 46% delle culture umane\", ha ricordato Catherine Talbot, tra gli autori dello studio. \"Le norme sociali e il contesto variano notevolmente tra le società, sollevando la questione se il bacio sia un comportamento evoluto o un'invenzione culturale. Questo è il primo passo per affrontare la questione\".\n\nAlla ricerca del primo bacio\n\nPer scoprirlo, i ricercatori hanno per prima cosa definito il bacio, intendendolo come un contatto bocca a bocca, non aggressivo, con un movimento delle labbra e che non comporta un trasferimento di cibo. Hanno quindi passato in rassegna dati disponibili in letteratura scientifica in cui sono stati osservati baci tra le specie di primati moderni, concentrandosi sul gruppo di scimmie e primati che si sono evoluti in Africa, Europa e Asia, tra cui scimpanzé, bonobo e oranghi. Trattando poi il bacio come un “carattere” evolutivo, hanno eseguito un'analisi filogenetica per mapparlo sull'albero genealogico dei primati, e, infine, utilizzato una tecnica statistica (modellazione bayesiana) per simulare milioni di scenari evolutivi e stimare la probabilità che diversi antenati si dedicassero a questa pratica. Il loro modello è stato eseguito 10 milioni di volte per fornire stime statistiche affidabili e robuste. \"Integrando la biologia evolutiva con i dati comportamentali, siamo in grado di trarre conclusioni informate su tratti che non si fossilizzano, come il bacio”, ha precisato il co-autore Stuart West. “Questo ci consente di studiare il comportamento sociale sia nelle specie moderne che in quelle estinte”.\n\nI baci tra i Neanderthal\n\nDalle analisi, i ricercatori hanno scoperto che il bacio è un tratto antico che si è evoluto tra 21,5 milioni e 16,9 milioni di anni fa nell'antenato comune delle grandi scimmie. Ma non solo: il team ha scoperto che anche i Neanderthal probabilmente si scambiassero baci sia tra loro che con i primi esseri umani moderni. Un dato questo che è coerente con le ricerche precedenti che hanno suggerito come umani e Neanderthal condividessero microbi orali (tramite la saliva) e materiale genetico (tramite incroci). \"È la prima volta che qualcuno adotta una prospettiva evolutiva ampia per esaminare il bacio”, ha concluso l'autrice Matilda Brindle. “Le nostre scoperte si aggiungono a un crescente corpus di lavori che evidenzia la straordinaria diversità dei comportamenti sessuali esibiti dai nostri cugini primati\".",
  "authors": [
    "Marta Musso"
  ],
  "url": "https://www.wired.it/article/storia-evolutiva-del-bacio-primo-dato-21-milioni-di-anni-fa-neanderthal-studio/"
}