{
  "title": "Google DeepMind Hires Former CTO of Boston Dynamics as the Company Pushes Deeper Into Robotics",
  "text": "Google DeepMind has hired the former chief technology officer of Boston Dynamics as the company pushes deeper into robotics. Aaron Saunders, who is partly responsible for giving the world back-flipping and dancing machines, joined as the VP of hardware engineering earlier this month.\n\nThe hire is a key part of DeepMind CEO Demis Hassabis’ vision for Gemini to become a sort of robot operating system, similar to how Google supplies its Android software to an array of smartphone manufacturers.\n\n“You can sort of think of it as a bit like an Android play [...] We want to build an AI system, a Gemini base, that can work almost out-of-the-box, across any body configuration,” Hassabis said in an interview with WIRED. “Obviously humanoids, but nonhumanoids too.”\n\nBoston Dynamics is famous for developing legged robots, including four-legged dog-sized systems and humanoid machines capable of impressive acrobatic feats. Saunders worked on an amphibious six-legged prototype before he was promoted to VP of engineering in 2018. He became the CTO of Boston Dynamics in 2021.\n\nGoogle DeepMind has produced important robotics research for years. As interest in more advanced robotic forms like humanoids grows, its researchers are doubling down on developing AI models to control robotic hardware systems.\n\nHassabis said he is excited about these advances. AI-powered robotics “is going to have its breakthrough moment in the next couple of years, if I was to predict,” he explained.\n\nBoston Dynamics is majority owned by the South Korean automaker Hyundai Motor Company. Hyundai purchased its stake from SoftBank, which acquired the company from Google's parent company, Alphabet, in 2017.\n\nThe components and expertise required to build legged robots have become more accessible in recent years. A number of US startups are now working on humanoids, including Agility Robotics, Figure AI, 1x, and of course Tesla. Elon Musk recently said that his company aims to produce a million of its Optimus humanoids over the next decade.\n\nChinese companies are also making strides in robotics, and, compared to the US, they offer remarkably cheap legged machines. Unitree, which is based in Hangzhou, China, has recently overtaken Boston Dynamics as the largest supplier of four-legged systems for industries like manufacturing and construction.\n\nHassabis admits that he’s impressed with Unitree, but says his focus is on software. “I'm most interested in the [AI] brain part of it,” he says, adding that the multimodal capabilities of Google DeepMind’s flagship model Gemini are particularly well suited to robotics.",
  "authors": [
    "Will Knight"
  ],
  "url": "https://www.wired.com/story/google-hires-cto-boston-dynamics-demis-hassabis-android/"
}