{
  "title": "Baylor AD Mack Rhoades resigns, a week after taking leave for personal reasons",
  "text": "Waco, Texas AP —\n\nBaylor athletic director Mack Rhoades resigned Thursday, a week after he took a leave of absence for personal reasons.\n\nRhoades had also stepped down last week from his role as chairman of the College Football Playoff selection committee.\n\nLinda Livingstone, the school’s president, said in a letter Thursday that Rhoades had informed her of his decision to step away from his position at Baylor. She said the move was effective immediately.\n\nAfter Rhoades began his leave of absence November 12, the private Big 12 school said it was investigating unspecified allegations against him. The status of that investigation, or if it is still ongoing, was not immediately clear after he left the job.\n\nThe school, without giving further details, said last week that allegations against Rhoades did not involve Title IX, student-athlete welfare or NCAA rules violations, and did not involve the football program.\n\nRhoades took over as Baylor’s AD in July 2016, in the wake of the revelation of a sprawling sexual assault scandal that cost two-time Big 12 champion football coach Art Briles his job. That NCAA case against the Bears wasn’t resolved until 2021, when the school was placed on four years of probation.\n\nLivingstone said co-interim ADs Jovan Overshown and Cody Hall will continue in their current roles leading the department during the search for a new athletic director.\n\n“Be assured we remain deeply committed to competing at the highest levels of athletics, both in competition and the classroom,” Livingstone wrote. “I am certain that we will find a new AD who shares in this competitive commitment, aligns with and supports Baylor’s Christian mission, and can lead us into this next era of intercollegiate athletics.”\n\nRhoades was in the second year of a three-year CFP selection committee appointment, and his first season as chairman. He was replaced as chairman by Arkansas athletic director Hunter Yurachek, while Utah AD Mark Harlan was appointed to fill Rhoades’ vacancy on the committee as the Big 12 representative after previously serving a one-year term in 2023.",
  "authors": [
    "Associated Press"
  ],
  "url": "https://www.cnn.com/2025/11/20/sport/ncaa-mack-rhoades-resigns-from-baylor"
}