{
  "title": "The OnePlus 15 is the phone to buy if you hate charging your phone",
  "text": "is a senior reviewer with over a decade of experience writing about consumer tech. She has a special interest in mobile photography and telecom. Previously, she worked at DPReview.\n\nHave you ever laid down for the night, only to realize your phone charger is across the room? And then thought to yourself, “Nah, I’m not going to get up and plug it in”?\n\nAnd then known without a shadow of a doubt that you won’t regret that decision tomorrow — that your phone will last comfortably into the next evening without dipping into low power mode? No? Well, that’s because you haven’t used the OnePlus 15.\n\nLike its close relative from Oppo, the $899 OnePlus 15 comes with a battery capacity so enormous it will challenge any power user to drain it in a day. That’s thanks to its silicon-carbon battery, a tech being adopted quickly outside of the US that allows for thinner, high-capacity batteries compared to lithium ion.\n\nThe OnePlus 15 has other things going for it: a great screen and top-notch performance, for starters. And there are things I like less, like OxygenOS’ creeping tendency toward bloatware. It’s not like, Samsung-bad yet, but it’s a far cry from the OnePlus of five or six years ago. As I see it, this is a phone for the battery anxious. And given the recent trend toward “lighter, thinner phone but with worse battery,” this “huge battery capacity, but a regular-sized phone” feels like a winning proposition.\n\n8 Verge Score OnePlus 15 $ 899 $ 899 The Good Easily a two-day battery for almost any kind of user\n\nBig, sharp screen The Bad OxygenOS is looking a little cluttered these days\n\nSilicon-carbon battery may limit device longevity\n\nProprietary super-fast wireless charging feels increasingly irrelevant $899 at OnePlus How we rate and review products\n\nWhen I first set up the OnePlus 15, I took its 7,300mAh battery capacity as a challenge. Display resolution, always-on display, screen timeout, performance — I set everything to their most battery-draining settings. Across two days with no overnight charge and nearly nine total hours of screen-on time, the battery was down to only 32 percent. If I’d tried that with any other flagship phone sold in the US, I would have had a dead battery halfway through the second morning, if not sooner. That’s astonishing.\n\nThere is some bad news: Silicon-carbon batteries tend to degrade faster than their lithium-ion counterparts, which is why US manufacturers have been hesitant to adopt them. OnePlus claims the battery will retain over 80 percent of its overall health through the first four years. Likewise, the company guarantees OS upgrades for four years and security updates for an extra two years beyond that.\n\nThat feels like an entirely reasonable commitment on OnePlus’ part, but also, I wish technology was moving toward batteries with better long-term longevity, not shorter. Most people who buy this phone will probably choose to move on within four years anyway, and I know plenty of people with phones that have lithium-ion batteries that haven’t held up in that time frame. I’d hope that a phone like this could be passed on to a family member or donated and used by someone else when its first owner is done with it. OnePlus offers a repair service in the US, but there is no specific battery replacement option, and turnaround is slow — 12 to 15 workdays, according to the website. Don’t expect the kind of same-day battery swaps you can get with Apple or Samsung phones.\n\nThis “industry-first” display is nice whether or not you’re a gamer.\n\nI’m sorry to say that this phone’s “industry-first 1.5K 165Hz display” is largely wasted on me. This is a nice screen, for sure! It’s plenty sharp, though I wish it got a touch brighter in direct sunlight, if I’m being picky. But I’m not sure I could tell you the difference between a 120Hz screen and this 165Hz display in a blind comparison. I tried it with Real Racing 3, one of a handful of games that supports the top refresh rate, and yeah, it looks nice. Over the course of a 20-minute session, the Snapdragon 8 Elite Gen 5 warmed slightly, but I didn’t see so much as a stutter.\n\nOnePlus was one of the last to ditch curved edges and adopt the flat sides the rest of the industry has embraced. I, for one, welcome the change; flat edges feel a little more secure in my hand. OnePlus fans are less enthused about another update: changing the beloved alert slider to an action button called the “Plus Key.” It’s a move ripped right out of Apple’s playbook, right down to the menu screen where you can assign different functions to the button.\n\nBy default, it serves as a shortcut to the “Mind Space,” where you can dump screenshots and voice memos so AI can catalog and tag them for later reference. It’s giving Pixel Screenshots or Nothing’s Essential Space. Interestingly, Gemini Assistant on the OnePlus 15 can access information you’ve saved to the Mind Space. This only works consistently when you specifically prompt Gemini to search Mind Space, though, which makes it a little less compelling. And I like the idea of a place to put things that would otherwise just exist in endless Chrome tabs, but my dozen open Chrome tabs are evidence of just how hard it is to drop old habits and form new ones.\n\nThe OnePlus 15 ships with OxygenOS 16, which is based on Android 16.\n\nSpeaking of software features, I’m not crazy about the way that OxygenOS has crept toward bloat over the past few generations. I think it’s starting to show as artifacts from years past pile up and the company continues chasing new ideas. There’s the Shelf, a place for widgets that I never remember to use, two rows of suggested apps at the top of the app drawer, and a handful of first-party apps crowded in among the stuff Google requires OnePlus to preload.\n\nOn top of that, now there’s a bunch of AI features vying for attention, like the AI Writer that often pops up as the first option when I tap selected text, right where my finger instantly heads to hit “copy.” Cheeky. You can opt out of, uninstall, and disengage a lot of these things, but it’s a lot to wade through — especially if you come to OnePlus looking for a less cluttered experience than you’ll get with Samsung.\n\nI don’t care for the placement of this AI Writer option. This menu page for the Plus Key is the spitting image of Apple’s UI for its customizable button.\n\nElsewhere, OnePlus is still hanging onto some of its traditions. You’ll get up to 80W fast charging with the wired charger (still!) and red cable (still!) included in the box; OnePlus also sells one that goes up to 100W. Over standard USB-PD, you get a snappy but less blistering 36W. Plugging the phone into the provided charger for 20 minutes with the provided charger when it was down to a worrying 17 percent brought it back up to 60 percent — easily a day’s worth of power.\n\nWireless charging is fast too, though you’ll need OnePlus’ proprietary $50 charger to get its top 50W speeds. But there’s one thing you won’t find here: integrated magnets, a la the Qi2 wireless charging standard. Instead, the OnePlus 15 outsources the magnets to cases. With one of those cases you’ll get up to 11W on a Qi2 charger. The ability to charge quickly with specific chargers isn’t as appealing as being able to thwack this phone onto any old MagSafe charger, but maybe I’m no fun.\n\nPrevious Next\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n1 / 15\n\nThe OnePlus 15 is the company’s first flagship since parting ways with Hasselblad as a camera partner; it’s now using a DetailMax Engine of its own making. I think OnePlus is doing just fine on its own; white balance is well judged and leans into warm tones at all the right times. Colors are punchy without looking unrealistic. Curiously, OnePlus has opted for smaller sensors in all three rear cameras than it used in the OnePlus 13. And while it can get away with a lot in good lighting, you run up against its limitations in low light pretty quickly; trying to capture a moving subject in dusky blue light proved to be beyond its capabilities.\n\nThe OnePlus 15 stands alone.\n\nOverall, the OnePlus 15 feels a little incohesive. There are a lot of borrowed ideas here — Apple’s action button and maybe a hint of frosted glass throughout the UI, too. There are a few things OnePlus is carrying forward from a previous era, like its commitment to offering fast charging. And there are the AI features — some of which seem well thought-out, though others feel a bit more me-too. But put all that together and it’s a bit of a confusing picture. Thankfully, the OnePlus 15 has one great idea that overshadows the rest of them: a phone that answers the question “What if you didn’t have to worry about battery life?”\n\nI suspect that OnePlus thinks of this as a Phone For Gamers, even if it doesn’t look much like a Phone For Gamers on the surface. The emphasis on performance and screen refresh rate, coupled with the battery longevity, seems plenty appealing to someone who runs a lot of power-hungry games. But you don’t have to be a gamer to appreciate the battery life this phone provides; pretty much anyone would be happy with a device you charge less often. I would have appreciated more of an emphasis on camera hardware than an industry-leading screen, and if you would too, then you might be happier with a Pixel or a Galaxy. But for the battery anxious — gamers or otherwise — there’s nothing else quite like the OnePlus 15. Not in the US, anyway.\n\nPhotography by Allison Johnson / The Verge\n\nAgree to continue: OnePlus 15 Every smart device now requires you to agree to a series of terms and conditions before you can use it — contracts that no one actually reads. It’s impossible for us to read and analyze every single one of these agreements. But we started counting exactly how many times you have to hit “agree” to use devices when we review them since these are agreements most people don’t read and definitely can’t negotiate. To use the OnePlus 15, you need to agree to: OnePlus’ End User License Agreement and Privacy Policy\n\nGoogle’s Privacy Policy and Terms of Service\n\nGoogle Play Terms of Service\n\nInstall updates and apps: “You agree this device may also automatically download and install updates and apps from Google, your carrier, and your device’s manufacturer, possibly using cellular data. Some of these apps may offer in-app purchases.” There are also several optional agreements that you need to get past during setup: Participation in Co-Creation User Programs, which includes built-in app updates, push notifications for surveys and product updates, and system stability reporting\n\nAssistant Voice Match\n\nBack up to Google Drive: “Your backup includes apps, app data, call history, contacts, device settings (including Wi-Fi passwords and permissions), and SMS.”\n\nUse location: “Google may collect location data periodically and use this data in an anonymous way to improve location accuracy and location-based services.”\n\nAllow scanning: “Allow apps and services to scan for Wi-Fi networks and nearby devices at any time, even when Wi-Fi or Bluetooth is off.”\n\nSend usage and diagnostic data: “Help improve your Android device experience by automatically sending diagnostic, device and app usage data to Google.” In total, that’s six mandatory agreements and six optional agreements.",
  "authors": [
    "Allison Johnson"
  ],
  "url": "https://www.theverge.com/tech/818933/oneplus-15-review-battery-screen-camera"
}