{
  "title": "US says countries with DEI policies as infringing human rights",
  "text": "New US rules say countries with diversity policies are infringing human rights\n\nThe changes, which the State Department says are intended to stop \"destructive ideologies\", have been condemned by rights campaigners who argue the Trump administration is re-defining long-established human rights principles to pursue ideological goals.\n\nThe new instructions also deem countries that subsidise abortion or facilitate mass migration as infringing on human rights.\n\nThe State Department is issuing the new rules to all US embassies and consulates involved in compiling its annual report on global human rights abuses.\n\nCountries enforcing race or gender diversity, equity and inclusion (DEI) policies will now be at risk of the Trump administration deeming them as infringing on human rights.\n\nThe changes reflect a major shift in Washington's established focus on global human rights protection, and signal the expansion into foreign policy of the Trump administration's domestic agenda on issues that have become a lightning rod of division in the US over recent years.\n\nA senior state department official said the new rules were \"a tool to change the behaviour of governments\".\n\nDEI policies were designed with the objective of improving outcomes for specific racial and identity-based groups. Since assuming office, President Donald Trump has aggressively sought to terminate DEI and restore what he calls merit-based opportunity in the US.\n\nThe senior official, speaking on condition of anonymity, said: \"The United States remains committed to the Declaration of Independence's recognition that all men are endowed by the Creator with certain unalienable rights.\" The official added that rights were \"given to us by God, our creator, not by governments.\"\n\nOther policies by foreign governments which US embassies will be told to categorise as human rights infringements include:\n\nSubsidising abortions, \"as well as the total estimated number of annual abortions\"\n\nGender-transition surgery for children, defined by the state department as \"operations involving chemical or surgical mutilation... to modify their sex\".\n\nFacilitating mass or illegal migration \"across a country's territory into other countries\".\n\nArrests or \"official investigations or warnings for speech\" - a reference to the Trump administration's opposition to internet safety laws adopted by some European countries to deter online hate speech.\n\nState Department Deputy Spokesperson Tommy Pigott said the new instructions are intended to stop \"new destructive ideologies [that] have given safe harbour to human rights violations\".\n\nHe said: \"The Trump administration will not allow these human rights violations, such as the mutilation of children, laws that infringe on free speech, and racially discriminatory employment practices, to go unchecked.\" He added: \"Enough is enough\".\n\nCritics have accused the administration of redefining long-established universal human rights principles to pursue its own ideological goals.\n\nUzra Zeya, a former senior state department official who now runs the charity Human Rights First, said the Trump administration was \"weaponising international human rights for domestic partisan ends\".\n\n\"Attempting to label DEI as a human rights violation sets a new low in the Trump administration's weaponization of international human rights,\" she said.\n\nShe added that the new instructions excluded the rights of \"women, LGBTQI+ persons, religious and ethnic minorities, and non-believers — all of whom enjoy equal rights under US and international law, despite the meandering and obtuse rights rhetoric of the Trump Administration.\"\n\nThe new rules conveyed \"jaw-dropping\" animosity towards LGBTQI+ people, Ms Zeya added.\n\nThe State Department's annual human rights report has historically been seen as the most comprehensive study of its kind by any government. It has documented abuses, including torture, extrajudicial killing and political persecution of minorities. Much of its focus and scope had remained broadly similar across Republican and Democrat administrations.\n\nThe new instructions follow the Trump administration's publication in August of the latest annual report, which was significantly rewritten and downscaled compared to those of previous years.\n\nIt reduced criticism of some US allies while escalating disapproval of perceived foes. Entire sections included in reports from previous years were eliminated, dramatically reducing coverage of issues including government corruption and persecution of LGBTQ+ individuals.\n\nThe report also said the human rights situation had \"worsened\" in some European democracies, including the UK, France and Germany, due to laws against online hate speech. The language in the report echoed previous criticism by some US tech bosses who oppose online harm reduction laws, portraying them as attacks on free speech.",
  "authors": [],
  "url": "https://www.bbc.com/news/articles/cx24200d7y9o"
}