{
  "title": "23 Telltale Signs Someone Is American, According To Europeans",
  "text": "LOADING ERROR LOADING\n\nWant to know how to spot an American abroad? Ask a European.\n\n“As someone who works closely with American clients through destination weddings and food tours, I’ve picked up on quite a few telltale signs,” Portuguese tour guide and food critic Carol Batista told HuffPost.\n\nFrom coffee orders to outfit choices to general vibes, many different kinds of signals can indicate someone is from the U.S. While some are endearing, others might raise more than a few eyebrows.\n\nAdvertisement\n\n“I try to avoid generalizations ― a Brooklyn creative won’t travel the same way as someone from Texas or the Midwest,” said Stéphanie Pons, the founder of Lisbon Insiders. “But there is a shared sense of optimism, confidence and curiosity.”\n\nBelow, find 23 signs that someone is American, according to Batista, Pons and other Europeans.\n\nComfort-First Fashion\n\n“You’ll often see Americans in athleisure, sneakers, baseball caps or hoodies, even when traveling, which is often a contrast to more polished local fashion in such European destinations like Italy, for example.” ― Jane Iskra, Iceland-based elopement photographer at ISKRA Photography\n\n“That unwavering confidence of walking into a centuries-old basilica dressed like you just left a reformer Pilates class. Think: athletic leggings, oversized hoodie and maybe ― just maybe ― sandals with socks. Practical? Extremely. Contextual? Not quite.” ― Luli Monteleone, Lisbon-based digital marketing specialist\n\nAdvertisement\n\nBig Spending Habits\n\n“At supermarkets or stores abroad, Americans often buy in bulk or stock up more than locals, who tend to shop daily.” ― Iskra\n\n“Americans love to spend ― and often do so more generously than other nationalities. But they also like to feel they’re getting great value in return. I would say that mix of enthusiasm and practicality is very American. Coming from a country with much higher wages, they sometimes don’t realize how large the gap is. For example, in Portugal, the average monthly salary is about 1,100 € (~$1,250), so what feels affordable to them can seem extravagant to locals.” ― Batista\n\nOn The Hunt For Iced Coffee\n\n“The iced coffee hunt. Even in the middle of winter ― and ideally in a 500ml cup. There’s a kind of dedication there that I honestly admire.” ― Monteleone\n\nAdvertisement\n\n“I would say if they have a drink with lots of ice (either water, or iced coffee).” ― Steffi Crivellaro, U.K.-based blogger at Steffi Daydreamer\n\nMaskot via Getty Images From coffee orders to outfit choices to general vibes, there are many different kinds of signals that can indicate someone is from the U.S.\n\nLoud Confidence\n\n“One of the biggest indications is usually that you can hear them before you see them. It’s not necessarily that they’re loud, but they command attention wherever they are, which also leans into how confidence is built in America. I have often found that Americans are very confident. Even if it does not come naturally to each individual, they seem to have been conditioned or taught to be confident which means they tend to take up space wherever they are.” ― Ronke Lawal, PR and communications consultant in London\n\nAdvertisement\n\n“Americans tend to find everything ‘amazing,’ and they’re not shy about saying so ― out loud and often. They speak with a volume that’s just slightly above local norms, even when whispering. And in a world where many cultures lean toward discretion, that kind of openness stands out.” ― Pons\n\nStanley Cups\n\n“Reusable Stanley-style coffee mugs are a giveaway ― they seem to go everywhere with them, even when traveling!” ― Iskra\n\n“Carrying a Stanley or huge water bottle.” ― Crivellaro\n\nLarge Engagement Rings\n\n“The big, sparkly engagement ring tradition is very American. In some countries, engagement rings aren’t as flashy or aren’t even a thing sometimes.” ― Iskra\n\nAdvertisement\n\nJumping Straight Into English\n\n“It’s not the accent ― it’s the cheerful assumption that English will always do the job. Most locals do speak it, but trying a simple ‘ciao’ or ‘bonjour’ tends to unlock a different kind of experience. It’s a small gesture, but it changes everything.” ― Monteleone\n\nSeeking Air Conditioning\n\n“In the summer, Italians love to stay outdoors: The squares fill up, and the outdoor tables are always the most desired. Americans, on the other hand, almost always choose the indoor spaces with air conditioning. For them, climate comfort is an absolute priority.” ― Diana De Lorenzi, Rome-based lifestyle blogger\n\n“Americans are notoriously hot all the time and expect lots of air conditioning and ice when they travel, two things that aren’t so easy to come by in Italy!” ― Livia Hengel, founder of The Italy Edit\n\nAdvertisement\n\nWarmth And Friendliness\n\n“I’ve traveled extensively in the U.S., and if there’s one thing I’ve consistently noticed, it’s their amazing ability to start a conversation: openly, spontaneously, as if they already knew the person in front of them. It can be quite disconcerting for us Europeans, but it’s a deeply rooted part of their culture. In France in particular, this kind of attitude is sometimes seen as insincere or self-serving. But I’ve always defended it, I actually find it refreshing to have even a short exchange with someone who is smiling, warm and quick to compliment your outfit or haircut. Personally, I love good energy, and I take the good where I find it.” ― Kenza Sadoun-El Glaoui, Parisian digital creator\n\n“In Ireland, people are known for their friendliness, but we don’t have a patch of the Americans. They say hello to everyone, they chat to locals, they ask questions and it’s lovely to see. There’s a sort of genuine, open, curiosity about an American abroad that I, personally, find very endearing.” ― Tara Povey, blogger at Where Is Tara?\n\nGenuine Enthusiasm\n\n“Americans are often very expressive ― big smiles, open curiosity, confident energy. And when they feel they’ve been well taken care of, they’re incredibly grateful. I’ve had food tour guests react like it was Christmas morning just because of a market tasting or a pastry they’d never tried before, and a bride bringing me a full suitcase with gym clothes as a souvenir from LA — and it’s truly heartwarming.” ― Batista\n\nAdvertisement\n\n“My partner Luca Veralli is a master gelato maker, and his gelato has been awarded by Gambero Rosso. Every time an American tourist tastes it, they always ― without fail ― say the same phrase: ‘Oh my God!’ For us, it’s a joy. They say it with genuine enthusiasm that truly makes us happy. But it’s funny how this exclamation is almost always identical, as if it were a ritual.” ― De Lorenzi\n\nGenerous Tipping\n\n“One immediate giveaway is that American travelers are generous tippers ― even though the U.S. is one of the only countries in the world where a 20%-plus tip is expected as the norm. On the other hand, with average salaries nearly double those in Italy, tipping makes sense and is a great way to show appreciation for good service, especially in places where it’s not expected.” ― Hengel\n\n“America has a very generous tipping culture unlike any other country I’ve ever visited. When Americans travel outside the U.S., leaving large tips is a sure sign of where they are from. In Ireland and most of Europe we only leave tips if the service or the food has been particularly good and servers definitely do not expect or rely upon tips.” ― Povey\n\nAdvertisement\n\nPaying By Credit Card\n\n“Americans always pay by card, even for very small amounts like a 1 euro espresso. This is another cultural difference we see every day.” ― De Lorenzi\n\nWide Smiles And Perfect Teeth\n\n“Americans are known for having great dental care and wide, confident smiles. Smiles and perfect teeth are often one of the first giveaways.” ― Iskra\n\nFull Of Compliments\n\n“I’ve always found Americans to be sweet and genuine! I can especially tell when a woman is American because she’ll go out of her way to give me a compliment, and it’s usually thoughtful and specific. It happens multiple times a day whenever I’m traveling in the States, and I’ve never experienced that kind of spontaneous kindness anywhere else in the world.” ― Kelsey Heinrichs, blogger at Kelsey in London\n\nAdvertisement\n\nWanting To Customize Everything\n\n“There’s a kind of customization instinct ― asking for dressing on the side, almond milk in the cappuccino, or a dinner reservation at 6 p.m. (which still feels like mid-afternoon in Portugal). I see it as a reflection of their strong sense of personal agency, the belief that services can and should adapt to you, not the other way around.” ― Pons\n\nlechatnoir via Getty Images Several people HuffPost interviewed pointed to genuine enthusiasm and friendliness as common traits in Americans.\n\nSaying ‘Like’ All The Time\n\n“The overuse of the word ‘like’ — especially with people from LA. Sometimes you’ll hear ‘like’ eight times in a single sentence! It’s a casual, filler-filled way of speaking, and of course there’s the unmistakable clarity of American English.” ― Batista\n\nAdvertisement\n\n“Saying things like ‘awesome,’ ‘you guys’ or the ever-present filler word ‘like’ always catches my ear with a 99% probability I hear it from an American.” ― Iskra\n\nLimited Geographic Knowledge\n\n“A general lack of geographical knowledge is a sure sign. Americans tend to refer to any country in Europe as ‘Europe,’ as if we are all the same. There is a huge difference between Norway and France, they’re completely incomparable. Referring to us all under one sweeping term of ‘Europe’ or ‘Europeans’ is sort of ridiculous. I once met an American man who asked me where I was from. When I told him I was from Ireland he said that he had just been visiting my neighbors. I assumed that he must mean the United Kingdom (which I could understand). However, he then declared that he had visited Italy. Needless to say, neither Italy nor Ireland would ever refer to each other as neighbors. It would take 27 hours to drive from Dublin to Rome. That’s the equivalent of Miami to Minneapolis. Florida and Minnesota are not neighbors.” ― Povey\n\nCappuccino With Dinner\n\n“If someone asks for a cappuccino with pasta or pizza and also at dinner, you can be sure: They are an American tourist. It’s a cultural habit that always makes us smile because for us Italians, cappuccino is a morning ritual, part of breakfast, but it’s nice to see how every culture experiences food in its own way.” ― De Lorenzi\n\nDifferent Portion Size Expectations\n\n“I notice this a lot during food tours ― Americans are frequently surprised by how small European portions can be (while we are shocked when we see of their portions). I’ve heard more than once ‘Wait, this is for one person?’ and it’s always funny.” ― Batista\n\nFast-Moving Itineraries\n\n“‘I’ve been to Europe’ often means a whirlwind through Paris, London and Rome in under two weeks. Honestly, impressive cardio — but also, you just missed the good bakery next door. And truthfully? Europe’s charm often lives in the quieter, slower corners.” ― Monteleone\n\nAdvertisement\n\nQuick To Talk About Heritage\n\n“Rushing to include their ancestry in an opening conversation. Don’t get me wrong, I love that Americans are so enthusiastic about their heritage, and it certainly does wonders for Ireland’s tourism industry. However, they are the only country that does it. Never have I met anyone from outside the U.S. who has launched into their grandparents’ origin story when we have just been introduced. While charming, it’s definitely a telltale sign that someone is from the U.S.” ― Povey\n\nLove Of Rick Steves Guidebooks\n\n“In Reykjavík, I immediately pick out Americans out of the bunch because they explore the country using Rick Steves Iceland as their compass. Not Lonely Planet. Or Fodors. Or even a local source. Good ’ol American Rick Steves ― who I met in person when I was his local guide in Reykjavík and is as ’Merican as they come. I’m sure other nations use guidebooks too but Americans carry Rick with pride. Not tucked away in their backpack, ashamed of getting caught with something as gauche as a guidebook, but loud and proud. Out in the open.” ― Auður Ösp Ólafsdóttir, Iceland-based marketing professional\n\nThat Intangible American Vibe\n\n“As someone who works across lifestyle and hospitality in Europe, I often find myself noticing subtle (and not-so-subtle) clues that someone is American. The most obvious is the accent, but beyond that, there’s a specific energy that’s easy to spot.” ― Pons\n\nAdvertisement\n\n“I somehow pick Americans out of a crowd, but I can’t put my finger on how. It’s something about how they’re built and how they’re dressed ― I really can’t articulate it. They’re just so essentially American that their Americanness shines, even in a culture where you’d think it would be harder to pick them out. Once upon a time, I think Americans just walked around with a certain air of confidence about them. They were proudly American, and you could tell in the way they walk. Nowadays many conversations with Americans start with apologies. Their once-proud stance has been replaced with slightly hunched shoulders. Like they’re aware that tolerance for American politics is wavering around the world and they don’t want to take up too much space. But it’s still something about how Americans walk in the world that makes them recognizable.” ― Ösp Ólafsdóttir\n\nResponses have been lightly edited for clarity and length.",
  "authors": [
    "Senior Reporter",
    "Huffpost Life"
  ],
  "url": "https://www.huffpost.com/entry/23-telltale-signs-someone-is-american-according-to-europeans-goog_l_6915ec8de4b0bf453c7bfd5c?origin=life-feed"
}