{
  "title": "The Point Trump Keeps Missing About Getting Himself Into Heaven",
  "text": "While crashing a wedding at Mar-a-Lago last week, Trump once again brought up whether he was destined to get to “the good place” — seemingly hoping that a “godly” conservative commentator who was also on the guest list could put in a good word for him.\n\nWhile attending the nuptials of banker and “patriotic movement” Stormwall founder Mike Wilkerson, Trump saw conservative radio host Eric Metaxas among the crowd and shouted him out to the newlyweds: “He’s going to get me into heaven.”\n\nIn the video of the exchange, later shared to Metaxas’ Instagram, the host replied, “I want to talk to him about getting into heaven… but not here. Not here.”\n\nAdvertisement\n\nAP Photo/Huffpost The president's recent preoccupation with the afterlife is well-documented.\n\nIn the text of that post, Metaxas offered some context for why he demurred in the moment: “Last night, at my friend [Wilkerson’s] wedding at Mar-a-Lago, the President showed up. As he walked in, he pointed right at me and joked, ‘This is the guy who’s going to get me to heaven…’ I laughed and told him, ‘I’d really like to talk to you about that… but another time.’ Then I reminded him, ‘Don’t forget—you’re America’s Supercentennial President.’”\n\n“Truthfully, I would love to have that conversation with him one day,” he added. “But this wasn’t the place.”\n\nAdvertisement\n\nWhile Metaxas’ wedding etiquette is spot on (discussions of eternal damnation or the avoidance thereof is best reserved for the afterparty or after-the-afterparty), this exchange is just the latest of several public conversations with the president that point to his real-time grappling with these existential, prehumous questions.\n\nThe President’s ‘Getting Into Heaven’ Philosophy So Far\n\nAs HuffPost previously reported, Trump’s other discussions of the afterlife have come up in similar contexts.\n\nIn August, he wondered aloud in a call with Fox News whether his efforts to end the war in Ukraine might help his odds of making it to heaven.\n\nAdvertisement\n\n“But if I can save 7,000 people a week from being killed, I think that’s a pretty... I want to try and get to heaven, if possible,” he said. “I’m hearing I’m not doing well. I am really at the bottom of the totem pole. But if I can get to heaven, this will be one of the reasons.”\n\nLater in August, while in conversation with radio host Todd Starnes, he wondered about the criteria for being heaven-bound and if there might be a “report card” keeping score, before questioning why someone might do or be “good” without the threat of damnation or the promise of heaven: “If you’re not a believer, and you believe you go nowhere, what’s the reason to be good, really?”\n\n“People of faith, there’s a feeling, they wanna be good, y’know?” he added. “They get punished if they’re not good, right?”\n\nAdvertisement\n\nIn a conversation with Steve Doocy back in October, Trump again said, “I don’t think there’s anything that’s going to get me into heaven. I think I’m not heaven-bound.”\n\nOf course, this seeps into that larger sexy metaphysical question many of faith (and those who are not) grapple with: Is heaven a place your soul gains admittance to, a naked paradise where you reunite with those you’ve lost, a physical kingdom? Or is it simply the closest metaphorical approximation we as humans can grasp at to describe the deep relationship and reunification with the divine (and one another) we hope for in the afterlife?\n\nAnd Trump’s repeated “get me into heaven” phrasing is specifically telling as he works out the ethics and values that the aforementioned “people of faith” usually work out at church (or maybe by sitting and re-reading the beatitudes a few times? IDK) with a series of chat hosts.\n\nAdvertisement\n\nThe Point He Keeps Missing\n\nAs Rachel Menzies, a psychologist and author of “Mortals: How the Fear of Death Shaped Human Society” previously told HuffPost, the urge to consider where you might be headed next isn’t uncommon as you age and the feverish pursuit of reassurance that it won’t be hell is one way to cope: “The idea that goodness or achievement can somehow protect us from the finality of death is believed by many. It’s often a way of managing the uncomfortable truth that mortality is outside our control, by turning it into something we can earn, influence or negotiate.”\n\nTrump’s language around God and heaven reads as “a performance-based and transactional misunderstanding of salvation and heaven,” as therapist and director of gospel-centered therapy group HeartMatters NYC Sobeyda Valle-Ellis previously told HuffPost\n\n“He is thinking aloud, ‘If I do this many good deeds, maybe I’ll make it to heaven,’” Valle-Ellis said. “But this is theologically at odds with the Christian teaching that salvation and admission into heaven are a gift of grace based on the work of Christ, that cannot be earned by being a good person. Still, this is actually what many people believe about heaven, even some Christians.”\n\nAdvertisement\n\nMany denominations of Christianity reject the idea that “works” — as in doing good, being good to others — assist in “getting a person into heaven” at all, instead believing that it’s the grace received via the act of Jesus being crucified and forming the new covenant with those who follow him, that gets you there.\n\n“It’s about being loved by God more than I dare hoped,” Valle-Ellis said. “Tim Keller summarized the Christian hope as, ‘We are more sinful and flawed than we dared believe, yet at the very same time we are more loved and accepted than you dare hoped.’”\n\nSome denominations would argue that these works — the willingness to actually do the work Jesus tells his followers to do: to love radically, see God in the stranger, the poor and disenfranchised — are a necessary and natural response to that offering of radical love, that those behaviors are an extension of a sturdy foundation of faith.\n\nAdvertisement\n\nLikewise, there are plenty of biblical teachings that warn of the spiritual harm that can come from pursuing your own wealth and comfort in opposition to those works throughout your life and refusing to treat “the stranger” with any less care than you’d teach Jesus himself— which does run contrary to contemporary teachings common among those in MAGA Christianity.\n\nVia Matthew 19:23-26: ”‘I tell you the truth, it is hard for a rich man to enter the kingdom of heaven. Again I tell you, it is easier for a camel to go through the eye of a needle than for a rich man to enter the kingdom of God.’ When the disciples heard this, they were greatly astonished and asked, ‘Who then can be saved?’ Jesus looked at them and said, ‘With man this is impossible, but with God all things are possible.’”\n\n1 Timothy 6: 9-11 offers another banger on the subject of faith, works and a life lived in pursuit of wealth that can’t hurt to keep in mind in this context: “Those who want to get rich fall into temptation and a trap and into many foolish and harmful desires that plunge people into ruin and destruction. For the love of money is a root of all kinds of evil. Some people, eager for money, have wandered from the faith and pierced themselves with many griefs. But you, man of God, flee from all this, and pursue righteousness, godliness, faith, love, endurance and gentleness.”\n\nAdvertisement\n\nIt’s hard to say where Trump’s apparent late-in-life faith journey will lead him — and what waits for him (or any of us) when the curtains finally drop.\n\nBut who knows? As we prepare to head into another haunted, gilded Trump White House Christmas, maybe a few Dickensian ghosts will pay him a visit. Just in case.",
  "authors": [
    "Senior Editor",
    "Family"
  ],
  "url": "https://www.huffpost.com/entry/trump-get-me-into-heaven-comments_n_691f31fae4b047290e290818?origin=home-life-unit"
}