{
  "title": "The magic touch: how healthy are massages actually?",
  "text": "Massages can feel great. But are they actually good for you?\n\nIn one study, researchers observed that 8.5% of Americans reported using massage for “overall health” in the 2022 National Health Interview Survey. However, definitions of health tend to vary widely, explains the study’s first author, Jeff Levin, an epidemiologist and distinguished professor at Baylor University. For instance, does it refer to physical health, mental health or both? That makes it tough to study, but may explain why it has such broad appeal, Levin explains.\n\nResearch typically seeks to establish precise causal relationships. But the impact of massage seems to be holistic in nature, integrating physical, emotional and neurological effects, explains Niki Munk, licensed massage therapist, associate professor at Indiana University Indianapolis, and research director of the Massage Therapy Foundation.\n\nWhile some perceive massage as a luxury, it has historically been part of healthcare, notes Munk. It is increasingly embedded as a feature of hospital care because research and patient experiences corroborate its potential advantages.\n\nExperts say massage may benefit anyone regardless of their health status.\n\nWhat are the physical benefits of massage?\n\nMassage is one of the techniques Rocco Caputo, a touch therapist at the Memorial Sloan Kettering (MSK) Cancer Center, uses to help patients.\n\n“When patients come in, they’re always like: ‘You’re the massage guy, right?’” Caputo says. “Then you’re everybody’s favorite person.”\n\nMassage helps people re-establish a connection to their body, says Caputo. It puts people into a parasympathetic nervous state, which induces a state of calm. Recent research conducted in part at MSK found that massage helped advanced cancer patients with long-term pain reduction. One of the outcomes of this research is the Imagine project, which aims to implement massage and acupuncture in cancer programs across the US.\n\nSome research shows benefits for those with chronic pain; in Munk’s newest pre-print paper, veterans who received massage therapy twice a week for 12 weeks experienced an improvement in pain severity compared with a control group. These benefits were maintained for a period of three months.\n\n“A lot of pain is a symptom that needs to be managed, not something that’s necessarily going to go away,” says Munk. The study didn’t examine the mechanisms behind the improvement, but Munk suggests that factors such as loosening muscles, relaxation and improved sleep could explain the results.\n\nIn another study, Munk found that after 10 massage sessions, patients showed clinically meaningful improvement in lower back pain. Participants aged 50 and older experienced the most significant change.\n\nMassage therapy can probably address many types of pain; early intervention might even prevent some cases from becoming chronic, Munk says. But some researchers, such as the authors of this 2024 systematic review, argue there’s a need for more randomized controlled trials – viewed by some as the gold standard for measuring effectiveness – to assess how well it can treat pain.\n\nCauses for the physical effects of massage are still being explored. For example, Shane Phillips, a professor at the University of Illinois at Chicago, co-authored a paper demonstrating that massage enhances blood flow and reduces muscle soreness after exercise. The study found that even people who had not exercised experienced improved vascular function, or the ability of blood vessels to regulate blood flow and pressure, after massage.\n\nOne group of participants exercised with a leg press machine, then received leg massages. Testing shows that “blood flow in the arm was changed even though we were providing massage to the lower extremities,” says Phillips. This suggests massage may affect the entire body, not just a specific area.\n\nWere the results due to manual manipulation of the body or emotional responses to being touched? “That’s not really known – it may be some of both,” says Phillips.\n\nAre there emotional benefits to massage?\n\nIt’s difficult to untangle the emotional and physical reactions people experience due to massage, says Dr Carla Kuon, an associate professor of internal medicine at the University of California, San Francisco and a faculty member at the Osher Center for Integrative Health.\n\nMassage therapy can increase the release of endorphins, natural pain-relievers made by the body, she explains. A wealth of research shows that positive, consensual touch can increase mental wellbeing and reduce anxiety and depression.\n\nWorking as a massage therapist, Anne Weisman observed benefits for people living with HIV/Aids. In subsequent research, Weisman, who is an associate professor and director of Well-Being & Integrative Medicine at the University of Nevada, Las Vegas, quantified these observations: participants self-reported a newfound awareness of their body that influenced motivation and resilience. One participant said “massage therapy reminded her of her human-ness”, recalls Weisman.\n\nskip past newsletter promotion Sign up to Well Actually Free weekly newsletter Practical advice, expert insights and answers to your questions about how to live a good life Enter your email address Sign up Privacy Notice: Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on theguardian.com to send you this newsletter. You can complete full registration at any time. For more information about how we use your data see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nWeisman sees the effects of massage as “highly translatable” to different groups of people.\n\nWho can massage help?\n\nKuon was seeking an opioid-free way to ease patients’ pain. In 2017, inspired by UCSF’s pediatric bone marrow transplant massage program, she raised funds, then launched a similar service for adult patients the following year.\n\nA 2018 study on the adult service showed the massages were “quite beneficial for distress, pain, tension, anxiety, fatigue and improved sleep”, says Kuon. Participants also reported an improved sense of wellness.\n\nAccording to Kuon, many studies show that pleasant touch creates a soothing effect, sending signals to the brain that you’re safe.\n\n“We all thrive on caring, compassionate touch,” says Kuon. “I think any person could benefit [from massage] because it releases natural endorphins that promote a sense of wellbeing and happiness.”\n\nBut, she also notes that those who might get the most out of it are “those who may not regularly experience healthy touch”. Examples include individuals with chronic fatigue syndrome or long Covid, who often experience reduced social interaction.\n\nIndividuals “who have greater experiences of disability, pain and impairment are in a position to experience the larger effects”, agrees Munk.\n\nHow can you incorporate massage into your routine?\n\nThe benefits of massage serve as a reminder of the power of touch overall, says Weisman. Massage is a simple yet effective intervention but is often overlooked, she explains.\n\nProfessional massage may be inaccessible for some due to cost. But “some form of therapeutic touch” is essential, says Kuon. Even self-massage or a foot massage can be beneficial.\n\nCaputo recommends incorporating massage techniques into self-care; he has created videos people can follow at home to help with ailments such as headaches and hand pain. (The intended audience for the videos is children, but Caputo says anyone can use them.)\n\nLevin argues for framing massage as a mainstream health intervention. “When massage is described as an alternative medicine, whether it’s intended or not, there’s something kind of disparaging about it,” he says.\n\nMassage should be further embedded in the healthcare system, covered by health plans, says Munk. This way, massage can be “accessible to as many people as possible”, she says.",
  "authors": [
    "Sarah Sloat"
  ],
  "url": "https://www.theguardian.com/wellness/2025/nov/13/massage-health-benefits"
}