{
  "title": "What to Do in Portland, Oregon If You're Here for Business (2025)",
  "text": "As a tech city, Portland often feels like a lifestyle destination for wayward engineers. Though nearly 10 percent of Portland works in tech, Stumptown’s business scene can sometimes seem to be in hiding, operating as a comfortable “third place” between the FAANG capitals to the north and the south. Portland is a tree-filled place of sometimes startling natural beauty, resting in the shadow of Mount Hood, Oregon’s tallest mountain, and at the intersection of two rivers.\n\nMuch of Portland’s tech industry action is tucked into home offices and coworking spaces, or beneath a canopy of trees in the so-called Silicon Forest sprawling out to the west-side suburbs of Beaverton, Hillsboro, and Aloha. This is where Nvidia cofounder Jensen Huang went to high school, and it’s also where he planted an engineering outpost for Nvidia. It’s likewise where a sizable chunk of America’s semiconductor and microchip industry has put down roots, including wings for Intel and Microsoft.\n\nThis low profile can make Portland a chill place to do business. Whatever the occasional national headlines, the city remains a mostly relaxed mecca for food and beer and music, and for always dressing like you’re about to go on a hike. It is also a nerd’s paradise for hacker spaces and tech ephemera. Here’s where to stay, and where to go.\n\nWhere to Stay in Portland\n\nCourtesy of Jupiter NEXT\n\nDon’t just plop yourself down in a sleepy downtown hotel—a rookie Portland move many a visiting executive or engineer has come to regret. Portland is most workable where people actually live, amid dense business districts filled with cafés and restaurants. That’s also where you’ll find many of the coworking spaces and meeting resources that make doing business here easier, and the saunas and cold plunge tubs that make it pleasant.\n\nPortland's downtown core hugs the west side of the Willamette River that bisects the city. But WIRED recommends finding a hotel on the amenity-packed central east side across the river from downtown, or in the more residential districts just outside of downtown on the west side.\n\nEast Side Hotels\n\nCourtesy of Jupiter NEXT\n\n900 E Burnside St., (503) 230-9200\n\nThe Jupiter NEXT hotel is the statement piece of Portland’s eastside LoBu neighborhood just across the river from downtown, a modernist six-story sculpture of a building with a balcony, bamboo garden, and bookable meeting rooms for large or small groups. Corporate discounts and packages are available for frequent business travelers, which include complimentary drink tickets at Hey Love, a popular ground-floor cocktail bar that’s a bit like a tropical fern bar from the ’70s.\n\n100 NE Martin Luther King Jr. Blvd., (971) 346-2992\n\nNot far from Jupiter NEXT is the only North American location of Icelandic hostel KEX, a 28-room boutique with private rooms and event spaces. For business travelers, KEX gets a good-neighbor discount at startup-centric coworking space CENTRL across the street, where you can book a meeting space or coworking berth. The downstairs lounge, Pacific Standard, offers oysters on the half shell and cocktails from internationally renowned bartender Jeffrey Morganthaler.\n\nNear Jupiter and KEX: The immediate neighborhood includes music venue Nova, patio bar Rontoms, excellent pizza and hoagies at Dimo’s Apizza, and terrific coffee from Roseline Coffee. Visitors can usually walk in for foie gras dumplings and steam burgers (which sound like a Simpsons joke and taste like heaven) at Canard, the wine-filled casual sister restaurant of James Beard Award-winning French prix-fixe spot Le Pigeon next door. High-rise luxury sauna and cold plunge spa Knot Springs, offering river views from hot or cold water, sits near KEX.\n\nWest-Side Hotels\n\nCourtesy of Sentinel\n\n614 SW 11th Ave., (503) 224-3400\n\nThe best advice around Southwest Portland’s downtown core is to stay above 9th Avenue, in the residential and restaurant-packed West End. Boutique hotel The Sentinel is within easy reach of the interstate, with corporate meeting spaces available and a classic seafood spot and steakhouse, Jake’s Grill, on the bottom floor, along with a tasting room for one of the country's premier wineries, Domaine Serene.\n\nNearby: One of the most extravagant views of the city can be found at Bellpine, the top-floor bar and restaurant at the nearby Ritz-Carlton, whose first-floor food hall, Flock, offers excellent birria tacos and a surprisingly well-stocked wine cellar. Nearby Multnomah Whiskey Library offers one of the largest and most renowned whiskey cellars in the country.\n\n1150 NW 9th Ave., (503) 220-1339\n\nFor longer stays, local execs tell us a favored location is the Marriott’s Residence Inn at the edge of Portland’s tony Pearl District just north of downtown, within easy reach of light rail to the airport—with small kitchenettes for leftovers or snacks, and an onsite gym and pool. This is a place to stay, and stay fit, while working away from home.\n\nNearby: A location of drop-in-friendly coworking space CENTRL is a brisk 14-minute walk away. Nearby Jamison square is a dense corner of upscale eateries and bars. The most acclaimed food in the neighborhood comes from nationally recognized Mexican chef Angel Medina, at prix-fixe Republica (reservations recommended) and its nearby a la carte cousin, Lilia Comedor.\n\nWhere to Work\n\nCourtesy of CENTRL\n\n329 NE Couch St., plus three more locations\n\nCENTRL is a midsize West Coast chain of coworking spaces with four locations in Portland that offers flexible and low-friction arrangements for drop-in business travelers. This includes $40-per-day open-format day passes and private collaborative day offices ranging from $100 to $300 a day. Relatively low-frills meeting rooms are also rentable by the hour.\n\n830 NE Holladay St.\n\nWeWork is back from the brink these days, and Portland has one of the more modern locations, with flexible day work options and a pleasant enclosed patio—plus the requisite craft beer taps and table tennis. If your company has a WeWork membership, this is where you’ll be—amid high rises overlooking Portland’s convention district.\n\n500 SW 116th Ave.\n\nThis luxe coworking space at the edge of Portland’s western suburbs is a perfectly located way station for those doing business in the chip-filled Silicon Forest west of Portland. Day passes and meeting rooms are available, in a sleek and high-ceilinged space attuned to corporate clients, with an attached health club.\n\nWhere to Get Coffee\n\nPortland was the earliest hotbed for third-wave craft coffee in America, and some of the best-regarded beans in the world come here to be roasted. Here are the spots that best let you mix excellent brew with Wi-Fi and a power outlet.\n\nPhotograph: Matthew Korfhage\n\n321 NE Davis St. and other locations\n\nRoseline is a midsize roastery with a few locations around Portland that offers perhaps the best mix of work-friendly spaces and truly excellent coffee—ranging from forward-thinking light roast drip coffee to balanced espresso shots.\n\n823 NW 23rd Ave.\n\nLooking for a café where you’re likely to find Portland tech intelligentsia? This sophisticated multi-roaster hall of espresso is your spot, with shots from far-flung roasters on offer. You’ll need to show up early to get a prime table.",
  "authors": [
    "Matthew Korfhage"
  ],
  "url": "https://www.wired.com/story/the-wired-guide-to-portland-for-business-travelers/"
}