{
  "title": "Trump busca eliminar protecciones para especies en peligro y amenazadas",
  "text": "CNN —\n\nEl Gobierno de Trump avanzó el miércoles para revertir las protecciones del Gobierno de Joe Biden para especies en peligro y sus hábitats.\n\nEl Servicio de Pesca y Vida Silvestre del Departamento del Interior y el Servicio Nacional de Pesca Marina de la NOAA propusieron restaurar reglas de la primera administración Trump que eliminaban salvaguardas para plantas y animales amenazados por el desarrollo humano y el calentamiento del planeta.\n\nEspecíficamente, permite que los factores económicos sean un punto principal al considerar qué especies en peligro merecen protección bajo la antigua ley ambiental. Las dos agencias también propusieron eliminar la llamada “regla general”, que extiende protecciones de nivel de especie en peligro a especies que están catalogadas como “amenazadas” de extinción.\n\nEsa regla general había sido impugnada en un tribunal federal por grupos de derechos de propiedad, pero ese litigio se había pausado mientras el Gobierno de Trump reescribía la norma. Ahora, la regla pasará por un período de comentarios públicos de 30 días antes de ser finalizada.\n\nFuncionarios del Gobierno de Trump defendieron su propuesta como sentido común. Grupos industriales se han quejado durante años de que las leyes ambientales se han vuelto demasiado restrictivas para grandes proyectos de energía, minería y desarrollo.\n\n“Esta administración restaurará la Ley de Especies en Peligro de Extinción a su intención original, protegiendo especies a través de estándares claros, consistentes y legales que también respetan los medios de vida de los estadounidenses que dependen de nuestra tierra y recursos”, dijo el secretario del Interior, Doug Burgum, en un comunicado.\n\nGrupos ambientalistas denunciaron la medida como algo que podría ser devastador para especies en peligro y amenazadas.\n\n“Al promover la perforación, minería, nivelación, tala y desarrollo a expensas del hábitat, este Gobierno llevará a las especies silvestres más queridas de Estados Unidos más lejos de su recuperación y más cerca de la extinción”, dijo la abogada principal de Defensores de la Vida Silvestre, Jane Davenport, en un comunicado. “Especies amenazadas como el manatí de Florida podrían perder fácilmente los avances logrados en su recuperación y acercarse aún más a la categoría de especie en peligro”.\n\nDefensores ambientales también argumentaron que existe un fuerte apoyo público para la protección de especies ambientales.\n\n“Los ataques de Trump a la Ley de Especies en Peligro de Extinción interpretan muy mal el sentir de la sociedad”, afirmó la abogada de Earthjustice, Kristen Boyles, en un comunicado. “La mayoría de la gente no va a permitir el sacrificio de nuestro mundo natural para un grupo de multimillonarios e intereses corporativos”.",
  "authors": [
    "Ella Nilsen"
  ],
  "url": "https://cnnespanol.cnn.com/2025/11/19/eeuu/trump-eliminar-protecciones-especies-peligro-trax"
}