{
  "title": "Porn Play review – Ambika Mod excels as an academic undone by pornography addiction",
  "text": "‘It’s not that deep,” Ani’s friend assures her. Who cares if she watches a lot of extreme pornography? But after the light is switched off, Ani can’t get through their impromptu sleepover without masturbating to porn on her phone. The friend wakes up next to her and exits in disgust.\n\nThe same scenario has already led Ani, a 30-year-old academic, to break up with her partner. Like Phoebe Waller-Bridge’s Fleabag, she was using porn next to her boyfriend in bed. Fleabag darkly regaled us with her voracious YouPorn habit but Ani, despite her robust reasoning in their argument, is deeply troubled by her behaviour. So, too, is her father when Ani hides away in her old childhood bedroom with her laptop.\n\nIt’s frequently funny but this bold play by Sophia Chetin-Leuner captures the wearying compulsion of an addict, showing how the search for release has turned into grim habit. The characters in her previous play, This Might Not Be It, which also has caring at its core, have a phrase for this sort of desensitised state: “your tap’s been switched off”. In a riveting performance, Ambika Mod manages to make Ani’s isolation and emptiness as moving as it is unsettling.\n\nView image in fullscreen Isolation and emptiness … Ambika Mod and Asif Khan in Porn Play. Photograph: Helen Murray\n\nKey to the play’s success is the way Chetin-Leuner and director Josie Rourke skilfully toggle between the digital and physical worlds to emphasise the seductive, instant gratification of the internet where, as Bo Burnham put it, “anything that brain of yours can think of can be found”. Ani’s brain has accordingly been rewired and her restless search for comfort online is a constant amid the stress that comes with professional success and her grief after her mother’s death. She recognises those as triggers yet, tellingly, co-opts a friend’s sexual revelation to hide behind instead when discussing her behaviour.\n\nAs a play about chronic addiction, this story is full of secrets, emphasised by Yimei Zhao’s inspired design which transforms the Royal Court’s small upstairs theatre into a padded den. It’s staged in the round, typically seen as giving nowhere to hide, but Ani conceals her laptop and other belongings between the folds of the cushioned floor. The concentric, vulva-like design of the space becomes a cocoon softly lit by Mark Henderson as Ani escapes into her ritual of internet porn. But it also resembles a vortex and, in the prologue, is used to evoke Eve staring at her reflection in Milton’s Paradise Lost.\n\nView image in fullscreen Ethical unease … Ambika Mod and Will Close in Porn Play. Photograph: Helen Murray\n\nAni is a Milton scholar and the drama tussles not just with notions of lost innocence (the alternate meaning of “play” in the title) and his epic poem’s sexual politics but also the question of separating the art from the author’s behaviour. That ethical argument bleeds into Ani’s distinction between watching violent pornography (“it’s all fake”) and her IRL views of women and the world. The porn on Ani’s screens is shown in abstract, highlighting how the footage itself is almost inconsequential, and is matched by the thrumming, distorted ecstasy of Helen Skiera’s score.\n\nThe ambitious balance of tragedy, horror and comedy is best in a painful scene where Ani’s boyfriend holds the phone for her while she masturbates. It does not quite come off in a gynaecological appointment (for which a whole gurney is extracted from beneath the set) where Ani’s shame is voiced by her doctor.\n\nWill Close, Lizzy Connolly and Asif Khan deftly handle multiple supporting roles between them in a show with sharply delineated movement direction by Wayne McGregor. The play’s strands are directly tied together through Ani and her father’s climactic speeches in the sort of ending that can often feel forced but is greatly persuasive here. It’s a play that confirms Chetin-Leuner as a clear-sighted yet sanguine chronicler of all manner of relationships, not least with ourselves.",
  "authors": [
    "Chris Wiegand"
  ],
  "url": "https://www.theguardian.com/stage/2025/nov/14/porn-play-review-ambika-mod-royal-court-theatre-london"
}