{
  "title": "Young Mormons Built an App to Help Men Quit Gooning",
  "text": "Jamie would meticulously schedule his days around finding time alone to watch porn and masturbate—often up to five times a day.\n\nThe 32-year-old Michigan engineer, who did not want to use his real name due to privacy concerns, first watched porn at the impressionable age of 12, but never realized he had a problem until just after his father’s funeral three years ago.\n\n“I didn't shed a single tear,” he says. “I didn't know how to react happily or sadly to anything.” That’s when his porn consumption spiraled—combined with stress, anxiety, and depression—and he locked himself in his room “all day.” The only thing that seemed palpable, he recalls, “was that rush of dopamine” delivered by an intense session of hardcore porn viewing. But for Jamie, who is Christian, those fleeting moments of porn-fueled transcendance were followed by far deeper lows, including suicidal ideations.\n\nThis past March, Jamie says his partner angrily confronted him over his compulsive porn consumption, accusing him of lying and committing adultery.\n\nJamie’s “entire world came down.” He admitted he felt that he was addicted, begged for her forgiveness, temporarily moved back in with his mother, and renounced porn. That’s when he found Relay, an app created by a pair of Mormon college students that claims it can help people “take back control from porn, one day at a time.” Jamie promised his partner he would never watch porn again—and she gave him one chance.\n\nThe app provides a comprehensive plan to stop watching porn, with videos by therapists, daily journal prompts, live group sharing sessions, and a function to address serious urges. Users even keep track of each other’s porn-free streaks, with a “Live Milestone” ticker. This is all in an effort to help customers, who pay $149 per year for full access, unpack their underlying issues like loneliness and trauma to help prevent relapse. The app has been downloaded over 110,000 times, with company data showing that 89 percent of its users are male.\n\nThis month, Relay has partnered with anti-porn advocacy nonprofit Fight the New Drug for “the November Project”—a new initiative to encourage people to abstain from porn—with 28,000 sign-ups so far.\n\nThe scale of pornography use represents “a modern epidemic,” claims Relay’s CEO, Chandler Rogers. The 27-year-old, who is a member of the Church of Jesus Christ of Latter Day Saints, or Mormon, was inspired to cofound the app in August 2021 to provide his Gen Z peers a path to stop watching porn. It followed his own self-described yearslong addiction to explicit content. Rogers, who attended Brigham Young University in Utah where he met both his cofounder and chief of staff, says he tried to stop “at least 100 times, and could never go more than a week without turning back to pornography.”",
  "authors": [
    "Mattha Busby"
  ],
  "url": "https://www.wired.com/story/young-mormons-built-an-app-to-help-men-quit-gooning/"
}