{
  "title": "Bryan Johnson Wants To Live Forever",
  "text": "Transcript\n\nTrue or false?\n\nYou, Bryan Johnson, the man sitting across from me,\n\none day, at some point,\n\nas of yet undefined in the future, you will die.\n\nFalse.\n\nTell me more.\n\n[camera shutter clicks]\n\n[upbeat music]\n\nDeath has always been inevitable.\n\nAnd so we have made all these preparations,\n\nlike, we talk about immortality\n\nin professional achievement,\n\nwe talk about a life after death.\n\nAnd so they are the ways\n\nthat we've dealt with it up to this point.\n\nAnd now we have this real possibility\n\nof extending our lifespans to some unknown horizon.\n\nSo that's extension.\n\nBut we also have the ability to begin moving ourself\n\nto computational systems.\n\nSo currently, in a very crude form,\n\nI have a Bryan AI\n\nthat has digested everything I've ever said all by-\n\nYou do currently have this?\n\n[Bryan] I do. Okay.\n\nYeah, and so as the technology gets better,\n\nand it gets trained on more of my thoughts,\n\nit's only going to improve.\n\nI think all of us are in a time and place\n\nwhere we will be immortal to some degree.\n\nNow, whether it's in this body,\n\nwhether it's in some kind of computational arrangement,\n\nwhether it's both, or a combination of both,\n\nI think we've reached that point as a civilization.\n\nAnd the reason I ask that, I mean maybe it's obvious,\n\nbut I'm trying to sort of understand\n\nfrom what premise you are beginning, right?\n\nBecause you talk a lot about living a healthier life,\n\nextending the human lifespan.\n\nWhat I was curious about is sort of how far you see\n\nthat possibly going,\n\nand sort of whether you accept the notion for yourself\n\nthat, at some point, you, Bryan,\n\nyour biological material, right,\n\neverything that makes you you will be buried,\n\nwill be cremated, there will be a will,\n\nthere will be an estate plan, right?\n\nThat all of those things\n\nthat go into the way we plan for death,\n\nlike, are those things that you contemplate\n\nand that you plan for or not?\n\nDo you have a will?\n\nI do.\n\nYeah. Good.\n\nI do.\n\nI have a will,\n\nand I've made all the practical decisions on,\n\nif I am in a comatose state, what are my instructions?\n\nSo I have gone through all those preparations.\n\nThe future is always present.\n\nIt's just a question if you can see it or not.\n\nAnd I think this moment is probably the biggest test\n\nof trying to piece together what is really happening\n\nwith the speed at which AI is improving\n\nand what does that mean\n\nfor how it's going to change everything we understand\n\nabout reality.\n\nAnd many people are poking at this,\n\nlike, trying to make their predictions\n\nand organize the world to the best they can.\n\nAnd I'm basically saying\n\nthat we are headed towards this event horizon\n\nwhere AI is now improving at a certain speed.\n\nIn a few years time, we probably can't see past that point.\n\nWe don't know what happens.\n\nAnd as technology gets better and better,\n\nthe most prized asset is going to be existence.\n\nThat immortality, as we thought about it before,\n\nthrough accomplishment or through offspring\n\nor any other, or the afterlife,\n\nwill be devalued relative to existing.\n\nAnd that's my fundamental bet on the future,\n\nis that's where we're headed.\n\n[camera shutter clicks]\n\nLet me ask you this,\n\nif there was a world where, let's say, in five years,\n\nyou could upload Bryan...\n\nYeah.\n\nInto an AI, right,\n\nan AI Bryan is, yeah, pretty much as good as Bryan Bryan.\n\nDoes Bryan Bryan eat the cheeseburger?\n\nYeah. You know what I mean?\n\nLike, does some of this, does sort of this, you know,\n\nfrom everything I can tell,\n\nit is every waking minute of your life,\n\nand it is every sleeping minute of your life\n\nsort of committed to this one singular goal, right?\n\nThat is your entire existence.\n\nYeah.\n\nHave you contemplated whether or not that would change?\n\nYeah.\n\nI mean, okay, so let's think about your question\n\nin a different way.\n\nI could say about people today\n\nthat most people spend every waking moment pursuing wealth.\n\nThe time they're not spending pursuing wealth,\n\nthey're pursuing some sort of status or prestige,\n\nyou know, socially signaling to their community,\n\ntheir tribe of some power,\n\nor something to that effect.\n\nNow, I could certainly say that\n\nand say that's a malaise that has everybody locked in\n\nto a singular game that is consuming\n\nall of their resources and all their attention.\n\nAnd what I'm saying is I'm devoting every second\n\nof my existence to existence.\n\nWhen you die, inevitably, that's when how it has been,\n\nit makes sense to pursue power and status.\n\nThat makes sense.\n\nWhen you give birth to superintelligence\n\nand now you can start extending lifespans\n\nto some unknown horizon, 200 years, a thousand years,\n\n10,000 years, we don't know, millions of years,\n\nwe don't know.\n\nWhen that happens, the entire game of humanity shifts\n\nfrom that singular focus\n\non wealth accumulation and status and prestige to existence.\n\nNow embedded in existence,\n\nwe may still play games\n\nof power, prestige, status, et cetera,\n\nbut it'll be conditioned of that existence itself\n\nis the highest virtue.\n\nThat's the shift that's starting to happen right now.\n\nSo let me pivot over then to the conversation\n\nabout your existence.\n\nSo, you know, you've talked at length,\n\nyou talked a great deal.\n\nYou are very much out there in the public eye\n\ntalking about a day in the life of Bryan.\n\nYeah.\n\nWalk us through a day in the life right now.\n\nI know that the protocol changes,\n\nthat you're adapting it, modifying it.\n\nWhat does it look like today?\n\nTake us through a typical day\n\nfor you. Yeah.\n\nIt may be helpful to have the backdrop\n\nthat what I do is I'm saying\n\nthat existence is the highest virtue.\n\nAnd if you accept that premise, then I say on a given day,\n\nI want to identify every single thing\n\nthat could kill me or make me die.\n\nAnd then I want to identify every single thing\n\nthat could help me make me live.\n\nOkay.\n\nAnd so let's just say I live in California\n\nand the life expectancy is around 79 years.\n\nSo if I behave like a typical human,\n\nI probably have a life expectancy to 79 years of age.\n\nNow, if I identify things\n\nthat could potentially shorten that,\n\nlike smoking, drinking, breathing bad air,\n\ndrinking toxic water, you know, not getting exercise,\n\net cetera, then if I think of good things\n\nthat could extend my life even further\n\nto, you know, currently the cap is, like, 120,\n\nI can say, well, I'm gonna eat healthy foods and exercise.\n\nAnd so my daily protocol\n\nis basically trying to identify at a molecular level\n\nevery single thing that either extends or shortens life, so.\n\nI mean, I'm laughing because your daily protocol,\n\nI will be honest, it's much more elaborate\n\nthan eating well and exercising.\n\nIt was not just eating well and exercising,\n\nlike, you'd have a pretty chill time.\n\nYeah.\n\nYou're not necessarily having, like, the chillest time.\n\n[Bryan] Yeah.\n\nTell us a little bit\n\nabout that. Okay, cool.\n\nSo, my everyday begins the night before.\n\n[Katie] Okay.\n\nSo I have built my entire existence around sleep.\n\nI mean, I like that. You have to sleep.\n\nYeah. How well do you sleep?\n\nWell, we're gonna get to that.\n\nCan you tell me how many hours a night you sleep?\n\nEight hours and 34 minutes is my 12-month average.\n\nMy sleep profile is that of a early 20 something.\n\nI've worked very hard at this.\n\nSo it's eight hours and 34 minutes.\n\nI get over four hours of restorative sleep.\n\nThat's deep sleep and REM, where the body cleans itself\n\nand repairs and rebuilds.\n\nI'm up less than one time per night on average.\n\nI go to bed, within two to three minutes,\n\nI have my head hitting the pillow,\n\nand I have 94% sleep efficiency.\n\nSo once I lay down\n\nand my stress score during the night,\n\nlike, typically, most people's sleep signal\n\nis like a rocky chart of a stock market, you know,\n\nand mine is just flat, like my consciousness is at peace.\n\nAnd so those are the stats you wanna see\n\nfor a perfect night's sleep.\n\nBut to do that, you can't just show up\n\nand just say, I'm gonna put my head on the pillow\n\nand fall asleep.\n\nYou kind of have to build\n\nyour whole life system around that.\n\nSo my day begins the night before when I go to sleep,\n\nand then I'll wake up around 4:30 or 5:00.\n\nOkay.\n\nAnd then I'll do, for the next four hours,\n\nI will have a series of measurements and therapies.\n\nI get outta bed, I try to, within one minute of waking.\n\nWithin one minute?\n\nYeah, I try to avoid the 10 more minutes\n\nor pull the phone up and start scrolling.\n\nI get up, I will get light in my eyes\n\nwithin a few minutes of waking.\n\nSo I wake up before the sun,\n\nso it's 10,000 lux light in my eye for a few minutes.\n\nI'll take my inner ear temperature.\n\nI measure my temperature every single day.\n\nOne thing we've noticed is,\n\nas I've done this for the past four years,\n\nmy body temperature has dropped\n\nalmost four degrees Fahrenheit, a massive drop.\n\nSo now it's around 94 degrees Fahrenheit each morning.\n\nThat's down from 98.7.\n\nSo there's good evidence that species\n\nwith a lower basal temperature live longer.\n\nI will then put a serum on my hair or my scalp,\n\nrub my scalp with a silicone scrubber for hair growth.\n\nI'll take a quick shower and then I'll come downstairs.\n\nI have a morning drink.\n\nI will eat something, I'll work out for an hour.\n\nI'll do red light therapy.\n\nI'll then do a hyperbaric oxygen therapy, then some sauna,\n\nthen I'll rinse off and then I'm ready for work.\n\nOkay. So that is quite a regimen.\n\nAnd you stop eating at?\n\nAround noon.\n\nAround noon.\n\nYeah, and then, like, also in the morning,\n\nI'll typically do, like, a few tests.\n\nLike today, I did three tests.\n\nThere's so much to this protocol,\n\nthere's sort of so much data that you've accumulated.\n\nReally quickly, like, rapid fire,\n\nnot to put you on the spot, but I am,\n\nask me a couple really quick questions about myself.\n\n[Bryan] Yeah. And then tell me\n\nhow am I doing in the Bryan Johnson universe.\n\n[Bryan] Great. Go.\n\nWhat is your resting heart rate?\n\n48 beats per minute.\n\n[Bryan] That's fantastic. Thank you.\n\nWhat is your most recent inflammation,\n\nyour body inflammation blood test result, your hs-CRP?\n\nBryan, I have no idea.\n\nWhat is your blood glucose level?\n\nA good one.\n\nOkay. Okay, good.\n\nHow many continuous pushups can you do?\n\nProbably, like, 10. Okay.\n\nIf you stood on one foot and closed your eye,\n\nhow long could you stay standing?\n\nA minute.\n\nYeah. A minute?\n\n[Katie] Yes. A minute.\n\nThat's very good.\n\nOh, yeah.\n\n[Bryan] Okay. Good. Try me.\n\n[Bryan] Okay. Not right now.\n\n[Bryan laughs]\n\nYeah. What is the length of your telomeres?\n\nI don't know.\n\nOkay. What are your omega levels?\n\n[Bryan] I don't know. Okay.\n\nThese are very involved questions.\n\nWhat is your speed of aging?\n\nWell, according to the skin test I took earlier, Bryan,\n\nit was 1.9.\n\nYeah. Yeah.\n\nSo tell me, okay, so I didn't learn very much.\n\nI think what I learned is that there's a lot more to this\n\nthan do you drink, do you smoke, do you exercise,\n\ndo you sleep enough?\n\nThat's what I thought you were gonna ask me.\n\nI do not know the length of my telomeres.\n\n[Bryan] Yeah. But apparently,\n\nthat's something someone can find out.\n\nYeah, so the reason I ask you those questions\n\nis because I can pose a question, like, How's your sleep?\n\n[Katie] Yeah.\n\nAnd you can give me a generic answer like,\n\nI sleep great or I feel great.\n\nBut if you look at the actual data of your telomere length,\n\nit tells me the story of your overall health.\n\nThe same with your blood glucose levels.\n\nThe same with your speed of aging.\n\nThese are readouts of your biology that just say,\n\nThis is me in raw form.\n\nThere's no storytelling, there's no subjective assessment.\n\nIt's just the data.\n\n[camera shutter clicks]\n\nYou were in a Netflix documentary earlier this year.\n\nYou talked a lot sort of about your history\n\nin that documentary, right?\n\nYou were a successful entrepreneur.\n\nYou felt like you weren't living your healthiest life.\n\nYou parted ways with Mormonism.\n\nYou were Mormon for a very, very long time.\n\nYou got divorced, right?\n\nYou went through all of these seismic life changes.\n\nAnd a lot of people make major changes\n\nto their lives, right?\n\nThey hit a wall with stress or in a marriage\n\nor with their religion, right?\n\nExceedingly few people.\n\nVery, very, very, very, very few people\n\ngo as far as you have.\n\nWhat is it that pushed you past the point\n\nthat the vast majority of people would go?\n\nI'm really motivated by having read\n\nvarious biographies of history\n\nand people throughout time and place,\n\nin their moment, they were able to identify\n\nthe most far ranging ambition identifiable.\n\nYou couldn't have sequenced the genome in the year 1800.\n\nThe technology wasn't present.\n\nYou could have had that ambition in the early 90s.\n\nAnd that they did, someone did.\n\nAnd they actually sequenced the genome.\n\nAnd so in any given time point,\n\na new emergent possibility is present.\n\nThen there's two questions that arise.\n\nOne is, what is it?\n\nAnd two is, will somebody do it?\n\nAnd in the year 2021 was the first time in human history\n\nwhere a person could say,\n\nWe are the first generation who won't die\n\nand not be ridiculed.\n\nIt just became possible.\n\nAnd I saw that and I thought this is a moment,\n\nlike, when it comes together where you see it\n\nand you can do something about it.\n\nAnd so I wanted to try to capture what this moment is.\n\nHmm.\n\nNow, if you talk to people who know me,\n\nif you asked my husband, right, poor guy,\n\nthey would say that I'm a very controlled person, right?\n\nLike, I wake up at the same time every day.\n\nI do the same exercise.\n\nI tend to eat a lot of very similar foods.\n\nLike, there's a lot of routine and structure to my life.\n\nI will say, when I read about you,\n\nwhen I watch, you know, videos about you,\n\nwhen I hear about the way you live,\n\nI, as a very controlled person,\n\nam astounded at how controlled your life is.\n\nHave you always been that way?\n\nWell, like, when you think back 20 years ago, 30 years ago,\n\nsix years ago, was control always something\n\nthat was a defining characteristic?\n\nMm-hmm.\n\nI suppose it's the difference\n\nbetween being called a germophobe and being germ-aware\n\nand how people label your methodical building\n\nof life systems as control.\n\nAnd I would reframe it and say,\n\nyou're actually a really smart engineer.\n\nThat you realize that the metabolic cost\n\nof you having to make these decisions every single day\n\nspur of the moment is so expensive to you\n\nthat you are wise and say, You know what?\n\nIt's not worth it.\n\nI'm just going to systematize this\n\nso that my brain can then be allocated\n\ntowards other higher level thinking.\n\nSo I would applaud your systems\n\nand say like, you actually are very clever\n\nin the way you've structured your life.\n\nAnd so I kind of feel the same way\n\nthat why would I fight these daily miscellaneous,\n\nultimately irrelevant decisions\n\non a moment-to-moment basis when they can just be automated?\n\nAnd I'd rather spend my scarce brain capacity\n\nthinking of higher level things\n\nabout the future of the human race, for example,\n\nthan I would, like, what am I gonna have for breakfast?\n\nAnd so I think historically,\n\nI've very much thought like an engineer my entire life.\n\nYou take a given system, you dissect its parts,\n\nyou reassemble it into some kind of constructive\n\nand positive manner.\n\nBut I'd say, like, what I do now\n\nis definitely beyond what I did before.\n\nBut what I'm trying to demonstrate is Bryan Johnson in 2025\n\nis a normal dude in 2030.\n\nIt's just like our-\n\nIn five years?\n\nIn five years, that the apparatus around us\n\nthat things will just be automated,\n\nhealth will be so much more automated than we are now.\n\nThat the weirdness of who I am\n\nor what I am will be forgotten.\n\nPeople will remember in that context,\n\nbut when they look at me, they'll just be like,\n\nOh, yeah, like, he just was ahead of the time.\n\n[camera shutter clicks]\n\nI was getting ready for this interview.\n\nI was reading, sort of reading up on you.\n\nAnd in 2023, I was leading the newsroom at VICE.\n\nAnd we actually published a story on you.\n\nAnd you talked in that story about your body image\n\nfrom decades ago.\n\nYou talked about how hard it was at that time\n\nto control yourself around food at night, right?\n\nYou talked about how you now often go to bed hungry,\n\nthat you have learned to find joy in that.\n\nAnd in reading that and just in very good faith,\n\nI'm being very transparent with you here,\n\nif I stripped your name out of that,\n\nand I just looked at a bulleted list of those comments,\n\nyou know, that sounds a lot like me 20 years ago\n\nwith a very serious eating disorder.\n\nI mean, there was a period in my life where I was very sick,\n\nand I was very controlled\n\nand everything that went into my mouth, right?\n\nAnd it wasn't about the number on the scale,\n\nit wasn't about how I looked.\n\nIt was about being able to systematize\n\nand control my environment.\n\nAnd, you know, I am not a doctor, I'm not a psychiatrist.\n\nI think if you were to ask some doctors and psychiatrists,\n\nand I'm sure this criticism has been leveled before,\n\nthese comments have been made before,\n\nthey would say, Well, that sounds like disordered behavior.\n\nThat sounds like an eating disorder.\n\nYeah.\n\nDoes that resonate with you?\n\nI mean, how do you respond to that?\n\nAnd I think particularly,\n\nwhen we're talking not just about you,\n\nbut about you as a public figure\n\nadvocating for a certain approach to health,\n\ndo you have concerns about sort of\n\nwhat you are advocating for and sort of what you are doing\n\nand how that might be adopted\n\nby sort of the population at large?\n\nYeah. Yeah.\n\nMost people I know in America have an eating disorder.\n\nI rarely meet somebody\n\nwho doesn't find themselves late in the evening powerless\n\nto stop themselves from eating the ice cream or the cookies\n\nor the chips or, you know,\n\nwhatever else they find in the pantry.\n\nThat is probably the most universal experience\n\nshared among Americans in this moment.\n\nAnd it probably has to do with a combination of,\n\nit's culturally acceptable.\n\nOur foods were scientifically,\n\nmethodically built to be addictive.\n\nYou just pull up an app\n\nand, like, delivers to your house real time\n\nwhatever you want.\n\nSo I would say it's really more\n\nof a widespread societal problem\n\nthat we have an addiction problem with food, our phones,\n\nand, you know, our entertainment, our scrolling,\n\nit's everywhere.\n\nAnd so certainly,\n\nI don't know if my addiction is more excessive\n\nthan other people's addictions,\n\nor if it just weighted more towards food versus the phone.\n\nBut I'd say I'm probably pretty average\n\non a population level addiction scale.\n\nHmm, and so you have sort of taken that,\n\nI guess, what used to manifest in one way,\n\nwhich is sort of, like, an inability\n\nto control what you were eating when you were eating it.\n\nAnd you have adopted a new way of approaching it,\n\nwhich is saying, I eat these things at these times,\n\nand I sort of eliminate the variables,\n\nI take the choice out of it,\n\nand that is how I am going to manage\n\nthis part of my health.\n\nYeah, exactly.\n\nAnd I guess more broadly,\n\nit's kind of a cultural commentary\n\nwhere I'm saying the most powerful forces in all of society,\n\ncorporations, are pointing their power\n\nat getting you to be addicted to their thing.\n\nWhether it's scrolling their app,\n\nwhether it's eating their food,\n\nwhether it's watching their show,\n\nall their science, all their technology,\n\nall their intelligence is pointed at you\n\nand trying to get you to be addicted.\n\nAnd what I was saying is, when you are addicted to anything,\n\nit reduces your freedom and your agency,\n\nthey ultimately have you in a bind.\n\nI don't want to be addicted to anything.\n\nI wanna have agency and freedom over my existence\n\nas much as possible.\n\nAnd so that's what I'm trying to build.\n\nAnd so I realize that people on the outside looking in,\n\nthey do take that approach\n\nand say, He's working through his childhood trauma,\n\nhe's working through a food addiction.\n\nI'm open to all those explanations.\n\nLike, I would be the first person to be self-deprecating\n\nand be like, This guy's got issues, unquestionably.\n\nAlso, in my interactions with others,\n\nit is a very common phenomena\n\nthat humans struggle in modern society.\n\nAnd I'm trying to offer an antidote\n\nthat I didn't have anybody,\n\nnot a single person in my life advocating for me\n\nthat I take care of my health.\n\nNobody.\n\nIt was work harder.\n\nLike, I'm so proud of you for achieving this.\n\nLike, didn't matter if I was ragged or depressed\n\nor overweight, like, the direction went elsewhere\n\nexcept for, Bryan, can I be a positive influence\n\nin your life and encourage you to go to bed on time\n\nand get some exercise?\n\nSo I'm really trying to play that role in society\n\nwhere I'm saying, Look, this is a mess.\n\nWe are all a mess.\n\nAnd can we be honest about the situation?\n\nEven those who are accusing me of being addicted\n\nand having a food eating disorder\n\nor whatever the problem,\n\nthey themselves are equally shackled with addictions.\n\nYou're addicted to longevity.\n\nYeah.\n\nThere's probably no way of actually getting over addiction\n\nother than controlling where your addiction is pointed.\n\nI would agree with that.\n\n[camera shutter clicks]\n\nI wanna ask you about your fame.\n\nYou were sort of just talking about population-wide health,\n\nand I think that one of the observations\n\nthat I have made as a journalist in the last several months,\n\nsince President Trump was elected\n\nand inaugurated in late January,\n\nis that to me with notoriety, with fame\n\ncomes a degree of responsibility, right?\n\nResponsibility for what you say, how you say it,\n\nwhen you speak up, when you choose not to.\n\nI want to ask you about MAHA.\n\nI wanna ask you about RFK Jr.\n\nWhen President Trump won the election,\n\nyou congratulated him on social media\n\nas did so many very high-profile business leaders.\n\nYou were photographed with RFK Jr.,\n\nMAHA as sort of the tagline in the photo.\n\nI'm really curious for your assessment\n\nat this point in time of RFK Jr.\n\nand the Trump administration vis-a-vis American health.\n\nIf I had to guess,\n\nand I'll let you answer the question in a minute,\n\nyou know, I would suspect that there's a lot there\n\nthat someone in your position would like, right?\n\nThe idea of, you know, stripping additives outta food.\n\nYou know, we have also seen massive cuts\n\nat federal health agencies.\n\nWe have seen already, you know, grants\n\nwith regards to cutting-edge research,\n\nmRNA vaccines being a very early target.\n\nWe've seen a lot of sort of the very promising\n\nsort of bleeding-edge medical research\n\nthat you have been able to adopt in your own life.\n\nYou know, really on the chopping block\n\nin this administration,\n\nI would really appreciate your assessment\n\nof the Trump administration and RFK Jr.\n\nas it pertains to public health,\n\nwhich is, you know, in many ways,\n\nthe sort of premise of your entire operation here, right?\n\nWhich is really sort of educating the public\n\nabout how to live a healthier life.\n\nYeah.\n\nHow do you rate the administration so far?\n\nYeah.\n\nI mean RFK is certainly not a status quo person.\n\nI think you can say that,\n\nyeah. Yeah.\n\nAnd I think I would say\n\nthat the status quo in the U.S. is not working.\n\nIf you look at the data around the health of our citizenry,\n\nit's embarrassingly bad.\n\nWe spend 1.8 times our peer countries in healthcare,\n\n$13,000 per person versus, like, 6,000 or so\n\nthe other developed countries.\n\nSo we spend more and we get less.\n\nAnd so whether RFK is the solution or not,\n\nwhat we're doing is not working.\n\nI'm open to change,\n\nand I'm open to a variety of possibilities.\n\nIt's not to say that everything he's doing is correct,\n\nbut I do support the idea\n\nthat we definitely need to change,\n\nbecause what we're doing now is not working.\n\nDo you worry about medical research\n\nbeing delayed, right, by years or decades,\n\nif it is curtailed right now?\n\nYeah.\n\nIn these kinds of circumstances,\n\nI'm not apprehensive of change.\n\nScience always finds a way forward,\n\nand progress always finds a way forward.\n\nAnd so oftentimes, when one path is discontinued,\n\neverybody thinks it's an end of something,\n\nbut actually that change produces a new path\n\nthat people didn't anticipate.\n\nSo, no, I support the creative destruction.\n\nI think it could have some positive outcomes.\n\nClearly, there could be some drawbacks,\n\nlike, when you break things like this, it goes both ways.\n\nIt's not, like, a clean win or loss.\n\nBut I'm generally in favor of new ideas or new approach.\n\nBecause I mean, I think, what would be cool\n\nis if we as a country said\n\nwe want to be number one in the entire world\n\nfor life expectancy, that is a very clear goal.\n\nAnd then once you back into it\n\nand you look at all the practical things\n\nthat determine that,\n\nbut that to me would be like a something\n\nwe all can say we agree,\n\nlike living long, healthy lives\n\nand not, you know, long health spans\n\nwould be an admirable goal for entire country.\n\nSo I would like more unification on this\n\nthat we actually have a big goal to work towards,\n\nversus now it's, like, trying to find the evil doers\n\nand knocking them out, which is fine,\n\nbut also we don't really have a positive goal.\n\nWho are the evil doers that we're knocking out?\n\nI mean, for example, like, you see the red dye.\n\nA lot of the ingredients we have in this country\n\nare not used because they promote health.\n\nThey're used because they create addiction,\n\nor they're low cost.\n\nAnd so I think there's an acceptance of selling death.\n\nAnd we just say, That's capitalism.\n\nWhat else are we gonna do?\n\nWhat is a life well lived for Bryan Johnson?\n\nNot dying.\n\nPeople evaluate my life\n\nand they say, Bro is so busy trying to not die,\n\nhe ain't living.\n\nThey do say that.\n\nAnd then next they say,\n\nI wish he would get hit by a bus.\n\nLike, they're so upset.\n\n[Katie] Have not seen them say that, but I believe it.\n\nIt's, like, LOL, can't wait till he gets hit by a bus.\n\nBut they're so upset for a variety of reasons,\n\nwhether they can't make the change themself,\n\nwhether they feel like they've been wronged,\n\nwhether they don't have the willpower.\n\nAnd I get it, I've been there,\n\nso I'm not blaming them,\n\nbut they go through this response\n\nwhere they're having to reconcile\n\nthat they are not the person they wanna be\n\nand someone else is doing something that they're not.\n\nAnd so they're going through some kind\n\nof reconciliation process.\n\nThey go through the other five stages of grief.\n\nAnd so I understand why people\n\nhave a such a strong reaction to me.\n\nI get it.\n\nLike, I've been there before,\n\nand it's a very helpless feeling.\n\nBryan, thank you for your time.\n\nI'm really glad you came.\n\nYeah, it's nice to be hanging out with you.\n\n[upbeat music]\n\n[gentle music]",
  "authors": [
    "Condé Nast"
  ],
  "url": "https://www.wired.com/video/watch/the-big-interview-bryan-johnson"
}