{
  "title": "The Inside Story of How Gen Z Toppled Nepal’s Leader and Chose a New One on Discord",
  "text": "Rakshya Bam grew up in Kailali, a lowland district in Nepal’s far west, where the subtropical plains stretch toward the Indian border. The region is known for its dense sal forests and fertile fields, but after years of neglect it’s one of the country’s poorest areas.\n\nNepal is one of the youngest countries in South Asia, with a median age of 25.3 years (the US median age is 39.1). High fertility rates in previous decades have created a “youth bulge”—the largest in the region’s history. But many young people like Bam see no future in their homeland. The country has effectively outsourced its labor market to Malaysia, South Korea, and the Gulf states, exporting its youth instead of creating opportunities at home. Minimum wages are not enough to sustain a life within Nepal’s borders, leaving young Nepalis with a stark choice: Leave to study abroad, or leave to work abroad.\n\nThose who stay are forced to contend with a political system that doesn’t work for them. Even with steep taxes, essential services are in disarray. In the 1950s, the first democratic movement brought free elections, before the monarchy reasserted control. In the 1990s, citizens rose again and reclaimed democracy, but poor governance, civil war, and the 2005 royal coup, when King Gyanendra dismissed parliament, arrested political leaders, and imposed a media blackout, snuffed out that hope. Even after the fall of the monarchy and the end of the war, the structural problems that had driven Nepal’s unrest persisted. The Maoists, who had launched a decade-long “People’s War” in 1996 demanding the creation of a republic that would address deep inequalities, especially in rural Nepal, were subsumed into mainstream politics. Their movement, once rooted in the frustrations of marginalized groups like Dalits, Indigenous communities, and poor farmers shut out of Kathmandu’s elite, helped establish Nepal as a federal democratic republic. But over time, the Maoists became part of the same establishment they had once fought to dismantle. Power continued to circulate among a familiar set of parties and leaders.\n\nFor Bam and her peers, the online world offered a place to express outrage, build solidarity, and speak freely. She started posting about corruption and inequality on social media, sharing photos of herself at small rallies, holding a megaphone or a hand-drawn pamphlet. Then, in early September 2025, a new trend started to sweep across Nepali social media.",
  "authors": [
    "Tulsi Rauniyar"
  ],
  "url": "https://www.wired.com/story/nepal-discord-gen-z-protests-vote-prime-minister-election/"
}