{
  "title": "How Jeffrey Epstein used SEO to bury news about his crimes",
  "text": "is features writer with five years of experience covering the companies that shape technology and the people who use their tools.\n\nOn December 11th, 2010, Jeffrey Epstein was fretting about what came up if you Googled him. By this time Epstein had already pleaded guilty to soliciting prostitution with a child and was a registered sex offender, and just a few days earlier he had been photographed in Central Park taking a stroll with Prince Andrew.\n\nEpstein emailed an associate to complain. “the google page is not good,” Epstein wrote, according to documents released last week by the House Oversight Committee. He also took issue with tens of thousands of dollars of payments, which appear to have been made to “clean up” results. “I have yet to have a complete breakdown of payments. and the results , are what they are.”\n\nSomeone named Al Seckel — perhaps Epstein accomplice Ghislaine Maxwell’s sister’s late partner — responded later that evening, sharing what he was seeing. The results included Epstein’s Wikipedia page, a New York magazine article, a “jeffreyepsteinscience.com” website, a hair transplant surgeon with the same name, and a story correctly naming him as a sex offender.\n\n“This is BEFORE the next big sweep. I UNDERSTAND your point about ‘one thing kills me,’ but the daily beast article is gone, the other ones, including the powerful Huffington Post, are about to be pushed off. And, out stuff is on top.”\n\nEpstein and others discuss how to use technical SEO tactics to bump news articles from Google’s first page of results\n\nWithin the documents released last week, we see Epstein and his circle strategize how to bury unflattering coverage of him on Google and elevate what they want — search engine optimization to try to whitewash the reputation of a rich pedophile with powerful friends. Throughout the documents, Epstein and others discuss how to use technical SEO tactics to bump news articles from Google’s first page of results, cozy up to reporters they perceive as focused more on business than Epstein’s crimes, and how to get a crisis PR machine in motion to launder his digital presence. To those familiar with SEO, these strategies will look familiar — it’s the same playbook used by everyone from restaurants to news publishers to companies selling tennis shoes and photography services online. Everyone knows Google Search is the gateway to the internet; it’s just that this time, these same practices were deployed as cover for perhaps the world’s most infamous pedophile.\n\nA few days after Epstein complained, Seckel followed up with good news: Only one “negative” article — from The Huffington Post — remained on the first page of results.\n\n“The Huffington Post is extremely hard to move, because it is so powerful, has millions of links to it, and uploads massive new and original content it on a daily basis with posting from out side readers,” Seckel wrote. “We managed to push it down the page, as it used to be at the Top.” Seckel discusses SEO tactics like regularly adding new content to Epstein’s newly created philanthropic website, “[promoting] the other jeffrey epsteins,” getting non-mugshot photos toward the top of Google Images, and manipulating search queries so Google’s suggested search terms are not “toxic.”\n\nMany of these practices — regularly publishing new content, or getting mentions in authoritative publications — these days are acknowledged by Google itself as good SEO strategy. “I would say they were generally mostly best practices,” Rand Fishkin, a longtime SEO consultant and cofounder of the digital marketing firm Moz, tells The Verge. “There was a decent level of sophistication, although it seemed to me that there could be more done there, and it is very possible that there was more being done that wasn’t discussed in emails.”\n\nOne point in the documents that stuck out to Fishkin were claims of manipulating Epstein’s Wikipedia page. The weight Google has given to Wikipedia in search rankings has ebbed and flowed over the years, but Fishkin says there was a period beginning somewhere between 2008 and 2010 where Wikipedia became “absolutely dominant” for rankings.\n\n“This was a big success.”\n\nIn the December 2010 email, Seckel claimed an “important victory” on Wikipedia: “The head lines do not mention convicted sex offender or pedophile. Instead, Philanthrophic work, Epstein Foundation, Promotion of Scientists,” he wrote, possibly referring to Wikipedia section headers on Epstein’s page. “We hacked the site to replace the mug shot and caption, and now has an entirely different photo and caption. This was a big success.”\n\nIt’s not clear what Seckel meant by “hacked,” but Fishkin theorizes that Epstein’s associates may have had connections to Wikipedia editors, perhaps paying them to edit his page. In March 2020, Wikipedia’s editor-run blog published a post outlining some of the edit wars on Epstein’s page over the years that raised questions of paid editing; The New York Times in 2019 reported that a Wikipedia editor with a username tied to Epstein had gone on an editing spree beginning in 2013 and exaggerated details about his charity. The Wikipedia page proved to be significant: According to a Massachusetts Institute of Technology report on Epstein’s connections with MIT’s Media Lab, staff at the institution cited Wikipedia as they discussed whether they should accept Epstein’s money. The MIT report indicates that at the time, the Wikipedia entry included details about Epstein’s crimes but also “included statements that could be read as undercutting the strength of some of the allegations.”\n\n“These Epstein-related accounts were not enough to prevent the Wikipedia article on Epstein from alerting MIT to Epstein’s offenses, but they did soft-pedal the story enough that MIT managed to ignore the alert long enough to accept Epstein’s money,” a Wikipedia editor wrote in the blog post. “Wikipedia’s editors performed their work well in a difficult situation.” (The blog is operated by editors and members of the community — Wikipedia didn’t immediately respond to a request for comment.)\n\nBy March 2011, Epstein’s page had two sections: “Life” and “Solicitation of prostitution.”\n\nFishkin estimates that a job of this magnitude would cost $100,000, plus monthly maintenance fees\n\nThe Epstein documents — with the strange, indecipherable typing style and abrupt endings — are haunting when you know the depravity they represent. They are also at times deeply pedestrian: In an exchange after the “sweep” of Google, Epstein complains about what he’s being charged for SEO services. “I was never told never, that there was a 10k fee per month„ you inittaly said the project would take 20.. then another 10. then another 10” he wrote in one message. Fishkin estimates that a job of this magnitude would cost $100,000 initially, plus five-figure per-month maintenance fees.\n\n“The prices just looked insanely low to me,” Fishkin says. “Here’s a billionaire who supposedly is worried about his reputation as a fucking pedophile coming out in public, arguing over a few thousand dollars. Honestly, the chutzpah is insane.”\n\nOptimizing search results to fit a client’s narrative is a standard practice for PR agencies — SEOs are hired to maintain a client’s reputation even when they aren’t scandal-ridden. In a document dated June 14th, 2011, the PR firm Osborne & Partners LLP lays out a game plan: minimize mentions of Epstein in US and UK tabloids, establish him as “a pioneering supporter of science and technology,” “clean up” Google, and get him in front of select editors and writers.\n\n“We have hired an excellent team of Israeli experts for other clients, and there are many firms that claim to be able to optimize results this way but fail to deliver,” the document reads, regarding controlling Google content. “I cannot overstate the importance of this, because it is the initial source of information on you for many people.”\n\nLater that year, in December 2011, Epstein’s publicist Christina Galbraith emailed him a summary of tactics to push down bad press from the top of Google results, recommending that they hire Reputation, a company that advertises services to help businesses manage their online reputation. Among the steps Galbraith names: “Eliminating the bad information using prevalence and proprietary algorithms; redirecting the way in which Google sequences your information (reassociating it with the positive content).”\n\nFor Reputation’s services, Galbraith tells Epstein it will take approximately a year to be “solidified,” and cost $10,000 to $15,000 a month. Reputation didn’t immediately respond to a request for comment about whether the firm ended up working with Epstein.\n\nRelated Jeffrey Epstein infiltrated science because it was ready to accommodate him\n\nEpstein and associates also flooded Google with flattering articles, taking advantage of the often poorly vetted contributor networks that exist at various digital media outlets. The stories — removed after The New York Times inquired about them in 2019 — followed the playbook laid out in the newly released documents, touting Epstein’s business and science interests.\n\nEpstein’s efforts to sanitize his reputation online seem to have worked, at least for a time: In a 2019 story by The New York Times, the president of Bard College defended accepting more than $100,000 in donations from Epstein. “If you looked up Jeffrey Epstein online in 2012, you would see what we all saw,” Leon Botstein told the Times — an “ex-con who had done well on Wall Street,” was friends with the Clintons, and donated to academic work.\n\nThe Epstein files are a labyrinth of possible conspiracies, collusions, and networks of abuse and cover-up that happened for decades; it is hard not to get lost in the documents, to fall into rabbit holes and start following threads. But occasionally there will be a reminder that the worst of what happened is not in the files at all — an email chain will end suddenly and you, the reader, are forced to fill in the blanks of what the parties are talking about, or tiptoeing around.\n\nIn a December 16th, 2010, email, Seckel and Epstein were briefly arguing about pricing for the Google cleanup job — Seckel told Epstein that he was “trying to fix up [Epstein’s] mess,” just trying to be helpful. But at the end of the email, it takes a turn.\n\n“I must talk to you about the island thing asap,” Seckel writes. “When can we do that?”\n\nCorrection, November 17th, 2025: Clarified that the Wikipedia blog is run by volunteer editors and is not official comment from Wikipedia.",
  "authors": [
    "Mia Sato"
  ],
  "url": "https://www.theverge.com/report/822311/jeffrey-epstein-emails-google-search-seo-pr"
}