{
  "title": "Google’s Nano Banana AI image model goes Pro and is free to try",
  "text": "is a deputy editor and Verge co-founder with a passion for human-centric cities, e-bikes, and life as a digital nomad. He’s been a tech journalist for 20 years.\n\nPosts from this author will be added to your daily email digest and your homepage feed.\n\nGoogle just took the wraps off Nano Banana Pro (Gemini 3 Pro Image), its improved image generation and editing model built on Gemini 3 Pro that promises to “turn your visions into studio-quality designs with unprecedented control, flawless text rendering, and enhanced world knowledge.” That’s a step up from those hyperrealistic 3D figurines that caused the original image model to go viral in September, shortly after its launch.\n\nBest of all, it’s free to try globally starting today inside the Gemini app by selecting “Create image” with the “Thinking” model.\n\nYou can easily generate an image and change the lighting with Nano Banana Pro.\n\nGoogle says that Nano Banana Pro can help create context-rich infographics and diagrams that can help visualize real-time information like weather or sports. And its ability to render legible text directly on the image — as a short tagline or long paragraph — makes it suitable for generating posters or invitations in a variety of language translations. It also supports blending multiple elements into a single composition, using up to 14 images and up to five people.\n\nAnd because the model excels at editing, Nano Banana Pro also promises new advanced creative controls. As such, you can select and locally edit any part of an image, adjust camera angles, add bokeh, change focus, color grade, or change lighting from day to night. Resolutions up to 4K are supported across a variety of aspect ratios.\n\nNotably, images created or edited with the Nano Banana Pro model will have C2PA metadata embedded. That should — eventually — make it easier to spot generative AI or deepfakes in search results and social media feeds, once the industry gets its act together. TikTok said this week that it would also use C2PA metadata to invisibly watermark AI-generated content.\n\nUsers of the free Nano Banana Pro tier will be limited to a quota, that expands for Google AI Plus, Pro, and Ultra subscribers. It’s also available for AI Mode in Search in the US if you subscribe to Google AI Pro or Ultra, or globally to users of the NotebookLM research assistant.",
  "authors": [
    "Thomas Ricker"
  ],
  "url": "https://www.theverge.com/news/824785/google-nano-banana-pro-try-free-examples-prices"
}