{
  "title": "RELEASE: Fossil fuel lobbyists flood COP30 climate talks in Brazil, with largest ever attendance share",
  "text": "FOR IMMEDIATE RELEASE\n\nNovember 14, 2025\n\nContacts: reachout@kickbigpollutersout.org\n\nFossil fuel lobbyists flood COP30 climate talks in Brazil, with largest ever attendance share\n\nWith one in every 25 COP30 attendees a fossil fuel lobbyist, massive industry presence intensifies calls to protect climate negotiations from corporate capture.\n\nBELEM, BRAZIL 14th November 2025: New analysis reveals more than 1600 fossil fuel lobbyists have been granted access to the COP30 climate talks in Belém, marking yet another year of overwhelming industry presence at crucial climate negotiations, according to the Kick Big Polluters Out (KBPO) coalition.\n\nThe analysis reveals that fossil fuel lobbyists significantly outnumber almost every country delegation at COP30 – with only host country Brazil (3805), sending more people. Proportionally, this is a 12% increase from last year’s climate talks in Baku, Azerbaijan, and is the largest concentration of fossil fuel lobbyists at COP since KBPO started analysing conference attendees.\n\nWith one in every 25 participants in Belém representing the fossil fuel industry, the calls for an accountability framework to protect the talks from big polluters grow stronger.\n\nThe Kick Big Polluters Out coalition analyzed the provisional list of participants at COP30 line-by-line. The findings include:\n\nFossil fuel lobbyists outnumber official delegates from the Philippines by nearly 50 to 1 – even while the country is being hit by devastating typhoons as the UN climate talks are underway. Fossil fuel lobbyists sent more than 40 times the number of people than Jamaica, which is still reeling from Hurricane Melissa.\n\nFossil fuel lobbyists have received two thirds more passes to COP30 than all the delegates from the 10 most climate vulnerable nations combined (1061), highlighting how industry presence continues to overshadow that of those on the frontlines of the climate crisis.\n\nMajor trade associations remain a primary vehicle for fossil fuel influence, with the International Emissions Trading Association bringing 60 representatives, including delegates from oil and gas giants ExxonMobil, BP, and TotalEnergies.\n\nBehind-the-scenes access also remains a major channel for influence, with approximately 599 lobbyists gaining access through Party overflow badges that allow the individuals behind the scenes access to the inner workings of the negotiations.\n\nSeveral Global North countries included fossil fuel representatives within their official delegations – France brought 22 fossil fuel delegates, with five from TotalEnergies, including CEO Patrick Pouyanné; Japan’s delegation contained 33 fossil fuel lobbyists, among them Mitsubishi Heavy Industries and Osaka Gas; and Norway snuck 17 into the talks, including six senior executives from its national oil and gas giant Equinor.\n\nAlthough attendance at COP30 is smaller overall than COP29 in Azerbaijan and COP28 in Dubai, the proportion of fossil fuel lobbyists has increased to nearly 1 in every 25 delegates present in Belem.\n\nResponding to the findings, Kick Big Polluters Out member Jax Bongon from IBON International in the Philippines said: “It’s common sense that you cannot solve a problem by giving power to those who caused it. Yet three decades and 30 COPs later, more than 1,500 fossil fuel lobbyists are roaming the climate talks as if they belong here. It is infuriating to watch their influence deepen year after year, making a mockery of the process and of the communities suffering its consequences. Just days after devastating floods and supertyphoons in the Philippines, and amid worsening droughts, heatwaves, and displacement across the Global South, we see the very corporations driving this crisis being given a platform to foist the same false ‘solutions’ that sustain their profit motives and undermine any hope of truly addressing the climate emergency. COP30 promises to be an ‘Implementation COP,’ yet it has so far failed to implement even a basic and long-overdue demand of kicking Big Polluters out of a conference meant to address the crisis they created.”\n\nThe KBPO findings come as 2025 is set to become one of the hottest years on record, with climate disasters intensifying worldwide and atmospheric carbon dioxide concentrations reaching unprecedented levels. Many of the fossil fuel corporations sending significant numbers of lobbyists to COP30 are also directly enabling the ongoing genocide of Palestine and systemic violence around the world. Despite growing calls for a rapid and just transition away from fossil fuels, the industry continues to expand operations, with nearly $250 billion approved for new oil and gas projects since COP29.\n\nSome KBPO members drew parallels between fossil fuel industry presence at COP and fossil fueled violence around the world. “The fossil fuel industry and the Israel colonial regime are two sides of the same coin of destruction,\" said Ana Sánchez of Global Energy Embargo for Palestine (GEEP). “From oil majors that fuel warplanes to an apartheid regime that flattens cities and ecosystems, both are polluters of land, air, and life itself. Israel’s genocidal machine runs on the same crude that’s burning our planet. At COP30, we cannot talk about ending fossil fuels while welcoming states and corporations that weaponize them for genocide. There is no climate justice without Palestine liberation. Kick all Big Polluters Out, kick Israel out ”\n\nThe outsized fossil fuel industry presence in Belém threatens the stated goals of COP30, which Brazil has positioned as a critical moment for implementing the Paris Agreement and scaling up climate finance. This contradiction further strengthens the demand to ensure Polluter-free COPs and establish formal safeguards against polluter influence.\n\nThanks to sustained civil society campaigning, COP30 is the first COP where all non-government participants are expected to publicly disclose who is funding their participation and to confirm their individual objectives are in alignment with those of the UNFCCC. This information is made public for the world to see, but does not apply to those on government badges. This is a concerning oversight, given how this research shows that 164 fossil fuel lobbyists are gaining access through government badges.\n\n“At the 10th anniversary of the Paris Agreement we, the people, need to be consulted on how to close the ambition gap left by Parties to reach the Agreement’s central target of 1.5°C, said KBPO member Pat Bohland, LIFE, co-focal point of the Women and Gender Constituency. “Instead, feminists are once again outnumbered eight times by lobbyists, representing the fossil, exploitative system continuing petro-masculinities and patriarchy. Being invited to Belém in the state of Para means to us fighting industries that are exploiting territories, nature and the bodies of women and gender diverse folks and to lead us into a truly just and sustainable future.”\n\nThe number of fossil fuel representatives at UN climate talks has remained consistently high, with the industry present since the negotiations began. These findings reinforce the urgent need to protect the UN's climate negotiations by establishing clear conflict of interest policies and accountability measures, with countries collectively representing over 70% of the world's population having requested these conflicts of interest be addressed.\n\n“Since we are not in a real and just transition but rather in the expansion of a grim energy model that deepens the causes of the climate environment crisis, the tentacles of extractive corporations are spreading across discussion tables and decision-making spaces, contributing to an irreparable climate inaction,” said Liliana Buitrago, Pacto Ecosocial del Sur. “In a sprawling act that spans our territories, it reaches everyday life, prioritizing insatiable profit over the care needed to sustain the weaving of life.”\n\nAdditional quotes from KBPO members:\n\n“Fossil fuel companies continue to lead us into a climate abyss. Not only are they responsible for a historic climate debt with the Global South, but this debt continues to accumulate and grow steadily. Governments are their accomplices. For 30 years, climate change summits have been an ideal stage for oil companies to clean up their image, do business, and find new ways to get away with environmental crimes. Today, instead of transitioning to post-oil societies, they want to extract every last drop of fossil fuels to continue feeding the capitalist system and genocidal wars.”\n\nIvonne Yanez, Accion Ecologica, Ecuador\n\n“More than 1,500 fossil fuel lobbyists have flooded COP30 this year, the same way their greed causes floods in our lands and our homes every year. Every fossil fuel lobbyist's entry into UNFCCC is a betrayal of the process, as they are the polluters who caused this crisis and yet are given front row seats to decide our very future. We know that year after year they come to climate talks to protect their profits, to push for fossil fuels, carbon markets, and other false solutions that keep extractivism destroying our communities alive. The COP should be a space for peoples solutions and not a playground for polluters.”\n\nRachitaa Gupta, Global Coordinator, Global Campaign to Demand Climate Justice\n\n\"COP30 has become a marketplace for corporate greenwashing, not a platform for climate justice. Global climate talks are merely continuing the legacy of climate colonialism, by allowing corporations, investors and Global North nations to profit from destruction while silencing those most affected. Behind the pledges are still false climate solutions like carbon markets, blue economy schemes and nature-based offsets that worsen inequality and perpetuate the same cycle of power and profit. Meanwhile, women, indigenous peoples and local communities in the Global South are at the receiving end of a crisis they did not create. A just and equitable transition must begin with accountability for historical and ongoing emissions, as affirmed by the principle of Common but Differentiated Responsibilities and Respective Capacities, and by centreing community-led, gender-just systems such as agroecology. There is no other way but to reclaim the right of peoples and communities to achieve real climate justice.\"\n\nRanjana Giri, Asia Pacific Forum on Women, Law and Development (APWLD)\n\n“Las corporaciones multinacionales y algunos gobiernos de turno avanzan sobre los territorios indígenas y campesinos imponiendo actividades extractivas que generan graves impactos sociales, ambientales y culturales. Mientras los líderes y defensores de los pueblos son perseguidos y criminalizados por proteger la vida y la naturaleza en nuestra Amazonía, en los espacios internacionales se mantienen discursos vacíos sin soluciones reales frente al cambio climático. Estas negociaciones no dan resultado porque allí están los destructores, las empresas. Pues las políticas actuales, justificadas en una supuesta utilidad económica, solo aumentan la pobreza, las enfermedades y la pérdida de vidas. Los pueblos y nacionalidades indígenas mantenemos una sola voz en defensa del territorio y de la naturaleza en desventaja frente a cientos de gobiernos de estado que priorizan los intereses corporativos sobre los derechos colectivos.”\n\nWilmer Lucitante, Unión de Afectados por Texaco, UDAPT\n\n“The NDCs at this COP30 were supposed to be the ones to align with the 1.5⁰ C climate limit that science and climate justice demand. But no, this is the conference of the perpetrators representing more than 1500 fossil fuel lobbyists given access to COP30. This UN climate conference promotes a new initiative called the global ethical stocktake focusing on moral, ethical and cultural elements of addressing the climate crisis, including addressing the impact on the poor, vulnerable and disadvantaged, women, children and Indigenous Peoples. It is unethical to give access to these Big Polluters that continue a road of ecocide, terracide and genocide against Mother Earth, Father Sky, nature and humanity. It is immoral to call this the Indigenous Peoples COP when local Indigenous Peoples are forced to lift their voices to gain entry when the fossil fuel lobbyists can freely waltz in with no struggle.”\n\nTom BK Goldtooth, Indigenous Environmental Network\n\n“While the government talks about energy transition, it approves oil exploration at the mouth of the Amazon River and privatizes the Tapajós River for agribusiness. Climate decisions continue to be made without listening to us, the Indigenous peoples — the true guardians of the forest. There is no climate justice without listening to and respecting our territories. The future is not built with oil and soy, but with the peoples who keep the Amazon alive.”\n\nVandria Borari, As karuana\n\n“COP after COP, the numbers speak for themselves; these are the conferences for the destroyers of our present and future to make business and continue setting the world, people, and life on fire. No matter where a COP takes place, whether in a petrostate or an Amazonian country, fossil fuel lobbyists have had a wide-open door to undermine climate action and justice. Corporate capture has not occurred in a vacuum over 30 years of conferences; the UNFCCC, States, and COP Presidents are all accomplices. If they want to be on the right side of history, they must Kick Big Polluters Out of COP30 now. This is a legal obligation to the people and the planet, and if they fail to do so, they will face legal consequences for their wrongful acts.”\n\nNathalie Rengifo Alvarez, Campaña Que Paguen Los Contaminadores América Latina\n\n“From the halls of the UNFCCC to our lands and territories, fossil fuel corporations are wrecking our communities and environment. Yet, this year at COP30, the red carpet is rolled out for thousands of fossil fuel lobbyists to roam the corridors. The impacts of this abhorrent corporate capture are felt the world over, with fossil fuel exploitation, extractivist mining, and false solutions putting peoples on the front lines of devastation. If we are to achieve climate justice we must Kick Big Polluters Out.”\n\nNerisha Baldevu, Friends of the Earth Africa\n\n“The world’s biggest polluters have been allowed to hijack climate negotiations for far too long, delaying action and denying justice to those of us in countries regularly hit by disasters. The staggering number of fossil fuel lobbyists who’ve attended COP in the last few years, in addition to this year’s “AgriZone” sponsored by the pesticide firm Bayer, is proof that the climate convention has prioritized the interests of polluters over people. If COP is to deliver real progress for our planet, these corporations must be banned from influencing the only the world's only decision-making forum on climate change.\"\n\nLidy Nacpil, Asian Peoples' Movement on Debt and Development.\n\n“Physicians have a long history of safeguarding health policy from commercial influence. As doctors, we kicked Big Tobacco out of health negotiations. Now to break the thirty year climate deadlock we need to kick big polluters out of climate COPs. WE are here to protect planetary health, fossil fuel lobbyists are here to line their pockets by undermining climate policy. The numbers released today show the problem is getting worse, not better. The health community is here to stop industry interference in climate action.”\n\nDr. Samantha Green, CAPE\n\n“The UNFCCC is in need of rehabilitation.This year’s check-up on who is in the room at the climate negotiation tested positive for corporate capture, reflecting the addiction and normalisation of fossil fuel presence in multilateral climate action despite their complicity in ecocide globally. To achieve a just transition, we must create the conditions by which fossil fuels can no longer have the social license to continue business as usual, making billions in profit, dwarfing the climate finance countries are scrambling to agree on. While local indigenous peoples struggled to enter the conference, fossil fuel lobbyists walk in freely. My generation deserves Just Transition policies that reflect what people and planet need, not what polluters' profits demand.”\n\nPim Sullivan-Tailyour, UK Youth Climate Coalition\n\n“A climate conference with more fossil fuel lobbyists than delegates from climate vulnerable nations – corporate capture at its best. It seems like a no-brainer that the people most affected by climate change must be at the core of climate negotiations, not the lobbyists of the industry that is most responsible for climate change. However, COP30 exemplifies the opposite. Allowing fossil fuel lobbyists to influence climate policies leads to false solutions and to continued pollution only, and the past 30 years have shown this. People need to be at the centre of the climate talks, not the corporations of the extractive industries.”\n\nSara Fleischer, SOMO\n\n“Another COP, same playbook: fossil fuel lobbyists are welcomed with a red carpet while communities suffering from the crisis are only heard after demanding their rights and challenging barriers to their participation. This is corporate capture, not climate governance. A process meant to protect people and planet cannot be shaped by the very industry driving the damage. We need to urgently reform the rules of climate negotiations: allow voting when consensus is weaponized, adopt enforceable conflict-of-interest rules, create real compliance and enforcement so promises have consequences, and protect civic space and human rights so people and science — not polluters— can accelerate the phaseout of fossil fuels and deliver real finance at scale. Reform isn’t procedural housekeeping—it’s climate action.” Lien Vandamme, Center for International Environmental Law (CIEL)\n\n“More than 1,500 fossil fuel lobbyists are flooding COP30 this year, turning a climate summit into a trade fair for polluters. It shows that the very same industries driving the climate crisis still hold power over the negotiations meant to solve it. As long as Big Polluters are allowed inside these talks ensuring they’re run in their interests, real solutions will remain out of reach. This shocking number only goes to show we need fossil free politics now more than ever. We need climate action led by the people, not polluters.”\n\nNathan Stewart, Fossil Free Politics\n\n“10 years after the Paris Agreement, the presence of fossil fuel lobbyists in UN negotiation spaces where they don’t belong is still growing. More than ever, they are promoting “solutions” that are good for their business but not for the people and climate. CCS, hydrogen, biogas should be labelled as greenwashing for the expansion of oil and gas extraction still happening, and fossil fuel corporations should pay for the global impact of their business.”\n\nElena Gerebizza, ReCommon\n\n“COP30 appears to be a Conference of Polluters, not Parties. With more fossil fuel lobbyists than government delegates from the ten most climate vulnerable nations combined, it’s no wonder the global climate talks have failed for three decades to do what they should have done on day one. Unlike what the COP presidency has said, COP30 is not the defining business opportunity of our time. It’s the moment when world governments must finally end fossil fuels, and chart a path forward that will save millions of lives and ensure a livable planet. Until we Kick Big Polluters Out, we can expect the outcomes of COP30, and every COP after, to be written by the world’s largest polluters, all in the name of profit over people and the planet.”\n\nPascoe Sabido, Corporate Europe Observatory\n\n\"We are 10 years on from the Paris Agreement, and two since nations agreed to end the fossil fuel era. Yet carbon pollution is still rising, putting a liveable and equitable future ever further out of reach. The reason is simple: fossil fuels. Every COP we allow dirty industry representatives to attend in their droves incurs a debt that will be paid in future climate disasters. They are a tiny minority of Earth's people; we are the vast majority. We need polluters out, people in at COP.\"\n\nPatrick Galey, Global Witness\n\n“COP30 is meant to be the ‘COP of truth’, but more than 1,500 lobbyists are continuing to flow the venue and insert themselves in national delegations, including Brazilian Big Polluters in the host country delegation. And more than half of all delegation members are withholding or obscuring their affiliations. If COP30 is indeed the COP of truth, the Presidency and the UNFCCC Secretariat should now commit to reviewing and strengthening participant disclosure rules ahead of future summits: it is time to ensure integrity and accountability to restore trust.”\n\nBrice Böhmer, Transparency International\n\n\"The COP is massively flooded with more than 1,500 representatives of the fossil fuel industry – like a river bursting its banks and sweeping everything away. As long as we cling to coal, oil, and gas, the 1.5-degree path will become increasingly distant, and the climate crisis will worsen year after year with tangible consequences for people and nature. It is particularly worrying that Germany is further cementing its dependence on fossil fuels with new, dirty LNG imports from the US – to the detriment of communities, the climate, and livelihoods on both sides of the Atlantic.\"\n\nSusann Scherbarth, Friends of the Earth Germany (BUND e.V.)\n\n“No Big Oil executive can claim their objectives align with the United Nations Framework Convention on Climate Change. These companies continue to drill, pollute, and profit from the destruction of our planet and communities. There is no justification for allowing 1,500 fossil fuel lobbyists into UN climate negotiations. You wouldn’t invite tobacco lobbyists to a conference on lung cancer, so after 30 years, why are there still more fossil fuel lobbyists at COP30 than representatives of the countries that are most vulnerable to the climate crisis? Journalists should be asking them a simple question: what are you doing here?”\n\nDavid Tong, Oil Change International\n\n“When more than 1,500 fossil fuel lobbyists storm COP30, it’s no longer about climate negotiations, but a hostile takeover of our future. While thousands of families displaced by climate disasters are denied a seat at the table, the industry lobby continues to strengthen its influence. For 30 COPs, we allowed them in, but enough is enough. The Fossil Fuel Treaty was created precisely to combat this, to close the doors to those who profit from delay and to give a voice to those on the front lines. We are not here to negotiate with arsonists; we are building a fireproof future without them, to prove that we don’t need the polluters’ permission to act.”\n\nKumi Naidoo, Fossil Fuel Treaty Initiative\n\n###\n\nKick Big Polluters Out is a coalition of more than 450 organisations across the globe united in demanding an end to the ability of Big Polluters to write the rules of climate action. Find more on the coalition and its demands here.\n\nWith thanks to the following KBPO researchers:\n\nAdrien Tofighi-Niaki (Corporate Accountability), Catriona Rainsford (Global Witness), Daniela Finamore (ReCommon), Elena Gerebizza (ReCommon), Eva Richter (Global Witness), Jonathan Noronha-Gant (Global Witness), Kim Claes (Friends of the Earth Europe), Marco Mantovani (Global Witness), Margarida Silva (SOMO), Myriam Douo (Oil Change International), Nathan Stewart (Fossil Free Politics), Nicu Calcea (Global Witness), Nina Ostrowski (Friends of the Earth Europe), Pascoe Sabido (Corporate Europe Observatory), Patrick Galey (Global Witness), Rachel Rose Jackson (Corporate Accountability), Rachel Tansey (Corporate Europe Observatory), Sara Fleischer (SOMO)\n\nNotes to the editor\n\nThe top 10 most climate vulnerable nations with delegations at COP30 are: Chad, Niger, Solomon Islands, Micronesia, Guinea-Bissau, Sudan, Somalia, Tonga, Sierra Leone, Somalia and Eritrea.\n\nThe top ten biggest trade associations in attendance representing the fossil fuel industry are: International Chamber of Commerce (148); Brazilian Business Council for Sustainable Development (91); International Emissions Trading Association (60); Abeeólica (60); Brazilian National Confederation of Industry (41); Chamber of Commerce of the United States of America (20); World Business Council for Sustainable Development (19); Korea Chamber of Commerce and Industry (15); Federation of Indian Chambers of Commerce and Industry (15); Federation of Industries of the State of Sao Paulo (14)\n\nMethodology\n\n**An anonymised list of the fossil fuel lobbyists at COP30 is available here\n\n**More details on our method and FAQs can be found\n\n**Please note: Delegates are classified as a fossil fuel lobbyist based on two factors: 1) The official delegation they are badged and formally on the delegation of; and 2) Their publicly declared affiliated organization according to UNFCCC data. If either of these are a fossil fuel lobbyist organization per the established methodology and defined criteria, they are included on this list, as they are therefore officially representing in some capacity, whether intended or not.** ****More details on our method and FAQs can be found here ****Please note: Delegates are classified as a fossil fuel lobbyist based on two factors: 1) The official delegation they are badged and formally on the delegation of; and 2) Their publicly declared affiliated organization according to UNFCCC data. If either of these are a fossil fuel lobbyist organization per the established methodology and defined criteria, they are included on this list, as they are therefore officially representing in some capacity, whether intended or not.**\n\nThanks to years of campaigning by Kick Big Polluters Out (KBPO) partners and constituencies, all participants registered to attend the COP30 climate talks in Brazil must declare the organisation they work for, the nature of their relationship to this organisation, their role, and the delegation they're part of. The latter can be an official country delegation (or party overflow), a UN body, an intergovernmental organisation, a non-government organisation, or a media institution.\n\nThe UNFCCC published a provisional list of the participants at COP30 on 10 November 2025.To analyse the UNFCCC’s delegates list as quickly as possible, our team used a combination of manual classification and scripted automation. Our team classified each entry line by line, and we also used a script to check whether a lobbyist had been identified as a fossil fuel lobbyist in previous years. A team of fact-checkers then verifies the results to ensure they are accurate.\n\nIn determining whether a delegate has any ties that would qualify them as a fossil fuel lobbyist, we only considered the information provided in the UNFCCC’s list. This includes both the delegation through which the individual is attending COP, and any further affiliation the delegate opted to disclose. If someone did not choose to explicitly state an affiliation to a fossil fuel company or fossil fuel-affiliated organisation in their application to be a delegate at this year’s COP, we were unable to classify them as a fossil fuel lobbyist.\n\nFor the purposes of this analysis, we consider a fossil fuel lobbyist any individual delegate that represents an organization or is a member of a delegation that can be reasonably assumed to have the objective of influencing the formulation or implementation of policy or legislation in the interests of the fossil fuel industry, or a particular fossil fuel company and its shareholders.\n\nA full list of the 1602 fossil fuel lobbyists is available on request.",
  "authors": [],
  "url": "https://kickbigpollutersout.org/Release-Kick-Out-The-Suits-COP30"
}