{
  "title": "China warns there is ‘no market’ for Japanese seafood exports as spat over Taiwan comments escalates",
  "text": "China has warned there is “no market” for Japanese seafood exports, the latest veiled threat from Beijing as its diplomatic spat with Tokyo escalates over recent comments by Japan’s leader on defending Taiwan.\n\nThe two neighbors have been engaged in a rapidly spiraling dispute after Japanese leader Sanae Takaichi, in response to a question in parliament, said that a Chinese attack on Taiwan would count as “a situation threatening Japan’s survival,” and thus could trigger a military response from Tokyo.\n\nBeijing views the self-governing democracy of Taiwan as its territory and has vowed to take control of the island, by force if necessary. For Beijing, Taiwan’s sovereignty is the most sensitive issue in its relations with other nations – a “red line” not to be crossed.\n\nFor more than a week, China and its state media has issued near daily denunciations of Takaichi as well as threats to economically punish Tokyo unless the comments are retracted.\n\nSeafood emerged as the latest pressure point at a regular press briefing on Wednesday from China’s foreign ministry.\n\n“Due to the erroneous remarks made by Japanese Prime Minister Sanae Takaichi on important Taiwan issues, there has been strong public outrage in China,” spokesperson Mao Ning told reporters. “Under the current circumstances, even if Japanese seafood were exported to China, there would be no market for it.”\n\nMao was responding to reports earlier that day in Japanese media that China had already informed Tokyo that it planned to ban seafood exports from Japan. Both NHK and Kyodo ran the reports, citing sources.\n\nHowever Japanese Chief Cabinet Secretary Minoru Kihara told reporters Tokyo has yet to receive any confirmation from the Chinese government on the matter.\n\nMao’s response did not confirm a ban was in place, but it has raised the prospect that one might be on its way as well as further punitive measures.\n\n“Japan should first retract its erroneous remarks and take concrete actions to safeguard the political foundation of China-Japan relations; otherwise, China will have no choice but to take further measures,” Mao said.\n\nFukhshima era ban\n\nChina had only partly resumed imports of seafood from Japan earlier this year after banning them in August 2023 in response to Tokyo’s decision to begin releasing treated radioactive wastewater from the Fukushima nuclear plant.\n\nJapan’s devastating 2011 earthquake and tsunami caused water within the plant to be contaminated with highly radioactive material. Tokyo had argued that it had treated the water properly, but Beijing had long led regional opposition to the water being returned to the ocean.\n\nIn contrast to China threats, Taiwan’s leader Lai Ching-te turned to social media to show his support for Japanese seafood this week, posting a picture on X on Thursday of his sushi lunch.\n\nThe threat of a new seafood ban comes after Beijing last week advised its citizens against travelling to Japan.\n\nAlthough the move is non-binding, it is hugely symbolic – nearly 7.5 million travelers from China visited Japan between January and September this year, by far the highest count of any country or region, according to official data cited by Japanese public broadcaster NHK.\n\nChinese airlines including Air China, China Eastern and China Southern later published notices on their websites offering customers refunds or free changes on certain tickets to Japan, Chinese state broadcaster CCTV reported.\n\nJapanese companies are starting to report cancellations.\n\nTokyo-based tour operator East Japan International Travel Service said it had lost 70% of its bookings for the remainder of the year, because of the ongoing row between Japan and China.\n\nYu Jinxin, the company’s vice president, told CNN it was “a huge loss for us”, adding Chinese tour groups are a key part of their business.\n\n“We can withstand a short-term impact of one to two months, but if the situation becomes prolonged, the financial strain on our operations will be significant,” Yu added.\n\nPrevious Japanese leaders have avoided discussing Taiwan in the context of a military response to avoid ruffling feathers in China – Japan’s biggest trade partner.\n\nTakaichi, a hawk who has pushed to strengthen Japan’s defense capacity, visited Taiwan earlier this year – before she became Prime Minister – and called for cooperation on “defense challenges,” which Beijing condemned at the time.\n\nShe has previously criticized Beijing’s increasing military presence in East Asia, and during the APEC summit, she met with Taiwan’s representative, again angering China.\n\nShe met Chinese leader Xi Jinping at the same summit, at which she said she had asked China to resume imports of Japanese beef and seafood imports.\n\nCNN’s Mai Takiguchi and Kloe Zheng contributed to this report.",
  "authors": [
    "Jerome Taylor",
    "Ross Adkin"
  ],
  "url": "https://www.cnn.com/2025/11/19/china/japan-china-taiwan-dispute-intl-hnk"
}