{
  "title": "Queer Country Artists Are Showing What It Means To Be American In The Face Of MAGA",
  "text": "From my perch in Queerlandia, country music looks like the domain of problematic white men who drink beer and like to hunt. Even when it’s not actively racist, misogynistic, homophobic or nationalist, it still somehow has a whiff of MAGA about it. Last year’s Country Music Association Awards did little to shift the genre’s image. Not only did they snub Queen Bey, but even Shaboozey’s nomination was called out for its performativity.\n\nBut change is inevitable; there’s a rebellious counternarrative emerging in popular country music, and queer Americana artists are leading the charge.\n\n“Americana has been a refuge for both folk and country musicians who sit outside of the perceived sounds, genres, cultures, genders, and races of what we perceive country and folk music to be,” says Joy Oladokun, a musician in Nashville, Tennessee. For those who aren’t familiar, “Americana” is an umbrella term for music that includes country, folk, soul, blues, gospel and rock.\n\nAdvertisement\n\n“I think we’re the troublemakers,” Oladokun laughs. More seriously, she adds, these artists are “the people who want their music to have some sort of historical significance.” It’s not that Americana artists are striving for an exalted level of fame, Oladokun says. But they’re shaking up the country scene with their choices about whom they work with, what they talk about, and what they stick up for.\n\nIn the case of queer Americana musicians, they’re disrupting everything by simply being unapologetically themselves. “Americana music is diverse and more reflective of America, which looks much different than just a straight, white guy in a truck drinking beer with a hot girlfriend,” says Crys Matthews, a musician in Nashville.\n\nAs you might imagine, if even Bey is getting treated as an outsider by the CMAs, lesser-known queer Americana artists have to fight hard for recognition within both country music culture and a larger political landscape that’s only growing more repressive and terrifying.\n\nAdvertisement\n\n“We don’t always get the benefit of decades-long relationships. We can often be last on the list of people to consider for show lineups,” says Lilli Lewis, a musician in Bush, Louisiana.\n\n\"We can often be last on the list of people to consider for show lineups,” says Lilli Lewis, a musician in Bush, Louisiana. Photo: Liz Hogan\n\nLewis says some of the more progressive labels ― such as Ani DiFranco’s Righteous Babe Records, on which she has recorded ― are actively nurturing queer Americana artists. “The focus is on the quality of the work and the quality of the artist and our queerness is just not used against us,” she says. “Country music already rejected everything that did not align with what is basically an avatar for Christian nationalism and its mores.” Queer Americana music, then, embraces all that has been rejected by mainstream pop country.\n\nAdvertisement\n\nWhat I’ve also noticed is that the music of many queer Americana artists is not overtly queer in some bombastic way. It’s just music about the lives of the people who make it. “Queer Americana should be representative of the lives of queer Americans, and that’s where I fit in swimmingly,” explains Oladokun.\n\nOladokun is the queer child of Nigerian immigrants, which is, after all, a uniquely American experience. In other words, portraying the experience of being an American shouldn’t be that threatening, and sometimes it even sounds like what we think of when we think of country music. “Sometimes I like to talk about my hot girlfriend, too,” Matthews says.\n\n\"We're not going back in anyone's closet.\" Crys Matthews, musician\n\nAdvertisement\n\nAt the heart of things, all these artists are trying to make music that resonates. Kelcy Wilburn, an artist in New Orleans who records as Ever More Nest, recently released a song about being alone on Christmas. “It turns out a lot of people — a whole lot of people — want to hear a sad, lonely song about Christmas because that’s their experience,” she says. Being alone on Christmas isn’t a uniquely queer experience, of course, but it hits home for many of us who are or feel estranged from unsupportive family members.\n\nQueer artists have always helped push the boundaries of what it’s OK to say. Sometimes, that means being a woman who sings about her wife. Sometimes it means simply being honest about how complicated it is to try to maintain your humanity in this country.\n\nAll the artists I talked to agreed that representation is going to be more important during Donald Trump’s second term as president. They are already feeling the shockwaves of emotion from their fans. “So many people have been coming up to me in tears, asking for hugs and thanking us for the work that we’re doing and for the music that we’re singing because they’re feeling so hopeless after the outcome of the election,” Matthews tells me.\n\nAdvertisement\n\nShe says that’s why she organized her most recent tour to take place in the South. “We’re going to keep writing those songs and singing those songs and telling those hard truths and telling those stories and going into the places who need to hear them the most,” Matthews says. “We will keep going into these places to fill people’s wells back up and make sure they know they matter. We’re not going back into anybody’s closet.”\n\nAnd politics is shaping their work in turn. “I’ve written one song since the election,” says Wilburn. “I co-wrote it with my bassist. We’re singing about sugarcane, literally and as a metaphor. The song idea came from driving through cane smoke. They burn the fields after they harvest the sugar. It’s about how you’re constantly told there’s this sweetness to come. And yet, maybe you never get to see that or feel that sweetness.”\n\nThis dark moment in history, Wilburn says, isn’t really delivering on the idea of the American dream that any of us were promised.\n\nAdvertisement\n\nWhile the work of each of these artists is unique, they all acknowledge the challenges they’ll continue to face as they forge a path forward — both in their careers and in their music. And they take seriously their responsibility as artists in a pivotal moment in history.\n\n“Entertainers have a responsibility to not play games with the things that they say, the things that they allow, the things the people that they rub shoulders with,” says Oladokun. “We have to paint a clear picture of what it means to be like a truly tolerant and accepting world, because that’s not going to be modeled for us by our leadership.”",
  "authors": [
    "Contributing Writer"
  ],
  "url": "https://www.huffpost.com/entry/queer-americana-music-during-trump-era_n_679a3dd6e4b0a8ba185b95e8"
}