{
  "title": "The Handmaid's Tale Cast Answer The 50 Most Googled Questions About The Show",
  "text": "Transcript\n\nOkay, ready?\n\nYou want to practice it?\n\nNo, I think I've got it.\n\n[cast laughing] I'm going to follow you up.\n\nWe're going to rehearse.\n\nDo you want to practice?\n\nWe're the cast of The Handmaid's Tale\n\nand we are going to answer the most Googled questions.\n\n[digitized music]\n\nWhere does The Handmaid's Tale take place?\n\nThey're going to want real answers.\n\nBoston.\n\nBoston. Yeah.\n\nI mean, sometimes we go outside of Boston,\n\nbut it's basically Boston.\n\nCambridge. Cambridge, yeah, exactly.\n\nWhat does blessed be the fruit mean?\n\nWait, doesn't it mean your-\n\nYour ovaries.\n\nIt's supposed to be the fruits of your womb.\n\nThe fruit of your womb. The fruit of your womb.\n\nThe babies that come.\n\nYeah, may it be fruitful.\n\nWhy can't the wives of Gilead get pregnant?\n\nWell, some of us can.\n\n[Elisabeth laughing]\n\nTo be fair.\n\nOkay, the serious answer\n\nis there is a fertility crisis in...\n\nIn their dystopian future.\n\n[all talking at once]\n\nYou know, as the spokeswoman for this kind of thing-\n\nYeah, why are you talking?\n\nI will say that there was an environmental crisis\n\nin our dystopian future that where we are setting Gilead.\n\nAnd look at me on my podium.\n\nOkay, Yvonne, the show's over.\n\nWe only picked the most fertile ones.\n\nI got into character too much. Do you want to do that one?\n\nCan a Handmaid become a wife?\n\nAbsolutely not.\n\nNice. Nice, nice. It hit the box.\n\nOh, I like this one.\n\nWhy did June spit out the cookie?\n\nWhat season was this?\n\nOh, Season One I think.\n\nOh, the macaroon?\n\nYeah, it was too sweet.\n\nYou did it out of spite.\n\nOut of spite because someone,\n\neither Naomi or you gave it to me and...\n\nAnd you were like, Nah, I don't like you.\n\n= And I was like, Nah.\n\n[Yvonne laughing]\n\nSo the answer is because of spite.\n\nOkay. Why did Aunt Lydia take Janine's eye?\n\nThis is probably a better question answered by you, but I...\n\nYou do what you like, dear, I'll correct you.\n\n[everyone laughing]\n\nAunt Lydia took Janine's eye\n\nbecause she was just like teaching her a lesson, right?\n\nBut also she spoke out of turn and she was-\n\nYes, but she also said, fuck off twice.\n\nAnd I told her to stop it.\n\nIt was the second one that did it.\n\nAnd I said, Don't do it again, and she did.\n\n[Madeline] Oh, no. She was warned.\n\n[everyone laughing]\n\nOh, no.\n\nShe was warned.\n\nShe was warned. That's fair.\n\nSo, the punishment fits the crime.\n\nYep.\n\nOkay. Why did Rita tell Fred that Serena was pregnant?\n\nYou wanted to create chaos for me, remember? Wasn't that-\n\nYes, that's why The whole thing?\n\nThat's right. I think so.\n\nWhy would you not want Fred to know?\n\nBecause I was in detention and I didn't want him to know\n\nbecause I was done with him by that point.\n\nRight? And I was like, No.\n\nBut he still was going to find out at some point, no?\n\nBut also at the time, I also thought,\n\nbecause you know how important babies are to Rita,\n\nI also thought perhaps it is something\n\nthat he should be involved in\n\nbecause he is still the father.\n\n[Elisabeth] Right.\n\nIt was a fucked up thing to...\n\nUh oh. She's fucked up! That's my answer.\n\nThat's it. Perfect. Good answer.\n\nWe're messy. Okay.\n\nWhy did they cut off Serena's finger\n\nin The Handmaid's Tale?\n\nGuys, I have the finger in my handbag today.\n\nI took my set bag here and it's a lot...\n\nAnd I haven't used it since the last day on set.\n\nAnd that was the last...\n\nSo you took it? They gave me the finger.\n\nOkay, so why did they cut off Serena's finger?\n\nDo you remember?\n\nBecause I read from a book\n\nin front of the whole panel of men that run Gilead.\n\nAnd to prove a point to try\n\nand advocate for women's rights, actually.\n\nDefensive again.\n\nHere's Serena on her podium.\n\nDoes Aunt Lydia turn on Gilead?\n\nI can't answer that. Sorry.\n\nThank you very much.\n\nThrow it. That's a spoiler.\n\nHow did Moira escape?\n\nMurder.\n\nMurder and driving.\n\nTook care of it.\n\nTook care of it.\n\nNow, when is The Handmaid's Tale set?\n\nIn a dystopian future, right?\n\nSo it's kind of now, but in the future.\n\nThe present.\n\nI thought it was a parallel present.\n\nYeah. Basically.\n\nWhy did June cut her ear on The Handmaid's Tale?\n\nBecause I think she was trying to get her tag off, right?\n\nBecause she didn't want to get recognized. She was escaping.\n\nShe did cut again.\n\nYou cut your ear?\n\nYeah, remember I cut off the part that has the tag.\n\nYou are so hardcore.\n\nI know.\n\nRemember all the blood, it like all...\n\nI am super cool.\n\nWhat did June write on the wall on The Handmaid's Tale?\n\nDon't let the bastard...\n\nOh, sorry. It's better in Latin.\n\nNolite te bastardes carborundorum.\n\nDon't let the bastards grind you down.\n\nYou have that nailed. I love it.\n\n[Ann] I know. She really does.\n\n[Madeline] She does.\n\n[Elisabeth] Thanks, guys!\n\nDoes Rita survive The Handmaid's Tale?\n\nOh, I mean, come on...\n\nNo.\n\nLike suspense though.\n\nI'm just joking. Yes.\n\nMetaphorically No. Yeah.\n\nWhat happened to Janine and Esther in Handmaid's Tale?\n\nMeaning like that scene where you...\n\nYeah. Which you directed.\n\nYeah. So that's a you question.\n\nThey eat the chocolate and Esther got poisoned.\n\nRight? That's what they're talking about.\n\nWell, you also got poisoned.\n\nHuh? Yeah. Sorry, you got poisoned too. I apologize.\n\nYeah, you did get poisoned as well.\n\nWhat does under his eye mean in The Handmaid's Tale?\n\nIt means you're under his protection.\n\nHe will keep his eye upon you.\n\nWell, who's he, though?\n\nOh, God. Toss. There it is.\n\nOh, Arthur. Two times.\n\nTwo times.\n\nI'm sorry, dear.\n\nWhat does, May the Lord open mean?\n\nMay the Lord open your fruitful womb body entrance.\n\nEntrance.\n\nThat was like a haiku. That was nice.\n\nThat was really beautiful. I like that.\n\nMayhem.\n\nHow did they determine who was sent to Jezebel's?\n\nI think it's just punishment thing.\n\nI remember having a speech about...\n\nI had a choice, I could go to Jezebel's or the colonies.\n\n[Cast] Yeah. Oh yeah.\n\nThat is a little confusing being a fertile person.\n\nYeah. I think because also it just...\n\nI mean, they break the rules all the time, right?\n\n[Samira] Yeah, yeah.\n\nIt's like, it also was just a punchline.\n\nIt's kind of like, What did they eat today?\n\nExactly.\n\nBecause I was sent to the colonies straight off.\n\nPreviously, I think I was sent to the Jezebels.\n\nI was just being a little too rambunctious.\n\nMouthy? Mouthy.\n\nAgain, once again with the mouth.\n\nI guess.\n\nOne eye wasn't enough.\n\n[everyone laughing]\n\nIs Nick a part of Mayday?\n\nOh, not a Nick question.\n\nOh, actually...\n\nWait, do I know the answer to this?\n\nNo, actually, though.\n\nComplicated, dark, and stormy.\n\nThat's right.\n\nHaikus just left and right. Boom, boom, boom!\n\nOh guys, does June love Nick or Luke?\n\nTell us, doll.\n\nCan we order cocktails and talk about it?\n\nI love girl talk.\n\nI know.\n\nIt's a lovely question.\n\nI've sworn to never answer it,\n\nbut I do think that if it's possible\n\nshe loves them both in very different ways.\n\nAnd I think that her and Luke have something\n\nthat is so special,\n\nand her and Nick have something that is so special.\n\nAnd that's why it's a love triangle.\n\nBut which one is special and sexy?\n\n[Elisabeth laughing]\n\nOh, come on! That's like an impossible choice.\n\nI can't choose. Right?\n\nYeah. I mean, maybe you can't.\n\nWhy do Handmaids wear red?\n\nBlood\n\nI mean, that's what comes to mind.\n\nMargaret Atwood-\n\nFertile.\n\nThe fertility, yeah.\n\nYeah, that makes sense.\n\nBecause they still...\n\nMenstruation. Yeah?\n\nAnd also it's a color that represents\n\nThe Scarlet Letter.\n\nOh, true.\n\nOh!\n\nWe represent-\n\nShame. Shame and...\n\nYou know what I mean? It's like being...\n\nOh, that's a lot.\n\nYeah. So that's actually why they put us\n\nin red, I believe.\n\nPut that one down.\n\nDoes Luke have a job?\n\n[everyone laughing]\n\nOh my God.\n\nI think dutifully waiting for me to return is a job.\n\nJune is a handful. That's enough of a job.\n\nIsn't he a contractor? Isn't he in construction?\n\nWhat?\n\nRight? I'm not making it up.\n\nHe's in construction. Thank you.\n\nWow! He was really in-\n\nJust immediately like, immediately like, What?\n\nCan you picture O-T as a construction worker?\n\nNo, I can't.\n\nDoes Hannah get out of Gilead?\n\n[Amanda] Million dollar question.\n\nThe thing is, is if you keep Googling,\n\nyou will find out the answer to this\n\nas it's on the internet.\n\nBecause it's in the book.\n\n[everyone commenting and mumbling at once]\n\nShe wrote that. So we know what happened.\n\nWell, if it's on Google, can't we just tell them?\n\nI mean, can we say it with our teeth clenched like this?\n\n[everyone laughing]\n\nThey can't hear you if you talk like this.\n\nIt's a funny question, because it is out there,\n\nthe answer, actually.\n\nYou can watch the sequel on Hulu.\n\nWhat happened to Rita's son in The Handmaids Tale?\n\nOh, he died fighting.\n\nI've never known what side,\n\nand I always also chose that he was fighting for Gilead.\n\nThe last time I saw him, we got in a fight\n\nbecause I didn't want him to fight for Gilead.\n\nAnd he did and he was like,\n\nI'm in it! I love Serena Joy, I'm going to fight for her.\n\nAnd then he went off and he got killed.\n\nAnd that was the last time I saw him.\n\nWhat's your process?\n\n[Amanda laughing]\n\nI'm serious.\n\nShe's a real actress.\n\nBut don't you think that would be more interesting if he-\n\nYes! Whatever you're going to say. Yes, that's it.\n\nThat's 100%. Way more interesting.\n\nWhat song did Janine sing to her baby\n\nin The Handmaid's Tale?\n\nI think there's two.\n\nThe Bob Marley song, Three Little Birds.\n\nAnd then she sings, I Only Want To Be With You\n\nby Dusty Springfield.\n\nGood for you, honey.\n\nI think it's just the two.\n\nI do sing quite a bit.\n\nBut she has an amazing voice in real life.\n\nWhy does Aunt Lydia have such a soft spot for Janine?\n\nShe treated her very unfairly, originally.\n\nTook the ear.\n\nI mean, ooh, I didn't take your ear.\n\nTook her eye, and I think she regrets it.\n\nAnd I think she comes to love Janine as her child.\n\nHow does Moira rebel?\n\nThe first thing I'm thinking of is\n\ncapturing that Aunt and taking off all of her clothes\n\nand putting them on myself.\n\nAnd then walking out of the Red Center,\n\njust walking out because I'm an Aunt.\n\nAnd then getting on a train and leaving\n\nand then fighting from the outside\n\nbecause that's what you do.\n\n[Elisabeth giggling]\n\nWho is the father of Serena's baby\n\nin The Handmaid's Tale?\n\nWell, it's Fred.\n\nWho else would it be? Yeah.\n\nI think there's theories.\n\nSo many theories that people think it's Mark.\n\nEveryone wants it to be Mark, yes.\n\nIf it was Mark, we definitely would've shot that scene.\n\n[everyone laughing]\n\nThat would not have been off camera.\n\nDoes Serena Joy like Offred?\n\nOoh!\n\nListen, I think she secretly wants a bestie.\n\nYeah.\n\nAnd she's got nothing and no one.\n\nSo, yeah. But she like hates her too.\n\nOkay, so she only likes June because she has no one else?\n\nBut she also secretly hates her?\n\nThat's absolutely not true.\n\nIt's complex.\n\nSerena's obsessed with June.\n\nShe wants them to be best friends.\n\nShe wants her in her life. She wants her approval.\n\nWants her approval.\n\nDefinitely approval factor in this.\n\nOffred does that to people. Don't you think?\n\nShe loves June.\n\nLike Aunt Lydia has a love/hate with her.\n\nYeah. Well, that's more interesting, isn't it?\n\nI mean, it's more interesting if there's complexity in it.\n\nI'm not looking for a best friend or anything,\n\nbut I think there's tremendous respect for her courage\n\nand her commitment and so on.\n\nYeah. Yeah.\n\nWill Hannah and June ever be reunited?\n\nYou'll have to watch this show\n\nand you'll have to watch the sequel\n\nYeah.\n\nWhat happens to June's baby in The Handmaid's Tale?\n\nLike the second one? Nicole?\n\nHow many babies do you got?\n\nI don't know.\n\nIf they're referring to her as the baby,\n\nit's probably Nicole.\n\nNicole. Yeah.\n\nWhat happens to June's baby in the...\n\nI mean, you have to watch the show.\n\nStop Googling the show. Watch the show.\n\nWatch it.\n\nI mean, I become her mother for a while.\n\nWho is Aunt Lydia in The Handmaid's Tale?\n\nWell, that's a terrifying question.\n\n[everyone laughing]\n\nI mean, she was a very strict Aunt to begin with.\n\nAnd she's the head of the Aunts. She's no fool.\n\nShe does not want to be under anyone else.\n\nThe beautiful girls who she loves\n\ngradually, I think, change her.\n\nAnd you'll have to see how that happens,\n\nbut you'll see.\n\nHow did June and Moira first meet?\n\nIn college! We were college roommates.\n\nOh really?\n\nI was going to ask you before, but then I was like-\n\nOh yeah, because-\n\nThen I was like, just be confident. Say that, Samira.\n\nYeah. It's the answer now.\n\nThat's what it is.\n\nWhat is the significance\n\nof Moira in The Handmaid's Tale?\n\nI think about when you find the Nolite\n\nscratched into the door.\n\nI'm not sure if it's that scene or whatever,\n\nbut you think about Moira.\n\nJune says something like,\n\nWhat would Moira do in this situation?\n\nAnd I've almost thought of them switching roles\n\na little bit during the course of it.\n\nLike you becoming the badass that you are\n\nand Moira following you in a way.\n\nOh, I like that.\n\nI've always thought that the inspiration\n\nfor her being everything that she is was me.\n\nMoira's very brave.\n\nI mean, she really puts it out there in ways\n\nthat others aren't willing to, or able to.\n\nYeah, I do think that some of your,\n\nI was going to say, Go get 'em-ness,\n\nthat is not what I mean.\n\n[Elisabeth] It is now what you mean\n\nYeah, has come from the inspiration\n\nof thinking about your friend.\n\nBut also I do think that being on the outside of Gilead\n\nand Moira not being able to do anything,\n\nthat her spirit is kind of diminished a little bit.\n\nThat's a really good memory, though, because it is true.\n\nLike in the beginning, Moira was June's inspiration.\n\nYeah.\n\nMoira was stronger and braver and got out.\n\nYes. And now I do feel for Moira now\n\nJune is now her inspiration.\n\nYeah. Yeah.\n\nEspecially coming up.\n\nWhat was Serena Joy's job before Gilead?\n\nShe wrote a book about women\n\nand that she thought they should go home and have babies\n\nand not do much else than that, really.\n\nThat was her job to inspire other women\n\nto feel the same way as her.\n\nYeah, she's right.\n\nWhat happened to Moira in The Handmaid's Tale?\n\nIf we're talking about Season One...\n\nAre we're talking about...\n\nI guess so.\n\nShe escapes.\n\nShe escapes and then she fights from the outside.\n\nDoes June ever get Hannah back?\n\nI guess you're going to have to watch the show.\n\nYeah.\n\nSpoiler Alert!\n\nYou're going to have to watch the sequel.\n\nOh my God, it's over. Thank God!\n\nThank you.\n\nIt's harder than making the show.\n\n[Amanda laughing] [everyone clapping]\n\nYay everyone.\n\nYou're welcome.\n\nThose are all of the questions.\n\nThank you for watching.\n\n[digitized music]",
  "authors": [
    "Condé Nast"
  ],
  "url": "https://www.wired.com/video/watch/wired-s-50-most-searched-questions-the-handmaids-tale"
}