{
  "title": "Samsung Galaxy Buds 3 Pro review: light ’em up",
  "text": "is a former senior reviewer who worked at The Verge from 2011 until May 2025. His coverage areas included audio, home theater, smartphones, and more.\n\nTwo things can be true at once. Yes, Samsung’s Galaxy Buds 3 Pro have the most derivative design yet of any of the company’s earbuds. Apart from gimmicky LED strips, there’s nothing particularly original or eye-catching about their stemmed look. But the $249.99 Buds 3 Pro also happen to be the best-sounding, most polished earbuds that Samsung has produced. Their audio quality ranks with some of my favorite wireless earbuds like Sennheiser’s Momentum True Wireless 4 and the Technics AZ80. And the Buds 3 Pro include genuinely useful voice commands that don’t require saying a wake phrase beforehand.\n\nThat’s a sterling start, but their potential is held back by clumsy design decisions, a lack of multipoint connectivity, and active noise cancellation that’s merely adequate at this $250 price. Over the summer, Samsung also had to pause shipments of these earbuds to address quality control issues after early buyers managed to easily rip the silicone ear tips. I never experienced that problem with my review pair, and the Buds 3 Pro are now widely available again.\n\nSamsung’s latest earbuds don’t come in any fun colors like the bora purple Buds 2 Pro. Your options are white — where the AirPods resemblance gets a little uncanny — or gunmetal gray. Samsung has tried to create some visual distance between these earbuds and the AirPods by going with a more angular stem and putting a seethrough lid on the charging case. And then there are those white LEDs, which you can light up by squeezing both stems when the buds are out of your ears.\n\nYou’ll never see this touch of flair when wearing them, of course, but other people will. The lights can be set either to glow steadily or do a pulsing effect, but what the LEDs can’t do is show helpful things like the remaining battery level for each earbud. That seems like the most obvious purpose for these and yet… nope! The lights do turn on when you’re trying to locate the Buds 3 Pro with Samsung’s Find My feature, at least.\n\nThe LEDs don’t really do much. Photo by Chris Welch / The Verge\n\nThe move to a stemmed design might feel like Samsung lazily joining the pack, but what matters more is that it results in a more secure, stable in-ear fit. I’ve found the Buds 3 Pro to be very comfortable, and they haven’t fatigued my ears even when I keep them in for most of a day at the office. Voice call performance is also quite impressive; you can sample the mic quality of the Buds 3 Pro (and other recent earbuds) in a Vergecast episode from earlier this month.\n\nSpeaking of voice, the most convenient feature of the Buds 3 Pro is their voice controls. At any time, you can say simple commands like “volume up” or “next song” and the earbuds will execute those requests through your phone — without requiring some annoying wake phrase first. It just works, and you don’t have to speak particularly loudly for the buds to detect voice commands. They only cover the fundamentals, but I’m now using them daily. If you prefer physical controls, Samsung has basically lifted the AirPods Pro control scheme, with pinch gestures for play / pause, skipping tracks, or toggling between ANC and transparency modes. You can also slide your finger along the stem to adjust volume. The angular shape means the gestures aren’t quite as foolproof as on the AirPods, but I’ve gotten them down fairly well.\n\nThe Buds 3 Pro offer terrific sound quality, with a tuning that closely follows the Harman target curve, which most people find pleasing. That means you’ll hear emphasis on bass and treble, but the mids still come through without sounding recessed. Samsung’s flagship earbuds sound full and detailed, bringing out the best in the latest albums from Waxahatchee, Post Malone, and Billy Strings. There is 360-degree / spatial audio with head tracking for those of you who A) own a Galaxy phone and B) enjoy that sort of thing. I continue to (mostly) ignore it.\n\nThe Buds 3 Pro are more angular than Apple’s AirPods Pro. Photo by Chris Welch / The Verge There are blue and orange indicators for the left and right earbuds. Photo by Chris Welch / The Verge\n\nI’m usually not someone who gets hung up on Bluetooth codecs, but I swear my ears can tell a difference when listening to the Buds 3 Pro with a Galaxy S24 Ultra, which can tap into Samsung’s Seamless Codec Ultra High Quality (SSD UHQ) for richer audio — especially if you’re playing lossless tracks. There’s just an extra layer of detail and fidelity that’s less pronounced when using these buds with a non-Samsung device. But even with my Pixel 9 Pro XL, they sound great. The Buds 3 Pro are a punchy, crisp listen that deliver across all genres.\n\nThe active noise cancellation, however, has disappointed me at times. It’s just not quite as robust or as powerful as the AirPods Pro, Pixel Buds Pro 2, or Bose earbuds. Can it cut back on some of the everyday life clamor? Sure, but I was hoping for Samsung to have a better showing in this category. The Buds 3 Pro do have a fantastically clear transparency mode, so I have zero complaints there. You can also enable an “adaptive” mode that, like with Apple’s earbuds, will dynamically blend ANC and transparency based on your surroundings so that important sounds (like sirens) can quickly get your attention.\n\nThe case’s lid is seethrough. Photo by Chris Welch / The Verge\n\nThe Buds 3 Pro don’t support true multipoint, so you can’t connect them to two devices at once. Just like Apple, Samsung is pushing its own ecosystem with an “auto-switch” feature between its various Galaxy laptops, tablets, and phones. But I’ve noticed that even if your other devices are outside Samsung’s walled garden, enabling auto-switch makes it much quicker to hop between them without having to disconnect from the current source every time. Some earbuds are very stubborn about holding onto a connection with the last-paired device until you manually disconnect, but with these, you can just select them in the Bluetooth settings of the device you want to use, and they’ll switch over without any fuss.\n\nAgree to continue: Samsung Galaxy Buds 3 Pro Every smart device now requires you to agree to a series of terms and conditions before you can use it — contracts that no one actually reads. It’s impossible for us to read and analyze every single one of these agreements. But we started counting exactly how many times you have to hit “agree” to use devices when we review them since these are agreements most people don’t read and definitely can’t negotiate. Like most Bluetooth earbuds, you can use Samsung’s Galaxy Buds 3 Pro without agreeing to anything in software. But by using the essential Galaxy Wearable app, you’re agreeing to: Samsung’s Terms and Conditions\n\nSamsung’s Privacy Policy The final tally is two agreements that are basically mandatory to use all of the earbud’s features and settings.\n\nI’ve had no complaints about battery life over several weeks of usage, and you can stretch it further by disabling some features like the aforementioned voice controls. The earbuds are rated IP57 dust and water resistant, though the charging case lacks any such protections. That’s unfortunate when competitors are increasingly making their cases more durable.\n\nSamsung’s Galaxy Buds 3 Pro might not have a unique design identity anymore, but with improved comfort and voice call performance, they’re an example of function dictating form. I can take or leave the gimmicky lights, and the angular shape seems like Samsung’s taking pains to avoid these being labeled as AirPods clones. They are, but you could make a case that they sound better than Apple’s buds. And they’re dependable performers by nearly every metric except for noise cancellation. That’s where the inevitable Buds 4 Pro have room to improve — hopefully while bringing back some character (or color). For anyone with a Samsung phone, these are the de facto choice, and they’re a great one. But other Android owners should also give the Buds 3 Pro a long look for their sound fidelity and mic clarity. Unless multipoint is a must-have, there’s not much to find fault with.\n\nPhotography by Chris Welch / The Verge",
  "authors": [
    "Chris Welch"
  ],
  "url": "https://www.theverge.com/24265270/samsung-galaxy-buds-3-pro-review"
}