{
  "title": "Do Beauty Products With SPF Actually Work? The Answer May Surprise You.",
  "text": "LOADING ERROR LOADING\n\nYou know you need to slather on sunscreen before a pool day, afternoon hike or any other time you’re outside for a while. But for everyday use, does a moisturizer or foundation that contains sunscreen suffice?\n\nThe AAD recommends using sunscreen that’s SPF 30 or higher, water-resistant and broad-spectrum, meaning it protects against both ultraviolet A and B rays. And you should wear it every day, year-round.\n\nAdvertisement\n\nSeveral moisturizers (as well as foundation, powders and other cosmetics) contain SPF 30 or more, but research is lacking on how these products measure up “in terms of coverage achieved and protection afforded,” according to a 2019 study published in PLOS One.\n\nIt’s “certainly better than wearing nothing with sun protection,” said Dr. Kseniya Kobets, director of cosmetic dermatology at Montefiore Einstein Advanced Care in Elmsford, New York.\n\nHowever, she said, to reach full SPF 30 coverage from makeup or moisturizer (which the American Academy of Dermatology recommends), you’d need to apply “a very thick and even layer, which often isn’t realistic.”\n\nAdvertisement\n\nThere are a few other things to know about cosmetics and skin care products that contain sunscreen, and how well they protect you from the sun.\n\nCarol Yepes via Getty Images You'd need to apply a thick layer of SPF foundation for it to be effective.\n\nYou Need To Apply A Lot Of Moisturizer Or Makeup To Get Sun Protection\n\nIt’s recommended that you use the equivalent of two tablespoons’ (or a shot glass’ worth) of sunscreen to exposed areas of the face and body, said Dr. Celeste Durham, a dermatologist at U.S. Dermatology Partners Fort Worth in Texas.\n\nAdvertisement\n\nHowever, most people don’t apply this much moisturizer or makeup, Kobets said. “You would need to apply a thick layer — about a quarter teaspoon of it for the face alone — which is probably OK with a cream but seems like a lot for makeup.”\n\nThat much makeup could give you a “heavy or cakey look,” she said.\n\nDr. Jacob Beer, a dermatologist in West Palm Beach, Florida, explained it in food terms: “The amount of moisturizer on your face should be about the size of a raspberry. The amount of sunscreen on your face should be about the size of a banana slice.”\n\nSo it’s unlikely that someone would use enough SPF makeup or skin care to achieve the necessary UV protection, Dr. Min Deng, a dermatologist at MedStar Health in Chevy Chase, Maryland, said.\n\nAdvertisement\n\nYou also need to reapply sunscreen every two hours, especially if you’re outdoors or sweating — and that would go for products containing sunscreen, too, she added.\n\nTypes Of SPF In Your Products May Vary\n\nThe SPF included in moisturizers and other products may not be broad-spectrum or water-resistant.\n\n“In general, sunscreens are more tightly regulated for SPF and photoprotection than makeup or moisturizers,” Beer said.\n\nWhether an item offers adequate sun protection is “product-dependent” and if someone applies enough, he said. “People tend to apply sunscreen more extensively throughout their face and neck; however, for moisturizers or makeup, they may only apply it in areas where they think they need it. They also tend to use less product.”\n\nAdvertisement\n\nThe 2019 PLOS One study found that subjects applied moisturizer “significantly worse than sunscreen” and missed areas of their faces.\n\nIs It More Effective To Use A Separate Sunscreen?\n\nIt’s not so simple.\n\nA multistep routine can be tiresome for some people, so they may forgo their sunscreen, Beer said. “In those cases, it’s much better to wear a product with SPF they’ll remember to apply and reapply.”\n\nIf you are going to use a combo product, choose a moisturizer with SPF over makeup, Deng told HuffPost. It can be especially beneficial for individuals with dry skin and also provides anti-aging and other skin care benefits.\n\nAdvertisement\n\nJust make sure the moisturizer is broad-spectrum and at least SPF 30, Durham said. “I personally use a moisturizer sunscreen combination that has other benefits like vitamin C serum and peptides,” she said. “It is like a one-stop shop for anti-aging, sun protection, moisture and protection from free radical damage.”\n\n\n\nYou can also layer SPF products, Kobets noted. “I prefer using a light moisturizer with SPF 30-50, with or without tint, as the base, then layering SPF makeup for additional coverage.”\n\nIf you prefer to use a separate sunscreen, apply it first and wait about 15 minutes before layering on moisturizer and makeup, Beer said.\n\nAdvertisement\n\nRemember that you need to wear sunscreen every day — no matter the season or how sunny it is, Durham said.\n\n“Sun damage is cumulative over our lifetimes, and every day is an opportunity to protect ourselves,” she said. “Times when you don’t think you are getting much sun, you are. Walking to the car, checking the mailbox, sitting by a window, and driving are all areas of opportunity to protect our skin.”\n\nLooking for a foundation that contains SPF? Check out these options below.\n\nHuffPost and its publishing partners may receive a commission from some purchases made via links on this page. Every item is independently curated by the HuffPost Shopping team. Prices and availability are subject to change.",
  "authors": [
    "On Assignment For Huffpost"
  ],
  "url": "https://www.huffpost.com/entry/do-moisturizers-and-makeup-with-spf-work_l_68bf0836e4b055a5037b9864?origin=life-feed"
}