{
  "title": "Bethesda’s $300 Pip-Boy 3000 replica can measure (harmless) radiation",
  "text": "is a senior reporter who’s been covering and reviewing the latest gadgets and tech since 2006, but has loved all things electronic since he was a kid.\n\nPosts from this author will be added to your daily email digest and your homepage feed.\n\nBethesda is now selling a highly-detailed wearable replica of the Pip-Boy 3000 from Fallout 3 and Fallout: New Vegas. It was designed using the 3D models of the accessory in the games to make it as accurate as possible, and is available for preorder now for $299.99, with shipping expected to start as early as June 2026. Sadly, it won’t arrive in time for the season two premiere of Amazon’s Fallout series that starts on December 17th, 2025.\n\nIt’s not the first time Bethesda has offered a replica of the chunky wrist-worn computer, but an earlier version, bundled with a collector’s edition of Fallout 4, relied on a smartphone and an app to replicate its in-game functionality. Created in collaboration with The Wand Company — which has a solid track record for creating detailed and mostly functional replicas like Poké Balls and Star Trek Communicators — the new Pip-Boy 3000 has its own 4-inch LCD display.\n\nYou can customize the appearance of the UI on the replica’s 4-inch screen. Image: Bethesda\n\nThe Pip-Boy 3000’s screen can be toggled between the classic green UI seen in Fallout 3 or the yellowish interface used in New Vegas. Bethesda says “almost all of the in-game content” accessible in both titles has been replicated including hundreds of menus that can be navigated with scroll wheels and dials, and you’ll even find a playable version of the Atomic Command minigame. The screen simulates the appearance of a vintage cathode-ray tube display with glitches and flickering effects that can be temporarily fixed by hitting the device, thanks to an accelerometer.\n\nThe replica extensively recreates the wearable’s in-game UI and menu system, and includes a playable version of Atomic Command. Image: Bethesda\n\nThe replica’s front casing is made from die-cast metal while the body is injection-moulded plastic with a memory foam cuff that can be enlarged using an included spacer. Other functionality includes a flashlight, a headphone jack, an alarm clock mode that can be used alongside an included display stand, and a functional radiation detector. However, instead of measuring the dangerous fallout from a nuclear blast, the replica Pip-Boy 3000 measures the radiation of FM radio broadcasts using on-screen meters and the simulated sounds of a geiger counter.",
  "authors": [
    "Andrew Liszewski"
  ],
  "url": "https://www.theverge.com/news/825283/bethesda-wand-company-fallout-3-new-vegas-pip-boy-3000-replica"
}