{
  "title": "JD Vance Trolls Hakeem Jeffries With ‘Solemn Promise’ About Racist Memes",
  "text": "LOADING ERROR LOADING\n\nInstead, he insisted that the videos were all about “having a good time.”\n\nOn Wednesday, a reporter asked Vance about the intent behind the posts.\n\n“You’ve said you’re interested in good-faith negotiations with these leaders, but what message does that send?” the reporter asked. “Is it helpful to post pictures of Leader Jeffries in a sombrero if you’re trying to have good-faith talks with them?”\n\nAdvertisement\n\nTo which the vice president replied, “Oh, I think it’s funny,”\n\n“The president’s joking! And we’re having a good time,” Vance continued. “You can negotiate in good faith while also poking a little bit of fun at some of the absurdities of the Democrats’ positions, and even poking some fun at the absurdity of the Democrats themselves.”\n\nEarlier this week, after meeting with Jeffries (D-N.Y.) and Senate Minority Leader Chuck Schumer (D-N.Y.) to discuss preventing a government shutdown, the president posted a deepfake video depicting Jeffries wearing a sombrero and mustache while Schumer called Democrats “woke pieces of shit.”\n\nThe next day, Trump followed up with another video, this one once again featuring Jeffries in the sombrero, along with a mariachi band — with every musician showing Trump’s face.\n\nAdvertisement\n\nDuring his defense of the videos, Vance on Wednesday also made a weird vow to Jeffries ― though he said it was “solemn.”\n\n“I’ll tell Hakeem Jeffries right now: I make this solemn promise to you that if you help us reopen the government, the sombrero memes will stop,” Vance said. “I’ve talked to the president of the United States about that.”\n\nYou can see Vance make his “vow” in the clip below.\n\nReporter: What message does that send? Is it helpful to post pictures of these leaders and a sombrero?\n\n\n\nVance: Oh, I think it's funny. The president is joking.. I make a solemn promise to Hakeem Jeffries that if you help us reopen the government, the sombrero memes will stop pic.twitter.com/FEYrrpPWai — Acyn (@Acyn) October 1, 2025\n\nAdvertisement\n\nAlthough showing a mock video of a Black man dressed in another country’s stereotypical attire might pass the racism test for many, Vance didn’t appear to understand why people used the “R” word to describe the Jeffries videos.\n\n“I mean, Hakeem Jeffries said it was racist, and I know that he said that,” Vance remarked. “And I honestly don’t even know what that means. Like, is he a Mexican-American that is offended by having a sombrero meme?”\n\nVance also emphasized that many Americans wouldn’t find the deceptive video ... deceptive.\n\n“It’s like, do the American people, do you really not realize? The American people recognize that he did not actually come to the White House wearing a sombrero and a black curly animation mustache,” he said. “Like, give the country a little bit of credit.”\n\nAdvertisement\n\nAlthough Vance said the White House was “trying to do a very important job for the American people,” he claimed that Trump “likes to have a little bit of fun when he’s doing it, and I think that’s OK.”\n\nVance later posted a clip of that exchange to his own account.\n\nVP Vance on President Trump’s sombrero meme:\n\n\n\n“Hakeem Jeffries said it was racist, and I know that he said that, and I honestly don’t even know what that means.\n\n\n\n“Like, is he a Mexican-American that is offended by having a sombrero meme?” pic.twitter.com/wdxbj3Cqic — Vice President JD Vance (@VP) October 1, 2025",
  "authors": [
    "Senior Reporter"
  ],
  "url": "https://www.huffpost.com/entry/jd-vance-trolls-hakeem-jeffries-over-racist-sombrero-memes_n_68dd7f31e4b028d81f2ffe86"
}