{
  "title": "Vinted’s guide to 2025 nostalgia: cone bras, camo and Y2K flair",
  "text": "It’s week two of RE/style – the new fashion competition series on Prime Video, where eight talented designers from across Europe are reinventing pre-loved pieces, to win the chance to showcase their collection at the Oxfam show during London fashion week.\n\nRecapped: trends come and go, but nostalgia is for ever\n\nHost Emma Willis wears a vintage Madonna T-shirt, which turns out to be a clue about the design brief: nostalgia. In many ways, it’s the perfect theme, because fashion is all about reimagining aesthetics from the past to make them feel current and fresh. The contestants have just six hours (eek!) to create a look which embodies their version of nostalgia, using five pre-loved pieces.\n\nThis week, Saabira has something to prove. In week one, the London-based designer found herself at the bottom of the pack, but it looks as if she’s got her groove back. Following Emma’s lead, Saabira is paying homage to the queen of pop: Madonna. Her stage-ready look, which incorporates 90s camo fabric, features a recreation of the iconic “cone bra”. Most people associate the pointed bra design with Jean Paul Gaultier, who famously created Madonna’s 1990 Blond Ambition Tour look. But as Saabira informs the judges, a Black designer, Angela Dean, has claimed it was actually based on one of her designs, which Madonna had worn earlier.\n\nView image in fullscreen The brief this week is ‘nostalgia’\n\nEmily, from Yorkshire, is also chanelling nostalgic pop culture references. By piecing together a selection of shirts, she’s making a jumpsuit inspired by 80s blockbuster Top Gun. And 36-year-old Charlotte – the only self-taught designer in the group – is stitching together vintage band T-shirts with neon green fabric. An adjustable tartan skirt finishes off the rave-inspired look.\n\nFor many of the designers, nostalgia is all about family. David and Chiara, from Spain and Italy respectively, are both paying homage to their grandparents. David’s genderless trouser and wrap-skirt look incorporates patterns from the tiles at his grandparent’s home, where he and his cousins would spend hours playing with their cats. Chiara’s 60s-inspired look is a tribute to her grandmother – a glamorous woman who would always wear red lipstick to the beach. And Shanie, from Paris, tells the story of her parents owning a nightclub when she was young, where badly dressed people would sometimes be turned away. (How Parisian is that?) Her elegant 80s-inspired shirt dress, made from shirts and a blazer, is the type of outfit that would guarantee a queue-jump.\n\nFor others, nostalgia is about a personal #journey. Alejandro, who was crowned last week’s “head designer”, is originally from Spain but now lives in London. This week, his design is Vivienne Westwood with a Spanish twist – a sculptural slip adorned with ruffles and voluminous tulle detailing, combining something old with something new.\n\nAs the designers prepare for the runway, the judges are joined by special guest Clara Amfo, whose pre-loved faves include an extensive collection of vintage band T-shirts. She explains that her heritage gives her a special interest in sustainability. “I believe in preserving clothes for as long as possible, especially as my roots are Ghanian, and in Ghana, a lot of people’s unused, wasted clothes are dumped,” she says. “So to see clothes being used in a circular way is really encouraging.”\n\nIt wouldn’t be a fashion competition without a little drama, would it? Just before the runway show, we got just that: Saabira badly cut her finger with a pair of scissors, so she was taken to hospital for stitches before she could finish her look, which was shaping up to be one of the judge’s favourites.\n\nView image in fullscreen David, Emily, Guisy, Charlotte, Shanie, Chiara and Alejandro\n\nOn the runway, as ever, there were slays and … nays. The judges thought some of the looks felt too safe, while others were too messy and chaotic. Once again, some of the initial designs were too ambitious, and ended up being unravelled by the execution. However, others totally nailed the brief to make nostalgic style feel current, while also styling their looks to perfection. This week’s “head designer” created a look that felt like it could be straight off the runway. To find out whose gasp-worthy look was the winner, you’ll have to watch this week’s episode …\n\nRestyled: Louis’s lessons for acing nostalgia\n\nBringing nostalgic influences into your wardrobe is fashion at its most personal, because our cultural reference points vary depending on where we’re from, or how old we are. And as the designers demonstrated this week, the clothing and aesthetics which end up creating memories are unique to each of us. For some people, nostalgia might conjure up an era – such as 80s denim, 90s leather jackets, or Y2K metallics. (I became very obsessed with vintage 80s sportswear at university, which I wore while doing precisely zero sporting activity.) But it might also recall specific garments. When I was a child, my mum used to wear a lot of bold, colourful 90s knitwear. There was a particular sweater (bright orange, with a black fish pattern knitted into it – trust me, it worked!) and I’m always hoping to find a version of it whenever I shop for pre-loved clothes.\n\nAnd the most interesting part of nostalgic dressing is that it isn’t just about looking to the past, but reimagining it through today’s lens. It’s one thing to recreate an iconic pop-culture reference from your childhood, but there is a difference between costume and fashion. The latter is all about doing something different with the reference, to make it feel like today’s take on it. That’s why, this week, Charlotte’s tartan skirt design worked so well with her custom rave T-shirt. It elevated both garments by transporting them into a new place – a blast from the past that felt very of the moment.\n\nIf you’re looking to emulate this, pop culture can be a great starting point. Find a particular character, or celebrity, and think about one of their most recognisable looks. (Like Madonna’s cone bra … if you’re brave enough.) Once you start to build the outfit around this signature garment, then you can also incorporate pre-loved pieces from different eras, or the present day, to create something that feels both nostalgic and new.\n\nResold: how Vinted can help whether you’re coming or going\n\nTimes (and trends) may change, but nostalgia is fashion’s constant muse. Vinted is a place where you can discover (or rediscover!) vintage band T-shirts or 90s spaghetti strap dresses, and it’s also a one-stop-shop for finding looks for specific occasions. Vinted is ideal for finding pieces from different eras, or combining them with newer things.\n\nVinted lends itself to nostalgia because there is a feelgood factor to finding pre-loved gems and incorporating them into your wardrobe, especially if you’re styling them differently and making them feel current. And it’s a more affordable way to experiment, because you can earn money by selling pieces from your wardrobe that you don’t wear. Personally, I’ve always found a sense of comfort in the fact that fashion changes while style endures – and Vinted is there to help you find the fashion that suits your personal style best.\n\nTap into every era. Buy and sell pre-loved on Vinted\n\n",
  "authors": [
    "Louis Staples"
  ],
  "url": "https://www.theguardian.com/restyle-recapped/2025/oct/13/vinted-fashion-show-episode-2-nostalgia-week-highlights"
}