{
  "title": "How deep-sea mining could threaten a vital ocean food source",
  "text": "is a senior science reporter covering energy and the environment with more than a decade of experience. She is also the host of Hell or High Water: When Disaster Hits Home , a podcast from Vox Media and Audible Originals.\n\nThe race to mine battery minerals from the ocean floor would create a new stream of waste that could rob sea life of a critical food source, according to new research published today in the journal Nature Communications. That could have far-reaching effects across the ocean, potentially reaching larger fish like tuna that people depend on for food and livelihoods.\n\nThe findings come as President Donald Trump attempts to circumvent international law and give companies permission to mine the deep sea commercially, which has yet to happen anywhere in the world. The first company to apply for an international mining permit from the Trump administration actually funded this study. It might not have anticipated that the results of that research would raise another warning flag about deep-sea mining.\n\nThe study authors found that if mining operations release waste into the ocean’s “twilight zone,” about 200 to 1,500 meters below the surface of the sea, it could starve tiny animals called zooplankton and other creatures that eat them. That could have serious ramifications along entire food webs that connect predators and their prey, leading the scientists to argue there still needs to be more research into how to avoid potential risks.\n\n“Put the brakes on this process”\n\n“We’re trying to go against that [rush to mine] and put the brakes on this process. We don’t have the science to fully conclude what’s the best option,” says Michael Dowd, lead author of the study and an oceanography graduate student in the University of Hawai‘i at Mānoa School of Ocean and Earth Science and Technology. “Those current plans are going to cause severe impacts.”\n\nThe Trump administration has set its sights on rock-like polymetallic nodules on the seafloor that are rich in nickel, cobalt, and manganese, which can be used to manufacture rechargeable lithium-ion batteries. A Canadian startup called The Metals Company (TMC) calls those nodules “batteries in a rock” and triggered a deep-sea mining craze several years ago when it partnered with the island nation of Nauru to start commercially harvesting those minerals. The effort pushed the International Seabed Authority (ISA) to start developing a “mining code” to regulate deep-sea mining and protect natural resources considered a “common heritage of humankind.”\n\nMore than 900 ocean scientists and policy experts, meanwhile, have called for a freeze on deep-sea exploitation in a public statement that says mining could result “in the loss of biodiversity and ecosystem functioning that would be irreversible on multi-generational timescales.”\n\nThis year, The Metals Company and the Trump administration decided to move ahead rather than wait for the ISA to finalize its mining code. Trump signed an executive order to fast-track seabed mining in US and international waters, and TMC soon applied for a permit under that process. Critics say these moves violate international law, and ISA secretary-general Leticia Reis de Carvalho has said that unilateral action to mine the deep sea “sets a dangerous precedent that could destabilize the entire system of global ocean governance.”\n\nNodules on the abyssal seafloor in the Pacific’s Clarion Clipperton Zone with a mud cloud from a scientific ROV touching down. UH/NOImage: AA DeepCCZ Expedition\n\nThe new research adds to those calls for caution. The mining process involves transporting nodules along with seawater and sediments via pipe up to a ship where the valuable metals can be separated and collected. The leftover waste is pumped back into the ocean, but where exactly to dump it in the vast abyss is still a big question.\n\nThe twilight zone is one option that industry has proposed, considered a midwater depth — where sunlight disappears and is replaced by the dim light of bioluminescent organisms. It’s an area that’s busy with life, including small fish, crustaceans, and gelatinous creatures called micronekton and the zooplankton they eat. The zooplankton gobble up particles from dead organic material that drifts down into the twilight zone. A major problem with releasing plumes of waste here is that it would inundate the zone with similarly sized sediment particles that could replace the zooplankton’s food source with a less nutritious alternative.\n\nThe researchers from the University of Hawai‘i at Mānoa collected water and particle samples before and during a small-scale test mining operation TMC conducted in the Pacific Ocean in 2022. By comparing concentrations of amino acids in the particles, a measure of their nutritional value, they found that the particles from the waste plume were 10 to 100 times less nutritious. Dowd describes it as “junk food that has almost no organic material to it.”\n\n“This will cause this bottom-up impact where first, these zooplankton will starve, and it can cause the micronekton and up to starve,” he says. Whales and bigger fish like tuna and swordfish dive down to the twilight zone to eat micronekton. Zooplankton also migrate up toward the sea surface nightly to feed before returning to the ocean’s midwater. They become food for other animals at varying depths in that process, and the ritual also plays a key role in transporting carbon deep into the sea to regulate Earth’s climate. For all these reasons, flooding the twilight zone with junk particles from mining waste is likely to have cascading effects on life at all depths of the ocean.\n\nReleasing that waste in shallower waters, home to predators higher up on the food chain, is likely to pose similar or worse risks, the research paper notes. There’s little data available to understand what the impact might be further down in the water column than the twilight zone, where scientists are still discovering new species and where some species from shallower depths will migrate to avoid predators. If companies are hell-bent on mining the deep sea before even fully understanding the risks, they might be able to mitigate some harms by returning sediment waste all the way back down to the seafloor where they dug it up. This is likely a more complicated and costly endeavor than releasing it at shallower depths, however — and that has scientists concerned about the impact that cutting corners could have on sea life.\n\nAdvances in battery technology and e-waste recycling can limit the need to mine\n\nThe study authors tell The Verge that although they received funding from the company, they retained the independence to publish their findings without Metals Co. influencing their work.\n\nThe Metals Company said in an email to The Verge that it plans to discharge waste at a depth of 2,000 meters, below the twilight zone studied in the paper, “based on the authors’ advice.” It claims that the waste particles dissipate quickly, and that there are fewer zooplankton at that depth anyway. “Concern about midwater impacts is understandable, but the data have moved on—and so should the conversation,” TMC environmental manager Michael Clarke said in the email.\n\nAdvances in battery technology and e-waste recycling can also limit the need to mine. Automakers including Tesla, BYD, and Ford have turned to alternatives to conventional rechargeable batteries that would eliminate or limit the need for nickel and cobalt. Building out more robust recycling infrastructure could also help ensure that EVs and renewable energy sources like wind and solar that need rechargeable batteries don’t wind up causing new environmental crises.\n\n“We can recycle our [e-waste], we can mine our waste,” says Brian Popp, co-author of the study and a professor at the UH Mānoa School of Ocean and Earth Science and Technology. “We don’t need to dig up the deep sea to power the green revolution.”",
  "authors": [
    "Justine Calma"
  ],
  "url": "https://www.theverge.com/news/814694/deep-sea-mining-waste-battery-metals-research-trump"
}