{
  "title": "Jon Batiste Answers Piano Questions",
  "text": "Transcript\n\n[mellow jazz melody]\n\nHello.\n\n[mellow jazz melody]\n\nI'm Jon Batiste.\n\nAnd I'm here today to answer your questions\n\nfrom the internet.\n\n[mellow jazz melody]\n\nThis is Piano Support.\n\n[mellow jazz melody]\n\n[intense groove music]\n\nMeelkerr,\n\nAll major keys are created equal, but Eb is the best.\n\n[upbeat groove music]\n\nThat's not a question, but I agree.\n\nIt's funny you say that, [plays arpeggio] Meel,\n\nbecause Eb is my favorite key.\n\nListen to the way that you can make it moan.\n\n[plays flat chords]\n\n[plays flat mellow melody]\n\nEb is different from other keys because,\n\nif you want technical explanation, it has three flats.\n\n[plays scale]\n\nBut the tonality of Eb, it's a brown shade\n\nthat really creates a sense of warmth.\n\nDb feels like Mother Earth,\n\nand then Eb feels like the tree\n\nthat's coming from the ground,\n\nso it's the roots that are dug into the soil,\n\nso there's a bit of a aspirational quality to it.\n\nWhereas if you listen to Db,\n\n[plays flat chord]\n\nit's home, womb space.\n\n[plays flat chord]\n\nBut then we go to E Flat, [plays flat chord],\n\nit's still grounded, but, [plays arpeggios]\n\nyou know, it's like...\n\n♪ Come with me ♪\n\n♪ Come and see ♪\n\n[plays delicate cheerful arpeggios]\n\nYou know, so it's like one of my favorite keys,\n\nbecause I like to keep my feet on the ground\n\nwith my eyes to the stars.\n\nEdinKaso's question, What was the one thing\n\nthat really improved your music making?\n\nOkay, Edwin, what's one thing\n\nthat really improves my music making is listening.\n\n[plays mellow chord]\n\nThat's the constant thing of life, is, how do we listen?\n\nHow do we listen deeper,\n\nhow do we listen in a way that is both passive,\n\nwhere we're not participating in speaking or playing,\n\nbut is also active, because we're just as engaged\n\nas if we were speaking or playing.\n\nSo it's the thing of listening.\n\nIf you figure out how to do that, everything improves.\n\nYou practice scales, you know. [plays scale]\n\nIf you practice a scale,\n\nor if you practice arpeggios or something, [plays arpeggio]\n\nor if you practice playing the blues, you know,\n\n[plays blues melody]\n\nit's all about listening, because it's infinite.\n\nThere's infinite ways you can practice scales and arpeggios\n\nand practice playing different styles,\n\nand you can listen to a piece and learn something about it\n\nevery day of your life, and just, it's infinite.\n\nSo how do I listen better? How do I practice that?\n\nOr, how did that improve?\n\nWell, it's practicing it everywhere you are, all the time,\n\neven when you're not playing,\n\nespecially when you're not playing.\n\nSo yeah, open the mirrors up. Go ahead, Edin, you got it.\n\nMicroburrito1, [upbeat groove music]\n\nWhat's your favorite type of piano music to play?\n\nWell, my favorite type of piano music to play is like blues.\n\n[plays lively blues melody]\n\nYou know?\n\nI love this sound.\n\nIt's a party.\n\nIt's love and sound.\n\n[ends lively blues melody]\n\nSo, you know, I play that kind of music a lot.\n\nI also like playing, you know, just some mellow kind of,\n\nyou know...\n\n[plays sober classical melody]\n\nYou know.\n\n[plays blues arpeggios]\n\nYou know, all kind of stuff, man.\n\nI've been playing a lot of bebop lately.\n\nArguably one of the most,\n\nif not the most sophisticated form of music ever invented,\n\nit's the peak.\n\nMusicians take all of the logic of counterpoint,\n\nand all the logic of the American popular song,\n\nand blend them together in this form of co-creation\n\nthat is [snaps fingers] lightning quick wit in music form.\n\n[plays mellow chords]\n\nYou have melodies that are happening.\n\nThere's a rhythmic basis to bebop too\n\nthat makes it very, very distinct.\n\nIt's the two and the three, there's a lot of triplets,\n\nand there's a lot of rhythms that are going\n\nbetween eighth notes and triplets.\n\nAnd you have a scale that is, [plays chromatic scale]\n\nthere's different forms of what we call bebop scales\n\nthat are made so that you can land throughout the changes\n\nin ways that are graceful and that match the changes.\n\n[plays chromatic scales with chord progression]\n\nSo you're doing all of this weaving and melodic construction\n\nin the context of the rhythm section that's also doing that,\n\nthe drums are playing rhythms\n\nand reacting to what you're playing and vice versa,\n\nthe bass is playing a walking line on every beat,\n\nand that's a low melody.\n\nAnd then the piano is creating\n\nall of this different counterpoint\n\nto everything that's happening, and everybody's doing that.\n\nAt least at one time, there's four people\n\nthat are creating counterpoint together.\n\nAlphaQ984,\n\n[upbeat groove music]\n\nRecently my piano teacher asked me\n\nto add more 'feel' to my playing.\n\nOkay, so, [plays lively scale]\n\nbebop is about feel, Alpha, you see?\n\nWe're talking about bebop.\n\nSo, [plays frenzied scale]\n\nlike you gotta have a certain kind of like,\n\n[plays frenzied melody]\n\nthat kind of, [plays frenzied melody]\n\nso like, [plays frenzied melody].\n\nSo that you could play that without feel like...\n\n[plays staccato melody]\n\nOr you could do it like [plays frenzied melody]\n\nSo it's like, it's hard to describe feel\n\nother than rhythmic intention\n\nand clarity of execution.\n\nSo if you wanted to talk about feel\n\nand how to get your feel better,\n\nstart with getting your rhythm better and your execution.\n\nAnd then, even like when I was just playing it,\n\nlike I'm just throwing it off right now,\n\neven when you make a mistake, if your intention is there,\n\nand execution is almost there, it's gonna come off better\n\nthan if you were playing all of the right notes\n\nbut it was kind of iffy rhythm.\n\nAnd so, feel really starts with rhythmic intention,\n\nand matching that level of intensity of your intention,\n\nyou know exactly how you wanna play it,\n\nwhat swag you want it to come off with,\n\nmatching that with all of the right notes.\n\nSo that's what you gotta do, you know what I'm saying?\n\n[plays frenzied melody with chord progression]\n\nAh.\n\n[concludes frenzied rhythm]\n\nMitchmgj,\n\n[upbeat groove music]\n\nWhat's your practice routine?\n\nHow can I practice more effectively?\n\nDocument your practice.\n\nDocument your progress, [plays arpeggio]\n\nand your observations.\n\nThink about what you're doing\n\nfrom the perspective of constructing yourself,\n\nyour building, your ideal version of you.\n\nAnd you look at the things that you want to do,\n\n[plays chord arpeggio]\n\nand you look at the things that you can't do,\n\nand you figure out how to bridge the gap between those\n\nand close it a little bit each day.\n\nAnd you decide, okay, these are my objectives,\n\nthat's the points that I want to reach,\n\nand then you go after those very methodically.\n\nAnd there's no such thing as failure, it's just discovery,\n\nso you try different things.\n\nAnd then obviously the fundamentals, that's the best way\n\nto continue to improve.\n\nTo learn.\n\n[plays arpeggio]\n\nSee, that's a C triad.\n\nThere's so much in there.\n\nThe fundamentals, every day you can just learn something\n\nabout the fundamentals of music.\n\nLearn something about music making from reading a biography,\n\nor sitting at the piano and just playing the C major,\n\n'cause sometimes I would do that while I play a chord,\n\n[plays major chord]\n\nand I'll just sit and listen to it\n\nwith no objective other than to listen\n\nand let it reveal something to me\n\nthat maybe I haven't heard.\n\nGet acquainted with the instrument, and with music,\n\nlike it's a friend, like it's a part of you.\n\nSo just so much that you can do to absorb it,\n\njust be about it, and you'll find it.\n\nSeek and you will find.\n\n♪ Oh, yay, yay ♪\n\n[plays delicate melody]\n\n[chuckles]\n\nAnd then just play. Always remember to play.\n\n[plays delicate mellow melody]\n\nLike the child, you see?\n\n[plays chord progression and delicate melody]\n\n[chuckles]\n\nLet's see.\n\nWow.\n\n5120t,\n\n[upbeat groove music]\n\nHow do you make catchy music?\n\nWell, how do you make catchy music?\n\nListen to catchy music.\n\nHow do you learn how to do anything in this human form?\n\nBy absorbing the frequency,\n\nby absorbing the energy of the thing,\n\nyou embody it, you physically absorb it,\n\nyou synthesize it within yourself,\n\nand then you become a vessel for it.\n\nSo you have to exist within the world of the thing\n\nthat you want to become.\n\nSo music is such a manifestation of that concept,\n\nbecause you can't hold music.\n\nYou can look at sheet music,\n\nbut even the notes on the page are not\n\nthe comprehensive representation of what you're hearing,\n\nthere's all kind of nuances and inflection,\n\nand there's all types of intention behind notes\n\nthat can't be written down.\n\nSo what that means is, you can't study it\n\nas much as it's a matter of embodying it.\n\nCertainly you can listen and study, and there are formulas,\n\nand formulas work,\n\nbut formulas are just representation of things\n\nthat exist on a frequency.\n\nAnd if you figure out how to tap into that\n\nand receive that frequency on a regular basis,\n\nand you can find other people who are on that wavelength,\n\nbuild a community of people who are into that too,\n\n'cause that's how you compound the energy,\n\nand then all of y'all are gonna start embodying it.\n\nIf you think about songwriting,\n\nand the catchiest music of all time is often written\n\nin a duo format or a trio format.\n\nIt's just the way it is.\n\nEven if you think about people\n\nwho were incredible artists in their own right,\n\nMichael Jackson and Quincy Jones,\n\nGambling and Huff, Rodgers and Hart,\n\nthere's always even the person\n\nwho makes the music that's catchy.\n\nIf it's like Irving Berlin or something,\n\nit's always about finding the singer,\n\nor the arrangement to arrange it.\n\nMusic is a communal activity, it's a communal effort.\n\nSo find your people,\n\nand people that are on that same frequency, that wavelength,\n\nthat y'all are complimentary to each other.\n\nAnd then let the ego out of the room.\n\nThe ego is great to have\n\nso you could be confident in yourself, stand up,\n\nplay your music, da, da, da, da, da.\n\n[plays upbeat arpeggio] It's great.\n\nBut you want to just put it to the side\n\nand leave space in the room for God to walk in.\n\nAnd that's when it's, oh, snap,\n\nlike what's happening out the speaker?\n\nIt's just getting me, oh, it's, ooh, catchy.\n\nIt's catchy.\n\nIt's catchy because you've been caught by it, oh.\n\nOkay, AtomixAndy, [upbeat groove music]\n\nWhy do pianos have keys? What's locked?\n\nWhat are the pianos hiding?\n\nSo see, this is a bit of a pun.\n\nThe piano keys, you know, [plays chord]\n\nI would say, if you want to go all philosophical,\n\nthe pianos have keys because music is tied\n\ninto the universal divine alignment of all things,\n\nwhich we see in mathematics some,\n\nbut music speaks to the unspoken within that language.\n\nAnd it also speaks to the mind, to the heart and the spirit\n\nall in one.\n\nEach key is a key to life. [plays arpeggio]\n\nAnd then you put 'em all together,\n\nand it's like a beautiful equation of living.\n\nSo that's why people make songs and create music,\n\nbecause it speaks to something that's greater than ourself,\n\nand it's a great way to create a shared body\n\nof our collective wisdom over time.\n\nGenerations pass on songs and melodies\n\nand rhythms and all these things, and the piano does it all,\n\n'cause it's actually a percussion instrument.\n\nIt's hammers in there, so it's not just keys, it's hammers,\n\nHammer time.\n\nSYLOH, explain like I'm five, [upbeat groove music]\n\nWhat do the pedal on the piano actually do?\n\nHow do they do it?\n\nOkay, well it's deep, because this piano has two pedals.\n\nThe modern piano typically has three pedals.\n\nSo I'm gonna explain it in a way\n\nwhere you'll have to imagine what the middle pedal does.\n\nEach string [plays note]\n\n[plays deaf key] has a hammer, a mallet,\n\nthat strikes the strings to create the tone.\n\n[plays note repeatedly]\n\nNow, there's a felt on the top of each string,\n\nand it's a set of three strings\n\nthat create the tone of each note.\n\nNow, if you press this, [plays note]\n\nthe pedal does all the way to the left,\n\nwhat it does is it shifts the entire pedal board over\n\nso that you're only attacking two of those strings.\n\nSo the tone becomes felted, it becomes dampened,\n\nit's like you put a blanket on it, it's lovely,\n\nit's a beautiful, like, check out the difference.\n\n[plays arpeggio] This is without it,\n\nand then you play the pedals all the way to the left,\n\n[plays arpeggio] you hear the difference?\n\n[plays arpeggios]\n\nIt's like a string of pearls. Okay?\n\nThe middle pedal is sustain without reverb,\n\nso we don't have a middle pedal.\n\nBut the middle pedal is typically\n\nwhat sustains whatever note you play\n\nat the same time as you activate that pedal.\n\nSo if you play [plays chord] all of these notes,\n\nit would sustain them all,\n\nand then the rest that you'll play on top of it\n\nwouldn't be sustained while that would continue to ring out.\n\nThe pedal to the right is the sustain pedal,\n\nso as long as you hold it, everything is sustained.\n\n[plays chord and arpeggio]\n\nNow what that does,\n\nbecause of the way that it's sustaining,\n\nyou see how it lifts every single mute,\n\nevery single felt away from the string,\n\nso that it's not possible for it to be muted,\n\nit sustains the whole body of the instrument.\n\nWell, what does that do?\n\nIt also creates reverb, that's less talked about.\n\nIt sustains the notes,\n\nbut the middle pedal doesn't create reverb,\n\nand this one does,\n\nand that's because of the mechanism of how it happens.\n\nSo actually for me, when I think about the sustain pedal,\n\nI think that's a misnomer,\n\nI think it's actually the wrong name for it,\n\nit should be the reverb pedal.\n\nThe middle pedal is the sustain pedal,\n\nand the pedal to the left is the damper pedal,\n\nbut it has a certain sort of tonal quality to it,\n\nso it's not really dampening, it's rounding out the edges.\n\nWhen I see the sound in my mind,\n\nit goes from a sharp pointed edge to a rounded edge,\n\nand that's a great way of thinking about it\n\nin your music expression.\n\nA Reddit user asked us, [upbeat groove music]\n\nDid Ray Charles basically\n\nsingle-handedly invent soul music?\n\nRay Charles was the architect of it,\n\nnobody put it together in a way that Ray did in 1959,\n\nfor instance.\n\nHe put all of the elements together,\n\nhe was the architect of it in a way that allowed for us\n\nto have a shared language for it,\n\nin a shared way about how we present soul music\n\nto the world.\n\nThe elements of soul music existed,\n\npeople were singing elements of it in different forms\n\nof our history.\n\nSam Cook popularized it as much as Ray Charles.\n\nThere's so many different examples of proto-soul music,\n\nbut soul music was Ray Charles.\n\nYou can't argue that Ray was the architect of it.\n\nAnd I'm a son of Ray Charles. [plays blues arpeggio]\n\nYou see?\n\nTaking those kind of chords, [plays chord] gospel chords,\n\n[plays chord progression]\n\nyou see?\n\n♪ Oh yeah ♪\n\nThat old, that inflection?\n\n♪ She gimme money when I'm in need ♪\n\n♪ Yeah, she's a kind of ♪\n\nLike that kind of cry, feel, holler,\n\nmixed with the jazz and the horn section.\n\n♪ Friend indeed ♪\n\nIt's just all so brilliant.\n\nLike that thing that we all know.\n\n♪ Hit the road, Jack ♪\n\nImagine hearing that for the first time on wax.\n\nJust like, we take it for granted now,\n\nbut just like, you know what I mean?\n\nLike,\n\nit's not normal.\n\nJust, this is a whole nother. Yeah.\n\nYes. Single handedly, we could say that.\n\nYou can say that and be safe.\n\nSea_Perception_2017,\n\n[upbeat groove music]\n\nWhat are the essential piano repertoires\n\nthat every pianist should learn?\n\nThat's a deep question.\n\nBecause this piano,\n\nit exists in so many musical traditions.\n\nIt's the orchestra at your fingertips.\n\nSo you can play anything,\n\nalmost anything can be played on the piano.\n\nWhat's essential out of everything,\n\nit's such a personal question,\n\nhow you want to philosophically approach it.\n\nDo you want to make a whole repertoire list of things\n\nthat you know that you'll probably be able to grasp quickly,\n\nand connect to the things you naturally do well?\n\nOr do you want to go in the opposite direction,\n\nand try to learn a whole bunch of stuff that just,\n\nalmost feels averse to your musical approach\n\nand almost is like another language?\n\nI think both are very valid.\n\nThen you'll figure out what's essential\n\nthrough that process.\n\nThere's no right answer.\n\nPeople might say, you should learn,\n\nyou know, like people always play...\n\n[plays lively classical rondeau]\n\nOr you know...\n\n[plays sober classical melody]\n\nEven if you playing jazz.\n\n[plays cheerful honky tonk melody]\n\nThe blues, yeah, Beethoven, all of it's good.\n\nEverything.\n\nA Reddit user asked the question,\n\n[upbeat groove music]\n\nBest official piano arrangements\n\nfor video game soundtracks?\n\nFinal Fantasy VII, I would say,\n\nis probably the greatest soundtrack of a video game ever.\n\nNobuo Uematsu, incredible.\n\nAnd also the Capcom series of games I listen to,\n\nwhether it's Mega Man, all the series.\n\nThe whole expression of themes in these games\n\nshaped my compositional, [plays arpeggio]\n\nmy compositional mind.\n\nBut Green Hill Zone, Sonic the Hedgehog, level one,\n\n[plays idle melody]\n\nthat melody.\n\nSo I did an arrangement.\n\n[plays cheerful idle melody]\n\nThat's when the strings come in. I had my...\n\n[plays arpeggios]\n\nI just had that idea to write a string orchestration.\n\nI wrote it in a taxi on the way to the studio.\n\nSo you just gotta listen to the recording.\n\nThat's all the questions. [upbeat groove music]\n\nJon Batiste signing off.\n\nI'm so glad that you are here, I hope you had fun.\n\n[plays arpeggio]\n\n[upbeat groove music fades]",
  "authors": [
    "Condé Nast"
  ],
  "url": "https://www.wired.com/video/watch/tech-support-jon-batiste-answers-piano-questions"
}