{
  "title": "Security startup Guardio nabs $80M from ION Crossover Partners",
  "text": "The internet today has a new worry. Alongside vibe-coding tools, and the codebases, sites, and apps built with them, security issues and blind spots have proliferated, too.\n\nCybersecurity company Guardio is taking aim at a fresh market born amid this flux: finding malicious code written using AI tools. The company says it has found that with AI tools, malicious actors now find it easier than ever to build scam and phishing sites as well as the infrastructure needed to run them.\n\nNow, Guardio is leveraging its experience building browser extensions and apps that scan for malicious and phishing sites to build a tool that looks for artifacts in code and websites made with vibe-coding tools.\n\nIt’s already found a buyer. Earlier this month, Lovable announced a partnership with Guardio to scan all websites made on its platform and weed out the ones that may pose threats to users. The deal came after a report highlighted that several sites built on Lovable had gaping security holes.\n\n“Everyone is racing for innovation and market capture. But security is kind of an afterthought. And not many AI tools are partnering with any cybersecurity company to make sure that content generated on their platform is secured and used for good,” Michael Vainshtein, the startup’s CTO, told TechCrunch.\n\nTo fund its expansion, the company has raised $80 million in a new institutional funding round led by ION Crossover Partners. Existing backers Union Tech Ventures, Vintage Investment Partners, and Emerge also invested.\n\nImage Credits:Guardio\n\nGuardio, founded in 2018 by Vainshtein, CEO Amos Peled, and chief architect Daniel Sirota, did not disclose its exact valuation, but it did say that it has tripled its valuation since its previous fundraise: a $47 million round led by Tiger Global in 2021. The company, however, said it doesn’t consider itself a unicorn yet.\n\nTechcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | WAITLIST NOW\n\nGuardio started as a browser extension that would monitor malicious sites and alert users about data leaks. Since then, it has added phishing protection, and built mobile apps that offer identity management, spam filtering, and scam protection. The company says today it has 500,000 paying users, and claims it reached $100 million in annual recurring revenue this year.\n\nGuardio is also launching new visibility features to tell users more about what documents they have shared publicly, and if they have any sensitive information, along with notifying you of accounts that don’t have multi-factor authentication. The startup said these features are based on enterprise Data Loss Prevention and SaaS Security Posture Management products.\n\n“We use so many services, and our data is so fragmented with so many security settings to deal with. We feel every consumer is an enterprise in itself,” Vainshtein said. “While we don’t want them to become security officers of their accounts, we want to offer capabilities of visibility into their accounts that enterprises have.”\n\nThe startup said it is working to let users plug its tool into Outlook and Facebook to surface more details on the security risks users might face in relation to these accounts.\n\nPeled noted that next year, the startup plans to bring some of the new visibility features to its free subscription plan.\n\nGilad Shany, founder and partner at ION Crossover, said that the investment firm had been monitoring the company for years, and even though Guardio was not actively fundraising, ION started a conversation with the company last year.\n\n“We have been investors in both the cyber and consumer markets, and have had multiple successful IPOs and exits. Guardio is the first company we invest in at the intersection of these two markets — having a team that can lead best-in-class cyber product innovation, while having intimate knowledge about how to scale a direct-to-consumer business,” Shany said.",
  "authors": [
    "Ivan Mehta",
    "Sarah Perez",
    "Julie Bort",
    "Lorenzo Franceschi-Bicchierai",
    "Ram Iyer",
    "Connie Loizos",
    "Anthony Ha",
    "Rebecca Bellan",
    "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var",
    "Media"
  ],
  "url": "https://techcrunch.com/2025/11/19/security-startup-guardio-nabs-80m-from-ion-crossover-partners/"
}