{
  "title": "The Best TVs We’ve Reviewed in 2025: Sony, Samsung, LG, and More",
  "text": "Honorable Mentions\n\nThere are so many good TVs available, we can't add them all to our top list. Here are some great options that either missed the cut or got knocked off our top list by their replacements.\n\nHisense U8QG: The U8QG is a great buy at its lowest price (around $1,000 for a 65-inch model) and a solid pick above that price, especially if you want eye-searing brightness above all else. I noticed some SDR color accuracy issues (some images looked way too red) and found it difficult to keep it from wildly over-brightening some content. Thankfully, you can always turn it down, and its nuclear power plant is paired with excellent black levels, deep contrast, and plenty of features. I actually prefer last year's similarly punchy U8N, but it's getting harder to find in stock.\n\nTCL QM7K (2025): I’ve had a love/hate relationship with the QM7K. Part of TCL's new Precise Dimming series, its opulent black levels and contrast reach toward OLED heights, matched by good brightness for some spectacular moments. The problem? My review model’s colors were off-kilter, with an odd green tint in select black and grayscale content. Thankfully, I confirmed that TCL's latest firmware update fixed the issue. The TV's picture processing and colors still don't catch premium TVs, and this is the second year in a row I've found a troubling performance issue with the QM7. You shouldn't buy it at full price, but if you can get the 65-inch model for $1,000 or less, it's a pretty enticing choice.\n\nSamsung S95D: Samsung's previous S95 matte-screen marvel is still a fabulous QD-OLED TV that would be adored in virtually any TV room. We like the newer version better, which begs fewer compromises when it comes to deep black levels, but if you can find the previous version on a killer deal, you won't be sorry.\n\nHisense U7N: If you’re after a TV at similar pricing to the QM6K but with some extra eye tingle, last year's Hisense U7N offers a serious brightness boost over our top pick and still ranks among our favorite options for your money. Its blooming control and screen uniformity aren’t as refined as the QM6K's but it’s got plenty of features, including great gaming credentials and a streamlined Google TV interface. It's still a great buy while stock lasts, especially at $700 or less.\n\nSony A95L: Sony finally replaced this sweet screen with the 2025 Bravia 8 II, which offers similarly incredible picture processing and upscaling alongside enhanced colors and higher HDR brightness. That shouldn't deter you from considering the A95L (9/10, WIRED Recommends) at a lower price. With fabulously immersive image quality and an intuitive Google TV interface, this is a premium package that's very enticing on a good sale.\n\nSony Bravia 7: The Bravia 7 is a gorgeous display, offering brilliant brightness, naturalistic colors, and suave finesse in the subtle details. Its biggest knock is very poor off-axis viewing, which could be tough to swallow at its high list price. Otherwise, it's worth considering for fans of that Sony glow, especially since Sony seems to be discounting its best QLED TVs much more liberally than its OLED models.\n\nOther TVs We’ve Tested\n\nSamsung The Frame Pro: I put the Frame Pro through our full review process and came away both in limbo due to software issues and (so far) unimpressed with the performance. The matte screen looks slick when displaying art, especially if you purchase one of the add-on frames (a frame for the Frame?) from Samsung or Deco TV Frames. Picture performance was otherwise middling at best. It's much brighter than the traditional Frame, and the colors pop, but its edge-lit mini-LED system does not look good with dark 4K HDR content, even in the day. Moreover, I had trouble with its very sluggish operating system (which others have reported) and stuttering Blu-ray playback. We're awaiting a second model, which we hope relieves the software issues, but steer clear for now.\n\nTCL QM7: There's only one thing holding back 2024's beautifully balanced QM7: a software glitch. During my review, I experienced an issue where adjusting SDR backlight levels affected HDR, which can lead to severe brightness limitations. While TCL fixed the issue in a firmware update for me, I never got confirmation on a broader OTA fix. Most folks probably won't have this issue, so the QM7 is still worth considering, but make sure and check it before throwing out the box.\n\nTVs We're Testing Next\n\nSamsung S90F: The follow-up to our favorite gaming TV could be among the best OLED values of the season (it usually is). I'll be long-term testing it over several weeks, so I should find every nook and cranny for an in-depth evaluation.\n\nPower up with unlimited access to WIRED. Get best-in-class reporting and exclusive subscriber content that's too important to ignore. Subscribe Today.",
  "authors": [
    "Ryan Waniata",
    "Parker Hall"
  ],
  "url": "https://www.wired.com/gallery/best-tvs/"
}