{
  "title": "El vórtice polar está a punto de causar un cambio drástico en los patrones del clima",
  "text": "CNN —\n\nMuy por encima del polo norte, en una parte de la atmósfera que rara vez se observa y se entiende aún menos, está en marcha una transformación. En los próximos 10 días, los cambios en la estratosfera alterarán los patrones del clima y prepararán el escenario para un diciembre frío y con nieve en partes del hemisferio norte.\n\nSignificará un cambio radical para algunas zonas de Estados Unidos que en este momento registran calor récord a solo una semana del Día de Acción de Gracias.\n\nTambién podría ser una de las primeras perturbaciones significativas del vórtice polar registradas desde el inicio de la era satelital.\n\nPiensa en el vórtice polar estratosférico como un muro de viento que contiene el aire ártico, gélido, sobre el polo norte. Cuando se debilita, el aire frío se desplaza hacia el sur, a lugares como los 48 estados contiguos, Europa y Asia.\n\nEn este momento, el aire en la estratosfera —la capa de la atmósfera por encima de donde ocurre la mayor parte del clima— se está calentando de forma rápida y pronunciada, en un fenómeno conocido como calentamiento súbito estratosférico.\n\nPero este calentamiento repentino en lo alto de la atmósfera no traerá calor. Está debilitando los vientos del vórtice polar, dijo Amy H. Butler, meteoróloga de la Oficina Nacional de Administración Oceánica y Atmosférica (NOAA), y hasta podrían invertirse.\n\nLos científicos aún intentan descifrar por qué ocurren estos eventos de calentamiento, y con razón: pueden desencadenar las irrupciones de aire frío más intensas asociadas al “vórtice polar” en Estados Unidos.\n\nEn las próximas dos semanas, estos cambios podrían comenzar a sentirse en Norteamérica, Europa y Asia, a medida que el vórtice polar se debilita y se desplaza hacia el sur, como un trompo que se frena y pierde estabilidad.\n\nUna característica inusual de este fenómeno es su momento: los calentamientos súbitos estratosféricos de esta magnitud casi no se ven en noviembre, dijo Judah Cohen, meteorólogo y científico investigador del MIT.\n\nAún no es seguro que llegue una gran tormenta invernal, pero los científicos vigilan si se desarrollan condiciones más frías de lo normal en las latitudes medias —donde reside la mayor parte de la población mundial— durante el próximo mes. Una vez que el vórtice polar se perturba, puede tardar un mes o más en recuperarse, dijo Andrea Lopez Lang, meteoróloga de la Universidad de Wisconsin-Madison.\n\nLo más difícil de predecir es dónde dará su golpe helado el vórtice polar, y los pronósticos de temperatura aún no lo incorporan por completo.\n\n“Podemos ver trayectorias de tormentas más activas y desplazadas, y aumentos en irrupciones de aire frío en regiones de todo el hemisferio norte”, dijo en un correo electrónico.\n\nButler y Lopez Lang afirmaron que tener pronósticos precisos sobre eventos del vórtice polar puede ayudar a mejorar los pronósticos de 7 a 10 días, algo útil para la toma de decisiones.\n\n“Aunque el vórtice polar estratosférico está a kilómetros sobre nosotros, a veces está conectado con nuestro clima a través de unos hilos invisibles que describimos con la dinámica y la termodinámica atmosférica”, explicó Lopez Lang.\n\nPor ejemplo, otros eventos del vórtice polar a inicios del invierno han sido seguidos por diciembres más fríos y con más nieve en Estados Unidos, dijo. Estos eventos tienden a generar una cresta de alta presión cálida sobre Alaska, lo que genera un descenso, o vaguada, en la corriente en chorro hacia el este. Esa vaguada puede introducir clima más frío y con más nieve en los estados del centro y partes del este de Estados Unidos.\n\nA pesar del impacto de estos eventos, los científicos están perdiendo parte de su capacidad de observación sobre esta capa de la atmósfera, dijo Lopez Lang.\n\nLos satélites son cruciales para observar la estratosfera y hacer predicciones sobre los calentamientos súbitos estratosféricos, señaló, y algunos de esos datos están desapareciendo a medida que los satélites envejecen y la NOAA toma decisiones presupuestarias y de programación que afectan la disponibilidad de mediciones actuales y futuras. Citó como ejemplo datos recientes que faltan de satélites en órbita polar.\n\n“La única manera en que realmente observamos estos fenómenos es mediante datos satelitales”, afirmó.",
  "authors": [
    "Andrew Freedman"
  ],
  "url": "https://cnnespanol.cnn.com/2025/11/19/clima-y-tiempo/vortice-polar-cambio-drastico-patrones-clima-trax"
}