{
  "title": "Hold an ice cube – and shake like a dog: therapists on 16 simple, surprising ways to beat stress",
  "text": "Most people contend with stress in some element of their lives. What can you do when you are overwhelmed by it and your coping mechanisms no longer seem to work? Here, psychotherapists share their techniques for managing in the moment, seeking help, and minimising everyday stress.\n\nRecognise the signs\n\n“When we are stressed, our body undergoes physiological changes as part of our fight or flight,” says Hannah Stebbings, an integrative therapist at Priory hospital Barnt Green in Birmingham. “We get increased heart rates, and then the stress hormones cortisol and adrenaline get released, and they flood our bodies.” This causes physical symptoms, such as headaches or issues with the digestive system, and then there is the emotional aspect: “You might notice that you’re feeling irritable, anxious, you’ve got low mood, lack of motivation: these are key signs that you are under a lot of stress.” This can mean people withdraw and avoid socialising, “or you might be a bit more snappy with your friends, partner, children, colleagues.”\n\n“Everyone experiences stress,” says Lauren Baird, a psychotherapist from Glasgow, “whether it is a boss that triggers you or financial stress. Even if you eliminate the stressor, you are still going to have stress hormones that course through your body and need to be discharged. What is important is how we respond.” She gives the example of her three-year-old having a tantrum, which causes her to feel stressed. If she can get out for a vigorous 20-minute walk, this will help her to feel better. “Dealing with the stressor, the problem itself, is different from dealing with the stress, which is the physiological response in your body,” Baird says. Stress that isn’t dealt with will live on in your body, she adds. “I talk a lot about nervous system regulation as a core foundation. People think stress has become a part of who they are, but they aren’t tuned into their bodies.”\n\nKnow when to get help\n\nView image in fullscreen Talking therapies can be accessed via your GP. Photograph: Natalia Lebedinskaia/Getty Images\n\nIf you feel overwhelmed by stress, it is important to get professional help, says Stebbings. “There are NHS talking therapies for anxiety and depression. These can be accessed via your GP, which is always a good place to start if you are ever in need of support. The Hub of Hope online directory created by the charity Chasing the Stigma is a really valuable tool, signposting people towards relevant mental health services in their area. If someone is experiencing a mental health crisis and does not feel safe, they should call 999 immediately.”\n\nIf you can’t access therapy, speak to a friend\n\nUnfortunately, therapy is not always accessible. If this is the case, find someone you trust to talk to. Perhaps a relative, friend or colleague, who is “willing to sit and have a coffee and a conversation: that will do wonders for your mental health,” says Niro Feliciano, a psychotherapist in Wilton, Connecticut.\n\nAside from helping you to unload your worries, social connections also help us to de-stress, says Baird: “We are more isolated than ever, and we know that this causes significant stress. Being social creatures, we really need connection to thrive.”\n\nFocus on your breath\n\nView image in fullscreen Activate your parasympathetic system … Photograph: Tim Robberts/Getty Images\n\nWhen you are in a moment of intense stress, “breathwork is really important,” says Feliciano, who teaches the importance of longer exhalation for emotional regulation. This stimulates the vagus nerve, a key part of the parasympathetic system, which regulates involuntary functions like breathing and heart rate. “We have powerful scientific evidence to show that breathing affects emotion and it also frees up our centre of fear and aggression, the amygdala. It takes us out of that processing centre and brings us back into the prefrontal cortex, where we can logically think through things and we have better executive functioning. All of that shuts down when we’re stressed.”\n\n“The 4/7/8 breathing technique is a quick way of activating your parasympathetic nervous system, which is our soothe system,” says Stebbings. “Take a deep breath for four, hold your breath for seven seconds, then breathe out as if you’re blowing out candles for eight.”\n\nTell yourself you are having a feeling\n\n“When we are stressed, the brain jumps to worst case scenarios,” says Stebbings. She uses a technique called “cognitive restructuring” with clients to challenge those unhelpful thoughts. When you have a negative thought, Stebbings advises to ask yourself, “What is the evidence for and against this thought?” and then reframe it by looking at it in a more balanced way. “Ask yourself, ‘What would you say to a friend if they were feeling like this?’”\n\nSomething else Stebbings uses, including in her own life, is called “I’m having a thought that …”. “When we notice we are feeling stressed, we say to ourselves, ‘I’m having a thought that … I can’t cope’, for example. This small phrase lets you step back and it creates distance between yourself and the thought.”\n\nMake a list\n\n“Often, when people are stressed, they are trying to remember everything that they have to do and this wastes a lot of neuro energy,” says Feliciano. “When we prioritise what we see on a list, it feels a little less overwhelming than if we’re trying to remember those things, and then when we cross them off, we get a hit of dopamine, which affects our motivation and productivity.”\n\nListen to music\n\nMusic evokes emotion and can calm and alter mood by soothing our nervous system, says Stebbings: “Music serves as a powerful tool to reduce stress. We can listen to a song and it might take us back to a happy memory.” She also recommends listening to meditation music or a guided visualisation: “That can help to reduce stress rapidly.”\n\nSplash your face – or have a cold shower\n\nView image in fullscreen Shock your body into a different state. Photograph: Anton Vierietin/Getty Images\n\nCold water can be helpful if you are feeling panicky to shock the body into a different state, explains Stebbings: “It activates the parasympathetic nervous system, so after the initial shock, your body naturally shifts into a calming mode, which slows down the heart rate and helps you to feel more grounded. Second, it breaks the stress cycle. Cold exposure gives the brain a strong sensory signal that can interrupt spiralling thoughts, worry and overwhelm.” You can also achieve this by holding an ice cube in your hand or splashing your face with water. You could even have a cold shower – Stebbings suggests building this up slowly, starting with a few seconds of cold, then gradually progressing to a minute or two. “Cold water therapy teaches your nervous system to cope with discomfort in a controlled way. Over time, it reduces stress sensitivity, increases emotional stability and gives you a reliable physical tool to calm your system when your mind feels overloaded.”\n\nThink about your gut\n\nWhat kind of diet can help to reduce stress? “Cut down on processed foods and sugar,” says Feliciano. “Eat the rainbow: fruits, vegetables, whole grains.” Women over 40 should look at their protein intake, she adds.\n\n“Balanced meals can really help to stabilise blood sugars and your mood,” says Stebbings. “Everyone thinks that serotonin is all in your brain, but your gut actually holds about 95% of your serotonin. What you put in your body is going to have an impact, because the vagus nerve is an axis between your mental health and your gut health.”\n\nPrioritise sleep hygiene\n\n“Sleep is like your body’s reset button,” says Stebbings. “You need to be getting seven to nine hours of sleep a night.” Try to implement a regular sleep routine to achieve this. “Go to bed around the same time. You need to have that consistent sleep routine, because poor sleep amplifies stress hormones.”\n\nMove or shake your body\n\nView image in fullscreen Moving releases endorphins. Photograph: DGLimages/Getty Images\n\n“I teach all my clients to actually meet the survival (fight/flight) energy where it’s at and give themselves a right good shake like a dog shaking off water,” says Baird. “This helps to release some of that pent-up stress.”\n\n“Moving releases endorphins,” says Stebbings. “Even if you just do a quick five minutes of star jumps, moving your body, shaking your body, just getting that movement, really promotes healthy emotions and reduces stress.”\n\nConsider your phone use\n\n“Screens and social media are part of the reason we are burning out quicker,” says Feliciano. “Because we get such high hits of dopamine from screens, the body is trying to bring it down to physiologically healthy levels, and to do that, it has to actually bring it quite low to compensate. In that low state is where we are experiencing more symptoms of anxiety and depression. I think that is why we’re becoming more reactive: we don’t feel like we have the strength or resilience to deal with things because there is a battle in our neurochemistry, and it’s related to our screen usage.”\n\nHow can you get around this? “Put your phone on grayscale mode,” says Feliciano. “That will not give you the hits of dopamine that you want. I had some student interns do that, and one said, ‘I got mad, because all of a sudden it was boring.’ I said, ‘Well, we would call that withdrawal.’ I think a big piece of our mood regulation is setting those digital boundaries.”\n\nBaird recommends the screentime app Opal to limit phone usage. “It is also helpful to think about why you are scrolling. What purpose does that serve?” She says that people use phones, alcohol or food to distract from dealing with stressful emotions. When you have identified what you are scrolling for, you can look to create a healthier relationship with your phone. A good starting point is not having it in your bedroom at night, says Baird: “An hour before bed you shouldn’t be on your phone, in terms of the blue light and the impact it has on sleep. Realistically, I say to my clients to have absolutely no screen time half an hour before bed.”\n\nBe mindful\n\nView image in fullscreen ‘Be present in the here and now.’ Photograph: Halfpoint Images/Getty Images\n\n“Instead of worrying about the past or thinking about the future, try to be really mindful and present in what you’re doing in the here and now,” says Stebbings.\n\nAsk yourself if you have made time for anything that you enjoy, says Feliciano. “And do you actually have the motivation to do those things? If I’m talking to someone and they’re looking at things in the past that have brought them joy, but there’s no desire for them in the moment, then we’re looking at something that may look more like clinical depression, in which case we need a bigger intervention.”\n\nGet creative\n\nBaird says taking up a creative hobby is a brilliant stress reliever: “Art, music, writing, dancing in your kitchen – any kind of creative activity.” But, she warns: “It is really important that it is not about creating something that you can put out into the world; you’re not creating it for the purpose of achieving something. You’re just creating it for the process itself.”\n\nHave a laugh\n\nView image in fullscreen Spend time with people who make you laugh. Photograph: Tim Robberts/Getty Images\n\n“Go see comedy, watch something that makes you properly belly laugh, or spend time with people who make you laugh uncontrollably,” says Baird, adding, “It’s got to be deep and genuine.” Sharing laughs with friends increases your connection with them and creates a physiological release that completes the stress cycle, she says.\n\nSet boundaries\n\nChristmas can be a fairly frazzling time of year. To avoid burnout, Feliciano, who has written a whole book – All Is Calmish: How to Feel Less Frantic and More Festive During the Holidays – on the subject, advises to ask yourself what are your priorities this season. “Once we have that list, it becomes a little easier to say no to the things that are either going to make us feel depleted, exhausted or resentful. Pick the three things you really want to guard and be present for,” Feliciano says, then decline anything that will threaten your enjoyment of them. This can be hard, she admits: “I still fight this. I’m a therapist, and I have all these tools, but the struggle is real. What people will be surprised at is that we can do less and still feel joyful. Actually, if we do less, we might even feel more joyful.”",
  "authors": [
    "Sarah Phillips"
  ],
  "url": "https://www.theguardian.com/lifeandstyle/2025/nov/20/hold-an-ice-cube-and-shake-like-a-dog-therapists-on-16-simple-surprising-ways-to-beat-stress"
}