{
  "title": "John C Reilly wants to win hearts in Mister Romantic, a show that’s truly lovable",
  "text": "In one of Hollywood’s nicer ironies, character actor John C Reilly finally made it big with a song about being invisible. His Oscar-nominated performance as the duped and devoted schmuck Amos Hart in Kander and Ebb’s Chicago was defined by his solo, Mister Cellophane. Director Rob Marshall had him sing it in an empty theatre so Amos doesn’t even get an audience for his big number.\n\nMore than 20 years later, Reilly has dusted off a not dissimilar tailcoat and rouged his cheeks once more under a new moniker, Mister Romantic, and this time there’s a full house. Backed by a four-piece band he is here to win our hearts with 90 minutes of jazz standards and popular songs, plus the odd chanson and comic verse. After a dozen or so dates in the US, the show has a short run this week in London at Soho Theatre Walthamstow, whose beautifully restored interior and history as a music hall fits Mister Romantic like a glove.\n\nIt’s vaudeville with the gentlest hint of grand guignol. The band wind their way through the auditorium, Charles De Castro doing double duty on accordion and cornet, opening with Tom Waits’ instrumental Just Another Sucker on the Vine. They proceed to drag our host on to the stage concealed inside a trunk. When he climbs out, hair like Shock-Headed Peter, he professes not to know the day of the week, his location or even his band. But if just one of us will love him for ever, he won’t have to go back in the box.\n\nView image in fullscreen Steve Coogan and John C Reilly in the 2018 film Stan & Ollie. Photograph: Bbc Films/Allstar\n\nAnd so the seduction begins. Reilly starts off with Pretend, a hit for Nat King Cole in 1953, its melancholic optimism here re-spun as if to honour the theatre audience’s role in all of this: “And if you sing this melody / You’ll be pretending just like me / The world is mine it can be yours my friend.” It’s a kind of promise: submit to the show and you won’t regret it.\n\nIn between the lyrics Reilly drifts around the stage with some silent clowning that brings back memories of his Oliver Hardy on screen, opposite Steve Coogan’s Stan Laurel, in their film about the double act’s 50s variety hall tour. As Mister Romantic lights up an invisible cigar, blows smoke rings and hulas inside them, he can’t conceal a smile at the whimsy. And who can blame him? Then it’s on to Irving Berlin’s Blue Skies, with Reilly miming the song’s bluebirds as if he’s a grizzled Snow White.\n\nThe tone of the evening is equal parts wide-eyed ingenuity and seasoned world-weariness. He’s a kind of eternal troubadour and a gag on the show’s website lists tour dates going back to 1590 at London’s Globe (nine years before it was actually built) and the night before the famous 1903 fire at Chicago’s Iroquois theatre. Mister Romantic is apparently as ageless as his set list is timeless. But his innocent air also brings to mind Buddy the Elf, played by his Step Brothers co-star, Will Ferrell.\n\nView image in fullscreen Jack White as Elvis Presley with John C Reilly in Walk Hard: The Dewey Cox Story (2007). Photograph: Columbia Pictures/Sportsphoto/Allstar\n\nStep Brothers gave Reilly a couple of goofy throwaway songs, as did several of the comedies he made at the time, but his lead role in Walk Hard: The Dewey Cox Story relied on his prowess as a singer. The spoof music biopic about Cox’s bid to become a “double great” singer, after the unfortunate death by machete of his brother, rattles through pastiches of Johnny Cash, the Beatles and beyond, with Reilly’s musicality helping the jokes land.\n\nMost of Mister Romantic’s songs are done straight, his band (completed by Davíd Garza on piano and guitar, Gabe Witcher on violin and David Piltch on bass) wearing sombre expressions. But he gets all loosey-goosey on Earl Okin’s eccentric come-on, My Room, matching the bluesy humour with lascivious gestures. That’s a welcome gear change in a show that cleaves just a little too closely to one register and misses the more unvarnished emotion of the other Waits tracks featured on Reilly’s album.\n\nOn screen, some of Reilly’s musical highlights have been duets – see his cowboy pardnership with Woody Harrelson in Robert Altman’s swansong, A Prairie Home Companion. Mister Romantic sings instead on his lonesome, save for recruiting us as backing singers and riffing with the audience as he seeks out someone – anyone – to love him. The crowd work, done with a red rose microphone, is carefully managed and Reilly’s features are captivating in closeup – that face, halfway to its own caricature, veers from smitten to crestfallen as Mister Romantic is rejected time after time.\n\nThis feeds into the drama of the songs when, for example, he dedicates You Don’t Know Me (written by Eddy Arnold and Cindy Walker) to those individuals – the song veering from the usual unrequited loyalty to the scorn of a spurned suitor. It’s a clever concept: here is a singer of soul-baring songs whose heart is broken by his own audience.\n\nAll shades of love are here: pining and enduring, effortless and hopeless, yet none of it to ever be regretted or fully extinguished. “You and the song are gone / But the melody lingers on,” he sings as it approaches the end of the evening, another nod – like that opening number – to the alchemy between performer and audience.\n\nReilly dreamed this enchanting show up after he “looked at our weary world a few years ago and tried to think of a way I could spread love and empathy”. It’s rare to feel that songs are being delivered straight to you but that’s what he achieves – never mind the goofing – through his unquestionable sincerity. “Hope I didn’t take up too much of your time,” mumbled Amos at the end of Mister Cellophane. On the contrary: I could have kept listening right through the night.",
  "authors": [
    "Chris Wiegand"
  ],
  "url": "https://www.theguardian.com/stage/2025/nov/18/john-c-reilly-mister-romantic-a-show-thats-truly-lovable"
}