{
  "title": "Saad Ibrahim Almadi: Son of US citizen held in Saudi Arabia says Trump administration secured his father’s return home",
  "text": "The son of a United States citizen held in Saudi Arabia for criticizing the Saudi government said Wednesday the Trump administration secured his father’s release and thanked US officials for helping bring him home.\n\n“They really delivered when it comes to my father’s situation. I understand Saudi Arabia is supposed to be our ally regime to us, but they’ve been mistreating us for a while now. And finally, they are correcting the course when it comes to my father’s situation,” Ibrahim Almadi told CNN’s Erin Burnett on “OutFront.”\n\nHis father, Saad Ibrahim Almadi, a US-Saudi dual national, was given a 16-year sentence for tweets critical of the Saudi government in 2022. He was released in 2023 but remained in Riyadh under a travel ban. His son insisted at the time that his father would not be free until he was in the US.\n\nCNN has reached out to the State Department and the White House for comment.\n\nIbrahim Almadi during an interview with CNN. CNN\n\nNews of Almadi’s release came as President Donald Trump appeared at a US-Saudi investment conference in Washington, DC. Trump, who has actively sought to cultivate his relationship with Saudi Arabia in his second term, hosted a lavish state visit on Tuesday for Crown Prince Mohammed bin Salman on Tuesday, who the president praised for what he called an “incredible” record on human rights.\n\nIbrahim Almadi told CNN that his father was told his release was “a forgiveness from the king and crown prince.” Asked if his father’s release was connected to the state visit this week, Almadi said, “Absolutely. It’s crystal clear to me that, Mr. President, without him, my father wouldn’t be released. I’m quite thankful for the Trump administration and the Department of State.”\n\nThe Almadi family confirmed in a statement posted to X earlier Wednesday that Saad Ibrahim Almadi was on his way home to the United States, noting “This day would not be possible without President Donald Trump and the tireless efforts of his administration.”\n\n“Thank you to everyone who stood by us during this horrific ideal,” the family said. “We hope the support and care we received will continue for those still held hostage in Saudi Arabia and in other parts of the world.”\n\nCNN’s Kylie Atwood, Kevin Liptak, Mostafa Salem and Celine Alkhaldi contributed to this report.",
  "authors": [
    "Piper Hudspeth Blackburn"
  ],
  "url": "https://www.cnn.com/2025/11/19/politics/saad-ibrahim-almadi-saudi-arabia-returns-to-us"
}