{
  "title": "BBC campaign in Birmingham backing homegrown storytelling starts",
  "text": "BBC campaign backing homegrown storytelling starts\n\n10 hours ago Share Save Andrew Dawkins West Midlands Share Save\n\nBBC Steven Knight said Birmingham was \"a place I'm proud to call my home\"\n\nThe creator of hit TV drama Peaky Blinders says a BBC campaign advertised on 100 billboards and posters in Birmingham shows \"how important it is to see our hometowns reflected on our screens\". The Made Of Brum campaign is under way and Steven Knight said his home city of Birmingham, where he has developed Digbeth Loc Studios, has been central to shows like This Town. The posters are part of the BBC's national Made Of Here series designed to celebrate the corporation's commitment to support homegrown storytelling. It said it signed a memorandum of understanding (MOU), which would ensure BBC network TV production spending in the West Midlands rose from £24m to £40m a year by the end of 2027.\n\nKay Wright, head of BBC Midlands, said the campaign underlined the BBC's ongoing commitment to the city \"making great content for audiences to enjoy\". She said Silent Witness, which was now produced in the city, had just finished filming series 29, which would be aired on 27 December.\n\n'The storytelling is here'\n\n\"Masterchef, the first series of Celebrity Masterchef to be made here in Birmingham is now on our screens this week... it's unmissable,\" she said. \"Of course we've commissioned two new series of everybody's favourite, Peaky Blinders.\" Two new daytime dramas had also been commissioned - Hairdresser Mysteries starring Sally Phillips and The Detection Club, which brings together crime writers to solve real-life crimes. The BBC's new home at the Tea Factory was on schedule to be completed by the end of 2027-28 in Digbeth, \"the new creative cultural powerhouse that is really putting Birmingham and the West Midlands on the map\". \"We know the skills are here, the creativity's here, the storytelling is here. That's what Made of Brum is all about,\" she added.\n\nFozia Fazil, from Birmingham, participated in series three of The Traitors\n\nThe corporation stated that earlier this year it signed the second MOU with the West Midlands Combined Authority and Create Central, a private sector-led industry body established by the authority, as part of the BBC's Across the UK strategy. Guz Khan of the Bafta-nominated comedy Man Like Mobeen, Cillian Murphy, who plays Tommy Shelby in Peaky Blinders, and the late Ozzy Osbourne are featured on the billboards. The documentary Sharon and Ozzy Osbourne: Coming Home follows the last chapter of Ozzy's life, as he prepares to come back to live in the UK and return to his hometown for a final performance with Black Sabbath. Birmingham is home to various BBC outlets including local station Radio WM, Midlands Today regional TV, Radio 4's The Archers, the Asian Network station, Newsbeat and 1Xtra radio shows, as well as the West Midlands' local online news team supported by the BBC Verify and data journalism teams.\n\nThe Bullring bull had the words Made Of Brum on it\n\nKnight said the city where he grew up was \"a place I'm proud to call my home\". \"I've always been drawn to creating stories about Birmingham. \"I believe that a city is made of its people and that's something I've tried to reflect in my writing.\" He added that historically Birmingham was \"the workshop of the world and now we have a new opportunity to be leaders in technology and media\". \"Made Of Brum is all about the power of place and how important it is to see our hometowns reflected on our screens. \"It helps us feel good about ourselves and good about our place – and more connected to each other.\" Peaky Blinders will return to the BBC in the UK and will be available globally on Netflix, as executive producer Knight tells the story of a new generation of Shelbys in two new series to be filmed at Digbeth Loc Studios. Brummies were called upon at the Bullring on Thursday to share their thoughts about what makes the city unique and their messages were added to a so-called What's Brum Made Of? wall.",
  "authors": [],
  "url": "https://www.bbc.com/news/articles/cx2l2gd7gr5o"
}