{
  "title": "Thanksgiving forecast: Where the weather could mess with your travel plans",
  "text": "Thanksgiving is a week away and more than 80 million Americans are planning to travel at least 50 miles from home. But the weather has the potential to disrupt their visits with family and friends.\n\nMost of those travelers — 73 million — are expected to hit the road with about 6 million set to take to the skies, according to estimates from AAA.\n\nThere are no major storms on the horizon in the run up to Thanksgiving, so the overall potential for major weather-induced disruptions is lower than recent years, but pockets of wet and windy weather could still cause less-widespread issues.\n\nHere’s what Mother Nature is serving up over the next several days. To make it easier to skim, we’ve rated potential disruptions each day on a scale of 1 — minimal issues — to 5 — impossible travel.\n\nThis weekend\n\nDisruption potential: 2 out of 5\n\nA look at the potential weather on Saturday. CNN Weather\n\nSaturday will be rainy at times for parts of the East, especially early. Rain isn’t likely to be heavy enough to cause problems on its own, but it could prompt some slow-going road travel. The dreary weather could also lower visibility at times, potentially causing delays at large airport hubs in Washington, DC and Baltimore.\n\nOn the other side of the country, a storm will bring wet weather to parts of Southern California and the Desert Southwest on Saturday as it tracks near the US-Mexico border. It will be a soggy travel day for places not used to it, like San Diego and Phoenix.\n\nA look at the potential weather on Sunday. CNN Weather\n\nThat same storm will continue tracking east on Sunday, bringing wet weather to lower elevations and perhaps some snow to mountainous areas of the Four Corners region. Rain will also start to push into the Southern Plains during the day but will likely get heavier overnight.\n\nA separate storm will bring rain to parts of the Pacific Northwest Sunday with some high elevation snow possible, especially later in the day and overnight.\n\nMonday\n\nDisruption potential: 3 out of 5\n\nA look at the potential weather on Monday. CNN Weather\n\nSoaking rain is possible in the Southern Plains, especially in much of Texas and parts of southern Oklahoma. This rain could be heavy enough to cause flooding issues.\n\nDallas is under a Level 2 of 4 risk of flooding rain Sunday and Monday, according to the Weather Prediction Center. Heavy rain and low clouds could be major pain points for travelers flying out of Dallas Fort Worth International Airport.\n\nTravelers in the East have better conditions expected — largely dry and not very windy. Much of the West is in a similar position except for some lingering rain and high-elevation snow in the Pacific Northwest.\n\nTuesday\n\nDisruption potential: 2 out of 5\n\nA look at the potential weather on Tuesday. CNN Weather\n\nThe forecast gets a little trickier to pinpoint by Tuesday. It’s likely that a stretch of wet weather develops in the central US, moves through the Mississippi Valley, and then into parts of the East.\n\nBut exactly which areas record rain and exactly how much falls is still coming into focus. It depends on whether Monday’s Pacific Northwest storm merges with the storm in the southern Plains.\n\nIf the two storms merge, rain and low clouds are possible from Texas and Louisiana up through the Midwest early in the day. That could disrupt flights headed through hubs in Chicago, Minneapolis and St. Louis.\n\nWet weather could spread into parts of the Appalachians by the afternoon while breezy conditions develop over the Great Lakes. Winds could increase further if the merged storm strengthens.\n\nSome snow also cannot be ruled out in the Dakotas and northern Minnesota as the storm pulls colder air south from Canada.\n\nIf the storms stay separated, however, it could remain dry in Chicago and Minneapolis with rain concentrated more in the lower and middle portions of the Mississippi Valley. This scenario is becoming less likely.\n\nWednesday\n\nDisruption potential: 2 out of 5\n\nA look at the potential weather on Wednesday. CNN Weather\n\nA large portion of the central US appears to be dry for last-minute Thanksgiving travels as storm-suppressing high pressure takes over. There could be trouble spots closer to the West and East coasts.\n\nA push of rain and high elevation snow could slow some travel from the Pacific Northwest into the northern Rockies.\n\nDisruptive weather could unfold in the East too, but exactly how widespread it is and how long it lasts depends on how Tuesday’s storms play out. Parts of the mid-Atlantic and Northeast could have to navigate wet, cloudy weather during the day. A mix of rain and snow is possible in northern New England, especially later in the day.\n\nIt’ll get windier throughout the day, regardless of how wet it is. Breezy to borderline windy conditions could cause some flight disruptions in major metro airports from Washington, DC, to Boston. Similar conditions – along with potentially some snow – could also impact the Great Lakes and cause issues for Chicago’s airports.\n\nThanksgiving:\n\nDisruption potential: 1 out of 5\n\nA look at the potential weather on Thursday. CNN Weather\n\nAs if on cue, much of the country looks to dry out for Thanksgiving Day. The exceptions could be in the Great Lakes due to some lake-effect snow, parts of the Rockies with lingering snow and perhaps the Southeast from some rain.\n\nChilly but seasonable temperatures are expected for much of the central and eastern US. The day could end up being a little toasty for parts of the West and areas along the Gulf Coast.",
  "authors": [
    "Mary Gilbert",
    "Cnn Meteorologist"
  ],
  "url": "https://www.cnn.com/2025/11/20/weather/thanksgiving-weather-forecast-travel-climate"
}