{
  "title": "Mundial 2026: estas son las tres selecciones de mayor y menor valor de mercado del torneo",
  "text": "CNN Español —\n\nLa Copa del Mundo 2026 ya empieza a tomar forma, a poco más de medio año del inicio de la justa mundialista que se celebrará en Canadá, Estados Unidos y México, cuya inauguración se realizará el 11 de junio en el Estadio Azteca, en la capital mexicana.\n\nCon el sorteo del repechaje intercontinental y la repesca de la UEFA ya realizados, solo falta definir los seis últimos boletos para completar el listado de 48 selecciones que participarán en este Mundial, que será, de por sí, histórico, dada la cantidad de participantes.\n\nEsta ampliación en el número de selecciones dejó aún más en evidencia una brecha que siempre genera conversación, la que existe entre las selecciones con las plantillas más caras y las más humildes. Claro que no existe algo como un valor único para cada futbolista, pero Transfermarkt, la página especializada en el valor de los jugadores y equipos, da un buen punto de referencia.\n\nLas selecciones de mayor valor de mercado\n\nInglaterra\n\nLa selección inglesa encabeza la lista como la plantilla más costosa del Mundial y del planeta, con un valor cercano a los US$ 1.490 millones.\n\nSu riqueza futbolística se refleja en tres figuras que dominan el mercado global:\n\nJude Bellingham (Real Madrid) – cerca de US$ 210 millones.\n\nBukayo Saka (Arsenal) – poco más de US$ 160 millones.\n\nDeclan Rice (Arsenal) – apenas por debajo de los US$ 140 millones.\n\nCon una generación poderosa, con integrantes establecidos tanto en Inglaterra como en las otras mejores ligas del mundo, Inglaterra llega a 2026 con un plantel que ilusiona.\n\nLa selección inglesa previo al inicio de su partido ante Serbia. Ben Stansall/AFP via Getty Images\n\nFrancia\n\nLa potencia europea y bicampeona del mundo ocupa el segundo puesto, con un valor que ronda los US$ 1.465 millones.\n\nSu tridente más valioso incluye:\n\nKylian Mbappé (Real Madrid) – casi US$ 210 millones.\n\nMichael Olisé (Bayern Múnich) – ligeramente debajo de US$ 150 millones.\n\nHugo Ekitiké (Liverpool) – cerca de US$ 100 millones.\n\nFrancia mantiene una base sólida y joven que la coloca como una de las grandes candidatas a dominar el Mundial de Norteamérica.\n\nLa selección francesa celebra su clasificación a la Copa del Mundo. Franck Fife/via Getty Images\n\nEspaña\n\nLa campeona de Sudáfrica 2010 completa el podio con una plantilla cuyo valor supera los US$ 1.400 millones.\n\nSu futuro inmediato está en manos de tres joyas formadas en casa:\n\nLamine Yamal (Barcelona) – más de US$ 230 millones, el futbolista más caro del mundo.\n\nPedri (Barcelona) – ligeramente superior a los US$ 160 millones.\n\nPau Cubarsí (Barcelona) – ligeramente superior a los US$ 92 millones.\n\nEspaña combina talento precoz con una generación que ya domina en las grandes competiciones europeas.\n\nLa selección española previo al inicio de su enfrentamiento ante Turquía. Juan Manuel Serrano/Getty Images\n\nLas selecciones de menor valor de mercado\n\nEn la otra cara de la moneda se encuentran selecciones que celebran su clasificación como un triunfo histórico. Plantilas cuyo valor económico no compite con las potencias, pero que llegan al Mundial con ilusión, espíritu y un proyecto que busca sorprender.\n\nQatar\n\nLos anfitriones del Mundial anterior tienen la plantilla menos valiosa de la próxima edición (al menos por ahora), con un valos apenas superior a los US$ 10 millones.\n\nSu futbolista más caro es Meshaal Barsham, de el Al-Saad SC, con un valor cercano a US$ 1 millón.\n\nCon una generación en renovación y Julen Lopetegui como director técnico, Qatar buscará recuperar protagonismo después de un 2022 bastante discreto en casa.\n\nNueva Zelandia\n\nConstantes en el fútbol oceánico, pero aún lejos del nivel de las grandes potencias, los neozelandeses son la segunda plantilla menos valiosa: poco más de US$ 16 millones.\n\nSu jugador mejor cotizado es Marko Stamenic, con un costo cercano a los US$ 3,5 millones. Cabe destacar que Chris Wood, del Nottingham Forest, está valuado en más de US$ 11,5 millones, pero no ha sido convocado por lesión. Su presencia elevaría notablemente el valor del plantel.\n\nJordania\n\nLos asiáticos disputarán su primer Mundial en la historia y, como es de esperarse en un país sin una profunda tradición futbolística, cuentan con la tercera plantilla menos valiosa, por debajo de los US$ 18 millones.\n\nSu figura principal es Mousa Tamari, del Stade Rennais de la Ligue 1, con un valor cercano a US$ 7 millones.\n\nJordania llega como una de las grandes historias de clasificación del torneo.\n\n¿La disparidad económica será un factor en el Mundial?\n\nLa diferencia en el valor de mercado de las plantillas es enorme. Desde selecciones que superan los US$ 1.400 millones de dólares hasta los que no alcanzan los US$ 20 millones. Sin embargo, la historia de la Copa del Mundo demuestra que el fútbol no siempre obedece a la lógica del mercado.\n\nHabrá equipos con estrellas de élite y otros con jugadores un tanto desconocidos, pero todos llegarán al Mundial con la misma ambición: la de hacer historia en el escenario más importante del mundo.",
  "authors": [
    "Rodrigo Estrada"
  ],
  "url": "https://cnnespanol.cnn.com/2025/11/20/deportes/mundial-2026-selecciones-mejor-peor-valuadas-orix"
}