{
  "title": "The Death of Marat: Unlocking the complex clues hidden inside art history's 1793 true crime masterpiece",
  "text": "The two quills\n\nCompounding that friction between the restless flux and sombre stillness of Marat's discrepant hands is David's seemingly redundant decision to insert into the stripped-down scene not one ink-dipped quill, but two. Between the lifeless fingers of his right hand, Marat pinches a writing feather, still wet with ink. Follow its shaft upwards from the floor, past the white plume, to the upturned crate that Marat was using as a desk, and we discover a second quill lying beside the crouching inkpot. This quill's dark nib points menacingly in the direction of the fatal stab wound, and poses a pointed question: was it a knife that killed Marat or words? In times of heated politics, it is never clear which is mightier, the pen or the sword. As we'll see, in David's painting the quill and blade are themselves doppelgängers. They sharpen each other.\n\nThe two letters\n\nOnce detected, the doubling of evidence in the painting suddenly multiplies. Side-by-side at the centre of the canvas we find not one letter but two, each composed by a different hand. Between the lines of these two documents, the entire plot of the painting is written. The note that Marat clutches in his left hand is positioned by the artist in such a way that we can easily read how Corday, unknown to Marat, baited him into inviting her in, and took advantage of his benevolent nature: \"It is enough that I am very unhappy\", Corday disingenuously pleads in her letter, \"to have a right to your kindness.\" The message is clear: it is Marat's kindness that killed him.\n\nMarat assassiné/Musées royaux des Beaux-Arts de Belgique (Bruxelles At the centre are letters – between the documents, the plot of the painting is written (Credit: Marat assassiné/Musées royaux des Beaux-Arts de Belgique (Bruxelles)/J Geleyns)\n\nJust below Corday's letter, teetering on the edge of the box, is another missive composed by Marat himself – the document he was apparently writing when she struck. This note is held down by an assignat (or revolutionary money), thought by scholars to be the first-ever depiction of paper currency in Western art. In his letter, Marat selflessly pledges five livres to a suffering friend of the Revolution: \"that mother of five children whose husband died in defence of the fatherland\". Even in death, we're told, Marat bleeds generosity.\n\nThe two women\n\nThe two letters do more than draw the axes of luring and lying, kindness and redemption, against which the painting's story twists. The two letters conjure ghosts – two of them. First is Corday's, the conniving assassin who slipped into Marat's home with a long knife beneath her shawl. The second, also unseen, is that of the suffering widow whom Marat was intent on helping, whose husband died fighting for the Republic. The face-off between female forces, one personifying good and the other evil, has a long tradition in art history. For centuries artists have staged the struggle between saintliness and sinfulness as a bitter contest between strong women. Renaissance artist Paolo Veronese's famous Allegory of Virtue and Vice, c 1565, portrays one woman beckoning Hercules towards honour while another, a long knife hidden behind her back, tempts him towards pleasure. David updates the allegory for the era of Revolution. In The Death of Marat, it is the soul of a nation that is at stake.",
  "authors": [],
  "url": "https://www.bbc.com/culture/article/20251028-the-death-of-marat-unlocking-the-complex-clues-hidden-inside-art-historys-1793-true-crime-masterpiece"
}