{
  "title": "Justice Department is investigating handling of Adam Schiff mortgage fraud probe led by Ed Martin and Bill Pulte",
  "text": "The Justice Department is investigating whether people impersonated federal agents in mortgage fraud probes of prominent Democrats, a development that could complicate efforts to prosecute political enemies of President Donald Trump, people briefed on the matter told CNN.\n\nThe new probe led by the Maryland US Attorney’s Office and the Federal Housing Finance Agency inspector general is examining the handling of the mortgage fraud investigations into California Democratic Sen. Adam Schiff and New York Attorney General Letitia James, according to sources.\n\nOne witness in the Schiff matter, a Republican from California named Christine Bish, said she traveled to Greenbelt, Maryland, on Thursday morning in response to a grand jury subpoena. Bish said she spoke to federal investigators inside the courthouse who asked her about people who told her they were working with Trump administration officials leading the mortgage probes.\n\n“They’re investigating each other,” Bish later told CNN in a telephone interview. “It’s stupid.”\n\nThe subpoena Bish received demanded she give to the prosecutors in Maryland any communications she had with “any person or persons claiming to be” working under the Federal Housing Finance Director Bill Pulte, the Justice Department official Ed Martin, or others “claiming to be acting at the direction or request” of them or their offices, according to the subpoena reviewed by CNN.\n\nPulte helped to prompt the Schiff and James investigations, as well as mortgage fraud-related inquiries into other prominent Democrats.\n\nVideo Ad Feedback Video shows DOJ prosecutor Ed Martin posing for photos outside of AG Letitia James’ house 2:47 • Source: CNN Video shows DOJ prosecutor Ed Martin posing for photos outside of AG Letitia James’ house 2:47\n\nPulte in particular has played an extraordinary role in the probes by publicly making criminal referrals to the Justice Department, a step normally taken through mortgage investigators in his agency. And Martin has touted his pursuit of Trump’s political foes.\n\nProsecutors are also looking into whether grand jury materials gathered in the James case were illegally shared with people who were not authorized to review it, according to multiple sources familiar with the matter. James has pleaded not guilty to fraud charges.\n\nThe Justice Department declined to comment. The FHFA, its inspector general’s office and Martin didn’t immediately respond to requests for comment. Attempts to reach Pulte also were unsuccessful.\n\nBish, who previously ran for office in California, has publicly said she had information to share about Schiff related to his mortgages. She told CNN on Thursday that when she came to the Greenbelt courthouse, she believed she was going to provide grand jury testimony on Schiff and mortgage fraud, but that prosecutors “seemed more concerned” about looking into whether “there was conspiracy or collusion between me and Pulte or me and Ed Martin.”\n\nBish said she passed her independent findings on Schiff to Pulte’s office earlier this year, after she said his office contacted her directly.\n\nSchiff is one of Trump’s longtime political foes, with the president in September pushing in a Truth Social post for Attorney General Pam Bondi to prosecute him.\n\n“Pam: I have reviewed over 30 statements and posts saying that, essentially, ‘same old story as last time, all talk, no action,” Trump wrote in the post. “Nothing is being done. What about Comey, Adam ‘Shifty’ Schiff, Leticia??? They’re all guilty as hell, but nothing is going to be done.”\n\nYet prosecutors from the Maryland US Attorney’s Office have been hesitant to proceed with charges against Schiff, CNN previously reported. Schiff has denied any wrongdoing, has not been charged with any crime, and his attorney declined to comment for this story Thursday.\n\n“If they’re trying to tie me into some kind of clandestine conspiracy, it’s not there, and the best way to protect myself is to be open and honest and public,” Bish said Thursday, adding later: “Something’s not adding up. And I haven’t gotten to the bottom of it yet, but I will.”\n\nThe interview questions Bish was asked on Thursday went beyond any probe into Schiff, she told CNN.\n\n“They assured me, when they interviewed me, that the focus of the investigation was Adam Schiff. And I kept pulling the testimony back to Schiff, but it seemed like they were looking for more — stuff that doesn’t exist,” Bish said at the courthouse on Thursday.\n\nInvestigators focused their questions on two people whom Bish said reached out to her for information on Schiff.\n\nOne of the people worked in the first Trump administration and claimed to work for Pulte, and Bish said she spoke to the person several times. The other person said he was affiliated with the mortgage agency Freddie Mac, according to Bish, and she said she spoke to him once.\n\n“You know – had I ever talked to Director Pulte? Had I ever talked to Ed Martin? Did I have any communication with them? And that’s where the conversation kept going back,” she added. “So I don’t know if they’re on a fishing expedition or you know what’s going on.”\n\nBish said she has never spoken with Martin.\n\nCNN’s Evan Perez and Kara Scannell contributed to this report.\n\nThis story has been updated with additional developments and comment.",
  "authors": [
    "Katelyn",
    "Polantz",
    "Hannah Rabinowitz",
    "Devan Cole",
    "Casey Gannon"
  ],
  "url": "https://www.cnn.com/2025/11/20/politics/justice-department-adam-schiff-ed-martin-bill-pulte-christine-bish"
}