{
  "title": "6 Pies So Good, You’ll Want to Skip Dinner",
  "text": "6 Pies So Good, You’ll Want to Skip Dinner Go straight to the good stuff this Thanksgiving: apple and cream, chocolate espresso, honeyed cranberry and more.\n\nGo straight to the good stuff this Thanksgiving: apple and cream, chocolate espresso, honeyed cranberry and more.\n\nIn the world of baked goods, it’s said that people usually fall into one of two camps: cake lovers or pie lovers. But we shouldn’t be so prescriptive. You can dream of both fluffy layer cakes and showstopping pies. You can find yourself craving a bite of chocolate cake one day, while yearning for apple pie the next.\n\nYou can love to eat cake and still bake pie.\n\nCredit... Matthew Young\n\nThat’s where my passion lies. I didn’t grow up having pie. Instead, my family and I ate cake: vanilla sponges from Chinese bakeries, sandwiching fresh whipped cream and sliced fruit, that were just sweet enough. It wasn’t until I was as an adult working at food magazines that I began making and eating pies. I came to find the whole process incredibly rewarding.\n\nUnlike a cake, which requires cooling and then frosting, a pie is ready to eat soon after you pull it from the oven, once it has taken a moment to cool — and in some of the cases below, it’s ready right away.\n\nYou don’t have to be a pie expert — or even a die-hard pie lover — to make the recipes in this collection. The pies below channel classic Thanksgiving flavors, but they’re also fruity, tangy and creamy like the cakes of my youth. (And, critically, they aren’t too sweet.) They’re also all stunning and delicious, and, most important, they’re easy, each one streamlined for success. For beginners, gingery-sweet crumb crusts and crunchy phyllo step in for trickier pie crust. The one pie that does call for dough has a simple twist: The top is shingled rather than woven into a lattice, creating a stunning result with little effort, so you can have your pie and eat it, too.\n\nAdvertisement\n\nThis pie takes inspiration from classic pumpkin pie, but it uses nearly the entire squash — flesh and skin — for both filling and garnish. The custard rests in a graham cracker crust, which I believe is the ideal choice for a pumpkin pie, since the crumbs actually benefit from absorbing some of the custard’s moisture. Garnished with candied squash slices, this pie is both a visual treat and a delicious one.\n\nIf I had to pick a favorite of this batch, it would be this one. The pie dough is forgiving, easy to work with and, best of all, requires no crimping. I encourage you to experiment with your top-crust design and then simply let the dough do its magic in the oven. A touch of heavy cream adds an unexpectedly perfect silkiness to the apples.\n\nHojicha, a toasted green tea from Japan with a smoky sweetness, is incorporated into a cream cheese custard with a subtle cream cheese swirl, guaranteeing that this pie will be the star of Thanksgiving. (Thankfully, this pie also travels well wherever you take it.) Baked in a shortbread crust, it feels almost like an elegant tart.\n\nAdvertisement\n\nThe simplest of the bunch (no pun intended) with ingredients that are available year-round, this sweet-tart banana pie skips the traditional crust in favor of phyllo dough, creating a dramatic, ruffly edge. The custard has a slight tang from the sour cream, which beautifully balances out the sometimes overly sweet banana.\n\nBuilt on a chocolate graham cracker crust with rich layers of chocolate and espresso pudding, this silky treat feels like the fanciest version of a diner-style pie. Each slice is stunning, with contrasting pudding layers and a tall cap of unsweetened whipped cream.\n\nThis dreamy creation combines lush cranberry and vanilla-honey mousses to create mesmerizing swirls of pink and white. It recalls the flavor of Yakult, a popular yogurt-like drink in East Asian cultures, and each bite melts in your mouth. A small amount of gelatin helps the mousses set and keeps them picture-perfect on the Thanksgiving table.\n\nAdvertisement\n\nFollow New York Times Cooking on Instagram, Facebook, YouTube, TikTok and Pinterest. Get regular updates from New York Times Cooking, with recipe suggestions, cooking tips and shopping advice.",
  "authors": [
    "Sue Li",
    "Johnny Miller",
    "Sarah Smart"
  ],
  "url": "https://cooking.nytimes.com/article/pies-thanksgiving-desserts"
}