{
  "title": "Testimony review – a devastating exposé of the Irish church’s brutal Magdalene laundries",
  "text": "At least 10,000 women and girls were imprisoned in Ireland’s Magdalene laundries, forced into unpaid labour and subject to cruelty and suffering. This documentary narrated by Imelda Staunton tells the story of the campaign to hold the Irish government to account for its role in the laundries, mother and baby homes and industrial schools for children. A key figure in that campaign is Maeve O’Rourke, an impressive young Irish human rights lawyer whose master’s thesis at Harvard Law School served as a key legal submission in the legal fight for justice.\n\nO’Rourke had plans for a career in international human rights law until she watched a survivor speaking in a debate on Irish television. We see that footage here, of Michael O’Brien, a former mayor and survivor of rape and torture by priests at a residential school, as he blasts a government minister, white-hot with fury, his trauma raw. It takes your breath away. This thorough documentary hears from campaigners, historians and survivors – including Philomena Lee, forced to give up her son, who was trafficked and sold to rich Americans. Lee was later portrayed on screen by Judi Dench.\n\nThe scale of scandal is at times overwhelming. There was the mass grave found at the St Mary’s mother and baby home near Tuam in Galway – the bodies of 796 babies and children dumped in a septic tank. The spitefulness of the abusers is a recurrent theme, such as a nun throwing baby clothes at a young mum, who had knitted them for her baby – removed from her for adoption just minutes earlier. The expressions of remorse from the religious organisations are best described as carefully drafted. Legally, they are untouchable. But the film ends on a triumphant high, a lunch in Dublin for survivors, honoured like celebrities by crowds outside cheering, waving banners, celebrating their courage; it left me in floods of tears.\n\n● Testimony is in UK cinemas from 21 November.",
  "authors": [
    "Cath Clarke"
  ],
  "url": "https://www.theguardian.com/film/2025/nov/19/testimony-review-a-devastating-expose-of-the-irish-churchs-brutal-magdalene-laundries"
}