{
  "title": "Sydney Sweeney Answers The Web's Most Searched Questions",
  "text": "Transcript\n\nHi, I'm Sydney Sweeney,\n\nand this is the Wired Autocomplete Interview.\n\n[upbeat music]\n\nI know what you [beep] Google.\n\n[upbeat music]\n\nOkay.\n\nHow is Sydney Sweeney doing?\n\n[Sydney laughing]\n\nSkip.\n\nWhat did Sydney Sweeney do before acting?\n\nI was a child.\n\nI went to school.\n\nI played soccer, hung out with my friends.\n\nI ate dirt.\n\nI don't know, I was a kid. [laughs]\n\nDoes Sydney Sweeney have tattoos?\n\nNo, I do not.\n\nI have the biggest phobia of needles.\n\nLike, the biggest.\n\nI have to be held down to get my blood drawn or get a shot.\n\nI don't know what happened when I was young,\n\nbut I've tried everything, I've tried therapy,\n\nhypnotism, laughing gas.\n\nNothing works.\n\nAnd it's something that I'm trying to get better on,\n\nbut yeah, I don't have tattoos because of that.\n\nWhat is Sydney Sweeney's favorite food?\n\nChocolate chip cookies, chicken fingers,\n\ntruffle, pasta, pepperoni pizza or Hawaiian pizza,\n\nbut I know that's a little controversial.\n\nCheeseburgers, corn dogs, mac and cheese.\n\nThird grade food.\n\n[board thuds]\n\nWill Sydney Sweeney be in 'Euphoria' season three?\n\nYes, I will.\n\nCassie will be there, crazy as ever.\n\nI have been with Cassie since I was 20.\n\nI filmed the pilot when I was 20 years old.\n\nMy relationship with Cassie has gone through ups and downs.\n\nShe's crazy.\n\nBut as an actor,\n\nit's one of those roles that you kind of dream of playing\n\nbecause you get to be insane and you get to have so much fun\n\nand you get to be bigger than life sometimes.\n\nSo, I've been really fortunate\n\nto be able to play a character like that in my 20s\n\n'cause she's just,\n\nshe challenges me in ways I never knew I'd be challenged.\n\nDoes Sydney Sweeney do MMA?\n\nSo I grew up kickboxing and grappling.\n\nI started when I was like 12 years old\n\nand I did it until I actually booked Euphoria\n\nand then I couldn't get punched in the face anymore.\n\nAnd I loved it.\n\nI trained at Gokor Hayastan, it's in North Hollywood,\n\nand I was there like three times a week.\n\nSo it kind of transferred over into my movie Christy.\n\nIt was really cool being able to tap back into\n\nthe old skillset and be back into that community.\n\nI loved it.\n\nSydney Sweeney bit by spider.\n\nI got bit by a spider when I was filming Anyone But You.\n\nAnd then I got bit by something again\n\nwhen I went back to Australia to film Eden,\n\nand I have a permanent mark on my arm.\n\nAnd I have no idea what bit me, but it gave me...\n\nSo, for Anyone But You,\n\nI got bit on the hand here and I have like a little mark.\n\nIt was during a scene when Glen and I were on the hike\n\nand I reached into his pants and pulled out a spider\n\nand it was a real spider that was on my hand.\n\nAnd when I started screaming, I think it scared it,\n\nand so it decided to bite me.\n\nAnd so then I'm screaming in the scene\n\nand everyone thinks like, Wow, she's just...\n\nThis is a comedy, right?\n\nLike, she's getting kind of dramatic.\n\nBut I was like, No, it's really biting.\n\nIt's actually biting me.\n\nAnd then Glen was the one who realized I wasn't acting,\n\nand he's like, Oh, shit.\n\nAnd he came over and then everyone cut.\n\nAnd the spider would not stop biting me.\n\nAnd it hurt really bad.\n\nIt was a huge spider.\n\nAnd then this one, no idea what happened,\n\nbut it bit me and then something grew.\n\nSo then, they cut it outta me and gave me stitches.\n\nAnd then it grew underneath.\n\nSo now it's just stuck like this.\n\nAnd I just haven't had time to go to the doctors, that's it.\n\nSydney Sweeney, Billie Eilish.\n\nI mean, I'm a huge fan.\n\nI love her music.\n\nMy entire Spotify is basically Billie Eilish.\n\nI don't know why we're getting Googled together,\n\nbut she's hot and I love her, so that's a compliment.\n\n[board thuds]\n\nCan Sydney Sweeney sing?\n\nI will sing in the shower sometimes.\n\nI like to karaoke.\n\nCan I actually sing?\n\nI have been told yes and I've been told no.\n\nMaybe it's something we'll work on.\n\n[Interviewer] Do you have any go-to karaoke songs?\n\nCreep is my go-to karaoke song.\n\nWhat's the other one? Sweet Caroline.\n\nThat is a fun one.\n\nIt gets the whole crowd into it.\n\nYou're gonna dance on the bar.\n\nIt's usually a good time.\n\nBut I think it's more fun when you can't sing\n\n'cause then it makes people feel more comfortable around you\n\nand they feel like they can join in too, so it's okay.\n\nAll right. Can Sydney Sweeney ice skate?\n\nI mean, I'm not gonna go compete or anything,\n\nbut I can ice skate.\n\nI had to ice skate for Euphoria,\n\nso I trained a little bit on that.\n\nAnd then, I mean, when the holidays roll around,\n\neverybody loves a good ice skating date\n\nso I can ice skate a little bit.\n\nCan Sydney Sweeney drive stick?\n\nYes, I can.\n\nMy mom wouldn't let me drive an automatic\n\nuntil I knew how to drive a manual.\n\nSo, I grew up learning how to drive\n\non my great grandpa's 1940 F1.\n\nAnd so, if you guys know what that is,\n\nit's like the steering wheel's huge.\n\nThe shifter's crazy.\n\nIt's old, so it's gonna stick.\n\nAnd that's what I had to learn to drive on.\n\nCan Sydney Sweeney work on cars? I can.\n\nI mean, I'm not an expert, I'm still learning.\n\nBut my best friend's dad, Rod Emory,\n\nhe builds and restores classic Porsches.\n\nAnd a few years ago, I was on Bring a Trailer.\n\nIt's this website where you can auction cars and buy cars,\n\nand I got an old 1969 Bronco.\n\nAnd I called him up and I was like, I just got it.\n\nI felt like I was in Vegas and I was like winning.\n\nAnd I got the Bronco and I needed to do some work on it.\n\nSo, he was gracious enough\n\nto let me bring my Bronco into his Porsche shop\n\nand open up a section.\n\nAnd I would come in every day after work\n\nor if I didn't work,\n\nand he would teach me how to work on the car.\n\nSo I changed the transmission,\n\nI changed the drum brakes to disc brakes.\n\nI rebuilt the inside, worked on the engine,\n\nand that was it.\n\nSo now I'm working on my next car,\n\nand it's going to be a 1960 356.\n\nSo I just got the old body of it and it's all rusted,\n\nand Rod and I are going to build it together.\n\nSo on my days off, I'm going to go into working on that.\n\nYeah. Okay.\n\nWas Sydney Sweeney valedictorian?\n\nI was.\n\nIt was a small school,\n\nbut you still have to take some hard classes.\n\nI took all AP classes and I loved school.\n\nMy mom was pretty strict growing up,\n\nbut in a good way, like in a, I wanna motivate you\n\nto be a good person and push yourself to try hard things\n\nand to be able to be independent and succeed on your own.\n\nSo, I was always terrified of coming home with a bad grade.\n\nAnd I also loved homework.\n\nLike I just, I liked it.\n\nAnd I did well.\n\nWhere did Sydney Sweeney go skydiving?\n\nYou guys, this is the coolest thing ever.\n\nSo, I was back home in Idaho,\n\nand I got to skydive over my lake\n\nand that was the coolest thing ever.\n\nI've never gone skydiving before.\n\nI woke up at like 6:00 AM,\n\nthere was a prop plane that picked me up.\n\nIt was a water plane, it was camo,\n\nand it pulled up in front of my dock.\n\nI grabbed my cousin, John, and my best friend, Mike,\n\nand we go on the dock, we climb in the plane,\n\ngo up into the sky, it takes us to another plane.\n\nAnd all of a sudden I'm getting strapped up,\n\nstrapped to a person,\n\nand they're like, We're gonna jump!\n\nAnd then I jumped,\n\nand it was the best time ever.\n\nIt was great.\n\nI loved it.\n\nWhere did Sydney Sweeney go on safari?\n\nI went to Tanzania,\n\nand we got to see lions and giraffes, I think.\n\nYeah, I saw giraffes.\n\nI got to see...\n\nIt was lions mating season.\n\nWell, that was interesting.\n\nIt was really cool.\n\nIt was a pretty awesome experience.\n\nI took all my girlfriends,\n\nand it was a really fun time.\n\nIs Sydney Sweeney doing 'Barbarella?'\n\nWe are in development right now.\n\nYes, we are.\n\nSo, can't really give you much more tea on that\n\nother than yes.\n\n[board thuds]\n\nWhat is Sydney Sweeney's latest movie?\n\nMost recently I have Kristy,\n\nwhich is about the boxer, Kristy Martin,\n\nand The Housemaid with Amanda Seyfried.\n\nKristy is such an empowering story.\n\nIt's about a trailblazing woman\n\nwho has fought so many fights\n\nwithin the ring and outside the ring.\n\nAnd she is the greatest role model of my life.\n\nI love her.\n\nAnd it's gonna hopefully save people's lives.\n\nAnd The Housemaid is based on a book\n\nby Freida McFadden who...\n\nIt's juicy.\n\nYou guys, it's twisted, it's delicious, it's sexy, it's fun.\n\nIt's a wild ride.\n\nYou're gonna love it.\n\nWhat is Sydney Sweeney's dream car?\n\nRight now, I've been really wanting\n\neither like an old Defender,\n\nor like a 300 SL.\n\nYou know, Defender, I could go roll around on the beach.\n\nI could go camping with my friends.\n\nA luxurious camping trip in that Defender, that's for sure.\n\nIt's like, it's a group car.\n\nIt's, you're picking up your friends,\n\nyou're gonna go backpacking.\n\nYou're gonna have a good time.\n\nThe 300 SL, that's just a sexy car.\n\nThat's just a really good time in its own world.\n\nIt's got sick doors that go up,\n\nand it's just, yeah, it's hot.\n\nBut it's also very expensive.\n\nAll right. What...\n\nOh.\n\nOoh.\n\nWhat kind of dog does Sydney Sweeney have?\n\nI have two dogs.\n\nI have Tank, who has been in my life since I was like 16.\n\nShe is a mutt, I rescued her.\n\nAnd then I have Sully, who is a German Shepherd.\n\nHe is about eight months old now.\n\nAnd he is...\n\nI call him Silly Sully.\n\nHe's a floppy bear.\n\nI am a very loving dog mom.\n\nI try to set rules,\n\nbut those rules tend to be broken with kisses and treats.\n\nThey sleep in the bed with me, we run and cuddle.\n\nThey're the best soulmates, honestly.\n\nWhat is Sydney Sweeney's favorite movie?\n\nMamma Mia!\n\nI worked with Amanda Seyfried recently,\n\nand I was geeking out the whole time.\n\nAnd my whole dream going into it\n\nwas that we would sing a Mamma Mia! song together,\n\nand then we did.\n\nAnd my life is complete. [laughs]\n\nWhat is Sydney Sweeney's best movie?\n\nI don't know.\n\nI've had really incredible experiences on a lot of my films.\n\nI'm pretty lucky.\n\nAnd I've gotten to tell some pretty amazing stories,\n\nso, I don't think that I have a best.\n\n[board thuds]\n\nThat's called the PG Google searches.\n\nI know what you [beep] Google. Um... [laughs]\n\n[gentle music]",
  "authors": [
    "Condé Nast"
  ],
  "url": "https://www.wired.com/video/watch/google-autocomplete-inverviews-sydney-sweeney"
}