{
  "title": "Historian Answers Native American Questions",
  "text": "Transcript\n\nI'm Ned Blackhawk, professor of history.\n\nI'm here to answer your questions from the internet.\n\nThis is Native American Support.\n\nA Reddit user asks,\n\nAs a non-Native American, I don't really understand\n\nwhat a Native American reservation is.\n\nThe term reservation comes from the lands\n\nthat were reserved for Indians by the British government\n\nbefore the American Revolution and afterwards.\n\nThe reservation system originated in the 19th century\n\nwhen the United States expanded dramatically\n\nfrom its former territorial boundaries\n\nacross much of western North America.\n\nIn the process, the US government entered into treaties\n\nwith native nations,\n\nand in those treaties recognized many of their homelands\n\nand agreed to restrict white settlement\n\nor movement into them.\n\nGenerally speaking, reservations are governed\n\nby tribal community members.\n\nThey have constitutions, school and hospital,\n\nand social welfare systems,\n\npolice and national resource management.\n\nTribal nations are self-governing upon their territories\n\nor upon their reservations where they have jurisdiction.\n\nSo as a non-native person,\n\nyou cannot simply move into these domains\n\nunless you were perhaps related to\n\nor perhaps even married to a tribal member.\n\nThen together you could live within these communities.\n\nThe_Real_JT asks,\n\nWhy are Native American casinos a thing?\n\nThe short answer is, American Indian casinos\n\nhave been established by congressional law.\n\nThe long answer is, Native American casinos have evolved\n\nout of the sovereign authority\n\nthat tribal communities have over their lands\n\nand the limited jurisdiction that municipal\n\nand state governments have upon them.\n\nThroughout the 1970s and '80s,\n\nas tribal communities were regaining the authority\n\nto develop new economies, expand their governments,\n\nfund various programs across their communities,\n\nthey increasingly sought access to federal funding.\n\nInto the 1980s, however,\n\nlimited federal funds began eroding those years of growth,\n\nand many tribal nations started looking at\n\nother economic opportunities\n\nto help build and expand their economies.\n\nThey started using their tax exempt jurisdictional status\n\nto sell cigarettes or tobacco to offer bingo\n\nand related gaming facilities.\n\nOver time, that jurisdictional authority\n\nrequired Congress to intervene and establish state\n\nand tribal compacts so that casinos could be regulated,\n\nand that is what\n\nthe Indian Gaming and Regulatory Act of 1988 did.\n\nThere is some contention about the presence of casinos\n\nwithin Native American communities.\n\nBut generally speaking,\n\ntribal communities have appreciated\n\nthe economic opportunities\n\nthat gaming facilities have provided\n\nand have been trying to use the resources gained by gaming\n\nto build and expand other parts of their governments.\n\nA Quora user asks, Is there a correct map\n\nof the original boundaries of the United States\n\nand its tribal nations?\n\nIt is often hard to find a single image\n\nof the contemporary Native nations of the United States,\n\nin part because very few of them\n\nhave actually been rendered.\n\nI've tried in my recent work to show,\n\nnot just the federally-recognized,\n\nbut the state-recognized tribes\n\nthat exist in the contiguous United States,\n\nand that map is found on the end pages of my recent book.\n\nThis map shows the over 100\n\nfederally-recognized tribes in California,\n\nthe 38 in the state of Oklahoma,\n\nand also the oldest continuously inhabited,\n\nnot only tribal, but human societies in North America,\n\nthe Pueblo Indians' nations of New Mexico.\n\nThese are the oldest continuously inhabited spots\n\nupon the American landscape.\n\nAnd when one sees these tribal communities\n\nor encounters them, one comes to gauge the depth\n\nand the complexity of Native American history.\n\nWe cannot tell the history of the United States\n\nwithout these communities within them,\n\nand we must try as best as we can to incorporate\n\nour visions of America to locate them alongside it.\n\n@Art101Comm asks,\n\nHow did the Navajo Code Talkers contribute to the war?\n\nNavajo Code Talkers contributed to the successful completion\n\nof the Second World War in the Pacific Theater\n\nby helping to communicate military communications\n\nin their original languages,\n\nor in their Navajo or Dine language.\n\nThey became deployed and organized\n\nlargely in the Pacific Theater\n\nand served valiantly in the defense of their country\n\nand tribal nations.\n\nThe Navajo language, known as Dine Bizaad,\n\nis one of the most difficult languages\n\nto understand from the outside.\n\nAnd so there is no way Japanese intelligence officers\n\ncould potentially crack the Navajo code.\n\nOne Reddit user asks,\n\nCould someone help me understand the Trail of Tears?\n\nThe Trail of Tears refers to a period\n\nof Native American history when tribal nations\n\nacross the American South were forcibly removed\n\nfrom their homelands by federal and local officials.\n\nMany fought to remain in their homelands,\n\nbut were unsuccessful in doing so.\n\nSo the Cherokee, the Choctaw, the Muskogee Creek,\n\nthe Seminole Nation, and the Chickasaw\n\nwere marched to centers where they awaited deportation,\n\noften by riverboat across the Mississippi\n\nto what was then known as the Indian Territory.\n\nThis process led to the destruction of thousands of lives\n\nand hundreds of communities,\n\nand is often generally referred to as the Trail of Tears\n\nfor the extraordinary hardship tribal members experienced\n\nduring this process.\n\nA Quora user asks, What reasons did Andrew Jackson have\n\nto move Native Americans to the west?\n\nAndrew Jackson had been elected president in 1828,\n\nand he made removing Indians from the south\n\nthe centerpiece of his first administration.\n\nIt was passed in 1830. It's called the Indian Removal Act.\n\nTribes fought this effort, but failed.\n\nJackson's motivations for doing so largely revolve,\n\nnot only around accessing Indian lands\n\nand creating more prosperous plantation societies them,\n\nbut Jackson believed that all white American men\n\ndeserved suffrage in the country.\n\nWe call this Jacksonian democracy\n\nbecause it was different from the prior practices\n\nof political participation established during the founding.\n\nFor many decades, to vote and hold office\n\nand be a part of the American body politic\n\nrequired certain forms of property ownership.\n\nJackson made the everyday man his primary constituency,\n\nand in doing so, created a racialized vision\n\nof American citizenship and subjectivity\n\nthat was very different from recognition of Native Nations.\n\nSo their presence in many ways\n\nparticularly disturbed his understanding\n\nof who constituted the rightful owners of the United States.\n\nA Quora user asks,\n\nWhere did this whole silly stereotype\n\nabout Native Americans all living in teepees\n\nand wearing feathers in their heads come from?\n\nThere are countless images of American Indians\n\nin American history and popular culture.\n\nThe vast majority usually do conform\n\nto very simplistic stereotypes,\n\nthat Native Americans are all the same,\n\nthat they live in similar dwellings\n\nand dress in similar ways.\n\nThis is in fact counterfactual, but attest to the ubiquity\n\nand the power of popular media to disseminate images\n\nof Native Americans through things like magazines,\n\nchildren's literature, movies, radio and television.\n\nImages of Native Americans living in teepees\n\nand wearing headdresses largely come from\n\nPlains Indian cultures\n\nacross what are now the Dakota Territories into Montana,\n\nNebraska, Kansas, and even into the southern plains.\n\nMany artists and photographers and later filmmakers\n\nand anthropologists became particularly drawn\n\nto these communities.\n\nSome of these communities were in fact the most powerful\n\nNative American political and military actors\n\nin the 19th century,\n\nso they retained vast autonomous homelands.\n\nIn those homelands,\n\nNative Americans continue to hunt and travel\n\nand reside in traditional ways,\n\nand many of the first photographs, movies,\n\nand other depictions of Native Americans\n\nincreasingly focused on these communities,\n\nso much so that they became often synonymous\n\nwith Native America more broadly.\n\nMoving on, what is a Native American powwow?\n\nNative American powwows are gatherings\n\nthat celebrate Native American culture.\n\nThey include dances, as well as drum competitions and songs.\n\nNative American dancers come together to honor themselves,\n\ntheir families, their communities,\n\nbut even to honor the earth.\n\nAnd so at these gatherings,\n\nNative Americans create a powwow ground,\n\nor a kind of central gathering space,\n\nwhere before anything can happen,\n\nNative American veterans and flag bearers bring tribal flags\n\ntogether under honor song or a flag song,\n\nand then dance competitions occur there afterward.\n\nThere are women's and men's categories,\n\nincluding the Jingle Dress category,\n\nwhich is particularly popular with younger women and girls,\n\nthat remember a time when Native American communities\n\nbegan incorporating often canned goods\n\ngiven to them by government agencies in the late 19th\n\nand early 20th centuries.\n\nThese canned goods were cut and turned into jingles\n\nthereafter to commemorate and/or celebrate\n\nthe survival of Indian traditions and customs.\n\nOther dance categories include the grass dance\n\nthat shows dancers with regalia,\n\noutfits that have often many grass strands,\n\noften very colorful with head roaches\n\nand feathers upon them.\n\nThese categories and dance styles\n\nare diverse and distinctive,\n\nbut they become often very ubiquitous across Native America.\n\nSo much so that tribal communities across the United States\n\nparticipate in powwow dances even when those dances\n\nor those dance styles may not have been originally\n\nindigenous to their own communities.\n\njakedwelderx3 asks, What's the Red Power Movement?\n\nThe Red Power Movement generally refers\n\nto a period of American Indian political activism\n\nacross the 1960s.\n\nIt was fueled by a series of charismatic individuals,\n\nnationally-organized associations\n\nto condemn and try to reform corrupt\n\nand broken federal Indian policies.\n\nThese activists were very good at getting media attention\n\nand staging occupations and takeovers\n\nand dramatic publicity stunts of various kinds,\n\nincluding the 1969 occupation of Alcatraz Island.\n\nBut they had a harder time reforming laws, lobbying Congress\n\nand instituting real change upon reservation communities.\n\nThroughout the Cold War era,\n\nthe federal government increasingly attempted to move away\n\nfrom its historic commitments that Native Americans.\n\nAnd it instituted a policy known as termination,\n\nwhereby the federal government attempted to turn\n\nessentially tribes over to states.\n\nSo anything associated with communal lifestyles\n\nbecame increasingly suspicious\n\nwithin many federal policy circles.\n\nAnd these policies increasingly targeted Native nations,\n\nso much so that native peoples organized\n\nand instituted a movement known as Red Power\n\nthat sought a restoration of federal tribal relations.\n\nIt actually took a generation of reservation leaders\n\nto carry those processes forward\n\nand achieve the reform\n\nthat we often associate with the 1970s,\n\nknown as the era of American Indian self-determination.\n\nThat era followed the Red Power Movement,\n\nbut was really instituted by reservation leaders\n\nwho understood that the threats of the termination era\n\nrequired concentrated forceful effort.\n\nA Reddit user asks, Indian, Native American or indigenous?\n\nMany within Native America prefer the term American Indian\n\nbecause of its longstanding familiarity.\n\nThe term Indian appears in both\n\nthe US Declaration of Independence\n\nas well as the US Constitution,\n\nso we will never move past the term American Indian.\n\nBut more recently, the term Native American\n\nand indigenous has gained popularity in usage\n\nin order to move past the homogenizing elements\n\nthat the term Indian has sometimes held.\n\n47D asks, I've heard that Native American nations\n\ndidn't have agriculture,\n\nbut I've also heard that Native Americans\n\ntaught the Puritans how to grow pumpkin, beans and corn.\n\nOne of the reasons people presume Native Americans\n\ndid not practice agriculture is because they were so skilled\n\nat other forms of hunting and gathering.\n\nNative Americans did have agriculture\n\nbefore European arrival.\n\nMany of the most important food crops in the world\n\ncame from Native American gardens,\n\nparticularly from Mesoamerican\n\nor Central Mexican communities that first pioneered\n\nthe use of corn, beans, chilies, and even tomatoes.\n\nSo Native American communities\n\ndid possess agricultural economies,\n\nbut many did not, in places like the Northern Great Lakes.\n\nBut all communities both exchanged resources\n\nand also complimented their hunting, fishing,\n\nand gathering economies with various agricultural harvests.\n\nSo we should see these communities as complex civilizations\n\nand part of a world that gave great bounties\n\nto the rest of human society.\n\nIn fact, the corn beans and squash\n\nraised by indigenous peoples complimented each other so well\n\nthat they created extraordinary bounties of surpluses\n\nthat could be widely traded\n\nand help sustain newcomers such as the Puritans\n\nor other English settlers.\n\nA Quora user asks, Were there any wars\n\nbetween Native American tribes before Europeans arrived?\n\nThe answer is yes, but not in the ways that we might assume.\n\nPrior to the rival of Europeans,\n\nNative Americans did not have guns.\n\nThey did not use horses in combat.\n\nGenerally speaking, Native American communities fought\n\nin ritualized and localized engagements.\n\nSo the history of Native American warfare\n\nbecame forever changed by the arrival of Europeans\n\nwho brought with them not only new technologies\n\nof violence and warfare,\n\nbut radically disruptive influences,\n\nparticularly the introduction of European diseases\n\nthat raged across Native America\n\nfor generations following Columbus's arrival.\n\nNext up, how have Native Americans\n\nhistorically raised their children?\n\nWell, there are many Native American tribes\n\nand communities and cultures,\n\nso it'd be hard to answer that in exact specificity.\n\nIn the American West,\n\ntribal communities have crafted various cradle boards\n\nor various forms of carrying devices\n\nused to keep them with them\n\nwhile they worked or maintained their families.\n\nThis is a smaller version of a Shoshone cradle board,\n\nfor example, that shows its woven hood\n\nand its skin or hide body.\n\nThis is a miniature that was made for children to use\n\nand play with so that they too could someday\n\nprepare themselves to carry what, in this case, would be\n\na boy's hood.\n\nThe hoods are woven out of local grasses\n\nand gathered materials\n\nand would often include either a diamond\n\nor an arrow figure to denote the gender of the baby.\n\nAnd in the larger version, probably over a meter long,\n\na cradleboard like this would have been worn\n\nby usually the mother\n\nwho would carry the infant upon it while she gathered,\n\nharvested or did other forms of labor.\n\n@justin_fowler33 asks, Okay, so how did Sacagawea\n\nmake it all the way to the West Coast?\n\nSacagawea is recruited in the winter of 1804 and 1805\n\nwhen the Lewis and Clark party has made it all the way up\n\nthe Missouri River to the Mandan peoples\n\nof what are now North Dakota.\n\nThey spent the winter there in this vibrant\n\ntrading community of many thousands of people.\n\nLewis and Clark understand that they're heading into a world\n\nthat very few Euro-Americans have ever ventured into.\n\nThe Missouri River is the longest river in North America.\n\nIt flows over 2000 miles\n\nfrom its headwaters in Western Montana\n\nuntil it reaches the Mississippi near St. Louis.\n\nThey've made it about halfway.\n\nBy June, however of 1805,\n\nthe expedition has reached the headwaters\n\nand is stuck essentially in far western Montana.\n\nThey have no prior knowledge of this region,\n\nand they spend several long weeks\n\nin search of local Indians who can help them.\n\nThey eventually find some Eastern Shoshone Indians\n\nwho bring them into their community,\n\ntrade with them.\n\nThe leader of this community, his name is Cameahwait,\n\nand he and Sacagawea embraced\n\nafter several years of separation.\n\nIt's not exactly clear how long she's been gone,\n\nbut she resides from and hails from this region,\n\nand then helps the party translate\n\nand obtain resources to continue going forward.\n\nThey see in this community Pacific salmon,\n\nand they know then that they're not too far\n\nfrom where the waters and the rivers will run west.\n\nAnd they eventually travel through the headwaters\n\nof the Columbia River all the way to the Pacific,\n\nwhere they stay for the winter of 1805 and 1806.\n\nChicago or Sacagawea enables this important chapter\n\nin the Lewis and Clark expedition,\n\nand her legacy remains central\n\nto the history of American exploration.\n\ndijivu asked, Did the Iroquois, or Haudenosaunee,\n\nreally use the seventh generation principle?\n\nIn Native America, Many tribes are known by one name,\n\nbut prefer their own names.\n\nAnd so the Iroquois Confederacy is a widely understood term,\n\ndeveloped largely by outside commentators,\n\nbut the communities themselves use the term Haudenosaunee\n\nto describe their community that predated European arrival.\n\nHaudenosaunee means people of the longhouse,\n\nwhich refers to political structures known as longhouses\n\nwithin these communities.\n\nThe Haudenosaunee Confederacy\n\npredates the establishment in the United States\n\nby at least three centuries.\n\nThe Iroquois or Haudenosaunee Confederacy\n\nconsists of five and later six different Native nations\n\nwho decided to come together to ensure peace, stability,\n\nand prosperity among themselves.\n\nThey use principles or cultural values to guide them,\n\none of which is that they pledge a commitment\n\nto ensuring that their principles\n\nand actions of the current era will continue on\n\nand improve the lives of those who follow after\n\nfor seven generations to come.\n\nSo this philosophy has guided and continues to guide\n\nthese communities' cultural practices\n\nthan Eastern North America.\n\nA Reddit user asked, what was the motivation\n\nbehind American Indian boarding schools\n\nThroughout the 19th century,\n\nas the United States expanded across North America,\n\nit continuously confronted powerful\n\nand determined Native nations\n\nwith whom it had the difficult challenge\n\nof incorporating into the American body politic.\n\nReservations, treaties, and various forms of separation\n\nguided many generations of federal policy makers.\n\nBut after the Civil War, federal leaders began realizing\n\nthat they could dismantle the reservation system\n\nif they could remove their children.\n\nSo starting in the 1870s\n\nand going for 50 years thereafter,\n\nthe federal government instituted policies of child removal\n\nthat would take Native American children\n\nfrom their homelands and raise them elsewhere,\n\nforbid their language and cultural expressions,\n\ninstitute various forms of Christian,\n\nand/or individual ideologies upon them\n\nand forced them essentially to learn English\n\nand the American way of life\n\nso that they could no longer remain tribal members.\n\nThis had a tragic outcome for Native Nations\n\nas many tribal members lost touch with\n\nand/or became distant from their families,\n\nand many tribal nations had to work\n\nfor generations thereafter to incorporate\n\nand rehabilitate many who were taken from them.\n\nA Quora user asks, Why is Red Cloud largely forgotten\n\nby history despite having governed a fifth\n\nof what is now the United States?\n\nI'm not sure Red Cloud governed a fifth\n\nof the United States, but Red Cloud was\n\none of the American Indian leaders\n\nwho fought the United States to a standstill\n\nin a battle known as Red Cloud's War, from 1866-1868.\n\nFollowing the Civil War,\n\nthe United States entered into a series of military\n\nand political conflicts with tribal communities,\n\nincluding the Lakota who dominated\n\nmuch of the Northern Plains.\n\nRed Cloud and the Lakota communities\n\nof what are now Western South Dakota\n\nand Eastern Montana could organize\n\nthousands of warriors when needed.\n\nIn the 1860s,\n\nthe federal government had just concluded the Civil War\n\nand was trying to expand into the west\n\nRed Cloud and other Lakota leaders\n\nattacked and destroyed numerous forts\n\nand essentially forced the federal government\n\nto negotiate a settlement,\n\nknown as the Great Sioux Treaty of 1868,\n\nthat ended this war.\n\nSo the United States has fought\n\nnumerous Native American tribes and lost,\n\nand has had to enter into political and military\n\ndiplomatic accords to conclude these wars.\n\nHubau asks, I've often seen Native American reservations\n\ndescribed as, quote, independent sovereign nations.\n\nWhy were they never given any of the things we associate\n\nwith independent nations, separate passports,\n\nembassies in foreign capitals, seats at the United Nations,\n\nthe Olympics, et cetera?\n\nWell, one can be an independent nation\n\nand not have an Olympic team\n\nand/or seat at the United Nations.\n\nThe independence in the international system\n\nrecognized nations does not have much recognition\n\nor space for Native Nations at the moment,\n\nbut there are many native nations that are trying\n\nto gain access into that world.\n\nThe Iroquois or Haudenosaunee Confederacy\n\ndoes in fact issue passports for its members\n\nwho live often between the United States and Canada.\n\nThere is a restrained\n\nor limited form of sovereignty established\n\nby US constitutional law for Native Nations\n\nso that they are not fully independent.\n\nBut they're sovereign nonetheless\n\nand have authority over their lands\n\nand those who travel upon them.\n\nA Quora user asks, Did the United States ever lose a war\n\nwith Native American tribes?\n\nYes, the United States lost many wars\n\nwith Native American tribes,\n\nincluding the defeat of the US Army in 1791\n\nunder the leadership of Arthur Sinclair,\n\nwhen the early American government was attempting to conquer\n\nwhat was then the Ohio Territory.\n\nConfederated bans of Miami, Shawnee,\n\nWyandot and regional Indians organized\n\ninto a large military confederation\n\nthat defeated Sinclair in 1791\n\nand mobilized then the army of the United States\n\nthat would come to the region and subsequently defeat them.\n\nNext up, what is the Native American Church,\n\nand why is it considered sometimes controversial?\n\nThe Native American Church or NAC\n\nis a pan-tribal religious organization\n\nthat's spread across the United States\n\nin the early 20th century.\n\nIt was often initiated by various medicine men\n\nor leaders known as roadmen,\n\nwho would travel between American communities.\n\nIn the early 1900s,\n\ntribal communities were particularly beleaguered.\n\nMany confronted endemic poverty and underemployment.\n\nReligious leaders, particularly from Oklahoma\n\nand southwestern tribes, started bringing new practices,\n\nbeliefs, and also medicines with them,\n\nincluding the use of the peyote plant and ritual.\n\nPeyote is a psychedelic plant that originates\n\nin North and Central Mexico,\n\nand its buttons have been gathered and utilized\n\nby indigenous peoples in Mexico for hundreds of years.\n\nIn ceremonies that blended both religious\n\nand indigenous practices,\n\ncommunities would often congregate and celebrate together\n\nin ways that often threatened officials around them.\n\nAnd so the persecution of the peyote plant\n\nhas become a particularly controversial aspect\n\nof Native American religious history,\n\nand tribal communities have fought to ensure\n\nthat tribal communities can utilize\n\nmedicinal products when needed.\n\nA Reddit user asks,\n\nIs the Native American population growing or not?\n\nAcross the 21st century,\n\nNative American population has in fact\n\nincreased fairly dramatically,\n\nand particularly in comparison to the previous century.\n\nIn the early 1900s, Native Americans numbered less\n\nthan a million across the United States,\n\nand many speculated that these tribal communities\n\nwould not endure.\n\nIn fact, federal policy encouraged\n\nthe assimilation of Native Americans.\n\nA century later now, in 2025,\n\nNative Americans are estimated at between 4-6 million\n\nin the United States and many more self-identify\n\nas Native Americans across both the United States, Canada,\n\nas well as Mexico.\n\nSo, tribal communities have increased dramatically\n\nin the past 100 years\n\nand stand positioned to ensure that their lands\n\nand resources remain under their control and jurisdiction\n\nfor many generations to come.\n\nThank you for taking the time\n\nto learn about Native American history.\n\nUntil next time.\n\n[gentle upbeat music]",
  "authors": [
    "Condé Nast"
  ],
  "url": "https://www.wired.com/video/watch/tech-support-historian-answers-native-american-questions"
}