{
  "title": "We Digitally Cracked A High Security Safe",
  "text": "Transcript\n\nThis high security safe\n\nis meant to protect everything from guns to cash in stores,\n\nto narcotics in a pharmacy.\n\nWithout the combination, it's supposed to be impenetrable,\n\nbut these two security researchers can open it in seconds.\n\nNo drills, no cutting tools, no stethoscope,\n\njust two different digital flaws\n\nthat can entirely defeat this safe's security.\n\nAnd the company that makes the lock on this safe,\n\nit told me that it has no plans to update its code,\n\nleaving safes across the US and homes, retail outlets\n\nand pharmacies vulnerable.\n\nI'm Andy Greenberg, I investigate the strange, dark\n\nand subversive sides of technology for WIRED.\n\nThis is Hack Lab. We digitally cracked a high security safe.\n\nI'm here in Las Vegas for DEF CON,\n\nAmerica's biggest Hacker conference.\n\nTwo of the security researchers I've been talking to here\n\nare James Rowley and Mark Omo,\n\nwho revealed for the first time on stage of the conference\n\nthat they've discovered not one\n\nbut two techniques for cracking a popular line\n\nof electronic locks sold by the China-based firm SECURAM,\n\nand used on eight brands of high-end electronic safes.\n\nSo what was it that got you all started\n\non this research project that eventually led you\n\nto find these two safe cracking techniques?\n\nWe read the New York Times article in 2023\n\nabout how the FBI was able to call Liberty Safe\n\nand get a code from them.\n\nTwo years ago, Liberty Safe, which markets itself\n\nas America's number one heavy duty home\n\nand gun safe manufacturer, responded to an FBI warrant\n\nby giving agents the combination to open the safe\n\nof a criminal suspect in the midst\n\nof the Bureau's investigation of the January 6th, 2021\n\ninvasion of the US Capitol Building.\n\nSo it really blew me away\n\nthat for this physical security product\n\nthat's not internet connected, that the FBI is able\n\nto call a manufacturer and get a code from them\n\nand they have the keys to the kingdom\n\nto open a safe that you own.\n\nMark and James wanted to understand\n\nhow this apparent backdoor worked.\n\nSo they took a closer look at Liberty Safe\n\nand discovered that the company does keep a reset code\n\nfor every safe and makes it available to US law enforcement\n\nif they have a warrant or a court order.\n\nBut that was just the beginning of the story.\n\nThe locks that Liberty Safe used were actually made\n\nseparately by SECURAM, a third party vendor,\n\n[Mark] And we focused in on the SECURAM ProLogic locks,\n\ntheir higher end digital series of locks.\n\nAnd one of the most interesting features\n\nthat caught our eye is they have this reset functionality\n\nwhere you can through a locksmith, reset your lock\n\neven if you've forgotten all the combinations on it.\n\nSo it turns out that these SECURAM ProLogic locks used\n\non Liberty Safe safes,\n\nbut also many other brands have this reset method\n\nand you all cracked it.\n\nYeah, we were able to dump all the firmware\n\nout of the microcontroller\n\nand inside every single safe lock is the secret algorithm\n\nthat they use to calculate the code\n\nthat you need to reset the lock.\n\nAnd we were able to reverse engineer\n\nand replicate it so we can open almost any ProLogic lock.\n\nWe call that attack reset heist.\n\nSo can you show us?\n\nYeah, let's do it.\n\nFor our Safe cracking experiment,\n\nwe headed to the headquarters of the Red Team Alliance,\n\na Las Vegas-based company focused on physical security\n\nresearch and covert entry instruction.\n\nSo for this first technique,\n\nyou all don't even need any tools?\n\nNope, just my phone.\n\nWell, how does it work?\n\nSo let's imagine you own a safe and you forgot your code.\n\nYou could call a locksmith\n\nand they could then communicate with SECURAM\n\nto provide that challenge to them,\n\nand then they would give back the appropriate response\n\nto reset all the codes on your safe.\n\nSo this is like a kind of approved interaction\n\nbetween an authorized locksmith and SECURAM,\n\nbut somehow you all cracked it.\n\nYeah, the firmware on this lock has everything\n\nthat we needed to know to recreate that secret algorithm\n\non my phone right here.\n\nSo we can try the default code from the factory all ones\n\nand of course, that doesn't work.\n\n[lock clanking]\n\nSo what we need to do,\n\nwe're gonna go ahead into this recovery mode here,\n\nand we need to type in all nines for the recovery code,\n\nand it's gonna show us this challenge on the screen.\n\nThis is like a series of numbers,\n\nand you are gonna copy those into your\n\nprogram here on your phone.\n\nExactly, it's gonna show us the response that we need\n\nto provide to the lock here.\n\n[Andy] So it's like a challenge number\n\nand then a response number that you type back\n\ninto the keypad.\n\nThat's exactly right.\n\nThen it's gonna warn us that we're gonna reset\n\nthe whole lock to factory defaults.\n\nOf course, we're gonna continue.\n\nThere we go. All users deleted.\n\nSo now, it is back in this factory default setting\n\nand that 111111 code will actually open it.\n\nYep. Give it a try. Okay.\n\n[lock beeping]\n\nThere we go. Here you go, nice.\n\nSo is there some easy way for safe owners\n\nto disable that reset mechanism?\n\nI mean, that seemed way too easy.\n\nYeah, so safe owners can actually change\n\nwhat's known as the encryption code on these locks,\n\nand that'll prevent someone from doing this\n\nwithout knowing that code.\n\nBut SECURAM doesn't recommend changing the codes\n\nin its reset method in any online user documentation\n\nthe researchers could find.\n\nOnly in a manual for some locksmiths and manufacturers.\n\nIn another SECURAM webinar,\n\nthe researchers found SECURAM suggests changing the codes\n\nisn't necessary, and that the codes\n\nare usually never changed.\n\nWe purchased a bunch of these locks from eBay\n\nand on every ProLogic lock we bought,\n\nthese codes were left at the default.\n\nThis process worked on every single one that we tested.\n\nSo everybody who has a safe with a SECURAM ProLogic lock\n\ncould change the encryption code,\n\nwhich would protect themselves from this technique,\n\nwhich obviously they should do,\n\ngiven how easy that just seemed to be.\n\nBut you have a second technique, right?\n\nYep, one that's not as easy to protect yourself against.\n\nThis second, even simpler hacking technique uses a device\n\nthat if it were to become available more widely\n\nor sold online, could leave safes across the US vulnerable.\n\nAfter all, beyond Liberty Safe, SECURAM ProLogic locks\n\nare used by a long list of manufacturers,\n\nFort Knox, High Noble, FireKing, ProSteel, Rhino Metals,\n\nSun Welding, Corporate Safe Specialists,\n\nand pharmacy safe companies, Cennox and NarcSafe.\n\nThe locks can also be found on safes used by CVS\n\nfor storing narcotics.\n\nIn a moment, I'm going to try pulling off\n\nthis second technique myself to see just how easy\n\nit really is.\n\nBut first, I reached out to SECURAM to find out\n\nwhat they've done to fix these vulnerabilities.\n\nWhen I asked SECURAM about this,\n\nthey told me that they have no plan to fix this at all.\n\nIn fact, they have a new version of the lock\n\nthat they're gonna come out with before the end of the year,\n\nbut they've essentially said,\n\nIf you want that more secure version,\n\nyou just gotta buy a new lock for your safe.\n\nIt's an interesting approach.\n\nAs SECURAM's director of sales, Jeremy Brooks told me,\n\nwe are not going to be offering a firmware package\n\nthat upgrades it.\n\nWe're going to offer them a new product.\n\nIn other words, if you want a security update,\n\nbuy a new lock.\n\nSECURAM's CEO, Chunlei Zhou\n\nalso wrote in a longer statement to WIRED\n\nthat Mark and James's techniques are already known\n\nto security industry professionals.\n\nHe also said their methods required\n\nspecialized knowledge skills and equipment.\n\nTo get a response to SECURAM's claims,\n\nI spoke to Babak Javadi a co-founder\n\nof the Red Team Alliance,\n\nand a professional hacker specializing in physical security.\n\nThe CEO of SECURAM also told me in a statement\n\nthat the techniques that Mark and James have shown here\n\nare already known,\n\nKnown by who?\n\nLocksmiths have always had some sort\n\nof insider secret knowledge of some kind.\n\nAre they known to the people\n\nthat it impacts the most, the customers?\n\nBecause I suspect a lot of people would make\n\ndifferent purchasing decisions.\n\nThe CEO of SECURAM also told me in a statement\n\nthat they have never seen a single safe lock defeated\n\nthrough a use of this attack.\n\nYou don't know what you don't know\n\n'cause people don't talk about it.\n\nSo like maybe he doesn't know, but it's definitely happened.\n\nThe most sensitive, most important situations\n\nwhere this attack would be used, you wouldn't know\n\nbecause it doesn't leave any obvious traces.\n\nWhen you heard about how this works, were you surprised\n\nat how easy it was?\n\nI'm not surprised by how easy it was.\n\nI think the thing that always strikes me as stupid\n\nis any kind of backdoor by design.\n\nYou can call it a factory recovery method\n\nor customer support tool.\n\nEverything with enough focus\n\nand resources can be reverse engineered successfully.\n\nThere's no good reason to put a backdoor in a product,\n\nand that's what I have a bigger problem with.\n\nSo can SECURAM fix this in their code?\n\nCan they push out some sort of update or patch?\n\nSECURAM on these locks,\n\nthey're not connected to the internet,\n\nso they don't have a way to push firmware updates to them.\n\nIf new firmware was developed that mitigated these issues,\n\nyou could go lock to lock with a tool,\n\nbut it'd be a very manual process.\n\nSo could just anybody figure out\n\nwhat you all have done here?\n\nAre you releasing enough information\n\nthat other people could replicate your technique\n\nand use it for crime?\n\nSo we're not releasing the techniques that we have.\n\nWe think the potential for abuse is way too high.\n\nBut how easy would it be for somebody\n\nto just figure out your techniques and do them themselves?\n\nI think it would take about a week\n\nfor someone skilled in the art to execute all the work\n\nthat we did and produce a similar tool or similar research.\n\nThat's a pretty practical risk.\n\nAbsolutely.\n\n[Andy] Now, the researchers are going to demonstrate\n\ntheir other hack, one that's even harder to defend against.\n\nSo what are we calling this second trick?\n\nWe call that one code snatch.\n\nCode snatch rather than a phone app type thing.\n\nWe got a custom tool that we made that is gonna go in\n\nthrough the battery door of the lock.\n\nSo we're gonna start by taking that out\n\nand then just inserting this little guy in there,\n\nkinda start feeling around for the pins there.\n\nBasically, looking for a little debug port in there\n\nthat we're able to get the unlock codes out for.\n\nThere we go. Just like that, we have got the code.\n\nSo I'm just gonna put the battery back in there.\n\nTurn the lock back on. Let it think for a second.\n\nThen all we gotta do is type it in.\n\n[lock beeping]\n\nThere we go.\n\nSo what is this little device that all built\n\nand how is it possible that it can extract\n\nthe super code so easily?\n\nIt's all off the shelf hardware.\n\nThat is basically just a raspberry pi pico\n\nwith a little screen on it and some pins up here.\n\nWe're trying to set those pins on a programming port,\n\nwhich is also a debugging port,\n\nand that lets us read out everything\n\nfrom the locks microcontroller,\n\nincluding all the codes that are in the lock.\n\nThose codes are stored in an encrypted manner,\n\nbut we can also read out the keys to decrypt them\n\nand we decode that right there on the little\n\nraspberry pi pico and show it on the screen.\n\nIt's kind of shocking\n\nthat the locks keypad itself contains the super code,\n\nand all you have to do is find a way to extract it.\n\nThe firmware in the keypad and the firmware in the latch\n\nboth need to be reworked.\n\nSECURAM stores the codes in the keypad part of the safe,\n\nand really, what needs to happen is those codes\n\nneed to be stored inside the safe, behind all the concrete\n\nand steel that protects them.\n\nSo you can't get at them with a tool\n\nor something like we did here.\n\nIf you've created this lock box that is meant\n\nto be secure, maybe you should put the sensitive things\n\nlike the combination to open it inside instead.\n\nAbsolutely. You'd sure think so.\n\nSo can I give this a try myself?\n\nIt looked like it took a little bit of finesse.\n\nGive it a try yourself\n\nand you can see just how easy it is.\n\nBattery out.\n\nIf any idiot like me can do it, that means that somebody\n\ncould start selling this thing on the dark web\n\nand then anybody can open one of these safes\n\nanywhere in the world.\n\nI'm gonna turn it on now. Yeah, go for it.\n\n[Andy] I'm pushing the top of it towards me, right?\n\n[James] Yeah.\n\nOh, there it is. Hey.\n\nTook a minute, but I got it. You know.\n\nYou got the code. Type it in.\n\n[lock beeping]\n\n[lock clicks] There we go.\n\n[James] And that's basically our tool\n\nthat opens the high security electronic safe lock.\n\nIf want a few hundred thousand dollars of fake money.\n\nWhy did you decide to go public with your techniques?\n\nYou know, SECURAM's Director of Sales, Jeremy Brooks,\n\nsays that you are singling out SECURAM\n\nand trying to discredit the company.\n\nSo that's not it at all.\n\nWe want SECURAM to fix this issue, but more importantly,\n\nwe want people to be aware\n\nof the flaws that they have today.\n\nMark and James are not the first to raise concerns\n\nabout SECURAM's locks.\n\nLast year, US Senator Ron Wyden wrote an open letter\n\nto Michael Casey, then director\n\nof the National Counterintelligence and Security Center.\n\nUrging Casey to warn in American businesses\n\nthat safe locks made by SECURAM,\n\nwhich is owned by a Chinese parent company,\n\nhave a manufacturer reset capability that could be used\n\nas a back door, a risk that had already led to SECURAM locks\n\nbeing prohibited for government use\n\nalong with every other safe\n\nthat has a manufacturer reset capability.\n\nEven as SECURAM locks are widely used in safes\n\nin US private companies.\n\nWhen I wrote to the senator\n\nabout the researcher's safe cracking techniques,\n\nWyden sent me a statement.\n\nExperts have warned for years\n\nthat back doors will be exploited by our adversaries.\n\nYet instead of acting on my warnings\n\nand those of security experts,\n\nthe government has left the American public\n\nvulnerable, Wyden rights.\n\nThis is exactly why Congress must reject calls\n\nfor new back doors in encryption technology\n\nand fight all efforts to force US companies\n\nto weaken their encryption\n\nand facilitate government surveillance.\n\nWhen I asked representatives at High Noble\n\nand Liberty Safe, they told me they weren't previously aware\n\nof any vulnerabilities in SECURAM locks,\n\nbut are now reviewing the issue\n\nand investigating options including using alternative locks.\n\nCVS declined to comment,\n\nbut said that safety is a top priority.\n\nThis story is in some ways a familiar one\n\nin the security industry.\n\nA company builds an and then secure product,\n\nrefuses to update it,\n\nand it takes a couple of white hat hackers to create\n\na proof of concept hacking technique\n\nthat shows us definitively how vulnerable we really are.\n\nBut there's another lesson here too.\n\nIf you build a backdoor into someone's secrets\n\nfor law enforcement or even for the products creator,\n\nit's often just a matter of time until that backdoor\n\nbecomes an entryway for uninvited guests too.\n\nThis is Hack Lab. I'm Andy Greenberg.\n\n[logo warbling]",
  "authors": [
    "Condé Nast"
  ],
  "url": "https://www.wired.com/video/watch/hacklab-we-digitally-cracked-a-high-security-safe"
}