{
  "title": "Astrobiologist Answers Astrobiology Questions",
  "text": "Transcript\n\nWhat is Area 51 actually used for?\n\nWell, I could tell you, but then I'd have to kill you.\n\nNo, [laughs] just kidding.\n\nI'm Astrobiologist David Grinspoon from NASA.\n\nLet's answer your questions from the internet.\n\nThis is Alien Support.\n\n[energetic music]\n\nDisgruntled Hermit asks,\n\nWhat's the most interesting exoplanet you've read about?\n\nIf I had to pick a favorite that we found so far,\n\nit would be the planets in the TRAPPIST-1 system.\n\nThere are seven planets in the system that we've identified\n\nso far, and probably about three\n\nof them are potentially habitable.\n\nAnd by the way, the TRAPPIST system is\n\nonly 40 light-years away.\n\nWhich, if you consider that our galaxy is\n\na 100,000 light-years across, that's relatively close.\n\nI have a sort of chart here,\n\nand you can see the habitable zone of the TRAPPIST system\n\nwith several potential planets in it, compared\n\nto the habitable zone of our solar system on the bottom,\n\nwhich has Earth, and then you know, sort of possibly Venus\n\nand Mars on the edges of habitability.\n\nAnd by the way, the TRAPPIST system here,\n\nit's a cooler star than our sun.\n\nIt's a red dwarf, and so the planets are\n\nclustered very close.\n\nBut imagine what it would be like\n\nfor life evolving on a system\n\nwith multiple habitable planets\n\nnearby one another.\n\nMeteorites occasionally get blasted off\n\nof one planet and land on another.\n\nWe have pieces of Mars here on Earth.\n\nSo, if you have a habitable planet with life\n\nand another planet that could be habitable,\n\nyou could imagine life spreading easily.\n\nJabalandkie asks, Are aliens real?\n\nWell, my thought is that aliens are real.\n\nThere are probably something\n\nlike 30 billion habitable planets in our own galaxy.\n\nAnd so, even if a small fraction of those have an origin\n\nof life, there's lots of life in our galaxy.\n\nAnd the more we study Earth\n\nand its origins, we haven't found anything that's sort\n\nof magical or so special about Earth\n\nthat those things shouldn't be happening elsewhere.\n\nSo if you're asking me, do I think aliens are real, yes.\n\nIf you're asking me, do I know scientifically,\n\nI'll say not yet, but we're on the road to find out.\n\nHere's a question from Quora.\n\nHow accurate is 'Arrival' scientifically?\n\nI really like the movie Arrival.\n\nI'm watching this scene here\n\nwith this astrobiologist, glossed in wonder and awe,\n\nand a little bit of terror, encountering this alien.\n\nWe talk about convergent evolution.\n\nThat evolution on other worlds would find some\n\nof the same solutions.\n\nSo the idea that they have something that's like fingers\n\nfor grasping, that makes sense.\n\nThe idea that they would have this kind\n\nof symmetry just like we have bilateral symmetry,\n\nthey look vaguely squid-like, vaguely octopi,\n\nlike I wouldn't be surprised if we saw complex aliens\n\nif they looked somewhat familiar,\n\nbut not exactly like any organism we had seen before.\n\nBecause again, they'll be responding\n\nto the same overall kinds of evolutionary forces.\n\nAnd then you have the other factor where she's trying\n\nto communicate, and this alien is doing this weird kind\n\nof circular writing,\n\nand it turns out that they are trying to communicate with us\n\nand they're as equally puzzled by us.\n\nThat makes sense because I think there's this whole idea,\n\nsomething called incommensurability,\n\nthat it might really be hard to communicate\n\n'cause they might have very different kinds of cognition,\n\nvery different notions of reality and time.\n\nSo I find this alien very convincing.\n\nUtopia Circle asks, How exoplanets are discovered?\n\nYou can't directly observe the planet\n\nbecause they're too dim and too far away,\n\nbut you can notice what the planet is doing to the star.\n\nSo, as a planet orbits a star,\n\nbecause of the gravitational pull of that planet,\n\nthe star actually wobbles a little bit.\n\nSo that star is wobbling\n\n'cause there's a planet around it,\n\neven though you can't see the planet.\n\nSo, some of the time, the star is coming\n\ntowards your telescope, and some\n\nof the time, the star is coming away from your telescope.\n\nWe call that a Doppler shift.\n\nWhen it's coming towards you, the frequency shifts\n\nto a higher frequency, blue.\n\nWhen it's coming away from you, it shifts\n\nto a lower frequency red.\n\nAnd so, our instruments got good enough to detect\n\nthat slight change, that rhythmic change from blue\n\nto red to blue to red.\n\nIt's a very, very tiny shift in wavelengths.\n\nAnd that was the first sign.\n\nAnd then, later on, there was a new technique\n\nthat's called the transit method.\n\nWhen a planet passes directly in between you\n\nand the star, you can notice that little bit\n\nof dimming of starlight.\n\nIt's very tiny 'cause planets are small\n\ncompared to the star.\n\nBut if you have a very sensitive measurement of the light\n\nof that star over time, when a planet passes just in front\n\nof it, the star will dim a little bit.\n\nAnd so, if you watch the light curve over time of that star,\n\nit'll wobble up and down and up and down and up and down.\n\nSo you're not so much seeing the planet as noticing\n\nthat the planet is blocking the star a little bit,\n\ncausing it to periodically dim.\n\nIt only works when the geometry's right,\n\nif it's a little bit above or a little bit below,\n\nthe direct line between your telescope\n\nand that star, you'll miss it.\n\nSo only about 5%\n\nof stars have planets oriented in the right plane,\n\nthe right direction to use that transit method.\n\nBut when things are lined up right, it's very sensitive.\n\nSo that has allowed us now,\n\nespecially with space telescopes,\n\nlike there was an instrument called Kepler that was designed\n\nto use the transit method to find lots of exoplanets.\n\nAnd that was really what revealed to us\n\nthat most stars in the Universe have planets.\n\nSowhatvirgo asks, Where do astrobiologists work?\n\nHow hard is it to get a job in astrobiology?\n\nSo astrobiologists work a lot at universities.\n\nSome of them work in government labs.\n\nSome of us build spacecraft\n\nand send them out to observe other planets.\n\nSome of us do field work\n\nand study exotic locations, go on expeditions\n\nwhere there's extreme life to understand the limits of life,\n\nand look for some of the earliest signs of life.\n\nThis is a rock called a stromatolite.\n\nThis one comes from Western Australia\n\nand is about 2.7 billion years old.\n\nAnd if you look in close, you see this rock is made up\n\nof layers, and what we've learned is\n\nthat those layers are from ancient microbial mats.\n\nSome of the earliest life on Earth\n\nthat formed these layers on,\n\nwhat was then the C4 microbes, single-celled organisms,\n\nusing the energy of sunlight, using different kinds\n\nof nutrients flowing in the seawater,\n\nand organizing themselves into these layers.\n\nIm at your moms house, asks, What is taking NASA so long\n\nto find them aliens?\n\nWhat active missions are they doing?\n\nWell, it's a big Universe out there,\n\nbut we're working on it.\n\nObviously, we have rovers on Mars searching\n\nfor the signs of ancient life.\n\nSo, we have a mission now on its way to Europa, a Moon\n\nof Jupiter that is home to a vast ocean of liquid water.\n\nSo, we have a mission called Europa Clipper orbiting\n\nthe Jupiter system and making close passes\n\nby Europa in the early 2030s, helping us to understand\n\nif that ocean is habitable, what's the temperature,\n\nthe pressure, what are the flows of nutrients, and so forth.\n\nIs that ocean a place that could support life?\n\nAnd if it is, that would motivate us\n\nto send missions in the future\n\nthat would land on the surface,\n\nand maybe even tunnel under the ice in submarines\n\nto look directly for life on Europa.\n\nWe also have a mission called Dragonfly\n\nthat's going to launch in a few years and go to Titan.\n\nTitan is a moon of Saturn.\n\nIt has a thick nitrogen atmosphere like Earth's,\n\nand it's goaded with organic molecules, the same kinds\n\nof molecules that led to the origin of life on Earth.\n\nDragonfly is going to be basically a nuclear-powered drone\n\nthat lands on Titan,\n\nand samples the surface, examines those organic molecules\n\nto see if they're the kinds of molecules that may have led\n\nto life on Earth, and then it's going to take off\n\nand fly to different locations and repeat its experiments.\n\nSo, it's gonna be the first time we've actually been able\n\nto explore a planet with an aerial craft\n\nthat lands multiple places\n\nand does these kinds of experiments.\n\nWe had a mission recently that went\n\nto an asteroid called Bennu.\n\nIt collected over 100 grams\n\nof material from the surface of Bennu,\n\nand brought it back to Earth.\n\nSo we have, in our labs now, pieces of asteroid dirt,\n\nand what we found is that Bennu is full of the stuff\n\nof life, amino acids.\n\nAmino acids are the things, the building blocks\n\nthat make up proteins.\n\nAnd nucleotides, which are the components\n\nthat make up DNA and RNA.\n\nSo that's really exciting.\n\nIt suggests that not just Earth,\n\nbut all the planets, were being sprinkled with the stuff\n\nthat basically leads to an origin of life.\n\nSo, again, we haven't found life elsewhere,\n\nbut we've been finding results that suggest\n\nthat life should be common.\n\nX/x/.txt asks, Who came up\n\nwith the flying saucer design, and why did it stick?\n\nIt turns out that flying saucers go back\n\nto a pilot named Ken Arnold,\n\nwho was flying in the Pacific Northwest in 1947,\n\nand he reported something weird that he saw.\n\nWhat's interesting is\n\nthat he never even said it was saucer-shaped.\n\nHe didn't understand,\n\nand he described its motion as skipping like a saucer.\n\nI think it's like when you skip rocks or something,\n\nand it kind of bounces like that.\n\nThat's what he apparently meant.\n\nAnd then it got reported in a newspaper\n\nas Pilot sees mysterious flying saucer.\n\nAnd thus, a huge trope was born.\n\nPUGBUG2 from Reddit asks,\n\nHow did the first life form on Earth emerge?\n\nWe know something about the most primitive life forms\n\non Earth because we study modern organisms\n\nand how they're all related.\n\nThere's something called LUCA,\n\nthe Last Universal Common Ancestor.\n\nEven though we don't have an example of it,\n\nby seeing how different life forms have evolved from it,\n\nwe can reconstruct the properties\n\nof that Last Universal Common Ancestor.\n\nAnd so, we know that it liked hot conditions.\n\nWe know that it was a single-celled organism.\n\nWe have inferred that it occurred in a watery location.\n\nSome people think sea floor vents.\n\nSome people think tidal areas, little ponds\n\nthat were being wet and dried or freeze,\n\nand thawed would've led to the right kinds of chemistry.\n\nWe also have experiments that show that the building blocks\n\nof life are very easy to create.\n\nIf you mix gases that were in the primitive atmosphere,\n\nthen you spark them with energy sources\n\nthat were likely present,\n\nlightning, ultraviolet light from the sun.\n\nYou easily create these molecules like amino acids\n\nand other chemicals that clearly were important\n\nfor the origin of life.\n\nYou had gradual increases in chemical complexity.\n\nYou probably had the formation\n\nof very simple membranes which separate inside from outside,\n\nand allow the creation of cells.\n\nThere are certain chemicals which you put 'em in water\n\nand they create membranes.\n\nWe call 'em vesicles.\n\nWe know the necessary chemistry, we know what some\n\nof the earliest life was like.\n\nWe sort of were closing in on it from multiple directions.\n\nNext question. WinddancerLor.\n\nWTF happened to Ceres?\n\nCeres is a dwarf planet.\n\nIt's basically one\n\nof the largest objects in the asteroid belt,\n\nbut we call it a dwarf planet\n\nbecause it's large enough to be rounded by gravity.\n\nAnd recently, we sent a spacecraft there,\n\nand we found some surprising things.\n\nMost surprising, you see this large crater\n\nin the center of this image.\n\nIt's bright and white,\n\nand what we found is that's a salt deposit.\n\nAnd that salt deposit indicates that there was water.\n\nAnd it suggests that this was a water world at one point,\n\nand may still even have liquid water on the inside.\n\nThis is very exciting to astrobiologists\n\nbecause it means that dwarf planets like Ceres are places\n\nwhere you could have, in the past,\n\nhad habitable conditions on the inside.\n\nAnd who knows, maybe at present, some\n\nof these dwarf planets still have habitable oceans.\n\nSo the more we explore the solar system,\n\nthe more we're surprised by the level of activity on some\n\nof these worlds that we thought were dead.\n\nNew Language4727 asks,\n\nAre there good scientific explanations\n\nfor UFO sightings,\n\nsuch as the USS Nimitz encounters in 2004?\n\nThere are some intriguing reports,\n\nand the USS Nimitz one is rather strange.\n\nYou know, the ocean boiling some object\n\nthat didn't look like a human-made object,\n\nseeming to fly at great speeds, and so forth.\n\nI don't know how to explain it, but the bottom line is,\n\nand we see no reason to think this has anything to do\n\nwith astrobiology, or any kind\n\nof extraterrestrial technology.\n\nOne of the videos that was recently popularized was taken\n\nby pilots.\n\nIf you look at that video,\n\nit does look like something's moving,\n\nsort of, unnaturally fast.\n\nBut it turns out if you analyze information we do have,\n\na lot of that can be explained by parallax.\n\nThat is the motion\n\nof the camera can make something look like it's moving\n\nmuch faster than it is.\n\nSo, people that have actually looked at the data said,\n\nYou know what, the speed isn't as great,\n\nand the motion isn't as unnatural as we thought.\n\nBut you know, I'm the first to admit\n\nthat there are things in our atmosphere\n\nthat we don't understand.\n\nBut as of now, I've not seen anything that tells me, aha,\n\nthis is an extraterrestrial mystery.\n\nIt's more like, this is a plausible terrestrial mystery,\n\nbut we don't know very much about it,\n\nand we don't have very good documentation.\n\nAshkir asks, What is\n\nthe closest another habitable planet could be near Earth?\n\nIt's probably, roughly, four light-years,\n\nthat is Proxima Centauri,\n\nwhich is in the nearest star system to Earth,\n\nwhich, again, for perspective,\n\nthe galaxy is about 100,000 light-years.\n\nSo, four light-years on the scale\n\nof the galaxy is very close.\n\nOf all the spacecraft we've launched, there are five of them\n\nthat are on trajectories\n\nwhere they will actually escape our solar system.\n\nAnd most famously, Voyager 1 and Voyager 2 are\n\non their way out,\n\nand they will maybe encounter another star system\n\nin something like 100,000 years.\n\nBut, of course, it would be millions of years\n\nbefore one of them actually sort\n\nof wandered into the vicinity of a nearby star.\n\nFellaonamission asks, Why is water essential\n\nfor life on other planets?\n\nEverywhere on Earth where there's life, there's water.\n\nAnd almost everywhere on Earth where there's water,\n\nthere's life.\n\nWater is sort of the universal solvent\n\nthat allows life to happen.\n\nBasically, we are organic molecules dissolved in water,\n\ndancing together and doing complex things,\n\nand reproducing themselves.\n\nAs far as we can tell, that's what life is.\n\nYou clearly need a liquid medium\n\nbecause the molecules have\n\nto come together in this complex 3D dance\n\nthat if they're just frozen in a solid\n\nor loose in a gas, they won't do it.\n\nSo, as far as we can tell, you need a liquid for life.\n\nWater is a common liquid in the Universe\n\nand has those properties of interacting with organics\n\nthat we have not been able to mimic\n\nwith any other chemical in a lab.\n\nSo we don't know for sure\n\nthat the Universe couldn't have done it in some other way.\n\nMaybe we'll be surprised and find life in ammonia\n\nor methane, or some other liquid.\n\nBut as far as we can tell, water is the key\n\nto life in the Universe.\n\nSo, Gabe3115 asks,\n\nWhat do we think about assembly theory?\n\nSo, assembly theory attempts to describe the nature of life.\n\nWhat is the difference between living matter\n\nand non-living matter?\n\nHow could we recognize that?\n\nWell, most of the Universe is made\n\nof very simple molecules like this carbon dioxide.\n\nThat's not a very complex molecule.\n\nBut if you look at the molecules of life like amino acids,\n\nyou can see carbon, carbon, carbon,\n\ncarbon bonded together in complex ways with other hydrogens.\n\nAnd they get much more complex than this,\n\nand they can be hundreds or thousands\n\nor tens of thousands of atoms bonded together.\n\nBut you can see\n\nthat this is very different from these simple molecules.\n\nAnd what assembly theory does is characterize the complexity\n\nof molecules in a way\n\nthat tells us when something is complex enough\n\nso that it must have been made by life.\n\nOneskipydino asks,\n\nCan someone give me a short explanation\n\nof the Drake equation, and the probability\n\nof us being alone?\n\nI happen to have a copy right here.\n\nIt's a way of thinking through the probability\n\nof extraterrestrial life that was devised\n\nby Astronomer Frank Drake in the early 1960s.\n\nFrank Drake was the first one\n\nto actually point a radio telescope elsewhere from Earth,\n\nand start to listen to see if he can find alien signals.\n\nAnd to help think through the probability\n\nof finding those signals,\n\nhe came up with this really pretty simple equation.\n\nN is the number of communicating civilizations out there.\n\nR, that's just the rate of star formation in the galaxy.\n\nF-sub-P, the probability of planet formation\n\naround those stars.\n\nN-sub-e, the number of habitable planets per star.\n\nF-sub-l, the fraction of planets\n\nthat have an origin of life.\n\nF-sub-i is getting into more speculative territory.\n\nThat's the fraction of planets with life\n\nwhere intelligent life evolves.\n\nAnd of course, we only have one example, it's Earth.\n\nAnd then f-sub-c is even more speculative.\n\nThat's the fraction of planets with intelligent life\n\nthat have communicating civilizations that are sending\n\nor possibly receiving messages.\n\nFinally, multiplied by L or the average longevity\n\nof communicating civilizations.\n\nIf communicating civilizations don't last long,\n\nperhaps because they do themselves in through nuclear war\n\nor climate change or some other process,\n\nthen the numbers suggest\n\nthat civilizations that we could communicate with are\n\nprobably very rare and might be hard to find out there.\n\nOn the other hand, if L is long,\n\nbecause some civilizations can last a very long time,\n\nthey solve their problems, they learn how\n\nto live sustainably on a planet, then the math works out\n\nthat there should be lots of civilizations out there\n\nthat we can find.\n\nSo the numbers vary widely depending\n\non how you estimate some of these unknown factors.\n\nBut some of these factors we do now know pretty well.\n\nWe know the star formation rate in the galaxy.\n\nAnd importantly, we've recently discovered\n\nthat planets are very, very common.\n\nThat tells us that as long as the origin\n\nof life is not super, super rare, there must be lots\n\nand lots of planets out there with life.\n\nChadfromthefuture asked, Why doesn't\n\nthe Europa Clipper deploy something into the moon\n\nto check for life?\n\nAt one point, there was the idea\n\nof including a lander on Europa Clipper.\n\nBut it was decided that the real point\n\nof this mission is just to characterize Europa\n\nand decide if it is habitable.\n\nWe'll then know which locations on the surface are\n\nthe right locations to send a lander.\n\nWhereas now, we would sort of be guessing it.\n\nAlso, it costs a lot to send a mission to Europa,\n\nand the more complex you make the mission with an orbiter\n\nand a lander and other pieces, the price goes up,\n\nand then you're less likely to have the mission at all.\n\nSo, if Clipper does confirm, as we suspect,\n\nthat Europa is a habitable world, you can be sure\n\nthat in the future, we will be sending landers\n\nto directly search for life there.\n\nBrowner555 asks, What is Area 51 actually used for?\n\nWell, I could tell you, but then I'd have to kill you.\n\nNo. [laughs] Just kidding.\n\nArea 51 is a place\n\nwhere experimental military aircraft are tested.\n\nThis is common knowledge, and that's all I know,\n\nand I've seen no evidence that it's anything else.\n\nRinsetheplates_first asks, What is the Fermi Paradox?\n\nSo the Fermi paradox is named\n\nafter the great Italian American physicist Enrico Fermi,\n\nwho famously asked, Where is everybody?\n\nWith all the possible life forms\n\nand civilizations in the galaxy,\n\nand with a galaxy that is billions of years old,\n\nwhy aren't there obvious signs of extraterrestrial life?\n\nThat's really what we mean by the Fermi Paradox.\n\nIn my view, it's not really a paradox\n\n'cause we haven't really looked yet, very thoroughly.\n\nWith SETI, the Search for Extraterrestrial Intelligence,\n\nJill Tarter, who's one\n\nof our great SETI scientists, has likened it to,\n\nif the Universe is an ocean,\n\nwe've basically searched a teacup full of water.\n\nEven though we've been searching with radio telescopes\n\nfor 60 years now,\n\nif you look at the number of stars we've looked at carefully\n\nand the frequencies we've analyzed compared to the amount\n\nof search space there is,\n\nthat it's just a teacup in the ocean.\n\nSo we could have easily missed it.\n\nInfinityScientist asks, What kind\n\nof techno signature could be detected\n\nfrom a very faraway galaxy?\n\nThat's an interesting one.\n\nIf you were an alien looking at Earth, you might notice\n\nthat our atmosphere has changed.\n\nYou might notice lights from our civilization, those kinds\n\nof things we call techno signatures.\n\nJust any observation that can betray the existence\n\nof some kind of technological activity or civilization.\n\nThe only kind of techno signature I can think\n\nof from a very far away galaxy would be some kind\n\nof incredibly advanced civilization\n\nthat is actually manipulating the geometry\n\nof that galaxy in some way.\n\nCreating things like Dyson spheres,\n\nthese large structures in a solar system that are meant\n\nto gather all the solar energy from that star\n\nand power their technology.\n\nAnd that would put out an unusual infrared signature.\n\nSo, we actually have the ability to look\n\nfor things like that.\n\nWhen we're talking about the possible abilities\n\nof very advanced technologies,\n\nyou almost have to get very out there.\n\nLike Arthur C Clarke said,\n\nAny sufficiently advanced technology may be\n\nindistinguishable from magic.\n\nAnd the fact is, if you look at how fast technology changes,\n\nit's very hard to say it would be impossible\n\nfor some civilization\n\nto create these astroengineering works\n\nthat would be visible from distant galaxies.\n\nUlteriorkid324 asks, What is SETI?\n\nIs it just people listening to alien radio stations?\n\nSo, SETI stands for\n\nthe Search for Extraterrestrial Intelligence,\n\nand it's been mostly radio searches.\n\nBut more recently, now we have what we call optical SETI,\n\nwhere the idea is that they may not be sending radio pulses,\n\nthey may be sending laser pulses.\n\nSo with optical SETI, we look in optical visible wavelengths\n\nfor laser pulses from other stars.\n\nWe also shouldn't confuse SETI with METI,\n\nwhich is Messages to Extraterrestrial Intelligence,\n\nwhich is more controversial.\n\nSome people are opposed to METI for a couple of reasons.\n\nOne is they think it's arrogant to assume\n\nthat any one person or program\n\nor institution could speak for all of Earth.\n\nUser0301 asks,\n\nNASA announced it has detected a gas\n\non a planet 120 light-years away\n\nthat might indicate life, how?\n\nSo, one of the things we do is we look for\n\nwhat we call bio signature gases in their atmospheres.\n\nA report was published\n\nthat a chemical called dimethyl sulfide had been detected\n\nin the atmosphere of an exoplanet called K2-18B\n\nthat might have a habitable watery environment,\n\nwhich would be a very exciting thing to find.\n\nDimethyl sulfide is a gas that, on Earth,\n\nis associated with life largely,\n\nalthough there are other ways to make it.\n\nSo they're not sure that dimethyl sulfide has\n\nreally been found on this exoplanet.\n\nSo, as far as how we detect gases in a distant atmosphere\n\nof an exoplanet, we use spectroscopy.\n\nBasically, we observe the amount of light at a range\n\nof wavelengths across the visible, the infrared,\n\nthe ultraviolet spectrum on an exoplanet.\n\nAnd we've learned\n\nthat patterns in those spectra reveal\n\nthe existence of different gases.\n\nSo, for instance, this is a spectrum\n\nfrom an exoplanet called WASP-96 b.\n\nYou can see some of these peaks and valleys.\n\nThis is a peak that indicates water, which is pretty amazing\n\nbecause water is one of the key gases\n\nfor thinking about life in the Universe.\n\nHere's a question from the AskHistorians Subreddit.\n\nAre there any compelling cases\n\nof UFO/UAP sightings in history?\n\nFrom an astrobiology perspective,\n\nthe short answer is no.\n\nThere are a lot of phenomena in our atmosphere\n\nthat have not been characterized yet.\n\nThere have been things discovered recently,\n\nstrange high altitude, lightning formations called sprites\n\nthat were reported and dismissed,\n\nand then they turn out to be real.\n\nI would not doubt\n\nthat there are strange things in our atmosphere\n\nthat have not yet been identified,\n\nwhether they are any indication of alien technology,\n\nto me, that's a kind of last resort explanation.\n\nEven if they are technology,\n\nI would probably say it's much more likely\n\nthat they are human technology that some humans know about\n\nand other humans don't.\n\nWhy we have to resort to aliens to explain this?\n\nTo me, if anything that seems kind of a lack of imagination\n\nor really a big leap that I wouldn't be prepared\n\nto make without some more specific evidence for that.\n\n@Redacted Media asks, What if we could see\n\nand interact with the shadow biome?\n\nWhat if there's some other form of life on Earth\n\nthat we're not even fully aware of?\n\nWhat if there's another form\n\nof life, perhaps hiding underground\n\nor in some place that we think is very uninhabitable\n\nbecause our kind of life couldn't exist there?\n\nYou know, highly acidic places\n\nor places that are so extreme\n\nthat we think life couldn't exist.\n\nThat, in fact, does exist on Earth.\n\nAnd that's the notion of a shadow biosphere.\n\nAnd by its very nature,\n\nthe concept implies something we haven't\n\nreally encountered or thought of yet.\n\nIt's a kind of question that's worth our keeping in mind\n\nas astrobiologists, so that we don't assume\n\nthat we know everything about life,\n\nwhen in fact, we're just beginning\n\nto understand the possibilities for life in the Universe.\n\nWell, here's another good question.\n\nWas there ever life on Mars?\n\nWhat I can tell you is the more we've studied Mars,\n\nthe more we've learned about its earliest environment.\n\nIt seems to be similar to the early environment\n\nof Earth at the time when the origin\n\nof life is believed to have happened.\n\nThere are dried-up river valleys, there are dried-up lakes\n\nwith waterborne sediments, there are flood valleys,\n\nall kinds of signs that Mars, when it was young, was a wet\n\nand warmer place with a more Clement climate, with lakes,\n\nwith flowing water, and most likely with organic molecules.\n\nSo, Mars, we believe, had the conditions\n\nfor an origin of life.\n\nHave we found evidence for early life on Mars yet?\n\nNo, but we're searching for it.\n\nAnd that's one of the reasons we have these Mars rovers,\n\nand hopefully, someday, bringing samples back,\n\nso that we can examine those rocks\n\nin our laboratories on Earth,\n\nand identify, for sure, whether there was life on Mars.\n\nPietin11 asks,\n\nWould a Venus sample return mission be possible?\n\nIt wouldn't be that easy\n\nbecause Venus has a very thick atmosphere.\n\nYou can't see the surface\n\nbecause it's surrounded by these thick clouds\n\nof sulfuric acids, so battery acid.\n\nSo it's not an easy place to explore or to get to.\n\nUltimately, we would really like to do so.\n\nHaving samples on Earth is so valuable\n\nbecause instead of having to send your little instruments\n\nup there, and do the experiments\n\nand radio home the results,\n\nyou can have a whole Earth laboratory.\n\nYou can have all the time that you want,\n\nand using all the resources of our laboratory.\n\nPokoirl asks, Is a habitable planet\n\nwith no tectonic activity plausible?\n\nWe're still trying to understand the nature\n\nof habitability, but one thing\n\nthat's certainly true about Earth,\n\nthe one habitable planet we know is that possibility\n\nfor life here is facilitated by plate tectonics,\n\nby the motion of the Earth's surface, driven by the motion\n\nof the interior, which moves the surface around,\n\nand not only makes mountains and Earthquakes, and all that,\n\nbut brings nutrients continually to the surface,\n\nand sort of renews the surface of the Earth.\n\nKeeps it fertile.\n\nWe definitely think tectonic activity is related\n\nto habitability.\n\nAnd you would imagine for a planet to be habitable,\n\nthere needs to be some kind of ongoing geological activity.\n\nIs it absolutely required?\n\nWe don't know.\n\nFor instance, there are these ocean worlds like Europa\n\nand other places where habitability could just be\n\non the inside,\n\nand maybe you would not have tectonic activity\n\nin the outside if there were other energy sources\n\nand way of recycling nutrients.\n\nCoochieman127 asked,\n\nDo you think we detect intelligent life\n\nwithin the next 100 years?\n\nSo, with the James Webb Space Telescope, we're just getting\n\nto the point where we can identify gases\n\nin exoplanet atmospheres, and with future space telescopes,\n\nthen we will have the ability to really say\n\nwhat's in that atmosphere\n\nof this exoplanet and that exoplanet.\n\nAnd once we can do that, then we at least have a chance\n\nof funding some kind of techno signature.\n\nSimilarly, our radio searches are getting\n\nmuch more sophisticated.\n\nSo, the completeness with which we're examining the rest\n\nof the Universe is increasing rapidly, which makes me think,\n\nagain, if the aliens are there waiting to be found,\n\nthat within the next 100 years,\n\nwe have a pretty decent chance of finding them.\n\nSo those are all the questions for today.\n\nAnd thanks for watching Alien Support.\n\n[lively music]",
  "authors": [
    "Condé Nast"
  ],
  "url": "https://www.wired.com/video/watch/tech-support-astrobiologist-answers-astrobiology-questions"
}