{
  "title": "Valar Atomics Says It’s the First Nuclear Startup to Achieve Criticality",
  "text": "Startup Valar Atomics said on Monday that it achieved criticality—an essential nuclear milestone—with the help of one of the country’s top nuclear laboratories. The El Segundo, California-based startup, which last week announced it had secured a $130 million funding round with backing from Palmer Luckey and Palantir CTO Shyam Sankar, claims that it is the first nuclear startup to create a critical fission reaction.\n\nIt’s also, more specifically, the first company in a special Department of Energy pilot program aiming to get at least three startups to criticality by July 4 of next year to announce it had achieved this reaction. The pilot program, which was formed following an executive order President Donald Trump signed in May, has upended US regulation of nuclear startups, allowing companies to reach new milestones like criticality at a rapid pace.\n\n“Zero power criticality is a reactor’s first heartbeat, proof the physics holds,” Valar founder Isaiah Taylor said in a statement. “This moment marks the dawn of a new era in American nuclear engineering, one defined by speed, scale, and private-sector execution with closer federal partnership.”\n\nCriticality is the term used for when a nuclear reactor is sustaining a chain reaction—the first step in providing power. Enriched nuclear fuel releases neutrons, which hit other atoms, which then split apart; neutrons from that process then hit other atoms, and start the reaction over. This process is known as fission. A properly functioning reactor has just enough reactions to keep that fission chain going, reaching a state of criticality.\n\n“Think of a long chain of dominoes,” says Adam Stein, director of the Nuclear Energy Innovation program at the Breakthrough Institute, an eco-modernist policy center. “If you have those dominoes spaced out too far, a domino won't hit the next one. If they're spaced just right, then one hits the next, hits the next, and you have the reaction you're hoping for.”\n\nThere’s a difference between the type of criticality Valar reached this week—what’s known as cold criticality or zero-power criticality—and what’s needed to actually create nuclear power. Nuclear reactors use heat to create power, but in cold criticality, which is used to test a reactor’s design and physics, the reaction isn’t strong enough to create enough heat to make power.\n\nThe startup says that the assembly that reached criticality this week is the NOVA core built by Valar with a blend of the startup’s fuel and technology with key structural components provided by the Los Alamos National Laboratory, one of the DOE’s research and development laboratories. The combination reactor builds off a separate fuel test performed last year at the laboratory, using fuel similar to what Valar’s reactor will use.",
  "authors": [
    "Molly Taft"
  ],
  "url": "https://www.wired.com/story/valar-atomics-says-its-the-first-nuclear-startup-to-achieve-criticality/"
}