{
  "title": "'It transforms a person into a thing': Why there's more to Man Ray's iconic nude Le Violon d'Ingres than it seems",
  "text": "Man Ray's 1924 image Le Violon d'Ingres, of a woman's body transformed into a violin, has continued to fascinate, confuse and upset viewers, more than 100 years on.\n\nSome works of art endure in spite of themselves. They transcend their own deficiencies. The Mona Lisa, The Scream and The Girl with a Pearl Earring are all meme machines, but still manage to move us. Something in them shields their essence from the acid of caricature, and ceaselessly restores their mystery. So it is with Man Ray's iconic photograph of his lover's naked torso, which the France-based American Surrealist famously transformed into a violin.\n\nThe image's objectionable perspective, which transforms a person into a thing, has not slowed its propulsion in popular imagination. In 2022, Le Violon d'Ingres (1924), among the key works on display in the exhibition Man Ray: When Objects Dream at the Metropolitan Museum of Art in New York, sold for more than $12m (£9.6m), the highest price ever paid for a photograph at auction – proof of its accelerating appeal. What is it about the photo that, despite its ostensible flaws, keeps it resonating over a century after it was created?\n\nThe holes re-engineer her physique altogether, conceptually dislocating it from that of a human being into something built, not born\n\nLe Violon d'Ingres captures from behind the celebrated French model, memoirist, painter and Jazz singer, Alice Prin, who adopted the nickname \"Kiki de Montparnasse\" after the bohemian neighbourhood of south Paris in which she rose to prominence in the 1920s. Man Ray shows Kiki seated with a straight back, arms invisible in front of her, and head turned slightly to the left. She wears nothing more than a turban fashioned from a patterned shawl and drop earrings. Two bold, black, f-shaped acoustic sound holes, of the kind cut out from bodies of violins and violas, cellos and double bases, are surreally imprinted on her lower back. These are, as we will see, the twin keys that unlock both the photo's defects and its peculiar power as they connect the work to a dizzying array of cultural shapes, from ancient mysticism to Gibson guitars, from Orpheus to Proust.",
  "authors": [],
  "url": "https://www.bbc.com/culture/article/20251021-the-key-to-man-rays-le-violon-dingres-disturbing-erotic-power"
}