{
  "title": "Por qué Trump cambió de opinión sobre los archivos Epstein en medio de sospechas sobre los motivos de su publicación",
  "text": "CNN —\n\nEl presidente Donald Trump intentó el miércoles poner fin rápidamente a la que quizás sea la saga más perjudicial de su mandato, firmando una medida que obliga a la publicación de los archivos de Epstein tras perder una lucha encarnizada de meses para evitar su divulgación.\n\nLa decisión representa un giro radical para el presidente, cuyo objetivo principal era sofocar una incipiente rebelión dentro del Partido Republicano y restaurar su férreo control sobre el mismo. Sin embargo, pocos creen que el camino a partir de ahora será tan sencillo.\n\n“ACABO DE FIRMAR EL PROYECTO DE LEY PARA LA PUBLICACIÓN DE LOS ARCHIVOS DE EPSTEIN”, publicó Trump en Truth Social a última hora del día, atribuyendo la abrumadora votación a favor en el Congreso a su implicación.\n\nLa medida que se convertirá en ley abrirá ahora una nueva y tensa etapa en la lucha por obtener los archivos relacionados con el delincuente sexual convicto Jeffrey Epstein, sometiendo al Departamento de Justicia a un nuevo escrutinio y poniendo a prueba la capacidad de la Casa Blanca para desviar la atención de los tratos pasados ​​del presidente con Epstein y dirigirla hacia un terreno político más ventajoso.\n\nEn una conferencia de prensa celebrada el miércoles por la mañana sin tener en cuenta el tema, la secretaria de Justicia Pam Bondi se limitó a decir que el Departamento de Justicia “cumpliría con la ley” cuando se le preguntó sobre los archivos de Epstein.\n\nPero los funcionarios ya se enfrentan a una creciente sospecha en el Capitolio y entre su base MAGA de que la administración utilizará una investigación penal recién abierta, ordenada por Trump, como excusa para mantener en secreto parte del expediente del caso Epstein.\n\nMientras tanto, los funcionarios del Departamento de Justicia se esfuerzan por equilibrar su investigación con el inminente plazo de diciembre para la publicación de los documentos, después de haber sido sorprendidos tanto por la exigencia de Trump de una nueva investigación como por su repentino apoyo el domingo por la noche a la publicación de todos los archivos de Epstein, según una persona familiarizada con el asunto.\n\nTrump y otros políticos podrían ser afectados por la publicación de los archivos del caso Epstein, afirma experto 02:17 • Fuente: CNN Trump y otros políticos podrían ser afectados por la publicación de los archivos del caso Epstein, afirma experto 02:17\n\nY aunque la Casa Blanca intenta dejar atrás la polémica para centrarse en las elecciones de mitad de mandato del próximo año, sigue habiendo pocos indicios de que los partidarios de Trump estén siquiera cerca de estar dispuestos a olvidarla.\n\n“Esta es una historia que seguirá persiguiendo al presidente durante su segundo año de mandato”, declaró Alex Conant, un veterano operador del Partido Republicano. “Las teorías conspirativas sobre Epstein han alcanzado niveles estratosféricos. Y nunca dejaremos de hablar de ello”.\n\nLa incesante intriga en torno a los archivos de Epstein representa uno de los pocos temas que ha abierto una brecha entre Trump y el Partido Republicano que ha liderado durante la última década, exponiendo una vulnerabilidad de la Casa Blanca que resulta aún más frustrante por el hecho de que es en gran medida el resultado de una serie de errores autoinfligidos.\n\nDesde que quedó claro que no podía impedir la publicación de los archivos, Trump ha intentado reunificar al Partido Republicano en torno a un nuevo esfuerzo por vincular directamente a Epstein con el Partido Demócrata.\n\nAl anunciar que había firmado el proyecto de ley, Trump se centró directamente en los demócratas, escribiendo: “Tal vez pronto se revele la verdad sobre estos demócratas y sus vínculos con Jeffrey Epstein”, y añadió: “¡Este último engaño se volverá en contra de los demócratas, como todos los demás!”.\n\nLa ofensiva se ha basado en correos electrónicos de Epstein recientemente divulgados que mencionan a varios demócratas prominentes, junto con numerosas referencias a Trump. Un hecho que los funcionarios de la Casa Blanca esperan que les permita retomar la iniciativa tras meses de asedio. (Comunicarse con Epstein no sería un delito, y no hay evidencia en los correos electrónicos de que alguno de ellos participara en las actividades ilícitas de Epstein).\n\n“De repente surgió una oportunidad real para cambiar la narrativa”, manifestó un funcionario a CNN, señalando que los asesores solo tenían un conocimiento limitado del contenido de los documentos recopilados por el patrimonio de Epstein hasta que una Comisión de la Cámara de Representantes los publicó la semana pasada.\n\nPero este cambio estratégico se produce tras meses de maniobras fallidas, desestimaciones y resistencia manifiesta a la publicación de los archivos, todo lo cual ha mermado la valiosa atención y el tiempo que debería dedicarse a la agenda principal del Gobierno.\n\nEl presidente se enfrenta ahora a algunos de los índices de aprobación más bajos de su mandato hasta la fecha, así como al doble desafío de librar una dura batalla de cara a las elecciones de mitad de mandato mientras mantiene a raya las crecientes divisiones sobre Epstein.\n\n“Creo que el presidente tenía razón al final”, indicó el senador republicano Mike Rounds sobre su apoyo a la medida contra Epstein. “Ahora, lo que está por verse es que tendrán que aprobar ese paquete en muy poco tiempo, y luego dependerá de lo que incluya y de lo que se haya omitido”.\n\nVideo Ad Feedback Sobrevivientes de Epstein dan su testimonio antes de la votación clave en el Congreso 01:00 • Fuente: CNN Sobrevivientes de Epstein dan su testimonio antes de la votación clave en el Congreso 01:00\n\nLa presión para obtener los archivos fue un problema creado por el propio Trump\n\nLa firma de Trump en el proyecto de ley —y el mérito que se atribuyó por su éxito— culminó una presión pública para obtener los archivos que el propio presidente impulsó hace casi un año y medio, después de prometer durante la campaña electoral que publicaría los materiales si resultaba elegido.\n\nSu equipo aprovechó entonces ese compromiso informal como una forma de movilizar a un sector de la base republicana que ha estado obsesionado con los archivos de Epstein y convencido de que implicarían a una serie de figuras poderosas en los abusos sexuales del fallecido financiero a niñas.\n\nEn febrero, la administración aumentó aún más las expectativas cuando Bondi distribuyó carpetas con los “Archivos Epstein” a figuras influyentes conservadoras en la Casa Blanca.\n\nLa maniobra fue un fracaso. Prácticamente toda la información ya era conocida, lo que provocó una reacción negativa de la opinión pública y dio pie a meses de tensiones internas entre altos funcionarios del Departamento de Justicia.\n\nMás tarde, Bondi afirmó que la administración estaba examinando minuciosamente material más reciente, solo para que el Departamento de Justicia anunciara meses después que “no sería apropiada ni justificada ninguna divulgación adicional”.\n\nLa consiguiente tormenta mediática enfrentó a la Casa Blanca con muchas de las figuras de MAGA que habían ayudado al ascenso de Trump, provocó un esfuerzo bipartidista en el Capitolio para forzar la publicación de los archivos y generó una lucha interna para sofocar un asunto que amenazaba con consumir a la administración durante gran parte del verano.\n\nEse esfuerzo se complicó tras las revelaciones que pusieron de manifiesto los vínculos pasados ​​de Trump con Epstein, incluyendo la aparición del nombre del presidente en los archivos. (Trump no ha sido acusado de ningún delito en relación con Epstein).\n\nDentro de la Casa Blanca, los asesores trataron de gestionar las expectativas de sus aliados, intentando explicar que la publicación del resto de los archivos suponía el riesgo de perjudicar a las víctimas y violar la privacidad de personas cuyos nombres figuraban en los documentos pero que no habían sido acusadas de manera creíble de haber cometido irregularidades.\n\nMientras tanto, Trump recurrió repetidamente a las redes sociales para intentar intimidar a los republicanos para que se mantuvieran en fila, insistiendo en que los archivos que una vez prometió publicar no eran más que un “engaño” demócrata. Sin embargo, ninguno de los dos enfoques logró acallar las demandas de mayor transparencia.\n\n“Estamos intentando explicarle a gente que creen en algo que no existe”, dijo un alto funcionario de la Casa Blanca. “Por eso es tan frustrante”.\n\nVideo Ad Feedback Trump firma ley para revelar los archivos del caso Epstein 00:40 • Fuente: CNN Trump firma ley para revelar los archivos del caso Epstein 00:40\n\nUna nueva investigación plantea nuevas preguntas sobre lo que se publicará\n\nEn un momento dado, cuando el esfuerzo del Congreso para forzar la publicación de los archivos de Epstein cobró fuerza, los funcionarios propusieron iniciar la nueva investigación del Departamento de Justicia como una forma de aliviar la presión y evitar que se publicaran más documentos, afirmó un funcionario de la administración.\n\nPero no está claro si Trump tuvo acceso a esa opción. Un empleado de la Casa Blanca afirmó que la idea de investigar a los demócratas surgió después de que la Comisión de Supervisión de la Cámara de Representantes publicara los correos electrónicos la semana pasada. El Departamento de Justicia declinó hacer comentarios.\n\nDurante la rueda de prensa del miércoles, que no guardaba relación con el tema, Bondi indicó que “nueva información” obtenida por los investigadores la había llevado a reabrir el caso Epstein, sin especificar de qué se trataba.\n\nEl viernes pasado, cuando se acercaba la votación en la Cámara de Representantes sobre la publicación de los archivos, Trump solicitó repentinamente al Departamento de Justicia que investigara las conexiones de Epstein con varias figuras afines al Partido Demócrata, entre ellas el expresidente Bill Clinton.\n\nTambién pidió que se investigaran los vínculos del gigante bancario JPMorgan Chase con Epstein. (En respuesta a la investigación, portavoces de Clinton y JPMorgan sostuvieron que no estaban involucrados en los delitos de Epstein).\n\nLa Casa Blanca insiste en que Trump siempre ha estado a favor de la publicación de los archivos.\n\n“El presidente Trump nunca se ha opuesto a la publicación de los archivos de Epstein; al contrario, siempre se ha opuesto a que los republicanos caigan en la trampa demócrata de hablar de esto en lugar de centrarse en las históricas reducciones de impuestos promulgadas, el hecho de que ningún inmigrante ilegal haya entrado en nuestro país en cinco meses y los muchos otros logros de la administración Trump en beneficio del pueblo estadounidense”, declaró la portavoz de la Casa Blanca, Abigail Jackson, en un comunicado a CNN.\n\nDesde que se inició la nueva investigación, varios funcionarios de la Casa Blanca han insistido ante CNN en que Trump no obstaculizará la publicación de los documentos y que sus asesores tienen pocos motivos para creer que la nueva investigación afectará ese proceso, aunque Bondi se negó a ofrecer garantías explícitas el miércoles.\n\nDentro del Departamento de Justicia, algunos funcionarios han lamentado que el apoyo sin precedentes de Trump a la publicación de los archivos represente una situación en la que todos pierden: Bondi y su departamento ahora se enfrentan a directivas contradictorias para llevar a cabo una investigación y, al mismo tiempo, hacer públicos los documentos pertinentes.\n\nEl tardío intento de la Casa Blanca de utilizar los archivos de Epstein como arma política de ataque también ha generado cierto descontento entre sus aliados en el Capitolio y en el entorno más amplio de Trump, que esperaban dejar atrás un período difícil.\n\nEn las últimas dos semanas, según señalaron algunos de estos aliados, Trump supervisó el fin del cierre gubernamental récord, promovió los esfuerzos de la administración en temas clave de asequibilidad y organizó una serie de eventos diplomáticos de alto nivel.\n\nSin embargo, mientras Trump y sus asesores intentan dar la vuelta a la tortilla a los demócratas en el caso Epstein, “esto es de lo único que habla todo el mundo”, comentó Conant.\n\n“El poder de la presidencia reside en la capacidad de marcar la agenda”, añadió. “Y en la medida en que esto supone una distracción, sí que socava lo demás que puede hacer”.\n\nCon información de Hannah Rabinowitz, de CNN.",
  "authors": [
    "Adam Cancryn Evan Pérez",
    "Kristen Holmes",
    "Kaitlan Collins",
    "Por Adam Cancryn",
    "Evan Pérez",
    "Kristen Holmes Y Kaitlan Collins"
  ],
  "url": "https://cnnespanol.cnn.com/2025/11/20/eeuu/trump-cambio-opinion-archivos-epstein-trax"
}