{
  "title": "Professor Answers Neurodiversity Questions",
  "text": "Transcript\n\nHi, I am Matt Lerner.\n\nI am an associate professor and program area leader\n\nat the AJ Drexel Autism Institute.\n\nI'm here today to answer your questions from the internet.\n\nThis is Neurodivergent Support.\n\n[upbeat music]\n\nalaafia_oluwa asks, What exactly does it mean\n\nto be neurodivergent?\n\nGreat question, Alaafia.\n\nNeurodivergent is not a diagnosis,\n\nIt doesn't exist in the DSM, Diagnostic Statistical Manual.\n\nIt is a description\n\nthat has sort of emerged from the community.\n\nIt's really meant to describe the whole set of differences\n\nof ways of either perceiving the world,\n\ninteracting in the world,\n\nways of being in the world,\n\nand really ways brains working, right,\n\nthat's the neuro part,\n\nthat is kind of different from the norm\n\nin a way that might make it more difficult\n\nto kind of click in and feel connected,\n\nand kind of at pace with the rest of the social world.\n\nNem_Jem asks, Do you see the words physically jumping\n\naround the page and moving\n\nor just in the wrong location?\n\nSo this is the question about dyslexia.\n\nSo I'd like to give you an illustration\n\nof kind of what that looks like.\n\nUp here, you probably see the words the way\n\nthat you typically see them on a page.\n\nThey're standing still.\n\nThey're in the place\n\nthat you expect them to be.\n\nThey stay there.\n\nAnd you kind of read them in order.\n\nDown here, you see the way that many, not all,\n\nbut many dyslexic people view these words.\n\nSo you can see they, you know, might be\n\na little bit jumbled around.\n\nMaybe the order is flipped or switched,\n\nbut they're kind of not staying put\n\nand doing the things in the order that you need to be able\n\nto read them fluently and fluidly.\n\nAnd so folks with dyslexia are often doing this extra\n\ncognitive effort of trying to figure out,\n\nnot just what does this say,\n\nbut when I look at it,\n\nwhat do I think it's sort of meant to say?\n\nAnd how do I get the letters\n\nto look the way they're supposed to look so that it does?\n\nTheAspieWorld asks, Autism social masking:\n\nwhat is it and why do we do it?\n\nThere's this term called masking or camouflaging.\n\nSometimes it's called PAN, or passing as non-autistic.\n\nEssentially these are all different terms\n\nfor when autistic people are either working hard\n\nto present as not autistic,\n\nor to kind of minimize their autism features,\n\nor when autistic people are doing that,\n\nwhether or not they're doing it intentionally,\n\nmaybe because that's just kind of how they've learned\n\nor where they've learned.\n\nWhat it is, still, there's a lot of research into it,\n\nbut it's generally this idea of sort of effortfully trying\n\nto impede doing things that autistic people do to fit in.\n\nSo many autistic people like to use, you know,\n\nfidgets and things like this, right?\n\nAnd, you know, maybe they'll not have a fidget nearby.\n\nOr many autistic people might have a particular topic\n\nor thing that they like to talk about socially\n\nor like to talk about is their interest.\n\nMaybe they won't do that in certain contexts.\n\nMany autistic people, for instance, say that eye contact,\n\nthe thing I'm doing with you right now into this camera,\n\nis uncomfortable, or it's hard to do,\n\nbut many autistic people who are masking or camouflaging\n\nmight force themselves to do that,\n\neven if it's uncomfortable.\n\nAll of those are efforts\n\nto try to sort of fit into this neurotypical world.\n\nSome emerging research suggests that that is really,\n\nthat can be taxing,\n\nthat it's sort of using up a lot of cognitive resources,\n\nbrain resources, effort, emotional resources\n\nto try to do that to fit in.\n\nBut one thing we hear a lot from the autism community\n\nis that over time it can be taxing.\n\nThere's some evidence, some emerging evidence\n\nthat it can be related to things\n\nlike anxiety and depression,\n\nbecause if you're working that hard,\n\nyou're sort of spending yourself out.\n\nSo finding ways to help autistic people\n\nnot have to mask quite so much\n\nso that they can be their authentic selves\n\nseems like an important goal.\n\nTeslaCox asks, How do I tell my real doctor\n\nthat I've been diagnosed neurodivergent\n\nwith ADHD from TikTok doctors?\n\nOkay, let's break this one down a little bit.\n\nYou can't be diagnosed neurodivergent.\n\nLike we said, it's not a formal diagnosis.\n\nNumber two, I'm not sure what a TikTok doctor is per se.\n\nThe important thing here though,\n\nthat TeslaCox is getting at is, you know,\n\nthere is a wealth of information now,\n\ndeluge of information online about neurodivergence,\n\nabout different ways of being,\n\npeople sharing their own experiences,\n\nsometimes people who are clinicians\n\nproviding their own insights online on the internet,\n\nand it's great to have access\n\nto the end of that information.\n\nThe key thing to understand, though,\n\nis that that information is not always accurate\n\nin reference to our actual diagnostic categories\n\nthat you could get from a doctor\n\nand get covered by your insurance or anything.\n\nIn fact, some studies have suggested,\n\nstudies of both presentations of autism on TikTok,\n\npresentations of ADHD on TikTok,\n\nhave shown that well over 50% of the features\n\nsaid to be associated with ADHD or autism in TikTok\n\naren't part of the diagnostic category.\n\nSo what does this mean?\n\nWhat do you do?\n\nNumber one probably wouldn't go to your real doctor\n\nand say, TikTok told me I have this.\n\nBut what you might do is say, gosh, I was, you know,\n\nwatching these videos on TikTok,\n\nand it kind of struck a chord with me,\n\nand it made me wanna know more.\n\nAnd I think that's what this stuff can be good for.\n\nIt can help you to open the door to say, gosh,\n\nif there are things that have been harder\n\nfor me than I thought, or things that were hard for me,\n\nbut it never occurred to me that it wasn't hard\n\nfor everybody, what do I do with that?\n\nThat's a really good thing to take to a doctor\n\nto get their feedback.\n\nSerious_Toe9303 asks,\n\nIs 'Love on the Spectrum' a good representation\n\nof autism and are there better ones?\n\nThat's a great question.\n\nLove on the spectrum is one of a small\n\nbut growing number of shows\n\nthat has actually autistic people being portrayed.\n\nSome aspects of the portrayal\n\nand those relationships are kind of made for TV,\n\nlike a lot of reality TV.\n\nBut I think what's really valuable about it\n\nis that it's taking seriously the fact\n\nthat the best way to know autistic people\n\nor any neurodivergent person\n\nis to actually get to know them,\n\nand see them, and see how that community presents itself.\n\nSo if the question is, are there better ones,\n\nI think the best representations\n\nare by autistic people representing themselves\n\nand their own experiences,\n\neither autistic actors acting\n\nor autistic people living\n\nand sharing their own experience\n\nso that we are not caricaturing,\n\nbut truly trying to appreciate all of the different ways\n\nthat autistic and other neurodivergent people\n\nlive and experience their world.\n\nCobainyWhitte1 asks, What are signs of autism?\n\nThe features of autism fit into two general categories,\n\nsocial communication and restricted and repetitive behaviors\n\nand kind of sensory stuff?\n\nSo social and communication\n\nmight be kind of really straightforward difficulties\n\nwith communication, language development,\n\nkind of speaking and communicating in kind of the ways\n\nthat are expected for a person's development,\n\nas well as more complex and subtle social challenges,\n\nlike coordinating and social interaction,\n\nfriendship making and connection, eye contact,\n\nnonverbal cues, picking up social nuance,\n\nall features like that.\n\nThat's the social communication side.\n\nIn the other side,\n\nthe kind of restricted repetitive behavior side,\n\nyou might have somebody\n\nwho has like a really restricted interest or focus.\n\nIt could be like a topic that they're really interested in\n\nor it could be, you know,\n\na child who runs a car back and forth over and over again\n\non the table or on their hand.\n\nYou also might have repetition of, you know,\n\ncertain words or phrases over and over again.\n\nThere's this concept called echolalia\n\nwhere somebody kind of hears something\n\nand then kind of keeps echoing it back\n\nover, and over, and over.\n\nAnd this also kinda loads on\n\nwith these sensory features of autism.\n\nSome folks on the spectrum again\n\ncan be very sensitive to touch, or smell,\n\nor taste, or sounds, or lights,\n\nand that those kind of sensitivities\n\ncan make it very difficult to be in those environments.\n\nPeople might, you know, cover their ears\n\nand need earplugs to be able to manage certain settings.\n\nLights like, like the ones in the room that I'm in right now\n\nmight feel very bright and overwhelming.\n\nThey also might engage in something called stimming,\n\nwhich is a way in which, you know,\n\nfolks on the spectrum might use something like this\n\nand kind of, you know, over and over again\n\nkinda move it around as a way\n\nto kind of feel good.\n\nBut really, it's a way to kind of regulate\n\nand manage that sensory experience.\n\nFolks on the spectrum have lots of different kinds of stims.\n\nThey might hum, auditory stims.\n\nThey might have visual stems,\n\nlike looking at their hands and finger flicking\n\noutta the corner of their eye.\n\nAnd some folks have larger stims, like rocking\n\nor even hand flapping or pacing back and forth.\n\nZoeBlade asks, What is and isn't stimming?\n\nSo stimming is a term in the autism world, autism field,\n\nsort of a colloquial term for self stimulatory behavior.\n\nYou know, kind of traditional sort of ideas of stimming\n\nmight be things like rocking, flapping.\n\nThere's this finger flicking thing\n\nthat many autistic kids do,\n\nbut it might also involve taking a toy\n\nand kind of, you know, playing with it\n\nlike this over and over again.\n\nAnd some people do auditory stimming,\n\nlike humming or maybe saying a word over and over again.\n\nSo again, there can be visual.\n\nThere can be tactile.\n\nThere can be auditory.\n\nThe best evidence about stimming\n\nis that it is a tool that autistic people are using\n\nto kind of regulate their sensory system,\n\nwhich can often get a little bit overwhelmed\n\nand kind of putting that energy somewhere.\n\nJaiCartier3 asks, Is autism really on the rise?\n\nAre we just better at identifying it these days?\n\nWhen we think about the rise in autism,\n\nwe think about four sets of factors that could be happening.\n\nNumber one, change in diagnostic criteria.\n\nSo when you look at the the DSM,\n\nor the diagnostic Bible, you know,\n\nback in the 1980s or even earlier,\n\nthere were fewer ways to have autism\n\nand they generally required\n\nmuch more significant challenges to be on board.\n\nYou know, somebody who is developing language\n\nat a sort of usual rate,\n\nand is integrated into school\n\nwould have a lot of trouble\n\neven getting an autism diagnosis.\n\nThose folks were there,\n\nbut they weren't getting autism diagnoses\n\nback in the '80s, '70s, earlier.\n\nIt really wasn't until the DSM-IV in the mid '90s\n\nthat we even had these sort of broader criteria,\n\nbroader ways of having an autism diagnosis.\n\nAnd so that change alone has dramatically expanded\n\nthe ways to even be diagnosed as autistic.\n\nSo that's contributed a huge amount to the rise.\n\nThe second is a broader awareness.\n\nAnd these things go hand in hand.\n\nAnd so yeah, somebody who's going to their, you know,\n\ndoctor somewhere in the middle\n\nof like a rural county in the middle of the country,\n\nthat doctor, you know, 20, 30 years ago\n\nmay have never seen an autistic person\n\nand may have never even thought to look for autism.\n\nBut now we know more about autism,\n\nthere are more representations in the media,\n\nthere's much broader awareness,\n\nand once folks start to see somebody who's autistic\n\nin their practice or in their world,\n\nthey go, Oh yeah, I can kind of notice that.\n\nThe third thing has to do with changes in stigma\n\nand how autism is viewed.\n\nSo because of the first two things, all of a sudden,\n\nyou know, the ideas, it used to be that, you know,\n\ngetting diagnosed with autism was quite scary for families.\n\nFor some it might still be,\n\nbut much more commonly the idea was what is that,\n\nand what's gonna happen to my child?\n\nThe last thing,\n\nthe fourth is a true rise in autism,\n\neven after correcting for population growth\n\nand understanding that the populations grow over time.\n\nThe best we can tell\n\nfrom really good epidemiological research\n\nover many, many years looking at millions of people\n\nis that the vast majority\n\nof the rise in autism is attributed\n\nto the first three things.\n\nThat is most of why autism is on the rise.\n\nQuinnTheCats asks,\n\nThis is about to sound like the dumbest question ever,\n\nbut what exactly is ADHD?\n\nIt's not a dumb question, QuinnTheCats.\n\nThere are kind of three types of ADHD,\n\nand they kind of each answer the question.\n\nOne is ADHD, inattentive type,\n\nso meaning folks with ADHD inattentive type\n\nstruggle to pay attention, maintain attention.\n\nThey might seem to sort of, you know,\n\nwander off or have trouble kind of staying engaged\n\nin a conversation or on a topic.\n\nThey might struggle academically as a result of this.\n\nThen, there's what's called ADHD hyperactive type.\n\nAnd these are kids who kind of move all around the place,\n\nhave trouble controlling their bodies,\n\nhave trouble sitting still.\n\nThere's a item on kind of the ADHD questionnaire\n\nthat says, Acts as if driven by a motor.\n\nAnd I feel like this is the one when I talk\n\nto parents often, they're like, Yeah, that one.\n\nHe acts like he's driven by a motor,\n\nand the motor doesn't stop.\n\nAnd then there is ADHD-C, which is the most common,\n\nwhich is the combined type,\n\nwhich is basically the inattentive stuff\n\nand the hyperactive stuff all mushed together.\n\nA redditer asks, What did people with autism\n\ndo in the past?\n\nSo the answer is that people with autism in the past\n\ndid the same things other people did.\n\nThey existed out in the world.\n\nThere's a book called Autism in History\n\nthat profiles a lord, kind of sub-lord from the countryside\n\nthat makes the case\n\nthat this particular person was autistic.\n\nThe idea is that he happened to be in an environment\n\nwhere his quirky way of being was notable.\n\nHe showed up, a lot of the stuff comes from court documents,\n\nbut he had kind of all these supports,\n\nand resources, and things around him,\n\nand he kind of went about his life\n\nin his kind of very unique and particular way.\n\nSo in that book, the court documents describe him\n\nas having odd sorts of movements.\n\nThey would say he would sort of ramble on in ways\n\nthat they considered to be, you know, incoherent,\n\nbut they said not unintelligible,\n\nthat, you know, they sort of were streams\n\nof meaningful words and sentences,\n\nbut that they didn't really have a way to contextualize\n\nwhat he was saying and meaning,\n\nsort of in the same way\n\nthat somebody on the spectrum might, you know,\n\nhave a real strong, what we call perseverative interest,\n\nlike a fixation, just sort of talk about that\n\nwithout necessarily checking\n\nthat the other person is following along\n\nwith what they're saying.\n\nDescriptionMean9351 asks,\n\nPeople keep saying\n\nthat I can't have Tourettes because I developed it at two.\n\nPeople say you have to be born with it.\n\nYou can develop ticks later on.\n\nAnd there are lots of different reasons\n\nand ways that ticks can kind of onset later.\n\nBut yes, a person can start to develop ticks at two\n\nor even later than that.\n\niscreweduprealbad asks, My ticks feel half voluntary?\n\nQuestion mark.\n\nSo this is about Tourettes and other tick conditions.\n\nSo ticks are kind of an interesting phenomenon.\n\nOne way that people think about ticks\n\nis there's this sort of like surge of a feeling,\n\na need to do a thing, and that that surge\n\nis like a wave that's cresting over a person,\n\nand kind of can't be stopped.\n\nThe kind of historical way of thinking about it\n\nthat psychologists sometimes say is that it's easier\n\nto stop a tick once it starts\n\nthan to stop a tick from starting.\n\nSo half voluntary.\n\nThe idea is that the sort of surge of the wave,\n\nthat kind of compulsion that comes from the tick is\n\nmight be able to be kind of diverted, right?\n\nMaybe the idea is that, you know,\n\nif a person can feel it coming on,\n\nthey might be able to say,\n\nall right, I'm gonna, you know, do this motion\n\nbut not that,\n\nor I'm going to do my best to kind of hold it back.\n\nSo there's almost like this...\n\nIt's like you can put a canal along the wave\n\nthat you can kind of pick something about it,\n\neven if you can't pick it.\n\nPaperJoshi asks,\n\nI never understood\n\nhow hyperfocus is a symptom of ADHD.\n\nIt's a really good question.\n\nSo ADHD broadly has to do\n\nwith, you know, sort of difficulties sustaining attention,\n\nkind of hyperactivity, maybe working memory problems.\n\nSo how is it the case that folks\n\nwith ADHD can hyperfocus if their problem is focus?\n\nWell, one way to think about it is ADHD\n\ncan almost be seen as difficulty\n\nwith the sort of lever that regulates your focus.\n\nOften what we have to do throughout our day\n\nis take our focus and kind of pivot it somewhere else\n\nand say, I'm focusing over here, I'm focusing over here.\n\nI have to give you my attention now,\n\nand I have to keep doing it\n\nfor as long as you need me to pay attention to you.\n\nThat is what our brains are doing.\n\nFolks with ADHD might struggle to kind of do that shifting\n\nat the rate and the way that people want.\n\nSo they might kind of get stuck in, like,\n\nI can't really hold my focus here\n\nso I'm gonna kind of keep bouncing around.\n\nBut they also, when they do find something\n\nthat is motivating, that is engaging,\n\nthat they're interested in,\n\nit's sort of like then they're locked into that,\n\nand can't quite yank that lever off of that topic.\n\nA redditer asks,\n\nDoes reading improve with practice for dyslexics?\n\nThe thing for dyslexic people\n\nis that the strategies\n\nthat they need to use to get the words\n\nto behave the way that they need them to be able to read\n\nare learnable, are teachable.\n\nThey can take effort,\n\nbut then that effort, like a muscle,\n\ncan get flexed and built over time.\n\nAnd so in a similar way as that, right,\n\nfolks, if they are practicing using those skills\n\nand strategies effectively,\n\nthings can get a little bit easier,\n\nbut fundamentally they're still managing\n\nkind of a different way of perceiving\n\nthat information to make it work for them.\n\nQgirl50 asks, Is autism genetic?\n\nHave they identified a gene?\n\nA lot of very smart autism researchers\n\nover the last 20 years\n\nhave done the kind of work that you do in a Petri dish\n\nwith a DNA sequence.\n\nThey've done the kind of work\n\nwhere you look at really gigantic populations of people\n\nand look at kind of genetic markers.\n\nAnd what they found is actually\n\nmore, and more, and more specific genes,\n\nareas on the human genome,\n\nthat seem to be related to autism\n\nthat have again this idea of sort\n\nof like an autism load to them.\n\nAnd there's certain ones where they call them loci,\n\nsort of areas on the gene of the DNA strand\n\nthat if there's a little bit of a difference,\n\nmaybe you can might see a little bit of autism features.\n\nSometimes if there's a lot of a difference,\n\nyou might see more features.\n\nSo all together, what this suggests to us\n\nis a lot, actually well over 50,\n\nsome estimate at least 70% or more\n\nof variation amount of autism that's sort of out there\n\nin the world is attributable to to genetic factors.\n\nTitanicMan asks, Is there a reason\n\nwhy some people with Tourettes\n\nhave swear words specifically as their tick?\n\nOf all the words that could be their tick,\n\nwhy is it almost always profanity?\n\nSo this is partially myth\n\nand misunderstanding and partially not.\n\nSo it turns out a lot of ticks are not profanity.\n\nMany folks with Tourettes have much subtler presentations.\n\nYou know, they might be really small ticks,\n\nlittle motor tick, you know, a slight smirk,\n\nor a twitch of the eye or, you know,\n\nkind of a little head tick that can happen,\n\nand those are actually much, much more common.\n\nThey're not as attention grabbing,\n\nand so people don't necessarily notice them,\n\nand call attention to them quite as much.\n\nAnd so yeah, it's not the case that most people\n\nwith Tourettes for instance,\n\nhave swear words as their ticks.\n\nIt is the case though that there are a subset of folks\n\nwhere their ticks are profanity.\n\nIt's a little bit complicated as to why,\n\nand there's a lot of interesting research\n\nkind of trying to understand this question.\n\nThe best that I understand is that\n\nto some extent ticks do have to do with\n\nthis kind of motivation\n\nand self-regulatory system, right?\n\nThere's this sort of urge, sort of surge,\n\nlike you said before,\n\nand then this kind of, you know, pullback.\n\nAnd the thing is, there are lots of things that we try\n\nto self-regulate about during the day, right?\n\nWe try not to have road rage.\n\nWe try not to steal our siblings candy\n\nwhen it's sitting next to them.\n\nAnd we try not to swear.\n\nThere's, you know, some evidence that suggests that,\n\nyou know, that process might be getting wrapped up\n\nfor those folks,\n\nthat there's this sort of self-regulatory thing,\n\nI'm not gonna do it,\n\nand the brain is kind of like,\n\nalright, I'm gonna push through the thing\n\nI really don't wanna do right now,\n\nI'm not meant to do right now.\n\nAnd it becomes that thing,\n\nand then it gets stuck.\n\nThat's one of the, I think, more intriguing ideas\n\nas to why when it's profanity, why it's that.\n\nestellalikessalt says,\n\nGenuine question.\n\nIf ADHD is viewed as a problem\n\nto where medication is taken for it,\n\nwhy is it not the same with autism?\n\nThis is a genuine curiosity.\n\nI'm not saying that either should be medicated.\n\nPlease don't take this,\n\nas I'm saying autism should be medicated.\n\nAppreciate the sensitivity Estella.\n\nThe answer actually is that has less to do with the idea\n\nthat the medical field thinks\n\nthat one should and the other shouldn't.\n\nIt actually has to do with the available\n\nmedications that exist.\n\nADHD since the '80s has stimulant medications,\n\nand then now other types of medications that help\n\nto manage attention, and focus, and self-regulation.\n\nFor autism the sort of quest\n\nfor medication has even, you know,\n\nassuming that you sort of believe\n\nin medication as being important,\n\nwhich, you know, many do,\n\nhas been a lot more fraught.\n\nAs I've described,\n\nautism has these sort of two core areas, right?\n\nSocial communication, restrictive repetitive behavior,\n\nand we've really, we haven't found many things\n\nthat can really on their own help\n\nwith the social communication piece.\n\nSocial stuff is a lot more complicated\n\nthan regulating attention.\n\nSame thing for restricted repetitive behaviors.\n\nThere's sort of some evidence of some things\n\nthat can help a little bit if folks\n\nare like really, really struggling a lot with those things.\n\nBut for the most part that's a lot more difficult too.\n\nThere are a couple of medications that are FDA approved\n\nto address things like significant aggression\n\nin folks on the spectrum,\n\nbut that's really only for the subset\n\nof people who are experiencing those challenges.\n\nAnd importantly, you might notice\n\nthat's not a core part of autism.\n\nA Reddit user asks,\n\nIs there a way to treat ADHD without meds?\n\nGreat question.\n\nSo yes, there are behavioral\n\nand psychological treatments for ADHD\n\nand within, you know, kids and adults.\n\nIn childhood, there are a number\n\nof kind of what are called like behavioral parent training\n\nor, you know, parent management type approaches,\n\nwhich involve helping to kind of boost\n\nwhat's called, like, the salience\n\nor the ways in which, you know,\n\nthings that kids with ADHD might miss\n\nthat they kind of need to do.\n\nHelps them kind of attend to it\n\nby giving them lots and lots of reward,\n\nand support, and attention for kind of getting it, right?\n\n'Cause many ADHD kids, they kind of might know what to do\n\nor have a sense of what to do\n\nbut they kind of miss it in the moment\n\nor they can't figure out how to translate\n\nthat knowing into doing.\n\nbasbillions asks, What does 'on the spectrum' mean?\n\nAutism is also called autism spectrum disorder in the DSM.\n\nEven though lots of different things\n\nare spectra, spectrums, lots of different conditions,\n\nautism has sort of come to be referred to\n\nas sort of the spectrum.\n\nAnd what's really interesting\n\nis that autism has undergone an incredible evolution\n\nover the last several decades.\n\nAs recently as the '70s or '80s,\n\npeople thought of autism\n\nas the most categorical thing.\n\nYou could go to, you know, psychiatry conferences\n\nand famous psychiatrists would say things like,\n\nwell, if there's anything that can be diagnosed\n\nin a waiting room by watching a child for a few minutes,\n\nsurely it's autism.\n\nBecause the idea is that autism\n\nwas seen as so different, so categorical,\n\nthat you could kind of just spot autism\n\nwhen you see it.\n\nAnd now it's swung all the way the other way\n\nfrom really seeing this so dramatically different\n\nthat you could just sort of spot autism anywhere\n\nto being the spectrum, the spectrum,\n\nthe thing that is not about categorical difference at all.\n\nAnd I think this tells us a lot\n\nabout our evolving understanding of autism,\n\nbut also our evolving understanding\n\nof the individual differences between people.\n\nA Reddit user asks, How does the brain structure\n\nof autistic people differ?\n\nLots of really interesting research has gone into this.\n\nWell, I think one of the big things\n\nI would say we do know more and more about these days\n\nis the idea of kind\n\nof the connections of autism.\n\nThere's this fancy term, a connectopathy.\n\nIt's a $10 million word there,\n\nbut the idea that autism can be defined\n\nby a difference in the way the brain\n\ninterconnects with itself.\n\nAnd while this is still evolving, broadly speaking,\n\nthere's this idea that autism\n\nhas a lot more connections.\n\nAutistic brains have a lot more connections kind of locally,\n\nkind of close by, little short distance neuron connections,\n\nbut that globally, kind of long distance connections\n\nacross different regions of the brain,\n\nthere seem to be fewer of them.\n\nAnd, actually even some thought that this might help\n\nto explain some, some parts\n\nof what we understand about autism.\n\n'Cause maybe those short distance connections, you know,\n\nthey might be telling us something\n\nabout some of the difficulties in sensory processing.\n\nIt might be like, you know,\n\nif you've got all these short distance connections going,\n\nfire, fire, fire, fire, fire, it might be harder, you know,\n\nif things are really loud\n\nor things are really bright to manage that.\n\nBut then, those longer distance connections,\n\nwhich are used maybe\n\nfor a more broader processing, or development, or learning,\n\nthose, if they're sparser, might take longer.\n\nIt might be more difficult for those connections\n\nto kind of grow and learn.\n\nArktokosO2 says,\n\nWhat age do you think it would be appropriate\n\nto diagnose someone with autism?\n\nSo one thing we do know is that autism\n\nis by and large with you at birth.\n\nSo by the time somebody is born,\n\ntheir brain is sort of wired up in that direction,\n\nif they are autistic.\n\nThose developmental trajectories\n\ncan change one way or another\n\nin a variety of different ways.\n\nBut that's by and large what we know.\n\nSo one of the goals actually is to get diagnosis,\n\nas early as possible\n\nso that there can be support\n\nas early as possible.\n\nEarly intervention and other kinds of supports\n\nwhich you can get in, you know,\n\nevery state in America,\n\nwe wanna make sure that those things are available\n\nso that folks have the best opportunity.\n\nFor years it was thought that three\n\nmight be kind of on the earliest side, you know.\n\nThen, we sort of push to two,\n\nand I would say, you know, clinically it's now possible\n\nusing some of our best diagnostic tools\n\nto diagnose toddlers even down to like 18 months,\n\nsome even down to 12 months using our clinical tools.\n\nBut increasingly, diagnostic science\n\nand autism has really been picking up\n\nand there are are now some cutting edge studies\n\nusing tools like some kinds of brain imaging\n\nand eye tracking that are promising for diagnosing autism\n\nas young as six months and maybe even younger.\n\nSo let's see where that goes.\n\nJudicialreview asks, Does autism correlate with IQ\n\nor does high IQ correlate with autism?\n\nHeadline here is that autism\n\ndoes not really correlate with IQ.\n\nAutism does not discriminate by race, color,\n\nIQ, or other features.\n\nAutism exists everywhere in the world\n\nacross the whole spectrum of being.\n\nI think that interesting kind of tricky question here\n\nis that very often because of the different ways of thinking\n\nand processing that autistic people have,\n\nperformance of autistic people on IQ tests\n\ncan be really different.\n\nYou can have these big splits\n\nor sort of islands of ability where somebody might seem\n\nto have really strong verbal ability,\n\nbut then much less strong ability in other areas,\n\nlike processing speed, or self-regulation,\n\nor visual perception.\n\nOr it might be the other way.\n\nThey might have great, you know, visual perception\n\nor processing ability\n\nand less ability in spoken language.\n\nPipDBurley asks\n\nWhat myths about autism annoy you?\n\nWhat is the reality versus the myth?\n\nThere are a lot of myths about autism,\n\nbut probably the one\n\nthat is often most frustrating\n\nis the idea that autistic people lack empathy\n\nand can't understand the feelings of others.\n\nThis is very common kind of colloquial idea\n\nthat comes out of sort of observing autistic people\n\nkind of seeming disconnected\n\nand sort of seeming not to pay attention\n\nto the needs of other people,\n\nseeming off to be in their own world, right?\n\nAutism, literally from the Greek, you know, means self-ism.\n\nAutos is self.\n\nAnd so there's this notion, I think this implicit notion\n\nthat autistic people are self-ish,\n\nthat they're sort of focused on their own needs,\n\nand can't really feel those of others,\n\nbut actually, one, actually autistic people\n\nwill tell us all the time that that's not true,\n\nthat that's not their experience at all,\n\nthat maybe they might struggle\n\nto communicate their understanding in the same way,\n\nbut that they can very much\n\nand increasingly research,\n\neven on very young and even, you know,\n\nminimally verbal autistic people,\n\nshows us that myth really is a myth,\n\nthat autistic children and adults do co-feel.\n\nThey can empathize,\n\noften sometimes quite profoundly,\n\nin fact, so much so that they're overwhelmed\n\nby, you know, the feeling of another person.\n\nAnd that itself might interfere\n\nwith the ability to express it.\n\nThat's all the questions for today.\n\nHope you learned something.\n\nUntil next time.\n\n[upbeat music]",
  "authors": [
    "Condé Nast"
  ],
  "url": "https://www.wired.com/video/watch/tech-support-professor-answers-neurodiversity-questions"
}