{
  "title": "Is it weird facelifts are becoming normalized, or am I being too judgmental?",
  "text": "Dear Ugly,\n\nI’m 36 and I don’t need or want a facelift – but lately I feel like I’m being made to want a facelift. Is it weird that facelifts are becoming normalized for women my age, or am I being too judgmental?\n\nWhy do I want this even though I don’t want this? Are there any risks or side effects that might sober me up enough to commit to not getting a facelift in the future? I feel like I’m going crazy.\n\n– Maybe I Need A Lobotomy Instead?\n\nYou do not need a lobotomy – but only because beauty culture has basically lobotomized us all already, by “reducing the complexity of psychic life”. (At least, that’s how psychiatrist Maurice Partridge once described the effects of the barbaric brain surgery.)\n\nFeeling “self-conscious”? Skip the inner work – get a facelift! Dealing with “irrelevance” in the office? Don’t question the prioritization of labor above all – get a facelift! Struggling to “recognize” yourself as you age? Forget reckoning with your mortality – get a facelift! “Dissatisfied” with how you look on FaceTime calls? Why bother grappling with appearance anxiety in therapy when you could just … get a facelift?\n\nJudging by the many recent articles on the growing popularity of this elective cosmetic surgery, pulled-taut skin is the answer to all of life’s psychic ills.\n\nThis fantasy is reflected in the figures: the number of facelifts performed in the United States increased an impressive (or depressive?) 17% since the start of the pandemic. Google searches for “facelift” doubled over the same time period. “[Plastic surgery] patients are now 10 years younger as compared to pre-pandemic,” New York-based plastic surgeon Dr Robert Schwarcz revealed in a press release, “and are coming in their mid-30s instead of mid-40s.”\n\nPlenty of celebrities and influencers have publicly confirmed their lifts as of late, including Kris Jenner (70), Catt Sadler (51) and Vanessa Giuliani (36). On her new album, Lily Allen, 40, sings, “I feel so drawn, so old / I booked myself a facelift”. Actor Jennifer Lawrence, 35, just told the New Yorker: “Believe me, I’m gonna [get one]!” Rhytidectomy-mania has even reached “regular” folks: real estate agents, dudes at the gym, young women on payment plans with their plastic surgeons.\n\nIt’s no wonder you (kind of) want one! This is how desire works.\n\nContrary to the beauty industry’s favorite marketing line – “do it for you!” – no desire springs authentic and unbidden from the depths of one’s innermost soul. Rather, as philosopher René Girard argued in his 1961 theory of “mimetic desire”, all human desire is derivative. We want the things we want, in other words – the Labubu, the barrel jeans, the de-aged face – because other people want them.\n\nMimesis “is to psychology what gravity is to physics”, Girard scholar James Alison wrote in the 1998 book The Joy of Being Wrong: powerful, unavoidable, universal.\n\nWhen it comes to beauty specifically, what we want to look like changes as technology changes what it’s possible to look like. New facelift innovations – less invasive techniques, more “natural” results, subtler scars, faster recovery times, Buy Now Pay Later – lower the barrier to entry. Access is democratized; demand skyrockets.\n\nThe “cosmetic transparency” movement also plays a part here. Celebrities who openly share the procedures they’ve had destigmatize cosmetic work and provide people with the blueprints to A-list beauty. In a media announcement, New York-based plastic surgeon Dr Ari Hoschander said he believes “this growing openness toward plastic surgery … is one of the reasons why younger patients are seeking these procedures”.\n\nAll of this contributes to what I call aesthetic inflation, or the normalization of more and more extreme cosmetic interventions over time.\n\nIn summation: You’re right. You are being “made to want” a facelift.\n\nPersonally, I think the number one reason you shouldn’t get a facelift is – in your own words – you don’t want one. But there are plenty of other reasons to opt out, too!\n\nskip past newsletter promotion Sign up to Well Actually Free weekly newsletter Practical advice, expert insights and answers to your questions about how to live a good life Enter your email address Sign up Privacy Notice: Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on theguardian.com to send you this newsletter. You can complete full registration at any time. For more information about how we use your data see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nMore from Jessica DeFino:\n\nBesides an aesthetically “botched” outcome, complications from facelift surgery can include hematoma, infection, nerve damage, hair loss, scarring, deep vein thrombosis, pulmonary embolism and, in exceedingly rare cases, death (the ultimate anti-ager!). What’s more, “adverse psychological reactions to facelift operations are shown to occur in about 50% of patients, with depression and anxiety being the most common,” according to a 2022 paper in the Aesthetic Surgery Journal.\n\nThe procedure can cost anywhere from $8,500 to $200,000. That’s enough for a potential down payment on a home, a car, a vacation, years of psychoanalysis or a sizable donation to the National Center to Reframe Aging.\n\nFacelifts also perpetuate ageist, classist, all-around-oppressive beauty norms. (Of course, facelifts are motivated by ageism, classism and oppression as well, but crucially, do little to alleviate the material disadvantages individuals experience because of these systems and do nothing to challenge these systems – as opposed to, say, gender-affirming surgery, which does challenge limiting gender ideology.) And since “individual acts of conformity can strengthen these norms”, in the words of political philosopher Dr Clare Chambers, “individual acts of resistance really can matter”.\n\nLast but not least: it is a little weird that beauty culture is convincing so many people to surgically saw off some of their facial skin and sew it back on tighter.\n\nAm I being judgmental? Yes! But judgment, like mimetic desire, is both human and unavoidable. We judge. We can’t help it. (Beauty itself is a judgment; see: Kant’s 1790 treatise on beauty, which is literally titled The Critique of Judgment.)\n\nSo if we must judge – and we must! – I guess I’d rather find it strange to get a facelift at 36 than find it strange to age.",
  "authors": [
    "Jessica Defino"
  ],
  "url": "https://www.theguardian.com/lifeandstyle/2025/nov/20/why-do-i-want-a-facelift"
}