{
  "title": "Gobierno de Colombia niega apoyar una salida negociada de Maduro tras declaraciones de su canciller",
  "text": "CNN Español —\n\nEl Gobierno de Colombia negó que apoye un plan para una salida negociada del poder del presidente de Venezuela, Nicolás Maduro, luego de una entrevista de la canciller de Colombia, publicada el miércoles, en la que habló de esa posibilidad y se mostró a favor de un eventual plan para un cambio de gobierno en el país vecino.\n\n“La información que ha circulado en las últimas horas en medios de comunicación sobre un supuesto apoyo de Colombia a un plan para salida negociada de Nicolás Maduro del poder no corresponde a lo expresado por la canciller (Rosa) Villavicencio Mapy en la entrevista”, dijo el Ministerio de Exteriores en un comunicado.\n\nEl Gobierno de Colombia “no tiene injerencia en los asuntos internos de los demás países y respeta la soberanía del hermano país de Venezuela”, agrega el texto, que habla de “información descontextualizada” en medios de comunicación.\n\nVillavicencio, según los audios publicados por Bloomberg, declaró en Madrid que Maduro podría aceptar un planteamiento de ese tipo. “Creo que de hecho lo ha considerado, que puede haber una salida, una transición, donde él pueda irse sin que tenga que pasar a lo mejor por la cárcel y que venga alguien que pueda hacer esa transición y que pueda haber unas elecciones que estén legitimadas con un proceso transparente, sería lo más sano”, expresó.\n\nAunque no profundizó sobre la postura de Bogotá, la canciller afirmó que “sería lo más sano” y aseguró que Maduro “estaría por aceptarlo”.\n\nLas especulaciones sobre un acuerdo transcurren en medio de declaraciones de Maduro y del presidente de Estados Unidos, Donald Trump, sobre un posible diálogo entre Caracas y Washington. El lunes, Trump dijo que conversaría con Maduro “en algún momento”, y el líder chavista respondió horas después: “Cualquiera que quiera hablar con Venezuela hablará cara a cara”.\n\nEn otra entrevista del miércoles con la agencia EFE, la canciller Villavicencio rechazó los ataques de Estados Unidos contra embarcaciones que supuestamente llevan drogas en el Pacífico y el Caribe y abogó por el diálogo: “Nosotros seguimos tendiendo la mano diciéndole que queremos el diálogo político, el diálogo diplomático para resolver cualquier conflicto, cualquier opinión distinta que ellos tengan en el trabajo de lucha contra el narcotráfico”.\n\nLa canciller de Colombia, Rosa Yolanda Villavicencio en Bogotá el 19 de septiembre de 2025. LUIS ACOSTA/AFP/AFP via Getty Images\n\nEl Gobierno de Colombia no reconoció los resultados de las elecciones presidenciales de 2024, en las que las autoridades proclamaron ganador a Maduro, pero no ha pedido la salida del mandatario. El presidente Gustavo Petro mantiene su propia escalada de tensiones con su homólogo de Estados Unidos, Donald Trump, y aseguró que Bogotá no apoyaría una invasión a Venezuela.\n\n“(A Trump) Le da rabia que yo no apoye a los norteamericanos con el ejército colombiano para invadir Venezuela. No, señor, a que estúpido colombiano se le puede ocurrir ayudar a invadir a dónde están sus primos y sobrinos, a que los maten como en Gaza”, dijo Petro en Octubre.\n\nMientras tanto, la presencia militar de Estados Unidos sigue creciendo en el Caribe y el Pacífico en lo que Washington asegura es una operación contra el narcotráfico iniciada en agosto y dirigida especialmente al Cártel de los Soles, el cual asegura está vinculado al Gobierno de Venezuela. Caracas niega estas acusaciones y sostiene en cambio que Washington está buscando la salida de Maduro del poder.",
  "authors": [
    "Gonzalo Zegarra"
  ],
  "url": "https://cnnespanol.cnn.com/2025/11/20/colombia/colombia-venezuela-salida-negociada-maduro-canciller-orix"
}