{
  "title": "Tormentas solares generan auroras en la Tierra, pero la explosión de una estrella podría destruir la atmósfera de un planeta",
  "text": "CNN —\n\nPor primera vez, astrónomos afirman haber detectado una enorme explosión liberada por una estrella fuera de nuestro sistema solar. La erupción fue similar en algunos aspectos a las de nuestro Sol, como las tormentas solares que la semana pasada iluminaron el cielo nocturno de la Tierra con auroras, pero a una escala mucho mayor y más preocupante.\n\nEn lugar de generar coloridas auroras boreales, esta poderosa explosión probablemente tendría consecuencias potencialmente devastadoras para cualquier planeta cercano, de acuerdo con una nueva investigación.\n\nUna eyección de masa coronal (CME, por sus siglas en inglés) fue la causa probable del evento explosivo. En nuestro sistema solar, este fenómeno es una gran nube de gas ionizado, llamada plasma, y campos magnéticos que se desprenden de la atmósfera exterior del Sol.\n\nCuando estos estallidos son lo suficientemente grandes como para llegar a la Tierra, pueden causar alteraciones en el campo magnético de nuestro planeta. Estas potentes tormentas solares generan auroras en los polos, pero también pueden interrumpir las comunicaciones, la red eléctrica y el funcionamiento de los satélites.\n\nHasta ahora, los astrónomos nunca habían detectado una eyección de masa coronal proveniente de otra estrella. Los investigadores describieron este hallazgo en un estudio publicado el miércoles en la revista Nature.\n\nLa estrella, llamada StKM 1-1262, es una enana roja ubicada a unos 130 años luz de la Tierra.\n\nVideo Ad Feedback Impresionante aurora boreal sorprende a los habitantes de Iowa 00:50 • Fuente: CNN Impresionante aurora boreal sorprende a los habitantes de Iowa 00:50\n\nLa tormenta estelar se desplazó a una velocidad de 8,5 millones de kilómetros por hora (2.400 kilómetros por segundo). Según los autores del estudio, solo 1 de cada 2.000 eyecciones de masa coronal del Sol alcanza esa velocidad.\n\n“La estrella se comporta como un recipiente de plasma extremadamente magnetizado y en ebullición. Esta explosión es entre 10.000 y 100.000 veces más potente que la más fuerte que puede producir el Sol”, explicó Cyril Tasse, coautor del estudio e investigador asociado en el Observatorio de París. “Esto abre una ventana al clima espacial extrasolar”.\n\nEl denso y rápido estallido de material expulsado por la estrella fue tan potente que podría despojar de su atmósfera a un planeta que orbite muy cerca.\n\nComprender cómo la actividad violenta de las estrellas afecta a los exoplanetas es crucial para determinar si algún planeta fuera de nuestro sistema solar podría ser habitable.\n\nUna impresión artística muestra una eyección de masa coronal liberándose de una estrella. Olena Shmahalo/Callingham et al./ESA\n\nBúsqueda de explosiones estelares\n\nUna vez que una estrella libera una eyección de masa coronal al espacio, esta genera una ráfaga de ondas de radio al atravesar la corona, la atmósfera exterior de la estrella.\n\n“Son ráfagas intensas de viento estelar que se mueven más rápido que la velocidad del sonido en el espacio interplanetario, creando una onda de choque comparable a la explosión sónica de un avión de combate”, dijo Mark Miesch, científico del Centro de Predicción del Clima Espacial de la Oficina Nacional de Administración Oceánica y Atmosférica (NOAA, por sus siglas en inglés), quien no participó en el estudio.\n\nLos investigadores detectaron la señal de radio utilizando un nuevo software de análisis para examinar un estudio del cielo realizado con el radiotelescopio LOFAR hace casi 10 años. LOFAR está compuesto por miles de antenas en los Países Bajos y Europa, formando un gran radiotelescopio.\n\n“Este tipo de señal de radio no existiría a menos que el material hubiera salido completamente de la burbuja magnética de la estrella”, dijo el autor principal del estudio, Joe Callingham, profesor asociado en el Instituto Anton Pannekoek de Astronomía de la Universidad de Ámsterdam. “En otras palabras, es causada por una CME”.\n\nTasse y el coautor Philippe Zarka, investigador principal en el Observatorio de París, desarrollaron la nueva técnica de análisis llamada Espectroscopía Multiplexada Interferométrica de Radio (RIMS, por sus siglas en inglés). Se basa en longitudes de onda de luz captadas de miles de estrellas para monitorearlas y ver cómo cambian con el tiempo.\n\n“La idea era detectar señales de radio de estrellas y exoplanetas”, dijo Tasse. “Esta técnica es ideal para CME que evolucionan en minutos, por lo que se necesita monitoreo continuo y de alta resolución temporal”.\n\nLa señal detectada por RIMS fue una explosión de radio tipo II, lo que sugiere que gas caliente se alejaba de la estrella hacia el espacio. A diferencia de las ráfagas rápidas de radio, que son destellos de milisegundos de origen incierto, una explosión de radio tipo II dura varios minutos, explicó Callingham.\n\nVideo Ad Feedback Impresionante aurora boreal ilumina el cielo de Australia y Nueva Zelandia 00:30 • Fuente: CNN Impresionante aurora boreal ilumina el cielo de Australia y Nueva Zelandia 00:30\n\n“El barrido codifica la densidad del material a medida que la CME se aleja”, dijo Callingham. “Así, no solo podemos saber que la estrella ha perdido masa, sino también determinar parámetros físicos como la densidad”.\n\nEl equipo utilizó datos de la misión XMM-Newton de la Agencia Espacial Europea, lanzada en 1999, para medir la temperatura, rotación y brillo de la estrella mediante rayos X.\n\n“Necesitábamos la sensibilidad y frecuencia de LOFAR para detectar las ondas de radio”, dijo David Konijn, coautor y estudiante de doctorado en el Instituto Neerlandés de Radioastronomía. “Y sin XMM-Newton no habríamos podido determinar el movimiento de la CME ni situarla en un contexto solar, ambos cruciales para demostrar lo que encontramos. Ningún telescopio por sí solo habría sido suficiente: necesitábamos ambos”.\n\nUna ilustración de un artista muestra el observatorio XMM-Newton en el espacio. ESA/C. Carreau\n\nDetectar eyecciones de masa coronal de otras estrellas ha sido difícil porque están demasiado lejos para observar el fenómeno directamente, dijo Callingham. Aunque ha habido indicios previos, a menudo podían explicarse por otras actividades como erupciones fuertes, y no había detecciones definitivas, añadió Tasse.\n\n“La evidencia previa de CME en otras estrellas se ha centrado principalmente en las primeras etapas del evento, cuando el plasma apenas se desprende de la estrella”, dijo Miesch.\n\nSin embargo, usar un telescopio sensible como LOFAR y buscar la señal característica permitió un descubrimiento directo, dijo Callingham.\n\nMiesch señaló que la firma de emisión coincide con las conocidas de explosiones de radio tipo II de CME solares.\n\nLa detección clara de una explosión de radio estelar tipo II ha sido durante mucho tiempo un objetivo como indicador de eyecciones de masa coronal de otras estrellas, dijo Kevin France, profesor asociado y astrofísico de la Universidad de Colorado en Boulder, quien no participó en la investigación.\n\n“Esta detección es probablemente la evidencia más sólida hasta ahora de que este fenómeno ocurre fuera del sistema solar”, escribió en un correo electrónico. “Esta observación, y ojalá más como ella, nos permitirá comprender mejor las vidas violentas y tempranas de estas estrellas de baja masa que constituyen más del 70 % de todas las estrellas de la Vía Láctea”.\n\nLa búsqueda de vida\n\nLas estrellas enanas rojas pueden tener campos magnéticos más de 1.000 veces más fuertes que el del Sol, dijo Callingham.\n\nStKM 1-1262 tiene la mitad de la masa del Sol, pero rota 20 veces más rápido y posee un campo magnético estimado en 300 veces más potente, de acuerdo con el estudio.\n\nLos científicos suelen encontrar exoplanetas orbitando estas estrellas, que son mucho más tenues, frías y pequeñas que el Sol, y a una distancia más cercana que los planetas de nuestro sistema solar, a veces completando una órbita en días.\n\nComo las enanas rojas son menos luminosas y más frías que el Sol, la zona habitable —la distancia donde un planeta podría tener agua líquida en la superficie— es mucho más pequeña, por lo que los planetas están más cerca de la estrella.\n\nSin embargo, los astrónomos llevan tiempo preguntándose si las erupciones de las enanas rojas podrían afectar a los planetas con radiación dañina. Si un planeta tiene agua líquida en la superficie, lo que podría hacerlo habitable, también debe tener una atmósfera protectora.\n\nActualmente, no se sabe si algún planeta orbita StKM 1-1262, pero según investigaciones previas, casi todas las enanas rojas parecen albergar al menos un planeta, dijo Callingham.\n\n“El campo magnético protector de la Tierra no soportaría la presión de la CME, exponiendo su atmósfera directamente y causando que se pierda”, escribió Callingham. “Así que, incluso si el planeta está en la zona habitable, perdería su atmósfera rápidamente, quedando como una roca estéril, similar a Marte”.\n\nLos investigadores quieren determinar cómo estrellas tan pequeñas generan y liberan tanta energía, y qué impacto tendrían CME repetidas en los planetas cercanos.\n\nCallingham también dirige el Grupo Científico del Square Kilometre Array en el Instituto de Radioastronomía de los Países Bajos.\n\nEl Square Kilometre Array, que se espera esté listo en 2028, tendrá miles de antenas y platos para crear el radiotelescopio más grande del mundo, capaz de buscar CME de otras estrellas.\n\n“Esto es solo el comienzo, y espero que sea un adelanto de lo que vendrá”, dijo Miesch. “Ojalá inspire estudios de seguimiento para verificar estos hallazgos y caracterizar la frecuencia de estos eventos”.",
  "authors": [
    "Ashley Strickland"
  ],
  "url": "https://cnnespanol.cnn.com/2025/11/16/ciencia/explosion-estrella-acabar-atmosfera-planeta-trax"
}