{
  "title": "Bridget Riley: Learning to See review – optical mastery leaves you gasping for air",
  "text": "Sometimes a smaller exhibition is more effective than a full-blown survey. Bridget Riley: Learning to See at Margate’s Turner Contemporary brings us an invigorating and magical ensemble, juxtaposing 26 works from the 1960s to the present and shuttling between large canvases, studies and works painted directly on the wall. Learning to See concentrates the mind and sharpens the eye.\n\nRiley’s paintings come at you all at once. They arrest you and they still you. The longer you look, the more they reveal and the more they seem to change. As they ensnare you, the more rewarding they become. “How does she do that?”, might be a first thought. How are the colours ordered, what’s the logic of their construction? But there’re also the things they do to your nervous system, in that unknowable gulf between eye and brain, between perception and its after-image. The colour values of Dancing to the Music of Time (2022), a big wall drawing made originally for a museum in Canberra, go dun-coloured as you first approach, until each painted disc begins to glow with a silvery penumbra. Comparing colours, you can’t remember the last as you come to the next. I pinball back and forth, getting lost in the music. Angel, a smaller wall drawing, has discs whose stately turning alignments have the kind of brevity and apparent simplicity and inevitability of a few piano phrases by Erik Satie. It’s simple. It’s complicated. It’s mesmerising.\n\nView image in fullscreen Demanding attention … Bridget Riley in front of Dancing to the Music of Time. Photograph: Holger Niehaus\n\nGetting up close and backing away, you can get ensnared by Riley’s systems and her logic. However analytical you might try to be, they continue doing things to you on a physical, phenomenological level. We are not accountants of the optical, and Riley reminds us that we are bodies in space, perceiving the world. Through the window on the balcony, there is a horizon between sea and sky. On the wall opposite, Riley’s horizons keep multiplying. Pin them down and they slip away.\n\nThese are not eye tests. Riley makes you look, and not only at things she has painted. The 94-year-old artist makes you acutely aware of time lengthening and compressing. Where you stand or sit, how you approach and step back, how she makes you turn and raise or lower your eyes, and go from one work to another, all come into play. She makes you do it again and again, even as you stare at a single work. How alive she makes me feel. Those turning points and axes and intervals, those multiplying staves of colour which she orders, re-orders and repeats, generate both movement and a magisterial sense of implacable stasis.\n\nWith its perfectly calibrated, wave-like rhythm, Arrest 3, from 1965, loses me in the same kind of optical conundrum as a pattern on a tiled Moorish floor. Streak 3 (1980), with its even more complex and dense curving coloured lines, flowing together and apart, pulls my eye over the swell of its cross-currents as the undertow drags me along.\n\nThe close-packed verticals in Pharaoh, painted last year, are held in place by eight regularly spaced white pauses; moments where you hold your breath until, stepping away, you come up for air.\n\nView image in fullscreen A swell of cross-currents … Streak 3, 1980. Photograph: John Webb/© Bridget Riley 2025. All rights reserved. Courtesy of the artist.\n\nRiley’s recent Current paintings are like seeing a pattern of triangles through the distorting ripples of a glazed door. Larger triangles and serpentine rhythms proliferate, less on the paintings themselves than in the viewer’s mind. The two paintings titled Late Morning: one a broad canvas filled with horizontals (1967-8), the other (from 1978) with the filled tight verticals, have me finding bulges and falterings where none exist. I end up on my hands and knees, checking. Why are they named after a time of day? Does time sweep away toward the edges of the painting, the past receding to one side, advancing and brightening into an undefined future on the other? I’m lost in the incomprehensible middle of things.\n\nFor much of her long career, it has been Riley’s belief that “as a modern artist you should make a contribution to the art of your time, if only a small one”. Riley’s contribution grows with time. She has been both singular and focused in her preoccupation with the acts of looking and of seeing. The two are not the same. Seeing can be a glimpse (what de Kooning once called a “slipping glimpse”), but Riley prolongs the glimpse and the slippage into prolonged and repeated acts of looking. She turns concentration into reverie and leaves me agape, wide-open and surprised. I can’t stop looking.",
  "authors": [
    "Adrian Searle"
  ],
  "url": "https://www.theguardian.com/artanddesign/2025/nov/20/bridget-riley-learning-to-see-review-optical-mastery-leaves-you-gasping-for-air"
}