{
  "title": "EU court rules non-alcoholic drinks cannot be called gin",
  "text": "The makers of spirits may be raising a toast to the European judges of Luxembourg after the EU’s court ruled that non-alcoholic drinks cannot be called gin.\n\nOnly spirit drinks based on ethyl alcohol flavoured by juniper berries with a minimum alcoholic strength of 37.5% by volume can be known as gin, the court said in a judgment issued on Thursday.\n\nThe case was brought by a German association against unfair competition, Verband Sozialer Wettbewerb, against PB Vi Goods, a company that sold a drink called Virgin Gin Alkoholfrei.\n\nThe company argued in court that it was obvious from the name that it was selling a non-alcoholic drink. A court in Germany also considered that the name “eliminates the risk of misleading the consumer” and raised the question that European regulation on spirits could be at odds with the freedom to conduct a business under the EU’s charter of fundamental rights.\n\nBut the Luxembourg judges said EU law was clear that the term “non-alcoholic gin” was prohibited. “The fact that the legal name ‘gin’ is accompanied by the term ‘non-alcoholic’ is irrelevant,” the court said.\n\nThe 2019 EU regulation states that such provisions protect consumers, prevent deceptive practices, ensure fair competition and safeguard the international reputation of the EU’s spirit drinks.\n\nThe ruling could be a setback to the EU’s fast-growing alcohol-free drinks industry. PB Vi Goods did not immediately respond to an emailed request for comment on Thursday.\n\nIt is not the first time that some of the EU’s top legal minds have been asked to grapple with the names and shapes of food and drink, whether indulgences or everyday staples.\n\nIn 2018, the ECJ ruled that the makers of KitKats could not trademark the four-fingered wafer shape, ending a decade-long legal battle between chocolate makers over what one court adviser called the “four trapezoidal bars aligned on a rectangular base”.\n\nThe previous year, the court ruled that only animal-derived products could use names such as milk, butter, cream and yogurt.\n\nskip past newsletter promotion Sign up to Headlines Europe Free newsletter A digest of the morning's main headlines from the Europe edition emailed direct to you every week day Enter your email address Sign up Privacy Notice: Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on theguardian.com to send you this newsletter. You can complete full registration at any time. For more information about how we use your data see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nThe European parliament is seeking to tighten up food labelling rules further: last month it voted to outlaw terms such as burger and sausage for plant-based foods.\n\nThe law is still being negotiated with EU member states, who may yet save veggie burgers and tofu steaks. But for now, an alcohol-free gin and tonic is officially off the menu in the EU.",
  "authors": [
    "Jennifer Rankin"
  ],
  "url": "https://www.theguardian.com/business/2025/nov/13/eu-court-bans-calling-non-alcoholic-drinks-gin"
}