{
  "title": "The Echo Dot Max is Amazon’s biggest little speaker yet",
  "text": "is a senior reviewer with over twenty years of experience. She covers smart home, IoT, and connected tech, and has written previously for Wirecutter, Wired, Dwell, BBC, and US News.\n\nPosts from this author will be added to your daily email digest and your homepage feed.\n\nI love the Echo Dot Max. It’s an excellent speaker, a good listener, and comes in purple — which is just fun. It’s got new, easier-to-use controls and more smart home sensors and radios than earlier models. It’s also one of the first devices designed for Alexa Plus. And while the AI-powered assistant isn’t mandatory (and is only available in the US), its presence is something of a letdown for an otherwise superior speaker.\n\nDespite the name, the Dot Max isn’t a replacement for the Echo Dot, which is sticking around; it’s a successor to the fourth-gen Echo, released in 2020. At $99, it’s the same price as that melon-shaped Echo, which has been my top pick for an Alexa speaker for the last 5 years. But it is getting long in the tooth and appears to have been discontinued. Now the Dot Max, with its more compact design, sleek knit fabric look, speedy new processor, and support for Matter, Thread, and Zigbee smart home protocols, takes the crown.\n\nThis new model is the middle child of the Echo lineup, sitting between the $50 Echo Dot (fifth gen) and the new, $220 Echo Studio. The Dot Max comes in white, grey, and purple and has everything you want in a voice-controlled Alexa smart speaker — good sound, physical controls, strong smart home features, a physical mute button, and a nice design. It also responds snappily to simple voice commands, and there’s no screen, so no full-screen ads.\n\nThe higher-end Echo Studio is the one to get if you want a “proper” speaker and have more money to spend (my colleague, John Higgins, has that review for you), but the Dot Max has great sound for a $100 smart speaker. It’s loud enough to fill my open-plan living room/kitchen area — and its bass packs more punch than the regular Dots.\n\nThe Dot Max is slightly bigger than the Dot (fifth-gen) and much smaller than the Echo (fourth-gen), while offering similar sound.\n\nThis is the first Dot model with a separate tweeter and woofer, and it sounded great while my daughter and I attempted to recreate Taylor Swift’s “The Fate of Ophelia” dance moves (sadly, no video evidence survives). It sounded better than the older Echo, with its larger woofer and dual tweeters. Though that has more depth and gets louder, the Max produced a crisper sound with plenty of bass. It can be paired with another Max for stereo sound and will soon work as part of an Alexa Home Theater group. I only had a single review unit, so I wasn’t able to test those pairing features.\n\nThe Max hears very well for its diminutive size; it’s only slightly bigger than the Dot and much smaller than the Echo. I didn’t have to shout for it to hear me while blasting Taylor. Amazon says the new AZ3 chip on board powers “our best microphone array yet,” which filters out background noise and makes Alexa 50 percent better at hearing you. Most Echo speakers hear better than Echo Show smart displays with their dubiously situated microphones, but the Max reacted faster to my voice than the fifth-gen Dot I compared it to.\n\nThe front-facing controls are easier to access if the speaker is on a shelf. The 3D knit mesh fabric fully encases the speaker, and the cable and power brick are color-matched. The brick is much smaller — but the Max cords don’t work on the older Dots. The purple really pops. It’s a lot bolder than the purple hue of the Echo Pop.\n\nAlong with audio improvements, the Dot Max has a whole new look. It takes more than a few design cues from Apple’s HomePod Mini (especially if you place it just so…), and the new fully wrapped design gives it a cleaner, more modern style than the Dot’s half-polyester, half-plastic dome.\n\nUnlike the HomePod Mini with its controls on top, the Max’s control panel is on the front, which I find more convenient. I often put smart speakers on a shelf or mantelpiece, and front-facing controls are easier to access for quickly muting or changing the volume than blindly reaching up to try and find the right button. Gesture features are more responsive. Tapping the top pauses or plays music with ease, no hefty thwack required like on the Dot.\n\nHaving the LED ring light on the front is a nice improvement. It’s softer and less obtrusive than on previous Echos. The blue LEDs still adjust to indicate what the assistant is doing — listening, responding, etc. — but are less distracting. The mute mode has changed, too; instead of a giant red glow, just a small red light on the mute button indicates the speaker is not listening.\n\nSpot the difference. No, really … Even in its natural position, the Dot Max bears a strong resemblance to Apple’s HomePod Mini.\n\nAnother welcome upgrade is that both the cord and power brick are now color-matched to the Dot Max. Along with the new fabric-wrapped design, this makes the device look more elegant. I still want to know who signed off on shipping black Echo Dot speakers with white power cords. The power brick in the Max is also smaller, helping it fit better into a power strip.\n\nSadly, there is still no 3.5mm audio jack, which Amazon ditched with the last generation of the Dot. That model is sticking around in the Echo lineup, along with the diminutive Pop and the Spot, a bedside table clock. The Spot’s existence probably means we’ll never get another Dot with Clock, which was one of my favorite features of the Echo Dot.\n\nA capable smart home hub\n\nBeyond sound, the Dot Max shines as a smart home hub. Like the Echo (fourth-gen), the Max has Thread and Zigbee radios and can act as a Matter controller and Thread Border Router, allowing you to connect locally to Alexa-compatible Matter and Zigbee devices.\n\nI connected an Eve Energy smart plug to Alexa via Thread, controlled it with voice using the Max, and it turned on and off quickly with no connectivity issues. The speaker didn’t appear in my list of available Thread Border Routers, but it can be one and will work with other Echo and Eero devices that support Thread to create a stronger mesh network (although it still can’t join an existing non-Amazon network). It also works as a Wi-Fi extender for an Eero mesh network.\n\nPrevious Next\n\n\n\n1 / 3 The Alexa app has simple controls for streaming music playback and using the Max as a Bluetooth speaker.\n\nThe Max has the same temperature sensor and ultrasound motion sensor as the Dot and adds a new Wi-Fi sensing capability. This is supposed to make the device better at detecting occupancy, particularly more fine-grained motion like reading and typing. That didn’t hold up in my testing.\n\nI had Alexa set up a routine to turn on my office lights when the Max on my desk detects motion, and another to turn them off when it stops detecting motion. While it was faster to turn on the lights than the Dot, the Dot turned them off on me once or twice while I was typing, despite the Max being inches from my keyboard. I wasn’t able to test the temperature sensor as it didn’t finish calibrating during my testing.\n\nAlexa Plus still isn’t ready\n\nThe Dot Max comes with Alexa Plus enabled out of the box (in the US, everyone else gets regular Alexa). So you don’t have to sign up and wait for an invite to try out Amazon’s new AI-powered assistant, which has been in an early access program since its launch in March. While it will cost $19.99 a month at some point, it’s free for now and free for Prime members.\n\nOn the Max, Alexa responds faster than on the Dot for most simple uses like setting timers, playing music, and performing some smart home controls. The new assistant’s natural language processing capabilities can understand the more complex phrasing you use when asking for specific music or a podcast episode. You can also ask it to do multiple things at once — turn on lights, lock the doors, and make it warmer in here, and it tolerates pauses and stumbling over words. All the things the old Alexa flat-out can’t do.\n\nNew hardware doesn’t fix software issues\n\nAlexa Plus is also more knowledgeable. It can answer many more questions than the OG, hold a back-and-forth conversation without you having to repeat the wake word, and even book you a table for dinner. (Remind me to cancel that reservation I made!)\n\nBut while Alexa Plus is better at comprehending you, it isn’t always better at executing your commands. New hardware doesn’t fix software issues, such as Alexa forgetting what we’re talking about mid-conversation or being unable to consistently control my Alexa-enabled coffee maker. Asking for the weather can take up to 10 seconds.\n\nThe voice assistant struggles with running Routines via voice. I’ve had to remake all my smart home routines, and it still sometimes fails to run them when asked. I hoped Alexa Plus would take most of the hard work out of setting up and running a smart home, but that isn’t the case.\n\nToday, the most useful feature of Alexa Plus for the smart home is the ability to create routines via voice. It does this mostly well, but as with all AIs, you need to check its work. It will confidently tell you it’s done something that it has not, in fact, done.\n\nIts ambitions to be a personal assistant also feel hamstrung; Alexa Plus’ supposed “agentic” capabilities are limited, and many features touted at the launch — such as ordering my groceries — are not here yet.\n\nWhile Alexa Plus feels like a letdown today, I’m hopeful that the new hardware could help Amazon’s long-held ambition for ambient computing. The AZ3 processor in the Max and the Pro model in the new Studio, Echo Show 8, and 11, feature an AI Accelerator “designed to run AI edge models of the future,” according to the company.\n\nThe speakers are also apparently prepped for edge-based computing with Amazon’s new Omnisense fusion platform. This can process the data from the device’s microphones, cameras (on the Shows), ultrasound, and Wi-Fi radar, locally, helping speed up smart home interactions. All of this could allow the AI to start learning and adapting to how you use your home. But that isn’t here today; it’s still just potential.\n\nThe LED light ring that indicates what Alexa is doing is much more subtle on the new hardware.\n\nMore Max than Mini\n\nThe Dot Max is Amazon’s best all-around smart speaker. It’s pricier than the $50 Dot, but it offers far better sound, more power, and more smart home capabilities. If you are hanging on to a fourth-gen Echo, it’s a worthwhile upgrade thanks to a newer processor and upgraded sensors.\n\nIf you want even better sound, the new Echo Studio is worth considering. It has identical features to the Max, plus the more powerful AZ3 chip, and better speaker parts, but it’s more than twice the price. My colleague John, an AV expert, says the Studio sounds better than Apple’s second-gen HomePod, and the Max is similarly a real challenger in the sound space to the HomePod Mini.\n\nThis is an impressive hardware year for Amazon, and the new Show smart displays look equally as promising (we’ll be testing those soon). But the big initiative, the big promise is Alexa Plus, and that’s where things still feel unfinished. The new voice assistant shows flashes of brilliance, and its conversational abilities are light-years ahead of the old Alexa. But it’s too often slow, inconsistent, and forgetful. The Echo Dot Max shows Amazon can make better hardware; now it just needs a voice assistant to match.\n\nPhotos by Jennifer Pattison Tuohy / The Verge",
  "authors": [
    "Jennifer Pattison Tuohy"
  ],
  "url": "https://www.theverge.com/tech/808747/amazon-echo-dot-max-smart-speaker-review"
}