{
  "title": "HYTALE IS SAVED!",
  "text": "A new and exciting chapter for Hytale begins today.\n\nWe are thrilled to announce that we have acquired Hytale from Riot Games. While it didn't make sense for them to continue developing it in its existing form, they ultimately wanted what's best for players, and that's for us to eventually play a revised version of the game. We are grateful to Riot Games for making this possible.\n\nOver the past few weeks, we have rehired more than 30 developers who know this game inside and out, with additional returns expected in the coming days. Together, we are going back to the original vision for Hytale. We are fully independent and personally committed to funding Hytale for the next 10 years.\n\nTransactions like this are rare in the games industry. Thank you to everyone for keeping hope alive.\n\nHytale is saved.\n\nSimon Collins-Laflamme\n\nFounder, Hypixel\n\nTL;DR\n\nEarly access date: To be announced in the coming days\n\nPlatform: Windows at launch, Linux / Mac will be attempted, other platforms much later\n\nWindows at launch, Linux / Mac will be attempted, other platforms much later Pricing: Details to be announced in the coming days\n\nEarly access state: Expect bugs, rough edges, unbalanced content, and frequent updates that break things\n\nEarly access duration: Expected to last at least a few years; no rush to \"1.0\"\n\nLaunch content: Exploration Mode, Creative Mode, and Modding\n\nNot at launch: Minigames and Adventure Mode (both come later; dedicated team for minigames)\n\nOwnership: We own 100% of Hytale (repurchased from Riot Games)\n\nFunding: 10-year personal funding commitment; no investors or publishers\n\nGame build: Using the previous engine from the trailer, enabling faster development and immediate playability\n\nModding: Available at launch. Run your own servers and create custom content.\n\nHOW WE GOT HERE\n\nOn June 23, 2025, it was announced that the development of Hytale was ending and Hypixel Studios would wind down.\n\nWhen we saw the community's reaction, we knew we had to act. Although we hadn't been involved with Hytale since 2020, Hytale and its community have always been something we cherished.\n\nWe made an offer to Riot Games without seeing the full state of the project. Knowing the massive risks involved, we dove in headfirst. No risk, no Hytale. We negotiated the deal, rehired 30 developers, secured funding, and made the call to return to the legacy engine and original vision.\n\nWHY WE DID THIS\n\nWe're focused on building the game we always wanted to play, and one that we'd be proud for our kids to play, too. Philippe and I are personally committing funding for the next 10 years. This is our passion project, and we're here to make it last.\n\nSTART SMALL, GROW WITH COMMUNITY\n\nWe expect our roadmap to evolve as we learn more about the game's needs and how players respond. It's already changing: what we have today is different from what we had a few weeks ago, as we have been exploring the game. We'll keep it agile and flexible and try our best to avoid promises we can't keep.\n\nWe're choosing to focus on making a great game first, rather than a perfect engine. We know the risk of releasing an unfinished product. First impressions matter, and it's hard to change minds. But this is a risk we must take. We need your help creating content, reporting bugs, giving feedback, and building this with us.\n\nNo risk, no Hytale.\n\nOur initial priority is polishing the living world, modding, core mechanics, and sandbox experience. Once the world feels alive and systems are stable, we'll shift hard into Adventure Mode and Minigames development to create the true Hytale experience.\n\nTHE CURRENT STATE OF THE GAME\n\nLet's discuss openly what we've inherited and what we're working with. The biggest thing to note is there were two engines in development. The Legacy Engine (C#/Java PC-only) that was quite advanced from three to four years ago. This is what was used in the trailer and most blog posts. And a Cross-platform Engine (C++) that's been in development for approximately three years.\n\nThe Cross-platform Engine is significantly behind in terms of gameplay. It would require extensive refactoring to be production-ready, with minimal gameplay features. We estimate it would take two years before we could consider early access with it.\n\nWe've made the decision to abandon the Cross-platform Engine and return to the Legacy Engine. It's playable now. It lets us build a game rather than an engine. It's the version that feels like what Hytale was supposed to be.\n\nAs for the Legacy Engine, we have plans to make it cross-platform later. We are in no rush.\n\nIn the game itself, we have over 100 NPCs, thousands of items and blocks, but many aren't properly configured yet. Expect unbalanced loot, rough edges, and bugs. This is genuine early access. Please report issues and give feedback.\n\nOfficial minigames will not be available on early access launch. We know these were a big part of the original Hytale vision, but the infrastructure and minigames are far from ready. We have a dedicated team that will focus on bringing minigames once the core game is stable. We have extensive experience in this.\n\nIn the meantime, the community can start making their own minigames, custom servers, and experiences. When we launch our own, we'll share our assets and support the community. Ideally, the community becomes better at making minigames than we are!\n\nWe're a small, dedicated team by design. Scaling too fast creates new problems. The cost of staying small is that we can't balance and finish everything in a few weeks. The benefit is that we can move quickly, make decisions efficiently, and avoid the bureaucracy that kills momentum.\n\nIn the past few days, we've made solid progress toward launching early access. As we move into full production mode, as we complete the transfer of Hytale, you'll see accelerated development in the coming weeks.\n\nWe'll release detailed patch notes in the coming days so you can see the full scope of improvements.\n\nOUR TEAM\n\nLeadership is critical to our success. Here's who's leading Hytale:\n\nSimon Collins-Laflamme (Co-founder): Directly involved daily, shaping vision and ensuring the long-term health of the game and community. Co-funding in the project.\n\nPhilippe Touchette (Co-founder): Co-funding, overseeing financial responsibility, and helping structure the finances for the acquisition.\n\nKevin Carstens (Technical Lead): Leading all technical development since day one with deep knowledge of every layer of the game.\n\nPatrick Derbic (Management Lead): Handling studio operations, team coordination, and ensuring efficient execution.\n\nWe've rehired over 30 former developers who previously worked on Hytale. These are people who know the codebase, understand the vision, and choose to come back. We'll continue to hire as the budget allows and as we find the right candidates.\n\nWe're seeking hard-working, self-motivated individuals who want to be part of something meaningful.\n\nMODDING: CRITICAL TO SURVIVAL\n\nModding is once again a top priority. It has always been at the core of our vision, and it's critical to our long-term survival. We will launch early access with as many modding tools and as much access as possible, within legal and security constraints.\n\nWhat you can expect:\n\nIt's possible to mod almost everything in Hytale (content and server-side)\n\nNon-developers can create impressive experiences with minimal technical knowledge\n\nA few guides or videos will be enough for most people to start creating\n\nWe will provide server source code access within several months, once we're legally ready to do so\n\nDedicated server support and data-driven content configuration\n\nWe're being mindful of backward compatibility as we iterate\n\nYou can create your own custom servers, maps, adventures, etc\n\nMore details will be given in a future blog post\n\nModding isn't just a feature for us. It's the foundation of longevity. We're committing to this completely.\n\nWHAT THIS MEANS FOR YOU\n\nWe need your help to complete Hytale.\n\nPlay early access (even when it's rough)\n\nReport bugs and give honest feedback\n\nCreate mods and content\n\nBe patient when things break and trust the long-term vision\n\nMake guides and share knowledge with others\n\nThis is not a polished product. This is a raw, unfinished, sometimes broken experience with incredible potential. You'll find placeholder content, unbalanced systems, and frustrating bugs. You'll also find moments of magic, systems that click perfectly, and glimpses of what this could become.\n\nEarly access is our way of earning your trust, not asking for it.\n\nWHERE TO FIND US\n\nDiscord is where the action is for Hytale. Major announcements go to all platforms, but Discord is where the community lives and our developers are most active.\n\nClick here to join us.\n\nWe're setting up channels for modding, map-making, bug reports, feedback, tutorials, and community events.\n\nAll major announcements will also go to X, Instagram, Reddit, and others.\n\nMOVING FORWARD\n\nWe're releasing features and iterating on them later. Many features will be in their own \"Version 1\": functional but early stage. We're focused on getting core systems working together rather than perfecting each one in isolation. Expect very frequent updates. Moving fast means things might break more often. Saves could be affected. Systems might change. That is the trade-off of speed.\n\nWe're committing to transparent communication with patch notes and development updates.\n\nTen years of runway gives us time to get it right. We're building something that lasts.\n\nCOMING IN THE NEXT FEW DAYS\n\nGameplay footage and screenshots (unpolished, as-is)\n\nDetailed patch notes from our recent work\n\nModding capabilities and roadmap blog post\n\nPricing details for different editions\n\nPlenty of updates and communication\n\nEarly Access Release Date\n\nFINAL THOUGHTS\n\nHytale has had a long and challenging journey. It's taken longer than anyone hoped, and it's changed a lot along the way.\n\nBut here we are: starting over with a 4-year-old build, a small dedicated team, a community that refused to give up, and a vision that's aligned with a new reality.\n\nThis is not going to be easy. This is not going to be fast. This is not going to be perfect.\n\nBut it's going to be ours. Built together: one feature at a time, one bug fix at a time, one mod at a time.\n\nHytale lives. Thank you.\n\nFrom the entire Hytale team.\n\nTo download a .zip containing the clips featured in this blogpost, click here!",
  "authors": [],
  "url": "https://hytale.com/news/2025/11/hytale-is-saved"
}