{
  "title": "World Cup draw: What are the possible groups? Which teams are in which pots? How tough can they be?",
  "text": "With the latest round of World Cup qualification games complete, we have the clearest idea yet of how the group stages could look at next summer’s tournament in the United States, Canada and Mexico.\n\nThe World Cup draw will take place in Washington D.C. on December 5, with the 2026 tournament expanded from 32 teams to 48. During the seeded draw, teams will be put into four pots of 12 based on their FIFA rankings as of November/December 2025 and drawn into 12 groups. The latest rankings were released on Wednesday.\n\nAdvertisement\n\nThere are still six qualifying pots up for grabs — these will be decided by play-off fixtures in March.\n\nLet’s take a look at the pots as things stand, what the ‘group of death’ could be and possible outcomes for the USMNT, Canada and England.\n\nWho is in which pot for the World Cup draw?\n\nBased on the new FIFA rankings, this is how the pots are tracking. There is not due to be another ranking update until December 23 — after the draw:\n\nPot 1: United States, Mexico, Canada, Spain, Argentina, France, England, Brazil, Portugal, Netherlands, Belgium, Germany\n\nPot 2:\n\nCroatia, Morocco, Colombia, Uruguay, Switzerland, Japan, Senegal, Iran, South Korea, Ecuador, Austria, Australia\n\nPot 3:\n\nNorway, Panama, Egypt, Algeria, Scotland, Paraguay, Tunisia, Ivory Coast, Uzbekistan, Qatar, Saudi Arabia, South Africa\n\nPot 4:\n\nJordan, Cape Verde, Ghana, Curacao, Haiti, New Zealand, UEFA Play-off Qualifier 1, UEFA Play-off Qualifier 2, UEFA Play-off Qualifier 3, UEFA Play-off Qualifier 4, Confed Play-off Qualifier 1, Confed Play-off Qualifier 2\n\nFIFA has not yet confirmed if play-off teams will be placed into pot four or placed in pots based on rankings, so we have worked on the assumption of the former. They will publish further draw criteria before December 5.\n\nCould there be a group of death?\n\nAssuming that play-off teams will be placed into pot four, a possible group of death looks like:\n\nPot 1: Argentina\n\nThe World Cup holders, after beating France on penalties in an all-timer final, finished top of CONMEBOL qualifying having won 12 out of 18 games. Lionel Messi finished as the continent’s top scorer, with eight goals and three assists from 12 games.\n\nPot 2: Morocco\n\nMorocco were the giantkillers of the 2022 World Cup. Captained by one of the best right-backs in the world, Achraf Hakimi, they finished top of a group containing Croatia, Belgium and Canada. In the knockouts, they defeated Spain and Portugal before eventually losing to France in the semi-final.\n\nAdvertisement\n\nPot 3: Norway\n\nNorway have only ever qualified for three World Cups, but entering their fourth, they have players with the ability to hurt any team. Erling Haaland is the most fearsome striker in football and led scoring in UEFA qualifying with 16 goals in eight games.\n\nErling Haaland’s goals were key to Norway reaching the World Cup (Marco Iacobucci/SOPA Images/LightRocket via Getty Images)\n\nPot 4: Italy (were they to qualify from the UEFA play-offs)\n\nFour-time World Cup winners Italy may not be at their most formidable, but it would be unfortunate to draw them in pot four over nations making their tournament debut.\n\nThey will have to earn their spot at the competition via the play-offs after finishing second in UEFA qualifying group I behind Norway, but could be included in pot four if they do make it via this route.\n\nIn pot two, also look out for Japan, who finished above Spain and Germany in the groups at the 2022 World Cup.\n\nMohamed Salah’s Egypt present a threat in pot three, along with the Africa Cup of Nations (AFCON) winners Ivory Coast. Ghana, who reached the quarter-finals in 2010, are a strong side in pot four.\n\nWhat is the best/worst case for the USMNT, Canada and England?\n\nThe worst-case scenario for the USMNT and Canada would be to be part of the group of death highlighted above, drawn with Morocco, Norway and Italy.\n\nNations from pots two to four may be hoping to draw one of the host nations from pot one, to avoid the highest-ranked FIFA teams.\n\nEngland would avoid this exact draw as only two UEFA teams can be in each group, with countries from every other confederation not able to meet at this stage.\n\nA worst-case scenario for England could be: Japan from pot two, Egypt or Ivory Coast from pot three and Italy from pot four.\n\nAs for best-case scenarios, being drawn against tournament debutants could be beneficial. In pot three, there is Uzbekistan and in pot four these nations are: Jordan, Cape Verde and Curacao. These teams will be riding a high, but have a lack of experience at the elite level.",
  "authors": [
    "Eduardo Tansley"
  ],
  "url": "https://www.nytimes.com/athletic/6820230/2025/11/19/world-cup-draw-pots-explained/"
}