{
  "title": "Mattel's 'Diabetes Barbie' Is Long Overdue",
  "text": "When I was diagnosed with Type 1 diabetes in my late 20s, one of my friends lovingly referred to me as Diabetes Barbie to make me feel better about my new reality. The nickname made my condition a part of my overall identity — a young, perky, professional — rather than an illness that would negatively define me. So recently, when Mattel dropped a real Diabetes Barbie, it felt like a long overdue signal of inclusion.\n\nDiabetes Barbie is an unexpected tool for visibility. She wears an insulin pump, continuous glucose monitor (CGM), along with kicky little diabetes-friendly accessories like a pastel blue purse — all of which are relatable to those of us who know how much extra stuff you have to carry around when living with this condition. The doll is validating both for children newly diagnosed or people like me who didn’t have this kind of representation during formative years.\n\nType 1 diabetes impacts over 2 million people in the U.S. The auto-immune condition is often conflated or overlooked due to the much larger number — 40 million people — who have Type 2 diabetes. The difference between the two is explained in this video from Stanford: Type 2 diabetics deal with insulin resistance, which means that their bodies make insulin, but their bodies don’t react to it well; these individuals tend to be older and can usually get the condition in control with diet and other lifestyle changes.\n\nAdvertisement\n\nType 1 is an autoimmune condition where one’s pancreas is unable to produce insulin. It tends to happen to younger people and it can’t be prevented, so it requires intervention (which is why it can feel jarring and isolating to the young people it happens to). It’s also much rarer.\n\nSeeing a doll that specifically represents this subsegment can spark conversations between children and parents, peers, and even teachers about what diabetes management entails. Often these conversations are the difference between feeling seen and suffering in silence and isolation.\n\nMy own endocrinologist explained that if not properly managed, (both types of) diabetes can lead to blindness, circulation issues and heart problems. Beyond the terrifying aspects of living with this disease, the social stigma is continually frustrating. I’ve had more than one woman ask me in a locker room while changing, “What is that on your belly?” referring to my CGM. I’ve also weathered judgmental looks after whipping out insulin pens during business dinners.\n\nAdvertisement\n\nIn 2022, I was forced to go without Ozempic for four months, which I used to reduce my daily insulin load, because the many non-diabetics became obsessed with my medicine — leading to a global shortage that only just ended.\n\nI also feel resentful when I see new, sleek glucose monitors — especially worn by people who use them to monitor their diet and physical activity for reasons other than diabetes. I spent years wearing clunky devices because I had to. Now manufacturers have slowly rolled out more sophisticated offerings — slimmer, more lightweight, leaving less scar tissue.\n\n“My friends ask me a lot of questions about all this stuff I have to wear,” says Avery, 11, a Type 1 diabetic who lives in Illinois. Avery tells me that she actually likes when her friends ask about why she carries so many different fanny packs with medical supplies, or whether or not the needle hurts. For many kids with chronic conditions, the visibility of medical gear can invite unwanted attention or isolation — but Avery sees curiosity as connection. “It makes me feel seen,” she says. “I think it’s really cool that if my friends saw this Barbie they could relate to me more.”\n\nAdvertisement\n\nAmong her role models is a high school student with Type 1 in the neighborhood. “I like to see other people wearing the monitors and pumps too, because I feel less alone,” Avery says. As I listened to her diagnosis story, including the part about spending four nights in the hospital, I gained a deeper understanding of how profoundly it reshaped life for her entire family. Mother and daughter spoke like a pair of girl-power warriors, sharing stories of educating the school nurse and managing blood sugar dips during cheer practice.\n\nWanting to reclaim a sense of joy and ownership in a daily routine shaped by chronic illness, Avery took a creative leap. She and her mom saved a year’s supply of Avery’s Omnipod insulin pump covers and hand-decorated them with some of her favorite themes — a horse, a cupcake, the Chicago Cubs, flowers, a rainbow — and turned them into magnets to give to her friends. I imagine transforming cumbersome medical devices into pieces of personal flair could offer young people with Type 1 a renewed sense of agency over their circumstances.\n\nAs we continued to chat on video, I noticed that her mom was wearing a CGM made available for non-diabetic patients. “My mom is going to wear it all summer!” Avery says excitedly. It took my breath away. I had been harboring judgmental energy for all the CGM wearers who didn’t need them to manage their own diabetes while this mom sat solemnly in solidarity with her daughter.\n\nAdvertisement\n\n“Now there’s two of us in our family who are wearing it,” Avery explains. She said she wanted her dad to wear one too, but she knew her little brother would be hesitant since he’s scared of needles. Humbled, I held back tears in awe of this brave little girl who reminded me of the importance of continued empathy, especially when we don’t know what’s going on inside someone else’s body, or in this case, in their family.\n\n“Barbie helps shape children’s early perceptions of the world, and by reflecting medical conditions like T1D, we ensure more kids can see themselves in the stories they imagine and the dolls they love,” said Krista Berger, Senior Vice President of Barbie and Global Head of Dolls at Mattel. A spokesperson for Mattel told me that they want to encourage doll play outside of a child’s own lived experience, and teach understanding and a greater sense of inclusion and empathy, pillars of Barbie’s mission.\n\nI continue to identify as Diabetes Barbie, the lighthearted nickname my friend gave me to lighten the load of my scary diagnosis many years ago. The new toy version of Diabetes Barbie then reminded me to save my judgment, no matter the circumstance, and live in union with those like Avery, putting a spotlight on wholehearted inclusion.",
  "authors": [
    "Guest Writer"
  ],
  "url": "https://www.huffpost.com/entry/diabetes-barbie-type-1-diabetes-essay_n_68890c58e4b08681ba5e539f?origin=top-ad-recirc"
}