{
  "title": "Polls show Trump’s happy talk on inflation is falling flat",
  "text": "The 2025 election two weeks ago crystallized how big a problem the economy and affordability appear to be for President Donald Trump and the Republican Party.\n\nTrump’s initial strategy for dealing with this problem appeared to be pretending it didn’t actually exist. Trump set about falsely claiming prices were actually down, that there is “almost no inflation,” and that everything was more or less hunky dory.\n\nIt was bizarre, even from a president who often seems to reside in his own elaborately crafted alternate reality.\n\nAnd it appears to be falling flat.\n\nNew polling conducted since Trump began driving this message shows Americans continue to see things very differently than Trump has cast them. And their reviews of his economic stewardship appear to actually be getting worse.\n\n75% plus say grocery prices are up, despite Trump’s repeat claims\n\n“Our groceries are way down. Everything is way down,” Trump said November 6. “Groceries are way down, other than beef,” he said at another point. He added last week that grocery prices were “already at a much lower level than they were with the last administration.”\n\nBut just 12% of Americans said grocery prices have gone down over the last six months, according to a new Marquette University Law School poll conducted November 5 through 12.\n\nBy contrast, 75% said they’ve gone up.\n\n(Average grocery prices were indeed up roughly 1.4% in September compared to when Trump took office in January, and the 0.6% jump in one month from July to August was the largest in three years.)\n\nEven among Republicans, only 2 in 10 subscribed to Trump’s alternate version of reality in which prices are actually dropping. A majority said prices are up.\n\nThe numbers were similar in a Fox News poll released Thursday.\n\nThat poll, conducted November 14 to 17, showed 85% of registered voters said grocery prices are higher than a year ago, with 60% saying they’ve “increased a lot.”\n\nAround two-thirds or more also said the prices of utilities, healthcare and housing were up.\n\n(“A year ago” technically includes two months in which Trump was not yet president, but it stands to reason people perceived the question as being mostly about his tenure.)\n\nPerhaps most striking: The percentage who say grocery prices are up “a lot” (60%) is significantly higher than the percentage who said that about groceries and everyday items back in October 2021 (43%). This despite inflation back then having been about double what it is today.\n\nThat suggests this problem is really ingrained – and will be difficult for Trump to defeat with happy talk.\n\nThe chasm between Trump’s claims and Americans’ views of inflation\n\nTrump has claimed there is “virtually no inflation,” “almost no inflation” and said inflation is “almost nonexistent.” He has also said “we don’t have any inflation.”\n\nIn fact, inflation has remained stubborn throughout Trump’s tenure and is at about 3% on an annualized basis – right where it was when he took over.\n\nAnd the perception might be even worse.\n\n52% of registered voters said inflation was “not at all” under control, according to the Fox poll. That includes nearly two-thirds of independents (65%).\n\nFewer than 2 in 10 overall – and only one-third of Republicans – said inflation was at least “mostly” under control.\n\nTrump blames Joe Biden; the public doesn’t\n\nTo the extent Trump has allowed that there are economic pains, he’s generally cast them as remnants of the Biden era.\n\n“Biden was a disaster with affordability,” Trump told Fox News shortly after the election. He added: “When I took over, it was a mess.”\n\nBut this, too, appears to be a losing argument.\n\nThe Fox News poll asked whether Trump or Biden were more responsible for the current economy, and voters chose Trump, 62%-32%.\n\nOnly around half of Republicans (53%) blamed Biden.\n\nTrump’s numbers appear to be getting worse\n\nThe gamble for Trump in pitching this alternate reality is evident: If people don’t ultimately subscribe to it, they might come to view Trump as out of touch and not taking the problem seriously enough.\n\nAlready, CBS News-YouGov polling has shown 75% of Americans and a majority of Republicans have said Trump is not focused enough on lowering prices.\n\nAnd indeed, it seems Trump is doing himself no favors right now. If anything, his political picture on the economy and affordability is worsening:\n\nHis approval rating on “cost of living” was a record 39 points underwater in a new Reuters-Ipsos poll conducted November 14 through 17.\n\nThe Fox poll showed Trump with his worst economic numbers in either his first or second terms: 38% approving, 61% disapproving.\n\nRegistered voters favored Democrats over Republicans by 10 points on “making things more affordable” (53%-43%), per Fox. (This is striking because Americans tend to favor Republicans by default on economic issues.)\n\n72% disapproved of Trump on inflation, up from 65% in July, according to the Marquette poll.\n\nThe same poll shows Americans say by about a 2-to-1 margin that they expected Trump’s policies will continue to increase inflation.\n\nIndeed, Trump has given people plenty of reason to attach whatever happens with the economy to him. That’s what happens when you rock the economy with a series of unilateral global tariffs that weren’t even endorsed by Republicans in Congress.\n\nTrump voluntarily took ownership of the economy. Now he wants to disclaim the reality of what’s followed.\n\nPolitical analysts love to mine Trump’s actions for secret political strategy and three-dimensional chess moves. But this seems more like desperation than anything else.",
  "authors": [
    "Aaron Blake"
  ],
  "url": "https://www.cnn.com/2025/11/20/politics/inflation-polls-trump"
}