{
  "title": "Why Donald Trump’s environmental data purge is so much worse this time",
  "text": "is a senior science reporter covering energy and the environment with more than a decade of experience. She is also the host of Hell or High Water: When Disaster Hits Home , a podcast from Vox Media and Audible Originals.\n\nPosts from this author will be added to your daily email digest and your homepage feed.\n\nNow that we’re about halfway into the first year of President Donald Trump’s second term, we can take stock of his administration’s destruction of online environmental resources. It’s worse than last time. It’s also, seemingly, just the beginning — paving the way forward for the president’s polluting agenda.\n\nA watchdog group that monitors publicly-available environmental data has recorded 70 percent more federal website changes during Trump’s first 100 days in office in 2025 compared to the start of his first term in 2017.\n\nFederal agencies are taking broader swings to ax public resources from their websites this time around, the report shows. They’re hiding which communities are most affected by pollution. The Trump administration has not only tossed out the most authoritative national reports on climate change, they’re starting to replace facts and evidence with disinformation. We’re seeing a revisionist history unfold.\n\n“You can say anything you want to say if you remove evidence to the contrary.”\n\n“If you suppress data … you can say anything you want to say if you remove evidence to the contrary,” says Gretchen Gehrke, one of the lead authors of the report published this week by the Environmental Data & Governance Initiative (EDGI).\n\nLooking just at the first 100 days of Trump’s second term compared to the start of his first term, EDGI noted 632 important changes to federal websites this year compared to 371 in 2017. That’s despite EDGI only keeping tabs this year on 20 percent of the websites it monitored during the first term, due to capacity constraints and because the group chose to home in on webpages it thought would be most vulnerable.\n\nThey’ve tracked 879 significant changes to 639 different federal webpages during the first 6 months of the current administration. That includes changes to content, like replacing the term “climate change” with “extreme weather,” and the wholesale removal of entire webpages.\n\n“The thing that is the most different is this total erasure of information about environmental racism and the evidence of environmental racism,” Gehrke says. “In the second Trump administration, information control was about removing evidence of inequality.”\n\nAs global warming pushes up sea levels, for example, a 2021 EPA report found that Hispanic and Latino individuals are roughly 50 percent more likely than others to live in coastal areas with the highest estimated increases in traffic delays from worsening high-tide flooding. A press release and PDF of the report are still available online. (Did it escape scrutiny because it’s described as a “social vulnerability report” rather than an environmental justice report?) A link in the press release to more “information about environmental justice,” however, is dead. It simply says “Sorry, but this web page does not exist.”\n\n“Information control was about removing evidence of inequality.”\n\nFor resources on climate change more broadly across federal websites, changes have “started really ramping up,” Gehrke says. “That story is yet to unfold.” So far, the EPA’s climate change website is still intact. But the Trump administration has terminated the content production team behind climate.gov, and the URL started redirecting people to the National Oceanic and Atmospheric Administration (NOAA) website in June. It’s a warning sign that “it is possible that another significant removal of climate change information is currently unfolding as of the writing of this report,” the EDGI report notes.\n\nNeither the Department of Energy nor NOAA immediately responded to inquiries from The Verge. “President Trump was elected with a mandate from the American people to create a more effective and efficient federal government that serves all Americans, and EPA is doing just that,” Brigit Hirsch, EPA Press Secretary, said in an email to The Verge.\n\nAccess to as much as 20 percent of the Environmental Protection Agency website was removed throughout Trump’s first term, according to research EDGI published in 2021.\n\nFortunately, EDGI and other groups have also been working to make data available elsewhere online for the public. The nonprofit Internet Archive’s Wayback Machine can pull up snapshots of what webpages have looked like over the years. Archiving tool Webrecorder also has created mirrors of climate.gov and the US Global Change Research Program website that used to house national climate assessments.\n\nFarmers and environmental groups have also filed suit to force the Trump administration to restore federal resources. Farmers won a legal battle to bring climate content back to US Department of Agriculture webpages. Sierra Club and other groups have sued to bring back EJScreen. In the meantime, a copy of the tool is available from The Public Environmental Data Partners.",
  "authors": [
    "Justine Calma"
  ],
  "url": "https://www.theverge.com/science/757084/data-purge-climate-change-environmental-justice-trump"
}