{
  "title": "The Amazon Kindle Paperwhite Is Finally On Sale",
  "text": "“I did a lot of research and was going back and forth between Kindle Papewhite and competitors (especially if you’re not 100% in Amazon ecosystem) and I do not regret going with Kindle.\n\nIt is the perfect size and screen ratio for my taste, not too big not too small. It’s very thin and light, and most importantly it accepts EPUB files from other stores, which was important to me as Amazon (even with subscriptions to their bookstore, doesn’t offer books in other languages and/or sometimes competitor stores have a better price) So Amazon/Kindle gets a 5 star rating for not locking you to their bookstore and transferring books from my phone to Kindle takes seconds, no cables or computers - it’s that easy!\n\nIt has all the great features that my iPad had like highlighting and warm light for bedtime reading, minus all the distractions of an iPad and its glowing LCD screen.\n\nOverall, I’m happy that I didn’t go with Kobo or other competitors.” — Dmitriy P. Zolotovskiy\n\n“I absolutely love my kindle paper white! I purchased the jade color and it is so beautiful! I am one who would rather have a physical book in my hand. I never thought I would like an E-reader, but this kindle is amazing. I love everything about it and use it every single day. The screen auto adjusts to the lighting. You have the option to put it in light or dark mode. The battery lasts around a month. I use it every day, sometimes for hours at a time. It travels to work with me in my bag easily. I purchased a case for it to protect it as much as possible. Will be purchasing again in the future when this one doesn’t work anymore. Would like to see the on/off button on the bottom center versus on the bottom right. I’m right handed and sometimes turn it off by accident. By no means is that a deal breaker though! Having it in the center on the bottom would accommodate for both left and right handers!” — Raylynn\n\n“I As someone who loves reading both at home and on the go, the Amazon Kindle Paperwhite (16 GB) has completely transformed my reading habits. Whether I’m lounging by the pool, curled up on the couch, or traveling across the country, this e-reader has become an indispensable part of my daily routine. Overall, the Amazon Kindle Paperwhite (16 GB) has become my go-to device for reading. Its premium features, like the sharp display, waterproofing, long battery life, and generous storage, make it the perfect companion for both casual and avid readers. Whether I’m at home or traveling, it’s always ready to provide a fantastic reading experience. If you’re looking for an e-reader that, does it all, I wholeheartedly recommend the Kindle Paperwhite. I absolutely love mine and would buy it again and again! I have many friends who have purchased since I got mine and they love it as well!” — Brittany Pipkins\n\n“MY GOODNESS what a revelation this device is. E-ink is the coolest thing ever. It is actually a huge triumph to be able to make something as age-tested as reading EASIER. E-ink is seriously impressive. The display tickles that part of my brain that is telling me im looking at words on paper. The Paperwhite has a backlight that makes it easy to read in any lighting. You dont have to buy a book light, you dont have to leave a lamp on, you dont have to worry about the sun making the Paperwhite unreadable. In the sunniest of environments (the beach), you can see the Paperwhite with extreme clarity. I havent even mentioned how incredibly light the device is. For being E-ink, the Paperwhite is actually very responsive. It does have an IPX8 water resistance, but i wouldnt put that to the test (look below review for fun side note on this). Perfect for the beach or the pool. It has literal weeks of battery life and will improve your reading life more than you ever thought. Grabbing one on black friday or on prime day is a great deal for sure, but I feel like the normal price is completely reasonable for the incredible technology going on here.\n\n\n\nIPXX - the “Ingress Protection” rating works like this - The first X represents dust ingress (dust getting in). Since its an X that means it doesnt have any protection for that. The second X represents water ingress (water getting in). Since its an 8, it is actually one off as high as the protection number for water ingress gets. Meaning an IPX8 rating means its pretty good at being waterproof. The more you know.” — Tucker Kovalchek\n\n“I am OBSESSED! I read a ton and after reading I’m my regular kindle my eyes would ache! This helps a ton. And literally feels like you are reading from a book! I also love the anti glare screen so I can read at the beach easily” — Kindle Customer",
  "authors": [
    "Shopping Editor"
  ],
  "url": "https://www.huffpost.com/entry/amazon-kindle-early-black-friday-sale_l_691f4f40e4b047290e292362?origin=home-shopping-unit"
}