{
  "title": "The moment I knew: I felt a pang of fear – but I knew we were an unbeatable duo",
  "text": "Long before we’d met, I had heard a lot about a guy called Tom Box. I knew he was an Australian living in the South Island of New Zealand. I was in Wellington, and there’d been a few occasions when I’d travelled to the South Island for raves or anarchist conferences where some of the folks had gone to Tom’s place – but I splintered off somewhere else.\n\nThen one day, in 2007, I was at a punk gig when a mutual friend said, “Oh, do you know Tom Box? He’s over there. He’s just moved up to Wellington.” There in a sea of black-clad punks, jumping up and down at the front of the mosh pit, was this guy in a pale blue Star Trek uniform. To me, as a person unfamiliar with Star Trek, he looked like he was wearing pyjamas. This was my first vision of him, but we didn’t talk at all that night.\n\nView image in fullscreen Kate and Tom at the Doctor Who Worlds of Wonder Exhibition in Wellington, 2024.\n\nSome time later I was living in a squat and working as a theatre set designer. I’d made this set that had gameshow podiums in it, but they looked a bit like Daleks. Another friend saw them and said his housemate, who was obsessed with Doctor Who, would love them. It turned out his housemate was Tom.\n\nThey lived around the corner, so, hoping to catch his attention, I drew a poster saying “Free to a good home, something vaguely resembling a Dalek!” I included my phone number and stuck it outside what I thought was his flat. About a week passed and I hadn’t heard anything. Then I realised I’d stuck it up in the wrong alleyway, so I moved it and within 24 hours I had a bite.\n\nTexts started flowing in and they got weird pretty quickly. He was initially concerned that I might be someone dodgy trying to lure him in with a Dalek. Tom has a slightly filthy sense of humour, which I find very entertaining, so once I had confirmation from a mutual friend that the texter was indeed him, I was happy to keep up the banter.\n\nEventually, we met up, and he wasn’t convinced my set pieces looked much like a Dalek. We had a cup of tea and decided we should keep hanging out. Our first few dates were pool, pinball and roller disco outings. Sometimes, we’d play doubles at pool and would be so on fire no one could beat us.\n\nView image in fullscreen The couple wearing Star Trek uniforms at home with Esmerelda, also dressed in a Star Trek onesie, 2011.\n\nI gradually started spending more time at his place and, eventually, when a room became available in his flat, I moved in.\n\nI’d had a number of short relationships before meeting Tom but I always knew they had their limits. With Tom, something felt different. It was as if we’d been on the same path the whole time – like we’d always been heading towards this moment. But this revelation was not without anguish. I’d come out of a relationship with a woman – my first of this nature – and was eager to explore more.\n\nI remember sitting on the back porch of my squat feeling a pang of fear that my life would never be the same again – but I already knew we were an unbeatable duo. In that way, meeting Tom was joyous and a little sad, because it meant my future experiences with women might be over. It also marked the end of my squat life – no rent, no bills, carefree days – and suddenly I needed a proper job to fund my new “lavish” lifestyle of dining out with Tom!\n\nRight from the get-go we always enjoyed dressing up together. Tom loves the gender-bending aspects of some of the costumes. We started an annual calendar of photos of Tom dressed as various masked characters we’ve created. We’d go on road trips waiting to jump out if we spotted the right opportunity, such as a derelict house for Creepy Bunny, or some farm machinery for Pigeon Head.\n\nTom is a gardener, at home and at work, and does a lot of hard yakka that I really admire and respect, regenerating the native bush for the birds and insects. In his past he was a forest blockader and, having been to a few blockades myself, I understood the risks and importance of this type of activism. His care for nature is very deep, and I love and respect that greatly. Tom has a great moral compass, too, and is always a wonderful sounding board.\n\nWe’ve been together for 18 years now. I work in the film industry so, while I’m galavanting around the country working, Tom keeps the home fires burning. We bought a house, had a few cats – sadly lost a few, too. We’ve both learned to enjoy time apart but love coming back together again, going on adventures and our lovely life together.\n\nTell us the moment you knew",
  "authors": [
    "James Norman"
  ],
  "url": "https://www.theguardian.com/lifeandstyle/2025/nov/15/the-moment-i-knew-i-felt-a-pang-of-fear-but-i-knew-we-were-an-unbeatable-duo#comments"
}