{
  "title": "26 Healthy, Delicious Thanksgiving Recipes That’ll Make You Feel Great",
  "text": "Advertisement\n\n26 Healthy, Delicious Thanksgiving Recipes That’ll Make You Feel Great Olive oil mashed potatoes, baked apples and more lighter and brighter dishes for a balanced and vibrant feast. Sheela Prakash’s roasted lemon caper brussels sprouts. Credit... Christopher Testani for The New York Times. Food Stylist: Simon Andrews.\n\nThanksgiving comes only once a year. So even if you typically aim to eat a well-balanced diet, helping yourself to a scoop of buttery mashed potato casserole or a generous slice of apple crumb pie on the year’s biggest food holiday isn’t only OK, it’s an important part of the celebration. Holiday foods often carry family traditions and memories, and enjoying them is one way we honor those connections. (Remember: What you eat most of the time matters far more than what you eat in a single day.)\n\nHealthy means different things to different people. But, according to the Dietary Guidelines for Americans (updated by the Health and Human Services Department and the Agriculture Department every five years), the American Heart Association, and the American Diabetes Association, it’s pretty straightforward.\n\nAll three groups recommend filling your plate with plenty of fruits and vegetables, cooking with heart-healthy fats like extra-virgin olive oil and avocado oil, and including beans, nuts, seeds and whole grains whenever possible. They also recommend being mindful of added sugars, red and processed meats, and ultraprocessed foods, which is where much of our dietary sodium hides. Finally, you should keep an eye on butter and sugar intake, but unless you have a medical condition that requires it, most people don’t need to eliminate them completely.\n\nIf you want to take your table in a healthier direction, keep it simple. Many Thanksgiving staples, like turkey, roasted brussels sprouts and sautéed green beans, are naturally wholesome as they are. But heavier dishes, like sweet potato casserole or apple pie, can be swapped for roasted sweet potatoes or an apple crisp. (Or not, and just get back to balanced eating the next day.) However you approach it, these 26 recipes can help you build a healthier and more colorful meal, which is no less fun or delicious.\n\nCredit... Rachel Vanni for The New York Times. Food Stylist: Simon Andrews.\n\nSheela Prakash’s version of the holiday favorite has a subtle Italian twist, inspired by cacio e pepe. The beans are glossy with black pepper-infused olive oil and a generous sprinkle of Pecorino Romano. It’s an easy, one-pan side that still feels special.\n\nRecipe: Cacio e Pepe Green Beans\n\nAdvertisement\n\nCredit... Rachel Vanni for The New York Times. Food Stylist: Monica Pierini.\n\nHerbs and spices complement the natural sweetness of butternut squash and orange in Ashley Lonsdale’s salad. Balance out your Thanksgiving Day workload by making this ahead; it tastes even better as it sits.\n\nRecipe: Roasted Butternut Squash Salad With Spicy Green Sauce\n\nCredit... David Malosh for The New York Times. Food Stylist: Simon Andrews.\n\nThis turkey from Melissa Clark has earned its spot at the center of countless holiday meals, and for good reason. With more than 5,000 five-star reviews, readers called it “moist” and “picture-perfect.” Make this, and you’ll see why this bird has become a holiday legend.\n\nRecipe: Simple Roast Turkey\n\nCredit... Christopher Testani for The New York Times. Food Stylist: Simon Andrews.\n\nThese brussels sprouts shine thanks to Sheela Prakash’s briny dressing of lemon, Dijon and capers. The dish is simple enough for a regular weeknight, but special enough to share space with your other sides.\n\nRecipe: Roasted Lemon Caper Brussels Sprouts\n\nAdvertisement\n\nCredit... Christopher Testani for The New York Times. Food Stylist: Rebecca Jurkevich.\n\nMade with extra-virgin olive oil instead of butter, David Tanis’s mashed potatoes are smooth, garlicky and full of flavor — not to mention vegan and easy to make.\n\nRecipe: Olive Oil Mashed Potatoes\n\n6. Kale Salad With Pickled Raisin Vinaigrette\n\nCredit... Rachel Vanni for The New York Times. Food Stylist: Monica Pierini.\n\nSheela Prakash’s kale salad will win over guests with its pickled raisin and honey vinaigrette, which sets it apart from more traditional versions. As a bonus, everything can be prepped in advance.\n\nRecipe: Kale Salad With Pickled Raisin Vinaigrette\n\nCredit... NIk Sharma for The New York Times (Photography and Styling)\n\nShake up the menu with Nik Sharma’s modern take on wild rice dressing. It combines earthy mushrooms, sweet dried cranberries and chewy rice, but the chile crisp is the cherry on top: a crunchy, spicy finish that ties it all together.\n\nRecipe: Wild Rice Dressing With Mushrooms and Chile Crisp\n\nAdvertisement\n\nCredit... Linda Xiao for The New York Times. Food stylist: Maggie Ruggiero. Prop Stylist: Sophia Eleni Pappas.\n\n“This was outstanding!” wrote one reader about Lisa Donovan’s hearty French lentil salad. Made with thyme, rosemary, parsley, tarragon and dill, it’s an herby, flavorful vegetarian side or main. To make it vegan, swap the honey for maple syrup.\n\nRecipe: French Lentil Salad\n\nCredit... David Malosh for The New York Times. Food Stylist: Simon Andrews.\n\nThis salad from Sheela Prakash sparkles with jewel-toned pistachios and pomegranate seeds. The bulgur — a nod to tabbouleh — gives this vibrant dish enough heft to double as a vegetarian main. The final result: “Outstanding!”\n\nRecipe: Brussels Sprout Salad With Pomegranate and Pistachios\n\nCredit... John Kernick for The New York Times. Food Stylist: Simon Andrews.\n\nThis whole roasted cauliflower is a stunning vegetarian side or main. The mix of almonds, garlic and herbs gives it a rich flavor that’s balanced by the tanginess of vinegar. Any variety of cauliflower works, but a colorful one adds extra flair to your holiday table.\n\nRecipe: Whole Roasted Cauliflower With Almond-Herb Sauce\n\nAdvertisement\n\nCredit... David Malosh for The New York Times. Food Stylist: Rebecca Jurkevich.\n\n“This recipe lives up to its name,” says one reader of Ina Garten’s much-loved roast chicken. Stuffed with lemon, garlic and thyme, then brushed with butter, this roast chicken is a lower-fuss alternative for smaller gatherings.\n\nRecipe: Ina Garten’s Perfect Roast Chicken\n\nCredit... Linda Xiao for The New York Times. Food Stylist: Monica Pierini.\n\nMartha Rose Shulman’s cranberry-orange relish is a citrusy alternative to traditional cranberry sauce. Fresh orange and honey balance the tart cranberries, and pecans add subtle crunch. Make extra to enjoy on leftover turkey sandwiches or to add to yogurt for breakfast.\n\nRecipe: Cranberry-Orange Relish\n\nCredit... Romulo Yanes for The New York Times. Food Stylist: Vivian Lui.\n\nSamin Nosrat’s turkey breast is a fantastic centerpiece for a smaller Thanksgiving. The tangy, salted buttermilk works its magic overnight (or longer, if you plan ahead), yielding juicy meat and a beautifully burnished skin. Once marinated, it roasts to perfection in under an hour — a foolproof showstopper.\n\nRecipe: Buttermilk-Brined Turkey Breast\n\nAdvertisement\n\nCredit... Armando Rafael for The New York Times. Food Stylist: Samantha Seneviratne.\n\nThis vegan gravy from Carolina Gelen is rich and versatile: Serve it over turkey or any holiday side, such as mashed potatoes or stuffing. Tip: Use a lower-sodium soy sauce to decrease the salt content by almost 40-percent without sacrificing flavor.\n\nRecipe: Caramelized Shallot Gravy\n\nCredit... Christopher Testani for The New York Times. Food Stylist: Simon Andrews.\n\nLidey Heuck’s roasted sweet potatoes emerge from the oven tender with crisp, caramelized edges. “It’s so easy,” one reader said, “it shouldn’t be legal to make for Thanksgiving.” Others suggest dressing it up with smoked paprika, gochujang and soy sauce, or a touch of maple syrup for sweetness.\n\nRecipe: Roasted Sweet Potatoes\n\nCredit... Christopher Testani for The New York Times. Food Stylist: Yossy Arefi.\n\nBaked apples check a lot of boxes for holiday entertaining: They’re simple, gluten-free and can be made dairy-free or vegan to suit your guests. Dorie Greenspan fills hers with dried apple rings and candied ginger, but you can use another dried fruit, such as raisins or cherries. A dollop of whipped cream or ice cream is optional, but nice.\n\nRecipe: Baked Apples\n\nAdvertisement\n\nCredit... Linda Xiao for The New York Times. Food Stylist: Barrett Washburne.\n\nIf you’re on the hunt for a five-star vegan dessert, look no further than this cheesecake from Isa Chandra Moskowitz. One reader describes it as “silky, fresh and absolutely delightful.” Instead of cream cheese, soaked cashews are blended with the banana, silken tofu, pumpkin purée and pumpkin pie spices.\n\nRecipe: Vegan Pumpkin Cheesecake\n\nCredit... Christopher Testani for The New York Times. Food Stylist: Simon Andrews.\n\nFor the best roasted potatoes you’ll ever make, try Lidey Heuck’s recipe. You can dress it up with herbs or spices, or keep it simple with olive oil and salt. Either way, it’s the kind of side that belongs on every table — on Thanksgiving and throughout the year.\n\nRecipe: Roasted Potatoes\n\nCredit... Linda Xiao for The New York Times. Food Stylist: Monica Pierini.\n\nYewande Komolafe’s spicy pumpkin soup, which draws from Nigerian cuisine, is beautiful on the table. The blend of pumpkin, coconut milk and peanut butter gives the soup a creamy depth, while the ginger, garlic and chile add gentle heat that one reader described as “absolutely delicious!”\n\nRecipe: Spicy Peanut and Pumpkin Soup\n\nAdvertisement\n\nCredit... David Malosh for The New York Times. Food Stylist: Simon Andrews.\n\n“Gregory, you genius!” one reader wrote about this dish’s flavors. With chiles, lime and cashews, it’s spicy, crunchy and ready to disappear fast at any gathering. Case in point: “Everyone raved about it, there was not a single spoonful leftover.”\n\nRecipe: Gregory Gourdet’s Carrot Salad With Oranges and Cashews\n\nCredit... Andrew Scrivani for The New York Times. Food Stylist: Devon Knight\n\nDavid Tanis’s caramel pears, described by one reader as “lovely and simple with a scoop of vanilla ice cream,” is quite the dessert. Baked with star anise, cinnamon and honey, the pears are cooked until soft for a rustic, elegant finale.\n\nRecipe: Caramel Pears With Rosemary, Honey and Walnuts\n\nCredit... David Malosh for The New York Times. Food Stylist: Cyd Raftus McDowell.\n\n“My broccoli-hating husband absolutely devoured this,” wrote one reader about Sohla El-Waylly’s sweet-and-savory side. Dates and mixed nuts give humble broccoli a Thanksgiving-worthy upgrade that just might convert any skeptics at the table.\n\nRecipe: Broccoli With Sizzled Nuts and Dates\n\nAdvertisement\n\nCredit... David Malosh for The New York Times. Food Stylist: Simon Andrews.\n\nVallery Lomas skips the usual smoked meats in favor of smoked paprika in this healthier spin on the Southern classic. If you’re watching your salt intake, swap in low-sodium stock. The greens will still soak up plenty of flavor.\n\nRecipe: Turnip Greens\n\nCredit... Joel Goldberg for The New York Times. Food Stylist: Barrett Washburne.\n\nKay Chun’s roasted squash salad is sweet, nutty and full of color. A triple-sesame vinaigrette ties it all together, prompting one reader to call it “splendid.” It’s great as a Thanksgiving side or a plant-based main. If you’d like to make it even more filling, add rinsed and drained canned beans.\n\nRecipe: Squash and Spinach Salad With Sesame Vinaigrette\n\nCredit... Bryan Gardner for The New York Times. Food Stylist: Barrett Washburne. Prop Stylist: Paige Hicks.\n\nIf you’re looking for a dairy-free, vegan main or side, give Jocelyn Ramirez’s mac and cheese a try. Cashews and potatoes are blended together to create a silky sauce. Carrots lend color, and nutritional yeast delivers that cheesy flavor. You can even make it gluten free by using a gluten-free pasta of your choice.\n\nRecipe: Vegan Poblano Macaroni and Cheese\n\nAdvertisement\n\nCredit... Johnny Miller for The New York Times. Food Stylist: Simon Andrews. Prop Stylist: Christina Lane.\n\nConsider swapping a traditional double-crusted apple pie for Genevieve Ko’s crisp with a golden, nutty topping that readers call “the best part.” It’s just sweet enough, and it’s easy to make gluten-free.\n\nRecipe: Apple Crisp\n\nFollow New York Times Cooking on Instagram, Facebook, YouTube, TikTok and Pinterest. Get regular updates from New York Times Cooking, with recipe suggestions, cooking tips and shopping advice.",
  "authors": [
    "Samantha Cassetty",
    "Samantha Cassetty Is A Registered Dietitian Nutritionist."
  ],
  "url": "https://cooking.nytimes.com/article/healthy-thanksgiving-recipes"
}