{
  "title": "Netflix's 'Wednesday' Is The Nuanced Latine Representation We Crave",
  "text": "The most interesting thing about Wednesday Addams as we know her now is that she’s a powerful psychic whose best friend is a disembodied hand.\n\nAddams also happens to be Latina — but that’s not supposed to be the point. The recent record-shattering success of the Netflix series “Wednesday” feels like a new type of win for Latinx representation at a time when the word “representation” is often a stand-in for tokenism. It’s evidence that we can have diversity without being reminded of that diversity at every waking moment, and for once it feels like a TV show gets it.\n\nFor example, Wednesday Addams, played by Jenna Ortega (who is of Mexican and Puerto Rican heritage), doesn’t have to highlight her Latinidad in order to be comfortable with that part of her identity. We get passing references to her heritage — from the way she dances to nods at Dia de los Muertos — but it doesn’t feel performative. She doesn’t have to lean into the “spicy Latina” stereotype or adopt a fake accent in order for us to understand her as a Latinx character. In fact, her authentic portrayal of Latinidad is one of the things that Ortega expresses when she talks about what she loved so much about her role as Wednesday Addams.\n\nAdvertisement\n\n“I feel like a lot of [the Latinx representation is Hollywood] is very calculated diversity, in terms of they hire people to check off a box,” she said in a recent interview. “I do hope to see a world where we start to see Latinos being cast as everyone and not just a side character where their heritage is their entire personality.”\n\nOrtega’s sentiment about Latinx characters basing their entire personality on their cultural heritage definitely resonates. While Latinx representation is broadening, shows that brand themselves as “Latinx shows” tend to overplay their character’s culture to the point where it starts to feel inauthentic. I remember thinking this about the Netflix show “On My Block,” in which the characters seemed to remind each other that they were Latino way too often. It felt contrived. While it was nice to see so many Latinos on screen, it felt like the Latino expression was for the others — not us.\n\nPersonally, I can understand the impulse to play up our culture; it’s something I arguably do in my writing, too. To an extent, it comes from a fear of not being perceived as “Latino enough” because there’s a certain way that our culture tells us what Latinx people are supposed to look like and how we’re supposed to act. When we’re “the only ones” in certain spaces, there’s also a pressure to try to display all aspects of our culture.\n\nAdvertisement\n\nMaybe it’s the reason that producers, even from our own communities, exaggerate the stereotypically Hispanic traits of their characters — otherwise, how are we going to know that they are really Latinx? The beauty of “Wednesday” is that it doesn’t seem to concern itself with making the main character Latina enough. She simply is. And that’s more than enough proof that we are not a monolith.\n\nStill, Wednesday’s Latinidad is an essential part of the story. In fact, I’d argue that Addams would not be the hero she becomes if it weren’t for her cultural heritage. That’s because Wednesday is doubly an outsider: one, for having psychic powers, and two, for being Latina. Her status as a cultural “other” makes her more sensitive to the struggles and motives of others, expertly illustrated in a scene where she calls out the town’s Pilgrim-themed amusement park for glorifying colonialism.\n\nBut even beyond that, the entire series revolves around the historical tensions between Evermore Academy, a so-called school for outcasts, and the people of the nearby town of Jericho. It’s not hard to see how this tension resembles the real political climate between certain Americans and their misguided fear of those who are different. This is what makes “Wednesday” a fundamentally Latinx story, too.\n\nAdvertisement",
  "authors": [
    "Contributing Writer"
  ],
  "url": "https://www.huffpost.com/entry/netflix-wednesday-latina-identity-jenna-ortega_n_639a0ae7e4b0c2814649e542"
}