{
  "title": "Stevie Nicks review – rock legend dazzles Brooklyn with anecdotes and classic hits",
  "text": "Stevie Nicks would like to get the matter of her possible near-death experience out of the way as soon as possible. A few months ago, the Fleetwood Mac singer and rock legend suffered an accident that forced her to postpone a string of tour dates, including this show in Brooklyn which was rescheduled from August to November. “I was airborne,” she recalls of the incident around five minutes after hitting the stage tonight. “I thought: ‘Is it over?’” A voice at the back of the arena lets out an animalistic yell. “No!!!!”\n\nIt’s a safe bet that everyone in the 17,000-capacity Barclays Center arena shares the sentiment. Tonight, a noticeably varied audience of fans has shown out for Nicks’s rescheduled date, ranging from witchcore-styled teens to longtime fans who retain a love for the 70s’ bohemian style as well as the decade’s social consciousness: the venue is sold out of veggie burgers.\n\nWhile Nicks hasn’t released a studio album of new material since 2011’s In Your Dreams, she hasn’t strayed too far from the center of pop culture since. In recent years, she’s regularly performed with Harry Styles, helped inspire a song on Taylor Swift’s zillion-selling The Tortured Poets Department, and had two Barbie dolls created in her honour. In 2019, she became the first woman to be inducted into the Rock and Roll Hall of Fame twice, in an overdue corrective to initially sluggish critical recognition of her solo work. (She holds the record for the most Grammy nominations for female rock vocal performance without a win.)\n\nView image in fullscreen Stevie Nicks at Barclays Center. Photograph: Sarah Waxberg\n\nAfter limbering up with some ballet moves and roaring that it’s time to get the party started, Nicks launches into a setlist spanning Fleetwood Mac classics and choice cuts from her stellar 80s albums Bella Donna and The Wild Heart. On If Anyone Falls, she’s fired up as her muscular voice rises to a shout, while the storming centerpiece Stand Back comes alive with a throbbing motorik intro, synthy power-chords, and analog bits of kit that light up like a spaceship’s control room.\n\nThe show is part musical performance, part An Evening With Stevie Nicks, with extended and sometimes self-deprecating anecdotes forming the evening’s tapestry. Before launching into a performance of the less-memorable recent single The Lighthouse, Nicks describes being invited to perform the song on Saturday Night Live. “Which I hadn’t been on since, I dunno” – she pretends to think about the year – “nineteen … hundred.” At other times, she’ll tell stories about her capes, regularly disappearing offstage to switch out one embroidered garment for another and rightly pausing to invite a little commotion for the look.\n\nThere’s a similar looseness to Nicks’s commitment to building her songs into three-dimensional theatre. In a new version of her Rumours clapback to groupies, Gold Dust Woman becomes a brilliant 13-minute cacophony during which Nicks seems to play both the song’s narrator and the flirty hanger-on: during an extended guitar solo, she dances trance-like as if crafting a love potion, before bellowing a command for the witchy intruder to get out. With her lowered register, it would be pushing it to say that Nicks had never sounded better, but she’s majestically assured on Dreams, with her deepened register adding to the song’s ache.\n\nView image in fullscreen Stevie Nicks at Barclays Center. Photograph: Sarah Waxberg\n\nMissing tonight are Nicks’s former live staples like Leather and Lace, Enchanted, and Sara, as well as well-streamed minor singles like Talk To Me and Rooms On Fire. It’s hard to exactly begrudge Nicks for focusing on the material she knows works as she makes her return to the stage, but a few deeper cuts would have been welcomed by diehards as well as freshened the setlist, which is essentially a curtailed version of her 24 Karat Gold Tour.\n\nHer sense of passion and play still burns bright. “Dance all night long,” Nicks tells the audience as parting words, after a stripped-down Landslide has brought the arena to a hush. “That’s probably what has gotten me to 77 years old. Dance on your way to the kitchen; dance on your way to watching TV; most of all, dance for me.” Her words are warm, whimsical and utterly sincere. She has more than earned her victory lap.",
  "authors": [
    "Owen Myers"
  ],
  "url": "https://www.theguardian.com/music/2025/nov/20/stevie-nicks-review-brooklyn-tour-date"
}