{
  "title": "Out of the shadows: why Avril Coleridge-Taylor deserves to be heard",
  "text": "Avril Coleridge-Taylor always felt the weight of her father’s legacy. As the daughter of Samuel Coleridge-Taylor, one of the most famous British composers of the early 20th century, Avril’s was a name enveloped in the long shadows of history.\n\nEarlier this year, I sat with these shadows as I prepared to make the world premiere recording of Avril’s 1936 piano concerto with the BBC Philharmonic. With its impassioned harmonies, soulful lyricism and valiant rhythms, Avril’s work will grant new listeners fascinating insight into how she – a wartime composer, born in 1903 – conceived of her world as a woman of colour.\n\nBut here’s the thing about shadows. It can take a while to adjust, to see shapes as they really are, to distinguish truth from distortion, and I had been afraid to confront Avril’s past for a while.\n\nI had so wanted her to be her father’s daughter. In some ways, she was. The pastoral English palettes of Samuel’s influence can be heard in many of her works, including From the Hills (1934) and Sussex Landscape (1940). But you only have to look at the titles of her father’s compositions to see how he heard himself as not only a flag bearer of English Romanticism but a voice of the African diaspora.\n\nThis was where father and daughter seemed to diverge.\n\nWhite America judged Samuel by the brilliance of his music rather than the colour of his skin\n\nDuring his studies at the Royal College of Music, Samuel – the son of a Sierra Leonean father and a white English mother – started to lean into his African roots. When the African American poet Paul Laurence Dunbar came to London in 1897, the 21-year-old composer eagerly sought him out. He set Dunbar’s African Romances to music and the following year used the poet’s words for an opera, Dream Lovers. Then came the choral piece that put Samuel on the map: Hiawatha’s Wedding Feast.\n\nBased on Henry Wadsworth Longfellow’s The Song of Hiawatha, Samuel’s Hiawatha was an international hit, especially with African Americans who felt vicarious pride as white America judged Samuel by the brilliance of his music rather than the colour of his skin.\n\nFame did not temper Samuel’s politics. In 1900, he attended the First Pan African Conference in London where he met the African American intellectual WEB Du Bois and witnessed a range of talks, including on the oppression of Black South Africans. He was an activist until the end. He maintained ties with early civil rights leaders such as Du Bois and Booker T Washington, delivered his own speeches on racial equality, and even discussed issues of racism with President Theodore Roosevelt during an invitation to the White House in 1904. As for his music, reminisced Du Bois, “he wrote his name so high as a creative artist that it cannot soon be forgotten.” He died in 1912, aged 37. But what would Samuel have made of his daughter’s decision to work in South Africa in the 1950s?\n\n“Daughter of Famous Composer gives OK to S African Bias,” ran a headline in the Black American publication Jet magazine. Apartheid “seems to me the right policy”, Avril told Jet. When pushed to clarify, she backtracked: she didn’t agree with apartheid “in principle” and it “should be allowed to work itself out, guided by well-meaning South Africans of all races”. Had Avril been more attuned to her father’s politics, or born in Jim Crow America, she might have thought twice about apartheid. But life had sheltered her.\n\nView image in fullscreen Samantha Ege and the BBC Philharmonic Orchestra recording the first album devoted entirely to the music of Avril Coleridge-Taylor. Photograph: Jason Dodd\n\n“I have a British passport,” she said, “and the officials never asked me questions about my race.” So, with her “porcelain-white” skin (as Jet put it) she floated among the Europeans, buoyed up by their praise for her late father. She gave a talk about her father’s music at the University of Cape Town and conducted the South African Broadcasting Corporation Orchestra in Johannesburg, programming the heroic third movement of her Piano Concerto, subtitled: “In remembrance of my Father.” Although a confident pianist herself, she never played as the soloist in her concerto. Instead, she always led as the conductor; and so the apartheid orchestra played under her baton.\n\nAvril hoped, in her own words, she “might bring a change”. But by 1954, things fell apart. Once officials learned of her African heritage, she could no longer stay in the country. Her British passport didn’t protect her, the British high commissioner advised her to leave or risk imprisonment. She returned to England, deeply ashamed as the magnitude of her naivety dawned. “The lesson was a hard one,” she lamented. Adding to her humiliation was the 1955 publication of her ill-fated Jet interview, a year after her unceremonious exit from South Africa.\n\nAs I sat with these shadows, I sensed a familiar story. The story of being British until you’re not – one that calls to mind African-descended soldiers who fought on behalf of the British during the second world war and survived only to be denied their due compensation. And the Windrush generation, who built postwar Britain out of the rubble, but still face legal challenges around their relationship to the only place they’ve ever called home.\n\nIn the aftermath, Avril thought of her father and the “tremendous faith he had in the coloured people of the world”. She wrote a piece called Ceremonial March (1957) for Ghana’s independence. Its commemorative overtones have much in common with her rousing In Memoriam: To the RAF (1945) and plaintive In Memoriam (1967), which she later dedicated to her brother Hiawatha on his death in 1980, as well as to her father.\n\nSamuel had gifted Avril with a sense of belonging in the world, and she took that to heart – for better and for worse. She could have made life easier for herself in South Africa by concealing her own African heritage and the Coleridge-Taylor name. But she embraced all that she was, and this extended to her music. The Concerto movement dedicated to her father proceeds with bold symphonic colours that insist, “I am here.”\n\nIf we are to hear the history of Black and mixed race Britain as it was, then we must sit long enough to see that the shadows of the past are nothing to fear if we intend to learn from them.",
  "authors": [],
  "url": "https://www.theguardian.com/music/2025/nov/20/composer-avril-coleridge-taylor-out-of-the-shadows-samantha-ege"
}