{
  "title": "Global utilities set out USD 1 trillion investment plans at COP30 as grid spend grows",
  "text": "Utilities for Net Zero Alliance (UNEZA) members increase energy transition investment commitments by more than 25% to nearly USD 150 billion annually with a major focus on grids.\n\nGovernments and banks back new grid financing principles designed to unlock multilateral development banks (MDBs) and climate capital to support power system development in emerging economies.\n\nKey financing initiatives announced by UNEZA and Green Grids Initiative (GGI) on Energy Day, advancing COP29 Grids and Storage pledge and COP28 Tripling Renewables commitments.\n\nBelem, Brazil, 14 November 2025 - Global utilities today announced upgraded annual investment plans that will see their energy transition spend rise to USD 148 billion per year, up from previously stated ambitions of USD 117 billion. The plans revealed by members of the Utilities for Net Zero Alliance (UNEZA) today at COP30, will see a group of the world’s leading utilities mobilise more than USD 1 trillion in energy transition investments to 2030 since establishment at COP28.\n\nThe investment commitments include a significant shift towards power grids and networks, with the world’s leading utilities set to spend around USD 1.24 on grids and storage for every dollar spent on renewable generation. The group will deliver tens of thousands of kilometres of new and upgraded grid infrastructure, and battery storage, while more than tripling their combined renewable energy capacity by 2030 compared with 2023 levels. Members will invest USD 66 billion per year in renewables, and USD 82 billion in grids and storage.\n\nThe announcement was made at a high-level ministerial meeting on grids in Belem today, where governments and multilateral development banks (MDBs) also backed new grid financing principles endorsed by the COP30 Presidency, and presented by the Green Grids Initiative and supported by UNEZA. Developed through consultation with leading banks, the Principles are designed to increase the pool of capital available to grids in emerging economies, from climate and development finance institutions.\n\nThe governments, institutions and banks that have confirmed their backing for the Climate Finance Principles for Green Grids, include African Development Bank, British International Investment, East African Development Bank, Inter-American Development Bank, Climate Bonds Initiative, Institutional Investors Group for Climate Change, Asia Investor Group on Climate Change, German Agency for International Cooperation (GIZ), Global Renewables Alliance, Grid Works, Climate High-Level Champions and the UK Government.\n\nIn a letter to heads of MDBs earlier this week, the COP30 CEO, Ana Toni, said: “Delivering on global goals for tripling renewable energy and doubling energy efficiency by 2030 will only be possible if grids keep pace. Through the Principles and the UNEZA partnership, we [COP30] are turning global commitments into practical delivery, linking finance, policy, and implementation to build the resilient power systems that will enable a clean-energy future.”\n\nUNEZA was established under the UAE’s COP28 Presidency to address bottlenecks in power system transformation. The Alliance is co-chaired by founding member TAQA headquartered in Abu Dhabi, and the UK’s SSE and operates under the guidance of the International Renewable Energy Agency (IRENA) and the Climate High-Level Champions. According to IRENA, around USD 670 billion of investment is needed per year to build out and strengthen electricity grids between now and 2030 to meet system transformation needs.\n\nJasim Husain Thabet, Group Chief Executive Officer of TAQA, founder and co-chair of UNEZA, said: “UNEZA was established at COP28 as a platform for cooperation and decisive energy transition action from the global utilities community. This announcement reflects the fact that we deliver against our promises and underscores the magnitude of our intent. Utilities worldwide are mobilizing with investments that are tangible, substantial and aligned with the need for a more resilient and sustainable energy system. We are standing up to deliver the most significant infrastructure upgrade of our lifetime – a power system fit for the 21st century, and fulfilling the pledges made at COP28 and COP29.\"\n\nMartin Pibworth, Chief Executive of SSE and co-chair of UNEZA, said: “The world is long on commitments and short on implementation, and we therefore welcome the Brazilian Presidency’s focus on closing this gap at COP30. This is where the global utilities community is making a real difference, turning policy into progress by delivering tangible, critical electricity infrastructure on the ground, and we are delighted to be setting out these increased investment commitments by UNEZA members today. Last year, UNEZA members built enough new grids to stretch from Belem to New Zealand, and enough new renewables capacity to meet half the peak demand of India. This is real, meaningful progress in the energy transition that is so critical to the future of our planet, and we now look forward to delivering this next step change in delivery.”\n\nFrancesco La Camera, IRENA Director General, said:: “Grids are now the biggest roadblock to the energy transition, especially in emerging and developing countries where resilient infrastructure underpins climate action, sustainable growth, and energy security. To make COP30 in Belém a turning point, we must go beyond just building more wires. We need a systemic rethink, creating secure, affordable, and reliable power systems fit for the future. Through the Global Coalition for Energy Planning and UNEZA, IRENA supports building ecosystems where regulators, utilities, planners, and ministries work together to deliver the speed, certainty, and bankability investors need.”\n\nDan Ioschpe, UN Climate Change High-Level Champion, and a key UNEZA partner said: “Resilient infrastructure is the foundation for climate ambition, sustainable growth, and energy security. To make COP30 in Belém a genuine turning point, we must move beyond the mindset of simply building more wires. We need a systemic transformation that creates more secure, affordable, and reliable power systems. The leadership and collaboration we see from the utilities community are reasons for true optimism. Their collective commitment to expand renewables, strengthen grids, and deploy storage reflects the kind of decisive corporate action that will define this decade.”\n\nMarcus Stewart, Head of Secretariat, Green Grids Initiative, added: “Green Grids Initiative is delighted that the COP Presidency has chosen to focus on Grids at this COP and back GGI’s Climate Finance Principles. Alongside the Tropical Forest Forever Facility, this is the only initiative to have received such high-level endorsement. GGI is proud to work alongside our partners in utilities, finance and government to increase the momentum for Grids and see a lot more finance mobilised to make them a reality for the countries that need them most.”\n\nRobin Zeng, Chairman of CATL, said: “Building upon the growing ambition from past COPs, COP30 must be the moment we close the gap between commitment and delivery. Here, energy storage emerges as the critical flexibility resource for a secure energy transition. We count on UNEZA as a key mechanism to help fulfil this ambition, by mobilizing global efforts and ensuring COP30 marks a decisive step forward.”\n\nAt the Ministerial meeting, UNEZA also announced a series of initiatives, known as ‘delivery mechanisms’ to further accelerate investment in grid modernisation. Together, these mechanisms address system bottlenecks that limit the pace of energy transition including supply chain challenges, and capital flows.\n\nThe mechanisms include:\n\nPooled Procurement: Aggregating demand across utilities to achieve economies of scale, lower equipment costs, and strengthen supply chains, starting with small island developing states (SIDS).\n\nAggregating demand across utilities to achieve economies of scale, lower equipment costs, and strengthen supply chains, starting with small island developing states (SIDS). Unlocking Stranded Gigawatts: Implementing data-driven planning, flexible grid access agreements, and new regulatory frameworks to reduce congestion and connect renewable capacity currently stalled by infrastructure gaps.\n\nImplementing data-driven planning, flexible grid access agreements, and new regulatory frameworks to reduce congestion and connect renewable capacity currently stalled by infrastructure gaps. Investment Trust Fund: Launching consultations on a global fund to mobilise long-term capital for grid and renewable-energy infrastructure, leveraging UNEZA’s robust project pipeline to lower the cost of capital and attract institutional investors.\n\nEarlier, UNEZA announced a new partnership with the Global Clean Power Alliance (GCPA) led by the UK government, specifically to address supply chain challenges affecting the power sector globally. GCPA confirmed UNEZA as its key supply chain mission delivery partner, bringing 12 ambitious governments together with 70 of the world’s leading utilities and power sector companies, to build more resilient power sector supply chains.\n\nThe Climate Finance for Green Grids Principles can be found here.\n\nUNEZA’s latest report on Progress on the COP29 Global Energy Storage and Grids Pledge can be found here.\n\nCOP30 Open Letter on Climate Principles for Green Grids can be found here.\n\nLearn more about UNEZA at https://www.utilitiesfornetzero.org/",
  "authors": [],
  "url": "https://www.irena.org/News/pressreleases/2025/Nov/Global-utilities-set-out-USD-1-trillion-investment-plans-at-COP30-as-grid-spend-grows"
}