{
  "title": "BBC Verify Live: Russian refinery blaze seen on video caused by second Ukrainian attack in a week",
  "text": "Q&A: Is Russia evading sanctions to repair oil facilities?\n\nThomas Copeland\n\nBBC Verify Live journalist\n\nWe’ve been looking into a second fire this week at an oil refinery in Russia, which was caused by the latest drone strike in Ukraine's ongoing campaign targeting energy infrastructure.\n\nFixing damage to these facilities is challenging for Russia. This is because, according to Petras Katinas from the Centre for Research on Energy and Clean Air, international sanctions have restricted access to the technology needed to repair and upgrade Russia’s oil industry.\n\nTo assess whether those efforts have proven effective, I sent three questions to sanctions expert, Tom Keatinge, who is the founding director of the Centre for Finance and Security at the Royal United Service Institute think tank:\n\nWhat impact are sanctions having on Russia's ability to repair oil refineries?\n\n“There's no doubt the controls on Russian access to technology is impacting its oil industry, but the impact of those restrictions has been frustratingly slow, hence the concerted effort by Ukraine to permanently disable Russia's oil infrastructure. The combination of aerial attacks from Ukraine and limited access to critical spare parts will present Russia with challenges.”\n\nWhat alternative routes can Russia use to evade sanctions?\n\n“The spoiler in all of this is the extent to which China can fill the gap left by Western sanctions. Russia has established supply chains with China and built new payment channels, including via cryptocurrencies.“\n\nWhy have issues with sanctions been hard to fix?\n\n\"The ability of sanctions to strangle Russia's access to technology has been oversold by many political leaders. The reality is that the sanctions created friction, but with the support of China, Russia has been able to maintain its access to the components it needs for 'business as usual' maintenance.”",
  "authors": [],
  "url": "https://www.bbc.com/news/live/c5y9y990y97t"
}