{
  "title": "Why these founders ditched social ads for Taylor Swift concerts and prison tablets",
  "text": "Build Mode is back with another episode! This season is highlighting lessons learned from the world of go-to-market strategies. Startup Battlefield editor Isabelle Johannessen sat down with Luna co-founder Jas Schembri-Stothart and Untapped Solutions founder Andre Peart for their unique perspectives on reaching niche customer segments following their own candidacy during the 2024 Startup Battlefield competition.\n\nIf our first episode, with Deon Nicholas, co-founder of Forethought AI, we explored what it takes to create a company with a customer-first approach. And in our second episode, we’re diving into guerrilla tactics and experiments that worked in reaching two very different target audiences: teenage girls and formerly incarcerated workers.\n\nFor Luna, which is a well-being app for girls, the difficulty in reaching that audience was clear: Neither co-founders were teenage girls anymore. To get the feedback and insights they needed, Schembri-Stothart and her team toured U.K. schools, “basically getting grilled” by students and getting harsh but clear feedback and even interest in helping build their app. They in turn became the beginning of a swarm of brand ambassadors, who were both “behind the scenes queens” working on the app itself and creators making social content to promote the app, becoming a go-to-market team of their own and setting up activations at major events like Taylor Swift concerts, where they knew their target audience would be gathered en masse.\n\nUntapped Solutions had a different challenge. As the “LinkedIn for the formerly incarcerated,” Peart had to find a way to make sure that the platform could actually be deployed into the many places where currently or formerly incarcerated individuals could access it in order to help them attain employment. And to do that, in a space largely untouched by tech solutions, they hit the speaking circuit hard, and even began their own National Reentry Coalition and their own event, which kicked off this April. That, alongside partnerships with agencies working with the 600,000 people released from prison annually, has led to an increasing ubiquity.\n\n“We’re in almost every prison system,” Peart said. “So if you’re on a tablet, you already have Untapped.”\n\nFor the full episode’s worth of insights, check out the video above, or listen and subscribe to Build Mode wherever you like getting your favorite podcasts. And if you like what we’re doing, give us a review — or if you have feedback about the show, reach out to us at podcasts@techcrunch.com.",
  "authors": [
    "Isabelle Johannessen",
    "Morgan Little",
    "Head Of The Startup Battlefield Program",
    "Sarah Perez",
    "Julie Bort",
    "Lorenzo Franceschi-Bicchierai",
    "Ram Iyer",
    "Connie Loizos",
    "Anthony Ha",
    "Rebecca Bellan"
  ],
  "url": "https://techcrunch.com/2025/11/20/why-these-founders-ditched-social-ads-for-taylor-swift-concerts-and-prison-tablets/"
}