{
  "title": "Historian Answers Folklore Questions",
  "text": "Transcript\n\nI am Juliette Wood.\n\nCan I say\n\nI'm Dr. Juliette Wood? Yeah.\n\nYes, my mother's ghost will come back if I don't say that.\n\nHello, I am Dr. Juliette Wood, and this is Folklore Support.\n\n[upbeat music]\n\nFirst question from Jerswar.\n\nHow did unicorns go from being thought\n\nof as dangerous beasts\n\nof the wilderness to being possibly the most stereotypical,\n\ncutesy thing for little girls in modern Western culture?\n\nInitially the unicorn was thought of as a real exotic beast.\n\nThe Greeks and the Romans really thought it existed\n\nat the edge of the world.\n\nIt was fast, it was vicious.\n\nIt never really got together\n\nwith other creatures except when it was mating,\n\nbut it defended its young.\n\nBy the medieval period, it becomes associated\n\nwith a Christ symbol, the lady and the unicorn.\n\nThe unicorn goes to the virgin, puts its head in her lap,\n\nand the hunters can capture it,\n\nand it kind of stays this way for a very long time.\n\nIt appears really in the 1990's as a kind\n\nof popular culture thing.\n\nIn the 1930's,\n\nJD Rockefeller gave beautiful unicorn tapestries,\n\nfamous unicorn tapestries to a museum in New York,\n\nthe Cloisters Museum.\n\nSo you're beginning already to get the unicorn seen\n\nas something popular, something modern,\n\nrather than a medieval or a classical image.\n\nIt becomes a fantasy creature.\n\nA couple of very famous fantasies written about the unicorn\n\nin the 1960s'.\n\nOther fantasy writers take it, take it up,\n\nand suddenly you begin to get it merchandised.\n\nThis for example, which is a little box\n\nwith a unicorn on it, a little papier mache box,\n\nwhich you could buy at any craft fair.\n\nPink ones abound because of the little girls\n\nand the My Little Pony.\n\nWhat you see here is how folklore works. It's very dynamic.\n\nYou have something which starts off\n\nas speculation about a real creature, does it exist,\n\nbecomes a medieval image, a Christian image associated\n\nwith art and with sort of explanations,\n\nit becomes a modern artistic image in the tapestries.\n\nIt becomes written in fantasy\n\nand it kind of suddenly explodes outwards\n\nand you get all these beautiful unicorns,\n\nnot only little girls.\n\nKeep in mind that they're also an important pride\n\nsymbol as well.\n\nThey become something which all kinds\n\nof groups can find meaning in meaning, which was not there\n\nto begin with, but which in a sense is possible in this kind\n\nof wonderful creature.\n\nThe next question is from Doctor Booshka.\n\nWhy are there so many stories across time\n\nand cultures about mysterious little people?\n\nMiniaturization of sort\n\nof folklore beings is actually something\n\nthat has occurred more recently than has\n\noccurred in the past.\n\nYou can see this with fairies\n\nkind of shrinking, leprechauns shrinking.\n\nNow, I suppose one of the things that if they're sort\n\nof tiny creatures, you kind of don't see them easily\n\nso they can kind of come out and jump at you.\n\nThe thing that comes to mind is in one\n\nof Guillermo del Toro's films,\n\nhe had something called the Tooth Fairy, which was so cute\n\nuntil it got you and ate your bones from the inside out,\n\nand I think he really captured the cuteness\n\nand the horror of these small creatures.\n\nJerswar asks, where does the idea\n\nfor magic wands come from?\n\nWands have often been associated with symbols of power.\n\nKings carry them, magicians carry them,\n\nand they were very large.\n\nThey really, really said, you know, here I am\n\nand I'm very, very important.\n\nYou get in the Middle Ages,\n\nyou will often see Merlin carrying a a long wand,\n\nbut as magic sort of comes into its own much later on,\n\nparticularly when you begin to get sort\n\nof the stage magicians, the wands become, you know, too big\n\nto carry around and therefore they become much smaller.\n\nOnce you have a smaller wand, the sense of sort\n\nof calling up the magic sort of occurs.\n\nSo you know, you're facing a bubbling cauldron\n\nand you bring out whatever it is in the cauldron\n\nthat you want to bring out.\n\nYou're facing an enemy\n\nand you kind of zap them with the wand,\n\nand that's kind of carried back over into contemporary\n\nfantasy, which often involves fairies with small wands\n\nor children again, who would look a bit silly\n\nwith these great big things.\n\nThe next question, tap_tap26.\n\nAre memes technically internet folklore?\n\nThat's exactly what they are.\n\nThey're something that really has been\n\ncreated by the internet.\n\nSo rather than going from person to person,\n\nthey will go from website to website,\n\nand that basically is how internet folklore works.\n\nThe next question comes from the zombywolf.\n\nSeriously though, did any one\n\nof you ever find razorblades in your Halloween candy?\n\nWell, I never have.\n\nThis is part of the sort of folklore\n\nthat surrounds Halloween,\n\nand it's also part of the stranger danger\n\nthat surrounds Halloween.\n\nThe idea that here are all these sort of innocent sort\n\nof neighborhood children going from house to house,\n\nand you get one person who hates Halloween or hates children\n\nand therefore tries to kill them.\n\nUndoubtedly, children may very well get sick on some\n\nof the things they eat at Halloween, but that's probably not\n\nbecause anyone's deliberately poisoning them.\n\nWhat it does reflect is this interaction\n\nof social situations.\n\nSo the Halloween candy,\n\nthe poisoned Halloween candy is a kind of not\n\nso much a bogeyman for children.\n\nI think it's more a bogeyman for adults, quite frankly,\n\nthe fear that something is going to happen\n\nto their children when they're off doing something innocent.\n\nStarrydoyo, are mermaids and sirens different\n\nor am I stupid?\n\nWell, you're not stupid.\n\nSirens initially were voiced\n\nand they were seen as birds, vulturous birds\n\nwith women's heads,\n\nand what they would do is they would stand on a cliff\n\nand sing and lure the sailors into the water\n\nand to their death.\n\nThey represent the threats and the dangers of travel\n\nand the sea.\n\nNow, Ulysses had himself tied to the mast\n\nand stopped his men's ears with wax,\n\nand because of this, the sirens were so frustrated\n\nthat they drowned themselves into the sea,\n\nwhere they acquired fish tails and become mermaids.\n\nMermaids also stick their heads above the waves\n\nand sing, trying to lure the sailors\n\nto their death, basically.\n\nBut in the Middle Ages,\n\nmermaids were also very often associated with sinfulness,\n\nparticularly the sinfulness associated with women,\n\nthe way they're sort of tempted men\n\nto do things they shouldn't.\n\nBut then again, by the time you get to the 19th century,\n\nyou have really wonderfully good mermaids,\n\nand by the time you get to Disney, you have a mermaid\n\nwho is, you know, a feisty adolescent\n\nand very, very different from anything\n\nthat either the Greeks or the medieval world thought of.\n\nThis question is from Veer03255.\n\nWhy are vampire stories always tied with werewolves?\n\nBoth vampires and werewolves are sort of\n\nwhat anthropologists call liminal beings.\n\nIn other words, they exist between life\n\nand death, human beings who don't quite make it past death.\n\nSo the idea that sort of a thing would come out\n\nof the grave, which looked, you know, vaguely human,\n\nyou find particularly in Slavic countries.\n\nNow with werewolves, wolves have always been\n\noutsiders in society.\n\nThey're dangerous, they're the sort of dangerous dog.\n\nSo they're also another set of folklore which goes\n\nwith them in that sometimes they are cursed\n\nbecause of something that has done not necessarily\n\nby the werewolf of himself or herself,\n\nbut by the family.\n\nThey kind of can't die.\n\nThey get sort of stuck in the middle.\n\nNeither vampire nor werewolf really actively becomes a\n\nvampire or a werewolf.\n\nSo you get this notion of those things which are\n\nbeyond human control,\n\nand it's certainly something which I think it's safe to say\n\nall cultures fear.\n\nWe're afraid of the dark, we're afraid\n\nof the nightmare world,\n\nand these two characters represent it.\n\nThe next question is from Alina_Rayne.\n\nWhat is the real story behind the Mothman legend?\n\nAnyone here familiar with its origin?\n\nThe Mothman was a humanoid creature with wings and red eyes\n\nthat was seen in a small West Virginia town in the 1960's.\n\nBasically, you had two couples driving along\n\nand they were passing a disused,\n\nwell derelict World War II munitions plant,\n\nand they saw this tall, thin creature\n\nwith these great big wings\n\nand these fiery eyes, immediately turned the car around\n\nto leave and they said it followed them.\n\nIt got picked up by the national paper.\n\nSome few years later,\n\ntwo paranormal specialists came to the town,\n\nwrote up the story, called it Mothman,\n\nand started connecting it with sort of events.\n\nNot long after the people had seen this,\n\na local bridge collapsed with the loss of life,\n\nand it was put forward that the Mothman appeared\n\nto warn people about what would happen.\n\nAnd when the film was made, it really pushed this idea\n\nof the Mothman as important, so very unusually,\n\na character which was supposedly scared people,\n\nwhich professional paranormal writers turned into a\n\nmonstrous presence has become a real local celebrity.\n\nThis question comes from TerminalReddit.\n\nWhat were the Conttingley fairies photographs\n\nand what was so mysterious about them?\n\nThe Conttingley fairies photographs\n\nwere a series of photographs\n\nthat appeared at the beginning of the 20th century.\n\nThey were taken by two girls in Yorkshire\n\nwho claimed they took pictures of fairies\n\nand they were taken up by Arthur Conan Doyle,\n\nwho believed in fairies.\n\nEventually, they were proved to be fakes,\n\nand the girls, once they were grown up,\n\nactually admitted to this.\n\nIf you look at them now, it's kind of difficult\n\nto believe that anybody thought there were anything else.\n\nWhat the girls did is they cut out pictures out\n\nof a picture book, stuck pins in them\n\nand stuck them in the ground.\n\nOne of the girls is standing behind them\n\nand the fairies are in front,\n\nand it was pointed out that you know their fairies,\n\nbut why have they got 1920's hairstyles and various things?\n\nBut so strong was the authority of Arthur Conan Doyle\n\nhad people just kept saying, no, they must be real.\n\nThey must be real. They must be real.\n\nThe next question is from gienthusiast who asks,\n\nwhat the [bleep] is a wendigo?\n\nIt's a very, very nasty monster.\n\nIt comes from First Nations, it's cannibalistic.\n\nIt haunts the edges and kind of invades places.\n\nIt was first sort of identified\n\nand talked about in the 19th century when various people\n\nbecame interested in the stories\n\nof the First Nations in America.\n\nIt's now escaped.\n\nIt now belongs to the sort of general horror fantasy.\n\nBut originally it was a much more specific thing,\n\na representative of the fears of not being able\n\nto survive the winter, fear of what might happen if you kind\n\nof starved to death and didn't have a right burial\n\nand didn't have the right rituals\n\nto get you into the afterlife.\n\nHurtstopurr asked, is Dracula really inspired\n\nby Vlad the Impaler?\n\nThe novel Dracula is quite a complex novel.\n\nIt isn't based on Vlad the Impaler so much.\n\nVlad the Impaler was never thought to be a vampire.\n\nIn fact, he's a national hero in Romania\n\nbecause he repulsed the Turks.\n\nHe just seemed a kind of good backstory to this character.\n\nSo Dracula doesn't come out of nowhere.\n\nHe becomes a creature\n\nwho has a a more complex Romanian heritage.\n\nBram Stoker's story appeared just at the end\n\nof the 19th century.\n\nThere had already been several vampire stories.\n\nMost of those vampire stories initially were based\n\non Lord Byron, which is why you get the glamorous vampire\n\nand the dark clothes\n\nand all the women fall over in love with him.\n\nStoker decided he wanted to change this a little bit,\n\nso he puts his character in a much more exotic area,\n\nwhich is then he reworked into what has got\n\nto be the seminal vampire novel ever written.\n\nThe next question from smythe70,\n\nRed Rover, Red Rover, anyone?\n\nWell, I think this depends on whether anybody has\n\nplayed Red Rover.\n\nA game that I played when I was at school\n\nand basically you had two opposing groups\n\nand you called someone over, they had to run across\n\nand crash through the group.\n\nI don't quite understand why it's now become unpopular,\n\npossibly because it's regarded as aggressive or dangerous.\n\nBut I have to say it was actually quite a lot of fun to play\n\nbecause you sort of, when you were called, you kind\n\nof looked down the line\n\nand either found the person you liked least\n\nor thought was the weakest\n\nand charged for them,\n\nwhich may be revealing something about my background in my\n\nchildhood that people might not want to know.\n\nThis question is from Quora.\n\nCan you explain the differences between a Sasquatch,\n\nBigfoot, Yeti and Abominable Snowman.\n\nYeti and the abominable snowman come from snowy regions.\n\nThey're associated with Tibet, so they're white.\n\nSasquatch and Bigfoot come mostly from North America.\n\nThey're hairy and dark because they live in the forest.\n\nAll four of them are actually quite similar in\n\nthat they represent creatures who live in the margins.\n\nWhat was interesting about them when they were first\n\ndiscovered or first identified is that they were often seen\n\nas the missing link.\n\nThis was a time when it was thought\n\nthat homo sapiens descended from the apes\n\nand somewhere there was a missing link and this was it.\n\nWe completely changed our attitude\n\nand they've become sort of independent monsters.\n\nPeople go hunting for these things and they find footprints\n\nand they find all sorts of things,\n\nnone of which really ever is proved to exist,\n\nwhich is very nice 'cause it means they\n\ncan still go hunting them.\n\nCarfarelli asks, when and how did fairies shrink?\n\nVictorians shrunk the fairies.\n\nFairies initially were as large as human beings.\n\nSometimes they were larger,\n\nthey were more beautiful than human beings as well.\n\nBut during the Victorian periods,\n\ninteresting things happened to fairies.\n\nVictorians were very interested in the natural world.\n\nThey were very interested in insects\n\nand there's something about the insect,\n\nthe firefly and the dragonfly.\n\nThey were also interested in sort\n\nof pretty fantasy ballet, for example.\n\nSo the fairies suddenly acquired ballet skirts.\n\nSo you get this kind of diminution\n\nof these fairies simply\n\nbecause the Victorians are sort of interested in them.\n\nAnd you also get what could only be described\n\nas an explosion of fairy art.\n\nThere are a number of artists\n\nwho really specialized in this,\n\nand there are anything from the sort\n\nof pretty fairies in Victorian fairy books\n\nto one particular artist\n\nwhere the fairies look really like something out\n\nof a fever dream.\n\nBut, as far as Scots\n\nand the Irish are concerned, fairies are still large.\n\nThe next question comes from pinche_Isaac,\n\nwho the [bleep] invented zombies man?\n\nThe zombie comes out of a Caribbean culture, which sort\n\nof synthesized stories\n\nand traditions from from West Africa, which is where most\n\nof the slaves came from.\n\nSo they were a slave tradition in that the zombie was seen\n\nas a corpse who couldn't rest,\n\nor a person who couldn't really die,\n\nwho was enslaved literally by a Bokor\n\nwho is a black magician associated with voodoo.\n\nSo there's a lot of colonialism here\n\nand a lot of very negative attitude towards beliefs which\n\nwere being synchronized\n\nand reworked in the impossible situation of slavery.\n\nBut it really kind of comes\n\nto the fore when the United States begins\n\nto interfere in Haiti\n\nand there's a book written the Magic Island,\n\nwhich is very negative in its view, and it sees the Haitians\n\nand it extends it to other Caribbean peoples\n\nas basically very backwards.\n\nEx-slaves, descendant from these\n\nWest African cultures and really in need of civilizing.\n\nThe idea of these sort of voodoo cultures is\n\nthat you are possessed in a positive way by these sort\n\nof ancestral beings,\n\nand the zombie is is kind of twisting by these sort\n\nof evil priests, these Bokors\n\nwho enslave, literally enslave these characters,\n\nvery negative stereotype of the culture,\n\nwhich is just coming outta slavery on these islands.\n\nSo you kind of get this going from a racist stereotype\n\nto an understanding of these cultures\n\nand how they function to this notion of, well,\n\nmaybe we can explain it scientifically.\n\nThis question is from Quora.\n\nHow has the legend of a Loch Ness monster evolved over time?\n\nThe Loch Ness monster\n\nor Nessie as he is affectionately called, is supposed\n\nto live in Loch Ness.\n\nHe was first observed in the medieval period by one\n\nof the most famous of the Scottish Saints.\n\nIt's included in his biography, a biography written\n\nby a fellow monk who wrote this up very seriously.\n\nThe saint had forgotten his book on one side of the loch\n\nand he asked one of his young acolytes\n\nto swim across the loch and get it.\n\nHe got it and was swimming back halfway\n\nthrough the loch up comes the monster\n\nand basically the saint says, don't dare touch him.\n\nAnd the monster of course listens\n\nto the saint and disappears.\n\nYou don't hear much about him for a while.\n\nAnd then again in the 1930's the Loch Ness monster kind\n\nof comes onto the scene and has never left\n\nand people kind of look back to this\n\nand say, oh, well there's always been a\n\nmonster in Loch ness.\n\nPeople have seen the monster swimming.\n\nIt's been said to be seals, logs, strange waves,\n\nall sorts of excuses.\n\nPeople have faked the monster.\n\nThere's a small monster and you can tell it's a fake\n\nbecause the waves aren't right\n\nand as biologists have said, well,\n\nthe problem is there probably\n\naren't enough fish in Loch Ness\n\nto keep a large creature alive.\n\nHowever, it's also one\n\nof these monsters which local people have\n\ntaken to their heart.\n\nHe's a big or she or it,\n\nhowever you wanna call it, is a big tourist draw.\n\nAnd while the the locals sort of say, no,\n\nwe don't believe in them, we are quite happy for tourists\n\nto come and visit us.\n\nAskEurope subreddit.\n\nWhat's your country's version of the tooth fairy?\n\nWell, as an American, my version\n\nof the tooth fairy is the tooth fairy,\n\nbut it's a fairly modern reworking of a character\n\nwho more often is a mouse.\n\nI'm not sure whether there's a specific folkloric reason\n\nfor the mouse, but a creature\n\nthat was often found in the older houses\n\nand often had little burrows somewhere\n\nand often collected bits and pieces.\n\nObviously it's going to collect the children's teeth\n\nas well, but so often these things are not\n\nso much this happens and this happens\n\nand this happens as you look back and think, oh well this\n\nand this and this is in the environment\n\nand I can put it together in a certain kind of way\n\nand have a folk story.\n\nThe next question is from Daisy Jane.\n\nOne, did you all have a rabbit's foot for good luck,\n\nusually are on a key chain?\n\nRabbit's feet kind of go back quite a long way.\n\nRabbits, because they were prolific,\n\nwere thought of as very lucky.\n\nNowadays I think we would sort of sympathize with the bunny\n\nand not want a rabbit's foot.\n\nSo we've substituted it with all kinds of good luck symbols\n\nand sort of key chains with something on it,\n\n'cause they allow you to find the keys.\n\nBut I think the practical has sort of been overtaken\n\nby the fact that what people put on their key chains are\n\noften very important to them personally.\n\nSo you're beginning to get not just a good luck charm,\n\nbut a kind of how I want to project myself to the world.\n\nIt's interesting, very interesting\n\nwhat you get on key chains currently, it's the Labubu dolls,\n\nwhich are sort of scary versions of the trolls.\n\nSome people are saying they're actually demonic creatures,\n\nbut people like them, they buy them in boxes\n\nwhere they don't see what they're going to get\n\nand they reveal something particular.\n\nSo it's something very personal.\n\nSomething almost has come out of a grab bag that is mine\n\nand no one else's.\n\nImpressionCool5341 is asking, what is Slender Man's origin?\n\nSlenderman originated on the internet as an internet meme,\n\nas a kind of mysterious bogey man who goes\n\nafter mostly young children.\n\nHe's tall, thin, dark, no face.\n\nHe's completely covered in sort of almost like a shroud,\n\na tight fitting shroud.\n\nHe belongs in a whole class of either faceless\n\nor masked nightmare characters.\n\nThink of Freddy, think of Jason, think of V for Vendetta.\n\nEven Pennywise, these characters who don't look human\n\nand who aren't human and mostly will attack young people.\n\nThere was a very tragic situation of two girls\n\nwho killed someone thinking\n\nthat Slender Man ordered them to do it.\n\nVery disturbed girls, very unusual that this sort\n\nof thing happens, but of course it becomes a cause celeb\n\nand a wake up cry\n\nthat you know what's happening on the internet\n\nthat our children are beginning to beginning to see.\n\nIt's kind of downplayed now.\n\nHe's become a character which you kind\n\nof find in horror films.\n\nIt's a character who is much talked about and much less\n\nbecause he's not so new kind of much less, less frightening.\n\nBrenteaaa, I'm not even gonna try to pronounce that.\n\nSaw there's a full moon out tonight,\n\nand I had a thought, why do werewolves only change on the\n\nfull moon and why have I never thought about this before?\n\nThe Full Moon in werewolf folklore again is a\n\nfairly modern one.\n\nThe full moon was always associated with strange happenings.\n\nMad men were thought to become more mad at the full moon.\n\nPeople were thought that they shouldn't look at the full\n\nmoon, particularly if you were looking through glass,\n\nyou ought to curtsy to the full moon and acknowledge it.\n\nSo the full moon has this uncanny nature,\n\nbut once werewolves became part of horror literature,\n\nit begins to accrue these other kind of superstitions.\n\nTurning into a werewolf in the full moon is one\n\nof those sort of accretions.\n\nTenaciousdeev asks, everyone knows about vampires\n\nand werewolves, but are some lesser known creatures?\n\nOne of my favorite characters are griffins, the sort\n\nof lion, eagle ones, which you see a lot in architecture,\n\nbut also which have this wonderful story as associated\n\nwith them about how they guard gold.\n\nThe other character who I think is fascinating\n\nis the Hippogriff.\n\nRowling did not invent the Hippogriff.\n\nIt actually comes from a medieval poem.\n\nI think what I like about Griffins\n\nand Hippogriffs is that they're hybrid characters\n\nand they're a mixture of two very important beasts.\n\nThe lion, the king of the beast, the sort of eagle.\n\nAgain, these sort of powerful creatures,\n\nbut when they get hybridized,\n\nthey become much more domesticated\n\nand much more user friendly.\n\nAnd I think it's quite interesting to see the arc\n\nthat these characters take as they move from,\n\nlet's call it elite culture, into sort of architecture\n\nand pictures and art,\n\nand then finally into modern popular culture, which is so,\n\nso enamored of fantasy.\n\nThis one is from the AskHistorians subreddit,\n\nwhy did women become associated with witchcraft and magic?\n\nYou have both men and women who were prosecuted as witches.\n\nNumbers are difficult to establish,\n\nbut certainly no matter how you, how you cut it,\n\nmore women were were killed as witches than men.\n\nIt's a misogynistic thing.\n\nIt's assumed that basically women are more devious than men.\n\nBut there was also this notion\n\nthat women were more powerful than men.\n\nAnd women's power was not so much the fighting power,\n\nthe power of strength,\n\nbut the power of something internal to them.\n\nThe obvious thing is they produced the children,\n\nbut it's also seemed that they had a kind of mystical power\n\nas well because of this,\n\nand so there's this notion that they're sort\n\nof more in touch with things that are intangible.\n\nThe next question is from the Twilight subreddit.\n\nWhat makes Twilight vampires unique\n\namong all the different types of vampires in vampire lore?\n\nWell, Twilight represents a new strain in vampire lore,\n\nwhich is not traditional.\n\nIt's very much part of modern sort of fantasy writing,\n\nand it's often called the horror romance,\n\nwhere the young boyfriend is a vampire.\n\nWell, basically if you're gonna make him into a boyfriend,\n\nyou can't have him sleeping in a coffin all day.\n\nYou can't have him disappear in a puff\n\nof smoke when the sun shines.\n\nSo you're gonna have to invent a new kind of lore.\n\nThat said, sleeping in coffins all day\n\nand disappearing in a puff of smoke is actually part\n\nof the sort of literary vampire lore\n\nthat was created in the 19th century.\n\nSo all you're really doing here is not\n\nso much changing the folklore that was associated\n\nwith folk vampire figures,\n\nbut the kind of literary folklore associated\n\nwith the literary vampire.\n\nThe next question is from final hour, how did the concept\n\nof the Grim Reaper come into existence\n\nand why is he portrayed as he is?\n\nThe grim reaper is simply the figure of death.\n\nHe reaps the souls, hence the scythe,\n\nand he's clothed in black as if he shrouded.\n\n'Cause for many, many centuries,\n\nthe dead were simply shrouded.\n\nThey weren't buried in coffins\n\nand it wasn't really any idea of\n\nwhat a decayed body looked like.\n\nSo you get this idea of the figure of death being a reaper.\n\nThe next question comes from wastevens.\n\nDid the Brothers Grimm make the children's stories\n\nthey collected darker\n\nand more violent than the original, oral traditions?\n\nThe Brothers Grimms actually collected stories surprisingly\n\nfrom women's storytellers for the most part.\n\nThe Grimm's fairytales were published five\n\nor six times during the Brother's lifetime,\n\nand they changed the stories as they went along, not\n\nso much making them darker as making them more bourgeois\n\nbecause they were being addressed to a middle class,\n\nso they were beginning to express the values of\n\nthat middle class.\n\nThey were quite dark to start with.\n\nFairytales can be very dark.\n\nThey're sort of dealing with sort of structures in society,\n\nand so you get unpleasant things like deaths, cannibalism,\n\ntransformations, witchcraft, magic,\n\nand the Grimms used this,\n\nbut I think if anything, they could be accused of kind\n\nof taming it a bit.\n\nSome people sort of say you shouldn't scare kids,\n\nso you shouldn't tell them these stories.\n\nBut the positive thing is that these are stories.\n\nChildren know that the narrator is gonna stop\n\nand the book is going to be closed.\n\nSo it's a scare within a safe space,\n\nand it's a way of allowing children to deal with the fact\n\nthat life is not always going to be wonderful\n\nand yet not actually be frightened or threatened.\n\nThis question is from SammyJamez.\n\nA lot of Disney's versions\n\nof popular fairytales have more optimistic portrayals\n\nand endings, but the original versions are often\n\nbleak and depressing.\n\nHow come many of these famous fairytales are very bleak even\n\nthough they were made for children?\n\nI think one has to sort of point out\n\nthat fairytales were not made for children.\n\nIt's the Victorians who decided\n\nthat fairytales are a children's genre.\n\nFairytales were told by adults to adults often\n\nafter the harvest.\n\nThey were told in work situations, they were told\n\nby professional narrators who traveled around.\n\nThe Victorians decided, no, no, no,\n\nthese are suitable tales for children.\n\nSo I think Disney isn't sort\n\nof taking them into being more optimistic.\n\nHe is certainly addressing an audience where he wants a kind\n\nof feel good factor.\n\nAlthough any Disney fairytale,\n\nalthough it ends happily,\n\nwill invariably have a scary monster.\n\nThe witch is really scary.\n\nIn Snow White,\n\nthe queen in Sleeping Beauty turns into a horrible dragon.\n\nDisney always liked to scare before he lets you be happy\n\nand sort of go off into the sunset.\n\nThe next question is HerpaDerpaDumDum.\n\nWhy are the depictions of banshees\n\nin modern media completely different to the depictions\n\nof banshees in traditional Irish folklore?\n\nIn Irish folklore, the Banshee is the banshee,\n\nthe fairy woman,\n\nand she's a sort of supernatural figure that appears\n\nbefore a death and cries\n\nand wails sort of indicating that a death may be coming.\n\nShe has nothing to do with the death itself.\n\nAnd it comes from something which you get in Irish folklore,\n\nthe keening women\n\nand at funerals, women were hired to mourn the dead\n\nwith these loud cries, with these sort of desperate cries,\n\nbut the dead person was dead.\n\nNow again, what happens when the banshee has taken\n\nover into horror literature,\n\nshe's made much more of an individual and personal thing\n\nand she becomes this kind of monstrous creature.\n\nAgain, horror fantasy writers have a lot more flexibility\n\nthan the traditional sort of purveyors of folklore.\n\nThis is from the Ask Scientific subreddit.\n\nWhy do gremlins always take stuff apart on planes?\n\nGremlins were invented by the pilots of World War II.\n\nThey blamed anything that went wrong on, oh,\n\nthe gremlins must have done it,\n\nbut the gremlins kind of didn't have any shape.\n\nIt was only subsequently that they were drawn as these sort\n\nof strange little sort of mischievous beings.\n\nAnd it was really only with the Gremlin films\n\nthat you get these kind of vicious little monsters.\n\nThis next questions from comes from GimmesomeLoki.\n\nWhy is the Christian devil depicted with a pitchfork?\n\nWell, the idea of the pitchfork is something which is used\n\nto kind of move useless things around, hay\n\nor manure or whatever.\n\nAnd so the Christian devils\n\nwho are simply tormenting the souls of the damned,\n\nthey're tormenting souls who have completely lost the right\n\nto be considered individuals.\n\nSo it's almost a further dehumanization of these souls.\n\nNext question is from cinnamonremote.\n\nMy Google skills are failing me.\n\nEldest child wants to know what tree you need\n\nto be buried under to prevent the faes snatching your body.\n\nWell, I can tell you\n\nwhat trees you shouldn't be buried under,\n\nand for the most part, they're apple trees.\n\nIf you even sleep under an apple tree,\n\nthe fairies are likely to snatch you.\n\nThe definition of a fairy tree.\n\nYou will find often, particularly in Ireland\n\nand in Scotland as well, a bit in the center of a field,\n\nwhich is a tree surrounded by a little fence.\n\nAnd the idea is that this is the fairies come to\n\nor it's the entrance to fairy land\n\nand they have to be protected to some way.\n\nThis question is from Quora.\n\nIn Hans Christian Anderson's Little Mermaid,\n\nthe mermaid's penalty\n\nfor having legs was feeling like she was walking on thorns.\n\nWhy did she get a penalty if she didn't do anything bad?\n\nHans Christian Anderson is writing in the 19th century,\n\nand he was very interested in notions\n\nof Christianity and behavior.\n\nBehind this is a very common folklore trope\n\nof a supernatural being who wants to acquire a soul\n\nand therefore has to go through a number of trials.\n\nIn the story, the little mermaid is told that she can dance.\n\nObviously the legs are painful.\n\nIt's as if she's walking on knives and thorns.\n\nIt's part of the test. How badly do you want a soul?\n\nAnd what happens at the end is she actually told you can\n\nhave your soul if you kill the prince.\n\nAnd she refuses to do this, proving herself\n\nto be a really worthwhile creature.\n\nSo it's actually a positive story about the little mermaid\n\nrather than a negative story about how she loses a prince.\n\nClearcutPunk is asking what superstitions,\n\ncryptid, folklore do you not really believe in,\n\nbut avoid and or abide by just in case?\n\nNone.\n\nAs a folklorist, I'm much more interested in the phenomena\n\nthan I am and whether they're real or not.\n\nHowever, as a person coming from an Italian background,\n\nI had a grandmother who when she discovered she had sort\n\nof red haired grandchildren, made sure that we wore coral\n\nbecause it protected us from the evil eye.\n\nWhether it actually protected us, I don't know,\n\nbut I still have the coral charm,\n\nwhich she gave me when I was a child.\n\nI no longer wear it.\n\nI'm not sure I believe in it, but I wouldn't give it up.\n\nI hope you enjoyed this as much as I did.\n\nThis is folklore support and I hope to see you next time.\n\n[upbeat music]",
  "authors": [
    "Condé Nast"
  ],
  "url": "https://www.wired.com/video/watch/tech-support-historian-answers-folklore-questions"
}