{
  "title": "Cepa de virus de gripe aviar nunca antes reportada en personas está detrás del primer caso humano en EE.UU. en nueve meses",
  "text": "CNN —\n\nUn residente de Washington fue hospitalizado con gripe aviar, según el Departamento de Salud del Estado de Washington, y está infectado con una cepa del virus que no se había detectado en personas antes.\n\nEs el primer caso reportado de gripe aviar en una persona en EE.UU. en nueve meses, pero los Centros para el Control y la Prevención de Enfermedades (CDC) afirman que el riesgo para el público en general sigue siendo bajo.\n\nEl paciente, hospitalizado con influenza aviar H5N5 desde principios de este mes, es una persona mayor del condado de Grays Harbor con enfermedades preexistentes. No está claro cómo contrajo el virus; las autoridades estatales y locales de salud pública y agricultura investigan, pero sospechan que pudo haber estado expuesto a aves de corral en el patio trasero.\n\nEl virus se transmite a través de la saliva, el moco y las heces de los animales, o por la leche de ganado lechero. El riesgo general de gripe aviar aumenta a finales de otoño e invierno, cuando las aves migran y entran en contacto con otros animales, como parvadas domésticas.\n\nLa gripe aviar ha infectado aves silvestres en todo el mundo durante décadas, pero el brote más reciente en EE.UU. comenzó en enero de 2022 y ha mostrado mayor propagación entre mamíferos que en años anteriores.\n\nNo se ha registrado transmisión de persona a persona del virus en EE.UU., pero las autoridades de salud pública en Washington están contactando a quienes pudieron haber estado en contacto cercano con el paciente de Grays Harbor para monitorear síntomas y ofrecer pruebas y tratamiento.\n\nAunque el riesgo general para el público es bajo, el doctor Richard Webby advierte que el virus aún tiene “potencial pandémico”.\n\n“Creo que está claro que no es fácil para este virus pasar de ser un virus de patos a uno humano. Eso está bastante claro, pero no apostaría a que no pueda dar ese salto”, dijo Webby, director del Centro Colaborador de la Organización Mundial de la Salud para Estudios sobre la Ecología de la Influenza en Animales y Aves. “Se tienen que alinear varios factores biológicos para que eso ocurra. Podemos debatir cuán probable es, pero nadie lo sabe. Solo el tiempo lo dirá”.\n\nDe acuerdo con los CDC, se han reportado otros 70 casos humanos de gripe aviar en EE.UU. durante el brote actual. Una persona falleció en enero; también era mayor y tenía enfermedades preexistentes.\n\nAunque algunos casos han sido graves, la mayoría de las personas infectadas han presentado síntomas leves, como enrojecimiento ocular y fiebre.\n\nLa mayoría de quienes han contraído gripe aviar trabajan en contacto directo con animales. Ha habido 41 casos en personas que trabajan con ganado y 24 entre trabajadores avícolas. Otros dos casos tuvieron exposición a otros animales no especificados por los CDC, y en tres casos se desconoce la fuente de exposición.\n\nLos CDC recomiendan que quienes trabajen con animales utilicen equipo de protección adecuado y tengan precaución al manipular heces animales.\n\nEl Departamento de Salud del Estado de Washington recomienda que quienes limpien comederos de aves y otras áreas expuestas a excremento de aves usen guantes y desinfecten el área con una mezcla de una parte de cloro por diez de agua, o con un desinfectante comercial como Lysol.\n\nEvita el contacto con animales silvestres enfermos o muertos. Si debes desechar un ave muerta, usa mascarilla bien ajustada y guantes desechables, y recoge el cadáver con una bolsa plástica volteada. Se recomienda embolsar el ave dos veces y desecharla en un contenedor de basura sellado para evitar que otros animales la consuman. Después, lávate bien las manos.\n\nEvita consumir alimentos crudos, poco cocidos o no pasteurizados, como queso o leche cruda.\n\nEl Departamento de Salud también recomienda vacunarse contra la gripe. Aunque la vacuna regular contra la influenza no protege contra la gripe aviar, reduce la pequeña posibilidad de que alguien se infecte con ambos virus al mismo tiempo y que el virus de la gripe aviar mute y se propague fácilmente entre personas.",
  "authors": [
    "Jen Christensen"
  ],
  "url": "https://cnnespanol.cnn.com/2025/11/15/salud/cepa-gripe-aviar-primer-caso-humano-eeuu-trax"
}