{
  "title": "Nuclear Historian Answers Nuclear War Questions",
  "text": "Transcript\n\nI'm Alex Wellerstein.\n\nI'm a nuclear historian.\n\nI'm here today to answer your questions from the internet.\n\nThis is Nuclear History Support.\n\n[upbeat music]\n\nAll right, first up, we have one from @AmericanVsGov.\n\nWhat countries have nukes?\n\nThere are nine countries today in the world\n\nwith nuclear weapons that we know about.\n\nThe United States, first country that got them.\n\nThe Soviet Union got them in 1949.\n\nToday, those nuclear weapons are in the hands\n\nof the Russian Federation.\n\nThe United Kingdom, People's Republic of China, France.\n\nThese are the five officially allowed countries\n\nunder the nuclear non-proliferation treaty\n\nto have nuclear weapons.\n\nThere is also Israel, India, Pakistan, and North Korea,\n\nso nine countries total.\n\nThere were a few countries that inherited nuclear weapons\n\nafter the fall of the Soviet Union,\n\nUkraine, Belarus, and Kazakhstan,\n\nbut they returned all of those weapons\n\nto Russia in an agreement.\n\nLJWhitman1, asks, Who decides which countries\n\ncan have nukes and which countries can't?\n\nWhat are their criteria?\n\nThe decision about who can quote, unquote, have nukes\n\nand who quote, unquote, can't,\n\nthis is the result of a treaty,\n\nthe Nuclear Non-Proliferation Treaty,\n\nwhich was created in 1968\n\nto try and slow the spread of nuclear weapons.\n\nIf you sign the treaty, you agree that only five countries,\n\nthe countries that had tested nuclear weapons by 1967,\n\nare allowed to have nuclear weapons.\n\nAnybody else is not allowed under that treaty.\n\nSo if you sign that treaty,\n\nyou agree those are the only five that have nuclear weapons\n\nand nobody else should have.\n\nPakistan, India, and Israel never signed the treaty,\n\nhave developed their own nuclear weapons.\n\nThere's also North Korea, which was a member of the treaty,\n\nbut then left the treaty and made nuclear weapons.\n\nIs it illegal for them to have nuclear weapons?\n\nOnly in the sense that they're not members of the treaty.\n\nWhat the nuclear Non-Proliferation Treaty does\n\nis it allows any country without nuclear weapons\n\nto know that anybody else who signed the treaty\n\nis probably not also trying to get nuclear weapons.\n\nSo if you're worried that your rival across the way\n\nmight be getting nukes,\n\nif you and they both signed the treaty,\n\nthen you're not going to have to worry as much\n\nabout them getting the weapons.\n\nIt also gives them access\n\nto peaceful nuclear technology like nuclear reactors.\n\nIt means that they have the right\n\nto work on that kind of stuff\n\nwithout worrying that somebody's gonna try\n\nand, you know, blow up their reactor\n\nout of fear that it's a nuclear bomb.\n\nzipthwung asks, Was Iran building a bomb?\n\nIf so, how close to a bomb was Iran?\n\nHow were the nuclear talks going\n\nbefore Israel preemptively attacked?\n\nGreat question. Was Iran building a nuclear weapon?\n\nNo, I don't think anybody thinks Iran\n\nwas actively building a nuclear weapon.\n\nThe accusation, made particularly by Israel,\n\nis that Iran was setting up the conditions\n\nunder which it could build a nuclear weapon\n\nvery quickly if it wanted to.\n\nIran did have a nuclear weapons program before 2003,\n\nand the Iran deal was them essentially saying,\n\nWe're gonna close down\n\nand disable all the little things we were doing\n\nthat were bad and we won't do them anymore.\n\nOnce the United States left the Iran deal,\n\nIran has been creeping up beyond the limits of the deal.\n\nYou know, depending on what your stance is,\n\nyou either think that's because\n\nthey are trying to get ready to make a bomb,\n\nor because they're trying to compel the United States\n\nto come back to the negotiation table as a way of saying,\n\nLook, if you leave this deal, which we did,\n\nwe can do this now,\n\nand if you want us to stop, come back to the deal.\n\nNow, how are the nuclear talks going?\n\nI don't think that great.\n\nI don't think it's clear exactly what Iran wants, per se.\n\nThey're sort of leaving the door open for different options,\n\nwhich would make a lot of sense\n\ngiven the recent history that they've had\n\nwith the United States and with Israel,\n\nbut they were not, you know, racing to make a bomb.\n\nhellherekitten asks, WTF is a nuclear football?\n\nIt's basically a suitcase.\n\nWhat the nuclear football is meant to do\n\nis allow the president of the United States\n\nto order a nuclear strike\n\neven if they are not in the White House or the Pentagon.\n\nIf the president is visiting some other country\n\nor some other city, they have basically\n\na very burly, usually, military person\n\ncarrying a very heavy suitcase around.\n\nAnd in that suitcase,\n\nthere are information about nuclear war plans.\n\nThere are some communication tools probably\n\nto allow the president\n\nto easily link up with top generals and advisors\n\nand whatever is needed\n\nto authenticate the president's nuclear war order\n\nif the president decides to make that.\n\nSophikkelson asks, Once in a while,\n\nI think about how many nukes the US has lost.\n\nHow tf do you lose a nuke?\n\nFind them now.\n\nThere are a number of quote, unquote, lost nuclear weapons,\n\nand what that really means is there is a nuclear weapon\n\nthat was on say, an airplane or a submarine,\n\nand that airplane either crashed or the submarine sunk,\n\nand the weapon is now in the environment, in the world.\n\nThese kinds of accidents\n\nwere not super uncommon during the Cold War.\n\nThe United States had a program in the 1950s and 1960s\n\nto basically have airplanes with nuclear weapons\n\nflying in the air 24 hours a day, seven days a week,\n\nso that if nuclear war started,\n\nthey could have some kind of guarantee\n\nthat they'd have a plane ready to retaliate no matter what.\n\nSame thing with submarines.\n\nThey still go around\n\nwith nuclear weapons on them all the time.\n\nIf you have thousands of airplanes\n\nflying tens of thousands of flight hours,\n\nyou're gonna have an accident every once in a while.\n\nSome of these accidents have resulted\n\nin like the weapon either itself falling out of the plane,\n\nor in the case of a submarine,\n\njust going down to the bottom of the ocean.\n\nAny kind of mishap you can imagine,\n\na lot of them have happened.\n\nIn most cases, of course, the United States\n\nis very interested in recovering those weapons,\n\nboth because it's, you know, not a good look\n\nto have lost nuclear weapons,\n\nbut also they contain the fuel you might need\n\nto make more nuclear weapons\n\nand you don't want that falling in the wrong hands.\n\nAnd so the US always tried to recover these things,\n\nbut sometimes the warhead sunk so deep underground\n\nthat after weeks of trying to dig it out,\n\nthey couldn't get it or it's at the bottom of the ocean\n\nand they couldn't find it.\n\nThey're lost in the sense that the US can't recover them,\n\nnot that they don't know, more or less, where they are,\n\nand they're lost in the sense\n\nthat the US couldn't recover them\n\nand thinks nobody else could either,\n\nand decided to sort of cut their losses\n\nand, you know, maybe they put a monument that says,\n\nDon't dig here.\n\nBut they concluded\n\nthat if the army couldn't dig this thing up,\n\nnobody else could either.\n\nMatilda_Mother_67 asks,\n\nWhy did the United States bomb Hiroshima and Nagasaki\n\ninstead of some military headquarters\n\nor other places where civilians weren't?\n\nThere were a lot of processes and meetings\n\nand decisions made along the way\n\nabout what this bomb was, how it should work,\n\nwhat it would be used against.\n\nAt the beginning of making the bomb, like say 1943,\n\nthe attitude was, We'll probably use this\n\nagainst some sort of military installation.\n\nThe first target they even discussed\n\nwas basically the Japanese equivalent of Pearl Harbor,\n\nit's called Truk.\n\nAnd sure, there would be some civilians there,\n\nbut it's not dropping it in the middle of a city.\n\nBy 1945, 2 years later,\n\none, Truk is not an issue militarily anymore.\n\nThey had cut it off. It was not a target.\n\nAnd two, the United States had gotten in the habit\n\nof targeting cities.\n\nIn the early part of 1945, the United States\n\nbegan firebombing Japanese cities with napalm.\n\nThey burnt Tokyo, they burnt Osaka.\n\nThey ended up burning 67 Japanese cities\n\nby dropping basically flaming gasoline on them.\n\nThe other issue is that the bomb they ended up with\n\nwas one that would work best\n\nif you detonated it pretty high in the air.\n\nIf you detonate it high in the air,\n\nyou spread the blast damage out wider,\n\nbut your blast damage is also less intense.\n\nSo if your target is some built-up bunker,\n\nyou're not gonna destroy it\n\nby blowing up the bomb in the air.\n\nIf your target is a house,\n\nyou don't need as much blast pressure to destroy it.\n\nSo they had a bomb that they ended up with,\n\nthrough technical decisions along the way,\n\nthat would be most impressive if you used it on a city.\n\nAnd they had many discussions about what kind of target,\n\nwhat's the goal of this weapon.\n\nThe goal of the weapon was essentially psychological.\n\nThey wanted to cause the Japanese people\n\nto say, We cannot tolerate this.\n\nWe cannot win. Let's surrender.\n\nOne of the people involved in the discussion\n\nsaid that the goal was to have the Japanese\n\nbasically capitulate to the power of the universe.\n\nOh, you don't wanna surrender to the United States\n\nor the Soviet Union?\n\nWell what if we use the power of the sun to destroy you?\n\nTo me, the really interesting thing is that Hiroshima\n\nwas not their first choice at all for a target.\n\nThe first choice that the military had was Kyoto,\n\nformer capital of Japan.\n\nIt was taken off the list by the Secretary of War,\n\nHenry Stimson, because he thought\n\nthat the city was too civilian in nature,\n\nwas a cultural heritage site.\n\nHiroshima got then bumped up to first place\n\nbecause it had some military bases\n\nand manufacturing in it.\n\nIt had not yet been bombed.\n\nIts geography was such that it was\n\nsort of like a bowl-shaped city surrounded by hills,\n\nand that meant it would kind of intensify\n\nthe effect of the weapon.\n\nSo from the point of view of the United States military\n\nand the scientists who consulted from them,\n\nit was a perfectly good target.\n\nNagasaki was only added to the target list\n\nafter Kyoto was taken off of it\n\nbecause they wanted a backup target.\n\nThe actual target for the second bombing run\n\nwas a different city, Kokura.\n\nKokura had a major arsenal in the center of it\n\nthat produced weapons for the Japanese\n\nand was surrounded by workers' houses.\n\nSo by their criteria, this was a great target.\n\nWhen they got to Kokura though,\n\nthey found that it was covered by smoke or clouds or haze.\n\nIt's not clear exactly what.\n\nBut they could not see it to exactly target the bomb on it.\n\nSo they went to the backup target,\n\nwhich was Nagasaki, which was nearby.\n\nmatthewswaite asks, I can't help\n\nbut think gun control debates\n\nmirror that of nuclear weapons proliferation.\n\nDoes every country having nukes make us all safer?\n\nThis is a classic question.\n\nIs the world safer if there are only\n\na couple countries with nuclear weapons\n\nor would it be safer if all the countries\n\nhad nuclear weapons?\n\nIf there were a lot of countries with nuclear weapons,\n\npresumably they would be very hesitant\n\nto go to war with one another\n\nbecause the consequences would be terrible.\n\nOn the other hand, if you think that the chances\n\nof either accidental nuclear war\n\nor people thinking nuclear war was winnable,\n\nor terrorism, if you think the chances\n\nof those are relatively high,\n\nthen more nuclear weapons in the world\n\nis a much more dangerous world\n\nbecause that's a world in which nuclear war\n\nis more likely to occur.\n\nIt's not clear what the answer is here.\n\nGenerally speaking, I'm more swayed by the arguments\n\nthat is a little bit dangerous\n\nto have lots of countries with nuclear weapons in the world.\n\nI know that's a really hot take,\n\nbut I don't trust the systems\n\nor governments of these countries to be sort of perfect\n\nwith regard to they're not starting a nuclear war.\n\nAnd if you don't think that they're going to be perfect,\n\nthen it becomes very dangerous over time,\n\nthe more people who have nuclear weapons.\n\nHuge_Bag69 asks, Enriched uranium, what is it?\n\nWhat is the process of enriching?\n\nHow dangerous is it on its own?\n\nSo uranium is an element.\n\nYou can mine it out of the ground.\n\nIt's a rock.\n\nYou can even get it out of sea water.\n\nIt's relatively abundant.\n\nBy itself, if we went out and got a rock of uranium,\n\nthe uranium we would find\n\nwould have two types of uranium inside of it.\n\nOne of 'em would be called uranium-238.\n\nThere would be 99% of that\n\nin any uranium we pulled out of the ground.\n\nAnd less than 1% of it,\n\nit's like 0.7% would be uranium-235.\n\nSo these are two of the same element,\n\nbut they differ in that uranium-238 has three more neutrons\n\ninside of it than uranium-235.\n\nSo we call these different isotopes.\n\nUranium-238 will not explode in a bomb.\n\nUranium-235 will.\n\nSo enrichment is when we take this uranium\n\nand pull out the uranium-235,\n\nalmost literally atom by atom.\n\nThis is a very difficult process to do\n\nbecause the difference between these\n\nis only three neutrons, which is not very much.\n\nThey are chemically identical.\n\nSo we have to rely on the fact\n\nthat one's a little bit lighter than the other.\n\nSo uranium enrichment,\n\nthere's different processes for doing it.\n\nAnd the most famous right now is the centrifuge\n\nwhere we basically are spinning\n\naround uranium in a gaseous form,\n\nand as we spin it,\n\nthe centrifugal forces will cause the lighter uranium\n\nto move slightly and more one direction\n\nand the heavier slightly another,\n\nand we skim off the part that would have the lighter.\n\nAnd we have to run it through another centrifuge\n\nto skim off a little more\n\nand then another to skim off a little more.\n\nAnd so we're taking advantage\n\nof little tiny statistical differences\n\nin how heavy they are.\n\nAnd we do this for thousands of centrifuges\n\nand you will eventually end up\n\nwith more and more uranium-235.\n\nWhen we want uranium for fuel in a nuclear power plant,\n\nwe tend to enrich it up to about 3% uranium-235.\n\nWhen we want it for a bomb,\n\nwe want it to be much higher than that.\n\nThe bomb dropped on Hiroshima\n\nwas about 80% uranium-235.\n\nIn the United States now, the standard amount in a weapon,\n\nif we use enriched uranium, is around 93% enriched uranium.\n\nThe4thResident asks, Wait, but Einstein\n\nwas not a part of the Manhattan Project,\n\nso how or why did they get his help during it?\n\nEinstein's role in the atomic bomb\n\nwas at the very beginning.\n\nHe wrote a letter to President Roosevelt saying,\n\nHey, we have learned how to split atoms.\n\nGermany might be working on this.\n\nMaybe somebody in the United States government\n\nshould be looking at this.\n\nAnd that's more or less\n\nhis role in the whole Manhattan Project.\n\nWhy didn't they use him?\n\nThey actually did consider using him\n\nand they concluded two things.\n\nOne, Einstein at this point is pretty old.\n\nHe's not your cutting-edge scientist.\n\nThe kind of science he does\n\nis not actually that useful for making an atomic bomb.\n\nYes, yes, =mc2 sort of explains, in a way,\n\nwhere the energy comes from an atomic bomb.\n\nIt does not tell you how to make one.\n\nIt doesn't tell you how to make a factory\n\nand design the things and the parts.\n\nYou don't need somebody like Einstein to do that.\n\nThe other thing is that Einstein\n\nwas considered politically radical.\n\nHe supported really out-there ideas like civil rights.\n\nAnd that, at that time, meant that he was considered\n\nto be politically questionable\n\nby some people in the US government.\n\nAnd so if he is the kind of person who,\n\nto be fair, might have strong ideas\n\nabout how atomic bombs ought to be used\n\nand has a lot of fame\n\nand is the kind of person that presidents would listen to,\n\nmaybe you don't want him to be in the project\n\nif your goal is to just sort of get the thing done.\n\nCoastalBuckeye asks,\n\nIs there still a radiation field in Hiroshima or Nagasaki?\n\nGreat question.\n\nHiroshima and Nagasaki had atomic bombs dropped on them\n\nin World War II.\n\nHere's Hiroshima. This is not far from ground zero.\n\nYou can see this building, the very famous Atomic Bomb Dome,\n\nground zero is very close to that.\n\nThese weapons were detonated very high above the city.\n\nIf you look at pictures of these bombs,\n\nthis is a mockup of the kind of bomb dropped in Hiroshima.\n\nThis is one for Nagasaki.\n\nYou can see they've got this equipment on them,\n\nweird little wires.\n\nThese are fuses that detect\n\nhow high above the ground the bomb is,\n\nand they were set to detonate at the height\n\nthat the scientists had calculated\n\nwould maximize the blast effect of the weapon.\n\nYou can think of the blast\n\nas going sort of as a sphere out from the explosion.\n\nAnd if it's really close to the ground,\n\na lot of that is gonna be going sort of sideways\n\nand it's gonna be running into buildings\n\nand they're gonna be absorbing the energy\n\nand also reducing it as a consequence.\n\nIf you detonate it in the air,\n\nyou're sort of going down with the blast force\n\nand it's gonna be much wider area.\n\nSo it was detonated high in the air.\n\nThe consequence of that is the people\n\nat Hiroshima and Nagasaki,\n\nthey got a blast of immediate radiation.\n\nIt's like almost like a light switch turning on and off.\n\nYou wouldn't be able to see it,\n\nbut imagine it's just like a quick exposure,\n\nalmost like X-rays or something like that.\n\nAnd that was very bad for the people\n\nwho were in the range at which that would occur.\n\nBut it's a short immediate effect.\n\nIt's sort of almost like a one-time exposure.\n\nThe thing that makes nuclear weapons so contaminating\n\nis the nuclear fallout.\n\nThese are the split atoms from the weapon\n\nand these are in the mushroom cloud.\n\nAnd one interesting thing\n\nyou can actually see in some of these pictures,\n\nso this is a picture of Nagasaki's mushroom cloud\n\ntaken from someone on the one of the airplanes\n\nthat was involved in the bombing of Nagasaki.\n\nAnd if you look closely,\n\nyou can see the cloud is actually two different parts.\n\nYou have this top part, the head,\n\nand then you have this dark stem underneath it,\n\nand you can actually see that they don't connect.\n\nThis is an artifact of the weapon being detonated higher up.\n\nThis cloud contains\n\nthe most radioactive residues from the bomb.\n\nThis is mostly created by fire and debris\n\nand dust that is being pulled up\n\nby the negative pressure of this cloud moving upwards.\n\nAnd it is not that radioactive.\n\nNow, if this bomb had been detonated on the ground,\n\nthese two parts would be mixed together.\n\nAnd if that happens,\n\nthen the radioactive bits attach themselves to the dirt\n\nand then fall out of the cloud relatively quickly\n\nbecause the dirt is pretty heavy, relatively speaking.\n\nIf it doesn't happen, this part stays relatively light\n\nand it'll blow on with the wind\n\nand as it blows, it'll take a while\n\nfor it to start to fall out of the cloud.\n\nAnd what that gets you is two things.\n\nOne, the most radioactive stuff with short half lives,\n\nthey get to sort of burn out before they fall down.\n\nBut this cloud, because it has time to spread,\n\nit means that it's diluting.\n\nSo more area gets some radioactive bits,\n\nbut they get less like per square meter, per square foot.\n\nSo the amount of radiation is diffused in a way\n\nthat doesn't actually make it a contamination hazard.\n\nSo the long and short of it\n\nis because they're detonated at high altitude,\n\nthey did not really get a lot of nuclear fallout.\n\nToday, they are not radioactive in any significant way.\n\nIf the bombs had been detonated on the ground,\n\nit would be a different story.\n\nxjsscx on Reddit asks, What actually happens\n\nto someone in an atomic bomb explosion?\n\nThe first thing, if you saw a nuclear weapon go off,\n\none, the brightness of it, it's very bright.\n\nWith that brightness comes this flash of radiation.\n\nSo if you are close enough to an atomic bomb,\n\nyou will instantly get a lot of radioactive particles,\n\ngamma rays, beta particles, things like this\n\ngoing through your body.\n\nFor the Hiroshima bomb,\n\nthe radius from the detonation point\n\nwhere you get a fatal amount of radiation\n\nis about three quarters of a mile.\n\nIf you're in that zone, you're probably dead\n\nno matter what happens next.\n\nIf you're a little out of that zone,\n\nyou might get some radiation.\n\nThat is probably not your biggest concern\n\nfor most nuclear weapons, but it's not the best, right?\n\nThe next thing that you would experience is heat.\n\nThe surface of the fireball is hotter than the sun.\n\nBriefly.\n\nIf you're in direct line of sight with this,\n\nit's sort of like if the sun\n\nwas suddenly a lot closer to you than it is right now.\n\nIf you're really close to the fireball,\n\nyou could be literally vaporized as people say.\n\nMost of the people at Hiroshima Nagasaki are not vaporized\n\nor melted or anything, but they were severely burned.\n\nYou can get really bad burns.\n\nThe next effect,\n\nthat fireball in that first split second of it going off,\n\nis sort of super-heating the air around it.\n\nAnd what's gonna happen then\n\nis it's going to be moving outward.\n\nThis is the shock wave, the blast wave.\n\nAnd as it goes out, it's this sort of wave of pressure\n\nthat's going to intersect with the ground\n\nand move along it and push,\n\nand the more it goes, the weaker it goes.\n\nBut this is powerful enough at different distances\n\nto do a lot of damage.\n\nSo at Hiroshima,\n\nif you were about 300 meters from ground zero,\n\nthat would be enough blast pressure,\n\nabout 20 pounds per square inch,\n\nto destroy almost any building that is standing.\n\nAny buildings that are still remaining at Hiroshima,\n\nlike the famous Atomic Bomb Dome, are gutted.\n\nLike nobody's doing well who was inside this building.\n\nThey're all dead.\n\nIf you go out a little further,\n\nif you were about 1.7 kilometers\n\nfrom ground zero at Hiroshima,\n\nthat's the radius at which there's enough\n\nto definitely destroy light structures.\n\nSo houses, things like that.\n\nYou go out further to maybe about 2.8 miles,\n\nand now the blast wave is weak enough\n\nthat the most it's doing is sort of breaking windows.\n\nThat's still not great.\n\nIf you're standing at a window as this thing comes to you,\n\nit's gonna break all the glass and push it into you,\n\nand now you've been injured by a window.\n\nSo depending on where you are,\n\nthere's different effects that can happen.\n\nStranfort asks on Reddit,\n\nFor how long do I stay in a fallout shelter\n\nafter a nuclear war?\n\nThe amount of time you need to stay in there\n\ndepends on how radioactive the fallout is.\n\nNow a lot of people think of fallout shelters\n\nlike the game or show Fallout,\n\nand they think we're gonna stay in there\n\nfor a hundred years or something like that.\n\nThat is not what they're built to do.\n\nThey are built to basically accommodate people\n\nto maybe stay in there for at most two weeks,\n\nmaybe even less.\n\nYou might recognize these signs.\n\nThese are from the 1960s program\n\nto identify places that could be used as fallout shelters.\n\nA fallout shelter is not meant\n\nto protect you from a nuclear weapon that drops on you.\n\nWhat it's meant to do is be a place\n\nthat puts mass, so concrete or dirt ideally,\n\nin between you and the outside world\n\nso that if radioactive particles fall on top of you,\n\nthere is something in between you and them\n\nto cut the amount of radiation.\n\nSo you can think of it when you go to the dentist\n\nand they take an X-ray\n\nand they put one of these heavy lead aprons on you.\n\nIt's sort of like a building equivalent of that lead apron.\n\nMac60five asks, How dangerous is Chernobyl Today?\n\nThere are people who visit Chernobyl\n\nor did before the Ukraine-Russia war.\n\nThere are people who work at Chernobyl still today,\n\nand they have means of checking\n\nhow much radiation they pick up.\n\nThere are tools called dosimeters.\n\nThis is one from the Cold War.\n\nIt basically tracks how much radiation you get.\n\nThis one works by looking through it at a light\n\nand a little wire moves as it absorbs radiation.\n\nAnd the workers on these kinds of places\n\nare making sure that the amount of radiation they pick up\n\nis within what we consider to be the safe amounts.\n\nYou probably wouldn't wanna live in Chernobyl though.\n\nThere are some people who have been living there,\n\npeople who used to live there\n\nthat eventually went back and they've said,\n\nYou know what? I just wanna live in my own home.\n\nI don't care if it's contaminated.\n\nAre they at risk?\n\nWell, a little.\n\nBut if they're 70 years old and living at Chernobyl\n\nincreases their cancer risk by say 5%,\n\nthey're probably gonna die of something else anyway\n\nbecause it takes a long time\n\nfor those kinds of cancers to develop.\n\nIf we talk about, what if 10,000 people lived there\n\nand the cancer risk goes up by 5%,\n\nyou're gonna start seeing that\n\nas 5% more cancers in this community than you would already.\n\naustinsburner asks, How tf does radiation work?\n\nHow does a place be radioactive?\n\nHow does someone die from radiation poisoning?\n\nYou can think of it as little particles.\n\nThat's basically what the word radiation means.\n\nIt means little things spitting out.\n\nAnd there's lots of different kinds of radiation.\n\nThe kind that people are usually talking about\n\nis called ionizing radiation, and that means radiation\n\nof types and energies that are capable\n\nof knocking electrons off of other atoms and molecules.\n\nThe problem is that if you're made out of cells,\n\nand especially if you have DNA,\n\nionizing things, that changes their chemistry.\n\nAnd if you were a rock, who would care?\n\nBut if you're a biological system,\n\nthat means you're like shooting little bullets into cells\n\nwhich can kill them, which is fine.\n\nYou have a lot of cells.\n\nOr it can, in some rare cases,\n\nchange the DNA in a way that turns it into a cancerous cell.\n\nRadiation poisoning is when you get so much radiation\n\nthat the number of cells you're killing\n\nbecomes actually significant.\n\nSo radioactive contamination is when a place\n\nhas radioactive stuff that is sending out the radiation.\n\nSo I have a Geiger counter here.\n\nA Geiger counter is a tool for detecting radioactivity.\n\nSo what it has in it is a sensor that can tell\n\nwhen a radioactive particle has gone across it.\n\nAnd whenever it does this,\n\nyou're hearing this little click happening.\n\nWhy does it click?\n\nBecause we hooked it to a speaker\n\nand we wanna be able to hear it.\n\nNow I could have a radioactive substance.\n\nThis is trinitite, the glass from the first nuclear test.\n\nThis is something that contains trace amounts\n\nof plutonium and uranium\n\nand long-lived fission products.\n\nAnd if I put the sensor over it,\n\n[Geiger counter clicks]\n\nyou can hear that the clicking increases by a bit.\n\nThe air right above this radioactive material\n\nis getting about twice as much radioactivity\n\nas the normal air around here.\n\nThat's not that much.\n\nIf this was something actually dangerous,\n\nit would be getting a lot more, a hundred times more.\n\nBut this is the sort of tool\n\nthat lets you measure when these radioactive particles\n\nare being emitted from this radioactive substance.\n\nGlitteringWeakness88 on Reddit asks,\n\nWhat is the theoretical upper power limit\n\nof a nuke we can produce currently?\n\nIf you wanted to,\n\nyou can make essentially an unlimited power nuclear weapon.\n\nA thermonuclear weapon basically works\n\nby having one nuclear weapon act\n\nas sort of the detonator for another nuclear weapon.\n\nAnd if you wanted to, you could make\n\nthat weapon be the detonator for another nuclear weapon.\n\nAnd that detonator for another nuclear weapon.\n\nThe largest nuclear weapon ever made\n\nwas the Soviet Tsar Bomba.\n\nIt was tested in 1961 as a 50-megaton-sized weapon,\n\nso 50 million tons of TNT,\n\nand that was at half its power.\n\nIt was deliberately scaled back by half\n\nto prevent contamination.\n\nBy comparison, the Hiroshima bomb\n\nis 15,000 tons of TNT.\n\nSo this is a weapon thousands of times more powerful\n\nthan the first atomic bombs.\n\nThe United States could have done that.\n\nThey actually looked into doing\n\nthat kind of thing in the Cold War and decided not to.\n\nSo the largest weapon that I know of\n\nthat was ever taken seriously\n\nby weapon scientists in the United States\n\nwas called the Sundial.\n\nIt was never built.\n\nThey didn't get that far in researching it.\n\nBut it was a weapon that was 10,000 megatons of TNT.\n\nWhy did the United States not do this?\n\nWhy did even the Soviet Union not really do this?\n\nThe Tsar Bomba was sort of a stunt\n\nmore than a practical weapon.\n\nThe answer is, one, you don't get that much from it.\n\nBecause of the way nuclear weapons work,\n\nbecause they're basically a sphere expanding in the air.\n\nThink of it as a balloon that you're like pumping air into.\n\nWhat we care about for the damage\n\nis the amount of the balloon that's gonna touch the ground.\n\nA lot of that balloon is not gonna touch the ground.\n\nAnd as we're putting energy into it,\n\nthe part that's touching the ground,\n\nit's not increasing as a linear function.\n\nIt's increasing as what's called a cubic root.\n\nThe takeaway is,\n\nif we wanted to double the damage of a weapon,\n\nwe typically have to increase the size of the weapon\n\nby around eight times.\n\nThe real killer though is, to make them bigger,\n\nwe do more or less have to linearly increase the weight\n\nand size of the weapon.\n\nSo the Tsar Bomba is a powerful weapon,\n\nbut it's the size of a school bus.\n\nThat weapon could not fit inside\n\nthe airplane that carried it\n\nand had to sort of sit underneath it like a big egg.\n\nIf you are another country\n\nand you see a plane coming towards you\n\nwith a big egg attached to it,\n\nyou're gonna really work hard to shoot that down.\n\nThat is not convenient.\n\nIf you're talking about weapons\n\nthat are the size of the Sundial, 10,000 megatons,\n\nthat's a weapon that's probably\n\nthe size of the space shuttle.\n\nThat's not easy to use. That's not easy to deploy.\n\nThat's gonna be also really expensive as an aside.\n\nTrends in nuclear weapons design didn't go in that area.\n\nWhat they did was they went for more compact weapons\n\nso you can put 10 of them onto one missile\n\nand then target 10 targets with one missile.\n\nIt's a weapon the size of a large trash can,\n\nbut it's 30 times more explosive than Hiroshima.\n\nThat's peak weapons design, not just more bang.\n\nPerfect-Football2616 on Reddit asks,\n\nDid the tactic of duck and cover\n\nprovide any protection from an actual nuclear strike?\n\nDuck and Cover was a public education program\n\nput out by the United States government,\n\nand it was particularly aimed at school children.\n\nAnd you'll see pictures\n\nof children hiding under their desk from this period.\n\nThere was a short film created\n\nwith a turtle cartoon mascot, Bert the Turtle,\n\ntrying to talk to students about nuclear war.\n\nAnd, of course, a lot of it looks pretty sketchy.\n\nThere are lots of people who lived through this who said,\n\nThat was the moment I realized\n\nadults did not know what they were doing\n\nif they thought this desk\n\nwas gonna protect me from an atomic bomb.\n\nThey are not saying\n\nthat if an atomic bomb lands on your school,\n\nyour desk is gonna keep you safe.\n\nWhat they are doing with this policy\n\nis saying there's gonna be an area where the bomb goes off,\n\nwhere you just have no hope.\n\nI'm sorry.\n\nThey don't say this in the movie\n\nbecause it's aimed at children.\n\nThey don't even say this things aimed at adults\n\nbecause the United States government\n\nhas a very hard time admitting\n\nthat people are gonna die in large numbers\n\nif nuclear weapons go off,\n\neven though it is self evidently true.\n\nThere's also a zone much further out\n\nwhere you're far enough away that you'll say,\n\nWhat was that? Oh my gosh, what's going on?\n\nYou are not going to be affected by the weapon, right?\n\nYou're gonna learn from the news.\n\nSo in between is a pretty small zone\n\nwhere you have a chance of surviving\n\nif you do the right thing.\n\nDuck and Cover is for that zone,\n\nand it's for an area where the blast pressure\n\nis going to be enough\n\nthat it is gonna be sort of like an earthquake.\n\nThey're worried about the ceiling collapsing,\n\nthey're worried about windows breaking.\n\nThey're worried that if you have exposed skin,\n\nyou might get burned.\n\nAnd so the tactic is get down,\n\ncover up your most vulnerable parts,\n\nand you can increase your chance of survival\n\na little bit that way.\n\nTheMuteNewt on Reddit, great name,\n\nHow close did Nazi Germany actually get\n\nto developing an atomic weapon?\n\nNazi Germany did not get close\n\nto making an atomic bomb.\n\nAt the end of World War II they were almost to the place\n\nthat the United States was in 1942.\n\nSo they almost had a prototype nuclear reactor,\n\nnot an atomic bomb.\n\nWhy not? Because they weren't trying to make an atomic bomb.\n\nI know that's a hot take\n\nbecause we like to talk about the race for the atomic bomb.\n\nThe Americans feared they were working on atomic bomb,\n\nbut the Germans had actually decided they were gonna have\n\na pretty small research program for nuclear reactors,\n\nmaybe in the future, making atomic bombs.\n\nBut they concluded in 1942\n\nthat it would take a lot of work\n\nfrom a lot of their scientists\n\nto try and make an atomic bomb\n\nthat could be useful for World War II.\n\nAnd in 1942, they thought they were gonna win the war\n\nso they didn't think they needed an atomic bomb.\n\nThey thought that making an atomic bomb\n\nwould be very hard and they were correct on that.\n\nAnd as a result, they thought nobody else\n\nwas gonna make one either.\n\nSo this is a problem for after the war.\n\nWell, that's it. That's all the questions.\n\nI hope you learned something.\n\nI hope you don't make an atomic bomb.\n\nUntil next time. [upbeat music]",
  "authors": [
    "Condé Nast"
  ],
  "url": "https://www.wired.com/video/watch/tech-support-nuclear-historian-answers-nuclear-science-questions"
}