{
  "title": "Fossil fuel lobbyists outnumber all Cop30 delegations except Brazil, report says",
  "text": "More than 1,600 fossil fuel lobbyists have been granted access to the Cop30 climate negotiations in Belém, significantly outnumbering every single country’s delegation apart from the host Brazil, new analysis has found.\n\nOne in every 25 participants at this year’s UN climate summit is a fossil fuel lobbyist, according to the analysis by the Kick Big Polluters Out (KBPO) coalition, raising serious questions about the corporate capture and credibility of the annual Cop negotiations.\n\nThis year’s tally represents a 12% rise from last year’s climate talks in Baku, Azerbaijan, and is the largest concentration of fossil fuel lobbyists at Cop since KBPO first began exposing industry participation in 2021. The overall number is smaller this year than at Cop29 in Baku (1,773) and Cop28 in Dubai (2,456), but the proportion is higher this year as the Belém summit is less well-attended.\n\nIt brings the total number of fossil fuel lobbyists given access to the UN climate summits to 7,000 over the past five years, a period marked by a rise in catastrophic extreme weather, disinformation and oil and gas profits.\n\n“Another Cop, same playbook. This is corporate capture, not climate governance,” said Lien Vandamme, senior campaigner on human rights and climate change at the Center for International Environmental Law (CIEL).\n\nAnother Cop, same playbook. This is corporate capture, not climate governance Lien Vandamme, Center for International Environmental Law\n\nThe annual climate talks opened in Belém on Monday, with Brazil’s President Luiz Inácio Lula da Silva disavowing disinformation and declaring that it would be the “Cop of truth”.\n\nYet the fossil fuel industry, which has a long history of spreading misinformation and disinformation while blocking meaningful climate action, received almost 60% more passes to Cop30 than the 10 most climate-vulnerable nations combined (1,061), according to analysis by KBPO, an international coalition of 450 organizations.\n\nClimate breakdown is escalating. In the lead-up to Cop30, hundreds of people were killed after two powerful typhoons wreaked havoc less than a week apart in the Philippines – a country that has been hit by 21 significant storms this year alone. Fossil fuel-affiliated lobbyists outnumber official delegates from the Philippines by nearly 50 to 1, and Iran, where severe drought could force the government to evacuate the capital, Tehran, by 44 to 1.\n\nMeanwhile, it is expected to cost Jamaica billions of dollars and years to recover from Hurricane Melissa, a category 5 storm turbocharged by global heating, yet fossil fuel lobbyists outnumbered the island nation’s delegation by 40 to 1.\n\nIn July, the international court of justice (ICJ) ruled that continued fossil fuel expansion, extraction, consumption and subsidies may constitute an internationally wrongful act.\n\n“After the ICJ advisory opinion and the well-document six-decade playbook of climate obstruction, states at Cop should recognize the irreconcilable conflict of interest of the fossil fuel industry – which is similar to the tobacco industry,” said Elisa Morgera, the UN special rapporteur for climate change who supports a global ban on fossil fuel lobbying.\n\nThe findings come as 2025 is set to become among the hottest years on record, yet states are failing to regulate polluting corporations and cut subsidies, with nearly $250bn earmarked for new oil and gas projects since Cop29.\n\n“From the halls of the UNFCCC to our lands and territories, fossil fuel corporations are wrecking our communities and environment. Yet the red carpet is rolled out for thousands of lobbyists to roam the corridors,” said Nerisha Baldevu from Friends of the Earth Africa.\n\nFossil fuel corporations are wrecking our communities. Yet the red carpet is rolled out for lobbyists to roam the corridors Nerisha Baldevu, Friends of the Earth Africa\n\nThe latest findings will pile further pressure on the UN to ban the fossil fuel industry from the annual climate action summits, where world leaders are supposed to negotiate in good faith and agree on ambitious plans to curtail climate catastrophe.\n\nLast week, the Guardian revealed that 57% of all oil and gas production last year came from 90 fossil fuel firms that sent substantial numbers of lobbyists to the UN climate talks from 2021 to 2024.\n\nA recent investigation by Drilled Media revealed that oil companies, with the help of the US government, first co-opted the international climate stage in the early 1970s, influencing the eventual drafting of the United Nations Framework Convention on Climate Change (UNFCCC) in 1992, and every conference of the parties (Cop) to that convention since then.\n\nKBPO analyzed the provisional list of participants at Cop30 published by the UNFCCC, identifying delegates representing oil, gas and coal companies, trade groups, financial institutions and others that fund or financially benefit from obstructing climate action to phase out planet-heating fuels.\n\nThe 1,602 fossil fuel lobbyists identified include 148 with the International Chamber of Commerce (ICC); 60 with the International Emissions Trading Association (Ieta), including delegates from oil and gas giants ExxonMobil, BP and TotalEnergies; and 41 with the Brazilian National Confederation of Industry (BNCI).\n\nThe ICC said only three of the 148 business representatives they accredited are from fossil fuel firms. “We do not represent any one sector. And we pride ourselves in bringing a delegation to COP that represents the full diversity of the business community,” said Andrew Wilson, ICC deputy secretary general.\n\nSeveral big polluters from the global north invited fossil fuel representatives to join their official delegations including France, which brought 22 industry delegates including the CEO of TotalEnergies, and Norway, whose group included six senior executives from its national oil and gas giant Equinor.\n\nOverall, only Brazil, with 3,805 delegates, has a bigger presence than oil, gas and coal interests.\n\nBut the true extent of fossil fuel influence is likely to be higher, as more than half of all country delegation members at Cop30 withheld or obscured details of their affiliations, according to a separate analysis by Transparency International. Russia, Tanzania, South Africa and Mexico are among the countries that did not disclose the affiliation of any official delegates.\n\nAfter years of campaigning by civil society groups, Cop delegates were this year required to publicly disclose who was funding their participation – and confirm that their objectives were in alignment with the UNFCCC. But the new transparency requirement excludes anyone in official government delegations or overflows; also, calls for stricter conflict-of-interest protections to cut industry influence have not been adequately heeded, advocates say.\n\n“While local Indigenous peoples struggled to enter the conference, fossil fuel lobbyists walked in freely. My generation deserves Just Transition policies that reflect what people and the planet need, not what polluters’ profits demand,” said Pim Sullivan-Tailyour of the UK Youth Climate Coalition. “The UNFCCC is in need of rehabilitation.”\n\n“Fossil fuel companies continue to lead us into a climate abyss. [Yet] for 30 years, climate change summits have been an ideal stage for oil companies to clean up their image, do business and find new ways to get away with environmental crimes,” said Ivonne Yáñez from Acción Ecológica [Ecological Action], a non-profit environmental group in Ecuador where oil drilling is expanding across the Amazon.\n\n“Today, instead of transitioning to post-oil societies, they want to extract every last drop of fossil fuels to continue feeding the capitalist system and genocidal wars.”\n\nA UNFCCC spokesperson said: “As of 2023, measures have been taken to enhance transparency so that it’s clearer who participates at Cop. We have done this in consultation with civil society and other stakeholders. Just as no single Cop can be expected to solve the climate crisis overnight, making further concrete improvements is an ongoing journey, noting that national governments have sole authority to decide who is in their delegations.”\n\nIeta and the BNCI declined to comment.",
  "authors": [
    "Nina Lakhani"
  ],
  "url": "https://www.theguardian.com/environment/2025/nov/14/fossil-fuel-lobbyists-cop30"
}