{
  "title": "Joey, Jesse Buss Removed From Lakers' Basketball Operations After $10B Sale",
  "text": "There figured to be changes after the Los Angeles Lakers were sold at a $10 billion valuation in June, and some of that change arrived Thursday.\n\nESPN's Shams Charania reported Joey and Jesse Buss were removed from their front office positions as part of the franchise's reorganization of its basketball operations department. Charania noted the Buss brothers will still maintain their minority ownership shares with the team.\n\n\"We are extremely honored to have been part of this organization for the last 20 seasons,\" they said in a statement. \"Thank you to Laker Nation for embracing our family every step of the way. We wish things could be different with the way our time ended with the team. At times like this we wish we could ask our Dad what he would think about it all.\"\n\nAt the time of the sale, Charania reported Jeanie Buss would remain the team governor.\n\nStill, it was surprising to see the Lakers going anywhere other than the Buss family considering the name has become almost synonymous with the organization over the span of decades.\n\nJerry Buss purchased the team in 1979 for $67.5 million and became one of the most famous owners in all of sports.\n\nIt certainly didn't hurt his prominence that the Lakers enjoyed a significant amount of success during the Showtime era with Magic Johnson and Kareem Abdul-Jabbar before another round of dominance with Shaquille O'Neal and Kobe Bryant leading the way.\n\nJeanie Buss became the governor and face of the franchise ownership following her father's death as the family remained prominent in NBA circles.\n\nHowever, Thursday's move means even less involvement for the family after the sale. Joey and Jesse Buss played scouting roles for the organization at times and, per Charania, were integral to finding the likes of Austin Reaves, Kyle Kuzma and Jordan Clarkson, among others.\n\nThis comes after ESPN's Dave McMenamin and Charania reported in September that Joey and Jesse Buss were launching the investment firm Buss Sports Capital in an effort to find acquisitions and partnerships across sports.\n\n\"I look forward to working with my brother, Joey, for the next 50 years and hopefully this is something that can live through our children,\" Jesse Buss said of the venture. \"That's what our dad would have wanted.\"",
  "authors": [
    "Scott Polacek",
    "Bleacher Report"
  ],
  "url": "https://bleacherreport.com/articles/25300851-joey-jesse-buss-removed-lakers-basketball-operations-after-10b-sale?utm_source=cnn.com&utm_medium=referral&utm_campaign=editorial"
}