{
  "title": "A Harrowing Escape From the Drone-Infested Hellscape of Ukraine’s Front Lines",
  "text": "Light flashed in Aleksandr’s eyes, accompanied by a blast that threw him down. His luck was bad: Shrapnel tore through him; pain flared in his left leg. His luck was good: The drone did not linger for the finish. It darted away, chasing his peers as they bounded for trees. Bleeding, pressed to soil, he heard more explosions, off in the direction from where he had come.\n\nQuiet settled over the field.\n\nAleksandr sat up. The Russian pilot, he thought, had mistaken him for dead. Or perhaps the drone, an improvised weapon based on a consumer gadget, was out of ammunition or needed a battery change. Whatever the reason, it no longer hunted here. Aleksandr was left wounded in the void of no man’s land, a zone surveilled by drones and roamed by animals scavenging the fallen. The darkness was almost total. Blood pulsed out from his lower leg, soaking his sock and boot. He pulled a tourniquet from his first-aid kit, slipped it around his calf and cinched it tight, then assessed his injuries by sliding his hands down the limb, feeling where shrapnel had blown through his shin. Without light, he could not see the wound but sensed it was bad. Bones were shattered and he could not move his foot, which he assumed hung by loose flesh and skin.\n\nHe tried to stand. His right leg was strong but his left bore no weight. He eased himself down, swore and shouted for help. “Guys!” he screamed. “Guys! I’m alive!” No one replied. In pain, alone, all but immobilized, Aleksandr was stranded where no ambulance would come.\n\nHis mission had been timed for a dark period between moonset and sunrise. The sky was black, silent and vast. But in less than three hours, daybreak would illuminate the meadow where he bled. Many more Russian drones would take flight. Aleksandr’s future distilled to a simple binary. If he could reach the woodlot by dawn, he might be pulled to safety and surgical care. If not, he’d almost certainly end up like countless other soldiers in this war: laying helpless on farmland until a predatory drone descended and an explosion tore him apart, his last wretched seconds recorded for social media’s 24-7 snuff-film deathstream.\n\nTime was tight. Aleksandr removed his helmet and body armor and pushed them away. Protective equipment may have saved his life; now it would slow him down. He set aside his rifle and ammunition too, then dug through his backpack, evaluating what to keep. He settled on a gray poncho, a flashlight, a spare tourniquet, a pack of cigarettes and his phone. He considered his wooden-handled hunting knife and kept it as well. If his left foot snagged and held him up, he told himself, he would cut it off.",
  "authors": [
    "C.J. Chivers"
  ],
  "url": "https://www.nytimes.com/2025/11/05/magazine/ukraine-russia-war-drones.html"
}