{
  "title": "Racing thoughts during sleep: How to stop them",
  "text": "You fall asleep at an appropriate hour, giving yourself enough time to rest before a big day ahead — only to be jolted awake by racing thoughts: Was your friend secretly offended by your joke? Are your kids safe when they’re at school? Will international conflict and political division ever end? Will you lose your job to artificial intelligence?\n\nThe more your mental hamster wheel turns, falling back to sleep seems further out of reach.\n\n“Waking up in the middle of the night with racing or intrusive thoughts is very common and is actually one of the most frequently reported symptoms of chronic insomnia,” Dr. Michelle Drerup, director of education and behavioral sleep medicine at the Cleveland Clinic’s Sleep Disorders Center in Ohio, said via email.\n\nExperts recommend certain strategies for easing nighttime stress and falling back to sleep. Motortion/iStockphoto/Getty Images\n\nWhy this nighttime anxiety happens is likely a mix of biological and psychological factors, experts said.\n\n“Everyone wakes up briefly numerous times during the night, but these awakenings are generally so brief that we don’t notice them,” Drerup said. “When someone is under more stress or anxiety, instead of drifting back to sleep immediately, their mind notices or latches on to one of those thoughts or worries, turning what would have been a normal ‘micro-arousal’ into feeling alert.”\n\nAdditionally, when typical distractions of the day fade away, the brain has more bandwidth to revisit any unfinished business, Dr. Simon Rego, chief of psychology at Montefiore Medical Center in New York City, said via email.\n\nWhen you fall asleep, the thinking part of the brain — the prefrontal cortex — quiets down, but during late-night sleep, the brain’s alarm system known as the amygdala is active, said Dr. Leah Kaylor, a clinical psychologist in St. Petersburg, Florida. Kaylor is also a sleep specialist for the FBI and author of “If Sleep Were a Drug: The Science of Sleep Optimization.”\n\nSoothing yourself to sleep\n\nJust as each person has a personal trigger for nighttime rumination, there isn’t a one-size-fits-all solution for this issue, Drerup said. But Drerup and other experts do have some practices from which you can choose.\n\nOne is cognitive shuffling, Kaylor said, which involves mentally conjuring up random, impersonal and nonemotionally charged words. For each letter of your chosen word, you think of as many corresponding words as you can for five to eight seconds each before moving to the next letter.\n\nFor the word “piano,” for example, you might think “Pear, parachute, pirouette … Item, intention, igloo …” and so on. Cognitive shuffling works, usually within five to 15 minutes, by distracting the brain from stress and mimicking fragmented, nonlinear thought patterns that typically occur in the transition into sleep.\n\nSensory grounding anchors your attention to the physical world instead of mental stories, Kaylor said. Count five things you can feel, for example, or one thing you can feel, one you smell, one you taste, one you hear and one you see.\n\nMental “walk-throughs” can also work, she said. Imagine walking through an old apartment, a childhood street or a grocery store aisle. “Familiar but neutral imagery calms the brain,” Kaylor said via email.\n\nBreathwork is a common stress reliever, and there are many forms — including deep breathing, 4-7-8 breathing and progressive muscle relaxation. Counting down from 200 or so is also often helpful for some.\n\nQuickly putting your thoughts on paper can help since you may then feel confident that you can handle the problem tomorrow and more successfully push it out of your brain. But doing so doesn’t work for everyone, especially if you know the issue isn’t easily fixable — so Drerup recommends journaling about your thoughts and next steps hours before bedtime to train your brain to process stress earlier instead of defaulting to nighttime.\n\nIf none of these strategies work within 15 to 20 minutes, get out of bed and do something soothing until you feel sleepy again, experts said. That could be listening to a calming podcast or playlist, reading a book, doing a puzzle or folding laundry, Rego and Drerup said.\n\nLimiting the time you stay in bed helps prevent a learned association between your bed and anxiety, Drerup said. That’s important since having a foundational awareness that nighttime awakenings are normal, trusting that your body knows how to fall back to sleep and decreasing the fear associated with waking up are critical. For that reason, don’t keep checking the clock — knowing the time will most likely only stress you out more.\n\nTake account of your daily habits\n\nThat journaling tip may need to be part of a regular daytime stress management tool kit that might be missing from your life, causing nighttime anxiety. That tool kit can include exercise, time outdoors, meditation and scheduled “worry time,” both Rego and Kaylor said.\n\nAlso, consider your general sleep routine and other habits. Maybe you’re being woken up because you’re too hot, while a room temperature of 65 to 67 degrees Fahrenheit (around 18 to 19 degrees Celsius) is best for sleep, Kaylor said.\n\nAnd while drinking alcohol may help you fall asleep, it interferes with staying asleep. Presleep screen time is also disruptive, especially if the content you’re looking at is stressful or exciting.\n\nWhen you need to see a doctor\n\nYou may need to see a doctor about your racing thoughts if they are waking you up three or more nights weekly for three or more months; if they or their impact on your sleep are interfering with your work, mood, memory or other daytime functioning; if you’re always dreading bedtime; or if you feel unsafe, Kaylor said.\n\n“There are several evidence-based treatments for nighttime stress, including cognitive behavioral therapy for insomnia,” Drerup said. The therapy also targets rumination and unhelpful beliefs about sleep.\n\nMindfulness-based therapies, cognitive behavioral therapy for anxiety, trauma-focused therapies, and acceptance and commitment therapy for insomnia are also effective, depending on your root issue, experts said.\n\nFor mild cases, Kaylor said, experts sometimes recommend the supplements magnesium glycinate or L-theanine, an amino acid that helps reduce stress and promote calm. Even though supplements are available over the counter, you should talk to a doctor before trying them in case they don’t mix well with any medications you’re taking.\n\nSleep medications — such as the antidepressants doxepin or trazodone or certain nonbenzodiazepine hypnotics — can be helpful short-term, Kaylor said. But long-term use may lead to dependence, withdrawal or diminished natural sleep drive, Kaylor said. “Some people do safely use long-term medication under medical supervision,” she said, “but it should be a carefully monitored plan, not a first-line strategy.”\n\nSign up for CNN’s Sleep, But Better newsletter series. Our seven-part guide has helpful hints to achieve better sleep.",
  "authors": [
    "Kristen Rogers"
  ],
  "url": "https://www.cnn.com/2025/11/20/health/how-to-stop-mind-racing-sleep-wellness"
}