{
  "title": "Nvidia supera las expectativas de ganancias, incluso mientras aumentan las preocupaciones sobre una burbuja de IA",
  "text": "CNN —\n\nNvidia reportó sólidos ingresos y beneficios que superaron las expectativas de Wall Street el miércoles. El resultado, muy observado, podría generar algo de alivio en todo el mercado bursátil tras la creciente preocupación por una posible burbuja de inteligencia artificial.\n\nLas ventas de Nvidia crecieron un 62 % interanual hasta los US$ 57.000 millones en el trimestre de octubre, por encima de los US$ 54.900 millones que Wall Street había proyectado, lo que indica que la demanda de chips de IA sigue siendo fuerte incluso cuando surgen más preguntas sobre si los retornos de la tecnología mantendrán el ritmo de las inversiones en infraestructura de IA. Registró beneficios de US$ 31.900 millones, un 65 % más que en el mismo trimestre del año anterior y también ligeramente por encima de las expectativas.\n\n“Las ventas de Blackwell están fuera de serie y las GPU en la nube están agotadas”, dijo el CEO de Nvidia, Jensen Huang, en un comunicado, un mensaje que refleja sus argumentos anteriores de que los temores sobre una burbuja de IA están exagerados.\n\nLa compañía también publicó una previsión de ventas superior a la esperada, de alrededor de US$ 65.000 millones para el cuarto trimestre, otro indicador de que el gasto en IA no se va a ralentizar pronto.\n\nLas acciones de Nvidia (NVDA) subieron un 2,6 % en las operaciones posteriores al cierre tras el informe.\n\nNvidia se ha convertido tanto en la columna vertebral como en un emblema del auge de la IA, ya que gran parte de la tecnología de la industria funciona con sus chips. La empresa pública más valiosa del mundo también ha sido clave en el rally bursátil de este año: representa aproximadamente el 8 % del S&P 500 y sus acuerdos con otras firmas tecnológicas han ayudado a impulsar sus acciones también, lo que significa que casi todos los inversores y titulares de 401k se verán afectados por los resultados del miércoles.\n\nLos temores de una burbuja de IA antes del informe de Nvidia habían causado volatilidad en todo el mercado bursátil, ya que los inversores adoptaron una actitud de aversión al riesgo y se deshicieron de activos como bitcoin y acciones de IA.\n\nLas acciones de otras tecnológicas —como Meta, Microsoft, Amazon y Google— estaban en verde en las operaciones posteriores al cierre tras el informe de Nvidia, lo que subraya el impacto del fabricante de chips en el mercado en general.\n\nEn el centro de las preocupaciones sobre una burbuja están los acuerdos de financiamiento circular que Nvidia y otros fabricantes de chips han formado con empresas de IA, como una inversión de US$ 100.000 millones en OpenAI a cambio de compras de chips que se anunció en septiembre. La directora financiera de OpenAI, Sarah Friar, generó aún más inquietud a principios de este mes cuando sugirió que el Gobierno debería respaldar la deuda que las empresas tecnológicas están asumiendo para construir infraestructura de IA, una declaración que la empresa luego intentó matizar.\n\nPero los temores no han impedido que Nvidia haga más acuerdos de este tipo. Anthropic, el lunes, se comprometió a comprar US$ 30.000 millones en capacidad de computación de Microsoft Azure, funcionando con chips de Nvidia, a cambio de una inversión en el laboratorio de IA por parte de ambos gigantes tecnológicos.\n\nHuang ha rechazado repetidamente las preocupaciones sobre una burbuja. En la conferencia de IA GTC de la empresa el mes pasado, le dijo a CNN que la disposición de las personas a pagar por herramientas de IA indica que la tecnología es “rentable”, incluso si la mayoría de las empresas tecnológicas ahora están reinvirtiendo el dinero que ganan en nueva infraestructura.\n\nEl hecho de que el negocio de Nvidia siga funcionando no es sorprendente, dado que gigantes tecnológicos como Meta, Microsoft, Amazon y Google indicaron en sus informes de resultados más recientes que planean seguir aumentando su gasto en infraestructura de IA. Huang también expuso en GTC los planes de la empresa para llevar su tecnología a aún más áreas de la vida: desde torres de telefonía celular hasta vehículos autónomos.",
  "authors": [
    "Clare Duffy"
  ],
  "url": "https://cnnespanol.cnn.com/2025/11/19/economia/nvidia-supera-expectativas-ganancias-trax"
}