{
  "title": "‘HANG THEM’: Trump Boosts Message Calling For Executing Democrats In Congress",
  "text": "LOADING ERROR LOADING\n\nWASHINGTON — President Donald Trump on Thursday suggested Democratic veterans in Congress should be hanged for releasing a joint video urging U.S. military service members to disobey unlawful orders from on high.\n\nIn a series of unhinged posts on his social media site, Truth Social, Trump boosted an anonymous user’s message that read, “HANG THEM GEORGE WASHINGTON WOULD !!” The message was in response to a news story about the video released Tuesday by six Democrats in the House and Senate, all with military or intelligence backgrounds.\n\nAdvertisement\n\nPresident Donald Trump boosted this message on social media calling for executing Democrats in Congress. Truth Social\n\nIn another message, Trump himself called it “SEDITIOUS BEHAVIOR, punishable by DEATH!” that members of Congress would release such a video.\n\n“It’s called SEDITIOUS BEHAVIOR AT THE HIGHEST LEVEL,” the president wrote, in still another message. “Each one of these traitors to our Country should be ARRESTED AND PUT ON TRIAL. Their words cannot be allowed to stand - We won’t have a Country anymore!!! An example MUST BE SET. President DJT.”\n\nAdvertisement\n\nIn fact, U.S. military service members have a right to refuse illegal orders, and in some cases, a duty to do so. Everyone in the military swears an oath to the U.S. Constitution, not to a particular president of the United States or anyone else in the chain of command.\n\nRep. Jason Crow (D-Colo.), one of the six Democrats in the video, said Wednesday that the group made the video out of concern for possible future illegal orders by the president, versus any specific orders that have already been given.\n\n“Donald Trump has made a series of very disturbing comments and suggestions that would violate U.S. law and put our military in a terrible position,” Crow, a former Army ranger, said in a Fox News interview. “I don’t want to wait until that happens to remind our troops of this obligation, because then it will be too late.”\n\nAdvertisement\n\nA service member may be punished by court-martial for failing to obey any lawful order or regulation, per the Uniform Code of Military Justice, which is the foundation for the conduct and legal procedures for the U.S. military justice system.\n\nThe U.S. military’s 2024 manual for courts-martial gets more specific: It states that a military order is lawful, “unless it is contrary to the Constitution, the laws of the United States, or lawful superior orders or for some other reason is beyond the authority of the official issuing it.”\n\n“This inference does not apply to a patently illegal order, such as one that directs the commission of a crime,” the manual states. It continues elsewhere, “The lawfulness of an order is a question of law to be determined by the military judge.”\n\nAdvertisement\n\nAsked about Trump encouraging political violence by calling for members of Congress to be killed, White House press secretary Karoline Leavitt bizarrely accused the six Democrats of being the ones inciting violence.\n\n“They are literally saying to 1.3 million active-duty service members to defy the chain of command, not to follow lawful orders,” she said in her Thursday press briefing.\n\nWhen a reporter corrected Leavitt that Democrats were urging service members to defy illegal orders, not legal ones, the press secretary changed the subject, saying Trump hasn’t given illegal orders.\n\nAdvertisement\n\n“To suggest and encourage that active duty service members defy the chain of command is a very dangerous thing for sitting members of Congress to do,” Leavitt said, again conflating defying an illegal order versus a legal one.\n\n“SEDITIOUS BEHAVIOR, punishable by DEATH!” Trump said of Democrats in Congress releasing a video urging U.S. military servicemembers to uphold their oath to the Constitution. via Associated Press\n\nOn Capitol Hill, top Democrats condemned Trump’s comments and urged everyone to take them seriously.\n\n“Let’s be crystal clear: the President of the United States is calling for the execution of elected officials. This is an outright threat, and it’s deadly serious,” Senate Minority Leader Chuck Schumer (D-N.Y.) said in remarks on the Senate floor.\n\nAdvertisement\n\n“Every Senator, every Representative, every American―regardless of party―should condemn this immediately and without qualification,” Schumer said. “Because if we don’t draw a line here, then there is no line left to draw.”\n\nHouse Democratic leaders issued a joint statement rejecting the president’s “disgusting and dangerous death threats against Members of Congress,” and called on House Republicans to do the same.\n\nThey said they also contacted the House Sergeant at Arms and the U.S. Capitol Police to ensure the safety of the six Democrats and their families.\n\nAdvertisement\n\n“Donald Trump must immediately delete these unhinged social media posts and recant his violent rhetoric before he gets someone killed,” reads a statement from House Democratic Leader Hakeem Jeffries (N.Y.), Democratic Whip Katherine Clark (Mass.) and Democratic Caucus Chair Pete Aguilar (Calif.).\n\nSome Democrats scolded Trump not just for threatening lawmakers, but for suggesting that servicemembers took at oath to him, not the Constitution.\n\n“Calling for the execution of senators and members of Congress for reminding our troops of that is chilling behavior we should expect from authoritarians like Orban or Putin, not the President of the United States,” Coons said. “Every one of my Republican colleagues needs to stand up and swiftly condemn this.”\n\nAdvertisement\n\nSen. Chris Murphy (D-Conn.) was less measured in his response.\n\n“The President of the United States just called for Democratic members of Congress to be executed. ‘HANG THEM,’ he posted,” Murphy wrote on social media. “If you’re a person of influence in this country and you haven’t picked a side, maybe now would be the time to pick a fucking side.”\n\n“Every American must unite and condemn the President’s calls for our murder and political violence.”\n\nLater Thursday, the six Democrats who made the video that set Trump off issued a joint statement, reminding that they, too, swore an oath to protect and defend the Constitution of the United States.\n\nAdvertisement\n\n“That oath lasts a lifetime, and we intend to keep it. No threat, intimidation, or call for violence will deter us from that sacred obligation,” reads the statement from Sens. Elissa Slotkin (Mich.) and Mark Kelly (Ariz.), and Reps. Chris Deluzio (Pa.), Maggie Goodlander (N.H.), Chrissy Houlahan (Pa.) and Crow.\n\n“What’s most telling is that the President considers it punishable by death for us to restate the law. Our servicemembers should know that we have their backs as they fulfill their oath to the Constitution and obligation to follow only lawful orders,” they said.\n\n“Every American must unite and condemn the President’s calls for our murder and political violence,” the lawmakers added. “This is a time for moral clarity. In these moments, fear is contagious, but so is courage. We will continue to lead and will not be intimidated. Don’t Give Up the Ship!”",
  "authors": [
    "Senior Politics Reporter"
  ],
  "url": "https://www.huffpost.com/entry/trump-boosts-message-hanging-democrats-congress_n_691f35d9e4b047290e290aa2"
}