{
  "title": "'A wicked wife': The truth about Tudor England's 'most hated woman'",
  "text": "The 16th-Century aristocrat Jane Boleyn faced explosive accusations: she was blamed for a shocking betrayal of her husband, as well as two of Henry VIII's wives, her sister-in-law Anne Boleyn and Catherine Howard. Was she a \"sex-mad\" spy, guilty-as-charged – or a convenient scapegoat for a tyrant's brutality? A new historical thriller by Philippa Gregory, Boleyn Traitor, explores her story.\n\nIn the court of the mercurial King Henry VIII, nobody was safe, and the confidants of queens and courtiers could quickly switch allegiance. Lady-in-waiting Jane Boleyn, who served five queens − including her sister-in-law Anne Boleyn and Anne's cousin Catherine Howard, both executed by King Henry VIII – has long been painted as one such turncoat, surviving under suspicious circumstances when all around her were sent to the block. Blamed for betraying them, arguably she became, writes author Tracy Borman, chief historian at Historic Royal Palaces, \"the most hated woman in Tudor England\".\n\nHarperCollins Philippa Gregory's new historical thriller is a fictionalised version of Jane Boleyn's story (Credit: HarperCollins)\n\nThis notorious figure, who acquired the title Viscountess Rochford in 1529, is the subject of a new book, Boleyn Traitor, a historical thriller written by Philippa Gregory CBE, whose hit novel, The Other Boleyn Girl, inspired the 2008 film of the same name starring Natalie Portman and Scarlett Johansson. \"Jane has been on [my] mind since I wrote The Other Boleyn Girl, and since then, there have been some great new biographies of her,\" Gregory tells the BBC. \"For any lover of Tudor history, she's this enigma, right in the middle of the story, who against all the odds, survives the fall of the Boleyns.\"\n\nJane Boleyn, born Jane Parker in around 1505, was the daughter of a baron who served as a gentleman usher to Henry VIII and translated Italian renaissance texts for the court. She arrived at court aged just 11, appointed as maid-of-honour to Henry VIII's first wife, Katherine of Aragon. It was there that she met the Boleyn family. Aged around 20, she made an advantageous marriage to George Boleyn, whose sister Anne – in an unanticipated twist – would be queen within a decade.",
  "authors": [],
  "url": "https://www.bbc.com/culture/article/20251110-the-truth-about-tudor-englands-most-hated-woman"
}