{
  "title": "All MAGA Wanted Was the Epstein Files. Now They're Ignoring Them",
  "text": "MAGA could care less about the latest document dump on disgraced financier and convicted sexual abuser Jeffrey Epstein.\n\nOn Wednesday, the House Oversight Committee released 20,000 documents from Epstein’s estate, a number of which directly reference president Donald Trump. The cache of documents contain messages from Epstein, where the sex offender says he knows “how dirty Donald is,” and that the president had spent hours in Epstein’s own home with one of his victims. In one message from Epstein to author Michael Wolff, Epstein writes: “Of course he knew about the girls.”\n\nThe White House has dismissed the revelations as nothing but a partisan attempt to smear Trump, a narrative MAGA world has been more than happy to get behind, even though the same people spent years calling for further investigations into Epstein’s associates. In February, the White House gave a dozen right-wing influencers including conservative commentator Liz Wheeler and Chaya Raichik, the woman who runs the notorious LibsofTikTok account, access to a number of Epstein-related documents. They walked out of the White House waving white binders labeled “The Epstein Files: Phase 1” and “The Most Transparent Administration in History,” though the administration later admitted many of the documents were already in the public domain.\n\nBut this week, following the drop of new documentation, the influencers have been silent.\n\nMAGA influencers are either ignoring the new information or reframing it not as an indictment of Trump, but as part of a Democratic Party effort the president himself called “a hoax.” In many cases, MAGA influencers online focused instead on references to other people in the document dump, including a former New York Times journalist, a lawyer who worked as a White House counsel during the Obama administration, and Wolff, an author who has written several books about Trump.\n\n“Why was anti-Trump author Michael Wolff advising convicted sex offender Jeffrey Epstein?,” Rogan O’Handley, a right-wing commentator known online as DC Draino, wrote on X.\n\nO’Handley, an influencer who was also given the Epstein binders in February, echoed the White House’s claim that the document release was an attempt to “smear” Trump. O’Handley called for the release of all the Epstein files, though he failed to mention that it was Trump’s own administration who has prevented that from happening.",
  "authors": [
    "David Gilbert"
  ],
  "url": "https://www.wired.com/story/maga-wanted-epstein-files-now-theyre-ignoring-them/"
}