{
  "title": "We Could Spend ‘Eternity’ Watching This Cast Make Pizzas",
  "text": "Advertisement\n\nWe Could Spend ‘Eternity’ Watching This Cast Make Pizzas Elizabeth Olsen, Miles Teller and Da’Vine Joy Randolph came by the New York Times kitchen studio to make their ultimate pizzas. Credit... Lanna Apisukh for The New York Times\n\nWelcome to the Pizza Interview, a new series from New York Times Cooking where the Q&A has a catch: Our guests have to make pizza.\n\nThe upcoming movie “Eternity” is a romantic comedy set in an afterlife where souls have one week to decide where they want to spend, well, eternity. Elizabeth Olsen stars as Joan, a woman who has to choose whether to pass the afterlife with her husband of 50 years, Larry (Miles Teller), or her first love, Luke (Callum Turner). Da’Vine Joy Randolph plays Anna, an afterlife coordinator who helps Larry navigate a tumultuous week.\n\nWatch the full video below (or on YouTube), and read ahead for excerpts from the interview and outtakes, which have been edited and condensed.\n\nWatch the Video\n\nCredit... Victoria Chen\n\nHave you ever made a pizza before?\n\nDA’VINE JOY RANDOLPH Yes.\n\nELIZABETH OLSEN [Nods yes]\n\nMILES TELLER Does Boboli count? When I was a kid, we would do Boboli Friday.\n\nOLSEN What does that mean?\n\nTELLER Boboli is, like, this crust you would get in the supermarket, and then we would just add the tomato sauce and cheese and pepperoni.\n\nYou’ve never made it from scratch?\n\nTELLER This will be my first time.\n\nOLSEN Really? I really didn’t expect this to be your first time.\n\nTELLER Yeah, I mostly order pizza.\n\nDo you like to cook?\n\nRANDOLPH Absolutely.\n\nOLSEN Yes. So much.\n\nTELLER Yes, yes I do.\n\nWhat’s everyone cooking?\n\nRANDOLPH Everything.\n\nOLSEN I’m cooking fish all the time. And congee.\n\nTELLER I like doing a lot with baked chicken thighs — skin-on, bone-in. I think they’re often overlooked, but very juicy. And I went into a Thai phase as well, cooking-wise, where I was cooking a lot of Thai food.\n\nDo you have a favorite pizza place?\n\nTELLER John’s on Bleecker, when I’m in the city. Absolutely.\n\nOLSEN One of my favorites in Los Angeles closed down, Gorilla Pies. But I really love Bianco pizza.\n\nRANDOLPH I like Prince Street Pizza.\n\nTELLER And Angelo’s in Philly. Killer pie.\n\nGrowing up, what was your family’s pizza order?\n\nOLSEN D’Amore’s, cheese.\n\nTELLER Pizza Hut pan. Bacon, pepperoni, sliced banana peppers.\n\nVICTORIA CHEN Do you still mess with Pizza Hut?\n\nTELLER [laughs] I do, yeah.\n\nRANDOLPH It’s delicious. It’s absolutely perfect. I love it. The Veggie Supreme is good. The meat Supreme is good. Regular cheese. Extra pepperoni.\n\nOLSEN Domino’s thin crust. That’s one of my preferences.\n\nWhat’s one of your best, earliest or fondest memories of food?\n\nOLSEN My mother’s “nu-nus.” I didn’t know how to say “noodles” as a kid, so “nu-nus” is what we called them. And she would just put butter and Parmesan, like the premade Parmesan, Kraft, on them. That was my favorite thing as a little girl.\n\nTELLER I used to ask for a kitchen appliance every year for Christmas. I think one of my favorite ones was a milkshake maker. I used to love making milkshakes.\n\nHave any of you had to learn a specific cooking skill for an acting role?\n\nRANDOLPH I did, for “Holdovers.” It was something that I asked the director, to make sure that was something implemented, because I wanted to show that she actually was very talented at it. That it was a career choice as opposed to being just the help, being real.\n\nOLSEN I think I learned how to sharpen a knife on camera, but that was because I was about to stab someone with it. For a period drama — no one needs to watch it.\n\nHave any of you ever worked in the food service industry?\n\nOLSEN No, I got my real estate license.\n\nRANDOLPH Really, when?\n\nOLSEN That was my 19-year-old career job. I think I was going to be really bad at doing something with customers because I have a hard time when people are rude. I don’t really like it.\n\nTELLER I worked in a couple of restaurants. I worked at a steakhouse. I worked in a seafood joint, and they always put the new guys out on the deck. And this was in Florida, so it was like 102 degrees, just slinging tartar sauce. And then I made salads for like $8.50 an hour.\n\nIf you were a food dish, what would you be? Can you answer for each other?\n\nTELLER Lizzie would be something, like, ideally where the ingredients are fresh. It’s nourishing. It’s comforting. Something cozy and familiar.\n\nRANDOLPH Like, banana bread. See, that’s funny that you say comfy and cozy.\n\nTELLER And Da’Vine’s would be something, like, high-low. Delicious but not pretentious. And has a nice zest to it.\n\nOLSEN Like an ice cream sundae with really beautiful toppings. Like the nicest granola or like the most beautiful homemade sauce.\n\nTELLER Now do me!\n\nRANDOLPH Miles is like meatloaf.\n\nOLSEN Meatloaf or, like, a Philly cheesesteak. You talk a lot about the bread in the Philly cheesesteak.\n\nRANDOLPH Once you’ve had it, you’ll understand.\n\nTELLER Amoroso rolls.\n\nFollow New York Times Cooking on Instagram, Facebook, YouTube, TikTok and Pinterest. Get regular updates from New York Times Cooking, with recipe suggestions, cooking tips and shopping advice.",
  "authors": [
    "Victoria Chen"
  ],
  "url": "https://cooking.nytimes.com/article/eternity-cast-pizza"
}