{
  "title": "How I built a vanlife setup powerful enough for work and play",
  "text": "is a deputy editor and Verge co-founder with a passion for human-centric cities, e-bikes, and life as a digital nomad. He’s been a tech journalist for 20 years.\n\nPosts from this author will be added to your daily email digest and your homepage feed.\n\nLast year I did the thing I’d been dreaming about for a decade: I bought a van. After twenty years of tech journalism, creating a mobile test platform for remote work was just as exciting as having an adventure vehicle to pursue my outdoor hobbies. For that I’d need lots of battery capacity to power it all.\n\nOriginally I wanted to buy an EV to use as a giant rolling power plant for all the gadgets I own and get to play with as a product reviewer. Unfortunately, the charging infrastructure isn’t quite ready in the far-flung destinations where I travel, and there isn’t a good plug-in hybrid in my preferred vehicle class. So, instead I opted for a Sprinter cargo van with a fill-it-and-repair-it-anywhere diesel engine, fitted with an extra large gas tank that also fuels my cabin heater.\n\nLike most vanlifers, I won’t be living in my van year-round so it’d be silly to spend a ton of money on a power system that’s permanently installed. I want to take those expensive batteries anywhere I might need them, including my home for use in a blackout or to offset my daily energy costs. That way I can maximize the return on my money.\n\nSo, I came up with a hybrid solution that lets me easily plug portable power stations into the van to power my integrated lighting, fan, and water pump, with USB-C jacks, AC wall outlets, and 12V sockets installed exactly where I need them. I can also quickly recharge it come rain or shine, when parked at a campsite or an EV charging station. Hell, I can even turn on the charm and carry that big-ass battery into a cafe to charge when left with no other options.\n\nVerge readers have repeatedly asked me about my setup, which I now feel confident in sharing after a few iterations, 10,000 miles, and months of real-world testing. Community is a big part of vanlife as well as The Verge and this is my chance to give back a little for y’all to copy, refine, and tweak as needed.\n\nA typical selection of Victron Energy components needed for vanlife. Selecting and installing the correct components usually requires professional help. And here’s what a bespoke installation looks like after wiring everything together. It would then be hidden inside cabinets.\n\nVictron Energy\n\nMy wife and I like to take our dog far from civilization for weeks at a time, so we need a system that can be easily and quickly charged no matter what; when parked in vineyard, farm, or campsite or when driving deep down a fire road or remote beach. We still have to log in to our 9-to-5 jobs Monday through Friday and our kitchen is powered by electricity, not gas.\n\nMost van conversions in need of so much capacity and charging flexibility opt for a bespoke system built around batteries and electrical components from Victron Energy. If you’ve ever been sucked into a #vanlife hashtag, then you’ve seen the company’s myriad of signature-blue modules. Victron systems are complex but rock solid and considered state of the art for van builds. A Victron power system typically requires professional expertise to design and install.\n\nI originally requested a Victron battery system but my builder talked me out of it, citing advances in all-in-one power stations. He was absolutely right. What we came up with is a cost-effective and relatively simple design, where a power station slots into the custom electrical system wired into my living area.\n\nBut first I had to select the right kind of power station.\n\nA solar generator combined with some custom wiring allows me to place USB-C charging outlets exactly where I need them, like near my bed. Here I installed an AC wall outlet and two USB-C jacks for use when cooking or working on an outside table. An all-in-one SoGen like this one from EcoFlow replaces all those little blue Victron boxes and can be used in a home after vanlife season ends and hurricane season begins.\n\nSolar generators\n\nPower stations are some of the most expensive gadgets we cover at The Verge. You could easily spend thousands of dollars on one only to have it, like a Victron System, sitting unused for much of the year. But power stations are portable, opening up a wide range of use cases.\n\nImagine this: Instead of sitting idle, your power station is connected to a simple DIY plug-in balcony solar system that saves you a few bucks each day by feeding a modest amount of stored energy back into the home as energy prices peak. During an outage, you can still use the battery to power your fridge and other critical devices, or lug it to the beach, shed, or fishing cabin whenever the mood strikes. And when that wanderlust returns, you shut down the home and hoist the battery back into your van to power life on the road, once again.\n\nThat’s how I use power stations. But not every power station will suffice — only a subclass commonly called “solar generators,” or SoGens, can also optimize energy transfer from solar panels.\n\nA SoGen contains everything you’d otherwise have to install separately: the battery, an MPPT solar charge controller, DC-to-AC inverter, battery management system, Wi-Fi and Bluetooth radios, a display, controls, and various AC and DC inputs and outputs with protective circuitry. It’s analogous to an all-in-one iMac, whereas a bespoke electrical system built around Victron components is akin to Tom Warren’s custom gaming rig.\n\nLots of vanlifers get by on the cheap with just a SoGen and no custom wiring at all. They make do with whatever inputs and outputs it comes with and move the heavy unit around as needed to power devices or recharge its battery. In a bespoke Victron installation, all the electrical components are wired together in fixed locations out of sight, with the power outlets and controls placed in convenient locations to avoid catastrophes caused by long cables in small living spaces.\n\nMy hybrid installation is a marriage of the two: a plug-and-play electrical system for the SoGen to slot into that’s relatively easy to install and makes all those power outlets convenient to access. And because it’s brand agnostic, I can quickly drop in the latest SoGen from companies like EcoFlow, Anker, Jackery, DJI, Pecron, or Bluetti by swapping four cables.\n\nLooking through my van’s back doors, my electrical cabinet is on the left. You can see the MC4 solar connector and shore power AC outlet that plug into the SoGen. We later added wide grommets to both sides of the cabinet for more cabling flexibility. Standing in the kitchen, you can see inside the cabinet. The yellow Anderson connector on the side connects to the high-amperage DC output on the SoGen to power my 12V lighting system, USB-C jacks, etc. The black cable below it is the AC input that connects to any AC outlet on the SoGen to power all the AC outlets in the van. The AC circuit breaker to the left of the EcoFlow alternator charger. The fused DC distribution panel at the heart of my 12V electrical system. (That yellow cable has since been rerouted.)\n\nWiring\n\nIn my hybrid system, the giant SoGen never has to be moved and feeds power to all the USB-C jacks, 12V sockets, and AC outlets strategically placed around the interior. It can also be recharged without having to snake long cables through open doors and windows. It charges off the van’s alternator when the diesel motor is running, from solar panels fixed on the roof and portable folding panels placed on ground, regular wall outlets offered by farms, or shore power provided by RV parks. Many SoGen makers even offer adapter cables to charge it at an EV charging station in a pinch.\n\nLook how much simpler this hybrid configuration is next to a comparable Victron system:\n\nOn the left, my simple hybrid wiring diagram built around a SoGen. On the right, a bespoke Victron Energy implementation that does roughly the same, showing each component I’d need to install separately along with the more complicated wiring.\n\nPerhaps my favorite customization is how the solar is wired. It allows me to combine rooftop solar panels with portable panels placed on the ground to maximize charging while parked off the grid. Start driving, and the solar charge coming in from those rooftop panels can be combined with the output of the alternator charger (aka, a DC-to-DC charger) to quickly refill the SoGen’s battery. But only if the SoGen has the right specifications.\n\nBluetti puts all the USB-C ports and 12V sockets into this optional Hub D1 box. It keeps the Apex 300 SoGen small, but adds a bit of mess. This 12V/50A Anderson output powers all my 12V devices. EcoFlow adds a 12V / 30A Anderson output on the Delta Pro 3 SoGen, but the result is a bigger unit that limits placement in my van. My hybrid system is designed to work with any SoGen, you just need to connect four cables routed through either side of my electrical cabinet.\n\nSoGen Specs\n\nMy van is designed to work with SoGens from any company so long as they meet common specs found on most portable models with a 3kWh to 4kWh capacity. Here’s what to specifically look for if pursuing a hybrid setup like mine.\n\nHaving unlimited electricity by plugging into shore power at this campsite in Croatia felt like such a luxury.\n\nOne SoGen feature that’s absolutely critical is a 12V DC output of at least 30A. Most high-end portable SoGens offer this type of high-amperage DC output, but not all. It’s required to efficiently power USB gadgets like laptops, phones, drones, action cameras, and a Starlink Mini; and portable appliances like a fridge and air compressor that plug into 12V “cigarette lighter” sockets. It also delivers power to 12V devices integrated into the interior like LED lighting, a water pump, and rooftop Maxxfan that meet in a fused distribution panel — in my hybrid installation, this is located inside a cabinet over a wheel well where all my electrical wiring terminates for easy access.\n\nAnd for power-hungry AC appliances, the SoGen needs to produce about 3500W of sustained AC output to feed the handful of traditional wall outlets I’ve installed. I try to only use DC appliances since all my energy is stored in batteries. But sometimes I need to convert it to AC by turning on the SoGen’s battery-draining inverter to power a water boiler, Nespresso coffee machine, induction cooktop, Instant Pot, compact Crispi air fryer, or to charge an e-bike. I need enough headway to do about three of these things simultaneously.\n\nI consume about 1.6kWh a day on average and like to stay off the grid for a full work week — weekends are for exploring and driving to the next spot. That requires a SoGen with at least 8kWh of capacity, split across the main inverter unit and an expansion battery or two. By going modular, I can more easily manage the size and weight of each portable component which must be maneuvered into the limited space available.\n\nMy rooftop solar panels can be augmented with ground solar when parked. I plug the 400W folding panel into this bit of custom wiring for up to 820W of total solar input.\n\nMatching solar panels to your SoGen is one of the more complicated tasks you’ll have to do — Tutorials like this can help. I have three 140W rooftop solar panels installed in series so the SoGen needs to support 420W (at 72V) of input at a minimum. I can connect a 400W portable panel to the chain via an MC4 connector pair tucked under my rear bumper. That works out to just over 800W (at 120V) on a single solar input for my mix of panels — a voltage that’s too high for some SoGens to handle. Spending extra time with the planning here could avoid disappointments down the road.\n\nHere I was testing EcoFlow’s alternator charger (wired to the starter battery up front) with an older Delta Pro SoGen, prior to finalizing the installation.\n\nLastly, you’ll want an alternator charger capable of delivering more than 500W to the SoGen’s battery. Buying this charger from the same brand as your SoGen (they’re often sold in bundles) can make installation and management easier and often results in a more powerful (aka, faster) charge using a proprietary connector. Regardless, the SoGen should be able to accept charging inputs from both the solar panels and the alternator charger simultaneously for the fastest charge possible when on the move. On sunny summer days, I’m able to generate nearly 1200W — enough to bank nearly a day of off-grid power for every hour driven. I might eventually install a second alternator in my engine bay for even more dedicated charging power, but so far I haven’t needed it.\n\nI’ve recently been testing two flagship portable SoGens from EcoFlow and Bluetti. Both have advantages and disadvantages when it comes to size, solar capacity, and the way they handle 12V DC outputs.\n\nHere’s what my van looks like with EcoFlow’s Delta Pro 3 system configured with one external battery for 8kWh of capacity:\n\nEcoFlow’s Delta Pro 3 is too tall to fit under the shelf I recently had installed. That limits placement in my van. The 4kWh expansion battery is slim enough to fit just about anywhere. I can run the cables out the other side of my cabinet to stack the expansion battery on top of the main inverter unit. That gives me some extra USB-C and AC jacks in the living room to use. (Pictured before my shelf was installed.)\n\nAnd here’s what it looks like with Bluetti’s smaller Apex300 configured with two external batteries for a total of 8.3kWh of capacity:\n\nBluetti’s Apex 300 is much smaller, allowing it to fit neatly under my shelf. But that means I need two expansion batteries to meet my 8kWh capacity threshold. Bluetti offers a long cable option to connect the inverter unit to the expansion batteries. This allows for more flexible placement. That small grey box (the Hub D1) is needed to provide 50A of 12V DC output to my van. Everything stacked and turned around to show the short cables that Bluetti ships standard (and limit placement).\n\nDespite being wired into the van, the SoGen’s AC, USB, and other built-in ports are still available to power nearby gadgets and appliances. All the inputs and outputs — including those feeding my van AC and DC power — can be monitored and controlled on the built-in display or my phone over Bluetooth. Most flagship portable SoGen’s can also be connected to Wi-Fi for truly remote monitoring when I leave my Starlink running. Vendors like EcoFlow offer a dedicated display that can be centrally mounted in the van when the SoGen is in the rear garage.\n\nEcoFlow offers the option to have a dedicated wired display and control panel. It’s more convenient than launching the app to turn on / off AC and DC power or to monitor charging and battery percentage.\n\nPricing\n\nSoGens that support this hybrid setup start at roughly $3,000, but that’s before adding the expansion batteries, solar panels, alternator charger, and all the custom electrical components needed for the installation. You can expect to pay between $7,000 and $8,000 for a complete system I’ve described. You’ll also have to factor in labor if you’re not comfortable installing the electronics.\n\nThat’s not cheap, and it’s comparable to a bespoke Victron installation offering similar capabilities. But again, that Victron system is likely idle for much of the year unless you’re living in the van full-time. A SoGen can also be taken inside the home to lower utility bills, act as a UPS for critical gear, and provide relief during a blackout to provide value year round.\n\nThe heavy-duty cables that connect expansion batteries to the SoGen can severely limit placement. EcoFlow offers this long cable that increases your options..\n\nDownsides\n\nMy approach to powering vanlife with a SoGen isn’t without its downsides, but I consider these minor tradeoffs. You might feel differently.\n\nFor starters, the main SoGen unit and expansion batteries are heavy – weighing anywhere from 70 to 120 pounds (32kg to 55kg) in the 3kWh to 4kWh class I’ve been discussing. I live in a tall skinny house in the center of Amsterdam and that usually requires two people to hoist the main SoGen unit up three flights of stairs to plug into my rooftop panels. And in the event of a blackout, I have to take them down to the ground floor to be near the fridge and server closet. And while balcony solar systems are safe and increasingly popular in Europe, they’re still a no-no in the US outside of just one state: Utah.\n\nThe heavy-duty cables that connect bulky SoGens to their external batteries are thick and unwieldy thereby limiting placement in a van. Some vendors offer different lengths and connector options that allow the batteries to be stacked or placed on the ground at a variety of angles. Victron systems are comprised of many smaller components that can be easily distributed into every nook and crevice available to make better use of space.\n\nAnd unlike Victron components that are securely fastened inside the van, portable SoGens and their expansion batteries have to be tied down to prevent them from becoming projectiles in the event of a sudden stop or crash. Your vehicle may not have lashing points exactly where you need them.\n\nThe all-in-one nature of a SoGen means that if any individual component fails then the entire unit will likely have to be sent in for repair or replacement. Bespoke installations can simply swap out the failed component with a new module. This extreme modularity also makes it easier to upgrade a Victron system down the road.\n\nThe Victron ecosystem is also broad enough to provide central visibility and control over things like pumps, waste tanks, and the amount of fresh water remaining. SoGen makers like EcoFlow are making inroads here but they still have a ways to go.\n\nThe last downside only affects people like me who swap in SoGens from different companies. Sometimes I need to have adapters on hand to plug things in. This varies by brand with some preferring barrel plugs for solar and others using the more common XT60 connector. High amperage DC output is usually carried over Anderson connectors, but even those can vary.\n\nThe Best Advice\n\nThe best advice my van builder gave me when it came time to start the build was “go slow.” The summer was coming and years of research — aka, watching vanlife videos on Youtube and Instagram — made me think I knew exactly what I needed. I didn’t.\n\nFortunately, I took his advice and started with off-the-shelf products from Solo Interiors and Dutch Van Parts, alongside a basic hybrid power system. I tested it on the road, then returned to refine everything after multiple little adventures spanning a few days to a few months, covering more than 16,000km (10,000 miles) over the last year and change. My electrical system has evolved alongside my interior and exterior into what I describe above — it has served me well, so I figured I’d share. Hopefully others can benefit, myself included as I incorporate feedback.\n\nThis hybrid solution won’t fit everyone, but I think it’s a good baseline to consider for people like me with heavy-duty, off-grid power needs looking for maximum capabilities and maximum value for money without maximum complexity. I sincerely hope it helps you to live and work from places that bring joy, in that perennial human endeavor to find work life balance, no matter how you define it.\n\nPhotography by Thomas Ricker / The Verge",
  "authors": [
    "Thomas Ricker"
  ],
  "url": "https://www.theverge.com/reviews/810253/vanlife-setup-power-victron-solar-sogen-video"
}