{
  "title": "Víkingur Ólafsson: Opus 109 album review – pianist’s concept album opens up transcendent vistas",
  "text": "Disinclined to follow the herd and record Beethoven’s three final piano sonatas as a job lot, Víkingur Ólafsson has chosen to circle one of them, No 30 in E major, Op 109, locating it in a musical timeline that reflects both the composer’s past and the Viennese milieu of the early 18th century.\n\nView image in fullscreen The artwork for Opus 109. Photograph: Deutsche Grammophon\n\nFor Ólafsson, looking backwards means turning to Bach, whose musical fingerprints he detects all over late Beethoven. The latter’s uninhibited invention, he argues, has its roots firmly in the baroque with its improvisatory elements and enthusiasm for the dance.\n\nThe album opens with Bach’s E major Prelude from The Well-Tempered Clavier, Book 1 (indeed, all the works here are either in E major or E minor, keys that the Icelandic pianist, who is synaesthetic, associates with different shades of green). Notes sounded with a delicate baroque detachment carry over into a diaphanous reading of Beethoven’s Piano Sonata No 27 in E minor, Op 90, a work Ólafsson sees as a direct precursor of Op 109.\n\nA pellucid account of Bach’s final Partita provides a substantial palate cleanser, before Schubert’s rarely heard Piano Sonata No 6 in E minor – a work that in context seems indebted to Beethoven’s Op 90. The seamless slide into the long-awaited Op 109 is breathtaking. Not only does Ólafsson offer exceptional variety in his articulation here, it’s also one of the most purely beautiful accounts on record.\n\nTraditionalists may wince, but for those prepared to go along with him, Ólafsson opens up a transcendent vista on to a brave new world.\n\nAllow content provided by a third party? This article includes content hosted on embed.music.apple.com . We ask for your permission before anything is loaded, as the provider may be using cookies and other technologies. To view this content, click 'Allow and continue'. Allow and continue\n\nStream it on Apple Music (above) or on Spotify",
  "authors": [
    "Clive Paget"
  ],
  "url": "https://www.theguardian.com/music/2025/nov/20/vikingur-olafsson-opus-109-album-review-beethoven-schubert-bach"
}