{
  "title": "Amazon’s latest entry-level Kindle has fallen to a new low for Black Friday",
  "text": "is a commerce reporter for The Verge writing about the best deals and gadgets. He previously wrote for Business Insider, Rolling Stone, Futurism, and Popular Science.\n\nPosts from this author will be added to your daily email digest and your homepage feed.\n\nCarrying around a full stack of physical books isn’t practical, but an e-reader lets you take a full library with you anywhere. Thankfully, Amazon’s latest Kindle is currently on sale at Amazon, Best Buy, and Target in its ad-supported configuration for $79.99 ($30 off) or without ads for $99.99 ($30 off), which is a new low price. Amazon, Best Buy, and Target have also discounted the latest Kindle Paperwhite with ads to $124.99 ($35 off), which is only the second time it’s been available at this price. The ad-free Kindle Paperwhite is down to $144.99 ($35 off) at Amazon for the first time.\n\nAmazon’s latest Kindle is our favorite inexpensive e-reader, and it’s a solid choice if you’re just getting into e-books. It features USB-C charging and a six-inch 300ppi E-ink display, which is far less reflective than the LCD or OLED screen on your phone. It’s also outfitted with 16GB of storage — enough to hold thousands of books — and a battery that can last up to six weeks per charge. It can also store and play audiobooks if you connect a Bluetooth speaker or pair of headphones, though, be mindful that audiobooks use considerably more storage than e-books.\n\nAs for compatibility, you can purchase titles from Amazon’s digital bookstore directly on the Kindle, or buy them on another device and download them on the e-reader later. You can also sync personal documents in other file formats, including PDFs, using the Kindle app on your phone or the web. The basic Kindle doesn’t have extra features like waterproofing or physical page-turning buttons, but it’s still a great choice at its current sale price.\n\nIf you want something more fully featured, there’s the 11th-gen Paperwhite, which we’d argue is the best Kindle for most people thanks to its inclusion of several features you won’t find on the entry-level model. The first is that it sports a larger, 7-inch 300ppi display with an adjustable warm white frontlight, which lets you tint the display to make reading at night easier on your eyes. It also offers twice as much battery life as the entry-level model (six weeks vs. 12 weeks), though, like Amazon’s cheapest e-reader, it’s limited to 16GB of storage.\n\nIf you’re concerned about speed, the latest Paperwhite is about 20 percent faster than prior models, which means pages will load more quickly as you turn them. An IPX8 rating, meanwhile, can offer some additional peace of mind if you read at the beach, by the pool, or while taking a bath. It should be able to withstand up to two meters of fresh water for up to an hour, which, frankly, is more than enough protection for most folks.\n\nOther Kindle deals\n\nVerge Deals Sign up for Verge Deals to get deals on products we’ve tested sent to your inbox weekly. Email (required) Sign Up By submitting your email, you agree to our Terms and Privacy Notice . This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.",
  "authors": [
    "Brandt Ranj"
  ],
  "url": "https://www.theverge.com/gadgets/824412/amazon-kindle-paperwhite-black-friday-deal-sale-2025"
}