{
  "title": "60 Attorneys on the Year of Chaos Inside Trump’s Justice Department",
  "text": "“Our job wasn’t to engage in fact-finding investigations; our job was to find the facts that would fit the narrative.”\n\n“If we’re indicting people because the president hates them, that’s counter to the whole point of doing my job.”\n\nThe attorneys who spoke to us for this project, many of whom have spent decades in government service, disagree.\n\nAbigail Jackson, a White House spokeswoman, sent this statement: “These are nothing more than pathetic complaints lodged by anti-Trump government workers. President Trump is working on behalf of the millions of Americans who voted for him all across the country, not the D.C. bureaucrats who try to stymie the American people’s agenda at every turn.”\n\nSome spoke on the condition of anonymity because they feared retaliation against them or their new employers. We corroborated their accounts with multiple sources, interviewing their colleagues to confirm the details of what they described and reviewing court documents and contemporaneous notes. We also sent a list of questions to the Justice Department and the White House. “This story is a useless collection of recycled, debunked hearsay from disgruntled former employees,” a spokeswoman for the D.O.J. responded in an email. “Targeting the department’s political leadership while ignoring the questionable conduct of former attorneys who do not have the American people’s best interest at heart shows exactly how biased this story is, and further illustrates why Americans are turning away from biased, outdated legacy media platforms.”\n\nBeginning with Trump’s first day in office, the lawyers narrated the events that most alarmed them over the next 10 months. They described being asked to drop cases for political reasons, to find evidence for flimsy investigations and to take positions in court they thought had no legitimate basis. They also talked about the work they and their colleagues were told to abandon — investigations of terrorist plots, corruption and white-collar fraud.\n\nBut the exodus of lawyers has created an opportunity to understand what’s happening within the agency. We interviewed more than 60 attorneys who recently resigned or were fired from the Justice Department. Much of what they told us is reported here for the first time.\n\nWhat was it like inside this institution as Trump’s officials took control? It’s not an easy question to answer. Justice Department norms dictate that career attorneys, who are generally nonpartisan public servants, rarely speak to the press. And the Trump administration’s attempts to crack down on leaks have made all federal employees fearful of sharing information.\n\nPresident Trump’s second term has brought a period of turmoil and controversy unlike any in the history of the Justice Department. Trump and his appointees have blasted through the walls designed to protect the nation’s most powerful law enforcement agency from political influence; they have directed the course of criminal investigations, openly flouted ethics rules and caused a breakdown of institutional culture. To date, more than 200 career attorneys have been fired, and thousands more have resigned. (The Justice Department says many of them have been replaced.)\n\nOn his first day in office, President Trump made it clear that lawyers loyal to him would lead the Justice Department. One of his personal defense attorneys, Emil Bove, became the temporary No. 2, and Trump nominated another of his lawyers, Todd Blanche, to take the position permanently once the Senate confirmed him. Trump also undid one of the largest investigations in the Justice Department’s history by pardoning or commuting the sentences of the nearly 1,600 rioters who stormed the Capitol on Jan. 6, 2021. The group included more than 200 defendants who were convicted of assaulting law enforcement officers. Prosecutors said they were in disbelief when President Trump pardoned or commuted the sentences of Jan. 6 rioters. Ashley Gilbertson for The New York Times Ryan Crosswell, Public Integrity Section, which handles corruption cases: When I saw it was Blanche and Bove, I was actually relieved. OK, it’s gross that they were Trump’s personal attorneys, but before that they were federal prosecutors in New York. They’ve done the job. They know the prosecutors’ code. We’re the only lawyers whose job is not to get the best result for our client. Our job is to get justice. Sometimes that means losing or walking into court and saying we made a mistake. But then things were 10 times worse than I thought they would be. Liz Oyer, pardon attorney: We had no knowledge that the Jan. 6 pardons were coming on Day 1. Everybody was concerned that our office was being completely sidelined from the review process. Gregory Rosen, chief of the breach and assault unit of the Capitol Siege Section, which prosecuted the Jan. 6 rioters: When I was alerted to the pardons, a lot of thoughts ran through my head about how absurd this could get, but first I had to do my job. We had to ask, Did we believe the order was lawful and constitutional? My team and I determined that it was. The president has the right to pardon people and commute their sentences. So then it was a blitzkrieg of hundreds of cases. We stepped to it. I was numb. As career prosecutors, we don’t talk about our feelings. We’re not partisans. We’re public servants just doing the job. Early on, we stayed away from using emotional language about our own reactions. Mike Romano, Jan. 6 prosecutor: Anyone who spent any time working on Jan. 6 cases saw how violent a day that was. I’d spent four years living with that day, the things done to people. It’s incredibly demoralizing to see something you worked on for four years wiped away by a lie — I mean the idea that prosecution of the rioters was a grave national injustice. We had strong evidence against every person we prosecuted. And I knew that if they’re going to wipe all of that away based on a lie, either I’ll be fired as retaliation or pretext or asked to do something unethical. Or both. Until that point, I’d hoped the second Trump term would be similar to the first one, or similar enough for a while. Then the pardons came down and I knew, in light of that, there is no way I can stay.\n\nTrump appointed Ed Martin, another longtime ally, as interim U.S. attorney for the District of Columbia. Martin had promoted Trump’s baseless claims of election fraud in 2020 and then turned to the cause of defending the Jan. 6 rioters. He had never worked as a prosecutor. Martin soon fired 15 attorneys in the Capitol Siege Section who prosecuted the Jan. 6 defendants. They joined more than a dozen other prosecutors fired for working under the special counsel, Jack Smith, on the criminal investigations of President Trump. According to the D.O.J.’s new leadership, they could not be trusted to “faithfully implement” the president’s agenda. Gregory Rosen, Capitol Siege Section: When 15 employees were fired from the Capitol Siege Section, I was the angriest I’ve ever been. Most of them were younger attorneys. I’d hired them. They came from firms, federal and state government, all over. But some naïve part of me thought, Maybe this is the new leadership’s “pound of flesh.” Prosecutor, Capitol Siege Section: It was inconceivable to me they’d fire people for no reason except they’d worked on cases that were now disfavored. People like me, who are career attorneys, work within a structure. We don’t have much latitude. To be told that you are being punished for your decisions, when you were following guidance created by very talented and skilled prosecutors above you, which judges blessed for the most part — it’s completely bizarre. It flipped the culture of the institution. It’s a culture now of fear. And they are losing people all the time, very good people, who were the future of the department. Peter Carr, senior communications adviser: I had never seen prosecutors targeted simply because the case they brought was something that current D.O.J. leadership did not like. How can you take these very difficult and challenging cases involving high-profile individuals with the knowledge that at some point in the future, someone is going to end your career because of it?\n\nGregory Rosen, former chief of the breach and assault unit of the Capitol Siege Section “I laughed when I found out we were demoted. But it was clear to me just how truly vindictive this would get.” Gregory Rosen, former chief of the breach and assault unit of the Capitol Siege Section\n\nPam Bondi, another former Trump defense lawyer, was sworn in as attorney general. She issued a first-day flurry of 14 memos that radically redefined the department’s mission. One mandated that government attorneys “zealously defend” the president’s agenda, no longer giving them the latitude to decline to sign a brief or appear in court because of a personal judgment about a case — a longstanding practice in the department. Another pulled back on enforcing the Foreign Agents Registration Act, a watchdog law that requires people to disclose when they’re working for international powers. Pam Bondi was sworn in as the U.S. attorney general on Feb. 5 and immediately set about redefining the roles of Justice Department employees. Eric Lee for The New York Times Katie Chamblee-Ryan, Civil Rights Division: When Bondi’s 14 emails started coming in, one was crazier than the next. It’s hard to explain how shocking that was. In the Biden administration, there were all these checks in place to make sure we weren’t acting on our political biases. It was so by the book. It was too slow, to be honest. Now that seemed farcical. Lawyer, Federal Programs Branch, which defends legal challenges against government agencies: Bondi’s memo on zealous advocacy suggested we could be disciplined or fired for pushing back on legal or factual claims we believed were unsupported. That threw up red flags for me. It was just completely improper. Dena Robinson, Civil Rights Division: Some of us referred to them as “Pam Bondi’s mixtape,” both because they were so random and there were so many dropped all at once. One thing that stuck out to me was her insistence that we served at the pleasure of the president and that we were enforcing the president’s priorities. We swore an oath to uphold the Constitution. Lawyer, National Security Division: Bondi signaled the Foreign Agents Registration Act would be enforced only in very limited circumstances after the Justice Department had done a lot over the last decade to give it teeth. At its core, FARA is a transparency statute, to let the American public know when foreign actors engage in political activities or try to influence U.S. discourse. If you’re concerned about foreign money and influence in politics, it’s a bad time to go dark.\n\nIn a memo, Emil Bove, as acting deputy attorney general, directed Danielle Sassoon, the acting U.S. attorney for the Southern District of New York, to dismiss corruption charges against Mayor Eric Adams of New York City. Bove said he ordered the dismissal in part because the pending prosecution impacted Adams’s ability to “support critical, ongoing federal efforts” to enforce immigration laws. Sassoon wrote to Bondi, saying she couldn’t make a good-faith argument to dismiss the charges, asking for a meeting and offering to resign. Bondi didn’t respond. Instead, Bove took the unusual step of bringing the case to another unit, the Public Integrity Section (PIN), which is based in Washington and was created after Watergate to oversee enforcement of public corruption laws. Emil Bove in April 2024, when he was a defense lawyer for Trump. He would later be named acting deputy attorney general. Dave Sanders for The New York Times Prosecutor, U.S. attorney’s office for the Southern District of New York: The New York Times reported that Bove accepted Danielle’s resignation. That’s how we all found out. A lot of people were shellshocked and upset, and also proud, I think. My impression was that people thought the way Danielle handled it was right and admirable. Ryan Crosswell, PIN: Bove’s memo to Sassoon was such a drastic change from anything we’d ever seen. Mike Romano, Jan. 6 and PIN: Then Bove instructed the acting chief of PIN, John Keller, to dismiss the case. He resigned, effective that day. The whole staff of PIN was called into a meeting, around 25 attorneys plus support staff. John told us what happened. We were stunned. Three of the four deputy chiefs of PIN were there. (The fourth deputy chief was on maternity leave.) I recall them saying they anticipated being asked to dismiss the case, and if so, they’d resign too. John was pretty matter-of-fact and stoic. You could tell he was affected, but he was trying to be a good leader. Some people cried. Afterward, we went to a bar a couple of blocks from the office and started drinking. This is, like, 2:30 p.m. I had my one beer. I told John how much I appreciated what he’d done. I went home, and after that, the deputies were called into a meeting, asked to dismiss the case and resigned. Crosswell: On the morning of Friday, Feb. 14, we got an email for a video call with Bove at 9:45. It was intense. The camera made clicking noises as it zoomed in on Bove at the end of a long table. It was surreal. We were watching one another’s reactions onscreen. Bove’s spiel was short. He directed us to sign the motion to dismiss the Adams charges. They could have done it themselves but I believe they wanted our imprimatur. We all huddled in a conference room and tried to figure out what to do. We had an hour. There were three options. One, someone signs. Two, we all resign. Three, we call their bluff, don’t do anything and see if they fire us. I recommended Option 3. I’m still thinking we have civil service protections. But someone said if you don’t sign, they could say you’re insubordinate, and that could affect your security clearance, which could affect getting hired for other jobs. I backed off. Romano: I thought 100 percent he’d fire everyone because no one would sign. Then one of the lawyers in the section agreed to file the motion to dismiss. I didn’t know him super well. He was older, on the verge of retirement. People saw it as protecting the rest of us, not trying to advance himself. Crosswell: To my mind, he did something pretty heroic. Then there was a daylong negotiation over how the motion would be worded. It was important to us to be clear we were effectively put at gunpoint. Before, I said, I don’t want to leave because I don’t want a hack to replace me. But I started writing my resignation letter. I’m a Marine officer. Aside from how wrong it was to drop the case for political reasons, I felt so mad that our deputies had lost their jobs for protecting us. Katie Chamblee-Ryan, Civil Rights Division: What happened to PIN was an alarm blasting everywhere. That’s when I was like, They’re just going to break every rule. They don’t care. That’s when private meetings started among staff to talk about whether you have more legal protections if you resign or are fired.\n\nTrump signed an executive order initiating mass cuts to the federal work force at the direction of the Department of Government Efficiency (DOGE), the effort led by Elon Musk to slash federal spending. The order called for large-scale layoffs and directed the heads of federal agencies to fill positions only with DOGE approval. Defending the order in court, the government denied that the president had given DOGE authority over personnel actions. Judge Tanya S. Chutkan, who ultimately ruled in favor of the government, suggested this statement could be false. She reminded the Justice Department lawyers of their “duty to make truthful representations to the court” and issued a warning to them by citing Rule 11 of the Federal Rules of Civil Procedure, which allows lawyers to be disciplined for filings that aren’t based on sound facts. Elon Musk in the Oval Office in February, when his Department of Government Efficiency was tasked with slashing spending and mass layoffs of federal workers. Eric Lee for The New York Times Second Lawyer, Federal Programs Branch: When Judge Chutkan’s order came down, that was brutal. Our bar licenses would be on the line if someone associated with DOGE lied about things we had to represent in court. One of the lawyers in the case said he emailed the political leadership about what the judge said about possible sanctions and they said, “NBD” — no big deal. I realized that the line attorneys were just pawns. If we got sacrificed on the way to taking these cases to the Supreme Court, that would just be how it was. Out of 110 lawyers who were in my branch in January, more than 75 have left. (The Justice Department said the point of the “NBD” email “was to assure the team they had done nothing wrong” and that about half of the 75 lawyers who have left have been replaced.)\n\nThe Justice Department asked a court to freeze a legal challenge to the Environmental Protection Agency’s decision during the Biden administration to tighten one of its most important air-quality standards, the limit on soot. The E.P.A. found in 2021 that the new standard would save thousands of lives and that the health benefits would outweigh the cost of compliance. The Trump administration put the litigation on hold in preparation for rolling back the regulation. Sarah Buckley, Environment and Natural Resources Division: We made blanket requests to courts to put cases on hold where we were defending E.P.A. rules. The soot case was a real gut punch to me. Soot pollution is a major public health problem. The rule we were defending would reduce the number of people getting sick and dying, from pollution-caused diseases, by a lot. We’d just had oral argument in December. I thought we were going to win. It felt like victory was being snatched away.\n\nEd Martin, the interim U.S. attorney in Washington, demoted seven senior supervisors and leaders in the office. It was the latest step in the purge of career attorneys involved in prosecuting the Jan. 6 rioters as well as two Trump allies, Steve Bannon and Peter Navarro. The administration had already removed at least a dozen senior leaders from their positions across the Justice Department, giving some the choice to join the Sanctuary Cities Enforcement Working Group, which was newly formed to target jurisdictions that refused to cooperate with federal authorities on immigration enforcement. Tovah Calderon, principal deputy chief of the Appellate Section in the Civil Rights Division: They assigned me and my chief to this new working group and then essentially didn’t give us anything to do. Most of us had no experience in immigration law. They took the most experienced, talented people out of their positions, and it had an immediate effect. They were able to change the work of our offices more easily without us there. Gregory Rosen, Capitol Siege Section: I laughed when I found out we were demoted. But it was clear to me just how truly vindictive this would get. All of us collectively had over 100 years of prosecutorial experience. The brain drain was beginning. Maybe the Justice Department survives but loses all the experts. I’d been promised the position of deputy of narcotics and violent crime in D.C. But instead I was demoted to the Early Case Assessment section to review arrest warrants, among other things. While the job is important, because this is where we initiate criminal charges, I assumed Martin viewed it as entry-level work and was punishing us.\n\nEjaz Baluch, former lawyer in the Civil Rights Division “One colleague said, ‘We have to feed something to the wolves.’” Ejaz Baluch, former lawyer in the Civil Rights Division\n\nTrump-appointed leaders in the Civil Rights Division began directing career attorneys to investigate the University of California system for antisemitism and employment discrimination. These investigations were overseen by Leo Terrell, a former Democrat turned Fox News commentator selected by the president to head his multiagency task force on antisemitism. They marked a new stage in the escalating attack on college campuses by the administration, which had already canceled billions of dollars in federal grants and contracts, and opened investigations into 60 universities for what it described as a failure to protect Jewish students. Ejaz Baluch, Civil Rights Division: The way we did investigations drastically changed. Normally, line attorneys investigate cases and follow the facts and law on a nonpartisan basis. If we discovered a law was violated, we recommended a lawsuit to the leadership of the division. It was bottom up. That process turned upside down. It was outcome driven. The prime example I saw was the investigation into the U.C. school system about allegations of antisemitism on campus. In March, Andrea Lucas, who Trump appointed to be acting chair of the Equal Employment Opportunity Commission, filed what’s called a Commissioner’s Charge, which is essentially a complaint of employment discrimination. It was my section’s job to investigate it. We were told: “You have 30 days to do an investigation and give us a Justification Memo” — which is what we write after we conclude there is a legal violation. Multiple teams of attorneys went to Berkeley, U.C.L.A., U.C. Davis and U.C.S.F. Mostly they didn’t find sufficient evidence to bring suit. The teams were so scared that in real time, every day, they were summarizing and reporting up to office management, back to Michael Gates, the deputy assistant attorney general, to create a paper trail for how they were not finding evidence. Julia Quinn, Civil Rights Division: Leo Terrell, who ran the antisemitism task force, sells merch, and one of the very few people in our office who stayed behind, who got in with the administration, bought a hat, one of his “Leo 2.0” hats. He had it in the background of a Zoom. Protesters at U.C.L.A. in March after the arrest of Mahmoud Khalil, a pro-Palestinian graduate student at Columbia University. Daniel Cole/Reuters Ejaz Baluch: The only school, it became clear, where there might be a violation was U.C.L.A. One colleague said, “We have to feed something to the wolves.” The team concluded that the complaint process at the school was broken. Some professors we interviewed really did suffer on campus. They were harassed by groups of students. But the D.O.J. demand letter to U.C.L.A. asked for $1 billion in damages. We thought, $1 billion? They are making that up out of thin air. There is no way the damages we found added up to anything like that amount.\n\nTrump issued the second in a series of executive orders punishing elite law firms that had performed legal work for prominent Democrats or helped investigate the president’s ties to Russia and his efforts to overturn the 2020 election. The order accused the firm Perkins Coie of “dishonest and dangerous activity” and racial discrimination; it directed federal agencies to terminate the firm’s government contracts, stripped its employees of their security clearances and barred them from federal buildings, including courthouses. Perkins Coie and three other firms sued the Trump administration to block the executive orders, arguing that they violated the First Amendment. Dena Robinson: One of my colleagues was pulled into working on the investigations. Every single time that this colleague pointed out factual or legal or ethical issues, the people running them just shrugged. For example, the administration was saying they wanted to go after Perkins Coie because of Trump’s commitment to ending discriminatory D.E.I. policies. The idea of the investigation was that Perkins Coie supposedly engaged in illegal discrimination against white men. But Perkins Coie is an extremely white firm — only 3 percent of the partners are Black. When my colleague pointed that out, the leadership didn’t care. They’d already reached their conclusion. They continued instructing my colleague to just find the evidence for it. Our job wasn’t to engage in fact-finding investigations; our job was to find the facts that would fit the narrative that the administration already had. That is not how the division worked. My colleague told me that the experience demoralized and eventually broke them. It ended up being the reason they left the Justice Department.\n\nPIN, which in part oversaw corruption cases brought by U.S. attorneys’ offices across the country, was largely stripped of the authority to bring its own prosecutions. Most of the lawyers in the department were reassigned, eventually leaving only two, down from 38 at the beginning of Trump’s second term. Mike Romano, Jan. 6 and PIN: At the meeting where D.O.J. leadership told our managers that PIN would shrink dramatically, one of them said the administration didn’t trust lawyers in D.C. You can imagine the level of experience it takes to prosecute complex public-corruption cases. In New York, for example, the U.S. attorneys have the personnel, in size and experience, to do this. But some U.S. attorneys offices are much smaller. Maybe they don’t have anyone who has done one of these big corruption cases before. PIN was dedicated to these cases.\n\nThe acting U.S. attorney for New Jersey, Alina Habba — another former personal lawyer of Trump’s — asked to dismiss a case against two American executives charged with authorizing $2 million in bribes to obtain a construction permit in India. Trump has long disparaged the Foreign Corrupt Practices Act, which was the basis of the New Jersey case, for supposedly putting American companies at a disadvantage. The law bars any company that sells securities like stocks in the U.S. from paying bribes to foreign officials. In February, he issued an order pausing its enforcement. (Later, scaled-back enforcement resumed with a smaller team.) The Justice Department also disbanded the team that prosecuted foreign officials for public corruption in their countries based on money-laundering in the U.S. — a team that recovered hundreds of millions of dollars stolen from poor countries. Alexis Loeb, Money Laundering and Asset Recovery Section and later deputy chief of the Capitol Siege Section: There was a whole series of signals that the administration would de-emphasize the prosecution of corruption. Our laws gave American companies cover so they could resist shakedowns to pay bribes, and it’s way too black-and-white to say they create an uneven playing field. The laws were often used to prosecute foreign companies and individuals. People across the political spectrum saw promoting the rule of law abroad as important for promoting American interests and national security. You could see these ideals fall away quickly in the moves the administration made. Prosecutor, Fraud Section: We were ensuring that anyone who used U.S. banking or our stock markets was complying with the law. I would meet with my foreign counterparts abroad, and they’d say this is a good form of American exceptionalism. It really did change compliance globally. I don’t think anyone expected a full pause. It was so sweeping. And we were hearing all these reports of lobbying to affect how individual cases were being handled, at Mar-a-Lago and elsewhere. When the New Jersey case was dismissed on the eve of trial, that showed how much we weren’t in normal times anymore.\n\nHarmeet K. Dhillon, a civil liberties lawyer who has represented several conservative activists and helped Trump challenge the 2020 election results, was sworn in as the head of the Civil Rights Division, which has a long history of redressing discrimination. Dena Robinson, Civil Rights Division: Harmeet Dhillon didn’t seem to have any interest in interacting with career staff. We knew what she was saying on radio and podcast appearances about how the career staff didn’t want to do any of the work of the administration and that we needed to be cleared out. Lawyer, Federal Coordination and Compliance section, Civil Rights Division: People had sound machines at their desks because they were convinced that everyone and everything was listening to us. It really was psychological warfare. Julia Quinn, Civil Rights Division: Leadership started dismissing racial-discrimination cases. They wanted us to include language that suggested the cases had been brought under an illegitimate theory of discrimination. Jen Swedish, deputy chief of the Employment Litigation Section, Civil Rights Division: To demand lawyers put language in filings suggesting that we had filed a frivolous lawsuit — we thought that was unethical. We worried about our bar licenses. Brian McEntire, Civil Rights Division: My goal was always to become an attorney in the Civil Rights Division. That was my dream. I ended up working a lot on fire department cases. In Cobb County, Ga., we got information that even though African Americans and whites were applying for positions at about an equal rate over the previous decade, 90 percent of the hires had been white and 10 percent had been African American. And we didn’t quite understand why that was. So we did an investigation and found out that there was a credit check that was disproportionately knocking out African Americans, particularly for student loan debt. And when we asked them why they were doing that, their response was essentially, Well, if a firefighter is deeply in debt and he’s fighting a fire, he might steal grandma’s pearls. So we brought suit. In February, we got a note saying that the attorney general wanted us to withdraw the case. The next day, division leadership insisted that we put additional language in the notice of dismissal that implied it was all about reverse discrimination. I didn’t know, quite frankly, if I could sign it. If I have to say what I argued before was illegal, then I could have been accused of misleading the court, which could have ended up with me being disciplined, sanctioned and my bar license revoked. So I did not sign it. My colleagues didn’t sign it. They pulled us all into a room, and we were all prepared to get fired because none of us were going to sign. My boss signed a modified version of the notice of withdrawal on our behalf. We also had a racial-discrimination case involving the sole African American attorney working for the Mississippi State Senate, who, during the years she worked there, was paid less than half of what her similarly situated white colleagues were making. It was as clear-cut a case of disparate racial treatment you could find. The Senate stalled the case until Trump’s appointees could come in and order our section to drop it. When you talk about the rule of law and treating people fairly and equally, that’s obviously a slap in the face.\n\nLiz Oyer, former pardon attorney “My recommendation was sought, I believe, to give a veneer of legitimacy to what was actually a political favor for a friend of the president.” Liz Oyer, former pardon attorney\n\nLiz Oyer, the former pardon attorney at the Justice Department, testified before Congress about the circumstances of her firing. Oyer lost her job after she refused to recommend restoring gun rights to the actor Mel Gibson, who had a misdemeanor conviction for domestic violence. The Justice Department said the disagreement over Gibson was unrelated to the decision to fire Oyer. Liz Oyer, pardon attorney: In February, I was assigned to a working group that the attorney general created to restore gun rights to people convicted of crimes. I was asked to identify suitable recipients, so I looked for people who had committed minor low-level offenses in the very distant past and demonstrated exemplary conduct in the community for many years since their conviction. The pool was narrowed to nine people. And then I was asked to add Mel Gibson to the list. Mel Gibson has a history of domestic violence, and I’m well aware from my experience and training that it is very dangerous for a person with a domestic-violence history to possess a firearm. As attorney general, Bondi has the power to restore rights without my blessing. My recommendation was sought, I believe, to give a veneer of legitimacy to what was actually a political favor for a friend of the president. I said I couldn’t recommend restoration. And then I waited for the other shoe to drop. I finally got a phone call from Paul Perkins, an associate deputy attorney general. It was strongly suggested to me that Mel Gibson is someone who had a personal relationship with the president and that really should be all I needed to know. I felt sick. I literally did not sleep at all that night. I wrote back still not making the recommendation. At 2 o’clock that afternoon, I was in a meeting when I learned that I was fired. My deputy told me to grab my bag and literally pulled me out of the room by my elbow and told me in the hallway that she had gotten a call saying that there were security officers in my office waiting to walk me out of the building. I threw everything into a grocery bag and walked out of the office. I passed a lot of people I knew on the way out, and everybody was just looking on in shock. Todd Blanche, the deputy attorney general, issued a statement saying that I was lying about the circumstances leading up to my firing. Then I was invited by the Democrats on the Judiciary Committee to testify in front of Congress. The administration sent armed U.S. Marshals to my home to deliver a letter warning me about testifying. A career employee who was still at the department helped me get it called off before they got to my house, where my teenager was home alone. I felt the purpose was to intimidate me. And I think it was intended to send a message to other department employees, too, who might be thinking about speaking up. I needed a lawyer. I spent the entire weekend calling all of the lawyers that I know at law firms around D.C. Everybody I talked to was saying: “Thank you so much for what you’re doing. We’ll do whatever we can behind the scenes to support you.” But nobody actually wanted to sit behind me at a congressional hearing. Nobody wanted to put their name on a letter to Todd Blanche. Unfortunately, only Democrats attended the hearing. There were no Republicans. It has really perplexed me that there’s not a shared level of bipartisan concern about what’s happening inside the Department of Justice.\n\nA senior lawyer in the Office of Immigration Litigation, Erez Reuveni, acknowledged in court that the Trump administration wrongfully deported Kilmar Abrego Garcia, a Salvadoran construction worker who lived in Maryland for a dozen years, to El Salvador, where he was being held in a notorious maximum-security prison. In previous administrations, including Trump’s first term, the government routinely worked to get people back when they were deported without legal authority. In this case, however, Bondi put Reuveni on leave and then fired him. Jennifer Vasquez Sura, the wife of Kilmar Abrego Garcia, who was wrongly deported to a prison in El Salvador in March. Ken Cedeno/Reuters David McConnell, director of the Office of Immigration Litigation: Erez was one of the more aggressive litigators over the years. He vigorously defended Trump 1 policies. I thought he’d be the go-to person for defending them in the second term. When he got fired, everyone doing district court work thought, This could happen to me. Traditionally, we didn’t have a lot of turnover in the office. But now I’ve heard that around 60 out of 320 attorneys have left since February. Sarah Buckley, Environment and Natural Resources Division: When Erez Reuveni got fired, that really affected morale. He was working under the gun with his clients to say, This isn’t a reasonable way to proceed in court — what’s a reasonable way? And they punished him for it. Ryan Crosswell, PIN: To do our job, you have to be willing to do the right thing when no one is watching. If prosecutors are just going into court to win at all costs, think of all the other things taking place you’ll never know about.\n\nSarah Buckley, former lawyer in the Environment and Natural Resources Division “He was working under the gun with his clients to say, This isn’t a reasonable way to proceed in court — what’s a reasonable way? And they punished him for it.” Sarah Buckley, former lawyer in the Environment and Natural Resources Division\n\nThe Associated Press obtained an internal memo sent by Harmeet Dhillon, the Trump-appointed head of the Civil Rights Division, instructing voting-rights lawyers to focus on investigating voter fraud and to “vigorously enforce” a Trump executive order transforming how elections are run. The order purported to institute new voter-ID requirements, grant DOGE access to voter data and change the rules of absentee voting and the counting of absentee ballots. Courts later blocked parts of the order. Anna Baldwin, Civil Rights Division: When the president issued his executive order related to voting, the Civil Rights Division was initially charged with defending it. But many provisions of it were an unlawful power grab — under our Constitution, Congress and the states set the rules of elections, not the president. Lawyer, Voting Section, Civil Rights Division: The Trump administration had already made us dismiss our Georgia statewide lawsuit for intentionally suppressing Black votes. They didn’t ask for any information about it. They just told us to dismiss it. Then they issued a press release condemning the Biden administration for bringing the lawsuit — accusing us, the line attorneys, of fabricating evidence. It was obvious they didn’t look at the memo explaining what the evidence was. Election workers in Atlanta processing absentee ballots for the November 2020 election. Nicole Craine for The New York Times Lawyer, Housing Section, Civil Rights Division: I was detailed to work in the Voting Section enforcing the National Voter Registration Act, which says states have an obligation to make sure that their voter rolls are accurate. We were tasked with obtaining states’ voter rolls, by suing them if necessary. Leadership said they had a DOGE person who could go through all the data and compare it to the Department of Homeland Security data and Social Security data. The idea was, We want to identify undocumented immigrants that have registered to vote. There was no pre-existing evidence this is a problem. I had a concern that the data would be used not for purging voter rolls of people who aren’t eligible to vote but for broader immigration enforcement. I had never before told an opposing party, Hey, I want this information and I’m saying I want it for this reason, but I actually know it’s going to be used for these other reasons. That was dishonest. It felt like a perversion of the role of the Civil Rights Division.\n\nA memo from F.B.I. officials ordered field offices to devote one-third of their time to immigration enforcement — which meant scaling back investigations related to national security, corporate fraud and violent crime. Gregory Rosen, Capitol Siege Section: The F.B.I. had to divest serious resources from investigations of violent crime, gun and drug trafficking and child exploitation. Agents were diverted from those cases because they had to be on the street doing immigration roundups. Prosecutor, D.C. metro area: It’s unprecedented to shift resources away from national security to this degree. Virginia and D.C. have the most important offices for counterterrorism and espionage. We get cases from the Middle East, long and complex investigations of terrorist threats from abroad and also domestically. In the Eastern District, there were 12 to 14 lawyers in the national security unit and now there are four, with no deputy or chief. In D.C., the national security unit is down about 50 percent. I was recently on the floor where F.B.I. agents work on domestic terrorism and it was completely hollowed out. You have to have good, experienced, trained people doing this work on a daily basis. If you don’t, because you demand they do immigration shifts, there is real danger to national security and public safety. Prosecutor, Ohio: We’re in northern Ohio. We don’t have an immigration problem here, but our agents — I.R.S. and Secret Service and Bureau of Alcohol, Tobacco, Firearms and Explosives — were getting detailed to Homeland Security. I was getting frustrated. We have a certain amount of time to bring charges, and often we don’t find out right away when a business is committing fraud, so we may lose a year or two. Then it takes time to do these investigations. Agents have to get the records and do the interviews. We don’t have time if they’re riding around trying to hit daily immigration quotas.\n\nThe Trump Justice Department withdrew from a consent decree with Minneapolis intended to address a pattern of racially discriminatory policing and excessive use of force, based on a D.O.J. investigation in the aftermath of the 2020 murder of George Floyd. The Justice Department also refused to stand by the factual findings about police abuses in Minneapolis and five other cities, retracting them from the record. Police officers confronting protesters in Minneapolis in May 2020, following the death of George Floyd. John Minchillo/Associated Press Katie Chamblee-Ryan, Civil Rights Division: I’d left D.O.J. by then. I found out when I started getting a million texts. People were saying, “I’m sorry.” At first I had no idea what they meant. I expected something bad, but it was so much more total and cruel than I imagined. The new leadership was erasing our work. Withdrawing the findings was completely unprecedented. And if you read the Minneapolis findings and the remedies we negotiated with the city, you’ll see they document retaliation against journalists or civilians who film the police, the use of weapons or tear gas indiscriminately in a crowd or law enforcement agents hiding their identities. And we’re seeing federal agents do all those things now. There was a statement from the Justice Department in court saying you can’t do these things. They took that statement away, and now the federal government is the most prominent violator.\n\nTrump pardoned a series of white-collar offenders, including Charles Scott, who had been convicted last year in Ohio of ​​helping the chief executive of his company manipulate its stock value. Prosecutor, Ohio: Scott was sentenced to 42 months for a multimillion-dollar fraud. His family was wealthy. He spent all of two weeks in jail. That put a damper on a lot of the work we were doing, to know that someone who defrauded everyday folks in Ohio was able to find their way to a pardon. Afterward, defense attorneys are telling us they can’t get their clients to take good or reasonable plea offers because they felt they’re better off spending their money on a political donation, drawing Trump’s attention, and getting the case dismissed or going to trial and getting a pardon. Alexis Loeb, Money Laundering and Asset Recovery Section: When prosecutors bring a new case, do they need to think about how the Trump administration views the defendant? Those are not the kinds of considerations prosecutors are taught they should pay attention to — very much the opposite.\n\nThe Justice Department subpoenaed more than 20 doctors and hospitals that provide gender-related care to minors (including puberty suppressants, hormone therapy and surgeries) accusing them of having “mutilated children in the service of a warped ideology.” Trump had already issued a series of executive orders dismantling protections for trans people, banning them from military service and allowing open discrimination by federal workplaces. The subpoenas demanded patient information protected by privacy law. Barbara Schwabauer, Civil Rights Division: It’s one thing to say we’re no longer going to stand up for trans people in this administration, we’re not going to file briefs in support of them. But to affirmatively go after them? I could not in good conscience continue to be a part of that. These are teenagers. Lawyer, Federal Coordination and Compliance section, Civil Rights Division: Under the Biden administration, the Justice Department had joined private plaintiffs in suing Alabama over its ban on gender-affirming care. Now attorneys on the case were told by leadership to produce, on a rolling basis, all communication that they had with all parties and each other. It felt like we were being investigated by our own office. It was very threatening and ominous. Like, what do we think they’re going to do with that information? Nothing good.\n\nBondi fired around 20 prosecutors and support staffers who worked on the special counsel Jack Smith’s investigations into Trump’s efforts to overturn the 2020 presidential election and his refusal to return classified documents after leaving office. One of the lawyers fired that day was Joseph Tirrell, the department’s top ethics adviser. Peter Carr, senior communications adviser: These were support staffers, you know, the people who helped us with managing the operations of the office or with travel arrangements and reimbursements. You have paralegals who help prepare documents for discovery. The idea that someone can be terminated from the Justice Department for a case they were assigned to work on is something that has never happened before. Joseph Tirrell, director of the Departmental Ethics Office: I had done some work for Jack Smith, so I assumed that would bring some heat down on me. But in my gut, I also think they didn’t want the ethics office calling them up and telling them what to do. As a federal employee, you’re restricted from accepting gifts from anyone because of your position. I briefed Ms. Bondi about the ethics rules, and we talked about accepting gifts from employees in the department — for the most part, leaders can’t accept gifts from their subordinates. We had about a 10-minute conversation about whether or not she could accept challenge coins from offices within the department. And that seemed to me an odd thing given everything else that we might have discussed. But that started to be a recurring theme with the A.G.’s office. They didn’t want to return gifts, they didn’t want to not accept gifts, whatever the source. We got a request about some cigars from Conor McGregor and a soccer ball from FIFA. And I felt like I really had to go to the mattress to convince the A.G.’s office: You can pay for the item or you can return the item or you can throw the item away. There’s no other way to do this. (A Justice Department spokeswoman said that, after consulting with ethics officials, the soccer ball was accepted on behalf of the department and the cigars were destroyed.) And then I got a call from the general counsel at the F.B.I. about changing exceptions to the gift rules because his boss, Kash Patel, felt like he should be able to accept more expensive gifts. I reminded him that his client was not Mr. Patel, but the United States.\n\nTrump demanded the prosecution of several of his perceived political enemies, including the former F.B.I. director James Comey and New York’s attorney general, Letitia James. Based on the results of investigations by career prosecutors, Erik Siebert, the interim U.S. attorney for the Eastern District of Virginia, told senior Justice Department officials that he did not think there was sufficient evidence to indict Comey or James. Siebert was forced to resign under pressure from Trump, who then installed one of his attorneys, Lindsey Halligan, an insurance lawyer who had never prosecuted a case before. With no career attorneys agreeing to handle the case, Halligan personally asked a grand jury to indict Comey on charges related to allegations that he made a false statement to Congress. Halligan later obtained an indictment of James for mortgage fraud. Comey and James pleaded not guilty. Mike Romano, Jan. 6 and PIN: No one should be charged with a crime because the president says “Do this,” and the people he has installed do what he says. The decision should be in the hands of people who know the evidence and have experience evaluating it and working criminal cases. If I was in that office, I’d wonder what the point is of exercising my professional judgment. If we’re indicting people because the president hates them, that’s counter to the whole point of doing my job. Prosecutor, D.C. metro area: The thing is, Erik bragged about how close he was with Trump’s former lawyers at D.O.J. But it didn’t save him. We all knew Erik said no, and the career attorneys recommended against it. So for Halligan to go ahead was enraging. The Eastern District of Virginia has a long reputation of being very proficient and competent, and it all vanished. This is the whole problem with the White House directing criminal investigations. This is what you get. We won’t get the benefit of credibility from judges that we had, and I’m even more concerned about juries. I really fear the Justice Department — which has a good record of convicting dangerous, violent people — won’t see the same success rate, because people will think it’s not on the level. Ryan Crosswell, PIN: The Eastern District of Virginia handles some of the biggest espionage and counterterrorism cases. Now it’s being led by someone who doesn’t know what she is doing.\n\nThe Times reported that Trump demanded $230 million in compensation for being prosecuted following his first term. Bondi and Blanche, Trump’s former lawyers, could decide whether Trump receives the money. (Asked about the $230 million demand, a spokesman for Trump’s personal legal team emailed, “President Trump continues to fight back against all Democrat-led Witch Hunts, including the ‘Russia, Russia, Russia’ hoax and the un-Constitutional and un-American weaponization of our justice system by Crooked Joe Biden and his handlers.”) Bondi testifying at a hearing for the Senate Judiciary Committee in October. Jonathan Ernst/Reuters Mike Romano, Jan. 6 and PIN: It seems comically corrupt. First, there was nothing inappropriate about this prosecution. Second, he won the presidency, so how was he harmed to the tune of $230 million? And third, he has appointed the people tasked with deciding whether he gets the money, and we’ve seen that his appointees do what he wants. It’s as if he’s robbing the Treasury to pay himself. Prosecutor, D.C. metro area: It shows the president has no regard for ethics or rules or the appearance of impropriety or any of the guardrails we used to have before. It feels like this should be criminal, but he’s acting as if he has immunity, which he does, from the Supreme Court. The Mar-a-Lago case was buttoned up. They begged him to give them the documents so it wouldn’t rise to the level of the F.B.I. going in to get them. To say there’s abuse here — it’s absurd.",
  "authors": [
    "Emily Bazelon",
    "Rachel Poser"
  ],
  "url": "https://www.nytimes.com/interactive/2025/11/16/magazine/trump-justice-department-staff-attorneys.html"
}