{
  "title": "Kim Kardashian's Fake Bush Thong Befuddles Us All",
  "text": "Curiosity got the best of me when I clicked on the link to Kim Kardashian’s new Skims release – a $32 micro thong with faux pubic hair. I wasn’t even very surprised at first glance given the shock value of other recent products from the line. I just thought it was camp — perhaps a genius publicity stunt released just in time for the upcoming Halloween season.\n\nThen I realized, in complete shock, the garment (available in 12 different shades) had sold out. My peers were authentically willing to buy the product, apparently, to participate in the growing “full bush” trend, especially now that Kim K had brought it mainstream. And I can attest, the Bush on Main movement is real, and it is perplexing.\n\nThis is the same Kim K that has been vocal for over a decade on her full body laser hair removal because she deemed face and body hair didn’t make her feel confident. Last year, the billionaire even tried to sell her fans an at-home laser hair removal system for Ulike so they can feel just like her.\n\nAdvertisement\n\nAll in all: I’m no expert but I‘m pretty sure Kim doesn’t have a bush.\n\nNetizens were quick to weigh in on the new merkin thongs. One commenter on TikTok said “we have bush at home” or “my culture is not her costume,” although the latter pertains to so many for-profit Kardashian style choices that I can’t even give it much thought.\n\nBut I have been on an emotional journey, laughing to despondent as I process what’s happening here. It’s clear that this is another instance of consumerism leveraging what could be an impactful cultural moment and disguising it as empowerment.\n\nIn the U.S., the rise of body hair growth began during the Flower Power era in the ’60s as a cultural rejection of unrealistic beauty ideals. This was widely embraced until the ’90s where the accessibility of brazilian waxes and laser hair removal pushed a smooth and bare narrative to women in order to be accepted by society. This was, of course, the same demographic that was championing the gaunt heroin chic culture at the time.\n\nAdvertisement\n\nAs someone who was a hairy, Latina middle schooler in the early 2000s, any excess body hair was seen as unkept and dirty. I saw young shaved Disney Channel stars in Tiger Beat or celebrities being berated for their hairy arms on the cover of People. I used to beg my Cuban mother to let me shave my legs for PE, and she would dismiss me with a crinkle in between her eyebrows ― I was too young.\n\nEven though I was an upset sixth grader, I realize how lucky I was that my mom never taught me or my younger sister that body hair made you less than a woman. Instead, she showed us how to embrace our bushy eyebrows and how to groom for personal comfort versus society’s standards of acceptance.\n\nSince Charli XCX blessed us with Brat Girl Summer, women have been even more comfortable embracing their body hair (and bushes) showcasing their hair growth journeys on social media. Comedian influencer, Grant Gibbs, has even made it a series on TikTok where he coined Full Bush Culture as the aforementioned “bush on main”, a reaction to women freely posting their pubic hair on social media.\n\nAdvertisement\n\nThis rise in counterculture is a response to the aggressive and unrealistic beauty standards set for women and femmes, as well as a lack of body autonomy that many of us are feeling particularly hard right now during this administration.\n\nThis new faux pubic hair micro thong is just another example of an unrealistic expectation based on skewed, misogynistic standards. We’ve seen the rise of GLP1s to get thinner — but you can’t get too skinny. We’re in a Bob Era where women are pushed into tradwife haircuts only to be told their face card declined the cut.\n\nAnd now, women who were told they were gross or unhygienic (in many cases, by other women) for freeing the bush are now being presented with the option of a $32 bush that quite frankly, they can grow for free at home.\n\nAdvertisement\n\nThe team at SKIMS appear to have leveraged this moment of hairy empowerment to make a profit. But the truth is, women are treated like GoldiCrotch without the “just right” moment: It’s always too much or too little.\n\nOne question to leave you with: Who exactly is this product for? Perhaps someone who, until this point, shunned a homegrown bush? If you’re confused about this underwear, just remember it’s a natural part of hyper capitalism to create a “problem” that doesn’t need a solution — one that leaves us eagerly waiting for body validation from a celebrity or influencer. This time, it’s disguised as feminism.\n\nUltimately, whether you decide to participate in it or not is up to you. But in the famous words of Cardi B, “It’s giving itchy.”",
  "authors": [
    "Contributing Writer"
  ],
  "url": "https://www.huffpost.com/entry/skims-kim-kardashian-faux-bush-thong-feminism_n_68f10415e4b017d85b7436ec"
}