{
  "title": "A eureka moment in a town called Eureka: Curran Hatleberg’s best photograph",
  "text": "In 2013, I’d been living in New York for a long time. The social life was vibrant but I had never figured out a way to make pictures there. So when a friend sent me details of a teaching position in Eureka, California, I jumped at the chance. When I arrived, I found Northern California to be a confounding and beautiful place, one that inspired a new body of work almost immediately.\n\nEureka was the first time I’d stayed so long in one place. During those months, I saw the same people day after day. I taught two days a week at the local community college and the rest of the time I was free to walk around – exploring, meeting people and taking photographs. I was entirely focused on my work, almost like a residency.\n\nNorthern California is a rugged place that feels like the far-flung edge of the world. I lived in this old house on top of a hill where people rented furnished rooms. You could see the Pacific ocean and the redwoods from the upstairs windows and people came and went without announcement. The entire time, I had this feeling that I could disappear and no one would notice. I would get that feeling from others too. A lot of the people I met in Eureka were on the run, either from their own lives, or from a country they thought had let them down. Humboldt County has a mythic presence; it remains a mystery that I don’t think I ever solved.\n\nThe camera has an amazing ability to elevate the mess of the everyday into coherence and harmony\n\nSome of the relationships I photographed in my book Lost Coast were five minutes long and others stretched out over months. There’s no shortcut when you take someone’s photograph. If I’m interested in someone, I walk right up to them with my camera and tell them what my work is about. That direct line of communication either opens the floodgates or shuts them down immediately. There has to be trust and mutual curiosity, otherwise it just doesn’t work. It’s my hope that the people I meet are getting as much from me as I am from them, and it’s that collaboration, the trust, and the shared vulnerability that make the work interesting to me.\n\nPhotographing is a lot of waiting – for people or mood or the weather or the perfect backdrop. Waiting for the miracle to arrive. This picture highlights that interplay of chance, intuition and patience. I had visited this location numerous times without ever finding a picture there. I knew someone who lived nearby, and on this particular afternoon I had returned, hoping to find them. Instead, I turned the corner and saw this: a dusty alley lined with daisies, a few redheads, a handful of puppies, and a woman with a gas can, the whole scene lit up by blinding sun.\n\nThat’s the miracle, when everything comes together, with me there to catch the whole thing. Those moments are so rare, and they disappear as quickly as they come. Like this picture, my favourite photographs tend to be open-ended. I want the pictures to ask more questions than they answer. I want the viewer to actively participate in the formation of narrative and meaning. In the end, the camera has an amazing ability to elevate the chaos and mess of the everyday world into coherence and harmony, to make even the mundane feel transcendent.\n\nView image in fullscreen Photographer Curran Hatleberg\n\nCurran Hatleberg’s CV\n\nBorn: Washington DC, 1982\n\nHigh point: “Showing at the Whitney Biennial.”\n\nTop tip: “Forget about inspiration, dedication is what sustains an artistic practice.”",
  "authors": [
    "Chris Broughton"
  ],
  "url": "https://www.theguardian.com/artanddesign/2025/nov/19/curran-hatleberg-best-photograph-lost-coast-eureka-california"
}