{
  "title": "From the runway to the wild: Celebrities are already stepping out in clothes designers want you to wear next spring",
  "text": "The Spring-Summer 2026 collections, shown across the main fashion capitals of New York, London, Milan and Paris during September and October, marked a season of significant change as a number of high-profile designers made their debuts at big brands. While many of those designs are not yet available for general purchase or widespread red-carpet wear, they’ve already been spotted in the wild — worn by an exclusive few.\n\nGetting their clothes on famous individuals is important for brands. “In some cases, it’s because the brands have employed these people as ambassadors, so they’re on payroll,” said Booth Moore, a veteran editor and author of books including “American Runway,” pointing to the actor Greta Lee, who was recently named as a global face for Dior and has attended several high-profile events wearing the brand’s latest designs. “In other cases, it’s people who are highly visible because they have a show or film to promote, like Sarah Paulson who has been wearing Balenciaga. Sometimes, it’s just a one-off, like we’ve seen with Michelle Obama, who is arguably one of the most visible women in the world.”\n\nOnly a few years ago, the red carpet was representative of fashion’s production schedule, with celebrities wearing runway looks around the time that the collections arrived in stores. These moments played a key part in motivating shoppers to buy — even if it is a more affordable lipstick or perfume. That pipeline has now shrunk to reflect shorter attention spans: what was shown on the catwalk a mere month ago can now be seen at movie premieres, film festivals, awards ceremonies, talk shows, galas, and other glitzy celebrity events, which seem to be multiplying in abundance.\n\nSome fashion designers, including Dario Vitale of Versace, have sped things up even further by showing their designs on the red carpet even before they hit the catwalk. “There are a record number of brands trying to change their image at the same time,” said Moore. “They’re in races against each other, and their reliance on Hollywood as a promotional machine has increased so much in recent years, that there’s this kind-of feeding frenzy to reach the right people, and to get to them first.”\n\nIndeed, the competition is now heated among stylists to outdo each other, as they vie for the approval of online commentators and the media’s best-dressed lists. For some, there is kudos in reviving an archival or vintage design, but for many others, being the first to wear something still translates to access, status, and trend-setting power. And while celebrities have typically worn custom designs to the biggest red carpet events, any occasion now seems to be fair game.\n\nSee the latest catwalk looks — and who wore them where — below.\n\nFormer US first lady Michelle Obama, who has been on a tour to promote her new book, \"The Look,\" wore a dress from designers Jack McCollough and Lazaro Hernandez's debut for the Spanish house Loewe. Courtesy Loewe\n\nFirst worn on a model at Paris Fashion Week, the draped dress was selected for Obama by stylist Meredith Koop and its graphic color reflects the \"optimistic spirit\" of Loewe, according to the brand. Shutterstock\n\nObama also wore the first look from designer Matthieu Blazy’s debut Spring 2026 Chanel collection. She made the suit her own by wearing the blazer open (on the runway it was buttoned up). Stephen Lovekin/Shutterstock\n\nObama also wore a pair of white pompom earrings, the kind worn by the models during the Chanel show. Courtesy Chanel\n\nActor Ayo Edebiri was named as a global ambassador for Chanel in the run-up to Matthieu Blazy's debut for the brand in October. David Fisher/Shutterstock\n\nAs Edibiri attended the London premiere for her latest film, \"After the Hunt,\" she wore a silk chiffon gown from Chanel's Spring 2026 collection. Vittorio Zunino Celotto/Getty Images\n\nOn the red carpet, Jennifer Lawrence is often dressed in Dior (she has been a brand ambassador since 2012) and was one of the first to wear the designs by the brand's new creative director, Jonathan Anderson. Daniele Venturelli/WireImage/Getty Images\n\nLawrence wore look 56 from Dior's Spring 2026 collection to the Rome Film Festival in October, and a custom off-the-shoulder Dior gown to the New York premiere of her new film, “Die My Love,” this month. Peter White/Getty Images\n\nThe actor Greta Lee has also been wearing Anderson's designs for Dior, for which she became an ambassador for in September. Jerritt Clark/Getty Images\n\nLee wore look 55 from the Spring 2026 collection as she walked the runway for Vogue World: Hollywood 2025. David Fisher/Shutterstock\n\nIn October, Lee attended the premiere of Disney's \"Tron: Ares\" in Hollywood, California wearing another design from Anderson's debut Dior collection. Axelle/Bauer-Griffin/FilmMagic/Getty Images\n\nThe sheer structured dress Lee wore was look 6 from Dior's Spring 2026 runway show. David Fisher/Shutterstock\n\nSinger Olivia Dean wore a dress from Versace's Spring 2026 collection that had been shortened for her performance on the US late-night show, \"Saturday Night Live.\" Will Heath/NBC/Getty Images\n\nThe look worn by Dean was first shown at Milan Fashion Week on Versace's Spring 2026 runway, designer Dario Vitale's first for the brand. Courtesy Versace\n\nAmidst her \"Virgin\" tour, Lorde made a surprise appearance at the 2025 LACMA Art+Film Gala in Los Angeles. Chelsea Lauren/Shutterstock\n\nThe outfit worn was from Versace's Spring 2026 collection, though the singer opted for a longer, floor-skimming skirt. Courtesy Versace\n\nActor Elle Fanning attended the 2025 Academy Museum Gala in Los Angeles wearing a look from Balenciaga's Spring 2026 runway. Mario Anzuoni/Reuters\n\nThe brand's Spring 2026 collection, shown at Paris Fashion Week, was the first to be designed by new creative director Pierpaolo Piccioli. Shutterstock\n\nActor Naomi Watts also opted for a Spring 2026 Balenciaga look as she attended the 2025 Academy Museum Gala. Amy Sussman/Getty Images\n\nUnlike the Balenciaga model who wore the feathered dress with flat green shoes, Watts styled hers with classic black heels. Giovanni Giannoni/WWD/Getty Images\n\nBalenciaga was also actor Sarah Paulson's brand of choice at the world premiere of \"All's Fair\" in Rio de Janeiro, Brazil. Wagner Meier/Getty Images\n\nStyled by Karla Welch, Paulson wore look 50 — a white top with a high crop and a voluminous green skirt — from the Spring 2026 runway. Giovanni Giannoni/WWD/Getty Images\n\nActor Cate Blanchett embraced the feathers trend of the Spring 2026 season and attended the ceremony for the German media award Bambi wearing Stella McCartney. Michaela Stache/AFP/Getty Images\n\nThe look from Stella McCartney's Spring 2026 runway is made from a plant-based material that imitates the look of feathers. Pascal Le Segretain/Getty Images\n\nActor Cynthia Erivo attended the 16th Governors Awards in Hollywood, California wearing look 50 from Givenchy's Spring 2026 collection. Amy Sussman/Getty Images\n\nGivenchy's Spring 2026 runway marked designer Sarah Burton's sophomore outing for the French luxury label. Ik Aldama/Courtesy Givenchy\n\nModel Kaia Gerber attended the 2025 Academy Museum Gala wearing a custom Givenchy floor-length gown designed by Sarah Burton. Amy Sussman/Getty Images\n\nThere were dresses made from the same lace fabric, though shorter in length, in the brand's Spring 2026 collection. Ik Aldama/Courtesy Givenchy\n\nSimilarly, Michelle Yeoh's Balenciaga dress, which she was photographed in outside the Paris Opera, was a custom piece. Pierre Suu/GC Images/Getty Images",
  "authors": [
    "Kati Chitrakorn"
  ],
  "url": "https://www.cnn.com/2025/11/19/style/celebrities-spring-summer-2026-fashion"
}