{
  "title": "How Should I Store Potatoes?",
  "text": "Advertisement\n\nHow Should I Store Potatoes? They’re an anchor of the Thanksgiving table — here’s how to buy them, then keep them for as long as possible. Storing potatoes in a well-ventilated basket in a cool, dark place keeps them fresher longer. Credit... Kate Sears for The New York Times\n\nPotatoes might present as one of the burlier types of produce — prepared the right way, they can certainly be dense in nutrients — but there are a few things we can inadvertently do at home to hasten their demise.\n\nRead on for what to look for in a sack of potatoes, and how (and where) to store them, so they’ll be there when you need them.\n\nLook for: Very firm flesh with no nicks, sprouts or green skin.\n\nStore: No, your potatoes shouldn’t go in the fridge. The cold turns their starches into sugar. Instead, keep them in a well-ventilated basket in a cool, dark place, away from onions. (They’ll be bad influences on each other: Onions emit ethylene gases, which can speed up the ripening and spoiling process.)\n\nSo many ways to prepare your potatoes on New York Times Cooking\n\nAli Slagle’s Greek lemon potatoes. Credit... Andrew Purcell for The New York Times. Food Sylist: Barrett Washburne.\n\nTry not to bang them around on the way home from the store — despite their reputation, they bruise easily. Lastly, don’t wash them before storing as lingering moisture can encourage bacterial growth and decay. Kept properly, they typically last about two weeks in a dark pantry at room temperature before they start to sprout (to them, warmth means spring), and a good month or more in a cooler (45 to 50 degrees) basement or garage.\n\nHow can you tell if a potato is problematic? Look out for greening skin. That hue comes from exposure to sun or artificial light, and indicates a higher presence of solanine, which, in large amounts, can be toxic. Wrinkled skin is a sign of deterioration, too, as are potatoes riddled with sprouts (a few are just fine). Heed any funky scents or brown liquid pooling below the basket and remove the culprits right away.\n\nMake the most of it: Compost or deeply peel any with green skins, but other kinds of sprouts or unsavory bits can be trimmed away with a paring knife, as long as the rest of the potato is firm. Repurpose potato cooking water in yeast breads and the gravy and stuffing at Thanksgiving.\n\nHow to Keep Fruits and Vegetables Fresher, Longer\n\nBuy local. Shop at farmers’ markets or C.S.A.s when you can — the produce will be the freshest and least-traveled, and, in boom seasons, cheaper.\n\nShop strategically at the grocery store. Notice where and how produce is stored — in the refrigerated cases or room temperature bins — so you can follow suit at home. If the front row looks suspect, aim for the back, where the newer goods are cycled in.\n\nKeep frozen fruits and vegetables on hand. Knowing you can fall back on them can keep you from buying more fresh produce than you’ll realistically eat, recommends Dana Gunders, author of “Waste-Free Kitchen Handbook” and president of the food waste nonprofit ReFED.\n\nDo what works for you. Though most produce is technically suited for the humidity-controlled crispers at the bottom of the fridge, “I don’t necessarily subscribe to that idea, because out of sight is out of mind,” said Helene Henderson, chef and founder of Malibu Farm restaurants. (If you opt for higher shelves or door pockets for perishables, the crispers can instead be used for jars of mustard and pickles that will survive if you forget about them.)\n\nFollow New York Times Cooking on Instagram, Facebook, YouTube, TikTok and Pinterest. Get regular updates from New York Times Cooking, with recipe suggestions, cooking tips and shopping advice.",
  "authors": [
    "Kristen Miglore"
  ],
  "url": "https://cooking.nytimes.com/article/how-to-store-potatoes"
}