{
  "title": "Blind date: ‘She friend-zoned me over text before the night was through’",
  "text": "Alex on Rachel\n\nWhat were you hoping for?\n\nA good plotline, a fun evening and the chance of a connection.\n\nFirst impressions?\n\nShe looked glamorous but seemed a bit nervous. I felt a bit underdressed in the fancy hotel – she told me she’d changed outfit when she saw how nice the place was.\n\nWhat did you talk about?\n\nSoul music, ACL [anterior cruciate ligament] injuries, academic misconduct, techno, star signs (ours were incompatible).\n\nMost awkward moment?\n\nWhen we said we were with the Guardian the waiter thought we meant we were with our legal guardian.\n\nQ&A Fancy a blind date? Show Blind date is Saturday’s dating column: every week, two strangers are paired up for dinner and drinks, and then spill the beans to us, answering a set of questions. This runs, with a photograph we take of each dater before the date, in Saturday magazine (in the UK) and online at theguardian.com every Saturday. It’s been running since 2009 – you can read all about how we put it together here.\n\n\n\nWhat questions will I be asked?\n\nWe ask about age, location, occupation, hobbies, interests and the type of person you are looking to meet. If you do not think these questions cover everything you would like to know, tell us what’s on your mind. Can I choose who I match with?\n\nNo, it’s a blind date! But we do ask you a bit about your interests, preferences, etc – the more you tell us, the better the match is likely to be. Can I pick the photograph?\n\nNo, but don't worry: we'll choose the nicest ones. What personal details will appear?\n\nYour first name, job and age. How should I answer?\n\nHonestly but respectfully. Be mindful of how it will read to your date, and that Blind date reaches a large audience, in print and online. Will I see the other person’s answers?\n\nNo. We may edit yours and theirs for a range of reasons, including length, and we may ask you for more details. Will you find me The One?\n\nWe’ll try! Marriage! Babies! Can I do it in my home town?\n\nOnly if it’s in the UK. Many of our applicants live in London, but we would love to hear from people living elsewhere. How to apply\n\nEmail blind.date@theguardian.com Was this helpful? Thank you for your feedback.\n\nGood table manners?\n\nExcellent.\n\nBest thing about Rachel?\n\nShe was a great listener and super curious.\n\nWould you introduce Rachel to your friends?\n\nFor sure.\n\nDescribe Rachel in three words\n\nKind, curious and intelligent.\n\nWhat do you think Rachel made of you?\n\nShe said the main thing she was looking for was someone who wasn’t a dick. And she said I wasn’t, so that’s a win, I guess?\n\nDid you go on somewhere?\n\nOnly from the hotel restaurant to the hotel bar.\n\nAnd … did you kiss?\n\nWe did not – we had two hugs. She’d friend-zoned me over text before the night was through!\n\nIf you could change one thing about the evening what would it be?\n\nIdeally the date would have been at the weekend – the free cocktails made for a rough time at work the next day.\n\nMarks out of 10?\n\n8.\n\nWould you meet again?\n\nAs friends.\n\nView image in fullscreen Alex and Rachel on their date\n\nRachel on Alex\n\nWhat were you hoping for?\n\nA fun change from the monotony of dating apps … and hopefully a plus-one for wedding season.\n\nFirst impressions?\n\nHis confidence immediately put me at ease – and the flowing locks, of course.\n\nWhat did you talk about?\n\nGrowing up in the East Midlands, what we’re reading, the takeover of AI … Alex even checked our star sign compatibility, although it was not very favourable so we quickly moved on.\n\nMost awkward moment?\n\nWhen the waiter poured our wine he asked if Alex wanted to down his in one – neither of us knew if it was a joke.\n\nGood table manners?\n\nOf course – no faults.\n\nBest thing about Alex?\n\nHe is so easy to talk to.\n\nWould you introduce Alex to your friends?\n\nYes.\n\nDescribe Alex in three words\n\nCharismatic, intelligent and authentic.\n\nWhat do you think Alex made of you?\n\nSomeone who is overly paranoid about getting something stuck in their teeth – and hopefully good company.\n\nDid you go on somewhere?\n\nWe had a couple of cocktails.\n\nDid you kiss?\n\nNope.\n\nIf you could change one thing about the evening what would it be?\n\nI’d have preferred a more flirty vibe.\n\nMarks out of 10?\n\n7.5.\n\nWould you meet again?\n\nYes, but as friends.\n\nAlex and Rachel ate at The Parlour, Great Scotland Yard Hotel, London SW1. Fancy a blind date? Email blind.date@theguardian.com",
  "authors": [],
  "url": "https://www.theguardian.com/lifeandstyle/2025/nov/15/blind-date-alex-rachel"
}