{
  "title": "Tim Cook Discusses The Past, Present, and Future of Apple",
  "text": "Transcript\n\nIt's hard to imagine life without Apple,\n\nbecause my life has been wrapped up in this company,\n\nas you've mentioned, since 1998.\n\nThis is a long time.\n\nIt's the overwhelming majority of my adult life,\n\nand so I love it.\n\nI'm Steven Levy.\n\nToday we sat down with Apple CEO Tim Cook\n\nto discuss the company's past, present, and future.\n\nThis is The Big Interview.\n\nThank you for doing The Big Interview, Tim.\n\nThank you for being here, Steven.\n\nIt's always great to talk to you.\n\nYeah, well it's great to be at Apple Park.\n\nI'm looking this backdrop.\n\nI remember you gave me a tour of this place.\n\nYeah.\n\nBefore people moved in.\n\nAnd what about this place, working in here,\n\nand having your people in here\n\nis either unexpected or striking.\n\nIt's promoted collaboration even more than I thought.\n\nAnd that was a key component of the design, as you know.\n\nBut there's so many places in here\n\nthat you unexpectedly run into people.\n\nYou do it at the cafeteria, you do it at the coffee bar,\n\nyou do it outside when you're going across the pathway.\n\nAnd I think that promotes this unplanned collaboration.\n\nAnd I think it's fantastic.\n\nAlso, there's a connection here to Steve.\n\nYou know, of course we have the theater named after him,\n\nand think about him all the time.\n\nBut I can feel him in other spaces in here.\n\nHe had a perspective that the venue\n\nthat you worked in was so important to the work,\n\nand I think that he's been proven right.\n\nYou mentioned the theater.\n\nWill you do product launches now?\n\nYou do pre-tapes,\n\nor are you ever gonna see live launches\n\nin the Steve Jobs theater again like we used to?\n\nMaybe.\n\nThe thing that we learned during COVID was,\n\nyou know, the audience is primarily an online audience.\n\nVery few people can fit in the theater,\n\nand we wanted to have more people engaged\n\nin the announcements itself.\n\nAnd you can do\n\nthat a lot more productively on tape than you can in live,\n\nbecause of the transitions on the stage and so forth.\n\nBut you don't miss the vibe.\n\nI do miss it. I do miss it.\n\nI get it when the WWDC is here, and we announced the film\n\nand feel the love from the developers is fantastic.\n\nI heard something interesting recently that Stevie Wonder\n\nhad a demo of the Vision Pro and loved it.\n\nHow's that work?\n\nHe's a friend of Apple.\n\nIt's great to get feedback from Stevie,\n\nand of course his artistry is just unparalleled.\n\nHe's so fantastic.\n\nBut accessibility was always important\n\nfor us from designing all of our products,\n\nas you know, that's one of the common threads\n\nthrough Apple over time,\n\nis that we don't bolt on accessibility at the end\n\nof the design process, it's embedded in the design process.\n\nAnd so getting that feedback was key.\n\nSo I wanna look back a little bit\n\nthrough your time here.\n\nYou've been here a long time.\n\nYou got here in 1998.\n\nThat's right.\n\nThere had already been eras of Apple.\n\nThere had been the Apple II era.\n\nThe Mac, the diaspora era where Steve was gone.\n\nYou were a compact.\n\nDid you think that at any point watching\n\nwhat was going on that Apple was just not gonna make it?\n\nYou know, I probably thought that\n\nbefore talking to Steve.\n\nAt that time,\n\nif you remember Michael Dell had said if he was the CEO,\n\nhe would shut Apple down.\n\nAnd just return whatever assets were\n\nleft to the shareholders.\n\nAnd Michael just said what most everyone else thought.\n\nBut I have to say, when I came out to talk\n\nto Steve about working at Apple, it felt\n\nso alive and so different.\n\nHe was somebody\n\nthat was the most unusual CEO I'd ever met.\n\nHe was passionate about the product, passionate about Apple,\n\npassionate about its reason for being its purpose.\n\nAnd I thought, I've gotta do this.\n\nI want to do this.\n\nAnd from that point, I never thought\n\nthat Apple would be going out of business.\n\nAnd other people did,\n\nand other people advised me, why are you doing this?\n\nYou're leaving the world's largest personal computer company\n\nand going to one that may not survive.\n\nBut I didn't feel that way at that point\n\nafter talking to Steve.\n\nSo while you're here in your collaboration with Steve,\n\nyou know, Apple came out with, you know.\n\nThese great design products, the iMac,\n\nthen the iPod era, which was so exciting.\n\nThat's right.\n\nThere were so many different versions\n\nof iPods, then of course the iPhone.\n\nYes.\n\nLooking back, what did you do that was smart\n\nthat you really didn't think was going to be\n\nso impactful in making that product a success?\n\nWell, I think each product that you named sort\n\nof had its place in history.\n\nThe iMac revived Apple, it kind\n\nof proved Apple could survive.\n\nThe iPod giving people 1,000 songs in the pocket,\n\nsomething very unexpected,\n\nand solving a pain point that all of us had\n\nthat loved music.\n\nIt began to introduce people to more people,\n\nparticularly in the developed markets.\n\nAnd the decision to port to Windows proved\n\nthat Apple could come out with a product\n\nthat was larger than the Mac community.\n\nAnd then iPhone built on everything\n\nthat came before it.\n\nAnd with the great work\n\nfrom the technology team on multi-touch,\n\nit gave you a totally different way\n\nof interfacing with the product.\n\nAnd then what iPhone did looking back, was introduce people\n\nto Apple in the emerging markets.\n\nGoing out and forming all\n\nof these carry relationships was very important\n\nto introducing Apple more broadly\n\nand sort of turning the industry on its side\n\nand owning the design.\n\nBecause at that time, if you remember,\n\nthe carrier was owning the design of the phone,\n\nwas sort of directing it.\n\nAnd we said, no no, what we bring is the product skill.\n\nAnd what they brought was the networking skill.\n\nAnd we didn't have the networking skill\n\nand frankly they didn't have the product skill.\n\nAnd so this combination was very powerful.\n\nAnd the rest is history.\n\nWell, we're beginning maybe a new era of history now\n\nwith AI.\n\nApple Intelligence.\n\nI mean, do you think this is something\n\nthat is gonna wind up reinventing the company\n\nand reinventing the world?\n\nAre you on the cusp of that?\n\nI do. I think it's profound.\n\nI think just like multi-touch enabled iPhone\n\nand eventually iPad, and the modern smartphone,\n\nand the modern tablet, AI will reinvent\n\nand it provide a new era and a new chapter for iPhone\n\nand iPad, and the Mac, and all of our products over time.\n\nBecause I think it changes the way you interface\n\nwith the products.\n\nI get so much out of Apple Intelligence,\n\nand we're just at the beginning.\n\nSo Siri is one thing that's being revitalized here.\n\nI'm wondering, are we going\n\nto eventually have this relationship with Siri\n\nthat'll be our constant companion\n\nand we'll do, for instance,\n\neverything we might wanna do in search, instead of going\n\nto Google, we'll just ask Siri.\n\nWe'll see.\n\nBut I think, I use Siri a lot now.\n\nI'm a power user of Siri,\n\nand so I'm some of the billion five requests\n\nthat Siri gets every day.\n\nSo I already have a relationship with Siri,\n\nbut I think more people will,\n\nbecause Siri will become more personally relevant\n\nand be able to take task off your plate\n\nthat you don't have to do.\n\nAnd sort of a multi-step kind of approach\n\nthat you saw some of the demos do.\n\nSo I couldn't be more excited about the future of Siri.\n\nYou are the CEO.\n\nYou've been here for a while.\n\nHow long do you see yourself continuing this role?\n\nOh, I don't know.\n\nI get asked\n\nthat question now more than I used to.\n\nWhy is that?\n\nAs I age, as my hair turns gray,\n\nI love this place, Steven.\n\nI love it.\n\nAnd I love the people I work with.\n\nIt's a privilege of a lifetime to be here.\n\nAnd I'll do it\n\nuntil the voice in my head says it's time.\n\nAnd then I'll go and focus on\n\nwhat the next chapter looks like.\n\nMy life has been wrapped up in this company,\n\nas you mentioned, since 1998.\n\nThis is a long time.\n\nIt's the overwhelming majority of my adult life.\n\nAnd so it's tough to envision life without Apple.\n\nSo one more question.\n\nWhen we were all talking about the tour\n\nand things like that, I was also doing a story\n\nabout the Infinite Loop, One Infinite Loop.\n\nThat which used to be the Apple's headquarters.\n\nThat's right.\n\nAnd you told me\n\nthat you didn't move into Steve's office.\n\nI didn't.\n\nAfter he died, it was preserved.\n\nYes.\n\nAnd that sometimes you would go in there.\n\n[Tim] Yes.\n\nAnd get inspired by being in the surroundings.\n\n[Tim] Yes.\n\nDo you still do that?\n\nIs that office still preserved?\n\nI still do that. The office is still preserved.\n\nNo one's ever moved in there.\n\nAnd that's been since 2011 as you know.\n\nMost of what we do is forward looking.\n\nBut I like my connection back to Steve,\n\nand I like the company's connection back to Steve,\n\nbecause from him emanates our values and our DNA.\n\nSo I think that connection's important.\n\nSo Tim, thank you so much for doing The Big Interview.\n\nYeah, thank you.\n\nIt's so great to spend time with you.\n\nAs always.\n\nI'll bump into you in Palo Alto again.\n\nAlright. Yeah, in a few days.\n\nIn a few days.\n\nOkay. Thank you.\n\nAlright.\n\n[uplifting music]",
  "authors": [
    "Condé Nast"
  ],
  "url": "https://www.wired.com/video/watch/big-interview-tim-cook"
}