{
  "title": "La NASA publica las primeras imágenes del cometa 3I/ATLAS mientras pasa cerca de Marte",
  "text": "CNN —\n\nLas últimas imágenes de un cometa interestelar compartidas por la NASA han captado cómo una serie de naves espaciales presenciaron un sobrevuelo verdaderamente de otro mundo, y revelaron pistas sobre la composición del objeto.\n\nLos astrónomos detectaron por primera vez el raro cometa, conocido como 3I/ATLAS, el 1 de julio. Es solo el tercer objeto interestelar (ISO, por sus siglas en inglés) observado que se origina fuera de nuestro sistema solar y pasa a través de él.\n\nCuando el cometa interestelar pasó cerca del planeta rojo en octubre, varias misiones de la NASA modificaron sus exploraciones para capturar imágenes fascinantes del objeto originado fuera de nuestro sistema solar.\n\nLas imágenes apiladas de 3I/ATLAS, tomadas por la nave espacial Observatorio de Relaciones Solar-Terrestres, muestran que se desplazaba a una velocidad de 200.000 kilómetros por hora en septiembre. NASA/Observatorio Lowell/Qicheng Zhang\n\nLa Agencia Espacial Estadounidense publicó las nuevas observaciones el miércoles, ya que no había podido compartirlas durante el cierre del Gobierno.\n\nAunque ninguna de las naves espaciales tiene cámaras perfectamente diseñadas para detectar cometas que pasan a velocidades de hasta aproximadamente 153.000 millas por hora (246.000 kilómetros por hora), los astrónomos no querían perder lo que podría ser una oportunidad única en la vida.\n\n“Es un poco como si nuestras naves espaciales de la NASA estuvieran en un partido de béisbol, viéndolo desde distintos puntos del estadio”, dijo Tom Statler, científico principal de cuerpos menores del sistema solar en la NASA. “Todos tienen una cámara e intentan captar la pelota, pero nadie tiene una vista perfecta y cada uno tiene una cámara diferente”.\n\nLa nave espacial Lucy captó un tenue halo de gas y polvo alrededor del cometa el 16 de septiembre. NASA/Goddard/SwRI/JHU-APL\n\nLas misiones capturan imágenes de un raro cometa interestelar\n\nAntes del sobrevuelo de Marte en septiembre, las naves espaciales Lucy y Psyche, en ruta para estudiar asteroides, y misiones centradas en el Sol como la sonda solar Parker, SOHO y PUNCH también captaron imágenes del cometa en acción.\n\nEl telescopio 3I/ATLAS aparece como una tenue mancha contra un fondo de estrellas desde la perspectiva del rover Perseverance el 4 de octubre. NASA/JPL-Caltech/ASU/MSSS\n\nEl orbitador de reconocimiento de Marte y el rover Perseverance siguieron la trayectoria del cometa mientras pasaba velozmente junto al planeta rojo en octubre.\n\nSegún Statler, el cometa alcanzó su punto más cercano al Sol cuando la Tierra no estaba en el lado adecuado para que los telescopios terrestres lo observaran con facilidad, pero Marte ofrecía condiciones óptimas de observación. “Nuestros instrumentos en Marte pudieron observar el cometa, y varias de nuestras otras naves espaciales también se encontraban en el lado correcto del Sol”, afirmó.\n\nDos naves espaciales que estudiarán Júpiter y sus Lunas, Europa Clipper y el Explorador de las Lunas Heladas de Júpiter de la Agencia Espacial Europea, o Juice, también tendrán como objetivo captar los movimientos del cometa a medida que se acerque a la órbita de Júpiter en primavera.\n\nEl cometa se acercó a unos 29 millones de kilómetros de Marte el 3 de octubre. El orbitador ExoMars Trace Gas Orbiter de la Agencia Espacial Europea (ESA, por sus siglas en inglés), que orbita el planeta rojo desde 2016, se encontraba aproximadamente diez veces más cerca del cometa que los telescopios terrestres, y capturó imágenes desde un ángulo inaccesible para estos últimos. Esta nueva perspectiva del 3I/ATLAS permitió a los científicos predecir la trayectoria futura del cometa con una precisión diez veces mayor.\n\nUna multitud de otras naves espaciales, incluidos los telescopios espaciales Hubble y James Webb, también han observado el objeto.\n\nSi bien los científicos han estado utilizando telescopios de todo el mundo para estudiar 3I/ATLAS, las misiones de naves espaciales ofrecen algunas ventajas de observación clave, dijo el Dr. Theodore Kareta, astrónomo planetario y profesor asistente en el departamento de astrofísica y ciencias planetarias de la Universidad de Villanova en Pensilvania.\n\nPsyche rastreó el cometa 3I/ATLAS durante ocho horas, entre el 8 y el 9 de septiembre, cuando el cometa se encontraba a unos 53 millones de kilómetros de la nave espacial. NASA/JPL-Caltech/ASU\n\nSegún explicó, las cámaras e instrumentos de las distintas naves espaciales están orientados a diversos objetivos y mediciones, y pueden proporcionar puntos de vista distintos que de otro modo serían imposibles de capturar.\n\n“Los cometas son objetos tridimensionales, y observarlos desde diferentes ángulos nos dará una imagen mucho más clara no solo de dónde están y la trayectoria que siguen, sino también del tamaño del núcleo del cometa y la naturaleza de cualquier estructura o patrón que podamos ver en su atmósfera”, dijo Kareta.\n\nComparación del cometa 3I/ATLAS con cometas más comunes\n\nUn cometa originado en nuestro sistema solar es como una bola de nieve sucia. Su núcleo, o centro sólido, es una mezcla congelada de roca, gas, polvo y hielo, restos de la formación de las estrellas, los planetas y otros cuerpos celestes. A medida que los cometas se acercan a estrellas como nuestro Sol, se calientan, formando colas de material sublimado que dejan una estela tras ellos.\n\nEl orbitador MAVEN captó el cometa en luz ultravioleta, detectando sus átomos de hidrógeno el 28 de septiembre. NASA/Goddard/LASP/CU Boulder\n\nDebido a que 3I/ATLAS proviene de otro sistema solar, los astrónomos están ansiosos por ver cuán diferente o similar es su composición a la de los cometas que están acostumbrados a observar.\n\n“Los cometas frecuentemente muestran ‘chorros’ o características ‘espirales’ en sus atmósferas internas relacionadas con qué partes de sus superficies están activas y liberan gas y polvo, por lo que tomar una fotografía de ellos desde un solo ángulo puede ser difícil de interpretar”, agregó Kareta.\n\nEl cometa alcanzó su punto más cercano al Sol el 30 de octubre, a tan solo 210 millones de kilómetros, según la NASA.\n\nAhora, el objeto comienza a reaparecer al otro lado de nuestra estrella para los telescopios terrestres. El 19 de diciembre, el cometa pasará a 270 millones de kilómetros de la Tierra antes de comenzar su viaje fuera de nuestro sistema solar.\n\nLa misión SOHO avistó el cometa entre el 15 y el 16 de octubre. Observatorio Lowell/Qicheng Zhang\n\n“El hecho de que tantas misiones de la NASA hayan intentado observar a este visitante interestelar demuestra la seriedad con la que todos nos tomamos esta oportunidad”, dijo Kareta. “Los objetos interestelares como 3I/ATLAS son fundamentalmente raros, y los ISO tan brillantes como 3I deberían ser aún más raros; este objeto bien podría ser el ISO del que más aprendamos en los próximos años”.",
  "authors": [
    "Ashley Strickland"
  ],
  "url": "https://cnnespanol.cnn.com/2025/11/19/ciencia/nasa-imagenes-cometa-interestelar-marte-trax"
}