{
  "title": "AirPods’ best features come to Android and Linux with free app",
  "text": "is a senior reporter who’s been covering and reviewing the latest gadgets and tech since 2006, but has loved all things electronic since he was a kid.\n\nPosts from this author will be added to your daily email digest and your homepage feed.\n\nYou no longer need an iPhone to get the most out of AirPods. Apple’s AirPods provide a basic listening experience when paired to non-Apple devices, but the free LibrePods app, developed by Kavish Devar, unlocks features like ear detection, head gestures, and customizations on Android and Linux devices, as spotted by Android Authority.\n\nLibrePods was created by reverse engineering the AirPods’ proprietary protocols, and it works by making the wireless headphones think they’re connected to an Apple device so they share device status info that’s typically only made accessible to Apple’s various operating systems. Other features LibrePods unlock includes conversational awareness that will lower the volume while you’re speaking, switching between noise control modes, accurate battery level info, customizations like accessibility settings and renaming your headphones, hearing aid mode, and multi-device connectivity.\n\nThe LibrePods app unlocks a lot of AirPods customizability. Image: Kavish Devar\n\nDevar says LibrePods should work with all AirPods models, and while you’ll get full functionality when using it with the AirPods Max and the most recent versions of the AirPods Pro, the AirPods Pro 3’s heart rate monitoring isn’t supported.\n\nHowever, getting LibrePods up and running on your Android phone isn’t as easy as just installing the app. Devar says that “due to a bug in the Android Bluetooth stack” LibrePods will currently only work on rooted Android phones that have the Xposed framework installed. If you have a OnePlus or Oppo device running ColorOS or OxygenOS 16, you can install and use LibrePods without rooting, but you won’t have access to some features like customizing the transparency mode until you do.",
  "authors": [
    "Andrew Liszewski"
  ],
  "url": "https://www.theverge.com/news/824953/librepods-apple-airpods-wireless-headphones-android-linux"
}