{
  "title": "Sentinel-6B launched to extend record of sea-level rise",
  "text": "The latest guardian of our oceans has taken its place in orbit. The Copernicus Sentinel-6B satellite is now circling Earth, ready to continue a decades-long mission to track the height of the planet’s seas – a key measure of climate change.\n\nLike its predecessor, Sentinel-6 Michael Freilich, Sentinel-6B carries the latest radar altimetry technology to further extend the sea-surface height record that began in the early 1990s. These measurements help scientists understand sea-level rise – crucial information for shaping climate policy and protecting the millions of people living in coastal areas around the world.\n\nSentinel-6B launched today, 17 November, at 06:21 CET aboard SpaceX Falcon 9 rocket from Vandenberg Space Force Base in California. The satellite was delivered into orbit just under an hour after liftoff, and at 07:54 CET ESA’s European Space Operations Centre in Germany received the all-important signal via the Inuvik ground station in Canada, indicating that Sentinel-6B is alive and well\n\nSentinel-6B is set to carry forward the legacy of Sentinel-6 Michael Freilich, launched in November 2020. The Sentinel-6 mission serves as the world’s primary reference mission for satellite sea-surface height measurements. The continuous record of observations began in the early 1990s with the French–US Topex-Poseidon satellite and continued with the Jason series of satellite missions.\n\nWith sea-level rise high on the global agenda, numerous organisations have worked to make Copernicus Sentinel-6 the gold-standard reference mission for extending the record of sea-surface height measurements – delivering data with greater precision than ever before.\n\nAlthough part of the European Union’s family of Copernicus missions, Sentinel-6 is the product of exceptional international cooperation, involving the European Commission, ESA, NASA, Eumetsat, and NOAA, with additional support from the French space agency CNES.\n\nESA’s Director of Earth Observation Programmes, Simonetta Cheli, said, “Collaboration between partners is key to a mission such as Sentinel-6, and my thanks go to everyone involved in developing, launching and operating this exceptional satellite, which follows in the footsteps of the first Sentinel-6, Michael Freilich.\n\n“This achievement demonstrates what can be accomplished when international agencies and industries work together toward a shared goal. Sentinel-6B will ensure that we continue to collect the high-precision data needed to understand our changing climate, safeguard our oceans and support decisions that protect coastal communities around the world.”\n\nAs well as mapping the height of the sea surface to understand long-term change, Copernicus Sentinel-6 also provides data for practical ‘operational’ applications. For example, the mission measures significant wave height and wind speed, data that are used for near-real time ocean forecasting. In fact, satellite altimetry provides the most comprehensive ocean sea-state measurements available today.\n\nThe Sentinel-6 satellites carry an altimeter that works by measuring the time it takes for radar pulses to travel to Earth’s surface and back again to the satellite. Combined with precise satellite location data, altimetry measurements yield the height of the sea surface.\n\nThe satellites’ instrument package also includes an advanced microwave radiometer provided by NASA. Water vapour in the atmosphere affects the speed of the altimeter’s radar pulses – and therefore estimates of sea-surface height. The advanced microwave radiometer accounts for this water vapour to ensure that measurements are accurate.\n\nSentinel-6B is now under the care of ESA’s mission control in Germany, where the team is taking the satellite through its ‘Launch and Early Orbit Phase’. Once this has been completed, control of the satellite will be handed over to Eumetsat.\n\nRelated Articles\n\nhttps://www.esa.int/Enabling_Support/Operations/Rehearsing_for_Sentinel-6B_s_early_days_in_space\n\nhttps://www.esa.int/Applications/Observing_the_Earth/Copernicus/Sentinel-6/Sea-level_monitoring_satellite_unboxed\n\nhttps://www.esa.int/Applications/Observing_the_Earth/Copernicus/Sentinel-6/Sea-level_monitoring_satellite_Sentinel-6B_sets_sail\n\nFurther information\n\nESA - Sentinel-6\n\nSentinel-6 Mission Kit\n\nSENTINEL-6_factsheet_251105.pdf\n\nESA - Observing the Earth\n\nImages\n\nSentinel-6 images\n\nCopernicus Sentinel-6: measuring sea levels from space\n\nCopernicus Image of the Day\n\nESA's Photo Library for Professionals:\n\nhttps://photolibrary.esa.int/home-page/\n\nTerms and conditions for using ESA images\n\nFor questions or more information related to ESA images, please contact directly spaceinimages@esa.int\n\nVideos\n\nSentinel-6 videos\n\nESA's Video Library for Professionals:\n\nhttps://www.esa.int/ESA_Multimedia/Videos\n\nTerms and conditions for using ESA videos\n\nFor questions or more information related to ESA videos, please contact directly spaceinvideos@esa.int\n\nSocial media\n\nFollow ESA on:\n\nX: @esa @ESA_EO\n\nBluesky: @esa\n\nFacebook: @EuropeanSpaceAgency\n\nInstagram: @europeanspaceagency ESA_Earth\n\nYouTube: ESA\n\nLinkedIn: European Space Agency - ESA\n\nPinterest: European Space Agency - ESA\n\nAbout the European Space Agency\n\nThe European Space Agency (ESA) provides Europe’s gateway to space.\n\nESA is an intergovernmental organisation, created in 1975, with the mission to shape the development of Europe’s space capability and ensure that investment in space delivers benefits to the citizens of Europe and the world.\n\nESA has 23 Member States: Austria, Belgium, the Czech Republic, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Ireland, Italy, Luxembourg, the Netherlands, Norway, Poland, Portugal, Romania, Slovenia, Spain, Sweden, Switzerland and the United Kingdom. Latvia, Lithuania and Slovakia are Associate Members.\n\nESA has established formal cooperation with four Member States of the EU. Canada takes part in some ESA programmes under a Cooperation Agreement.\n\nBy coordinating the financial and intellectual resources of its members, ESA can undertake programmes and activities far beyond the scope of any single European country. It is working in particular with the EU on implementing the Galileo and Copernicus programmes as well as with Eumetsat for the development of meteorological missions.\n\nLearn more about ESA at www.esa.int.",
  "authors": [],
  "url": "https://www.esa.int/Newsroom/Press_Releases/Sentinel-6B_launched_to_extend_record_of_sea-level_rise"
}