{
  "title": "Fátima Bosch, representante de México, gana Miss Universo 2025",
  "text": "CNN —\n\nLa mexicana Fátima Bosch ganó el certamen de belleza Miss Universo 2025. Bosch se convirtió en una de las favoritas del público después de ser reprendida por un director tailandés del certamen durante una reunión transmitida en vivo, lo que provocó que las concursantes abandonaran el evento.\n\nPraveenar Singh de Tailandia quedó en segundo lugar, mientras que Stephany Abasali de Venezuela, Ahtisa Manalo de Filipinas y Olivia Yacé de Costa de Marfil también llegaron al top 5.\n\nFatima Bosch, de México, reacciona al ser coronada Miss Universo 2025 durante la 74.ª edición del certamen Miss Universo en Bangkok, Tailandia, el 21 de noviembre de 2025. Chalinee Thirasupa/REUTERS/REUTERS\n\nLa mexicana de 25 años había sido noticia internacional a principios de mes, cuando denunció en redes sociales que Nawat Itsaragrisil, presidente de Miss Grand International (MGI) y director regional en Asia de Miss Universo, la llamó “tonta” durante un intercambio en el marco del concurso en la capital, Bangkok.\n\nLas primeras en reaccionar fueron las concursantes de varios países, que en solidaridad con la joven mexicana se levantaron de sus asientos e intentaron dejar la sala donde ocurrió la falta de respeto. El video de lo sucedido se viralizó.\n\nFatima Bosch, de México, durante el 74.º certamen de Miss Universo en Bangkok, Tailandia, el 21 de noviembre de 2025. Chalinee Thirasupa/REUTERS/REUTERS\n\n“Solo me dijo ‘cállate’ y un montón de cosas diferentes, y yo creo que el mundo necesita ver esto porque somos mujeres empoderadas, y esta es una plataforma para nuestra voz, y nadie puede callar nuestra voz”, dijo Bosch sobre lo ocurrido.\n\nEn una conferencia de prensa posterior, Itsaragrisil negó haber llamado “tonta” a Bosch y aclaró que su acento tailandés —y su distinta pronunciación en inglés— hizo que sus palabras fuesen confundidas con un insulto.\n\nPese a esa explicación y de que el directivo se disculpó luego públicamente con las concursantes, el maltrato hacia Bosch, registrado en video, fue repudiado incluso por la propia Organización Miss Universo (MUO, por sus siglas en inglés).\n\nEl incidente desató acusaciones generalizadas de misoginia y provocó una reacción mundial, incluso por parte de la presidenta de México.\n\nEl comportamiento de Fátima Bosch “es un ejemplo de cómo las mujeres debemos levantar la voz”, aseguró el miércoles la presidenta de México, Claudia Sheinbaum, durante su conferencia de prensa matutina.\n\nSheinbaum se refirió a lo sucedido y reflexionó sobre cómo en muchas ocasiones las mujeres reciben indicaciones de mantenerse en silencio y no intervenir en la vida pública.\n\n“Yo digo luego en los eventos públicos que, fíjense la frase, esto que nos decían a las mujeres, ¿no? ‘Calladita te ves más bonita’. Bueno, no sé si alguien se lo dijeron aquí de las compañeras que están, pero a mí sí me lo dijeron. Afortunadamente no mi familia. Pero sí llegaron a decirme: ‘como que calladita te ves más bonita’”, dijo.\n\n“Las mujeres nos vemos más bonitas cuando alzamos la voz y participamos. Porque eso tiene que ver con el reconocimiento de nuestros derechos. Entonces, mi reconocimiento a esta joven”, expresó Sheinbaum.\n\nMiss Universo es conocido como el “Super Bowl” de los concursos de belleza y atrae a millones de espectadores cada año. Las representantes de cada país son seleccionadas a través de certámenes locales que obtienen la licencia de los derechos locales de la Organización Miss Universo.",
  "authors": [
    "Por Cnn En Español"
  ],
  "url": "https://cnnespanol.cnn.com/2025/11/20/entretenimiento/gana-miss-universo-2025-trax"
}