{
  "title": "Camera support could be the boost Matter needs",
  "text": "is a senior reviewer with over twenty years of experience. She covers smart home, IoT, and connected tech, and has written previously for Wirecutter, Wired, Dwell, BBC, and US News.\n\nPosts from this author will be added to your daily email digest and your homepage feed.\n\nIt’s finally happening. Three years after Matter launched, the interoperability standard now includes the most popular smart home devices: cameras.\n\nThe Matter 1.5 spec, announced today, adds support for all types of video cameras — from indoor and outdoor, wired and battery-powered cameras, to video doorbells, baby monitors, pet cams, and more. Matter support should be possible with an OTA update, so some of your existing cameras could become Matter-compatible. The new spec also adds garage door controllers, soil sensors, bi-directional charging for EVs, and more advanced integration with utilities for energy management.\n\nSo far, cameras have been among the least interoperable devices in our homes, and bringing them into Matter is a big win for the standard. With Matter, you should be able to add any certified camera to your smart home platform of choice, such as Apple Home, Amazon’s Alexa, and Google Home, and access it there alongside cameras from different manufacturers.\n\n“Cameras might create even more momentum [for Matter]. Cameras might leapfrog everything.”\n\nCameras will use Matter-over-WiFi (or ethernet), which, as a local protocol, should improve reliability and latency, especially for things like streaming footage to your smart display and using camera events, such as motion, to trigger other devices and smart home automations.\n\nHowever, all of these benefits will ultimately depend on how each platform and manufacturer decides to implement support — specifically, whether they decide to support cameras in Matter at all.\n\nWhat capabilities will cameras have in Matter?\n\nAccording to the Connectivity Standards Alliance, the organization behind Matter, Matter-certified home security cameras will support live video and audio streaming, two-way talk, and local and remote access. The standard also allows for pan-tilt-zoom controls for the cameras and the setting of detection and privacy zones.\n\nAlong with streaming, Matter 1.5 enables continuous and event-based recording, with the option to store recordings locally or in the cloud. But it doesn’t cover the storage of that footage. Instead, Matter hands off to whatever local or cloud storage options are available from the device makers and platforms.\n\n“It should be possible for most modern cameras on the market today, and in people’s homes, to be updated to support Matter.”\n\nThis means a camera company could support Matter, but still require a cloud subscription in order for you to review recorded footage, Chris LaPré, head of strategy at the CSA, told The Verge in an interview. Additionally, while Matter support will likely be an add-on to a camera manufacturer’s connectivity options at first, the local storage route presents the possibility that someone could develop a network video recording (NVR) system that records everything locally, works with every smart home platform (that supports cameras in Matter), and never touches the cloud.\n\nWith Matter, all footage will be encrypted in transit, with end-to-end data encryption available “if the ecosystem wants to use it,” says LaPré. The standard supports streaming using the popular WebRTC protocol and access via STUN and TURN. It will also support TCP transport.\n\nThis covers all the different streaming technologies camera companies use, he says, which is one of the reasons it took a while to bring cameras into the spec. “We didn’t want to piecemeal this,” says LaPré. “We wanted to launch with a full-scoped spec.” (If you want to dig into the nitty-gritty, check out the Matter camera Device Type GitHub page.)\n\nMatter doesn’t specify or limit the resolution of camera footage, nor does it dictate or manage features such as AI-powered detection types (person, package, etc.). These will be part of how camera manufacturers and platforms can differentiate their offerings — through adding things like AI-powered descriptive alerts (which Ring, Arlo, Wyze, and Google Nest offer).\n\nThe CSA says the standard is backward compatible. “It should be possible for most modern cameras on the market today, and in people’s homes, to be updated to support Matter,” LaPré says. However, which models will get the update is entirely up to each manufacturer.\n\nWhen will Apple, Google, and Amazon support Matter cameras?\n\nAqara plans to bring Matter support to some of its cameras and video doorbells. Image: Aqara\n\nBased on previous rollouts, it takes at least a year from the release of a specification to achieve market penetration of devices. It’s been three years since Matter 1.0 was released, and we have plenty of lightbulbs, smart plugs, and locks. But other device types have taken longer. Household appliance support arrived in 2023 with Matter 1.2, but there are still only a handful of Matter-certified appliances.\n\nHowever, with backwards compatibility and the huge popularity of cameras, I anticipate we’ll see movement a lot faster here — probably beginning with CES 2026, which is just two months away.\n\nAqara, a strong supporter of Matter, is aiming for the first half of 2026 to launch its first Matter camera. Cathy You of Aqara tells me that the company also plans to add Matter support to some existing cameras.\n\nEve, another early supporter of the standard, won’t be updating its existing Eve Cam and Eve Outdoor Cam. Lars Felber of Eve says it’s not technically feasible, but that they plan to introduce Matter-enabled models at some point.\n\nThe big three — Apple Home, Amazon’s Alexa, and Google Home — have been glacially slow to adopt new Matter device types.\n\nI asked Amazon whether Ring or Blink will support Matter, and spokesperson Melanie Garvey said, “We don’t support the Matter standard in our cameras, and we don’t have a timeline for when we will.” Google declined to comment on its Nest cameras. I also reached out to several other camera manufacturers, including Arlo, Reolink, and Eufy, and will report back if I receive a response.\n\nOf course, none of this will make much difference unless the platforms support cameras. And the big three — Apple Home, Amazon’s Alexa, and Google Home — have been glacially slow to adopt new Matter device types. Google Home only added local control of lights, plugs, and switches last week.\n\nBut it seems likely that Apple will support cameras in Matter. Especially as, according to the Matter GitHub project, one of the leads on the camera project is Aron Rosenberg, an Apple Engineer previously of Logitech, which developed some of the first cameras with support for Apple’s HomeKit Secure Video service. I reached out to Apple, but have not gotten a response.\n\nIf they do, presumably Matter cameras would connect to Apple Home’s existing HomeKit Secure Video platform and process video locally in your home on an Apple Home Hub, such as an Apple TV or HomePod. My guess is we won’t see support any earlier than next spring, which is when we might be getting a new HomePod Mini and Apple TV, according to ongoing rumors.\n\nSmartThings will probably jump on adoption. Samsung abandoned its first-party camera hardware years ago, and Matter could provide the platform with the opportunity for broader camera support it desperately needs.\n\nSecurity camera company Ring, owned by Amazon, says it doesn’t have a timeline for supporting Matter on its cameras. Image: Ring\n\nHome Assistant’s Gord Cameron tells me support is on the roadmap, but points out that Home Assistant is already pretty good at integrating cameras. “Some of our tech really lines up well with the Matter camera implementation,” he says. “But there are a couple of things we need to develop into Home Assistant (like two-way audio for smart doorbells) before we can fully implement Matter cameras.”\n\nAs for Google Home and Amazon’s Alexa, considering their new AI-powered assistants are so closely integrated with their in-house camera brands (Nest and Ring, respectively), and they have been rolling out new AI-powered features at a pace, I don’t anticipate a speedy uptake for Matter.\n\nHowever, both companies have long touted how open their smart home platforms are, so I don’t see them letting Apple take the lead. A lot of this will depend on momentum — how many camera manufacturers jump onto Matter, which in turn will hinge on how many platforms support it.\n\nCameras were always a major missing piece for the Matter standard. On paper, the implementation checks all the right boxes. It really feels like they’ve done this right.\n\nCombined with the recent momentum gained by companies like Ikea and Philips Hue putting their full support behind Matter, it could be a big boost to the standard. “We heard from a lot of people that once you have cameras, we’ll be more interested,” says LaPré. “Cameras might create even more momentum, cameras might leapfrog everything.”\n\nMatter 1.5 also brings better energy management and garage door controls\n\nMore energy management\n\nRecent Matter updates have focused on developing the standard’s energy management features. A truly interoperable standard will make it much easier to control the energy use of appliances in your home across various brands. Matter 1.5 rounds out the infrastructure needed to make this happen with a new “electrical energy tariff” device type.\n\nThis will allow utilities to integrate with Matter and share real-time and forecasted pricing, along with how clean the energy on the grid is. Then, Matter devices in your home can receive that data and automatically adjust, either independently or through a Matter smart home platform with energy management capabilities. “How and when energy is used should ideally be a whole-home decision,” says LaPré. “There’s a need to coordinate when devices like the EV charger, dishwasher, and pool pump run, in order to balance usage.”\n\nThe energy tariff device type can also incorporate real-time or predictive data from a solar installation, allowing your home energy management system to track both the energy you generate and the energy you use.\n\nPlus, utilities can use Matter to tell your home about the needs of the grid. This could bring more fine-grained control for those who participate in demand response programs — where the energy company lowers your energy use (for example, by raising the temperature on your smart thermostat) when the grid is under strain.\n\nThe final energy management update in 1.5 is support for bi-directional EV charging, which lets you use your EV to power your home. It’s all great infrastructure for energy management, but so far, there are no Matter-certified products you can buy to support this.\n\nGarage door controllers arrive\n\nMatter now finally supports garage door controllers. Despite being announced as one of the first device types Matter would support (and a couple of companies coming out with work-arounds), garage door controllers haven’t been part of the Matter spec until now. With 1.5 and a new “Support for Closures,” the category is now official.\n\nClosures will also cover a variety of devices that go up and down or side to side, such as shades, drapes, awnings, and gates, and enable more motion types than are currently supported in the spec. This should bring more control options to fancier shades, such as those that open from top to bottom.\n\nA smarter garden\n\nSoil sensors, which measure moisture and temperature, are now a device type in Matter. These should be able to feed data to a smart sprinkler or other irrigation system, to help automate watering.\n\nThe Matter 1.5 spec officially launches today, meaning developers can start working with the SDK and test tools. But, as mentioned, it will likely be several months, if not years, before we start to see any of these products in our homes.\n\nWhat is Matter? Matter is a smart home interoperability standard designed to provide a common language for connected devices to communicate locally in your home without relying on a cloud connection. It is built to be secure and private, easy to set up, and widely compatible. Developed by Apple, Amazon, Google, and Samsung (and others), Matter is an open-sourced, IP-based connectivity software layer for smart home devices. It works over Wi-Fi, ethernet, and the low-power mesh networking protocol Thread, and currently supports most of the main device types in the home. These include security cameras, lighting, thermostats, locks, robot vacuums, refrigerators, dishwashers, dryers, ovens, smoke alarms, air-quality monitors, EV chargers, and more. A smart home gadget with the Matter logo can be set up and used with a Matter-compatible platform via a Matter controller and controlled by more than one platform via a feature called multi-admin. Amazon Alexa, Google Home, Samsung SmartThings, and Apple Home are some of the major smart home platforms supporting Matter, along with hundreds of device manufacturers.",
  "authors": [
    "Jennifer Pattison Tuohy"
  ],
  "url": "https://www.theverge.com/tech/821707/matter-smart-home-standard-supports-cameras-apple-ring-google-nest"
}