{
  "title": "Come sarà il primo parco tematico dedicato ai Pokémon che sta per aprire in Giappone",
  "text": "Si chiama PokéPark Kanto quello che sarà il primo parco tematico dedicato ai Pokémon che aprirà ovviamente in Giappone, nella capitale Tokyo, il prossimo 5 febbraio 2026. Per visitarlo sarà necessario recarsi presso un parco divertimenti più grande chiamato Yomiuriland e acquistare un biglietto a parte, come già successo con il già popolarissimo Super Nintendo World ospitato all'interno degli Universal Studios Japan a Osaka. Sono emerse le prime immagini e i render assieme anche a un trailer stile videoludico, che raccontano cosa aspettarsi dalle attrazioni.\n\nCome sarà il parco tematico Pokémon\n\nDopo una serie di iniziative temporanee e di breve durata, PokéPark Kanto sarà il primo vero parco tematico sui Pokémon costruito per rimanere sempre visitabile e c'è da scommettere che sarà preso d'assalto dai fan di tutte le età. Visitando il sito che racconta il progetto e mostra le prime foto (si possono vedere qui sotto nella gallery) si scopre infatti come buona parte delle attrazioni possa richiedere una prenotazione oppure direttamente un costo accessorio. La mappa è divisa in due parti con una città e una foresta a rappresentare la tipica ambientazione dei vari videogiochi della serie. Il paese si chiama Sedge Town e propone tutto ciò che ci si aspetterebbe quindi il Centro Pokémon, il negozio Poké Mart, la palestra e i vari chioschi per bevande e gadget.\n\nNella foresta si potranno incontrare le varie creature che saranno anche in qualche modo animate, ma non è ancora spiegato come, possibile che si tratti di piccoli robot. Nell'area più selvaggia ci saranno piante, rocce, prati e tunnel. A completare il quadro dell'offerta ci saranno esibizioni nei teatri e giostre varie inclusa quella dedicata ai Pokémon elettrici capitanati ovviamente da Pikachu (Pika Pika Paradise).\n\nAppuntamento dunque al 5 febbraio 2026 per l'inaugurazione, non è ancora stato comunicato quanto costerà il biglietto di ingresso.",
  "authors": [
    "Diego Barbera"
  ],
  "url": "https://www.wired.it/gallery/pokepark-kanto-parco-tematico-pokemon/"
}