{
  "title": "Edwin Austin Abbey review – an American flex with lashings of gold and nudity",
  "text": "Oh say can you see, by the dawn’s early light, how a huge painting covered in writhing nudes and gold leaf could be a symbol of US power? Not a huge leap is it? And here it is, in the National Gallery, Edwin Austin Abbey’s study for The Hours, a huge circular painting which adorns the ceiling of the Pennsylvania state capitol – a bold, blue and gold testament to the US’s glory.\n\nIt’s hard to believe – with museums everywhere begging for money from arms dealers and drug barons, and the arts becoming increasingly defunded – that back in turn-of-the-century America, the arts had value. And Abbey reaped the benefits. He was born in the US in 1852 but made his name in the UK. And when the big kahunas from the newly megarich Pennsylvania came knocking, he answered the call of the motherland.\n\nPennsylvania had abundant natural resources, vast amounts of industry, and when its statehouse in Harrisburg burned down in 1897 they decided their new one had to be grand, opulent – and covered with gold leaf. The US really hasn’t changed that much.\n\nView image in fullscreen Abbey’s compositional study for The Apotheosis of Pennsylvania mural, about 1902-1911. Photograph: Yale University Art Gallery\n\nAbbey was commissioned to plaster the new state capitol building in allegorical and historical murals, and the final study for its circular ceiling painting is the big draw of this small, evocative exhibition. At 12ft wide it’s enormous, but still only half the size of the original. Twenty-four figures dance around its circumference in various states of undress – they are the hours of the day, nude and yawning in the dawn’s early light, and sombrely cloaked in black under the midnight moon. The sky behind them is deep lapis blue, the twinkling stars a field of gold. It’s European symbolism on steroids, Odilon Redon crossed with Gustav Klimt and given an apparently infinite budget.\n\nWhat a way to tell the world that you’ve arrived as a big player on the international stage: with gold, nudity and audacious ostentatiousness. To be clear, that’s the point of this: it’s propaganda, soft power, art as a tool of the state. When you’re booming, you do elaborate stuff to make sure everyone knows about it and that’s how art has been used for centuries. You think Michelangelo was commissioned for the Sistine Chapel purely out of religious devotion? It’s cultural muscle flexing, it’s expressions of wealth and power through art.\n\nView image in fullscreen Figure study for The Spirit of Vulcan, Genius of the Workers in Iron and Steel, about 1902-08. Photograph: Yale University Art Gallery\n\nAbbey’s study for The Hours is a pretty, hypnotic swirl of a painting, and all the glistening gold and deep blue is hugely atmospheric. But the painting is also a bit chintzy and rough. None of the figures are particularly fleshed out or neatly delineated, partly because it’s a study, and partly because it was going to go on a ceiling way above your head, so who was going to notice?\n\nThe six studies shown alongside it – including an ultra-smudgy study for a big group portrait filled with American heroes such as Daniel Boone and Benjamin Franklin – just leave you wanting to see the finished works. The wall text talks about how this exhibition “begins to return Abbey to the attention he deserves”. But some rough old studies and a maquette don’t make a hugely convincing argument. “He’s great, honestly, you’ve just caught him on a bit of a bad day” isn’t a great way to reintroduce audiences to a forgotten painter.\n\nBut the contemporary resonances are many and loud. As Donald Trump remodels the White House in his own gilt-encrusted rococo vomit aesthetic, you realise he’s doing nothing new, that states have always used art to consolidate power, and waste gold reserves in the process.",
  "authors": [
    "Eddy Frankel"
  ],
  "url": "https://www.theguardian.com/artanddesign/2025/nov/20/edwin-austin-abbey-review-national-gallery-london"
}