{
  "title": "Wes Anderson: The Archives review – Wesophiles will relish this deep dive into the detail-obsessed director",
  "text": "Terrible things happen in Wes Anderson films. In his latest, The Phoenician Scheme, a man is casually split in half in an aircraft crash. In The Royal Tenenbaums, the patriarchal protagonist feigns a terminal illness in order to weasel his way back into his estranged and dysfunctional family. In The Grand Budapest Hotel the “heroic” concierge Monsieur Gustave is essentially a killer and the fictional Republic of Zubrowka is in the tightening grip of a fascist regime.\n\nAll this is played for knowing comedic effect (the splatted bisection resembles a Tom and Jerry cartoon; Zubrowka is a brand of Polish bison grass vodka), while lavishly sugarcoated in a set dressing of eccentric curios, outlandish costumes and saturated colour. Anderson aficionados will be familiar with the drill, a bit like finding a gnat in a cupcake, delivered in a series of perfectly composed vignettes.\n\nAfter Stanley Kubrick and Tim Burton, the Design Museum’s fascination with film directors has now alighted on Anderson, with an expanded version of a show devised in association with the Cinémathèque Française in Paris, where it was first shown. The format is by now familiar, featuring a curated trove of archive material arranged film by film. Among the 700 objects exhumed from a warehouse in Kent are costumes, wigs, sketches, models, fictional books, fictional art, a tent, a typewriter and dozens of stop-motion puppets.\n\nView image in fullscreen Upper-class elites … costumes from The Royal Tenenbaums on display. Photograph: Tristan Fewings/Getty Images\n\nThe 30-year cinematic arc begins with Bottle Rocket, an unlikely mid-90s homage to Scorsese’s Mean Streets, and ends with The Phoenician Scheme, released earlier this year to mixed reviews. Ab Rogers created the exhibition design, with rooms decorated in various shades of red, starting with post-box and terminating in maroon. The Anderson quirkfest fairly zings out from this incarnadine backdrop.\n\nWesophiles will doubtless relish poring over the spoils, such as the implausibly intricate scale model of the Darjeeling Express, or the luxurious red velvet and mink number worn by Tilda Swinton as the desiccated dowager, Madame Céline Villeneuve Desgoffe-und-Taxis, in The Grand Budapest Hotel. There is also the actual Grand Budapest Hotel, a towering pink confection resembling a monstrous marzipan wedding cake, along with maquettes of the mutant sea creatures that populate The Life Aquatic With Steve Zissou, and an array of furry, diddy, stop-motion puppets from Fantastic Mr Fox, lined up like a vulpine identity parade.\n\nKnown for his snappy dressing, Wes had a suit made from the same corduroy as Mr Fox, who was voiced by George Clooney, exemplifying Anderson’s A-list pulling power. Stellar ensemble casts are another recurring feature; blink and you may miss Swinton or Tom Hanks. Wider creative collaborators include graphic designer Erica Dorn and Italian costume designer Milena Canonero, whose first major screen credit was on A Clockwork Orange.\n\nView image in fullscreen Fantastic … Mr Fox models his corduroy suit. Photograph: Tolga Akmen/EPA\n\nLess committed cineastes might find the insistent “Wesness” of it all somewhat overwhelming, like being trapped in a branch of Oliver Bonas crammed with hyper-twee gewgaws. The tone of object fetishisation is set from the get-go as the show opens with a vitrine full of identical, spiral bound notebooks, filled with preternaturally neat and precise handwriting outlining ideas for each film. Wes is, and has always been, a details man.\n\nThe pervading impression is of a creative finickiness verging on the obsessive. Supreme pains are taken, whether it’s auditioning left-handed children to achieve the right kind of 1960s handwriting for a five-word note on screen for seconds in Moonrise Kingdom , or employing the exact type of ink favoured by the Japanese yakuza for a tattoo on the back of Mayor Kobayashi, a puppet character from Isle of Dogs.\n\nThe laborious technique of stop-motion animation, which requires models to be manipulated between 12 and 24 times for each second of film, must take the biscuit. Fantastic Mr Fox took two years to make and the animators, who are more like performers, are required to make the puppet model act and feel like a real person.\n\nLess cosy and less discussed is what American critic Jonah Weiner has described as “the clumsy, discomfiting way Anderson stages interactions between white protagonists – typically upper-class elites – and non-white foils, typically working-class and poor”. This was especially apparent in The Darjeeling Limited, featuring three white men blundering haplessly around “exotic” India, a reminder of the absence of real-world politics in Anderson’s films. Concentrating on the minutiae of their art and craft conveniently swerves any knotty issues.\n\nYet for all the tantalising stuff on show, there’s something fundamentally disconcerting about deconstructing the kinetic medium of film in order to reframe it as a collection of static objects. It’s like pulling back the curtain to find the scenery creaking and the mystique, if not exactly dissolved, then certainly altered. Invariably, there’s a certain reductive lifelessness about it all.\n\nNonetheless, Anderson’s idiosyncratic, deadpan hipster view of the world continues to attract an appreciable following. It has even spawned an extensive fan website, Accidentally Wes Anderson, to which devotees can submit Andersonesque tableaux of kooky buildings and landscapes. Scrolling through colour-coded Alpine chalets, darling launderettes and the odd Crochet Museum, it would would appear that there really is no escaping Wes World.",
  "authors": [
    "Catherine Slessor"
  ],
  "url": "https://www.theguardian.com/artanddesign/2025/nov/19/wes-anderson-the-archives-review-design-museum-london"
}