{
  "title": "Things That Disappear by Jenny Erpenbeck review – a kaleidoscopic study of transience",
  "text": "Jenny Erpenbeck wrote the pieces collected in this compact yet kaleidoscopic book for a column in the newspaper Frankfurter Allgemeine Zeitung; published in German in 2009, they now appear in an English translation by Kurt Beals, following the immense success of Erpenbeck’s novel Kairos, which won the 2024 International Booker prize.\n\nIt’s interesting and instructive to reflect on what German newspaper readers made of the column in the early years of the new millennium, nearly two decades on from the fall of the Berlin Wall. For while Erpenbeck adopted some of the features of the form – apparently throwaway observations on daily life, such as minor irritation at the difficulty of sourcing proper splitterbrötchen, an unpretentious pastry now pimped for a more elaborate and wealthy clientele – she consistently enlarged and complicated it. Into that recognisable tone of ennui and mild querulousness with which journalists hope to woo a time-pressed but disenchanted or nostalgic readership, Erpenbeck smuggled metaphysics, politics and history.\n\nAs in her fiction, her attention is drawn to the irrefutable power of contingency. As a child and adolescent, she was an East German; entering adulthood, she finds that her country no longer exists and that personal, family, social and political histories have been compressed into the suddenly appearing moment. If the collapse of the Berlin Wall was an easily grasped symbol, dramatic in its intensity and immediacy, what happened to the places and the people in the hours, days and years that followed? Put in more abstract philosophical terms, what is the status of an object after it has disappeared, a person after they have died, a renamed and reconfigured state, an altered identity?\n\nContingency tells us that it depends. That splitterbrötchen, for example: a sweet, plain item “rather jumbled up, as if the baker had stuck all the leftover scraps of dough together” is now a far more refined affair, involving layers of puff pastry, techniques and processes, a thumb pressed into the dough “to let air in”. “Air!?!” exclaims Erpenbeck. “For the first time, it strikes me that the word disappear has something active at its core, that there is a perpetrator in the word.”\n\nThe pieces are necessarily short, and Erpenbeck leaves the reader to flesh out what she implies and only occasionally makes more explicit, as in the question of the disappearing drip-catcher – a once ubiquitous and low-tech gadget deployed to save East German tablecloths from coffee spills, now made obsolete as coffee pots have been replaced by Italian espresso-makers.\n\nThese domestic concerns are inflected with irony and humour, but several of the pieces address larger and more significant absences. When Erpenbeck visits the site of the Warsaw Ghetto, describing the modern hotel where “glass elevators go up and down inside a glass tube” and chestnut trees flourish only in areas beyond the rebuilt zone, she reveals a memorable detail: that “there’s often a small slope to the right and left of the sidewalk, overgrown with grass and bushes, and the buildings themselves sit a bit higher”, because they have been constructed on the rubble and the foundations of old houses burnt to the ground by the Germans.\n\nWriting in miniature demands the exemplary and the material: something concrete to conjure a picture, to anchor a thought. But Erpenbeck is just as concerned with how such profound alterations affect intellect and emotion, how they redraw mental landscapes and interior life. Recalling people that she has lost – “R.”, whose fully charged shaver she collected from the hospital the day after his death, or her grandmother’s gnarled hands – she considers how her instinct to preserve is taking shape. She is forming a habit, she tells us, of trying to capture aspects of the “perfectly alive” people around her and imagining them as pieces of film, “as if I could select my memories in advance and learn them by heart, so that I could be sure to recall them later”.",
  "authors": [
    "Alex Clark"
  ],
  "url": "https://www.theguardian.com/books/2025/nov/21/things-that-disappear-by-jenny-erpenbeck-review-a-kaleidoscopic-study-of-transience"
}