{
  "title": "Stafford dance studio fears closure in town centre revamp",
  "text": "Dance studio fears closure in town centre revamp\n\n14 hours ago Share Save Lee Blakeman BBC Radio Stoke Share Save\n\nTopline Nick Gallagher-Hughes (left) of Topline Studio says they are seriously concerned about finding a new home\n\nA dance studio fears it will have to close as a council is demolishing the building it is in as part of its town centre redevelopment work. Topline Studio said it had been told to leave the site on Gaolgate Street, Stafford, by 31 January 2026, and as a result will have to close on 31 December. Co-owner Nick Gallagher-Hughes said they were \"gutted\" after putting their \"heart and soul\" into the business, and were \"seriously concerned\" about finding a new home. Stafford Borough Council said Topline Studio had been made aware of its plans to buy the building in June, and it had been working with them to find suitable alternative premises.\n\nThe dance studio was opened in 2019, when their landlord was a retailer, and Mr Gallagher-Hughes said the first they knew about the council buying the building came via a rumour. He said they were only officially served notice by the authority in October, which was not enough time to find an alternative. The council had offered a financial settlement, he said, but it was not enough to allow them to establish new premises. Trying to find a large enough building with affordable rates in or near the town centre was difficult, he added. They had found one potential property, but the cost of revamping it was beyond their personal means, he stated, and the dozen groups who use the studio cannot wait for months for a new venue. \"It could be the end for us,\" he said.\n\nTopline Topline Studio opened in 2019 on Gaolgate Street, Stafford\n\nStafford Borough Council said it made the business aware of its plans to purchase the building in June prior to the council's acquisition, and this was acknowledged by them. \"After purchasing the building in July, we met with Topline Studio on three occasions and were open about our intention to gain possession of the building,\" it said. The council added that its plans for Stafford are a \"one-off opportunity\" to revitalise the town centre for the future, backed by significant government funding.\n\nFollow BBC Stoke & Staffordshire on BBC Sounds, Facebook, X and Instagram.",
  "authors": [],
  "url": "https://www.bbc.com/news/articles/ce3x3kxed4yo"
}