{
  "title": "Settlers set fire to cars in latest West Bank arson as Israeli PM convenes meeting about settler violence",
  "text": "Jerusalem —\n\nIsraeli settlers set fire to cars in the latest arson in the occupied West Bank as Israeli Prime Minister Benjamin Netanyahu convened a security meeting on settler violence.\n\nAccording to witnesses and WAFA, the official Palestinian news agency, settlers torched a vehicle scrapyard in the town of Huwara in the northern West Bank.\n\nThe Israeli military said its soldiers were dispatched to Huwara after receiving reports of Israeli civilians throwing rocks toward Palestinian vehicles, setting fire and damaging property.\n\nFootage obtained by CNN shows numerous cars on fire as firefighters try to extinguish the blaze. Thick, black smoke pours into the night sky from the fire that appears to spread over a sizable area.\n\nMohammed Dalal, who owns the scrapyard, says more than a dozen settlers descended on the site, smashing cars and starting the fire. He says no one was in the scrapyard at the time, but he estimated that 150 cars were torched or damaged.\n\n“I have children in university, I have grandchildren, I have a family; we all depend on this scrapyard,” Dalal told CNN. “Like many Palestinians, I have olive trees, but I haven’t been able to harvest my olives and so this is our only source of income. All I can do is ask God to compensate us.”\n\nIsraeli settlers set fire to multiple cars in the town of Huwara in the occupied West Bank on Thursday. Obtained by CNN\n\nThe attack happened the same evening Netanyahu convened a security meeting on settler violence in the West Bank, according to two Israeli officials, which has surged in recent weeks and months. It’s unclear if any decision was reached on how to respond to the escalating attacks. On Monday in a rare condemnation of settler violence, Netanyahu said the attacks were being carried out by “a small, extremist group.”\n\nLast year, Defense Minister Israel Katz declared that Israel will no longer use administrative detention against Israeli settlers, preventing the country’s security apparatus from using one of its most powerful tools to incarcerate settlers while still employing it widely against Palestinians.\n\nThe Israel Defense Forces (IDF) acknowledge that cars had been set on fire in the Palestinian town, not far from the settlement of Yitzhar, which is known for its extremist ideology. The IDF said there were no injuries following the incident and soldiers conducting searches did not find any suspects.\n\nThis latest attack is the second major arson in a matter of days after dozens of settlers set fire to Palestinian homes and vehicles to the south of Bethlehem. Last week, settlers launched a major arson attack on an agricultural area in the northern West Bank, setting fire to trucks, metal sheds and more.\n\nHuwara has come under settler attack before. In June 2023, settlers rampaged through the town, killing one Palestinian man and wounding hundreds of others in what the former IDF military chief later called a “pogrom.” The large-scale attack was billed as “revenge” after a Palestinian gunman killed two brothers who lived nearby.",
  "authors": [
    "Zeena Saifi",
    "Dana Karni",
    "Oren Liebermann"
  ],
  "url": "https://www.cnn.com/2025/11/20/middleeast/settlers-set-fire-to-cars-in-latest-west-bank-arson-as-israeli-pm-convenes-meeting-about-settler-violence-intl-latam"
}