{
  "title": "Pluribus’ third episode throws a bomb into things",
  "text": "If you weren’t clear on just what a miserable person Carol (Rhea Seehorn) is, episode 3 of Pluribus sure makes it obvious. It opens with a flashback, as Carol and her partner Helen (Miriam Shor) are on a dream vacation at an ice hotel in Norway, and all she can do is complain about how cold it is. When Carol sees a stunning aurora borealis, her only thought is “it looks like a screensaver.” But that cynicism might also be her superpower as she prepares to solve the hive-mind apocalypse that has descended on Earth.\n\nWelcome! The two-episode premiere of Pluribus, the new Apple TV show from Breaking Bad creator Vince Gilligan, introduced a strange world where a woman named Carol is thrust into an almost postapocalyptic setting where nearly everyone else on the planet is now part of a hive mind powered by unyielding positivity. The premiere also generated a lot of great discussion among Verge subscribers. So I’m hoping to keep that energy going in the comments here, kicking things off with a few of the biggest questions I have at this point in time. Naturally, spoilers ahead.\n\nIn addition to really driving home how cranky Carol was before she became one of the only non-hive mind humans on the planet, the episode also made it clear just how difficult it will be for her to live independently of the hive, as well as the lengths the hive will go to make her happy. Including, uh, maybe giving her a nuclear weapon if she asked? Anyways, here are the things I’m wondering about.\n\nImage: Apple\n\nWill Carol find an ally?\n\nObviously being one of a dozen or so non-hive members is pretty isolating. But things got even worse in episode 2 when she tried to connect with the English-speaking survivors, and they had little interest in changing the world back the way it was. But maybe there’s some hope: a man living in Paraguay named Manousos (Carlos Manuel Vesga) seems to hate the hive even more than Carol does. The problem is that he’s on the other side of the world and only speaks Spanish. Their first phone call ended with a lot of yelling. Still, Manousos seems like Carol’s best hope of finding another human who sees the supposed problem of global happiness the same way she does.\n\nHow will she coexist with the hive?\n\nFor the time being, Carol, the rest of the unaffected, and the hive are all sharing the same planet. That is, at least until either side figures out a “cure.” But in the meantime, it is creating some tension for Carol, who views herself as an independent person, and yet is mostly dependent on the hive providing for her. The issue became obvious when she tried to get food at a grocery store, and had to wait for it to be restocked.\n\nCan the hive say no to anything?\n\nThe flip side of that tension is that, it seems, the hive seems to be unable to do anything that might upset Carol. That means fulfilling her requests no matter how ridiculous they may seem, which is how the episode ended with a grenade exploding inside of Carol’s home, injuring her chaperone Zosia (Karolina Wydra). Before that, though, Carol was able to prod the hive to see just how far they would go. “We would move heaven and earth to make you happy, Carol,” they tell her when she asks if they would give her a nuclear weapon. “Would you like an atom bomb?” Very curious how she uses this to her advantage.",
  "authors": [
    "Andrew Webster"
  ],
  "url": "https://www.theverge.com/entertainment/820523/pluribus-episode-3-discussion"
}