{
  "title": "‘A modern-day Colosseum’: Birmingham City unveil 62,000-capacity stadium plans",
  "text": "Birmingham City have unveiled designs of their striking new 62,000-capacity stadium, the Birmingham City Powerhouse, which the Championship club say will open for the 2030-31 season.\n\nThe stadium, which features 12 chimney-like towers inspired by the city’s industrial heritage, will dominate the Birmingham skyline and be visible up to 40 miles away. One tower will include a lift to Birmingham’s highest bar, offering city-wide views.\n\nThe Birmingham chair, Tom Wagner, promised a “modern-day Colosseum” and “to create something unique and distinctive in one of this country’s greatest and sometimes overlooked regions … it will be overlooked no more. Together, we’re putting this city and our club on a trajectory towards greatness.”\n\nView image in fullscreen Another rendering of the planned stadium, which will include a roof that can retract in 20 minutes. Illustration: Knighthead\n\nThe stadium will include a roof that can retract in 20 minutes and a movable pitch to enable NFL, rugby and concert use. It is central to Wagner’s vision for a sports quarter in the city, a £3bn investment into a 60-acre site less than a mile from their current St Andrew’s ground.\n\n“We’re spending a lot of time and money on a stadium that will never be built,” quipped Wagner, alluding to doubters, at the launch of the stadium designs in Digbeth on Thursday.\n\nView image in fullscreen A rendering of how the inside of the stadium will look. Illustration: Knighthead\n\nMoments earlier Birmingham had released a promotional video for the Powerhouse featuring Jude Bellingham, a product of the academy; the minority shareholder and former NFL star, Tom Brady; and the actor Paul Anderson, who played Arthur Shelby in the TV drama Peaky Blinders, which is set in the city.\n\nView image in fullscreen Rendering of a view inside the planned stadium. Illustration: Knighthead\n\n“We’re going to change this city for ever,” Wagner said. “This will be a sports stadium and music venue that will claim the sky to claim the city.”\n\nKnighthead Capital Management, co-founded by Wagner, completed a full takeover of Birmingham this month, having acquired a controlling stake of the club in July 2023. Birmingham were relegated in their first season at the helm but won League One last season and are targeting successive promotions.\n\nskip past newsletter promotion Sign up to Football Daily Free daily newsletter Kick off your evenings with the Guardian's take on the world of football Enter your email address Sign up Privacy Notice: Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on theguardian.com to send you this newsletter. You can complete full registration at any time. For more information about how we use your data see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nWagner said Birmingham’s new ground would be usable year-round and offer the “best acoustics and fan experience anywhere in the world” but maintained it was a “football-first stadium”.\n\nView image in fullscreen Despite plans for multi-use, including concerts and other sports, Birmingham chair Tom Wagner says the club’s planned new home would be a ‘football-first stadium’. Illustration: Knighthead\n\n“There will be a modern-day, accessible, Colosseum – a sporting venue that will stand tallest in the city, visible for many miles around and permanent home to the football club that bears its name, Birmingham City,” he said. “It will be a beacon for excellence for Birmingham on the global stage, attracting the very best sporting and entertainment events. It’s the place where the world’s best will want to perform.”",
  "authors": [
    "Ben Fisher"
  ],
  "url": "https://www.theguardian.com/football/2025/nov/20/birmingham-city-unveil-62000-capacity-stadium-plans-12-chimney-towers"
}