{
  "title": "John Cena Answers The Web's Most Searched Questions",
  "text": "Transcript\n\nI'm John Cena\n\nand this is the WIRED Autocomplete Interview.\n\n[upbeat music]\n\nWhat the [beep]? Is that for real?\n\nUh, okay.\n\nOkay. How did John Cena qualify for the Elimination Chamber?\n\nBy leaning on my resume for the one and only time\n\nI have in my entire life\n\nand letting everyone know like, heck, this is my last one.\n\nI think it's a better event with me in it.\n\nIn typical WWE fashion, don't try that at home\n\n'cause you really only have one of those bridges to burn.\n\nAnd this is my last WrestleMania, so I burned it.\n\nHere's a spoiler alert, it worked.\n\nHow did John Cena? Okay.\n\nWin at WrestleMania 41?\n\nBy being [bleep] awesome.\n\nThat was my secret sauce. Just a dose of awesomeness.\n\nI'm sure the Miz is going to punt me in the nuggets\n\nfor that one.\n\nCan John Cena grow facial hair?\n\nNot a chance. I haven't shaved in five weeks.\n\nI've tried. It shows up in patches.\n\nGuys, you know, I can barely grow hair, hair,\n\nso facial hair is equally challenging.\n\nI did rock a mustache for like a hot minute\n\n'cause I tried to grow out my hair\n\nand it was like this part doesn't grow,\n\nthis part doesn't grow, this part doesn't grow.\n\nSo it looks really bad.\n\nWill John Cena be at Summer Slam 2025?\n\nGuys, I'm retiring this year.\n\nI'm gonna try to get as many appearances as I can.\n\nAll right, first board's done. Let's get on with the quiz.\n\nHere we go, why John Cena\n\nis the greatest of all time?\n\nBecause I say so.\n\nAnd as you know,\n\nI also say that winners write the history books\n\nand currently I'm winning, so I'm writing history\n\nand I'm the greatest of all time because I said so.\n\nThat's a great answer for you parents out there. [laughs]\n\nIt's not.\n\nWhy is John Cena style so iconic?\n\nBecause, what the [bleep]? Is that for real?\n\nUh, okay.\n\nSo, thanks?\n\nProbably because I was stubborn enough not to change.\n\nSo I wear very small jeans.\n\nThey don't go be below my kneecap.\n\nJean shorts or jorts.\n\nAnd I just haven't changed that uniform in 20 years.\n\nI used to shower in it.\n\nAnd now we're here\n\nwhere the jorts are about to make their farewell.\n\nAnd this is me. This is who I am.\n\nThis is how I'm comfortable.\n\nAlthough I can't move in this coat, I would tear the seams.\n\nBut it's comfortable.\n\nIt's not. Help.\n\nGimme some fashion tips.\n\nI'm kidding. I won't listen.\n\nI'll just show up in a suit or jorts\n\nand a t-shirt until December.\n\nOkay, why is John Cena in Ambani wedding?\n\nBecause I was invited.\n\n[laughs] What a cool event to go to.\n\nMan, they really rolled out the red carpet\n\nand threw a huge wedding.\n\nI was invited and I wanted to go.\n\nI wanted to see what it was all about.\n\nI got to travel the world and experience incredible culture.\n\nIt was an event I'll always remember.\n\nSo that's why I was there, 'cause I got invited.\n\nOkay, here we go. Let's check it out.\n\nWhat did John Cena do to turn heel?\n\nThat's a good question\n\nbecause I believe I said on television\n\nthat I'm not a baby face nor heel, I'm a human being.\n\nSo if you have an answer to this question,\n\nit's more personal than practical.\n\nWhat is John Cena WrestleMania?\n\nWhat is John Cena WrestleMania record?\n\nThis should probably be possessive,\n\nwhat is John Cena's WrestleMania record?\n\nI'd like to think I've finished second place a few times,\n\nbut I don't know how many.\n\nHopefully I've finished first\n\nmore than I've finished second.\n\nWhat I do know is there are no more WrestleMania matches\n\nfor this guy.\n\nMy last one was a few weeks ago. All righty.\n\nWhat is John Cena's favorite animal?\n\nHell, I don't know.\n\nI would just literally be making something up.\n\nI don't wanna play favorites in the animal kingdom\n\nand I try to not do that.\n\nSo I do not have a favorite animal.\n\nWhat makes John Cena a hero?\n\nWell they say perspective is everything.\n\nAnd if you think someone dressed like a member\n\nof a highly affiliated organized crime family,\n\nwearing a pocket watch that doesn't work\n\nis somehow aspirationally something you wanna aspire to,\n\nthat's a great perspective of life and I appreciate that.\n\nSo thank you so much.\n\nAll right, that board's done.\n\nWho is John Cena,\n\nagain, we should probably add an apostrophe to this,\n\nbut that's okay.\n\nWho is John Cena best friend in WWE?\n\nWhen you're the 17-time champion,\n\nthat means you've lost it 16 times.\n\nSo that is an environment with no friends.\n\nI have no allegiances and may God I have mercy on my soul.\n\nWho is John Cena's biggest rival?\n\nThat one's simple. The audience.\n\nMy goodness, we've been going back and forth\n\nfor almost 25 years now.\n\nYou're tireless. You have an energy of an Everlast battery.\n\nI've tried to break you. I can't.\n\nYou got me on the ropes. This is my last nerve.\n\nI've said I'm gonna retire and I will go down swinging\n\ntrying to crack your resolve\n\nbut dammit, you guys are tough.\n\nYou are my biggest rival.\n\nWho is John Cena best friend in real life?\n\nWell, I do have a close crew,\n\nbut I gotta put the boss first and foremost.\n\nThat is my wife. I love her and she's my best friend.\n\nWho is John Cena's favorite BTS member?\n\nThis one's gonna set the world a blaze.\n\nMy favorite BTS member is, hope you got that one.\n\nHere we go.\n\nDid John Cena actually play the piano in Peacemaker?\n\nYes, that is my haphazard version of Home Sweet Home.\n\nI don't remember a note of it, but I did actually play it.\n\nI'm trying to learn how to play the piano.\n\nI've been trying now for eight years.\n\nI still do not know 'cause I practice in my free time\n\nand I have realized by my level of piano,\n\nI don't have a lot of free time.\n\nBut I still have a lot of fun doing it.\n\nDoes John Cena like anime?\n\nI do, but again, not a lot of free time.\n\nSo the last anime I saw was Fist of the North Star,\n\nwhich is such a cool movie.\n\nIt's about like a post-apocalyptic society\n\nof martial arts superheroes.\n\nIt's kind of like pro wrestling,\n\nif there was a post apocalyptic WWE universe.\n\nYeah, Fist of the North Star.\n\nIt's an oldie but a goodie.\n\nDoes John Cena run his Instagram?\n\n[bleep] yes I do.\n\nI post one picture every day\n\nthat has personal meaning to me.\n\nIt will never be accompanied with text.\n\nYou will never see my face.\n\nI will never do more than one image a day.\n\nNow sometimes the clock is off\n\nbecause my day is in let's say Budapest or Morocco\n\nand you're thinking like, oh, he posted twice today.\n\nIf you're really hawking my account that much,\n\ngo do something with yourself rather than hawk my account.\n\nBut it is the way I run my Instagram.\n\nI'm very, very proud of it.\n\nI run Instagram and x,\n\nFacebook's a little bit of a group effort.\n\nThreads is me.\n\nBut yeah, I try to use them all for different things.\n\nI'm very proud of the mystery that is associated\n\nwith the Instagram accountant.\n\nBest believe it's all me\n\nand there's a message in every photo. [humming]\n\nAll right, that board's done.\n\nThank you for wasting time with me together.\n\nI can't wait until the next WIRED Autocomplete Interview\n\nso we can do this again.\n\n[upbeat music]",
  "authors": [
    "Condé Nast"
  ],
  "url": "https://www.wired.com/video/watch/google-autocomplete-inverviews-john-cena-answers-the-webs-most-searched-questions"
}