{
  "title": "Michelangelo to Banksy: The controversial artworks that fell foul of the law - and were erased",
  "text": "Prefiguring Banksy's latest Royal Courts of Justice mural depicting a judge attacking a protester, are centuries of art history where works have been censored or edited.\n\nIt could hardly be more brutal in its depiction of the administration of judicial might: a judge, arm raised, wielding a makeshift weapon, delivers his ruling, blow by blow, on the body of the accused, who lies at his feet. No, I'm not talking about Banksy's recent (and rapidly erased) mural, which the street artist sprayed onto the side of the Royal Courts of Justice in London on 7 September. Banksy's work, which satirically depicted an English judge in traditional wig and gown, pummelling a prone protester with his gavel as splatters of blood became the very message emblazoned on the blank placard that the protester carried, was partially eradicated by authorities three days later.\n\nGetty Images A controversial mural by the artist Banksy appeared on the side of London's Royal Courts of Justice on 7 September (Credit: Getty Images)\n\nPrefiguring Banksy's work by more than four-and-a-half centuries is a marble sculpture by the Renaissance artist Jean de Boulogne (known as \"Giambologna\") which portrays a scene from the Bible in which the Old Testament judge Samson \"slew a thousand men\" with the \"jawbone of an ass\".\n\nIf Banksy's controversial work calls to mind such potent precedents from the history of art, so too does his mural's fate. Almost as quickly as the work was discovered on the side of the Queen's building in the court complex, it was covered up by large sheets of black plastic and barricaded by steel barriers and guards from the HM Courts & Tribunals Service. The Metropolitan Police quickly confirmed that the work had been \"reported to them as criminal damage\", allegedly in violation, it seems, of the Criminal Damage Act of 1971.",
  "authors": [],
  "url": "https://www.bbc.com/culture/article/20250912-the-controversial-artworks-erased-from-history"
}