{
  "title": "Jueza decidirá si ordena la liberación de Kilmar Ábrego García del centro de detención de inmigración",
  "text": "CNN —\n\nUna jueza federal en Maryland está por decidir si debe ordenar la liberación de Kilmar Ábrego García de la custodia del Servicio de Inmigración y Control de Aduanas (ICE, por sus siglas en inglés).\n\nLa jueza de distrito de Estados Unidos, Paula Xinis, ha estado evaluando la petición del inmigrante indocumentado deportado erróneamente durante semanas, y ha mostrado simpatía durante los recientes procedimientos —incluso en una audiencia este jueves en el tribunal federal de Greenbelt— hacia su argumento de que su detención continua es ilegal.\n\nEse argumento parece haberse fortalecido a medida que el Gobierno de Trump ha tenido dificultades en las últimas semanas para encontrar un país al que deportarlo rápidamente. Las juezas pueden ordenar a las autoridades que liberen a inmigrantes detenidos si su expulsión de Estados Unidos no parece inminente.\n\nRecientemente, las autoridades han dicho que tienen la intención de deportarlo a Liberia, después de no haber logrado enviarlo a otras tres naciones africanas que previamente identificaron como posibles destinos. (No puede ser enviado a su país natal, El Salvador, debido a una orden judicial previa, pero fue enviado allí erróneamente en marzo antes de ser regresado a EE.UU.).\n\nSin embargo, esos planes han desconcertado a Xinis, designada por el expresidente Barack Obama, quien dijo este jueves que enviarlo a una nación africana significaría que “quedaría completamente apartado de todo y de todos los que conoce”.\n\nLa jueza cuestionó a una abogada del Departamento de Justicia sobre por qué el Gobierno aún intentaba enviarlo al otro lado del Atlántico cuando Costa Rica había dicho previamente que lo aceptaría y le daría algún tipo de estatus legal.\n\n“¿Por qué el Gobierno se interpone en eso?”, preguntó.\n\nUn funcionario de ICE declaró bajo juramento que el país centroamericano ahora no está de acuerdo en recibirlo sin más negociaciones y compromisos con Estados Unidos. Pero Xinis dijo este jueves que no había “pruebas de que Costa Rica esté condicionando o reteniendo” su acuerdo previo.\n\nÁbrego García se encuentra en una instalación en Phillipsburg, Pensilvania, desde finales de septiembre, cuando las autoridades lo trasladaron allí desde un centro en Virginia. Fue detenido por funcionarios de inmigración en agosto después de ser liberado de la custodia penal en Tennessee, donde enfrenta cargos de tráfico de personas.\n\nÁbrego García estuvo detenido durante meses en el Centro de Confinamiento del Terrorismo (Cecot) en El Salvador luego de ser deportado erróneamente a mediados de marzo. Más tarde fue llevado de regreso a Estados Unidos para enfrentar los cargos penales.",
  "authors": [
    "Devan Cole"
  ],
  "url": "https://cnnespanol.cnn.com/2025/11/20/eeuu/jueza-decidira-ordenar-liberacion-kilmar-abrego-garcia-trax"
}