{
  "title": "'Reservation Dogs' Final Season Review",
  "text": "Paulina Alexis as Willie Jack, Devery Jacobs as Elora Danan, D'Pharaoh Woon-A-Tai as Bear, and Lane Factor as Cheese, at the end of Season 2 of \"Reservation Dogs.\" Shane Brown/FX\n\nThroughout its run, the FX series “Reservation Dogs” has often been my go-to recommendation when anyone asks if there’s a show they absolutely should be watching. I’ve described it as one of a kind, and as a show that’s pushing the entire medium of TV forward on several fronts. There’s its groundbreaking representation in front of and behind the camera, as the rare show led by an all-Native main cast, writers and directors. And shot on location on Muscogee Nation land in Oklahoma, it’s infused with a sense of place, authenticity and specificity.\n\nVisually and stylistically too, each episode feels like a uniquely transformative experience, wryly funny one minute and beautifully poignant the next. The show seamlessly moves between tones and genres, defying classification and expectations. Giving a pithy little description of it — the adventures and misadventures of four teens growing up on a Native reservation in Oklahoma — doesn’t quite do the show justice or fully capture the care and detail that has so clearly gone into every single episode. (TV and film writers and actors, including those who worked on “Reservation Dogs,” are currently on strike over more equitable pay and working conditions in the streaming era.)\n\nAdvertisement\n\nSometimes, it’s easier to just say: “Watch this show. Trust me, it’s great.”\n\nIn its third season, which begins Wednesday on Hulu, “Reservation Dogs” continues to soar and bring out the very best of what has made it great. Creator Sterlin Harjo recently announced his decision to end the show this season. While it’s crushing to say goodbye, the sadness is lessened by the fact that it’s nice when a show gets to end on its own terms, rather than getting unceremoniously canceled. The chance to go out on a high note is even rarer for shows created by people of color and other people from historically underrepresented communities.\n\nWatching the first few episodes of Season 3, it makes sense why the show has reached a logical endpoint. All of the Rez Dogs — Bear (D’Pharaoh Woon-A-Tai), Elora Danan (Devery Jacobs), Willie Jack (Paulina Alexis) and Cheese (Lane Factor) — are now on the cusp of adulthood and in a moment of transition. At the end of Season 2, they traveled to Los Angeles and saw the ocean for the first time, fulfilling a dream of their late friend Daniel, and getting a taste of what being far away from home is like. As Season 3 begins, they all seem to be grappling with what’s next, and what adulthood might look like for each of them. It feels like a natural place for a show to end.\n\nFrom the start, the show signals to us that things for the Rez Dogs are starting to shift. Recurring spirit William Knifeman (uproariously played by Dallas Goldtooth, also one of the show’s writers) often appears in Bear’s imagination to give him comically cryptic advice. In the season’s opening scene, he breaks the fourth wall.\n\nAdvertisement\n\nD'Pharaoh Woon-A-Tai as Bear and Dallas Goldtooth as spirit William Knifeman. Shane Brown/FX\n\nAs always, “Reservation Dogs” continues to not shy away from the darkness by confronting the history of Native trauma. There’s unfortunately no shortage of subject matter: colonialism, exploitation, displacement, dispossession; and Native communities today being perpetually underfunded, under-resourced and neglected by the federal government. That continues in this season’s third episode, which flashes back to the shameful history of federal Indian boarding schools, responsible for abusing generations of Native children. The show centers Native people in that history, while also allowing them to not solely be defined by their traumas — and does it all with warmth and humor.\n\nAs this wonderful gift of a show comes to a close, will Hollywood executives learn the right lessons from it? If history is any indication, probably not.\n\nAdvertisement\n\nRight now, with two major Hollywood strikes exposing the depths of corporate greed and a broken system, it can be hard not to feel angry. Artists are fighting to preserve their livelihoods and fighting for their tiny sliver of the pie. Meanwhile, Hollywood executives reap the benefits, while claiming the people who make all of the work they profit from are asking for too much (instead of, say, knocking off a zero or two from their salaries). And in times of corporate “cost-cutting,” historically underrepresented voices are often the first to go.\n\nWill more shows like “Reservation Dogs” get made? In an ideal world, the answer would be a resounding yes. But we know Hollywood and the powers that be do not often work that way. The fact that the answer isn’t an obvious certainty is itself an indictment of Hollywood’s broken system and how far we have yet to come.\n\nTo be crystal clear, there’s no shortage of Native talent out there, and the work will get made, regardless of whether Hollywood comes calling. Native artists, and artists from all kinds of underrepresented communities, are all too accustomed to finding ways to make their own work, creating community on their own and uplifting each other.\n\nAdvertisement\n\nPaulina Alexis as Willie Jack, Devery Jacobs as Elora Danan, D'Pharaoh Woon-A-Tai as Bear, Lane Factor as Cheese, Elva Guerra as Jackie. Shane Brown/FX\n\nMany of the people behind “Reservation Dogs” have exciting projects ahead. Jacobs, a star and writer on the show, has several shows and movies in the works, both in front of and behind the camera. Among them is starring in the new Marvel series, “Echo,” directed by “Reservation Dogs” director Sydney Freeland, and featuring a largely Native cast and crew. Writer-director Erica Tremblay recently made her feature directorial debut with her acclaimed Sundance film “Fancy Dance,” starring Lily Gladstone — just to name a few.\n\nSo the question isn’t necessarily will the next “Reservation Dogs” get made, but more precisely: Will it get the infrastructure to thrive? Will it get the institutional support afforded to predominantly white shows, like major promotional and awards campaigns — all the things that are supposed to happen with a universally beloved show? Case in point: For two years in a row, the Emmys have virtually shut out “Reservation Dogs,” despite the show consistently being on many TV critics’ “best of” lists. And last year, Peacock canceled the celebrated Native sitcom “Rutherford Falls” after only two seasons.\n\nAdvertisement",
  "authors": [
    "Senior Culture Reporter"
  ],
  "url": "https://www.huffpost.com/entry/reservation-dogs-fx-final-season-review_n_64c81e30e4b024f8ebca9173"
}