{
  "title": "Valve’s new Steam Controller might be my dream controller",
  "text": "is a senior reporter covering technology, gaming, and more. He joined The Verge in 2019 after nearly two years at Techmeme.\n\nPosts from this author will be added to your daily email digest and your homepage feed.\n\nOne of the best parts of the Steam Deck is its many different controls, and how you can customize them to let you do whatever you want with every single one of your games. Now, Valve is bringing that same level of flexibility into a new gamepad. I recently got to try it at Valve’s headquarters, and it feels like the controller I’ve always wanted.\n\nToday, Valve announced the second-generation Steam Controller. It’s a Bluetooth controller that works with any device that runs Steam, including Valve’s new Steam Machine PC and Steam Frame VR headset, and comes with a puck that serves as a low-latency wireless connector and doubles as a charging station. It will launch in early 2026 for a price that’s yet to be announced, though Valve is aiming to make the price competitive with other controllers with “advanced inputs,” according to hardware engineer Steve Cardinali.\n\nThe new controller up close. Photo by Everything Time Studio / The Verge\n\nThis is Valve’s second crack at building a Steam Controller. The first-generation model had two huge circular trackpads, only one joystick, and came in an unusual bulbous shape. It set out to give you mouse-grade pointing accuracy and a keyboard worth of customizable functions in the palms of your hands. Valve eventually discontinued the original model, but it never truly died; the company and devotees kept its configuration system alive as Steam Input, a system that now lets you configure your PlayStation, Xbox, and Nintendo controllers the same way.\n\nController use has gone up dramatically on Steam, with a significant chunk of people using Steam Input. For example, some have changed their Steam Deck controls to bind Hollow Knight: Silksong’s downward attack, key in battle and to explore the world, onto a single button. Steam Deck buyers sometimes discover that decades-old mouse-and-keyboard games are instantly playable because some diehard Steam Controller enthusiast built a community controller profile years ago.\n\nValve’s second-generation Steam Controller (left) next to its first-generation Steam Controller. Photo by Everything Time Studio / The Verge\n\nValve’s second-generation Steam Controller is much closer to a traditional gamepad than the old version. Imagine somebody took a Steam Deck, lopped off the screen, and smashed the two ends together, and you’ve got the general idea: It has standard gamepad grips, an improved D-pad, four main face buttons, two triggers, two bumpers, four back buttons, and even two Steam Deck-like touchpads — now canted and rotated roughly 15 degrees inward to compensate for the difference in grip between gamepads and handhelds. I never liked the way the old Steam Controller sat in my hands, but this new one felt intuitive right away.\n\nWith the new controller, Valve is also the first to put magnetic, drift-resistant sticks into a first-party pad — beating Sony, Microsoft, and Nintendo to the punch — after previously saying that they weren’t that important. Valve partnered with an unnamed vendor for the custom design, which uses TMR joysticks, though according to Cardinali, the design isn’t exclusive.\n\nThe Steam Controller has two brand-new capacitive sensors inside each grip to tell when you’re fully grasping it or have let go with some fingers. Valve calls this virtual button “Grip Sense,” and you can map anything to it, but the feature was originally suggested by a Valve employee who wanted a way to activate gyro aiming without moving their thumbs. The grips also have two “high output LRA haptic motors,” though I wasn’t able to test how much better they might make the controller feel in practice.\n\nMe holding the Steam Controller. The touchpads are in a great spot. Photo by Everything Time Studio / The Verge\n\nThis is a large controller. I was vaguely reminded of the OG Xbox “Duke” gamepad. But I loved that controller, and in the few minutes I got to play with the new Steam Controller a couple weeks ago, it felt really comfortable. (My colleague Sean says his “fingertips just melt into its circular back buttons.”)\n\nThe stick tops are a little thinner than on the Deck, though the sticks have the same grippy surfaces. The face buttons are less rattle-y, and charging the whole thing is pretty slick — you just bring the controller over the top of the included puck and that puck will magnetically snap into place.\n\nThe puck serves double duty: It gives the controller a low-latency, 8ms end-to-end connection to a computer, and charges the controller using pogo pins. Photo by Everything Time Studio / The Verge\n\nThe puck gives you a proprietary low-latency connection for up to four controllers at once, and Valve says you can use all four at up to 5 meters away with no dropouts. Valve’s engineers tell us they’ve tried up to 16 controllers at a time, but that’s not officially supported.\n\nValve’s new Steam Machine has a built-in antenna specifically to connect to the Steam Controller, so you can keep the puck next to your couch just for charging. Each controller gets an estimated 35 hours of battery life from an internal lithium pack.\n\nWe answered your burning questions about Valve’s new hardware. We hosted a subscriber-exclusive AMA about the Steam Machine, Steam Frame, and Steam Controller, and you can check out our responses here.\n\nWhile this controller isn’t powered by AA batteries like the older Steam Controller, Valve has made the lithium pack in this newer model user-replaceable: It pops out like an old cellphone battery after you open the gamepad. You can plug a USB-C cable into the Steam Controller directly to charge and play wired, too.\n\nPrevious Next\n\n\n\n\n\n\n\n\n\n\n\n\n\n1 / 8 Click the arrow buttons to see photos of a Steam Controller prototype with a clear shell (which Valve doesn’t plan to sell), the inside of the controller, and the controller’s box. Photo by Everything Time Studio / The Verge\n\nCardinali had me play Balatro with three different control schemes to show off what’s possible with the controller. For one blind, I used traditional gamepad controls, and playing it with the Steam Controller felt similar to what I’m used to with my Switch Pro Controller (another favorite gamepad of mine). For the next blind, I used the right touchpad as a mouse and the left touchpad as the mouse “buttons,” with the left side of the left pad as left-click and the right side as right-click. I wouldn’t say it was faster, but it paralleled a mouse experience. For the next blind, I activated gyro in the grips to move a mouse. Again, not necessarily a faster way to play, but I could see why some people might like it.\n\nIf you, like me, wish every controller offered the same level of flexibility for your games as the Steam Deck, I think this new Steam Controller is going to be an easy recommendation.",
  "authors": [
    "Jay Peters"
  ],
  "url": "https://www.theverge.com/games/815061/valve-steam-controller-hands-on-deck-frame-machine"
}