{
  "title": "Cuter and closer: Raccoons may be on their way to becoming America's next pet",
  "text": "Cuter and closer: Raccoons may be on their way to becoming America's next pet\n\nSome that have been adopted as pets have become TikTok celebrities. One particularly bold dumpster-diver even sprinted across the pitch during a Major League Soccer match in Philadelphia last year.\n\nEvaluation of nearly 20,000 photos found \"a clear reduction in snout length\" in urban raccoons compared to their rural cousins - a physical shift consistent with the early stages of domestication seen in cats and dogs.\n\nAffectionately referred to as trash pandas, the masked mammals known for rummaging rubbish bins for easy food, are evolving based on their proximity to humans, even starting to look cuter, a new study says.\n\nRaccoons may be inching closer to becoming America's next pet.\n\nThe stripe-tailed mammals, also nicknamed \"backyard bandits\", are widespread across the contiguous US.\n\nTheir ability to thrive in both wild and urban settings has left them occupying an unusual space in American life - beloved pet in some neighbourhoods, persistent pest in others.\n\nThe proximity to humans could signal that the creatures are growing more comfortable around us, or, scientifically speaking, dampening their innate flight responses, according to the study published in the journal Frontiers in Zoology.\n\nThe softening of their features could be due to shifts in their fight-or-flight response on the cellular level, it says.\n\nThis urban domestication starts with trash, the study's co-author, Raffaela Lesch of the University of Arkansas at Little Rock, told Scientific American.\n\n\"Trash is really the kickstarter,\" she said. \"Wherever humans go, there's trash — and animals love our trash.\"\n\nBut to take advantage of this endless buffet, wildlife must strike a delicate balance: bold enough to root through bins and navigate human environments, yet not so bold as to pose a threat.\n\n\"If you have an animal that lives close to humans, you have to be well-behaved enough,\" Lesch said. \"That selection pressure is quite intense.\"\n\nThe finding, the authors said, is consistent with the \"domestication syndrome phenotype\".\n\nDomestication syndrome - anatomical and morphological changes such as curly tails, floppy ears, depigmentation, smaller brains and reduced facial skeletons - are commonly cited as some of the most salient traits, the study says.\n\nThose traits are also seen among more common household pets, such as dogs that evolved from wolves.\n\nThe study's authors also hypothesised that the domestication process is wrongly believed to be initiated by humans, who have captured or selectively bred animals in the past.\n\nThe process might actually begin much earlier than previously thought, they said, notably when animals became habituated to human environments.\n\n\"Only animals with dampened flight (or fight) responses would succeed best,\" the authors wrote. \"This makes the initial stages of the domestication process a process of pure natural selection.\"",
  "authors": [],
  "url": "https://www.bbc.com/news/articles/c1j8j48e5z2o"
}