{
  "title": "Boris Becker: ‘Whoever says a prison life is easy is lying – it’s a real punishment’",
  "text": "“I heard the screaming and I didn’t know what it was,” Boris Becker says as he remembers staring into the dark in Wandsworth prison, just over two miles from Wimbledon’s Centre Court where he won the first of his three men’s singles titles at the age of 17 in 1985. “Were people trying to kill themselves or harm themselves? Or couldn’t they deal with their loneliness? Or are they just making crazy noises because they have lost their minds already?”\n\nBecker had been sentenced to a two-and-a-half-year jail term. Amid his insolvency, he was found guilty of not declaring all his assets so that additional funds could be distributed to his creditors. The judge confirmed that his money was used, instead, to meet his “commitments to his children and other dependents, medical and professional fees, and other expenses”.\n\nHe was taken from court to prison on Friday 29 April 2022, the start of a bank holiday weekend, which meant he was confined to a cell as bedlam broke out around him. “That Friday night until the Tuesday morning when I finally was let out to speak to the Listeners [trusted prisoners who support new inmates] were the three most difficult nights of my life.\n\n“You can’t sleep because all of it is true. In jail people do kill themselves, people do harm themselves and people do go crazy. It’s the harsh reality when you have never been to prison and that’s what your lawyers don’t tell you before – maybe not to scare you. HMP Wandsworth is probably one of the toughest prisons in the UK so to be put in there was quite a shock.”\n\nOn a Wednesday morning in Milan, having gained early release from jail when he was sent back to Germany in December 2022, Becker offers bracing and candid company. His gripping new book is an often harrowing, yet moving, insight into his time in prison and how he found calm after the tumult of his life until his mid-50s.\n\nBecker was a wunderkind, who blew tennis open as a powerful teenager and went on to win six grand slam titles. But fame engulfed him and he made many mistakes. He allowed himself to be surrounded by people who told him how great he was and he listened to their flattering advice. Eventually, he paid a terrible price for his hubris.\n\nView image in fullscreen Boris Becker won his first of six grand slams at Wimbledon in 1985 but he was surrounded by yes men. Photograph: Steve Powell/Getty Images\n\nHis book, expertly ghosted by Tom Fordyce, makes us feel as if we are in prison alongside him. The first few days and nights were terrifying and Becker remembers thinking: “This is torture. Surviving it all is an impossibility. I’m in a cage with a bunch of psychopaths. I’m alone and I’m lost.”\n\nHe suggests that “it’s easier said than done, but you have to find a way. Time is your enemy inside because the clock ticks very slowly. It’s 22 hours a day inside a tiny cell and that’s hard.”\n\nBecker adds that, “in hindsight, it was probably very good for me to stand still for a long time, and 231 days is quite a long time. To truly understand what happened to me before, to put the dance together of what happened, was a relief. But it doesn’t happen overnight.\n\n“You have to take real accountability and a cell life gives you that opportunity. I like to think I’m a pretty bright guy and eventually, you start thinking about the whys, ifs and whens of all that happened. Three years later, the reason I’m doing well is because I took full accountability for the good and bad I did.”\n\nThe 57-year-old leans forward to underline his next point. “But whoever says a prison life is easy is lying. It’s a real punishment.”\n\nBecker makes it clear how large sections of life inside Wandsworth and HMP Huntercombe, the Oxfordshire jail where he spent most of his sentence, were essentially run by the prisoners. The prison system seems broken and rehabilitation has to come from deep within an inmate’s own desire to change himself.\n\n“That’s a very important point you raise,” Becker says. “That’s why you have so many reoffenders, committing crime after crime after crime, so they’re inside for the second, third or fourth stint. So you have to really take a good look at yourself, be disciplined in your thoughts and find a [positive] conclusion. Then rehabilitation is possible – but it all starts with you.”\n\nSome aspects of prison can be positive and Becker stresses that his rehabilitation was enhanced by a benevolent warder, Andy Small, who persuaded him to take a course in stoicism. “It helped me and eventually, I became a stoic teacher myself where I could talk to inmates and try to rehabilitate some of them in the hope that, once they’re out, they stay on the straight and narrow. Andy was a very tough guy who ran the gym but he showed me how I could tell young prisoners my life story, about having everything and losing everything, and not be too down about it.\n\nView image in fullscreen ‘You have to take real accountability and a cell life gives you that opportunity. Eventually, you start thinking about the whys, ifs and whens of all that happened.’ Boris Becker believes rehabilitation starts with the offender. Photograph: Marta Clinco/The Guardian\n\n“That was huge for me. Andy put his faith into me and I think I delivered. It’s the same now. I read lots of books and I recommend the philosophy of stoicism to people who have issues in the free world. It’s more important than ever with the trying times we live in.”\n\nBecker smiles and says: “I was a stoic without knowing it when I was playing tennis. I lived in the moment and I never really had difficulties with pressure on court. I always felt comfortable in my own skin when I was playing tennis. I used some of the stoic methods when I was a tennis player. I just didn’t know it.”\n\nHe remembers some beautiful moments in prison. Becker coached Novak Djokovic to six grand slam final victories and so he was engrossed when watching Wimbledon on a small television in his cell in the summer of 2022. As Djokovic won match after match to reach the final against Nick Kyrgios it seemed as if his wing of the prison had become immersed in tennis.\n\nThe final that Sunday afternoon was noisy as the prisoners banged on their cell door whenever Djokovic won another big point. Becker remembers that, after a pulsating four-set final, “I wasn’t afraid any more. And when Novak won, and raised his arms, I stood up and raised my arms too. As I did so, the noise along the wing broke out again, louder than ever before. The banging didn’t stop for 10 minutes. On walls, on doors. With cups, with chairs. It had taken me two weeks to educate them that this was my man, and now I realised. They had understood. I stood there and I cried.”\n\nHis emotions were intensified by the fact that Djokovic had arranged tickets for Becker’s partner [and now wife], Lilian, and his eldest son, Noah, and they were in his box for every match. “I saw them ringside at every game,” Becker says, “and that’s what I call true friendship, that you’re not forgotten. I always thank Novak for this special memory.”\n\nIf Becker was still coaching Djokovic today would they discuss the 38-year-old’s eventual retirement? “Look, I think he’s important for tennis today. He leads by example and shows the young players the amount of dedication you need to come to the top and then stay on top. He’s still chasing his 25th grand slam and reached all four major semi-finals this year and won two tournaments. Who are we to challenge Novak when to stop? I heard the other day that he wants to play at the Olympics in LA 2028. Let him. We need him.”\n\nskip past newsletter promotion Sign up to The Recap Free weekly newsletter The best of our sports journalism from the past seven days and a heads-up on the weekend’s action Enter your email address Sign up Privacy Notice: Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on theguardian.com to send you this newsletter. You can complete full registration at any time. For more information about how we use your data see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nWill Djokovic win his record-breaking 25th slam? “Whoever was playing against Novak Djokovic lost a lot of money for the last 20 years. So I’d never bet against Novak.”\n\nView image in fullscreen Boris Becker coached Novak Djokovic to six grand slam final wins during the three years they worked together. Photograph: Tom Jenkins/The Guardian\n\nBecker praises the brilliance of Jannik Sinner and Carlos Alcaraz. He is also amazed by their classy friendship and deep respect for each other when remembering how he was often at war with his bitter rivals Michael Stich, Andre Agassi and Pat Cash. “Well, it’s a little bizarre,” he says of the Sinner-Alcaraz bromance, “but they’re role models and it’s wonderful they have this chemistry on and off court. Our generation was different. We didn’t have any social media. We had different qualities. But, in this trying world, I really appreciate Jannik and Carlos’s behaviour. I talk to them, as they don’t shy away from conversations with us former champions.”\n\nTouchingly, Becker has also fully reconciled past differences with his old rivals. Stich wrote him a moving letter when he was inside and Cash, a fellow stoic, came to see him and talk about stoicism in prison. He is now friends with Agassi whom he calls “a brother from another mother”.\n\nWhen Becker turned 55 on 22 November 2022 he was locked up in Huntercombe. Each cell had a solitary kettle. But Becker had never made himself a cup of coffee before jail, let alone boiled a kettle in his pampered life. Before his incarceration he would just pop a capsule into his swish coffee machine. So he had to learn a very basic life skill inside.\n\nView image in fullscreen Boris Becker now lives in Milan. Photograph: Marta Clinco/The Guardian\n\nBut he was still stunned that three inmates had somehow obtained the ingredients to make him three cakes in their kettles for his birthday. “I still don’t know how they did it but they gave me a lemon cake, a chocolate cake and a carrot cake. It was very difficult to cook any decent food for yourself in your kettle, let alone bake a cake, but they did it. Normally you hope your loved one might give you a cake for your birthday or at a restaurant they’ll bring over a beautiful cake with candles. But to have three small cakes baked for me by other inmates made it one of the most emotional birthdays I’ve ever had.”\n\nHow did they taste? “They tasted great and we all ate them.”\n\nHe and Lilian now live in Milan and he is working hard, mostly covering tennis and football on Italian television. He is also finally free of all his debts and delusions and, having been through so much glory and infamy, Becker is suitably philosophical: “One of the features of stoicism is that you can’t predict the future. I’m trying hard to have a good life with my wife and my other family. Italy is a wonderful country and life’s good at the moment.”\n\nHis weathered face lights up when confirming that Lilian will soon give birth. “You fall in love with a woman at the most difficult time in your life, which for me was in the spring of 2018 when my [second] marriage failed and I was insolvent and really struggling. But Lilian sticks with me through thick and thin, even though she doesn’t need to. She’s independent, she’s smart, she’s educated. Quite frankly, without her I wouldn’t be sitting like this now.”\n\nBecker pauses and shakes his head in wonder. “Now, to have our first child together in a couple of weeks is a Hollywood movie. I pinch myself sometimes that it happened to me. So I really understand this is a proper second chance. I’m trying to make the most of it.”\n\nInside by Boris Becker is published by HarperCollins\n\nIn the UK, the charity Mind is available on 0300 123 3393 and Childline on 0800 1111. In the US, call or text Mental Health America at 988 or chat 988lifeline.org. In Australia, support is available at Beyond Blue on 1300 22 4636, Lifeline on 13 11 14, and at MensLine on 1300 789 978\n\nIn the UK, Citizens Advice offers a debt helpline on 0800 240 4420. In Australia, the national debt helpline is available on 1800 007 007",
  "authors": [
    "Donald Mcrae"
  ],
  "url": "https://www.theguardian.com/sport/2025/nov/20/boris-becker-prison-tennis-interview"
}