{
  "title": "¿Qué sabemos del presunto autor intelectual del homicidio del alcalde de Uruapan en México?",
  "text": "CNN Español —\n\nAutoridades de seguridad de México anunciaron el miércoles la detención de uno de los presuntos autores intelectuales del homicidio de Carlos Manzo, el alcalde del municipio de Uruapan asesinado la noche del 1 de noviembre después de participar en una festividad pública de ese municipio del estado de Michoacán.\n\nEl secretario de Seguridad federal de México, Omar García Harfuch, dijo en una conferencia de prensa que este arresto es “un paso clave” para esclarecer este crimen que ha generado numerosas reacciones y protestas, así como para acabar con las redes delictivas que generan violencia en esa zona del país.\n\n¿Quién es el detenido?\n\nEn la conferencia de prensa del miércoles, las autoridades identificaron al sospechoso como Jorge Armando “N”, alias “El Licenciado”, a quien señalaron como uno de los líderes de una célula delictiva local y uno de los presuntos responsables de planear y ordenar el homicidio del alcalde.\n\nCNN busca saber si el detenido ya cuenta con representación legal y cómo se declara.\n\nEl sospechoso fue detenido el martes 18 de noviembre de 2025 en la colonia Centro de Morelia, capital de Michoacán. Secretaría de Seguridad y Protección Ciudadana de México\n\nManzo llegó a la Alcaldía de Uruapan en septiembre de 2024 tras ganar las elecciones de ese año como candidato independiente. Durante su mandato, se dio a conocer por pedir a los gobiernos federal y estatal que le brindaran apoyo para combatir a la delincuencia en Uruapan, un municipio con importante actividad agrícola y donde muchos productores dicen ser víctimas de extorsiones.\n\n¿Cómo ocurrió el arresto?\n\nDe acuerdo con las autoridades, Jorge Armando “N” fue detenido el martes en un domicilio de la colonia Centro de Morelia, capital de Michoacán. En el operativo participaron fuerzas federales y estatales, se indicó.\n\nEn una presentación difundida a la prensa, la Secretaría de Seguridad y Protección Ciudadana de México (SSPC) señaló también que se le decomisaron una identificación, un arma corta, un cargador, dos equipos telefónicos, un teléfono celular, dosis de droga (cristal), una bolsa con una sustancia granulada y un vehículo.\n\nGarcía Harfuch dijo el miércoles que el sospechoso fue localizado gracias a investigaciones que incluyeron la revisión de cámaras de videovigilancia, entrevistas y análisis de dispositivos electrónicos.\n\nAgregó que las autoridades tenían identificado al presunto autor material del ataque, un menor de edad de 17 años quien fue abatido momentos después de disparar contra Manzo, así como a otros dos hombres jóvenes presuntamente involucrados en los hechos.\n\nEsos dos hombres, dijo García Harfuch, fueron localizados muertos el 10 de noviembre. Sus cuerpos estaban en una carretera de Michoacán y su homicidio, consideró el secretario, buscaba “impedir el desarrollo de las investigaciones” del asesinato de Manzo.\n\nGarcía Harfuch detalló que, al día siguiente del hallazgo de los cadáveres, las autoridades encontraron los teléfonos de estos hombres, los analizaron y detectaron que uno de los fallecidos estaba en un grupo de una aplicación de mensajería en el que se coordinó el ataque contra el alcalde.\n\nAhí, dijo García Harfuch, observaron que Jorge Armando “N” fue quien dio las instrucciones para la agresión. Por ejemplo, ordenó que el 1 de noviembre se diera seguimiento a Manzo y que se le disparara “aun cuando estuviera acompañado”.\n\nDespués del ataque, “en el grupo les pidieron a todos ocultarse para evitar ser detenidos”, expuso el secretario.\n\n¿Qué rol desempeña el Cártel Jalisco en este caso?\n\nDe acuerdo con las autoridades, la célula delictiva de la que Jorge Armando “N” es uno de los presuntos líderes está ligada con el Cártel Jalisco Nueva Generación, considerado uno de los más violentos del país.\n\nAutoridades de México y Estados Unidos señalan a Nemesio Oseguera Cervantes, alias “El Mencho”, como el presunto líder de esta organización. Incluso, la Agencia de Control de Drogas de EE.UU. (DEA, por sus siglas en inglés) ofrece una recompensa de hasta US$ 15 millones por información que lleve a su captura.\n\nEl Cártel Jalisco ha cobrado fuerza a lo largo de los últimos 10 años y disputa al Cártel de Sinaloa el control de rutas para el tráfico de drogas. Tiene presencia en varios estados de México, como Jalisco, Michoacán, Estado de México, Guanajuato y Zacatecas, y también se le atribuyen asesinatos y extorsiones.\n\n¿A cuántas personas se les vincula con el homicidio de Manzo?\n\nJorge Armando “N” es hasta ahora la única persona detenida y puesta ante la Justicia por este caso. Los otros tres presuntos involucrados, el presunto autor material del ataque y dos supuestos cómplices, están muertos.\n\nEn este contexto, García Harfuch y el fiscal de Michoacán, Carlos Torres Piña, dijeron el miércoles que las investigaciones continúan y previeron que habrá más arrestos.\n\nGrecia Quiroz, viuda de Manzo y a quien el Congreso de Michoacán nombró como alcaldesa sustituta, dijo esta semana, en una entrevista con la periodista mexicana Adela Micha, que en el encuentro privado que tuvo con la presidenta Claudia Sheinbaum le pidió que haya justicia en este caso y “que pague quien tenga que pagar”.",
  "authors": [
    "Mauricio Torres"
  ],
  "url": "https://cnnespanol.cnn.com/2025/11/20/mexico/presunto-autor-intelectual-homicidio-manzo-quien-es-orix"
}