{
  "title": "Mani’s writhing, relentless bass was the Stone Roses’ secret sauce – it taught indie kids how to dance",
  "text": "By any metric, the rise of the Stone Roses was a sudden and remarkable thing. It took place over the course of 12 months. At the start of 1989, they were just a local cause of excitement in Manchester, largely ignored by the traditional outlets for alternative rock in Britain. John Peel wasn’t a fan. The music press had barely mentioned their most recent single, Elephant Stone. They were barely able to fill even a more modest London venue such as Dingwalls. But by November they were huge. Their single Fools Gold had entered the charts at No 8 and their performance was the big attraction on that week’s Top of the Pops – a barely imaginable state of affairs for most indie bands in the late 80s.\n\nIn retrospect, you can find any number of reasons why the Stone Roses cut such an extraordinary path, clearly attracting a far bigger and broader audience than usually displayed an interest in alternative rock at the time. They were set apart by their look – which seemed to align them more to the burgeoning acid house scene – their cockily belligerent attitude and the skill of the guitarist John Squire, unashamedly virtuosic in a world of distorted thrashing downstrokes.\n\nBut there was also the incontrovertible fact that the Stone Roses’ rhythm section swung in a way completely unlike anything else in British alt-rock at the time. There’s an argument that the melody of Made of Stone bore a distinct resemblance to that of Primal Scream’s old C86-era single Velocity Girl, but what the bass and drums were doing behind it really didn’t: you could dance to it in a way that you simply couldn’t to most of the tracks that graced the turntables at the era’s indie discos. You somehow got the impression that the drummer Alan “Reni” Wren and the bassist Gary “Mani” Mounfield had been raised on music rather different to the standard indie band set texts, which was absolutely right: Mani was a huge fan of the Byrds’ bassist Chris Hillman but his guiding lights were “good northern soul and funk”.\n\nThe fluidity of his playing was the secret sauce behind the Stone Roses’ eponymous debut album: it’s him who drives the moment when I Am the Resurrection shifts from Motown stomp into loose-limbed funk, his octave-leaping lines that put a spring in the step of Waterfall. Sometimes the sauce wasn’t so secret. On Fools Gold, the focal point of the song isn’t really the vocal melody or Squire’s wah-pedal-heavy playing, or even the breakbeat borrowed from Bobby Byrd’s 1971 single Hot Pants: it’s Mani’s writhing, relentless bass. When you think of She Bangs the Drums, the first thing that springs to mind is the bass line.\n\nView image in fullscreen The Stone Roses photographed in 1989. Photograph: Avalon/Getty Images\n\nIndeed, in Mani’s view, when the Stone Roses went wrong musically it was because they were insufficiently funky. Fools Gold’s underwhelming follow-up One Love was underwhelming, he suggested, because it “could have swung a little more, it’s a little bit rigid”. He was a staunch defender of their oft-dismissed second album, Second Coming but thought its flaws could have been rectified by removing some of the layers of Led Zeppelin-inspired guitar and “reverting to the groove”.\n\nHe may well have had a point. Second Coming’s scattering of highlights usually coincide with the moments when Mounfield was really allowed to let rip – Daybreak, Love Spreads, the superb Begging You – while on its more turgid songs, you can hear him metaphorically willing the band to pick up the pace. His playing on Tightrope is completely at odds with the listlessness of everything else that’s happening on the track, while on Straight to the Man he’s audibly trying to inject a bit of pep into what’s otherwise some nondescript country-rock – not a genre one suspects anyone was in a hurry to hear the Stone Roses give a try.\n\nPrimal Scream: Kill All Hippies – video\n\nHis efforts were in vain: Wren and Squire left the band in the wake of Second Coming’s release, and the Stone Roses imploded entirely after a disastrous headlining set at the 1996 Reading festival. But Mani’s next gig with Primal Scream had an impressively galvanising effect on a band in a slump after the cool reception of 1994’s rock-y Give Out But Don’t Give Up. His sound became dubbier, heavier and more distorted, but the swing that had given the Stone Roses a point of difference was still in evidence – particularly on the low-slung funk of the 1997 single Kowalski – as was his ability to push his playing to the fore. His popping, hypnotic bass line is very much the star turn on the fantastic 1999 single Swastika Eyes; his playing on Kill All Hippies – like Swastika Eyes, a highlight of Xtrmntr, easily the best album Primal Scream had made since Screamadelica – is magnificent.\n\nAlways an affable, clubbable presence – the writer John Robb once noted that the Stone Roses’ hauteur towards the media was invariably punctured if Mani “let his guard down” – he took the stage at the Stone Roses’ 2012 reunion concert at Manchester’s Heaton Park playing a customised bass that bore the legend “Super-Yob”, the nickname of Slade’s preposterously coiffured and permanently grinning guitarist Dave Hill. Said reunion failed to translate into anything more than a lengthy succession of hugely lucrative gigs – two new singles released by the reconstituted quartet served only to prove that whatever magic had existed in 1989 had proved impossible to recapture 18 years on – and Mani quietly announced his retirement in 2021. He’d made his money and was now more concerned with fly-fishing, which furthermore provided “a good excuse to go to the pub”.\n\nPerhaps he felt he’d done enough: he’d certainly made an impact. The Stone Roses were influential in a variety of ways. Oasis certainly took note of their swaggering attitude, while Britpop as a whole was informed by a desire to break the standard commercial constraints of alternative music and reach a more mainstream audience, as the Roses had done. But their most obvious immediate effect was a kind of rhythmic shift: in the wake of their initial success, you suddenly couldn’t move for indie bands who wanted to make their audiences dance. That was Mani’s musical raison d’être. “It’s what the bass and drums are for, aren’t they?” he once averred. “That’s what they’re for.”",
  "authors": [
    "Alexis Petridis"
  ],
  "url": "https://www.theguardian.com/music/2025/nov/20/mani-writhing-relentless-bass-the-stone-roses-secret-sauce-taught-indie-kids-to-dance#comments"
}