{
  "title": "5 things I love about Amazon’s new Echo Shows — and 3 things I don’t",
  "text": "is a senior reviewer with over twenty years of experience. She covers smart home, IoT, and connected tech, and has written previously for Wirecutter, Wired, Dwell, BBC, and US News.\n\nPosts from this author will be added to your daily email digest and your homepage feed.\n\nAmazon’s newest Echo Show smart displays launch this week. They’re purpose-built for the new AI-powered Alexa Plus, which comes preloaded in the US. I’ve had a couple of days to play with them, and I have some early thoughts to share.\n\nOverall, the devices are a significant upgrade from the last-gen Show 8 and aging Show 10. They’re sleeker, with more modern hardware, a more responsive touchscreen, and packed with radios and sensors. They’re also powered by the new AZ3 Pro processor, which makes them feel faster. The new Shows look ready to take center stage in your smart home.\n\nBut Amazon tells me that the devices will still display the full-screen ads the company recently introduced to its devices. And that significantly dampens my enthusiasm for the new hardware.\n\nThe Echo Show 8 ($179.99) and Echo Show 11 ($219.99) are mostly identical to each other, save for the bigger 10.95-inch, full HD touchscreen on the 11. The 8 sports a smaller, 8.7-inch HD display. If you want more room to see your Ring cameras, or watch Prime Video, or use the calendar frequently, opt for the 11. If you just want to use the screen for controlling music and smart home devices and glanceable info like weather and shopping lists, the 8 is fine.\n\nBoth Shows share the same oblong speaker base wrapped in 3D knit fabric containing a 2.8” woofer and two full-range drivers, so they have the same sound. Both run Amazon’s new Vega OS, and feature a 13MP camera along with support for Wi-Fi 6E, Bluetooth, and Thread, Matter, and Zigbee smart home protocols. They also have Wi-Fi sensing presence detection in addition to the existing ultrasound sensors and built-in temperature sensors, which can be used to trigger Alexa Routines.\n\n1. Better hardware\n\nThe Echo Show 11 has a clear, crisp display. The more slimline screen is also a nice update. The Echo Show 8 has the same design with a smaller screen. Both screens are very responsive to touch.\n\nThe most striking thing about the new Shows is the hardware. The fabric-wrapped speaker and thin, floating display are a significant step up from the chunky styling of the Echo Show 8 (third gen) or bezel-heavy Echo Show 15. Amazon has combined a good touch interface with an improved speaker on these devices, allowing them to work as both excellent voice control devices and intuitive touchscreens.\n\nIt’s a Show-off. The Echo Show 8 third-gen alongside the new model.\n\nThe touchscreen is more responsive than previous iterations — not as responsive as a tablet or smartphone, but much closer. This makes using it to access content, such as music or smart home controls, smoother and less frustrating.\n\nI’m also a big fan of the fabric-wrapped color-matched cables, which sit flat and add a touch of sophistication to the devices they previously lacked (white cables with black smart speakers is a crime against design).\n\n2. Better listeners\n\nThe Echo Show 8 makes a good desk companion.\n\nI’ve struggled with voice commands on Echo Show devices, particularly the Show 15 and 21. I’ll talk to the one in my kitchen, and the Echo Spot in my bedroom will answer — not helpful when setting a timer for my waffles. The new Shows both responded to my voice every time, even with other devices nearby, a big improvement.\n\nAlexa Plus on the Shows is optional during setup (in the US) and brings a more conversational voice assistant that has more capabilities. However, my favorite feature of Alexa Plus so far is not having to say the wake word repeatedly. Especially in the kitchen, where I put the Show 11, being able to add multiple items to my shopping list while moving around and ask questions about my calendar, the weather etc., without constantly saying Alexa, is really nice. I wish it could still listen for a longer period between commands; it seems to cut out within about 15 seconds.\n\n3. Better software\n\nThe Media Control Center offers easy access to music, podcasts, books, and sounds without using voice.\n\nTraditionally, Echo Shows have been voice-first — easier to control and use with voice than with touch. The new Alexa Plus interface on these Shows (which is also coming to existing Shows) finally allows for more intuitive control with touch, making interacting with the Show more like using a tablet.\n\nThe biggest improvement is that, instead of swiping down from the top of the screen, there’s now a small menu button on the top left. Having a target makes it much easier to get to the additional controls.\n\nThe menu opens to controls for brightness, disabling/enabling the camera, Do Not Disturb toggles, and other settings, along with buttons to take you to other screens, including audio, video, smart home, photo slideshow, and more.\n\nThe calendar screen is a nice update. Here it’s shown on the third-gen Show 8 and the latest-gen model.\n\nI really like the media control center, which now offers five tabs for you to scroll through and browse, allowing you to select music, ambient sounds, podcasts, and audiobooks. The audio playback screen is now easier to get to and lets you control content on multiple speakers with just a few taps.\n\nI’m impressed with the improved calendar layout. It’s larger, easier to read, and offers several views, from day, week, and month. I’ve enjoyed using the new Alexa Plus calendar import feature, which allows me to email events to Alexa or upload a flyer or photo via the app, and it will automatically import them. It’s done this largely accurately so far.\n\nIt’s similar to the feature I tested and loved on the Skylight Calendar and is a great productivity upgrade. (Although it only works on personal Google accounts, annoyingly.)\n\n4. A smarter smart home dashboard\n\nThe smart home control panel is comprehensive, I especially like the All Off and All On button for quick room control.\n\nThe new smart home dashboard on the Shows is easy to access with two taps, or by saying “Alexa, open my smart home dashboard.” It navigates smoothly between your rooms, cameras, and groups, such as lights, locks, and shades. I would like the option to keep this full screen, but I guess that’s what the Echo Hub is for. The home screen can display a fairly limited smart home widget.\n\nI’m still not a huge fan of the widgets, and I haven’t seen much improvement with the new devices. They still feel large, clunky. and not super useful.\n\nAmazon says a new customizable smart home widget is coming to the Shows that will present a snapshot of your Ring camera feeds, the status of your smart home devices, along with contextual updates from the cameras. I’m excited to try that out.\n\n5. Better video integration\n\nThe Ring camera integration is very useful, but I wish it would work with other brands.\n\nSpeaking of Ring, the new Show devices offer a lot for Ring users. You can view multiple video streams simultaneously, access a live feed from any camera, and see feeds from all your cameras in the Smart Home dashboard. Video is also crisper on the Show 11 with its higher resolution.\n\nIf you have Ring Premium, you can tap into Ring’s AI-powered video search and ask Alexa to show you specific moments, such as “show me every time my cat was on the back porch today.” Amazon says it’s rolling out custom alerts soon, so you can ask Alexa to notify you when it sees a cat on the porch.\n\nThe company also says a Home Highlights feature is in development. This sounds similar to Google’s Home Brief, where Alexa will present a summary of things that happened around your home. This will feed into another new feature, “Missed Habits,” where Alexa will look for patterns in your home and alert you when you might have forgotten to do something, like take out the trash. This all sounds super useful, if it works. But none of this is live yet.\n\nThree things I don’t like\n\nThe new Shows don’t have a physical camera cover, instead, you turn off the camera with the mute button — shown here at the top above the volume controls\n\nThere’s no physical camera cover on either of the new Shows. Instead, you press a mute button above the two volume controls on the screen’s right-hand side to deactivate the camera and mic (you can also disable the camera in the device’s settings or in the Alexa app). I get that the thinner bezel — one of my favorite features — limits the ability to add a physical shutter, but I don’t like that it’s gone.\n\nThe new TV & Video screen looks great, but is very limited. The only native apps are Prime Video and Fire TV channels; all the other widgets for YouTube, TikTok, HBO etc., launch a web browser. Amazon just needs to go ahead and make the Show 8 and Show 11 full Fire TV devices, like the Show 15 and Show 21 are.\n\nWhile I haven’t seen any ads on my test units yet, Amazon confirmed to me that the Show 8 and Show 11 will display full-screen ads between your content. Which will really ruin the overall more polished vibe that this new upgraded hardware brings to the Alexa experience.\n\nI’ll have a full review soon, but so far these new Shows feel like the most capable — and most conflicted — Echo devices yet.\n\nPhotos by Jennifer Pattison Tuohy / The Verge",
  "authors": [
    "Jennifer Pattison Tuohy"
  ],
  "url": "https://www.theverge.com/tech/818814/amazon-echo-show-11-8-alexa-plus-hands-on"
}