{
  "title": "WiredLeaks, come mandarci una segnalazione anonima",
  "text": "3.Nella barra degli indirizzi di Tor Browser, naviga verso la pagina https://www.wiredleaks.it. Se il bottone per le segnalazioni non è ancora attivo nonostante tu stia usando il Tor Browser, dovrai cliccare su .onion disponibile che si trova in alto a destra, nella barra degli indirizzi.\n\nFinirai su un sito dall’indirizzo composto di numeri e lettere, che termina con .onion. Non c’è nulla di strano: vuol dire che il sistema ha correttamente riconosciuto la tua connessione tramite Tor e che puoi procedere.\n\n4.Premi il pulsante Invia una segnalazione e segui le indicazioni, scegliendo l’argomento della tua segnalazione e rispondendo alle domande che ti verranno mostrate: più sarai preciso e più facilmente riusciremo a dare seguito alla tua segnalazione. Se ti sembra che nessuno dei percorsi specifici sia adatto al tuo caso, usa il pulsante Altro. Alla fine della procedura potrai allegare allegare uno o più file di diversi formati, fino a 30 megabyte. Se hai bisogno di inviare file più grandi scrivilo nella segnalazione e inviala: ti risponderemo dicendoti come fare (sempre anonimamente).\n\nRestiamo in contatto\n\nAlla fine della segnalazione riceverai un codice numerico di 16 cifre: salvalo da qualche parte e non perderlo. Quella è la tua unica chiave di accesso per tornare sulla piattaforma, dialogare con la redazione di Wired (sempre in modo anonimo) e rispondere a eventuali domande che potrebbero essere preziose per portare a termine il nostro lavoro.\n\nPer farlo, sarà sufficiente inserire il codice nel campo bianco della homepage di WiredLeaks, subito sotto il pulsante Invia una segnalazione. Se ci hai scritto, è da questa pagina che potrai leggere i nostri commenti ed eventualmente le domande che potremmo avere bisogno di inviarti.\n\nNon riceverai mai alcuna notifica che indichi che ti abbiamo scritto, ma lo faremo, nel minor tempo possibile. Per questo ti chiediamo di controllare periodicamente e leggere gli aggiornamenti che ti avremo lasciato sulla pagina. La tua collaborazione, pur nel massimo anonimato, è importante per poter indagare sulla segnalazione che ci sottoporrai.\n\nPer approfondire\n\nCome tante altre professioni, anche il giornalismo deve aggiornarsi, interpretando il mondo che lo circonda e perfezionando le proprie tecniche in risposta alle esigenze che cambiano. A questo serve WiredLeaks: piattaforma tecnologica che, nel mondo sempre più connesso e sorvegliato, garantisce al giornalista la più tradizionale delle sue prerogative, ovvero la possibilità di comunicare in modo anonimo con le fonti. Questo è oggi possibile soprattutto grazie al Centro Hermes per la trasparenza e i diritti umani digitali, che da anni ha messo gratuitamente a disposizione di chiunque lo desideri il software GlobaLeaks: motore della nostra iniziativa come di tante altre in tutto il mondo. Recentemente adottata anche dall’Autorità nazionale anticorruzione (Anac) e altre istituzioni, GlobaLeaks permette a giornalisti e organizzazioni per la tutela dei diritti umani di svelare violazioni dei diritti umani e condurre inchieste di portata globale.\n\nAllo stesso modo sono di fondamentale importanza il Tor Project e la rete Tor: strumento cruciale per garantire a tutte le voci di essere ascoltate, senza timore di ripercussioni. Quando visiti un sito, scrivi un commento o più semplicemente leggi un articolo tramite Tor, nessuno può sapere chi sei o dove abiti (salvo rare e specifiche eccezioni): una caratteristica fondamentale per chi vive nei Paesi più liberticidi, ma che speriamo possa essere utile anche ai nostri lettori e alle nostre fonti.",
  "authors": [],
  "url": "https://www.wired.it/internet/web/2021/02/15/wiredleaks-come-fare-segnalazioni-anonime/"
}