{
  "title": "The Best N95, KF94, and KN95 Face Masks (2025)",
  "text": "Since the COVID-19 pandemic five years ago, WIRED has continued to update our mask recommendations due to the constant changes in availability and evolving guidance. Add to that the threat of toxic air, not only from wildfire smoke but, even worse, from burning homes. Now is the time to purchase masks in the same way one would buy a first aid kit or medicine, just in case. Some masks—like our top affordable pick, the Honeywell Safety DF300 N95 Flatfold ($13 for 50)—are ideal for public transportation or for use in a theater, and others—like our top overall N95 pick, IQAir's KN95/FFP ($60 for 10)—are put on during or after a wildfire. With the risk of disruption hitting mask supply chains, along with the issues of counterfeit masks, community spread of illness, a longer and more active wildfire season, climate change, and the sometimes-vanishing guidance pages on government websites, it’s important to keep your masks at the ready.\n\nMost alarming is the Trump administration’s recent gutting of the National Institute for Occupational Safety and Health, or NIOSH. The Centers for Disease Control (CDC) website declares, “Due to the reduction in force across NIOSH, no new respirator approval applications can be accepted.” This will impact compliance and safety of new and future manufactured masks. Masks do have expiration dates, but I still think now is a good time to stock up on a variety of masks that you know are certified safe and effective.\n\nWe've also included some tips on mask care and choosing the best kind of mask straps at the end of this list. Be sure to check out our other air quality guides, including the Best Air Purifiers, Best Indoor Quality Monitors, and Best Fans.\n\nUpdated November 2025: We've added the 1870+, 9205+ and 9211+ N95 respirators from 3M Aura, and masks from Lement and Kimtech. We've also removed out-of-stock items and updated prices throughout.\n\nN95 Masks\n\nN95 masks are made to US standards for filtering 95 percent of particulates. The CDC has a giant list of approved N95 masks. Unfortunately, the supply of many brands is constantly fluctuating (even in 2025), so you may need to check back regularly to see which are in stock. Many stores also have regional stock based on in-store supply, so be sure to check your local zip code where applicable.\n\nBest N95 for the Next Pandemic\n\nAt WIRED, we continue to test and wear masks from 3M’s Aura series, and the red-strapped 1870+ is an FDA-cleared surgical mask. The 1870+ carries the highest level of fluid resistance, at 160 mmHg. According to the CDC, “A primary test for the fluid barrier is a qualitative test in which synthetic blood is projected onto the exterior of the mask at a specific pressure.” (In this case, at 160 mmHg.) If the 1870+ can stand up to a torn artery spouting blood, it can handle the coughs and sneezes of a world gone ill. It can protect the wearer from “microorganisms, body fluids, and particulate material.” Unlike 3M’s Aura 9211+, the 1870+ feels less breathable, but like the 9211+, it doesn’t fog up my eyeglasses. It has a firm seal and is comfortable to wear. I am not a fan of full head straps, though I understand they are a necessary evil. I prefer ear loops, but this is a mask I will always keep in my home.\n\nShelf Life 5 years from date of manufacturing Sizes Adult Adjustable Straps 2 red latex-free rubber full head straps\n\nGreat Protection at an Affordable Price\n\nAt around $20 for a box of 10, 3M’s Particulate Respirator N95 is a NIOSH-approved mask to wear when the Air Quality Index (AQI) is very unhealthy or hazardous. This is the mask to keep in your car, next to your emergency bottles of water and granola bars. And while fire season seems to last all year, having a solid respirator can mitigate some of the health hazards of breathing in bad air. 3M’s mask is not as comfortable as IQAir’s soft-fitting mask, below, but it does have an adjustable nose clip along with two rubber-band-like nonadjustable straps that go around your entire head, and it boasts 3M’s proprietary Cool Flow Valve that claims to keep the face cool in hot weather. That said, the mask’s barnacle-like fit on one’s face does exactly what it is supposed to do: It keeps the seal. While it didn’t fog up my glasses, it isn’t made for comfort. Still, everyone needs a good respirator N95 in their mask collection, and 3M has made one that is both effective and budget-friendly.\n\nShelf Life 2.5 years Sizes Adult Adjustable Straps Yes\n\nAn Upgrade Pick\n\nCourtesy of Demetech DemeTech Folding N95 Respirator Masks $75 DemeTech (20 Count)\n\nThis fold-style mask uses two over-the-head straps to keep the mask snug on your face, while still allowing a fair amount of breathing room in front of your mouth and nose. These are among the pricier masks on our list, but members of our team have used these and found them comfortable and sturdy. —Eric Ravenscraft\n\nA Design That Fits Well on Most Faces\n\n3M's N95 respirators are individually wrapped and have two horizontal folds that create a decent-sized cup in front of your nose and mouth. The masks come with two straps that go over your head and neck to keep a tight seal. This is one of the smaller packs on our list, but you may have an easier time finding it in stock at some stores. —Eric Ravenscraft\n\nShelf Life Not specified Sizes Adult Adjustable Straps No\n\nAn Affordable Option\n\nThe DF300 N95 from Honeywell is a more affordable option on this list. With this mask, you'll get multilayer absorption (including a humidity- and moisture-resistant filter), a soft inner lining, and latex-free head straps. The nose clip is also adjustable and hidden underneath the mask. It comes complete with a soft foam nose cushion as well, which should make it more comfortable to wear for longer periods of time. —Eric Ravenscraft\n\nShelf Life Not specified Sizes Adult Adjustable Straps No\n\nBest for Yardwork, Sanding, Fiberglass Installation, and Sawing\n\nWe're fans of 3M’s three-panel Aura masks, and the brand's 9205+ offers an exhalation-valve-free option for an N95 mask. All N95 masks are made with electrostatic material to help capture particulates, and Aura masks are made with 3M’s Advanced Electrostatic Media. Also of note, 3M’s claim of a fog-free experience for eyeglass wearers doesn’t lie. The adjustable nose-foam nose clip makes a tight seal, and as I write this review, masked up with 9205+, my glasses are fog-free. I like that the mask's two rubber head straps are latex-free (I’m allergic to latex) and that the mask has a low profile. While the Aura 9205+ isn’t as comfortable as IQAir’s KN95/FFP2 face mask, for a full head strap mask, it’s comfortable enough. If we find ourselves in a future pandemic, the 9205+ is a well-sealed mask that’s easy to adjust and wear.\n\nShelf Life 5 years from date of manufacturing Sizes Adult Adjustable Straps 2 blue latex-free rubber full head straps\n\nBest for Hobbyists Working With Wood or Metal\n\nThere are certain occupations that are just right for the Aura 9211+ N95 mask. If your hobby or job requires grinding, sanding, or welding, this might be the ideal mask for you. The 9211+ is made of three panels with two full head straps that guarantee a seal. The 9211+ also has a soft cushioning nose form to customize the fit; 3M recommends wearing the 9211+ to reduce exposure to certain particulates such as coal, silica, iron ore, metal, and wood. I know several welders and a few who do serious woodworking who are excellent candidates for the 9211+. The image on 3M’s 9211+ landing page shows the wearer getting ready to weld.\n\nI found the 9211+ the most comfortable of all the Aura series due to its soft elastic fabric straps, and it was easy to breathe, though there are few times I’d want a mask with an exhalation valve. I could see myself wearing one for certain home renovations, but I wouldn’t wear one if I'm sick. It’s important to know that the 9211+ exhalation valves make breathing easier for the wearer, but these valves can release droplets into the air when breathing. Masks with exhalation valves were not recommended during the height of the COVID-19 pandemic. One study found that an “exhalation valve on a face mask under flow conditions mimics human breathing.” Still, if you’re looking for a mask with an exhalation valve, the 9211+ is comfortable and easy to adjust.\n\nShelf Life 5 years from date of manufacturing Sizes Adult Adjustable Straps 2 braided full head straps\n\nKF94 Masks\n\nKF95 masks are Korean-made masks that are designed to filter 94 percent of particulate matter; they typically feature ear loops instead of head straps, which many find ot be more comfortable.\n\nA Stylish Option\n\nVida's KF94 mask is both protective and stylish. It's FDA-listed, CE-certified (and manufactured in South Korea), and offers a 94 percent filtration efficiency. The four-layer mask comes in adorable colors including Blush, Seafoam, and Glacier Blue. It's also available in a variety of pack sizes, from 10 to 10,000. —Brenda Stolyar\n\nShelf Life Not specified Sizes Adult and Kids Adjustable Straps No\n\nBest KF94 for Large Heads\n\nThe BOTN KF94 masks only come in large and extra-large for adults, so those with smaller faces should look into the youth size, which also comes in a variety of color options including beige, dark gray, pink, and yellow. The mask has ear loops and a nosepiece that are both adjustable, so it should help ensure a tight fit if you go for the bigger size. I prefer these when wearing makeup, because the nosepiece stays put and doesn’t ruin my foundation as much as other masks do. —Brenda Stolyar\n\nShelf Life Not specified Sizes Adult and youth Adjustable Straps Yes\n\nA Popular Option\n\nThis one dips in and out of stock. LG's Airwasher mask is a standard KF94 with a three-dimensional design, four-ply fabric, an adjustable nose clip, and rounded ear loops. If you want a slightly more elevated option, it also comes in a Black Style design that'll likely pair well with fancier outfits for more formal occasions. —Eric Ravenscraft\n\nShelf Life Not specified Sizes Adult Adjustable Straps Yes\n\nKN95 Masks\n\nKN95 face masks conform to Chinese rather than US standards, but are generally considered to be equivalent to N95.\n\nBest Overall KN95\n\nPhotograph: Lisa Wood Shapiro IQAir KN95/FFP2 Face Mask $60 IQAir\n\nIQAir makes excellent air purifiers, so it’s no surprise the brand also makes some of the best-fitting and most comfortable KN95 masks we tested. There are two ways to customize the fit. There are ear straps along with a hook with two size options to join the straps together. For a complete seal, the straps on the mask face can be pulled to adjust the fit. The mask also uses IQAir Mask Soft Seal technology to conform to the face. The soft gray material does seal to the skin without being sticky.\n\nWhile it took some time fine-tuning the straps, I was able to wear the IQAir mask with glasses without having them fog up. The masks come in 10-, 12-, and 100-packs and arrive with a zippered carrying case for a single mask. IQAir also makes child-sized versions. And like IQAir’s air purifiers, its masks are not cheap. A 10-pack will run you about $60. Still, I’ve been able to wear each mask more than once and the seal is solid. If there is a new variant of Covid-19, this will be one of the masks I’ll be wearing.",
  "authors": [
    "Lisa Wood Shapiro"
  ],
  "url": "https://www.wired.com/story/best-disposable-face-masks-n95-kn95-kf94-surgical/"
}