{
  "title": "Autoridades de EE.UU. dan a conocer fotografías a detalle del accidente del avión de UPS en Louisville",
  "text": "CNN —\n\nLa Junta Nacional de Seguridad en el Transporte de Estados Unidos (NTSB por sus siglas en inglés), ofreció un nuevo informe sobre el accidente del avión de UPS registrado a principios de este mes que se estrelló en Louisville tan solo unos instantes después del despegue.\n\nEl reporte presentado muestra una serie de seis fotografías obtenidas por un equipo de investigación que muestran cómo el motor izquierdo del McDonnell Douglas MD-11F se separó del avión y se eleva por encima del ala, provocando una bola de fuego.\n\nLos tres pilotos del vuelo 2976 de UPS y 11 personas en tierra fallecieron cuando el avión se desplomó y dejó un rastro de escombros de más de medio kilómetro de largo al pasar por una planta de reciclaje de petróleo y un almacén de UPS, causando un enorme incendio y una columna de humo negro que fue visible a varios kilómetros de distancia.\n\nEl informe destaca la existencia de grietas encontradas en los herrajes que fijan el motor al ala, además de una posible sobrecarga en el vuelo. La agencia federal aún está realizando una investigación más exhaustiva que podría generar nuevos detalles.\n\nCapturas de imagen del video de seguridad del aeropuerto muestran la separación del motor y del pilón del ala izquierda. UPS/NTSB\n\nEl avión de carga pertenecía a la empresa UPS, contaba con 34 años de antigüedad y se encontraba en proceso de ser retirado por la compañía de transporte.\n\nTras el accidente, la Administración Federal de Aviación (FAA, por sus siglas en inglés) inmovilizó todos los aviones MD-11 y MD-11F hasta que cada uno de ellos se someta a una inspección exhaustiva. UPS cuenta con otros 25 modelos MD-11 en servicio y seis aeronaves que han estado almacenadas al menos durante los últimos 3 meses, de acuerdo con información de la empresa de análisis de aviación Cirium.\n\nEl motor y otras piezas defectuosas\n\nLos investigadores que revisaron la pista poco después del accidente dijeron que recuperaron piezas metálicas del lugar. Entre ellas encontraron un par de accesorios estructurales que mantenían el pilón del motor, que es una pieza de metal muy resistente que sujeta a los motores del avión con las alas. De acuerdo con el reporte, los accesorios conocidos como orejetas mostraron grietas causadas por la fatiga y el sobreesfuerzo, como lo demostraron “sus posiciones a las 2 y a las 9 en punto”, de acuerdo con los investigadores.\n\nEl informe presenta una nueva cronología de la secuencia del accidente, junto a nuevos datos que muestran que el avión no logró elevarse por más de 30 pies por encima de la pista 17 derecha del Aeropuerto Internacional Muhammad Ali de Louisville.\n\nDe acuerdo con el informe preliminar, un testigo que se encontraba en la torre de control dijo que la velocidad del despegue parecía normal para ese tipo de aeronave; sin embargo, aseguró que el ascenso no lo era. Otro testigo comentó que el avión dejó de ascender y comenzó a perder altitud antes de dar una vuelta hacia la izquierda.\n\nEl avión MD-11 está equipado con tres motores: uno en cada ala y otro en la cola. El avión pasó por mantenimiento previo en San Antonio que lo dejó fuera de servicio por seis semanas, de acuerdo con los investigadores. Sin embargo, continuarán revisando todos los registros de servicio por los que pasó.\n\nLos investigadores continúan recopilando más información\n\nLas grabadoras de voz de la cabina, el motor y el pilón que se desprendió del ala del avión fueron trasladados a unas instalaciones seguras donde se están examinando, así lo informó la NTSB.\n\nDe acuerdo con la Junta Nacional de Seguridad en el Transporte, la grabadora de voz contenía dos horas y cuatro minutos de “audio digital de buena calidad”. Y los datos de vuelo registraron 63 horas que abarcan más de 24 vuelos, incluido el del accidente.\n\nTambién la NTSB, en una medida poco común, estableció una relación con un desastre anterior: el accidente del vuelo 191 de American Airlines en 1979, en Chicago, en el que murieron 271 personas a bordo y dos más en tierra. El avión era un McDonnell Douglas DC-10, que es precursor del MD-11.\n\nEn aquella ocasión, durante la rotación de despegue de la aeronave, el motor izquierdo, en conjunto con el pilón y aproximadamente un metro del borde delantero del ala izquierdo, se separaron del avión y cayeron sobre la pista. El avión se desvió hacia la izquierda y se estrelló.\n\nTras el accidente, fueron desplegados una gran cantidad de especialistas y expertos en control de tráfico aéreo para investigar las causas del accidente.\n\nCabe destacar que las 12 páginas con nuevos hallazgos fueron publicadas tras poco más de dos semanas desde que ocurrió el accidente el 4 de noviembre, lo que supone un plazo considerablemente más rápido que los 30 días que suele tardar la NTSB en publicar un informe preliminar.\n\n“Agradecemos la rápida publicación de los hallazgos preliminares por parte de la Junta Nacional de Seguridad en el Transporte y apoyaremos plenamente la investigación hasta su conclusión”, dijo UPS en un comunicado.\n\nPor su parte, Boeing, que hace tiempo se fusionó con el fabricante de los aviones, McDonnell Douglas, declaró: “Seguimos apoyando la investigación dirigida por la NTSB. Transmitimos nuestro más sentido pésame a las familias que han perdido a sus seres queridos y nuestros pensamientos están con todos los afectados”.\n\nSe espera que la NTSB publique un informe final en un plazo de 18 a 24 meses en el que se detallarán las causas probables del accidente. La agencia no atribuye responsabilidades, sino que ofrece recomendaciones para mejorar la seguridad en el transporte aéreo.",
  "authors": [
    "Alexandra Skores",
    "Pete Mutean"
  ],
  "url": "https://cnnespanol.cnn.com/2025/11/20/eeuu/accidente-avion-ups-louisville-fotos-trax"
}