{
  "title": "La nueva propuesta de paz de Trump para Ucrania implicaría concesiones territoriales a Rusia, según una fuente",
  "text": "CNN —\n\nUna nueva propuesta de paz para Ucrania, elaborada por el Gobierno de Trump, exigiría al país ceder la región oriental de Donbás y limitar el tamaño de sus fuerzas armadas a cambio de garantías de seguridad por parte de Estados Unidos, según un funcionario occidental familiarizado con el documento.\n\nEl plan de 28 puntos, que el presidente Donald Trump ya revisó, es el último intento de la Casa Blanca por poner fin a la guerra de Rusia en Ucrania. Algunas de las disposiciones de la propuesta —incluidas las concesiones territoriales en áreas que actualmente no controla Rusia— han sido rechazadas previamente por los ucranianos. Sin embargo, los funcionarios estadounidenses ven una nueva oportunidad para reiniciar las conversaciones de paz.\n\nEl plan aún se encuentra en su fase preliminar y muchos de sus puntos no se han finalizado. CNN no ha accedido a la propuesta, pero se ha puesto en contacto con la Casa Blanca para obtener comentarios al respecto.\n\nEl secretario de Estado, Marco Rubio, sugirió el miércoles por la noche que el documento era una “lista de ideas potenciales”, en lugar de una propuesta definitiva.\n\n“Poner fin a una guerra compleja y mortífera como la de Ucrania requiere un amplio intercambio de ideas serias y realistas”, escribió en una publicación en X. “Y lograr una paz duradera exigirá que ambas partes acepten concesiones difíciles pero necesarias. Por eso estamos elaborando y seguiremos elaborando una lista de posibles ideas para poner fin a esta guerra, basándonos en los aportes de ambos bandos del conflicto”.\n\nAun así, es probable que la propuesta en su forma actual genere críticas por parte de Ucrania y sus aliados, ya que requeriría importantes concesiones territoriales. Actualmente, las dos regiones que conforman el Donbás, Lugansk y Donetsk, todavía se encuentran parcialmente bajo control ucraniano.\n\nEn los otros territorios en disputa, Jersón y Zaporiyia, las líneas de batalla actuales quedarían congeladas, según la nueva propuesta. Moscú ya había sugerido que Kyiv cediera ambas regiones en su totalidad.\n\nUcrania también estaría obligada a reducir el tamaño de sus fuerzas armadas y a desmantelar algunas de sus capacidades militares, entre ellas cierto armamento potente que ha recibido durante la guerra.\n\nOtros puntos del documento incluyen el estatus del idioma ruso y de la Iglesia Ortodoxa Rusa en Ucrania una vez finalizada la guerra.\n\nEl plan también incluye garantías de seguridad respaldadas por Estados Unidos, destinadas a impedir que Rusia invada más territorios o extienda su guerra a Europa. Los detalles fueron descritos por un funcionario occidental familiarizado con el documento.\n\nLa propuesta se hace eco de una propuesta de paz presentada en las conversaciones de Estambul durante las primeras semanas de la guerra en 2022, e insiste con algunas de las exigencias geopolíticas más amplias de Moscú con respecto a las fuerzas armadas y las alianzas de Ucrania.\n\nVideo Ad Feedback “No voy a perder el tiempo”: Trump dice que no se reunirá con Putin hasta ver avances de paz entre Rusia y Ucrania 00:44 • Fuente: CNN “No voy a perder el tiempo”: Trump dice que no se reunirá con Putin hasta ver avances de paz entre Rusia y Ucrania 00:44\n\n“El día de la marmota”\n\nUn diplomático europeo corroboró la descripción del funcionario occidental sobre algunos detalles de la propuesta. Esta persona declaró a CNN que este nuevo intento, que repite muchas de las exigencias maximalistas de Moscú que datan de 2022, le recordaba a “El día de la marmota”, una película en la que los eventos se repiten una y otra vez.\n\nUn enviado europeo que se encuentra en Ucrania afirmó que el plan había tomado por sorpresa a la comunidad diplomática.\n\n“Esto ya se ha discutido y rechazado antes, y ahora estamos como al principio”, declaró el diplomático. “Para los ucranianos, es simplemente inaceptable, y con razón. Sería como invitar a los rusos a regresar en el futuro. Sería un suicidio político para cualquier líder ucraniano aceptarlo, y un suicidio militar entregar esa zona fortificada”.\n\nEl diplomático también dijo que los ministerios de Asuntos Exteriores de Europa y otros países contactaron con sus contactos en Washington para obtener información sobre el plan, solo para que les dijeran que estaban igualmente desinformados.\n\n“Hemos oído directamente de personas del Departamento de Estado y del Capitolio que nadie sabía nada de este plan hasta que se filtró ayer”, dijo el diplomático.\n\n“Quienes deberían haber estado al tanto, no sabían nada… Hay mucha molestia y confusión”.\n\nEn sus primeras declaraciones públicas desde que surgieron los informes sobre el plan, la jefa de la diplomacia de la Unión Europea, Kaja Kallas, declaró este jueves a la prensa que “para que cualquier plan funcione, necesita el apoyo de ucranianos y europeos”. El ministro de Asuntos Exteriores de Polonia, Radosław Sikorski, declaró a CNN que cualquier plan debería involucrar a Europa y garantizar que Kyiv tenga la capacidad de defenderse.\n\n“Tenemos mucho más en juego que Estados Unidos, por lo que Ucrania, pero también Europa, debe participar”, afirmó.\n\nEl enviado especial de Trump, Steve Witkoff, ha estado al frente de las gestiones, según informó CNN el miércoles. Una fuente indicó que las negociaciones se aceleraron esta semana, ya que el Gobierno considera que el Kremlin ha mostrado una renovada disposición a llegar a un acuerdo.\n\nMientras tanto, una delegación del Pentágono, encabezada por el secretario del Ejército, Dan Driscoll, estuvo en Kyiv esta semana para reunirse con el presidente de Ucrania, Volodymyr Zelensky, y otros altos funcionarios, entre otros, para tratar el nuevo plan.\n\nLos funcionarios estadounidenses consideraron el viaje una oportunidad para reactivar las conversaciones de paz, que se habían estancado durante los últimos meses.\n\nAndrew Carey, Nick Paton Walsh, Brian Abel y Catherine Nicholls, de CNN, contribuyeron a este reportaje.\n\nEsta noticia ha sido actualizada con información adicional.",
  "authors": [
    "Kevin Liptak"
  ],
  "url": "https://cnnespanol.cnn.com/2025/11/20/mundo/trump-ucrania-concesiones-territoriales-rusia-trax"
}