{
  "title": "Archaeologists may have uncovered a Bronze Age metropolis in Kazakhstan’s steppe",
  "text": "Upon the open grasslands of what is now Kazakhstan, there once stood a Bronze Age settlement that may have served as a center of exchange and power around 1600 BC.\n\nThe settlement — called Semiyarka and nicknamed “The City of Seven Ravines” for its location overlooking a network of valleys — was first discovered in the early 2000s, but it wasn’t until an international group of archaeologists surveyed the area starting in 2018 that its impressive size and potential importance within the Eurasian Steppe came to light. What the team discovered was an expansive area that was once replete with houses, a central monumental building, which may have been used for rituals or governance, and possibly even tin bronze metal production facilities.\n\nTheir findings, published Monday in the journal Antiquity, are just the beginning, the study authors said.\n\n“It’s very exciting, because it’s such a rare find to have tin bronze production in this area,” said lead author Miljana Radivojević, an associate professor in archaeological science at University College London, UK. “We know we have hundreds of thousands of tin bronze artifacts from the Bronze Age in the Eurasian steppe and we have only one published site on tin bronze production. And this is the second one.” Tin bronze allowed for sturdier tools and other materials to be made, Radivojević added.\n\nArchaeologists unearthed this bronze object at Semiyarka. VK Merz & IK Merz\n\nAs the team now embarks on excavating the area, they say the continued discoveries of Semiyarka are transforming what we know about urban life in prehistoric Eurasia.\n\n“We just don’t have anything like this at all,” said study coauthor Dan Lawrence, a professor of archaeology at Durham University in the UK. There are hardly settlements of any kind recovered in the steppe, he added. “What you get across this landscape, we associate with mobile pastoral groups, and we think maybe they were in tents or yurts. What we’ve got here is something that’s very clearly quite different.”\n\nSpanning 140 hectares (about 346 acres) above the Irtysh River valley, the large size and strategic location of the settlement may indicate that the Bronze Age steppe had sophisticated cities similar to those located in more urban areas of the world at the time, Lawrence added.\n\nSurveying a long-lost city\n\nTo find the borders of the settlement, Lawrence led the team in a survey project that looked at satellite imagery and analyzed every 50-meter square across the site. They only examined the surface, finding pottery fragments, including at least 114 ceramic vessels, and other artifacts scattered across the settlement.\n\nThe team also used imagery from Corona spy photography dating to the 1960s, to identify where the land had been disturbed during the last several decades, as well as magnetometry, a noninvasive survey technique that allowed the archaeologists to see buried structures and metal objects without having to excavate.\n\nA drone photograph of the archaeological site of Semiyarka, taken in July 2018 Courtesy Peter J. Brown\n\nThe next step, excavations, are underway now, and Radivojević says more discoveries have already been made. “What has been published is that we had indications — we looked at the materials that were crucibles and slags and artifacts, and we could just connect them and say, well, these are the bronzes,” she said. “But then as we go, we have more discoveries, so I was more confident in talking about, say, a larger-scale production of metallurgy on the site.”\n\nBut not everyone agrees on whether Semiyarka resembled a major city. “The results, at least those presented in the article, would suggest a strong ‘NO’ to that question, especially given the low-density pottery sherd scatter on the surface and seemingly equally low-density evidence for metallurgy,” James Johnson, an archaeologist and assistant instructional professor in anthropology at the University of Wyoming in Laramie, said in an email. Johnson, who has studied Bronze and Iron Age pastoralist societies of the Eurasian steppe, was not involved with the new research.\n\n“Cities are spatial and demographic entities that usually represent the complex interplay of the built environment, population density and sprawl, and material culture (as well as numerous other sociological factors),” he added. The low number of ceramic artifacts found could indicate a limited use of pottery, common among prehistoric steppe societies, and that pottery might not be “the best material culture category to connect with population density usually associated with urban populations.”\n\nFurther research into the middens, heaps of remains that provide a glimpse into past human life, as well as surface collections beyond the settlement would help archaeologists better understand settlement patterns, Johnson said.\n\nWhile Lawrence agrees that there isn’t enough evidence to conclude that the settlement was a major city, “I also think we can’t say it is a strong no for the same reasons,” he said.\n\nThe relatively small amount of pottery remains can be attributed to the fact that the ground is undisturbed and compacted by several feet of snow every winter; many artifacts could still be underground, Lawrence noted.\n\nHe continued: “Different things happen in urban settlements than in the rural ones. For example, in modern times you need to go to a city to get heavy industry, fancy shops or a seat of political power. I think we can say that Semiyarka is a city in the sense that it is very different from surrounding settlements and provides just those kinds of urban services.”\n\nSemiyarka could be evidence that the region found a balance between the typical pastoralist mobile sites and other important societal elements, such as tin bronze production, one of the most important technologies of the time, said Michael Frachetti, a professor of archaeology at Washington University in St. Louis.\n\n“Although the archaeological scale and function of these central places is still unfolding, the results so far open many questions about the organizational choices steppe societies made in terms of metallurgy, political organization, and economic connectivity at both local and regional scales,” Frachetti said in an email. Frachetti, who specializes in pastoralism in the Bronze Age, was also not involved with the study.\n\nIn search of answers\n\nThere is not a lot of evidence of settlements in the Eurasia steppe during the Bronze Age; most sites were mobile, and did not leave behind a lot of archaeological evidence, Lawrence said. However, the grasslands haven’t received much archaeological attention, he added, and it’s possible there are many settlements still left to be uncovered\n\nWith future research, the study authors said they hope to find further evidence of Semiyarka’s potentially powerful role during the Bronze Age, as well as insight into urban life and metal production within the steppe.\n\nAs of now, their research has revealed the outlines of at least 15 structures throughout the settlement, with a few showing evidence of being houses with internal rooms.\n\nHow many people lived there? How long did the settlement survive? What connections did the city have to other areas? Lawrence hopes that the excavation process will turn up answers.\n\n“This site is super interesting because it just breaks from all the things that we thought we knew about Central Asia up to this point,” Lawrence said. “And so understanding how that got there, why that got there, and then how it connects to these much larger stories is really interesting, and it’s not something we can answer yet, but now we know the site’s there, we can start to develop a program to try and understand what it all means.”\n\nTaylor Nicioli is a freelance journalist based in New York.\n\nSign up for CNN’s Wonder Theory science newsletter. Explore the universe with news on fascinating discoveries, scientific advancements and more.",
  "authors": [
    "Taylor Nicioli"
  ],
  "url": "https://www.cnn.com/2025/11/18/science/semiyarka-bronze-age-eurasia-steppe"
}