{
  "title": "My Family Moved To America And Into A Real Haunted House. Here's What Happened.",
  "text": "The author with her mom and younger brother as they prepared to cut a birthday cake in their haunted kitchen. Courtesy of Salina Jivani\n\nAs a child, my first brush with a ghost wasn’t Casper or some other spook from a children’s book. I encountered the real deal in the house we rented in Pennsylvania after my family emigrated from Kuwait. It was over a century old, essentially the size and strength of a wet shoebox, and was shadowed by an ominous oak tree in a rundown neighborhood.\n\nMy dad, who grew up poor and lost his father as a teenager, had cultivated a knack for stretching every penny he earned. Years before we moved to the U.S., he squirreled away what he could, which helped him get settled in Pennsylvania when a locally headquartered company offered him a job on an H-1 Visa.\n\nAdvertisement\n\nThe timing couldn’t have been more off ― he left for America when I was 3 and my mother was pregnant with my brother ― but my parents felt their sacrifices would be well worth the potential opportunities neither of them had been fortunate enough to grow up with. Several months after my dad settled in the U.S., my mom, my brother, who was just six months old, and I joined him.\n\nWe began to hear rumblings around the neighborhood the moment our second-hand, beaten-up Buick crawled up the bumpy road to the curb in front of our new home. The house, the only rental we could afford, was larger than any of the apartment-like flats we’d had in Oman, Cyprus, India or any of the other places we’d previously brushed dirt — but it was weathered, wizened and falling apart.\n\nAt first, my parents chalked up the peering eyes and hushed whispers to neighborhood curiosity. We were new and my mother didn’t know a lick of English. But we soon learned there was something else going on.\n\nAdvertisement\n\nEven though I was very young at the time, I will never forget the first encounter we had. One night, sometime after we’d unpacked the last of the few belongings we’d brought with us, I heard my mom calling for me from the landing that connected our rooms on the second floor. When I left my room and found her, she was turned toward the stairs.\n\n“I’m here,” I whispered. The lights snapped on and my mother’s face came into focus from the doorway of my room. Her eyes were wide, her mouth agape. We heard a loud crash downstairs. An orchestra of metal clattered. And then silence. My mom didn’t move. Seeing how scared she was terrified me. Suddenly, she pounded down the stairs. My dad, who had joined us on the landing, was right behind her.\n\nMy curiosity ― and my fear for my parents’ safety ― got the best of me. I slinked along the stairs, hovering close to the wall, until I got far enough to peek through the rails of the banister into the kitchen. The doors to cabinets and the drawers gaped open. Silverware was scattered everywhere. Pots and pans were strewn across the kitchen floor.\n\nAdvertisement\n\nMy parents scurried to check the doors and windows but found them closed and locked. This was not a break-in ― and there was no other plausible explanation for what just happened.\n\n“The doors to cabinets and the drawers gaped open. Silverware was scattered everywhere. Pots and pans were strewn across the kitchen floor. My parents scurried to check the doors and windows, but found them closed and locked.”\n\nUnfortunately, it didn’t stop there. It seemed whoever ― or whatever ― was living with us was just getting warmed up. We’d leave an object in one room, only to stumble across it in another. Pots and pans would clang together in the middle of the night, but when my parents raced downstairs, the kitchen would appear innocently spic and span.\n\nAdvertisement\n\nMy parents were familiar with ghost stories. There was a house in Kuwait, where my mom was born, that was rumored to be haunted, and no one would go near it at night. My father had his own tales from India. His brother had spoken to an elderly man on a bicycle, only to learn from the neighbors that he’d died years earlier but still had a reputation for making appearances every now and then.\n\nBut hearing stories is different than coming face to face with the real thing in your own home.\n\nAt first, they didn’t want to accept that we were dealing with a ghost. We continued to look for other logical explanations for the activity we were experiencing, but there were none.\n\nOne day, my mom gathered her confidence and, using her fractured English to string enough words together, asked our neighbor if she knew anything about the history of our home. The woman leaned in conspiratorially and whispered that the previous owner had passed away inside of it. The house had apparently been her pride and joy, and she’d been particularly obsessed with organizing her kitchen a specific way. We were officially spooked.\n\nAdvertisement\n\nMy mom began to pray every night after that. She would extract her rosary beads from a wooden tissue holder, roll out a red rug and squeeze her eyes shut as she swayed back and forth in deep concentration. The musky scent of incense sticks burning from our kitchen wafted beyond the front door to the street. She believed that no evil would befall a house filled with prayers and praise for God. Because we were poor, moving simply wasn’t an option, and my parents tried to face the situation with as much grace as they could, determined to make the best out of a circumstance we couldn’t escape.\n\nSlowly, things began to change for our family. My dad worked overtime and traveled more. My mom arranged her schedule around his so she could take a few jobs from the slim pickings she was qualified for. The unexplained incidents, however, continued. Sometimes, a month would pass in between them. Sometimes, just a few days. Although those years were terrifying, I also learned many lessons that I still hold close to me today.\n\nAs far as our ghost was concerned, I discovered that if I thought of her as a friendly older woman bustling about her kitchen in an attempt to bake us otherworldly treats, she wasn’t nearly as scary as when I imagined her as a witch trying to butcher us all with her favorite knife. This exercise in positive thinking didn’t always work ― we were living with an unpredictable supernatural entity, after all. But we never felt truly at risk of being harmed, and I learned that fear is only as powerful as you allow it to be.\n\nAdvertisement\n\n“As far as our ghost was concerned, I discovered that if I thought of her as a friendly older woman bustling about her kitchen in an attempt to bake us otherworldly treats, she wasn’t nearly as scary.”\n\nI also learned a lot from observing my parents’ courage. My dad taught us to be strong and independent, and he and my mom demonstrated this with the finesse they used to handle everything that came our way ― whether it was moving across the world in their 20s with next to nothing in their pockets and two kids in tow, or living with a ghost.\n\nI was also learning about what it meant to be poor ― and what it meant to be part of a community. Even though I was very young when we moved to America and therefore had a very limited understanding of the world, I immediately knew it was different from any other place we’d lived.\n\nAdvertisement\n\nMy earliest memories are of piggybacking on my uncle’s shoulders after dusk in Kuwait, the sand spreading out before us and the wind tinged with the scent of shaurma as we trekked to the local street vendor to grab a mango ice cream. In America, we had no family, let alone many people who shared our background or culture. No one wandered the streets past eight, and no music from nearby vendors’ carts drifted through the crevices of our windows and doors.\n\nOur family struggled financially but, admittedly, what we experienced was different than when we had been poor in any other part of the world we’d previously ventured.\n\nUnfortunately, my parents hadn’t been so lucky at my age. For them, poverty had meant skipping out on a meal or two, sewing their own clothes and repeatedly mending the ones that tore, and for my mom, forgoing an education. Electricity, water and gas were considered luxuries for even the wealthy, as outages were common for most people, but for the poor, these fundamentals were often completely nonexistent.\n\nAdvertisement\n\nThe author as a child, bundled up in warm PJs on a recliner next to her brother on a typically cold Pennsylvania day. Courtesy of Salina Jivani\n\nWe were able to survive in America, but without the money to buy anything beyond the necessities, I felt the sting of being an outsider. I was stuck using a beat-up folder while the other girls in my class flaunted their then-popular Lisa Frank school supplies. I envied their vast wardrobes of colorful snow boots, puffy vests and endless selection of tops. I longed to be able to afford something as silly and indulgent as a slap bracelet, a Troll doll and or a Trapper Keeper.\n\nWe couldn’t afford more than a few items of clothing, mostly used, and certainly nothing as beautiful or exciting as what the other kids at school had. At night, my mom dressed my brother in my old pajamas and dresses, and everywhere else, he and I both wore what we had over and over again, often repeating the same pants or sweater several times a week.\n\nAdvertisement\n\nWhile I struggled to fit in, the ghost continued to make its presence known. We wanted to leave, but we could barely afford to pay our bills, much less move. As we began to meet our neighbors and they learned about what we were dealing with, they offered whatever support they could. There were very few East Indian families in our area, so many of the people we befriended were curious about our past and our culture. They popped in to check on us, dropped off meals, and left our newspaper (which we subscribed to for the coupons) at the doorstep so it wouldn’t get soggy in the rain.\n\nBut it didn’t end there. When our neighbors and my dad’s co-workers discovered how much we were grappling with financially, they swept in like angels, donating household items, lending us money, and once even showing up in the middle of the night to drive my baby brother to the hospital when my dad was traveling and my mom didn’t have a car. Their actions showed me that humanity can transcend difference and is powerful enough to shatter divisive barriers. These people didn’t share our culture, our mother tongue or even many of the same experiences as us. However, they were some of the most beautiful people I’d ever met, and I aspired to be just like them when I grew up.\n\nOf course, there were definitely times when I felt out of place. First grade was particularly challenging for me, and I came home in tears nearly every day. I was the only East Indian student in my class, which included one Native American boy. The students in my class ― and even the teachers ― teased us incessantly and said things like, “You two should get married!” It made me feel awful.\n\nAdvertisement\n\nI couldn’t understand their logic or why they were picking on us. I kept telling them that I was East Indian, not Native American, and that he and I were different kinds of Indians, because that’s what I thought they were misunderstanding. But I soon realized they thought because we were different from them ― even if different from each other ― we were the perfect match.\n\nAfter that, I grew more cognizant of how I was treated. I became aware of other situations in which I was regarded differently, like when I wasn’t invited to birthday parties. And on the few occasions I was invited, I found myself unfamiliar with the foods and games, which often caused me to feel out of place. Stereotypes and my own insecurities made me question my presence anywhere I went. I felt like an intruder in a land that wasn’t mine to claim.\n\nDespite these experiences ― and our haunted house ― my family was still grateful to be a part of this country. My parents’ recollections of what circumstances were like in the other places they had lived continuously humbled them. No country is perfect, they always told us, but we are lucky to be here.\n\nAdvertisement\n\nPlus, so many of the people we met truly cared about us, outshining those who couldn’t see past skin tone or accents. We felt blessed that the promise of a better life in America that we so famously heard about ― of communities that care and good-hearted neighbors ― was what we actually found here. I know many others aren’t as fortunate.\n\n“So many of the people we met truly cared about us, outshining those who couldn’t see past skin tone or accents. We felt blessed that the promise of a better life in America that we so famously hear about ― of communities that care and good-hearted neighbors ― was what we actually found here. I know many others aren’t as fortunate.”\n\nMy dad had always been a hard worker, and watching how much he sacrificed for our family was inspiring. But it was witnessing my mom’s dedication that truly influenced me. My mom, who wasn’t educated past the ninth grade by Kuwaiti standards, did whatever she could to make it possible for us to move.\n\nAdvertisement\n\nFrom her, I learned that an uneducated woman in a foreign country who didn’t know any English could overcome seemingly insurmountable circumstances ― especially when she was trying to relocate her family into a non-haunted house.\n\nI remember when she’d return home from her shift as the bagger at our local grocery store and rush to her room in tears. Sometimes, she was upset because of her frustration with language barriers, sometimes because a co-worker perceived her to be weak and powerless and, therefore, a ripe target for harassment. Often, her sadness and despair were magnified by the fact that she didn’t have any of her friends or family to turn to.\n\nBut I never saw her falter in her devotion to us. She worked tirelessly and put every penny of her earnings in the bank to help us get out of that home as fast as we could. And she didn’t stop there. My mom learned English in her 20s, got her GED in her 40s, and opened her first salon in her 50s.\n\nAdvertisement\n\nThanks to my parents’ hard work and the support of our neighbors, who came to be as close as family, the day we had been waiting for finally arrived. We had saved enough money to move ― not just out of our haunted house, but to another state. My father had accepted a position in Georgia, and my parents were hopeful we could get a fresh start in a new place where we could build our own home; a home that would one day boast its own history, its own memories ― hopefully, happy ones.\n\nUntil the day we rolled the Penske rental truck off the asphalt of our tiny street, the ghost continued to cause trouble. We were thankful to leave (mostly) unscathed, and excited to have a new chance at life in a country we now understood much better. Although we looked forward to a fresh start in a place that (hopefully) wasn’t haunted, we were heartbroken to leave behind our neighbors who had so selflessly shared much of themselves, their resources and their lives with us. We’d promised to keep in touch over time, and we did. In fact, nearly 20 years later, many of those neighbors attended my wedding and then my brother’s.\n\nMy family still talks about our very first home in America and the ghost that shared it with us. Although we wouldn’t ever say it was an ideal first home, it was where I first learned how good and kind and empathetic people could be. It’s where our family rallied together and my parents showed my brother and me the value of hard work, sticking together and love. And it’s where I discovered so much about who I was and who I wanted to be.\n\nAdvertisement\n\nThis piece was originally published in October 2021 and is being rerun now as part of HuffPost Personal’s “Best Of” series.\n\nSalina Jivani has been a writer by passion and profession for over a decade. Her works include feature stories, articles and posts published in both digital and print. She also has her own blog where she shares tips and best practices she’s gleaned throughout her writer’s journey.\n\nDo you have a compelling personal story you’d like to see published on HuffPost? Find out what we’re looking for here and send us a pitch!",
  "authors": [
    "Guest Writer"
  ],
  "url": "https://www.huffpost.com/entry/haunted-house-pennsylvania-ghost-immigration-family_n_68e54813e4b05e212f21cb1c"
}