{
  "title": "Miss Universe 2025: Mexico Fatima Bosch crowned winner in Bangkok",
  "text": "Fatima Bosch of Mexico has been named Miss Universe 2025 in a scandal-hit competition where she emerged as a fan favorite after she was berated by a Thai pageant director during a pre-pageant meeting, triggering a walk out by contestants.\n\nThe 25-year-old humanitarian and volunteer was crowned by last year’s winner Victoria Kjær Theilvig from Denmark.\n\nMiss Universe is widely known as the “Super Bowl” of beauty pageants and draws millions of viewers each year. Delegates for each country are selected via local pageants that license local rights from the Miss Universe Organization.\n\nThailand’s Praveenar Singh came runner up, with Venezuela’s Stephany Abasali, Philippines’ Ahtisa Manalo and Ivory Coast’s Olivia Yacé also making it to the top 5.\n\nThailand, this year’s host country, has a vibrant and lucrative pageant industry with one of the largest fanbases in Asia, alongside the Philippines.\n\nThe event featured representatives from 120 countries. Nadeen Ayoub became the first woman to represent Palestinian people at the pageant, and made it to the final 30 semifinalists before she was eliminated. Friday’s finale was hosted by American comedian Steve Byrne and opened with a performance by Thai singer Jeff Satur.\n\nMiss Palestine Nadeen Ayoub takes part in the final competition of the 2025 Miss Universe pageant in Nonthaburi, north of Bangkok, on November 21, 2025. Lillian Suwanrumpha/AFP/Getty Images\n\nFollowing the swimwear round, the top 30 contestants were narrowed down to 12, and then down to 5 after the evening round.\n\nFinalists were asked questions including which global issue they would speak about in front of the United Nations General Assembly, and how they would use the Miss Universe platform to empower young girls.\n\n“Believe in the power of your authenticity,” Bosch said. “Your dreams matter, your heart matters. Never let anyone make you doubt your worth.”\n\nThe competition took place over three weeks, with delegates traveling around the country to rehearse and participate in events.\n\nOn Wednesday, the beauty queens competed in the national costume showcase, which saw contestants donning flamboyant outfits designed to highlight their homelands. Miss USA, Audrey Eckert, paid homage to her home with an elaborate bald eagle costume designed by Simon Villalba.\n\nMiss USA Audrey Eckert competes in the national costume competition at the Miss Universe beauty pageant in Nonthaburi province, Thailand, Wednesday, November 19, 2025. Sakchai Lalit/AP\n\nThe contestant from Jamaica, Gabrielle Henry, took a scary tumble during the evening gown round at Wednesday’s preliminaries and was carried away in a stretcher, according to social media videos which circulated of her fall. Miss Universe President Raul Rocha said in an update to Instagram that Henry was “under good care” in hospital and that she had not broken any bones.\n\nPageant controversies\n\nThis year’s Miss Universe competition was beset by controversy and internal drama in the weeks leading up to coronation night. The walk out sparked conversations over the merits of the international beauty pageant which claims to promote female empowerment.\n\nAt a live-streamed pre-pageant meeting earlier this month, Miss Universe Thailand director Nawat Itsaragrisil publicly scolded Bosch, for not posting enough promotional content, appearing to call her a “dumbhead,” though Nawat denied this, insisting that he had actually accused her of causing “damage.”\n\nAfter Bosch pushed back against the insults, Nawat called security to escort her out of the room. Other contestants then stood up and walked out in solidarity.\n\nThe incident drew global backlash, including from Mexico’s president Claudia Sheinbaum, who described it as an “aggression” that Bosch handled with “dignity.”\n\nThe Miss Universe Organization condemned Nawat’s behavior and limited his role in the pageant. Nawat apologized in a livestreamed welcome ceremony and declined to comment further on the incident to CNN.\n\nThen, Miss Universe 1996, Alicia Machado, was criticized for making racist comments in an Instagram live video discussing the incident.\n\nMachado referred to Nawat as “that despicable Chinese,” and when a commentor pointed out he is Thai, Machado said “Chinese, Thai, Korean. To me all these people with slanted eyes like this are all Chinese,” while pulling up the corners of her eyes.\n\nMachado’s representative did not respond to a request for comment from CNN.\n\nMiss Spain Andrea Valero walks on stage during the costume round on November 19, 2025. Lillian Suwanrumpha/AFP/Getty Images\n\nJudge steps down, says pageant is rigged\n\nTwo judges abruptly stepped down from the competition days before the winner was crowned, with one accusing the pageant of being rigged.\n\nComposer Omar Harfouch said on Instagram he had resigned from the eight-member judging panel, and claimed there was a secret, “impromptu” panel of judges who had pre-selected the top 30 contestants in advance of the final.\n\n“I could not stand before the public and television cameras, pretending to legitimize a vote I never took part in,” Harfouch said in a statement.\n\nThe Miss Universe Organization said Harfouch’s claims “mischaracterize” the judging process.\n\n“The Miss Universe Organization firmly clarifies that no impromptu jury has been created, that no external group has been authorized to evaluate delegates or select finalists, and that all competition evaluations continue to follow the established, transparent, and supervised MUO protocols,” the organization said in a statement.\n\nThe Miss Universe Organization did not respond to a request for comment from CNN.\n\nContestants take part in the 74th Miss Universe pageant, in Bangkok, Thailand, November 21, 2025. Chalinee Thirasupa/Reuters\n\nA second judge, former French soccer star Claude Makélélé, stepped down the same day, citing “unforeseen personal reasons.”\n\n“I hold Miss Universe in the highest regard,” he said on Instagram.\n\nTop 5 finalist Ahtisa Manalo explains why she got into pageants 18 years ago 0:59 • Source: CNN Top 5 finalist Ahtisa Manalo explains why she got into pageants 18 years ago 0:59\n\nThe Miss Universe Organization saw a leadership shakeup after Thai media tycoon Anne Jakkaphong Jakrajutatip stepped down in June. Mario Búcaro was appointed the new CEO at the end of October, just days before delegates arrived. Jakkaphong, who is also a transgender rights advocate, bought the organization for $20 million in 2022, but her company filed for bankruptcy in 2023.\n\nNext year’s Miss Universe contest will take place in Puerto Rico.\n\nThis article was updated with results and details of the competition.",
  "authors": [
    "Lex Harvey"
  ],
  "url": "https://www.cnn.com/2025/11/20/style/miss-universe-2025-finale-winner-intl-hnk"
}