{
  "title": "Which countries have qualified for the 2026 World Cup?",
  "text": "The 2026 World Cup, which is taking place in the United States, Canada and Mexico, begins on June 11 next year. It will be the 23rd edition of the tournament and the first with 48 countries competing.\n\nQualification around the globe is nearing completion and 42 teams have secured their place at the world’s biggest sporting event.\n\nAdvertisement\n\nThe final six places will be determined by the results of the European and inter-confederation play-offs, both of which take place in March. The draw for those play-off games takes place on Thursday, November 20.\n\nWhich countries have secured their spot in North America next summer? How many places are awarded to each continental confederation?\n\nHere is The Athletic’s guide to the state of play, which will be updated as qualification progresses.\n\nHow many teams from each confederation will be at the World Cup?\n\nHere are the six confederations — which represent every FIFA-recognised country in the world — and how many places each has been allocated at the tournament:\n\nAFC (Asia): Eight direct places and one team will compete in the inter-confederation play-offs.\n\nCAF (Africa): Nine direct places and one team will compete in the inter-confederation play-offs.\n\nCONCACAF (North America, Central America & Caribbean): Three direct places and two teams will compete in the inter-confederation play-offs. This excludes hosts United States, Canada and Mexico, who all automatically qualified as co-hosts.\n\nUSMNT have already qualified for the World Cup as co-hosts (Julio Aguilar/Getty Images)\n\nCONMEBOL (South America): Six direct places and one team will compete in the inter-confederation play-offs.\n\nOFC (Oceania): One direct place and one team will compete in the inter-confederation play-offs.\n\nUEFA (Europe): Sixteen direct places, with four of them being European play-off winners (16 teams are contesting these play-offs).\n\nThe inter-confederation play-offs will involve six teams, and two of them will advance to the World Cup. Oceania’s New Caledonia, South America’s Bolivia, Africa’s DR Congo, Asia’s Iraq and North America’s Jamaica and Suriname are the sides that will be contesting them. (Suriname is in South America but plays its football in the North American section).\n\nWhat stage of qualification is each confederation at?\n\nAFC (Asia): The five rounds have been completed. Eight sides have qualified automatically while Iraq will compete in the inter-confederation play-offs.\n\nAdvertisement\n\nCAF (Africa): The first round finished in October, with the nine group winners qualifying. Gabon, DR Congo, Cameroon and Nigeria then contested the second round in November, with DR Congo triumphing and thus advancing to the inter-confederation play-offs.\n\nCONCACAF (North America): The three rounds have been completed. Three sides have qualified automatically while Jamaica and Suriname will compete in the inter-confederation play-offs.\n\nCONMEBOL (South America): It has finished, with the 10-team group containing all of the confederation’s members now completed. All the sides played each other home and away and the top six sides qualified automatically. Bolivia will compete in the inter-confederation play-offs.\n\nOFC (Oceania): It has finished, with New Zealand qualifying. New Caledonia will compete in the inter-confederation play-offs.\n\nUEFA (Europe): The group stage has been completed and 12 sides have qualified automatically. Sixteen teams will now contest the European play-offs in March, with four of them advancing to the World Cup.\n\nWhich countries have qualified?\n\nUnited States (North, Central America and the Caribbean)\n\nPrevious World Cup appearances: 11\n\nBest performance: Third place in 1930\n\nHead coach: Mauricio Pochettino\n\nThe United States are hosting the World Cup for the second time — the first was in 1994 — and under former Tottenham Hotspur and Chelsea manager Mauricio Pochettino will be desperate to perform well. They qualified automatically as co-hosts.\n\nUSMNT haven’t got past the round of 16 since 2002 and only once have they reached the semi-finals — in the inaugural competition in 1930 when they were knocked out by Argentina.\n\nCanada (North, Central America and the Caribbean)\n\nPrevious World Cup appearances: Two\n\nBest performance: Group stage in 1986 & 2022\n\nHead coach: Jesse Marsch\n\nAdvertisement\n\nThe Canadians are playing at back-to-back World Cups for the first time and under former Leeds United manager Jesse Marsch will be aiming for a maiden appearance in the knockout stage. They qualified automatically as co-hosts.\n\nMarsch will lead Canada to their third World Cup (Frederic J Brown/AFP/Getty Images)\n\nMexico (North, Central America and the Caribbean)\n\nPrevious World Cup appearances: 17\n\nBest performance: Quarter-finals in 1970 & 1986\n\nHead coach: Javier Aguirre\n\nMexico are hosting the men’s World Cup for a record third time, after previously doing so in 1970 and 1986. Like USMNT and Canada, they qualified automatically.\n\nThe Mexicans haven’t made the quarter-finals of the tournament since 1986 and were knocked out in the round of 16 at seven World Cups in a row from 1994 to 2018.\n\nHowever, they are the reigning CONCACAF Gold Cup and CONCACAF Nations League champions and, on paper, they are the strongest of the three host nations.\n\nJapan (Asia)\n\nPrevious World Cup appearances: Seven\n\nBest performance: Round of 16 in 2002, 2010, 2018 & 2022\n\nHead coach: Hajime Moriyasu\n\nJapan became the first country, other than the three host nations, to qualify for the World Cup with their 2-0 victory over Bahrain on March 20, 2025. It will be their eighth consecutive appearance at the tournament.\n\nAyase Ueda was Japan’s top scorer in qualifying, with the 27-year-old Feyenoord striker finding the net eight times.\n\nAyase Ueda played his part for Japan (Koji Watanabe/Getty Images)\n\nNew Zealand (Oceania)\n\nPrevious World Cup appearances: Two\n\nBest performance: First group stage in 1982 & Group stage in 2010\n\nHead coach: Darren Bazeley\n\nNew Zealand are back at the World Cup for the first time since 2010, where they were eliminated in the group stage after drawing all three of their games.\n\nThis is the first World Cup where Oceania is guaranteed a spot at the tournament, and given Australia qualify in the Asian section, it was always likely that New Zealand would be in North America next summer.\n\nThe ‘All Whites’ breezed through qualifying, winning all three of their group games by an aggregate scoreline of 19-1. They then beat Fiji 7-0 in the semi-finals on March 21 before defeating New Caledonia 3-0 in the final on March 24, 2025 to book their place at the World Cup.\n\nAdvertisement\n\nNottingham Forest’s Chris Wood, who played at the 2010 World Cup, was New Zealand’s top scorer in qualifying with nine goals.\n\nIran (Asia)\n\nPrevious World Cup appearances: Six\n\nBest performance: First group stage in 1978 & Group stage in 1998, 2006, 2014, 2018 & 2022\n\nHead coach: Amir Ghalenoei\n\nIran reached their fourth World Cup in a row with two games to spare after securing their place in North America with a 2-2 draw against Uzbekistan on March 25, 2025.\n\nOlympiacos’ Mehdi Taremi was their top scorer with 10 goals.\n\nArgentina (South America)\n\nPrevious World Cup appearances: 18\n\nBest performance: Winners in 1978, 1986 & 2022\n\nHead coach: Lionel Scaloni\n\nThe defending champions qualified with ease and will be among the favourites next summer. They secured their place at the tournament on March 25, 2025.\n\nLionel Messi will be confident of playing at a record-breaking sixth World Cup (Portugal’s Cristiano Ronaldo is also on five) and perhaps of also becoming the tournament’s all-time top scorer — he currently trails Germany’s Miroslav Klose by three goals.\n\nAs well as their triumph in Qatar in 2022, Argentina won Copa America in 2021 and 2024 — meaning the last major tournament they played in and didn’t win was the 2019 edition of South America’s continental championship.\n\nOnly Brazil (22) and Germany/West Germany (20) have played at more World Cups than Argentina.\n\nUzbekistan (Asia)\n\nPrevious World Cup appearances: 0\n\nBest performance: N/A\n\nHead coach: Fabio Cannavaro\n\nUzbekistan became the first team who had never played at the World Cup before to qualify for the 2026 edition with their draw against United Arab Emirates on June 5, 2025.\n\nAs well as being the first double-landlocked country to ever reach the World Cup, they are also just the second former Soviet Republic (excluding Russia) to do so; after Ukraine in 2006.\n\nManchester City defender Abdukodir Khusanov is their star player and though he has played at the back so far in qualifying it would not be a surprise to see him operating higher up the pitch at the tournament next summer.\n\nAdvertisement\n\nUzbekistan qualified with a game to spare.\n\nSouth Korea (Asia)\n\nPrevious World Cup appearances: 11\n\nBest performance: Fourth place in 2002\n\nHead coach: Hong Myung-bo\n\nSouth Korea have now reached every World Cup from 1986 onwards, with their surprise run to the semi-finals as co-hosts in 2002 the only time they have gone beyond the round of 16 in this time.\n\nSon Heung-min is closing in on the all-time goals record for South Korea and even though he will be almost 34 when the tournament starts, a lot of the Asian nation’s hopes will rest on his shoulders. He scored 10 goals in qualifying.\n\nSouth Korea were knocked out in the round of 16 by Brazil at the 2022 World Cup and will be hoping to improve on this in the United States, Canada and Mexico after qualifying on June 5, 2025 with a game to spare.\n\nJordan (Asia)\n\nPrevious World Cup appearances: 0\n\nBest performance: N/A\n\nHead coach: Jamal Sellami\n\nJordan became the second debutants to reach the 2026 World Cup, securing their place on June 5, 2025 (two hours after Uzbekistan) with a game to spare.\n\nThe 25-year-old Ali Olwan was their top scorer in qualifying with nine goals.\n\nJordan finished as runners-up at the 2023 AFC Asian Cup, losing the final to Qatar after stunning South Korea in the semi-finals.\n\nAustralia (Asia)\n\nPrevious World Cup appearances: Six\n\nBest performance: Round of 16 in 2006 & 2022\n\nHead coach: Tony Popovic\n\nAustralia, who qualify in the Asian section, have now reached every World Cup from 2006 onwards.\n\nAn impressive 1-0 victory over Japan in Perth on June 5, 2025 put them on the brink and their 2-1 win over Saudi Arabia on June 10 secured their spot at the tournament next summer.\n\nKusini Yengi, who has just spent two seasons at English club Portsmouth, was Australia’s top scorer in qualifying with six goals.\n\nBrazil (South America)\n\nPrevious World Cup appearances: 22\n\nBest performance: Winners in 1958, 1962, 1970, 1994 & 2002\n\nHead coach: Carlo Ancelotti\n\nAdvertisement\n\nNext summer, Brazil will maintain their record of playing at every World Cup — the only country to do so.\n\nAfter a mixed qualification campaign, the five-time champions secured their place at the tournament with a 1-0 win over Paraguay on June 10, 2025.\n\nIt was Carlo Ancelotti’s second match as Brazil’s head coach and the Italian will be desperate to add the World Cup to his glittering C.V.\n\nEcuador (South America)\n\nPrevious World Cup appearances: Four\n\nBest performance: Round of 16 in 2006\n\nHead coach: Sebastian Beccacece\n\nEcuador qualified for the World Cup after a 0-0 draw with Peru on June 10, 2025.\n\nEcuador’s qualification is all the more impressive given they were deducted three points before any of the games got underway due to fielding an ineligible player in the 2022 qualifiers.\n\nUruguay (South America)\n\nPrevious World Cup appearances: 14\n\nBest performance: Winners in 1930 & 1950\n\nHead coach: Marcelo Bielsa\n\nThe winners of the first World Cup will be playing at their fifth consecutive edition of the tournament, the first time they have achieved this.\n\nThey will be looking to improve on a disappointing showing in 2022 when they were knocked out in the group stage.\n\nUruguay head coach Marcelo Bielsa (Ernesto Ryan/Getty Images)\n\nParaguay (South America)\n\nPrevious World Cup appearances: 8\n\nBest performance: Quarter-finals in 2010\n\nHead coach: Gustavo Alfaro\n\nParaguay qualified for the World Cup for the first time since 2010 after a hard-fought qualifying campaign in South America.\n\nThey were edged out by eventual winners Spain in the last eight at that tournament 15 years ago, and will be hoping to make a similar mark at next summer’s edition.\n\nColombia (South America)\n\nPrevious World Cup appearances: 6\n\nBest performance: Quarter-finals in 2014\n\nHead coach: Nestor Lorenzo\n\nColombia are back after missing out on the 2022 World Cup. The nation’s record appearance-maker, goalkeeper David Ospina, is still in the squad and the same is true of James Rodriguez — the winner of the Golden Boot at the 2014 tournament.\n\nAdvertisement\n\nMorocco (Africa)\n\nPrevious World Cup appearances: 6\n\nBest performance: Fourth place in 2022\n\nHead coach: Walid Regragui\n\nIn 2022, Morocco became the first African side to reach the semi-finals of a World Cup after winning their group and then getting past Spain in the round of 16 and Portugal in the quarter-finals.\n\nThey lost to France in the last four and to Croatia in the third-place play-off.\n\nBefore next summer’s tournament, the country will host the Africa Cup of Nations across December 2025 and January 2026.\n\nTunisia (Africa)\n\nPrevious World Cup appearances: 6\n\nBest performance: First group stage in 1978 & Group stage in 1998, 2002, 2006, 2018 & 2022\n\nHead coach: Sami Trabelsi\n\nTunisia have qualified for their third World Cup in a row and will be desperate to make it out of the group stage for the first time in their history.\n\nEgypt (Africa)\n\nPrevious World Cup appearances: Three\n\nBest performance: Round of 16 in 1934 & Group stage in 1990 & 2018\n\nHead coach: Hossam Hassan\n\nMohamed Salah’s Egypt are back at the World Cup after missing out in 2022. They were eliminated in the group stage in 1990 and 2018 and the round of 16 in 1934.\n\nThe latter of those tournaments was a straight knockout competition and the round of 16 was the first round, hence the country’s best performance being listed above as a tie between all three of the editions they have played at.\n\nSalah in action for Egypt (Abdel Majid Bziouat/AFP via Getty Images)\n\nSalah is chasing down his country’s all-time goalscoring record, which is currently held by the team’s head coach, Hossam Hassan.\n\nAlgeria (Africa)\n\nPrevious World Cup appearances: Four\n\nBest performance: Round of 16 in 2014\n\nHead coach: Vladimir Petkovic\n\nAs expected, Algeria qualified from a group containing Mozambique, Botswana, Uganda, Guinea and Somalia.\n\nThe biggest country in Africa by size, their star man is former Leicester City and Manchester City player Riyad Mahrez.\n\nAdvertisement\n\nGhana (Africa)\n\nPrevious World Cup appearances: Four\n\nBest performance: Quarter-finals in 2010\n\nHead coach: Otto Addo\n\nWith the exception of 2018, Ghana have now qualified for every World Cup from 2006 onwards. Their best showing, in 2010, saw them agonisingly knocked out by Uruguay in the last eight after a penalty shootout which followed Luis Suarez’s goal-line handball.\n\nCape Verde (Africa)\n\nPrevious World Cup appearances: 0\n\nBest performance: N/A\n\nHead coach: Bubista\n\nCape Verde became the third debutants to qualify for the 2026 World Cup following their victory over Eswatini on October 13, 2025.\n\nThey saw off Cameroon, the first African side to reach the World Cup quarter-finals (in 1990), to claim top spot in their group.\n\nThe country is the smallest by area to ever qualify for the World Cup.\n\nSouth Africa (Africa)\n\nPrevious World Cup appearances: Three\n\nBest performance: Group stage in 1998, 2002 & 2010\n\nHead coach: Hugo Broos\n\nSouth Africa came through a group containing Rwanda, Benin, Nigeria, Lesotho and Zimbabwe and will play at their first World Cup since hosting the tournament in 2010.\n\nThey were deducted three points for fielding an ineligible player against Lesotho in March 2025, but managed to get over the line on the final day by beating Rwanda while Benin lost to Nigeria.\n\nSouth Africa will be looking to reach the knockout stage for the first time in their history.\n\nQatar (Asia)\n\nPrevious World Cup appearances: One\n\nBest performance: Group stage in 2022\n\nHead coach: Julen Lopetegui\n\nThe 2022 hosts qualified after seeing off United Arab Emirates and Oman in the fourth round of qualifying in Asia.\n\nQatar are managed by Julen Lopetegui, who was sacked as Spain head coach on the eve of the 2018 World Cup after it was revealed he had agreed to become Real Madrid boss after the tournament.\n\nAdvertisement\n\nEngland (Europe)\n\nPrevious World Cup appearances: 16\n\nBest performance: Winners in 1966\n\nHead coach: Thomas Tuchel\n\nEngland breezed through a qualifying group containing Albania, Serbia, Latvia and Andorra to book their place at the World Cup with two games to spare.\n\nCaptain Harry Kane is in superb form for Bayern Munich and German head coach Thomas Tuchel will be desperate for the talisman to continue in this vein all the way through to mid-July.\n\nSaudi Arabia (Asia)\n\nPrevious World Cup appearances: Seven\n\nBest performance: Round of 16 in 1994\n\nHead coach: Herve Renard\n\nSaudi Arabia will be competing at their third World Cup in a row after a harder-than-expected qualifying campaign.\n\nThey didn’t finish in the top two in their group in the third round of Asian qualification, but saw off Iraq and Indonesia in the fourth round to book their place in North America next summer.\n\nSaudi Arabia have only got out of the groups in one of their previous seven World Cup appearances — doing so in the 1994 edition in the United States.\n\nIvory Coast (Africa)\n\nPrevious World Cup appearances: Three\n\nBest performance: Group stage in 2006, 2010 & 2014\n\nHead coach: Emerse Faa\n\nIvory Coast will play at their first World Cup in 12 years and will be looking to build upon their Africa Cup of Nations win in February 2024.\n\nTheir closest challengers in qualifying were Gabon.\n\nSenegal (Africa)\n\nPrevious World Cup appearances: Three\n\nBest performance: Quarter-finals in 2002\n\nHead coach: Pape Thiaw\n\nSenegal have qualified for their third World Cup in a row after seeing off a tough challenge from DR Congo in qualifying.\n\nIn 2002 they became the second African country to reach the World Cup quarter-finals, after Cameroon in 1990. Current head coach Pape Thiaw played for Senegal in that tournament in 2002.\n\nFrance (Europe)\n\nPrevious World Cup appearances: 16\n\nBest performance: Winners in 1998 & 2018\n\nHead coach: Didier Deschamps\n\nAdvertisement\n\nThe 2022 runners-up qualified for next summer’s edition with a game to spare and, given their triumph in 2018, will be aiming to become the third side to reach three World Cup finals in a row after West Germany in 1982, 1986 and 1990 and Brazil in 1994, 1998 and 2002.\n\nDidier Deschamps, who lifted the World Cup as France captain in 1998 and France manager in 2018, has been in his current role (manager) since 2012. He will be stepping down after the tournament.\n\nKylian Mbappe has scored 12 goals at the World Cup overall (four in 2018 and eight in 2022) and will be aiming to break Miroslav Klose’s record at the tournament of 16.\n\nMbappe celebrates scoring in qualifying (Franco Arland/Getty Images)\n\nThough it is worth noting that Argentina’s Messi, who is also set to play next summer, has scored 13 World Cup goals.\n\nCroatia (Europe)\n\nPrevious World Cup appearances: Six\n\nBest performance: Second place in 2018\n\nHead coach: Zlatko Dalic\n\nCroatia have qualified for four World Cups in a row for the first time in their history and will be looking to once again punch above their weight on the global stage. A remarkable run to the final in 2018 was followed up by a third-place finish in 2022 and, with the 40-year-old Luka Modric still pulling strings in midfield, another impressive showing cannot be ruled out.\n\nPortugal (Europe)\n\nPrevious World Cup appearances: Eight\n\nBest performance: Third place in 1966\n\nHead coach: Roberto Martinez\n\nPortugal qualified for their seventh World Cup in a row after topping a group containing Hungary, Armenia and Republic of Ireland.\n\nCaptain Ronaldo, who will be 41 by the time next summer’s tournament starts, will be aiming to score at a record-extending sixth World Cup.\n\nPortugal’s Ronaldo (Carlos Rodrigues/Getty Images)\n\nNorway (Europe)\n\nPrevious World Cup appearances: Three\n\nBest performance: Round of 16 in 1998\n\nHead coach: Stale Solbakken\n\nNorway have reached the World Cup for the first time since 1998 after seeing off Italy. Erling Haaland scored an incredible 16 goals in qualifying and will be hoping to continue his superb form right the way through to next summer.\n\nAdvertisement\n\nGermany (Europe)\n\nPrevious World Cup appearances: 20\n\nBest performance: Winners in 1954, 1974, 1990 & 2014\n\nHead coach: Julian Nagelsmann\n\nOnly Brazil have played at more World Cups than Germany, with the Europeans last missing the tournament in 1950 when they were banned.\n\nHowever, the Germans have been humiliatingly knocked out in the groups at the last two World Cups and will be determined to avoid a similar fate this time around.\n\nNetherlands (Europe)\n\nPrevious World Cup appearances: 11\n\nBest performance: Second place in 1974, 1978 & 2010\n\nHead coach: Ronald Koeman\n\nThree-time finalists the Netherlands held off Poland to qualify for next summer’s World Cup. Memphis Depay has been their top scorer in qualifying and the 31-year-old is now the county’s all-time top scorer too.\n\nThe Dutch have a talented squad, can they finally get over the line in the sport’s biggest competition?\n\nBelgium (Europe)\n\nPrevious World Cup appearances: 14\n\nBest performance: Third place in 2018\n\nHead coach: Rudi Garcia\n\nBelgium came through a qualifying group containing North Macedonia, Wales, Kazakhstan and Liechtenstein to qualify for the World Cup and they will be desperate to improve on their group-stage exit at the 2022 edition in Qatar.\n\nAll-time top scorer Romelu Lukaku will be aiming to reach 100 international goals in the near future (he is currently on 89) and he is likely to be just one member of a talented Belgian squad that will back themselves to go far next summer.\n\nAustria (Europe)\n\nPrevious World Cup appearances: Seven\n\nBest performance: Third place in 1954\n\nHead coach: Ralf Rangnick\n\nAustria have qualified for the World Cup for the first time since 1998 after holding off Bosnia and Herzegovina.\n\nFormer Manchester United manager Ralf Rangnick is in charge of the team and Austria will be hoping to reach the knockout stage at the very least, something they have done at the last two European Championships.\n\nAdvertisement\n\nSwitzerland (Europe)\n\nPrevious World Cup appearances: 12\n\nBest performance: Quarter-finals in 1934, 1938 & 1954\n\nHead coach: Murat Yakin\n\nThe Swiss have qualified for their sixth World Cup in a row and will be looking to reach the quarter-finals for the first time since 1954.\n\nThey came through a qualification group containing Kosovo, Slovenia and Sweden.\n\nSpain (Europe)\n\nPrevious World Cup appearances: 16\n\nBest performance: Winners in 2010\n\nHead coach: Luis de la Fuente\n\nSpain breezed through qualifying, winning their group after seeing off Turkey, Georgia and Bulgaria.\n\nThe European champions are among the favourites to win next year’s World Cup, and have a dazzlingly-talented squad.\n\nScotland (Europe)\n\nPrevious World Cup appearances: Eight\n\nBest performance: Group stage in 1954, 1958, 1974, 1978, 1982, 1986, 1990 & 1998\n\nHead coach: Steve Clarke\n\nScotland have qualified for the World Cup for the first time in the 21st century after pipping Denmark to top spot in their group.\n\nThey have some talented players and will be determined to get out of the groups at the tournament for the first time, at the ninth attempt.\n\nScotland celebrate reaching the World Cup (Craig Williamson/SNS Group via Getty Images)\n\nHaiti (North America)\n\nPrevious World Cup appearances: One\n\nBest performance: First group stage in 1974\n\nHead coach: Sebastien Migne\n\nHaiti will be back at the World Cup for the first time in 52 years after qualifying ahead of Honduras, Costa Rica and Nicaragua in the third round of the North American section.\n\nMidfielder Jean‐Ricner Bellegarde is playing for Wolverhampton Wanderers in the Premier League this season.\n\nCuracao (North America)\n\nPrevious World Cup appearances: 0\n\nBest performance: N/A\n\nHead coach: Dick Advocaat\n\nCuracao have become the smallest team by both size and population to qualify for the World Cup after sensationally topping a third-round group in North America ahead of Jamaica, Trinidad and Tobago and Bermuda.\n\nAdvertisement\n\nCuracao, which is made up of two islands off the north coast of South America and is part of the Netherlands despite having its own football team, has a population of around 185,000 and a size of just 444km², smaller than the Isle of Man in the Irish Sea.\n\nAlmost all of their squad play their club football in Europe.\n\nPanama (North America)\n\nPrevious World Cup appearances: One\n\nBest performance: Group stage in 2018\n\nHead coach: Thomas Christiansen\n\nPanama are back at the World Cup after seeing off Guatemala, Suriname and El Salvador in the third round of qualifying.\n\nThe country’s all-time record appearance maker Anibal Godoy is their captain and they have players at clubs dotted all over the world, from Norwich City in England to Mazatlan in Mexico.",
  "authors": [
    "Will Jeanes"
  ],
  "url": "https://www.nytimes.com/athletic/6226492/2025/11/19/world-cup-2026-qualified-countries/"
}