{
  "title": "You can get up to 30 percent off Sonos speakers and soundbars right now",
  "text": "If you’ve been waiting for some relief after Sonos raised its prices earlier this year in response to US tariffs, Black Friday presents a rare opportunity. With many products on sale for their lowest price to date for Black Friday, and the Sonos app being in far better shape than it was a year ago, it’s a great time to pick up a Sonos gadget.\n\nIf you’re looking to upgrade your home theater setup ahead of the holidays, Sonos’ entire soundbar lineup is heavily discounted through December 1st, as are smart speakers like the Sonos Era 100 and portable Roam 2. The Sonos Ace — the company’s first pair of noise-canceling headphones — are down to their best price to date at several retailers, if you truly want to go all in on the Sonos ecosystem.\n\nRight now, both the Sonos Arc Ultra (Amazon, Best Buy, Sonos) and the latest Sonos Beam (Amazon, Best Buy, Sonos) have dropped to historic lows, with the Ultra going for $879 ($220 off) and the Beam for $349 ($150 off). The second-gen Beam is the smaller of the two and works well in smaller spaces like apartments. It supports Dolby Atmos and HDMI eARC, delivering impressive sound for its size, so movies and TV shows feel noticeably richer. You can also use it as a smart speaker with support for Amazon Alexa (and Bluetooth).\n\nThe Sonos Arc Ultra, however, is the better pick if you’re aiming for a true home theater setup or want something beefier for a larger space. It delivers far more powerful audio with eight woofers, three tweeters, and two upward-firing Dolby Atmos speakers, which creates the sense that sound is coming from above — something the Beam can’t replicate with its virtual height channels. It also builds on the original Arc with more immersive audio, support for Bluetooth playback, and Trueplay EQ tuning.\n\nIt’s not just soundbars that have dropped to new low prices. Sonos’ first pair of over-ear headphones, the Sonos Ace, are also cheaper than ever now that they’re available for $279 ($120 off) from Amazon, Best Buy, and Sonos. The stylish headphones combine style with impressive sound, effective noise cancellation, and a natural-sounding transparency mode. They’re also comfortable and offer up to 30 hours of battery life, which makes them perfect for marathon cross-country flights.\n\nWhat really sets the Sonos Ace apart from other pairs of ANC headphones, though, is their TV Audio Swap feature, which was updated in July to let you pair up to two headphones with a Sonos soundbar for private listening. The unique feature also supports spatial audio that adapts to your space and head tracking, providing a more immersive experience when watching movies, regardless of the device you’re using to do so.\n\nIf you’re looking for a portable option, the company is also offering solid deals on a number of smart speakers — including the Sonos Roam 2, which is available for $139 ($40 off) from Amazon, Best Buy, and Sonos. The pint-size speaker delivers clean, detailed audio, lasts up to 10 hours on a single charge, and has an IP67 rating for water and dust resistance. It also supports both Apple’s AirPlay 2 and Amazon Alexa (when connected to a Wi-Fi network) and can be used right out of the box. That’s a welcome change from the original Roam, which required you to work through a somewhat awkward setup process using the Sonos app.\n\nLast but not least, if you’re on the market for a smart speaker, the Sonos Era 100 is down to $169 ($30 off) at Amazon, Best Buy, and Sonos’ online store, while the Sonos Era 300 (Amazon, Sonos, Best Buy) is going for $379 ($100 off). The Era 100 — arguably the best smart speaker for most people — delivers rich bass thanks to a large midwoofer and dual tweeters, with support for both Bluetooth and line-in using an optional USB-C adapter. The Era 300 builds upon that experience with Dolby Atmos support, as well as four tweeters that point forward, left, right, and up. It also features angled woofers, which spread sound more evenly throughout the room than the Era 100.\n\nVerge Deals Sign up for Verge Deals to get deals on products we’ve tested sent to your inbox weekly. Email (required) Sign Up By submitting your email, you agree to our Terms and Privacy Notice . This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.",
  "authors": [
    "Sheena Vasani"
  ],
  "url": "https://www.theverge.com/tech/823523/sonos-black-friday-deals-soundbar-speaker-sale-2025"
}