{
  "title": "El juez Boasberg reanudará la investigación por desacato penal contra funcionarios de Trump ligados a vuelos de deportación",
  "text": "CNN —\n\nUn juez federal dijo este miércoles que planea avanzar “con prontitud” con el esfuerzo para determinar qué funcionarios del Gobierno de Trump incumplieron sus órdenes en un caso migratorio de alto impacto, y si enfrentarán sanciones por sus acciones.\n\nLos comentarios del juez de distrito James Boasberg, presidente del tribunal federal de primera instancia en Washington, llegan casi una semana después de que una corte de apelaciones despejó el camino para que continúe con una investigación por desacato penal que había quedado suspendida hace meses.\n\n“Estoy autorizado a proceder tal como pensaba hacerlo en abril, hace siete meses”, dijo Boasberg durante la audiencia de este miércoles en el caso migratorio relacionado con el uso que hizo el presidente Donald Trump de la Ley de Enemigos Extranjeros para acelerar deportaciones de presuntos miembros de una banda venezolana.\n\n“Esto ha estado detenido durante mucho tiempo y creo que la justicia requiere que actúe con rapidez”, añadió.\n\nBoasberg, designado por el expresidente Barack Obama, había ordenado a mediados de marzo que el Gobierno detuviera aviones que transportaban migrantes deportados a una prisión notoria en El Salvador bajo esa amplia autoridad de tiempos de guerra del siglo XVIII.\n\nSin embargo, los vuelos continuaron, y los migrantes permanecieron varios meses en la prisión antes de ser liberados este verano como parte de un canje de prisioneros con Venezuela.\n\n“Ciertamente tengo la intención de averiguar qué pasó ese día”, dijo Boasberg el miércoles.\n\nLo que Boasberg quiere averiguar\n\nEn una decisión de gran impacto emitida en abril, Boasberg dijo que “existe causa probable para considerar al Gobierno en desacato penal”. Pero antes de poder avanzar para determinar quién fue responsable de desobedecer sus órdenes, el proceso fue detenido por la Corte de Apelaciones del Circuito del Distrito de Columbia. Esa corte, el viernes, despejó el camino para que reiniciara su investigación.\n\nEl juez sugirió que parte de su indagación podría incluir declaraciones de funcionarios del Gobierno o llevarlos a su sala para que declaren bajo juramento. Esas audiencias, dijo, podrían comenzar tan pronto como el 1 de diciembre.\n\nEntre las personas de las que quiere escuchar está un exabogado del Departamento de Justicia que denunció, como informante a principios de este año, que un alto funcionario del departamento dijo a sus colegas en marzo que el Gobierno tenía la intención de ignorar las órdenes judiciales como parte de su enérgico esfuerzo por deportar a inmigrantes.\n\nEsa denuncia, dijo Boasberg, es solo una parte de los “avances significativos” que ocurrieron mientras sus procedimientos de desacato estuvieron en pausa durante gran parte del año.\n\nLas decisiones de Boasberg en el caso este año provocaron la ira de Trump, quien pidió la destitución del juez, lo que llevó a un inusual reproche del presidente de la Corte Suprema, John Roberts. El magistrado jefe dijo que la forma adecuada de responder a un fallo con el que se discrepa es apelarlo.\n\nMientras tanto, el senador Lindsey Graham, republicano de Carolina del Sur, y varios otros senadores republicanos piden suspender e imputar a Boasberg tras enterarse de que el juez no permitió que la compañía Verizon les notificara que sus registros telefónicos habían sido citados en la investigación del asalto al Capitolio del 6 de enero de 2021.\n\nBoasberg pidió al Departamento de Justicia y a los abogados detrás del desafío legal a la Ley de Enemigos Extranjeros que presenten su postura sobre cómo debería proceder con la investigación de desacato antes del lunes.",
  "authors": [
    "Devan Cole"
  ],
  "url": "https://cnnespanol.cnn.com/2025/11/19/eeuu/juez-boasberg-investigacion-funcionarios-vuelos-deportacion-trax"
}