{
  "title": "‘Buy now, pay later’ is expanding fast, and that should worry everyone",
  "text": "When Nigel Morris tells you he’s worried about the economy, you listen. As industry observers know, Morris co-founded Capital One and pioneered lending to subprime borrowers, building an empire on understanding exactly how much financial stress the average American can handle. Now, as an early investor in Klarna and other buy now, pay later companies like Aplazo in Mexico, he’s watching something that makes him deeply uncomfortable.\n\n“To see that people are using [BNPL services] to buy something as basic and fundamental as groceries,” Morris told me onstage at Web Summit in Lisbon this week, “I think is a pretty clear indication that a lot of people are struggling.”\n\nThe statistics back up his unease. Buy now, pay later services have exploded to 91.5 million users in the United States, according to the financial services firm Empower, with 25% using the services to finance their groceries as of earlier this year, according to survey data released in late October by lending marketplace Lending Tree.\n\nThese aren’t discretionary purchases — the designer bags and latest Apple headphones that BNPL was marketed for originally. Borrowers aren’t paying it all back, either. According to Lending Tree, default rates are accelerating: 42% of BNPL users made at least one late payment in 2025, up from 39% in 2024 and 34% in 2023.\n\nThis isn’t just a consumer finance story; it’s a canary in the coal mine for the entire venture-backed fintech ecosystem and beyond, echoing what preceded the 2008 mortgage crisis except for one thing: It’s largely invisible.\n\nBecause most BNPL loans aren’t reported to credit bureaus, they create what regulators call “phantom debt.” That means other lenders can’t see when someone has taken out five different BNPL loans across multiple platforms. The credit system is flying blind.\n\n“In a world where, if I’m a buy-now-pay-later provider, and I’m not checking bureau data, I’m not feeding bureau data, I am oblivious to the fact that Nigel may have taken out 10 of these things in the last week,” Morris explained. “[That’s] absolutely true.”\n\nTechcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | WAITLIST NOW\n\nStorm clouds on the horizon\n\nThe numbers that are available are both ugly and dated. Consumer Financial Protection Bureau data published in January of this year — after the agency issued market monitoring orders to major BNPL providers, including Affirm, Afterpay, and Klarna — showed that roughly 63% of borrowers originated multiple simultaneous loans at some point during the year, and 33% took out loans from multiple BNPL lenders.\n\nThe data also revealed that in 2022, one-fifth of consumers with a credit record financed at least one purchase with a BNPL loan, up from 17.6% in 2021; about 20% of borrowers were heavy users originating more than one BNPL loan on average each month, an increase from 18% in 2021; and the average number of new loans originated per borrower increased from 8.5 to 9.5.\n\nThe borrower profile is as concerning: As of 2022, nearly two-thirds had lower credit scores, with subprime or deep subprime applicants being approved 78% of the time.\n\nTo be clear, BNPL isn’t yet a systemic threat. The total market is measured in hundreds of billions, not trillions. But the lack of visibility into this debt — combined with its concentration among already-stressed borrowers — is worth watching far more carefully.\n\nIndeed, given that the economy is worse now than three years ago for many subprime populations — particularly in auto lending — these numbers are likely a lot higher now.\n\n\n\nAs for why BNPL data isn’t more recent, thank regulatory upheaval. Under the Biden administration, the CFPB tried to treat BNPL transactions like credit card purchases, bringing them under Truth in Lending Act protections.\n\nThe Trump administration reversed course. In early May, the CFPB said it would not prioritize enforcement of that rule. Days later, CFPB acting director Russell T. Vought rescinded 67 interpretive rules, policy statements, and advisory opinions dating back to 2011, including the BNPL rule. The agency said the regulations provided “little benefit to consumers” and placed a “substantial burden” on regulated entities. (Translation: BNPL companies lobbied successfully.)\n\nIn fact, soon after, the CFPB released a new report with a surprisingly different message. Focusing only on first-time borrowers, the agency said customers with subprime or no credit repaid their BNPL loans 98% of the time and that there was no evidence that BNPL access causes debt stress.\n\nThe discrepancy between this rosy picture and the 42% late payment rate reveals the data gap at the heart of the problem: We currently don’t have good visibility into what happens to borrowers over time, especially those juggling multiple BNPL accounts. The optimistic report looked at first-time users; the concerning data comes from the entire user base.\n\nThe state of New York in May imposed licensing requirements on BNPL companies to fill the void. But state-by-state regulation creates a patchwork that sophisticated financial companies can easily navigate around.\n\n\n\nAsked if he sees parallels between this moment and 2008, Morris — who has kept his finger on the pulse of all things financial as a fintech investor for the last 18 years — was careful not to overstate the comparison.\n\n“So I think it is a real issue,” he said of the economy, choosing his words deliberately. “If you take a half step back and we look at the U.S. consumer at the moment, and we have a number of businesses that are in and around lending to this consumer — so far, so good. Delinquency is not rising yet. Charge-offs are not rising yet. But there’s clearly storm clouds on the horizon.”\n\nHe pointed to unemployment hitting 4.3%, its highest level in almost four years. He cited the “tumult around immigration and around tariffs and around the recent government shutdown.” Small and medium businesses “are very loath to invest. People have pulled back dramatically in the last nine months given all that noise.”\n\nAlso in the mix is the end of the student loan payment moratorium — “the largest asset class outside of mortgage,” Morris noted. Roughly 5.3 million borrowers are in default and another 4.3 million are in late-stage delinquency, according to a September Congressional Research Service analysis.\n\nMorris is careful to note that the current situation isn’t yet a crisis. “Delinquency is not rising yet. Charge-offs are not rising yet,” he acknowledged. But the combination of factors — phantom debt, rising unemployment, the end of student loan forbearance, and regulatory rollback — creates conditions where problems could accelerate quickly.\n\n\n\nThe big concern isn’t BNPL debt alone — it’s the cascading effects. The Federal Reserve Bank of Richmond has warned that BNPL’s potential systemic risk comes from its “spillover effects onto other consumer credit products.”\n\nImportant to understand is that because BNPL loans are typically smaller than credit card balances or auto loans, borrowers tend to prioritize keeping them current, which means other, larger debts start to default first. Someone might have a perfect record on their four BNPL accounts while their credit card, car loan, and student loan all go delinquent.\n\nConsumer lending takes “the mom test”\n\nMorris has lived both sides of this equation. He revolutionized subprime lending at Capital One. Then he backed fintech startups trying to disrupt the old guard, including Klarna, which went public earlier this year and currently boasts a $13.5 billion market cap, even though it’s barely profitable (including because it absorbs all the default risk of borrowers).\n\nGiven those years of insights, I asked him onstage: “Where is the line between catering to and helping an underbanked population and enabling people to dig a hole for themselves? Have these companies crossed it?”\n\nMorris genuinely seemed to wrestle with the question, telling the investor attendees who’d gathered to learn from the conversation that it’s a “very, very difficult question to answer. I think that the role of the moral compass in consumer lending is very, very important.”\n\nHe described “the mom test” from his Capital One days: “If this idea was presented to your mother and she called you up and said, ‘Son, should I take this product?’ And if you can’t unequivocally say, ‘Yes, it’s a good product,’ you should not be offering it to the American people.”\n\nPresumably, Morris wouldn’t put BNPL companies in this camp given his investments. But perhaps the rest of us should, at least while regulations — or a lack of them — remain what they are. Consider that because most BNPL companies don’t report to credit bureaus, it not only makes visibility into them challenging, but it means that borrowers can’t use successful repayment to access lower-cost credit.\n\nThat’s part of the business model, by the way. “Some of these buy now, pay later companies don’t want that to happen” — meaning for their customers to build up their credit scores — “because they don’t want the consumer to graduate,” Morris said.\n\nWhile Morris and I were discussing these ethical questions, the problem is poised to grow much bigger, with BNPL bleeding into every corner of the financial system, and the borders between this unregulated form of lending and traditional banking disappearing entirely.\n\nKlarna has been operating as a licensed bank in Europe since 2017. Affirm now has nearly 2.8 million debit cardholders who can finance purchases in physical stores, bringing installment debt into brick-and-mortar retail. Both companies are integrated into Apple Pay and Google Pay, making BNPL as frictionless as tapping your phone.\n\nNot wanting to be left behind, more established finance companies are racing toward BNPL now, too. PayPal said it processed $33 billion in BNPL spending in 2024, growing at 20% annually. Major banks now let customers split purchases after the fact. Through deals with payment processors like Adyen, JPMorgan Payments, and Stripe, Klarna’s services now reach millions of merchants automatically. What started as a niche checkout option is becoming embedded financial infrastructure.\n\nMorris sees this shift happening everywhere. “When I talk to some of these software companies that are now embedding payments, lending and insurance,” he told me, “and you say, ‘Okay, five years from now, where are you going to make your money?’” the answer surprises even veteran investors like him. “They say, ‘You know what, I think I’m going to make more money in embedded finance than I am in my core software.’”\n\nContinued Morris: “It starts off as a nice little add-on, but when the powers of the marketplace drive down the returns in the core business, it’s often these financing businesses that have the greatest longevity and market power.”\n\nA second bubble?\n\nThe real danger lies in what’s coming next, which is business-to-business BNPL. The trade credit market, where suppliers lend to companies buying their products, represents $4.9 trillion in payables among American firms alone, per data cited by The Economist. That’s four times larger than the entire U.S. credit card market. And BNPL companies, having conquered consumer lending, are now moving aggressively into this space.\n\nWhen small businesses gain access to BNPL, their spending increases by an average of 40%, according to B2B BNPL providers like Hokodo. It sounds great for commerce until you realize what it means, which is more debt, accumulating faster.\n\nIndeed, the debt itself is being packaged and sold at a pace that should alarm anyone who remembers 2008. Elliott Advisors last year purchased Klarna’s $39 billion British loan portfolio. In 2023, KKR agreed to buy up to $44 billion in BNPL debt from PayPal. As of June of this year, Affirm had issued around $12 billion in asset-backed securities.\n\nThis is the subprime mortgage playbook playing out in real time: Slice up risky consumer debt, sell it to investors who believe they understand the risk profile, and create layers of financial engineering that obscure where the actual exposure lies. Except this time, a lot of that underlying debt isn’t being reported to credit bureaus.\n\nMy own takeaway from my sit-down with Morris — and my research leading into it — is that we’re watching two potential bubbles right now, but only one is getting the attention it deserves, at least in Silicon Valley, certainly.\n\nThe AI bubble has been dominating headlines in recent weeks, as a growing number or people question the $100 billion data centers, sky-high valuations, and jaw-dropping venture rounds we’re seeing.\n\nThe BNPL situation is different but no less worth watching. It’s invisible, lightly regulated, and affecting the most vulnerable Americans — which is roughly 40% of them. It’s people financing their meals in four installments and recent graduates juggling student loan payments with three different BNPL accounts.\n\nThe champagne is flowing so freely in certain sectors of the economy that it makes this very big problem easy to overlook, but when consumer debt becomes unsustainable, there’s going to be a lot of pain across the board, and VCs and their venture-backed businesses will be among those to feel it.\n\nAs Morris watches his BNPL investments from the other side of the table, he seems to understand these warning signs better than most. He’s not predicting a crash — he’s urging vigilance. The question is whether regulators will do anything about it before it’s too late.",
  "authors": [
    "Connie Loizos",
    "Editor In Chief",
    "General Manager",
    "Sarah Perez",
    "Julie Bort",
    "Lorenzo Franceschi-Bicchierai",
    "Ram Iyer",
    "Anthony Ha",
    "Rebecca Bellan",
    "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var"
  ],
  "url": "https://techcrunch.com/2025/11/16/bnpl-is-expanding-fast-and-that-should-worry-everyone/"
}