{
  "title": "Spain has too rosy a view of Franco’s regime. Let’s remind ourselves of its horrors | Giles Tremlett",
  "text": "At first sight, few suspected that Francisco Franco might become a strongman capable of imposing a brutal dictatorship across four decades. He was a short, squeaky voiced army officer with a shaky grasp on non-military matters and zero charisma. Yet he did exactly that, before dying of natural causes in a Madrid hospital, 50 years ago this week.\n\nEven today, Franco serves as a warning that outward mediocrity is no barrier to the ruthlessly ambitious. Behind the dull facade lay a slippery, clever operator. Franco’s ambition was underpinned by an iron will, a glib indifference to violence and unbounded self-esteem.\n\nHis admirers and defenders – including some on the newly buoyant far right in Spain, the US and the UK – still claim Franco was never really a dictator, but rather a beloved saviour from communism. They are wrong, but dictators do not emerge from nowhere.\n\n“Some important part of every society consists of people who actively want tyranny,” French political theorist Jean-François Revel observed the year after Franco’s death: “either to exercise it themselves or – much more mysteriously – to submit to it.” Franco believed the same: what people really wanted was to see and feel themselves governed, he said.\n\nOf course, if Franco had been genuinely popular, there would have been no need for his 1936 military insurrection against an elected leftwing government, or for the half a million dead of the ensuing Spanish civil war. Nor would he have shot 20,000 people afterwards.\n\nFranco grabbed power in a Spain still slumped in post-imperial ennui – a mighty empire having disappeared the previous century. Franco wanted to make Spain great again. He blamed foreigners. They were either stealing Spain’s money, conspiring against it as part of a Marxist-Jewish-masonic plot, or poisoning Spanish minds with foreign ideas: liberal democracy, socialism, communism, and his bizarre bugbear, Freemasonry.\n\nHis war was deliberately slow and violent behind the lines, accompanied by a bloody purging of opponents in an attempt to “purify” this contaminated Spain. His new Spain also had to be a place of supposedly “virile” men and subservient women, whose rights to their bodies, children, work and property were cut, shelved, or handed over to husbands and fathers.\n\nAfter a vengeful victory, Franco locked Spain into a corset of self-reliance and threw away the key. Autarky was embraced. Foreign capital and goods were shunned. “We have everything we need,” he said.\n\nBut he was wrong. The immediate result was famine, with people dying on city streets in 1940 and 1945. As he drove on a victory tour through the towns of Jaén and Málaga, people begged at his car window. “Señor Franco, for God’s sake, a piece of bread,” they said. Even Nazi officials in Spain, his allies, complained that a grandiose facade hid the ghastly truth. By backing Hitler and Mussolini during the second world war, Franco turned Spain into a pariah state, but he refused to step aside afterwards. Spaniards sank further into misery.\n\nFranco’s conviction that he was both divinely chosen and always right meant he demanded a lifelong term in charge. A British ambassador complained that he lived in a “heavy mist of self-complacency”, blind to his own incompetence. Luck, and a lack of any definable ideology, came to Franco’s rescue. When the cold war started, he burnished his anti-communist credentials and the US rehabilitated him.\n\nAs a result, a disastrous economy was eventually rescued and forced to open up by the US and the International Monetary Fund. In the 1960s, Spain was swept into a southern European economic boom that had started long before in Italy and Portugal. Suddenly, tourists were pouring on to Spanish beaches at Benidorm or on the Costa del Sol. Many Spaniards still could not find work, but the money they sent home after emigrating to northern Europe also helped.\n\nFranco quietly dropped his most stupid ideas – from founding a new empire to making synthetic gasoline with a “magic” formula – but never abandoned his central aim of making Spaniards tame, obedient and politically apathetic. He invested massively in state terror from the 1936 coup onwards, deployed a strict, Goebbels-inspired press law, and ensured that generations of Spaniards were schooled in a heavily conservative and historically amnesiac Francoist curriculum. As late as the 1970s, independent political parties, free and fair elections and trade unions remained banned.\n\nFranco also infantilised Spaniards, deeming them incapable of governing themselves. The scariest part of his legacy was that so many believed him.\n\nWhen that fear-driven consensus finally began to fall apart during the last decade of his rule, he defaulted back to violent domination. Trigger-happy police, torture, firing squads and even that medieval form of execution, the garrote, reappeared. The latter saw a metal collar placed around a condemned person’s neck and tightened until it snapped their spine or cut off their air supply; it was being used by a western European government on its own citizens, in 1974.\n\nskip past newsletter promotion Sign up to This is Europe Free weekly newsletter The most pressing stories and debates for Europeans – from identity to economics to the environment Enter your email address Sign up Privacy Notice: Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on theguardian.com to send you this newsletter. You can complete full registration at any time. For more information about how we use your data see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nNevertheless, the historian Antonio Cazorla Sanchez, a deeply critical Franco biographer, recalls feeling sad as a boy, upon hearing the news that Franco had died: “The sadness of that 12-year-old boy was shared at the time by millions of Spaniards, who believed that the man who had just died had been the best possible solution for a country that was difficult to govern,” he wrote. “That is what they said at school, in the press, on the television … ”\n\nThe predominant sensation in response to Franco’s death was fear. After all, what happens after the man at the centre of a decades-long dictatorship dies? Power was initially passed to the young king Juan Carlos, who oversaw three years of reforms that ended with a referendum on the democratic constitution that still holds today. Spain remains a vibrant, disputatious democracy.\n\nHeroic narratives emerged to explain this. For the left, it was the result of pressure from brave street protesters, students and workers who fought continually with riot police. For the right, it was a sign of establishment wisdom. For Francoists, in the most twisted version of all, it forms part of the dictator’s legacy.\n\nAnd therein lies a problem. At the Madrid copy shop where I printed out drafts of my recent book on the dictator, El Generalisimo, the owner kept insisting that his father claimed to have lived well under Franco. His father remembered, of course, only the economic boom of the 1960s.\n\nWhile promoting the Spanish edition of the book, I have also realised that the problems described by María Ramírez about growing up surrounded by silence about the dictatorship are still with us. University students tell me that their high school teachers were still skirting around the subject just a year or two ago. As a father of young Spaniards, that is a huge worry.\n\nIgnorance is dangerous. It is not surprising that almost one in five young people believe his dictatorship was good for Spain. The only way to change that is to break the silence and teach young Spaniards what Francoism was really about.",
  "authors": [
    "Giles Tremlett"
  ],
  "url": "https://www.theguardian.com/commentisfree/2025/nov/21/spain-rosy-view-franco-regime-horrors"
}