{
  "title": "CDC website changed to include false claims that link autism and vaccines",
  "text": "Scientific information on the US Centers for Disease Control and Prevention’s website was replaced Wednesday with anti-vaccine talking points that don’t rule out a link between vaccines and autism, despite an abundance of evidence that there’s no connection.\n\nBullet points on the top of the page now state that “vaccines do not cause autism is not an evidence-based claim” because studies have not ruled out the possibility that infant vaccines cause autism.\n\nThe language is a common tactic used to cast doubt on the safety of vaccines, said Alison Singer, president and co-founder of the Autism Science Foundation.\n\n“You can’t do a scientific study to show that something does not cause something else,” she said Thursday.\n\n“All we can do in the scientific community is point to the preponderance of the evidence, the number of studies, the fact that the studies are so conclusive,” Singer said. “These studies all agree. They’re very clear, and it’s time to move on.”\n\nThe preponderance of scientific evidence shows that vaccines do not cause autism, Singer said.\n\n“No environmental factor has been better studied as a potential cause of autism than vaccines. This includes vaccine ingredients as well as the body’s response to vaccines,” the Autism Science Foundation said in a statement Thursday.\n\nDr. Paul Offit agrees. In a post on Substack on Thursday, Offit, a pediatrician and director of the Vaccine Education Center at Children’s Hospital of Philadelphia, said scientific studies can “never prove never.”\n\n“If RFK Jr. wanted to be honest with the American public, he would make it clear on the CDC’s website that chicken nuggets also might cause autism, which has never been and will never be disproven,” Offit wrote.\n\nHHS spokesperson Andrew Nixon said Thursday, “We are updating the CDC’s website to reflect gold standard, evidence-based science.”\n\nHowever, Dr. Marty Makary, commissioner of the US Food and Drug Administration, recently told CNN Chief Medical Correspondent Dr. Sanjay Gupta on an episode of his “Chasing Life” podcast that he doesn’t think vaccines cause autism.\n\n“I think there’s no medicine that’s 1,000% safe,” Makary said. “And I think we have to remember that with everything. I think the absolutism around some of this stuff creates mistrust. And when we say they’re 1,000% safe and it’s impossible for there to be a single complication of a vaccine, that’s the kind of rhetoric, I think, that doesn’t resonate well. So I think we have be humble and take a very honest approach.”\n\nStudies find no relationship\n\nOther bullets on the updated CDC page say studies supporting a link between vaccines and autism have been ignored by health authorities. This too is not true: Studies showing a connection between vaccines and autism have proved to be poorly done or were fraudulent. There are, however, many well-done, credible studies that find no such relationship.\n\nOne of the largest studies looking at this question was published in 2019. Researchers in Denmark enrolled more than 650,000 children born between 1999 and 2011 and followed them from the time they were 1 year of age until the end of August 2013. Roughly 6,500 children were diagnosed with autism during the study period.\n\nWhen the researchers compared those who received the MMR vaccine with those who did not, they found no significant difference in the risk of developing autism. That held true whether the kids got other vaccines, such as the diphtheria, tetanus and pertussis vaccine; whether they had siblings with autism; or a host of other factors, such as whether certain kids might be prone to developing a form of regressive autism after getting their shots.\n\n“This study strongly supports that MMR vaccine does not increase the risk for autism,” the authors wrote in the conclusion.\n\nThis study is not cited on the CDC’s updated “state of the evidence” on MMR vaccines, however. Instead, it mentions older evidence reviews and raises questions about aluminum, an ingredient added to some vaccines to boost their protection.\n\nThe new CDC updates do mention another recent Danish study, published in 2025, which found no link between aluminum in childhood vaccines and any of 50 disorders, including neurodevelopmental disorders such as autism. But instead of accepting the overall conclusion of the study, the new CDC page tries to cast doubt on it by homing in on details of data in a supplementary table, saying the findings and other “warrant further investigation” into aluminum exposure and chronic diseases.\n\nThe CDC page also says the US Department of Health and Human Services has launched a comprehensive assessment of the causes of autism, including investigations on plausible biologic mechanisms and potential causal links.\n\nSinger said this is a waste of valuable research money and a distraction from strong science showing that most cases of autism can be traced to genes that affect a baby’s brain development.\n\nThe main heading on the page states that “Vaccines do not cause Autism,” but it has an asterisk that directs readers to a footnote: “The header ‘Vaccines do not cause autism’ has not been removed due to an agreement with the chair of the U.S. Senate Health, Education, Labor, and Pensions Committee that it would remain on the CDC website.”\n\nThe footnote seems to refer to a commitment by HHS Secretary Robert F. Kennedy Jr. to Sen. Bill Cassidy, a physician and Republican from Louisiana, during his confirmation process that language on the CDC website “pointing out that vaccines do not cause autism” would not be removed. Cassidy described the promise in a speech in which he explained his support for Kennedy, a longtime anti-vaccine activist.\n\nCassidy told CNN on Thursday that he had spoken with Kennedy.\n\nIn a statement posted on X on Thursday, Cassidy said, “I’m a doctor who has seen people die from vaccine-preventable diseases. What parents need to hear right now is vaccines for measles, polio, hepatitis B and other childhood diseases are safe and effective and will not cause autism. Any statement to the contrary is wrong, irresponsible, and actively makes Americans sicker.”\n\n‘Dangerous health disinformation’\n\nDr. Peter Hotez, who is director of the Center for Vaccine Development at Texas Children’s Hospital and wrote a book called “Vaccines Did Not Cause Rachel’s Autism” about his daughter’s diagnosis, said the updated information on the CDC’s page follows a well-worn playbook.\n\n“They’ve decided they want to prove vaccines cause autism. So they keep making a series of assertions,” Hotez said, going back to debunked research that claimed the MMR vaccines caused autism and a retracted 2005 Rolling Stone article by Kennedy that asserted the preservative thimerosal caused autism.\n\nThere have also been claims that aluminum in vaccines was a cause of autism, and those have been disproved, Hotez said.\n\nHotez says the updates to the CDC’s page are “pure garbage.”\n\n“I consider it a piece of dangerous health disinformation, and it needs to be removed right away,” he said.\n\nDr. Demetre Daskalakis, who recently resigned as director of the CDC’s National Center on Immunization and Respiratory Diseases, said on social media late Wednesday that the changes are “a national embarrassment.”\n\n“The weaponization of the voice of CDC is getting worse. This is a public health emergency,” he wrote.\n\nDaskalakis said the agency’s scientists were completely blindsided by the page update.\n\n“This distortion of science under the CDC moniker is the reason I resigned with my colleagues,” he told CNN.\n\nRather than restoring trust in America’s health agencies, moves like this have undermined it, said Dr. Sean O’ Leary, a pediatrician who chairs the Committee on Infectious Diseases for the American Academy of Pediatrics.\n\n“I fear that it’s going to lead to fewer children being vaccinated, children suffering from diseases they didn’t need to suffer from,” O’Leary said.\n\nThis is the latest move by the Trump administration to alter longstanding US vaccine policy and practice and cast doubt on vaccinations.\n\nKennedy has hired longtime anti-vax allies – including David Geier, a discredited researcher who was once disciplined by the Maryland State Board of Physicians for practicing medicine without a license, and Lyn Redwood, a nurse who was president of the World Mercury Project, which later became Children’s Health Defense, an anti-vaccine group Kennedy ran before campaigning for office – to undertake new evaluations of government data in an effort to prove conspiracy theories that hazards of vaccines have long been hidden from the public.\n\nThe rate of routine childhood vaccinations has dropped in the United States, allowing preventable diseases including measles and whooping cough to surge. In a call with state health officials Monday, the CDC disease detectives leading the measles response suggested that the US status as a country that has eliminated continuous measles spread was in jeopardy.",
  "authors": [
    "Brenda Goodman"
  ],
  "url": "https://www.cnn.com/2025/11/20/health/cdc-website-autism-vaccines"
}