{
  "title": "El beso en los labios es un rasgo que evolucionó hace 21 millones de años, según nuevo análisis",
  "text": "CNN —\n\nUn nuevo estudio que examina cómo evolucionó el beso sugiere que los ancestros simios y los primeros humanos, como los neandertales, probablemente se besaban en los labios con sus amigos y parejas sexuales. El comportamiento podría remontarse a 21 millones de años.\n\nLos primeros besos de la humanidad se registraron hace 4.500 años en Mesopotamia y el Antiguo Egipto, pero Matilda Brindle, autora principal de la investigación y bióloga evolutiva del Departamento de Biología de Oxford, asegura que el beso presenta un “enigma evolutivo”.\n\nParece conllevar altos riesgos, como la transmisión de enfermedades, sin ofrecer ninguna ventaja reproductiva o de supervivencia obvia, dijo.\n\n“Besar es una de esas cosas que realmente nos interesaba entender”, dijo a CNN Brindle, quien estudia el comportamiento sexual en primates. “Es omnipresente en los animales, lo que da una pista de que podría ser un rasgo evolucionado”.\n\nEl beso, que el equipo definió como un contacto boca a boca no agresivo que no implica comida, no es algo que pueda detectarse en el registro fósil, por lo que Brindle y sus colegas utilizaron un enfoque diferente.\n\nA partir de la literatura científica existente, los investigadores recopilaron información sobre qué especies de primates modernos han sido observadas besándose; estas incluían chimpancés, bonobos, orangutanes y una especie de gorila.\n\nLuego, el equipo realizó un análisis filogenético, que permite a los científicos inferir información sobre rasgos en especies extintas con base en datos de comportamiento de animales vivos. Implica reconstruir un árbol o mapa de cómo se relacionan las diferentes especies de primates basándose en información genética, explicó Brindle.\n\n“Con esa información, podemos viajar en el tiempo”, comentó.\n\nBesos prehistóricos\n\nEl equipo empleó modelos estadísticos para simular diferentes escenarios evolutivos a lo largo de las ramas del árbol y estimar la probabilidad de que diferentes ancestros simios se besaran. Por ejemplo, dijo que los chimpancés, los bonobos y los humanos se besan, por lo que es probable que el último ancestro compartido de todas esas especies también lo hiciera. Para obtener estimaciones sólidas, el modelo se ejecutó 10 millones de veces.\n\nLos resultados, publicados el miércoles en la revista Evolution and Human Behavior, sugieren que el beso es un rasgo antiguo en los grandes simios, evolucionando en un ancestro de ese grupo entre 21,5 millones y 16,9 millones de años atrás.\n\nEsto significa que los parientes humanos extintos, como los neandertales, también probablemente se besaban. También es posible —dado que los científicos saben que nuestra especie, Homo sapiens, se cruzó con los neandertales— que humanos y neandertales se besaran entre sí, señaló el estudio.\n\nSin embargo, el modelo no revela por qué o cómo evolucionó el beso, dijo Brindle, señalando que tiene múltiples usos, incluyendo la evaluación de posibles parejas, el juego previo, el establecimiento de vínculos, la mitigación de la tensión social y la masticación de alimentos antes de dárselos a la descendencia.\n\nAñadió que hay datos limitados sobre el beso en animales fuera de las especies de simios, lo que dificulta reconstruir cómo pudo haberse desarrollado el rasgo a lo largo del tiempo. Además, gran parte de la información provino de animales que viven en cautiverio o santuarios. Se necesitan datos adicionales sobre el beso en diferentes especies, indicó.\n\n“Lo que hemos hecho, que es un primer paso realmente importante, es mostrar que es un rasgo evolucionado”, afirmó Brindle. “Es realmente antiguo. ¿Pero por qué? Y ese es el increíble siguiente paso si la gente quiere tomar el relevo”.\n\nEl beso no es un comportamiento universal en la sociedad humana, señalaron los investigadores en el nuevo estudio. Solo está documentado en el 46 % de las culturas, según un artículo de 2015.\n\n“Encontramos una fuerte señal evolutiva en el beso, pero eso no significa que deba conservarse”, explicó Brindle. Para algunas poblaciones, añadió, el beso podría no ser adecuado: “Los primates son especies extremadamente flexibles, muy inteligentes, por lo que el beso podría ser útil en algunos contextos, pero no en otros. Y si no es útil, es bastante arriesgado con un alto potencial de transmisión de enfermedades”.\n\nBesar es más que un simple contacto “boca a boca”, y el estudio no arroja mucha luz sobre por qué los humanos se besan de la manera en que lo hacen, dijo Adriano Reis e Lameira, psicólogo evolutivo y primatólogo de la Universidad de Warwick, quien no participó en el trabajo.\n\n“La gran mayoría de los besos que dan los humanos no son boca a boca”, dijo por correo electrónico.",
  "authors": [
    "Katie Hunt"
  ],
  "url": "https://cnnespanol.cnn.com/2025/11/19/ciencia/evolucion-beso-estudio-trax"
}