{
  "title": "This is modern Britain – where a princess pleading for children’s rights seems almost radical | Gaby Hinsliff",
  "text": "Every child has the right to feel safe, loved and as if they belong.\n\nPut like that, there is nothing remotely radical about what the Princess of Wales used her first public speech since recovering from cancer to say: that families need consistently nurturing environments to flourish; that the world could actually use a bit more tenderness; that we are all responsible for the culture in which future generations grow up; and that (as she told an audience of blue-chip employers) caring for others is work deserving of respect. It’s the reasons why those motherhood-and-apple-pie values don’t always prevail in real life, rather than the values themselves, that are generally too contentious for the carefully apolitical royals. Yet what were once safe, bland nothings are increasingly no longer so – and not just because of the awkward shadow now cast over any royal initiative involving childhood by the former prince Andrew’s infamous association with the sex trafficker Jeffrey Epstein.\n\nThere was something strangely jarring about listening to a princess talk earnestly about the need of children to be surrounded by “love, safety and rhythm” in the same week that Lord Alf Dubs, himself a former child refugee, was denouncing a Labour home secretary’s proposal to remove financial support from families with children whose asylum claims have failed, and ultimately to round up and deport them. (Shabana Mahmood had argued that successive governments’ longstanding nervousness about subjecting families to the same rules as lone asylum seekers risked creating a “perverse incentive” to bring small children across the Channel.)\n\nThe contrast won’t have been remotely intended, of course – Catherine is careful to avoid political controversy – yet it is uncomfortable to watch the wife of a hereditary monarch-to-be appealing to a nation’s best instincts while a democratically elected government feels compelled to chase our worst. Unlike Mahmood, princesses don’t have to worry about re-election. But something is wrong with a country where politicians seem frightened of talking about compassion or human connection for fear of being howled down; where only queens in waiting have the luxury of sounding as if they actually have a heart.\n\nHow does an institution whose function is to bring a country together function in one that seems increasingly hellbent on tearing itself apart? The Waleses employ more than enough old Westminster hands, including expert policy advisers from the David Cameron, Tony Blair and Boris Johnson eras, to help them stay the right side of the old party lines. They’ve already learned the art of engaging with genuine public disquiet without pushing for specific policy changes – as the princess did recently by highlighting the way smartphones are changing family life, and as Prince William’s pilot project on showing that it’s possible to end homelessness is designed to do – even when what they’re talking about are problems you might reasonably expect governments to tackle.\n\n“You skirt around edges and see where you can help,” as the then Prince Charles once said of his own approach, whether that meant lobbying a visibly irritated Blair government against genetically modified crops or running the Prince’s Trust with its then unfashionable focus on youth unemployment all through the Thatcher years. (Memorably, Norman Tebbit once sniped that maybe the prince felt such empathy with the jobless because he didn’t have a proper job either.) The challenge for the king and his increasingly involved heir apparent now, however, is that the royals’ concept of socially useful but generally unobjectionable work was drawn up in a world where some ideas – that the climate crisis is a threat from which the planet urgently needs saving, say, or that racism has no place in modern society – were a matter of boringly settled consensus. And that world seems to be slipping away.\n\nIf Reform UK wins the next election, Charles may well end up reading out a king’s speech containing pledges to scrap net zero that we would all know contravened everything he has ever stood for, and immigration policies harsher than the Rwanda scheme he was reportedly overheard describing behind closed doors as “appalling”. While British royals are well used to granting assent through privately gritted teeth to legislation they don’t actually like, what the current generation faces may be a more profound clash of values. Even the otherwise inscrutable late queen couldn’t quite restrain herself from sticking a public oar in when she felt the integrity of the nation was at stake, during the 2014 referendum on Scottish independence.\n\nThe new head of both church and state could easily find himself caught in the crossfire between senior clergy who are increasingly vocal in their criticism of Reform’s approach to immigration – “isolationist, short term and kneejerk”, as the archbishop of York put it this summer – and a government with a popular mandate for it; or between his commitment to defending all faiths, Islam very much included, and a prime minister in Nigel Farage who apparently believes that a growing number of young Muslims don’t share British values. And in the event of a constitutional crisis – whether precipitated by a general election result delivering a hung parliament with no majority for any one party, or by something an iconoclastic Reform government tried to do in office – the royals could very quickly find themselves in the public hot seat. If the palace isn’t working through what it would mean to reign but not to rule in such a charged situation, then it should be. Or we may all be in for quite some annus horribilis.\n\nskip past newsletter promotion Sign up to Matters of Opinion Free weekly newsletter Guardian columnists and writers on what they’ve been debating, thinking about, reading, and more Enter your email address Sign up Privacy Notice: Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on theguardian.com to send you this newsletter. You can complete full registration at any time. For more information about how we use your data see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion",
  "authors": [],
  "url": "https://www.theguardian.com/commentisfree/2025/nov/21/modern-britain-childrens-rights-royals-government"
}