{
  "title": "Not OK? Booker winner Flesh ignites debate about state of masculinity",
  "text": "In the immediate aftermath of David Szalay’s book Flesh winning the Booker prize, one feature of the novel stood out: how often the protagonist utters the word “OK”.\n\nThe 500 times István grunts out the response is part of a sparse prose style through which the British-Hungarian Szalay gives the reader few insights into the inner workings of a man whose fortunes rise and fall.\n\nBut however inarticulate István is, the fact a story about a working-class man from eastern Europe won one of the biggest literary prizes in the world has started a debate about masculinity in literature in 2025.\n\nGQ implored readers not to reduce the book to “discourse fodder”. But in a year when the idea of literary masculinity – and its apparent scarcity – has featured so prominently, the ascent of Flesh – a story about a taciturn, lustful and at times violent man – was always going to drive debate.\n\nSzalay has spoken about the “risky” nature of the novel, not only because of its style but because István as a protagonist exhibits toxic male behaviour. “There’s no longer that sense that boys will be boys,” Szalay said after his win. “So I expect the main character in Flesh to draw quite a bit of disapproval.”\n\nIstván goes to a young offender facility because of an act of violence, then joins the army. He works security on the door of a strip club, before becoming a driver and security guard. “These aren’t exclusively male paths,” says the Booker judge and novelist Chris Power. “But they are predominantly male or traditionally male.”\n\nThis year, some have questioned whether male novelists and male themes are terminally out of fashion. In April, a new imprint, Conduit Books, was founded with the aim of publishing literary fiction and memoirs by men amid “a perception that the male voice is problematic”, according to its founder, Jude Cook.\n\nCook said the publishing landscape had changed as a reaction to the “prevailing toxic male-dominated literary scene of the 80s, 90s and 00s”.\n\nThe Booker longlist, which featured six men and seven women, and Szalay’s success offered a firm riposte to that argument. But Flesh’s victory did not just buck an apparent trend in literature, it also seemed to be plugged directly into a live debate about what it means to be a man in 2025.\n\nMuch of the coverage following the win has placed the novel in a wider context of the “crisis of masculinity”, characterised by the rise of influencers such as Andrew Tate and the debate opened up by Netflix’s incel drama Adolescence.\n\n“The idea of a crisis of masculinity in the wider culture with say, suicide rates or younger kids turning to the Andrew Tates of the world, it’s almost colliding with literature,” says Power.\n\nThe critic and author Leo Robson says: “Maybe it’s easier in an age where there’s been quite a healthy debate about masculinity and male behaviour to champion someone like David Szalay writing about men in like a sceptical inquiring spirit.”\n\nA look across the other Booker-shortlisted books by men does reveal some loose connections. Power says the other novels on the list by male writers were loosely tied together by the themes of “infidelity” and men being “led by lust”, which both loom over Flesh.\n\nBen Markovits’ The Rest of Our Lives deals with a mid-life crisis, Benjamin Wood’s Seascraper follows the “prosaic details of everyday life” for a shrimp fisherman, while Andrew Miller’s The Land in Winter opens with a young man’s suicide.\n\nBut Power sees István as primarily a person struggling to come to terms with status anxiety and the financial precarity that many younger people are facing.\n\n“I think István is struggling to gain control of his life,” he says. “That speaks to a kind of universal feeling, something that’s obviously very keenly felt by many.”",
  "authors": [
    "Lanre Bakare"
  ],
  "url": "https://www.theguardian.com/books/2025/nov/17/david-szalay-booker-prize-novel-crisis-masculinity-debate"
}