{
  "title": "Guinness Record for World’s Largest Afro Broken by Jessica Martinez",
  "text": "What was that journey like?\n\nMy hair has always been a conversation piece. It’s like an icebreaker for people. They’ll compliment my hair or ask me a question. It’s very important to me to wear my natural hair in the workplace and also to encourage other people to do it.\n\nWhen people ask you about your hair, can it feel like a microaggression?\n\nI can tell the difference between microaggressions and just curiosity. In the past, I’ve gotten remarks like, “Ugh, just looking at all that hair is making me feel anxious,” which is obviously about them, not about me, right? I’ve had professors who thought they were helping me by giving me advice around how I should present my hair going into the workplace. I’ve worked at places where my hair became a conversational piece in a way that didn’t feel comfortable, and I ended up leaving.\n\nPeople always want to touch my hair. I think I get it a little bit more than other people do because I feel so comfortable wearing my hair just as it is.\n\nBut I always come from a space of compassion. I have a lot of experience navigating these situations, so I go into them very calmly. And I’m very thankful for the Crown Act. I do feel a level of comfort knowing there is some form of legislation in place to protect me from hair harassment and discrimination.\n\nSo what made you want to go after this record?\n\nIt wasn’t on my radar until I posted a video of my Afro on Instagram in 2023, and people started commenting, “You should go after the world’s largest Afro.” That’s when the seed was planted. I didn’t do anything with that idea for about a year or so, and then I thought, “You know what? Let me try to challenge myself.” So first you have to submit evidence to Guinness that you are even capable of potentially breaking the record. Then there’s a three-month waiting period when they review your application. Once that was approved, I had exactly one year to make my attempt.\n\nWhat message are you hoping to send?\n\nThat people will ultimately come to a space and place where they also feel that their hair is not a burden. I believe the bigger, the better.",
  "authors": [
    "Alisha Haridasani Gupta"
  ],
  "url": "https://www.nytimes.com/2025/11/19/style/largest-afro-guinness-world-record.html"
}