{
  "title": "La inspiradora historia de vida de Juan Pablo Dos Santos, el venezolano doble amputado que corrió la maratón de Nueva York",
  "text": "CNN Español —\n\nLa carrera de larga distancia más grande y emblemática del mundo, el maratón de Nueva York, volvió a romper récords de participación por segundo año consecutivo en su edición de 2025. Fueron 59.226 los corredores que finalizaron la carrera. Entre ellos destacan, como es lógico, nombres propios del atletismo de fondo, como los keniatas Benson Kipruto y Hellen Obiri, ganadores en las categorías masculina y femenina, respectivamente.\n\nLejos de los primeros reflectores, el último corredor en cruzar la línea de meta no rompió ningún récord. Sin embargo, regaló una enseñanza de vida.\n\nEl venezolano Juan Pablo Dos Santos completó la prueba de 42,195 kilómetros en 15 horas y 21 minutos a paso firme, pero usando prótesis en ambas piernas, dejando claro que, como él mismo dice, “no se trata de llegar primero, sino de no rendirse”. Su hazaña dio la vuelta al mundo por su conmovedora historia de superación y ejemplo de resiliencia.\n\n“El tema de llegar último me daba muchísimo orgullo, porque habla de lo que es en verdad persistir, insistir y nunca desistir”, contó Dos Santos en su reciente visita a CNN en Miami.\n\nNo fue una carrera fácil para el atleta de 26 años, que vio como en los últimos kilómetros su cuerpo estaba completamente agotado y adolorido y, por ende, avanzaba muy poco y lentamente. No obstante, nunca pensó tirar la toalla.\n\nEn ningún momento pensé en rendirme” Juan Pablo Dos Santos, atleta venezolano\n\n“Pero sí me pregunté muchísimas veces en mi cabeza si en verdad iba a llegar a la meta, si era posible, si iba a resistir tantas horas. Y creo que lo único que podía hacer era aferrarme al propósito, a entender por qué y para qué hago esto”, recuerda Dos Santos.\n\nLa travesía del venezolano con raíces portuguesas nacido en Caracas hacia la meta en Central Park comenzó mucho antes del 2 de noviembre.\n\nSeis años antes, el 8 de septiembre de 2019, Dos Santos, que jugaba al fútbol, perdió ambas piernas en un accidente automovilístico en la capital venezolana. Estuvo 40 días hospitalizado y recibió 16 intervenciones quirúrgicas para reconstruir su cadera, fémur, pelvis y lo que quedaba de sus extremidades inferiores. Luego apareció un ángel anónimo que ayudó a su familia a costear los gastos económicos y lo envió a Belo Horizonte para realizar un tratamiento protésico y, nuevamente, aprender a caminar.\n\n“Había (en Brasil) un equipo de fisioterapeutas abocados a que yo cumpliera ese sueño… algo que antes había dado por sentado y jamás había agradecido, pero que ahora era lo único que soñaba”, revela emocionado el atleta venezolano, quien no ha dejado que su actual condición física, la discapacidad, le impida conseguir sus metas.\n\nLa palabra discapacidad es entender que ninguno de nosotros tiene todas las capacidades” Juan Pablo Dos Santos, atleta venezolano\n\n“Cuando nosotros entendemos cuáles son las que tenemos y cuáles son las que queremos trabajar, y nos enfocamos en eso y no en aquello que nos falta, empezamos a descubrir nuestro verdadero camino y potencial”.\n\nContra todo pronóstico\n\nAlgunos especialistas llegaron a decirle que nunca volvería a caminar, pero él decidió desafiar ese pronóstico. Lejos de quedarse en la adversidad, este dramático cambio de vida motivó a Dos Santos a crear una fundación para apoyar a otras personas amputadas y a convertirse en orador motivacional. Esto también lo llevó a crear contenido en redes sociales para inspirar y enseñar a su más de 1,5 millones de seguidores en Instagram que los límites están en nuestra mente.\n\nSiendo un hombre de retos, decidió incluso hacer lo que pocos doble amputados han conseguido: participar y llegar a la meta en el maratón de Nueva York, resultando un desafío deportivo ideal para amplificar su mensaje. Contó que de cara a la competición tuvo una rigurosa y, al mismo tiempo, difícil rutina de entrenamiento por no tener una ruta clara, haciendo ajustes según reaccionaba su cuerpo.\n\n“Unos meses antes del maratón tuvimos que dejar de acumular tantos kilómetros por semana por el daño que recibía mi piel (en el área de los muñones por el uso de las prótesis) y el cansancio que tenía mi cuerpo. Y para no generar tanto impacto en las articulaciones pasamos a entrenar en la piscina,” cuenta Dos Santos sobre el entrenamiento, con el que apuntó a generar resistencia sin tanto impacto para la prueba en la gran manzana.\n\nUna “película en reversa”\n\nLa marca de Dos Santos de más de 15 horas corriendo hasta cruzar la meta lo dejó lejos de Kipruto y Obiri y también del tiempo promedio de principiantes, que es entre cuatro y cinco horas y media. Sin embargo, su historia será recordada por lo que significa para muchos: un faro de esperanza a través de un logro que ha conmovido a Venezuela y al mundo. Su final tardío, pasada la medianoche, la dificultad que mostró dando los últimos pasos para llegar a la meta con la bandera de su país apretada en la mano, los vítores de los que lo acompañaron y luego le cantaron el himno nacional venezolano cuando finalmente rompió la cinta roja con su cuerpo, lo convirtieron en uno de los momentos más emotivos de la edición 2025 de la carrera.\n\nJuan Pablo Dos Santos conversó con CNN tras su histórica maratón de Nueva York. CNN\n\n“Lograr cruzar la meta fue increíble, porque fue como si ahí, en ese instante, desaparecieran todos los dolores, todo el cansancio. Y en ese momento fue como si empezara la película a correr en reversa, recordándome cada día de entrenamiento, cada persona de mi equipo que estuvo ahí apoyándome para que este sueño se hiciera realidad”, dice un emocionado Dos Santos.\n\nEntre esas personas que se unieron en los kilómetros finales estuvo su madre, que según cuenta el caraqueño, superó un año complicado a nivel de salud: “Para mí era una ilusión. Era un sueño que se hizo realidad tenerla allí”.\n\nAhora, el deportista venezolano tiene planeado seguir celebrando su victoria a la vida plasmada en la gesta en Nueva York, mientras decide qué reto se impondrá para el año que viene. Lo que sí está claro tras su hazaña es que, mientras algunos corren por marcas o medallas, él lo hizo por algo más profundo: agradecer que está vivo, que la vida continúa aún sin piernas, y que logra lo que se propone, aunque sea casi imposible. Luego de 42,2 kilómetros, probó que la verdadera victoria no está en el cronómetro, sino en no abandonar jamás.",
  "authors": [
    "Elizabeth Pérez"
  ],
  "url": "https://cnnespanol.cnn.com/2025/11/20/deportes/maraton-nueva-york-juan-pablo-dos-santos-orix"
}