{
  "title": "Windows fa 40 anni, storia, curiosità e cosa offriva la versione 1.0",
  "text": "Windows celebra i suoi primi 40 anni di vita. Proprio il 20 novembre del 1985 debuttava infatti la primissima versione pubblica del sistema operativo di Microsoft, Windows 1.0, destinato a raccogliere un grande successo in tutto il mondo. Era il primo tentativo del colosso statunitense di offrire al pubblico un'interfaccia di tipo grafico più intuitiva e semplice da utilizzare rispetto a Ms-Dos, così da poter svolgere più attività in modo versatile e aprirsi a aggiornamenti nel tempo.\n\nIl debutto di Windows 1.0\n\nIn realtà, la prima versione diffusa al pubblico del primo sistema operativo della storia di Microsoft era Windows 1.01 e venne ufficializzata proprio il 20 novembre 1985. Qualche mese prima, in estate, Microsoft aveva invece iniziato a condividere tra gli sviluppatori una versione preliminare che ora chiameremmo beta, che era nota internamente come Premiere Edition e che venne utilizzata per test e prove prima del rilascio commerciale. I requisiti di sistema per Windows 1.0 riguardavano la versione 2.0 di Ms-Dos, almeno 256 KB di ram, un dischetto a doppia faccia o un hard disk. Includeva già i driver per poter far comunicare con il sistema operativo le varie periferiche come schede video, mouse, tastiere (prima solo per inglese americano quindi anche per lingue europee in un secondo momento), stampanti e via dicendo. Si potevano aprire più finestre simultaneamente, ma non si potevano sovrapporre.\n\nCosa poteva fare Windows 1.0\n\nPur essendo la primissima versione del sistema operativo Microsoft, Windows 1.0 includeva una serie di programmi e utilità per produttività e per la vita quotidiana. Per esempio, si trovavano a bordo software presenti ancora oggi, seppur migliorati e più evoluti, come Paint per disegnare, Calcolatrice per appunto effettuare calcoli, Calendario per tenere sotto controllo la data e il Blocco Note per prendere appunti in modo più pratico e in modo grafico. C'era anche il Pannello di controllo, per poter regolare le varie impostazioni in modo più intuitivo. Inoltre, c'era anche un primissimo easter egg, seppur trovato in grande ritardo.",
  "authors": [
    "Diego Barbera"
  ],
  "url": "https://www.wired.it/article/windows-40-anni-la-storia-del-sistema-operativo/"
}