{
  "title": "Trump accuses Democratic lawmakers who urged military to disobey illegal orders of ‘seditious behavior, punishable by death’",
  "text": "President Donald Trump on Thursday suggested that Democratic lawmakers who urged service members and intelligence officials to disobey illegal orders should be put to death, sparking an outcry among Democrats on Capitol Hill that the president was seeking to incite violence.\n\n“SEDITIOUS BEHAVIOR, punishable by DEATH!” Trump wrote on his Truth Social platform, responding to a video from half a dozen members of Congress who previously served in the military and intelligence community urging people currently in those roles to “refuse illegal orders.”\n\n“It’s called SEDITIOUS BEHAVIOR AT THE HIGHEST LEVEL. Each one of these traitors to our Country should be ARRESTED AND PUT ON TRIAL,” Trump wrote. He also reposted several other users’ posts, including one that read: “HANG THEM GEORGE WASHINGTON WOULD !!”\n\nThe comments drew a swift rebuke from Democrats, who condemned Trump’s comments as an attempt to incite violence, and even drew the scrutiny of members in his own party.\n\nGOP Sen. Lindsey Graham, a staunch Trump ally who served as a lawyer for the military reserves, said the president’s remarks were “over the top,” though he also said he considered the Democrats’ video “despicable.” And GOP Sen. Rand Paul of Kentucky said he didn’t think it was “really a good idea to talk about jailing your political opponents, or hanging them, or whatever else.”\n\nWhite House press secretary Karoline Leavitt later denied that Trump was calling for lawmakers to be executed, arguing that the members of Congress with national security backgrounds should not be encouraging anyone to defy orders from the administration.\n\n“These members knew what they were doing. They were leaning into their credentials, as former members of our military, as veterans, as former members of the national security apparatus, to signal to people serving under this commander in chief, Donald Trump, that you can defy him and you can betray your oath of office,” Leavitt said. “That is a very, very dangerous message. And it perhaps is punishable by law.”\n\nIn a joint statement, the six Democratic lawmakers in the video – Sens. Elissa Slotkin and Mark Kelly and Reps. Jason Crow, Maggie Goodlander, Chris Deluzio and Chrissy Houlahan – vowed they “will not be intimidated.”\n\n“What’s most telling is that the President considers it punishable by death for us to restate the law. Our service members should know that we have their backs as they fulfill their oath to the Constitution and obligation to follow only lawful orders. It is not only the right thing to do, but also our duty,” the lawmakers said in part.\n\n“But this isn’t about any one of us. This isn’t about politics. This is about who we are as Americans. Every American must unite and condemn the President’s calls for our murder and political violence. This is a time for moral clarity.”\n\nSlotkin was accompanied by USCP officers to an event in Washington, DC, on Thursday. Her team requested the additional presence from USCP for the event that took place off Capitol Hill, a source familiar with the matter said.\n\n“I think when a lion’s share of Americans understand that it is in their own power to push back on this kind of rhetoric and this kind of threat, that’s when we actually turn the tide,” she said at the event.\n\nDeluzio called for both parties to unite against what he called Trump’s “outrageous call for political violence.” “It’s a moment where Democrats and Republicans and everyone else in the country should condemn his calls for political violence,” he said on CNN.\n\nCrow, meanwhile, warned on CNN that Trump’s comments should be taken seriously. “We have to take everything that Donald Trump says seriously. He throws a lot of stuff out there, but some of the things he carries through on,” he said.\n\nSenate Minority Leader Chuck Schumer called the comments “an outright threat” and that Trump was “calling for the execution of elected officials.” He added from the Senate floor: “This is an outright threat, and it’s deadly serious.”\n\nHouse Minority Leader Hakeem Jeffries and his leadership team said they had been in touch with law enforcement authorities to make sure lawmakers were protected.\n\n“We have been in contact with the House Sergeant at Arms and the United States Capitol Police to ensure the safety of these Members and their families. Donald Trump must immediately delete these unhinged social media posts and recant his violent rhetoric before he gets someone killed,” they said.\n\nAsked about the president’s comments, Senate Majority Leader John Thune said he didn’t agree with them but dismissed the video that sparked his reaction as “unnecessary.”\n\n“I don’t agree with that. Obviously, everyone has their First Amendment rights. But what they did was ill-advised and provocative and unnecessary,” he said.\n\nHouse Speaker Mike Johnson, a Republican from Louisiana, similarly called the video “wildly inappropriate,” as he defended Trump. Though he later conceded he wouldn’t have used the same language.\n\n“We’re going to allow others to make legal judgments about how that…the words that the President chose are not the ones that I would use, OK,” Johnson said Thursday evening.\n\n“Obviously, I don’t think that this is…these are crimes punishable by death or any of that,” he added.\n\nThe lawmakers who posted the video that sparked Trump’s reaction did not specify which orders service members received, or might receive, that could be illegal. “No one has to carry out orders that violate the law, or our Constitution,” they said in the video, adding, “Know that we have your back. … Don’t give up the ship.”\n\nDeputy Attorney General Todd Blanche said Wednesday that the Justice Department will be taking a “very close look” at those lawmakers’ actions, calling it a “disgusting and inappropriate display of supposed leadership from the Democrat Party.”\n\nThis story has been updated with additional details.",
  "authors": [
    "Samantha Waldenberg",
    "Arlette Saenz",
    "Kit Maher"
  ],
  "url": "https://www.cnn.com/2025/11/20/politics/trump-democrats-seditious-behavior"
}