{
  "title": "Tears and solemnity at Cheney funeral – but no memorial for those killed in Iraq",
  "text": "You suspected that Maga had not conquered the Washington national cathedral when Bill Kristol was spotted at a men’s urinal conversing with Chris Wallace. You knew it for sure when James Carville, Anthony Fauci and Rachel Maddow were seen sitting close to one another in the nave.\n\nThe funeral of the 46th US vice-president, Dick Cheney, who died earlier this month aged 84, was a throwback to a less raucous and rancorous time. Ex-presidents and vice-presidents, Democratic and Republican, made small talk, but Donald Trump, who spent Thursday crying treason and calling for Democrats to be put to death, and his deputy JD Vance were not invited.\n\nMore than a thousand guests saw eight military body bearers place Cheney’s flag-draped casket on a catafalque as gently as lowering a baby in a crib. Then two hours of plangent music, solemn processions and tearful eulogies beneath stained glass and a soaring vaulted ceiling amounted to a requiem for the Republican party.\n\nCheney used to be known as its Darth Vader and, fittingly, the neo-Gothic church’s exterior boasts a hand-carved grotesque of the Star Wars character. Vader terrorised the galaxy but saved his son and renounced the dark side of the Force on his deathbed. Cheney had imperial ambitions of his own but gained a measure of redemption by defending his daughter and democracy from Trump.\n\nThere is some irony because, just as Joe Biden, who attended the funeral, paved the way for Trump’s return through his own stubborn egotism, so Cheney opened a Pandora’s box and unleashed the furies by helping expand the vast presidential powers that Trump enjoys today.\n\nAs probably the most consequential vice-president in history, Cheney’s prosecution of the war on terror – he championed sweeping surveillance powers under the Patriot Act and defended controversial “enhanced interrogation” techniques – handed Trump a playbook to crack down on civil liberties at home and abroad.\n\nAnd the vice-president’s baseless advocacy for the 2003 invasion of Iraq – stating “there is no doubt that Saddam Hussein now has weapons of mass destruction” – was arguably the breaking point in public trust of the political class that fuelled Trump’s rise as an outsider pledging to drain the swamp.\n\nThere were no cathedral services with pipe organs playing for the hundreds of thousands of people killed in the Iraq war and its aftermath. So Thursday’s honouring of Cheney – a gathering of the Washington elite, overwhelmingly white – was also an exercise in omission, a holy lesson in what a nation sees when it looks in the mirror and the things that cannot be said.\n\nA martian landing in the cathedral with no prior knowledge would have heard of a patriotic public servant described by his longtime cardiologist Jonathan Reiner as “a still point in the turning wheel”, and of a fisherman, horseman and man of the American west who loved John Wayne films, described by one of his devoted grandchildren as “vice-president turned rodeo grandpa”.\n\nFormer NBC News correspondent Pete Williams, who was Cheney’s spokesman at the Pentagon, recalled “a good and decent man” and told the story of a letter sent to Cheney from a woman in Indianapolis who found his qualities to be attractive: “I showed this letter to Secretary Cheney and he took it home to brag about it.”\n\nFormer president George W Bush, his tie blue, his hairline receding, eulogised Cheney as “solid and rare and reliable”, praising a man whose “talent and his restraint” exceeded his ego and was “smart and polished, without airs”.\n\nIt fell to Bush to make only the most tangential reference to Cheney’s involvement in one of America’s darkest chapters. “This was a vice-president totally devoted to protecting the United States and its interests. There was never any agenda or angle beyond that. You did not know Dick Cheney unless you understood his greatest concerns and ambitions were for his country.”\n\nTranslation: Cheney was not driven by ideology like the neocons Donald Rumsfeld and Paul Wolfowitz but merely wanted to protect the homeland.\n\nLiz Cheney – ousted from the congressional Republican party over her opposition to Trump – gave a similarly subtle nod to how, later in life, Cheney emerged as a critic of his own party’s populist drift (he called Trump a “threat to our republic” and even endorsed Kamala Harris in last year’s presidential election).\n\nNoting that John F Kennedy, a Democrat, inspired her father to enter public service, she said: “He knew that bonds of party must always yield to the single bond we share as Americans. For him, a choice between defence of the constitution and defence of your political party was no choice at all.”\n\nDefending democracy at home while destroying democratic aspirations overseas was the paradox of Cheney and, indeed, of US power stretching back decades. Jeremy Varon, author of Our Grief Is Not a Cry for War: The Movement to Stop the War on Terror, speculates the double standard is based on the logic of us versus them.\n\nHe said in a recent interview: “As an American, he can be covetous of the preservation of American democracy and feel that ensuring that America’s security is the best way to ensure the survival of the American democratic project. But in the name of national security, America will brutalise and run roughshod over the basic democratic right of self-determination of foreign peoples.”\n\nAfter sharing memories of being dragged to civil war battlefields by her father as a child, Liz Cheney rounded off her eulogy by paraphrasing Shakespeare: “Goodnight sweet dad, may flights of angels sing thee to thy rest.” An alternative might have been: “I come to bury Cheney, not to praise him. The evil that men do lives after them; The good is oft interrèd with their bones. So let it be with Cheney.”",
  "authors": [
    "David Smith"
  ],
  "url": "https://www.theguardian.com/us-news/2025/nov/20/dick-cheney-funeral-washington"
}