{
  "title": "This Coming-Of-Age Drama About A Nonbinary Teen Could Be A Quiet Game Changer",
  "text": "LOADING ERROR LOADING\n\nEight years after “13 Reasons Why” put her on the Hollywood map, Tommy Dorfman has shifted her focus behind the camera with a film that offers “a fantasy version of what community should look like” when a young queer person is grappling with their sexuality or gender identity.\n\nDorfman is making her feature directorial and screenwriting debut with “I Wish You All the Best,” released last week. The coming-of-age drama is based on Mason Deaver’s 2019 novel and follows Ben (played by “Girl Meets World” actor Corey Fogelmanis), a nonbinary teen who is forced to move in with their long-estranged sister, Hannah (Alexandra Daddario), after being kicked out by their conservative parents at Christmas.\n\nAdvertisement\n\nFamily turmoil aside, a fresh start turns out to be just what Ben needed. With the support of their eccentric art teacher, Ms. Lyons (Lena Dunham), and a gaggle of new friends, they begin to excel in school. They also find themselves smitten with a close pal turned prospective love interest, Nathan (Miles Gutierrez-Riley).\n\nMiles Gutierrez-Riley, left, as Nathan and Corey Fogelmanis as Ben in \"I Wish You All the Best,\" which opened in theaters Nov. 7. Lionsgate\n\nDorfman first encountered Deaver’s book around the time of its publication, after which she was filled with a “spiritual, inexplicable desire to create this world in a visual medium,” she said.\n\nAdvertisement\n\n“As queer people, we often have to contort ourselves emotionally and physically to relate to characters in media and books,” she told HuffPost. “I didn’t have to have that lens on.”\n\nIt’s easy to see why Dorfman could relate to Ben’s on-screen journey in “I Wish You All the Best.” The 33-year-old initially feared she’d be cutting her acting career short when she publicly reintroduced herself as a transgender woman in 2021.\n\nAnd just as Ben makes strides after embracing their true self, Dorfman has enjoyed a professional resurgence as of late.\n\nAdvertisement\n\nLena Dunham, right, portrays Ben's eccentric art teacher, Ms. Lyons. Lionsgate\n\nDorfman began writing the “I Wish You All the Best” script as she was starting her transition and has come to see the film as “wish-fulfillment prophecy.”\n\nAdvertisement\n\n“I got to write Ben finding comfort in their own body before I got to mine,” she said. “I knew that if it was possible for them at 17 ... it could be possible for me at 29.”\n\nWhen it came to casting the role of Ben, Dorfman sought an actor who could “challenge my understanding of something, and deepen it.” She instantly knew she’d found her star in Fogelmanis, who showcased “a contained vulnerability,” particularly in the film’s final third, when Ben has a second confrontation with their parents.\n\nAs for Dunham, she and Dorfman have been close friends for years. The “Girls” creator and star gave Dorfman her first on-screen role after her transition in the 2022 film “Sharp Stick,” and the two have continued to collaborate behind the scenes.\n\nAdvertisement\n\n\"I got to write Ben finding comfort in their own body before I got to mine,\" says writer-director Tommy Dorfman (center, with Fogelmanis and Dunham). Courtesy of Tommy Dorfman\n\n“She’s the hardest working person I know and a creative powerhouse,” Dorfman said. “Even though we know all of the intimate details about each other anyone could possibly know, I wanted my teacher to be proud of me. She made it easy.”\n\nWith “I Wish You All the Best” now in theaters, Dorfman has started work on her follow-up project, a big-screen adaptation of Mariko Tamaki’s 2019 graphic novel, “Laura Dean Keeps Breaking Up With Me.”\n\nAdvertisement\n\nThough “I Wish You All the Best” will certainly resonate with LGBTQ+ viewers, Dorfman also hopes the film will serve as an example to those “who don’t understand their child, their sibling or their co-worker” in a climate that has grown increasingly hostile toward trans and gender nonconforming people.\n\n“When a child gets rejected for being the person they are, there should be a mass of mutual aid coming together to buoy that kid,” she said. “It’s that simple.”\n\nCatch the trailer for “I Wish You All the Best” below.",
  "authors": [
    "Senior Culture Reporter"
  ],
  "url": "https://www.huffpost.com/entry/i-wish-you-all-the-best-tommy-dorfman-movie_n_690e6413e4b0dd4ea75b990b"
}