{
  "title": "Lewis Hamilton defends work ethic after Ferrari chief’s ‘talk less’ rebuke",
  "text": "Lewis Hamilton has insisted he does not believe he can work any harder to help improve Ferrari’s performance.\n\nThe 40-year-old driver was reacting to a rebuke from the Ferrari president John Elkann, who had stated he should: “Focus on driving and talk less.” Hamilton however maintained pointedly that the issues at Ferrari would not be fixed with “the click of a finger”.\n\nHamilton, who has yet to claim a podium for Ferrari in what has been an immensely trying first season with the team, was outspoken after another disappointing race at the last round in Brazil, after which he described his debut year with a Ferrari as “a nightmare”. Elkann responded equally bluntly with his riposte.\n\nSpeaking before this weekend’s Las Vegas Grand Prix, Hamilton insisted his relationship with Elkann remained “great” but took issue with the suggestion he should focus more on his driving when asked if it was a fair comment.\n\n“Not really, I wake up thinking about it and I go to sleep thinking about it and I think about it when I’m sleeping,” he said. “If anything I have to focus on being able to unplug more. It’s been a really heavy year. It’s been the busiest year that I think I’ve had. I’ve been at the factory more than I think I was at any other factory before.” He added that he still felt Ferrari had a long way to go to improve.\n\n“I joined this team knowing full well that it takes time to steer a ship in a different direction,” Hamilton said. “This is a huge thing, it’s a huge organisation. There’s so many moving parts, you can’t fix it in the click of a finger.\n\n“It takes real time. Of course it’s not been what any of us wanted in terms of a season, with the troubles and the results that we’ve had. We’ve just continued to push on, full steam.”\n\nLas Vegas is the 22nd race of the 24-meeting season and there is no indication that Ferrari can expect any great improvement in performance on the street circuit. Indeed the cold and wet conditions on a low-grip track are expected to make it a tricky prospect for all competitors.\n\nHamilton is sixth in the drivers’ championship, 66 points behind his teammate Charles Leclerc, who also addressed Elkann’s comments, which had been aimed at both ­drivers. Leclerc said he had spoken to the Ferrari president who had explained they were not a criticism but rather a reflection of his desire to win, with the Scuderia now fourth in the constructors’ championship.\n\nHamilton’s debut season with ­Ferrari has been hard, his frustration and disappointment palpable at times as he has adapted to a new environment and practices.\n\nskip past newsletter promotion Sign up to Sport in Focus Free weekly newsletter Sign up to Sport in Focus Enter your email address Sign up Privacy Notice: Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on theguardian.com to send you this newsletter. You can complete full registration at any time. For more information about how we use your data see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\n“There’s just been so much to do, and so much to learn. It’s definitely tough when we’re all working for something, and then you fall back,” he said. “It’s like we’re climbing up a mountain and then you arrive at the weekend and you slip a few steps back or 10 steps back, and you have to then get back up and try again the next time.”\n\nLando Norris goes into the race in Las Vegas leading the world championship by 24 points from his McLaren teammate, Oscar Piastri, and 49 in front of Red Bull’s Max Verstappen.\n\nThe British driver cannot claim the title in Nevada but a strong finish in front of Piastri would give him a huge advantage going into the penultimate round in Qatar, after which a lead of 25 points would be enough to seal his first F1 title.",
  "authors": [
    "Giles Richards"
  ],
  "url": "https://www.theguardian.com/sport/2025/nov/20/lewis-hamilton-defends-work-ethic-after-ferrari-chiefs-talk-less-rebuke"
}