{
  "title": "How Smart Devices Spy On Your Home—And How To Avoid It",
  "text": "Transcript\n\nThere are currently nearly 19 billion\n\nsmart devices worldwide.\n\nChances are, you probably have one in your home.\n\nFrom robot vacuum cleaners to smart refrigerators\n\nto security cameras and baby monitors,\n\ninternet-connected air fryers.\n\nHaving everything in your home connected\n\nto Wi-Fi just means there's so much more risk of hacking\n\nand attacks and your data essentially just being exposed\n\nthrough people who want it.\n\nToday, we'll do a deep dive into the security\n\nof smart home devices\n\nand we'll chat with Wired senior review editor,\n\nJulian Chokkattu, to discuss the pros and cons\n\nof bringing smart devices into your home.\n\nThis is Incognito Mode.\n\n[tense music]\n\nOne of the most convenient smart devices out there\n\nis robot vacuums.\n\nWhat am I kind of opening myself up to\n\nwhen I put one of these devices in my house?\n\nYou know, you have this robot\n\nthat's going around your entire home\n\nand it creates an entire map of your home.\n\nThere are conveniences that you can then say,\n\nHey, can you go clean the kitchen specifically?\n\nBut that is data that's stored by the company,\n\nand you would wanna check how that data is stored.\n\nA few years ago, it was reported\n\nthat images leak from an iRobot vacuum cleaner,\n\nsuch as a woman sitting on a toilet\n\nwere sent to a third-party for labeling and testing,\n\nbut eventually, they made their way onto Discord\n\nand even Facebook.\n\nFrom that leak, we know that iRobot was capturing images,\n\nnot just a map at the house,\n\nbut also to identify everything in the house,\n\nsuch as a vase or a couch.\n\nThis is a prime example\n\nof how data that these companies collect\n\ncan be used in ways that you might not expect.\n\nYou definitely, I think, would wanna just avoid\n\nusing a camera based system\n\njust because it does open up the risk\n\nof it capturing the actual mapping data of your home.\n\nYeah, absolutely.\n\nI mean, I can imagine how a robot vacuum company\n\nwould sell that data to marketers for home decor\n\nor, you know, couches and things like that.\n\nNowadays, some companies are using lidar\n\nto map out your home rather than a camera on it\n\nso that the robot vacuum knows where to go.\n\nHow's the technology evolving?\n\nIs there anything new that you're seeing coming out?\n\nYeah, this past CES actually, there was a company\n\nthat basically debuted a robot vacuum that has a little arm\n\nthat comes out or the camera on the actual robot vacuum\n\ncan detect socks for example,\n\nand it has the capability to go over to them,\n\ngrab it, and put them in a specific area\n\nso that it's not disrupting the flow\n\nof the robot vacuum as it cleans your home.\n\nThere was also something about potentially\n\na little laser pointer that could help entertain the cat\n\nso that the cat's not disturbing it.\n\nYou can then theoretically also imagine\n\nwhat other things are gonna be coming to that sort\n\nof a type of a device that roams your house, right?\n\nSome new ones are trying to do stair-climbing capabilities\n\nso that they can go upstairs so that you don't have\n\nto physically move your vacuum up and down.\n\nIt has that potential to sort of be\n\nthat futuristic AI butler\n\nthat maybe we've seen in shows in the past\n\nthat also obviously is gonna open that category up\n\nto a little more scrutiny in terms of\n\nwhat exactly it's capable of,\n\nand if it can pick up a sock,\n\nmaybe it can pick up a knife. [chuckles]\n\nThe dream of having a robot butler\n\nis potentially coming true.\n\nWe're just gonna have to sacrifice our security\n\nand potentially our privacy to get that future.\n\nI think that was a given though, [laughs] in general,\n\nfrom all the sci-fi robot butlers that we've seen.\n\n[intense music]\n\n[robot whirring]\n\nWhoa, whoa, whoa, whoa!\n\n[Robot] I'm sorry, Dave, I'm afraid I can't do that.\n\n[dark music]\n\nSmart TVs are doing a lot more\n\nthan just playing your favorite movies and shows.\n\nThey're also collecting a massive amount of information.\n\nMany TVs nowadays include something\n\ncalled automatic content recognition, or ACR.\n\nresearchers found that some ACR systems\n\ncapture 48,000 snapshots of what you're watching per second.\n\nYeah, I think today,\n\nit's probably very hard to find a very high end TV\n\nwith no smart features.\n\nBy default, most TVs today\n\nhave those streaming apps built in\n\nand some casting capabilities as well.\n\nThey're also more comprehensive in how they're tracking\n\nwhat you watch and the data that they're collecting,\n\nTaking snapshots of what you're watching all the time.\n\nI mean, I understand why the companies\n\nwould want to do that,\n\nbut I don't understand how that really benefits me at all.\n\nSo, in general, you know, TVs are becoming more\n\nand more of an ad platform, even though you might think\n\nthat cutting the cable cord\n\nwas all about getting away from advertisements.\n\nThat's all sort of coming back,\n\nlike more streaming platforms than ever now\n\nhave some type of a ad tier\n\nthat's slightly cheaper, if not free,\n\nbut of course there's, like, a separate part of it.\n\nWhether they're sharing that data with third parties\n\nso that Netflix can understand and know that like,\n\nOh, people liked this, they're actually watching this.\n\nThat's something that companies want that data\n\nin terms of just who is watching what and for how long\n\nand what you're doing on your TV in general.\n\nACR might even work with dumbed-down devices.\n\nSo it's not even just connecting\n\na streaming sticker for example, or using an app.\n\nIt's connecting a Blu-ray player and putting in a DVD.\n\nYou might think that might be completely fine and offline,\n\nbut apparently, company might still know\n\nthat you are watching Titanic for the 15th time on DVD.\n\nWhat are some ways to make sure\n\nthat your data is protected\n\nif you do have one in your house?\n\nYou might be able to, I think,\n\ndelete your advertising profile\n\nso that they don't have, like, a visual understanding\n\nof what it is, who you are, in terms of your tastes\n\nand the ads that they want served to you.\n\nBut a lot of that is also somewhat hidden\n\nin not the most obvious places.\n\nAlways, you know, it's something I do a lot,\n\nI hop into the settings of almost everything I test\n\nand just take a look at what capabilities are there,\n\nwhat features are there, but also, you know,\n\nwhat permissions does this service need.\n\nI'm a tech journalist\n\nand I still find menus on my TV to be kind of baffling,\n\nand you might not know that's even there\n\nor that's even an option\n\nor that this data's being collected in the first place.\n\nIt's worth going through those settings\n\nand definitely trying to make sure\n\nthat you're understanding at least what it is\n\nthat it's collecting about you.\n\n[upbeat electro music]\n\nSo, the voice assistants, they're always listening,\n\nthe mic input is on,\n\nbut they only start recording once it thinks it's heard\n\na wake word and then that audio is captured.\n\nA large part of these voice assistants\n\non these smart speakers is connecting\n\nto other smart home devices, right?\n\nSo, the whole purpose behind them was,\n\nif I'm gonna get smart shades\n\nor if I'm gonna get a security camera\n\nor a smart thermostat, I can just say,\n\nHey, set the thermostat to 68.\n\nOr Hey, can you close the shades in the bedroom?\n\nBut obviously, you've invited a thing\n\nthat is constantly listening.\n\nYeah, it's one that I really struggle with,\n\nbecause it is so convenient and, you know,\n\nespecially if you're a person with mobility issues,\n\nit allows you to do things\n\nyou might not otherwise be able to do,\n\nbut it really creeps me out.\n\nI had one for a while and I decided,\n\nafter it stopped working,\n\nto just not try to make it work anymore.\n\nAnd there are some things you could do,\n\nlike there are usually physical mics,\n\nwhich is on these smart speakers that allow you\n\nto turn off the mics when they're just not in use.\n\nBut then it kind of goes against the whole purpose\n\nof, like, being able to just quickly ask a question\n\nif you have to go to the device and turn on the mic.\n\nBut it's just what you're willing\n\nto accept in terms of security.\n\nEven if you had certain privacy protections\n\nwhen you bought a smart speaker, like an Amazon Echo,\n\nyou don't necessarily know if those protections\n\nare going to change.\n\nFor example, Amazon updated its terms of service\n\nso that users of its Echo devices can no longer opt out\n\nof sending their voice recordings to the company.\n\nIt might not seem like there's been a lot happening\n\nin this space, but there's actually now\n\ngoing to be another bit of a wave, I think,\n\nin terms of these devices, because now,\n\nit's all about incorporating artificial intelligence.\n\nFor example, Google is upgrading a lot of its Nest products\n\nwith Gemini, its large language model,\n\nso that it can understand things like the ability\n\nto recognize a FedEx driver coming up to your doorway\n\nand then you later on asking,\n\nHey, did FedEx come by today?\n\nBecause large language models have large datasets\n\nthat they can train on, they're now capable\n\nof that more natural free-flowing conversation,\n\nwhich might mean that there are gonna be new devices\n\nthat people might want to upgrade to\n\nor those capabilities might come to older devices.\n\nThat's a perfect example of how\n\nthese risks can be introduced when you get a device.\n\nLike you might be getting a device\n\nwith certain features in certain settings,\n\nand then things change or the company gets sold\n\nand you don't necessarily have control\n\nover your data in those situations.\n\nYou know, if you have an older Alexa device\n\nand you don't want your recordings being sent to Amazon,\n\nyou basically just have to decide whether you're gonna keep\n\nthat device and keep using it at all.\n\n[calm music]\n\nSmart locks, the selling point is,\n\nyou don't have to necessarily carry your key.\n\nAlthough, I highly recommend, if you have a smart lock,\n\nto still carry your keys, because they rely on batteries.\n\nYou can even share your passcodes with family and friends\n\nso that they can enter your home if you're away,\n\nthey need to check on a dog, but there are more risks,\n\nbecause now, you've put the keys to your home\n\nin a digital platform and that, you know,\n\nthat just might not be great from a security standpoint.\n\nIf something does get hacked,\n\nsomeone could theoretically enter your home\n\nor at least capture,\n\nlike if your smart lock has a camera on it,\n\nor a microphone could capture some data from that as well.\n\nIt's kind of ironic that something that's, like,\n\nliterally for security could then be less secure\n\njust because you're adding these more convenient features.\n\nYeah, I mean, a lot of locks have the ability\n\nto auto unlock as you approach and that,\n\nmost of the time, relies on your phone's location,\n\nwhich means when you enter a specific area\n\nof your geo-fenced area of your home,\n\nthe door will unlock.\n\nThat I feel like, to me at least,\n\nseems like a potential data point\n\nthat someone would love to have\n\nif they wanted to target you specifically.\n\nThere are some security standards\n\nyou can probably look for.\n\nAre they following AES-128 bit encryption?\n\nIs the app two-factor authenticated?\n\nHow physically capable it is as a lock,\n\nwhether it's a retrofit over your existing deadbolt,\n\nso it might not change the entire hardware?\n\nThat might be better than something\n\nthat completely replaces your hardware,\n\nespecially if it's from a company\n\nthat doesn't have a history of making locks,\n\nbut also making sure that the company\n\nhas a good track record in following best practices\n\nto keep your data secure.\n\nAnother issue that kind of applies\n\nto all these smart devices is them going outta date\n\nand just not getting firmware updates\n\nand then you need to replace the whole thing.\n\nOnce you've installed a lock,\n\nyou're not gonna go out and install another one anytime soon\n\nor you hope that you don't have to.\n\nYeah, and a lot of capabilities are usually updated\n\nthrough the app itself, but obviously, as you said,\n\nit's one thing to make sure that, you know,\n\nespecially if it's been 10 years or so\n\nsince you installed a smart lock, probably just check\n\nthat there are security updates still being issued.\n\nDo companies stop issuing software updates\n\nor security patches\n\nbecause there's some good reason for that\n\nor are they just trying to get you\n\nto buy another one of the products?\n\nI mean, I think companies have it in their power,\n\nespecially big companies,\n\nto offer significantly longer software update cycles\n\nfor, you know, these kinds of devices,\n\nwhether there's also an element of planned obsolescence\n\nand they want you to upgrade to the next thing,\n\nI'm sure that is definitely also a big part of it.\n\nThat's kinda why we encourage people to look\n\nat some of the bigger brands,\n\nbecause if anyone is gonna at least support a product\n\nfor something, like, a decade,\n\nit's probably the company that has those resources.\n\nDefinitely, we could stand to ask in force companies\n\nto require that some of these products\n\nthat especially you don't expect to change that often\n\nshould get support cycles that reflect that.\n\n[ambient humming music]\n\nCompanies are sort of pitching, again, convenience\n\nin terms of a Samsung smart fridge might have a display\n\non the outside that's basically a tablet\n\nand you might be able to leave sticky notes\n\nfor everyone in the house\n\nor you might be able to even play YouTube videos\n\nto follow recipes along.\n\nBut also in the inside, they could have cameras,\n\nand cameras can be used to detect\n\nthe types of things that are inside your fridge\n\nso that you can even look at remotely into your fridge.\n\n[Voice Over] Like here, when I need\n\nto check the milk situation.\n\nAnd it's true, some of that is convenient,\n\nbut especially with something like their Family Hub line\n\nof refrigerators where there's a display on the outside,\n\nyou have to know that, like, you're probably going to have\n\nto sign in, YouTube, Instagram, whatever it is\n\nyou want to have on this,\n\nlike, essentially a tablet display.\n\nAll of that is now under the protection\n\nof what this fridge brand is doing to keep your data secure.\n\nMake a really great point about it\n\nbeing another point of failure\n\nand just kind of introducing complexity into your life\n\nand thus risk, because it's designed, it can be hacked.\n\nYeah, I don't think that's still a lot of people\n\nthat are gonna hack your fridge\n\nand look at what is in your fridge,\n\nbut it does mean they might get other\n\ncompromising information from you, right?\n\nIt's not just big appliances like refrigerators\n\nand stoves that are connected to the internet,\n\nit's almost everything, from coffee makers to toasters\n\nto even air fryers.\n\nOne report found that some air fryers\n\nwere automatically collecting personal data\n\nand sending it back to the company.\n\nOthers were asking for things like gender and date of birth.\n\nThere's a whole other side to it as well\n\nin terms of, like, repairability,\n\nthe long-term durability of, if there's a screen\n\nand there's a screen as the only way for you to, you know,\n\ninteract with your oven,\n\nwhat happens if you accidentally drop a cast iron pan on it\n\nand now it's broken,\n\nand now you can't really configure your oven\n\nor you can't interact with it?\n\nNow you have to spend that money to get it repaired.\n\nIt's gonna be more expensive.\n\nAnd also, in terms of just, you know,\n\nhow long it's supported for over time,\n\nif a particular feature breaks and the only way to interact\n\nwith it is through the software, but there's a glitch\n\nand a company's not gonna update it anymore,\n\nnow you have fewer options in what you can actually do\n\noutside of just dumping that entire smart oven.\n\n[upbeat electro music]\n\nSecurity cameras obviously have to be recording.\n\nUsually, companies offer some type of a cloud-based plan\n\nwhere you can store video data for 30 days for example,\n\nand after that, it's deleted.\n\nSome security cameras also let you record directly\n\nto local storage, although there have been certain incidents\n\nwhere what was promised is local storage\n\nended up also accidentally going to over the cloud.\n\nYou also do wanna make sure any video that is sent over\n\nto the cloud for, for example, the convenience of being able\n\nto look at your footage from a remote location\n\nwhen you're not home, that it's encrypted\n\nso that people can't just look at your streams.\n\nStoring the footage locally\n\nis definitely better for privacy, but it also,\n\nyou have to have the technical know-how\n\nto secure that storage.\n\nIf somebody did wanna target you for some reason,\n\nthen they would be able to potentially gain access\n\nto hundreds of hours of footage of your family\n\nor whatever you've pointed the camera at.\n\nRight, nowadays, security cameras\n\naren't just also cameras,\n\nthey have algorithms and facial recognition features.\n\nSo, there's that other aspect of the data\n\nthat they're collecting.\n\nYou know, now a big new thing\n\nthat a lot of these companies are trying to pivot to\n\nis using artificial intelligence so that, you know,\n\nyou can just ask your Google Home app or your Alexa,\n\nHey, did FedEx come by today?\n\nAnd it'll have understood what is a FedEx employee,\n\nwhat they generally look like,\n\nwhat the clothes they wear, is if they're holding a package.\n\nAnd you can even ask things like,\n\nIs there a package for me at the front door?\n\nYou can even add people's names if you really want\n\nin terms of like,\n\nOh, that's my wife.\n\n[Voice Assistant] Brittany is at the front door.\n\nI didn't know that they are building facial recognition\n\nand image recognition into these home devices' data\n\nextensively, and that's quite frankly terrifying.\n\nYeah, I mean, a lot of that, I believe,\n\nis completely on device and local,\n\nso I don't think that information is being shared.\n\nThe idea is that because a lot of them will say,\n\nPerson detected.\n\nRight? They have person detection, animal detection,\n\nthat have just getting these arbitrary person detected,\n\nwhich might not provide you much value.\n\nIt might be more helpful if it's says,\n\nXYZ came up to your front door\n\nand that's person's a friend.\n\nI think that's a really great example\n\nof how these privacy erosions happen.\n\nA company builds in a new feature\n\nthat solves, like, a minor problem or makes it,\n\nyou know, 10% better,\n\nbut then you've introduced this new acceptance\n\nof just having facial recognition everywhere\n\nand everyone is then just like,\n\nYeah, that's just how cameras work.\n\nThat's becomes the norm.\n\nSo, Ring is another big part of all of this.\n\nThey weaponized in some ways.\n\nThey're video doorbells and security cameras\n\nby sharing information and footage\n\nwith local police departments in the past.\n\nThat's really how Ring was built,\n\nwas by going to local police departments,\n\ngiving them the ability to offer people\n\nin their community deals through the police department\n\nto buy Ring cameras, and then in turn,\n\nRing had really close relationships with the police.\n\nThey had a specific feature that allowed somebody\n\nto share their footage directly with the police department.\n\nSolving crime is great.\n\nNobody wants crime.\n\nThe issue is that it really rapidly indoctrinated people\n\nto just constant corporate surveillance.\n\nI worked on one investigation several years ago\n\nwhere we were able to map every Ring camera\n\nin a specific area, and we were able to see, like,\n\nif a child is gonna walk to school,\n\nthey're gonna pass 75 Ring cameras,\n\nand they're gonna be just subjected to the surveillance\n\nand that data is collected by a corporation,\n\nRing is owned by Amazon, and, you know,\n\nwe don't know necessarily what\n\nthat footage is gonna be used for.\n\nAnd I think it's more just becoming comfortable\n\nwith making constant surveillance the norm.\n\n[slow music]\n\nThe convenience of that Wi-Fi capability in baby monitors\n\nis basically the ability to remotely look at\n\nand monitor your baby, even if you're not at home.\n\nLike if you have a nanny taking care of the baby,\n\nyou can check on the baby yourself if you're away,\n\nbut obviously, all of that introduces\n\nall of these potentials for violating your privacy.\n\nThere was a story of, like, a woman who found\n\nthat there was some stranger whispering\n\nthrough her baby monitor,\n\nand that's terrifying, that's creepy.\n\nSo, while security cameras and baby monitors\n\nare very similar in terms of their functionality,\n\nthere's some reporting that shows even the best\n\nWi-Fi-connected baby monitors are less secure\n\nthan regular security cameras.\n\nYou know, a lot of times, you see companies\n\nthat make something that's not historically Wi-Fi connected\n\nand they start adding in those capabilities.\n\nThey just don't have the team\n\nthat knows how to add the security measures,\n\nand so they just haven't invested\n\nin security as the top priority\n\nas they add new features or new capabilities.\n\nA lot of these smart home devices,\n\nespecially something like a baby camera,\n\nlike, you're setting it up, you would wanna make sure\n\nthat there is a two-factor authenticated method\n\nof signing in securely so that even if your password\n\nis compromised, a threat actor can't hop in\n\nand just willingly access everything.\n\nThey would need a secondary device\n\nfor you to authenticate that it is you.\n\nThat should apply to every device\n\nor app that you can possibly add two-factor to.\n\nDefinitely do that.\n\nYou know, I'd say it's one of those situations\n\nwhere you kind of really have to look\n\nat the risk versus reward.\n\nAnd I think taking the steps to make sure your baby cam\n\nis as secure as possible is really imperative,\n\nbecause it's monitoring the most sensitive\n\nand precious thing in your life.\n\n[calm music]\n\nSmart thermostats are great.\n\nThey can lower your energy bill\n\nand tell you if something's wrong in your HVAC system,\n\nbut they also collect a ton of sensitive data,\n\nlike when you go to sleep, when you're away from home.\n\nIf that information is accessed by hackers,\n\nthat could tell someone when they should break\n\ninto your house.\n\nIt's also probably being collected for advertising purposes.\n\nWhat coffee company wouldn't love to know exactly\n\nwhen you wake up to serve you an ad for their brand of brew?\n\nYou know, the convenience\n\nis that you can set your temperature from wherever you are.\n\nYou don't have to go to the product itself.\n\nYou can even have functionality\n\nlike understanding when you're not home\n\nand it'll then automatically lower temperatures\n\nor maybe even turn off certain systems\n\nso that you're not wasting energy.\n\nSome of that is based on location data\n\nwith your phone, maybe.\n\nFor example, I think Google's Nest thermostat now\n\nhas radar in it, so it understands\n\nwhen you're approaching it,\n\nthe device lights up with all the information.\n\nThere are smart thermostats\n\nthat have voice assistance built in, like Alexa for example,\n\nbut I think it might be good practice to just let that\n\nbe handled by an actual hub or something else\n\nand let your smart thermostat\n\njust not have a microphone or a camera.\n\nThe benefits outweigh kind of the risks, I think for me\n\nand with this one, except for the fact\n\nthat they are another entry point for a hacker\n\nto gain access to your network.\n\nI would say buy the ones that have the fewer features.\n\nDon't have the microphones, don't have voice assistance,\n\nmaking them as simple as possible\n\nwhile still getting the benefits\n\nof having a smart thermostat is probably the way to go.\n\n[ominous music]\n\nA router is not really a smart device,\n\nit's just the thing that everything in your home\n\nis going to connect to.\n\nRouters are one of the most attacked devices\n\nbecause they serve as a gateway to the rest of your network.\n\nThey're also really low-hanging fruit.\n\nMost people don't change the default password,\n\nand so hackers are able to get that information\n\nor crack those passwords and get into your network.\n\nIf a hacker gets into your Wi-Fi,\n\nthey can see anything that's connecting to the internet\n\nattached to your network,\n\npotentially collect unencrypted communications,\n\nand they may be able to gain access to the devices\n\nand the data that your devices are collecting.\n\nSo, studies show that most people\n\ndon't change the password on their routers.\n\nWhat really is the worst case scenario in that situation?\n\nI'd say the worst case scenario\n\nis that someone gains persistent access to your network,\n\nthose devices and potentially any data\n\nthat those devices are collecting,\n\nor monitor you in the way that you're monitoring yourself.\n\nRouters are kind of the window into your home.\n\nUsually, it's you looking through that window\n\nby your smart fridge app or your smart toaster\n\nor whatever it might be.\n\nIn this case, the router is the entry point for anybody\n\nwho is trying to gain access to your network to gain access.\n\nAnd so, that's why the security of your router is just\n\nas important as anything else, if not more important.\n\nSo, one of the issues with routers\n\nis that you have to replace them occasionally.\n\nCan you tell me why that is?\n\nLike, why would I have to trade in for a new router?\n\nThere's no law that says,\n\nHey, a router should be updated\n\nor kept updated for 10 years.\n\nThere is a story of, like, you know, Wi-Fi itself.\n\nThere's new versions coming every few years.\n\nSo, right now, the latest generation is Wi-Fi 7.\n\nSo, there are better security protocols in Wi-Fi 7\n\nversus Wi-Fi 5, right?\n\nSo, there are genuine reasons that you would want\n\nto stay on the latest hardware.\n\nAnd while newer routers are backwards compatible\n\nwith older Wi-Fi standards, you won't be able\n\nto access those improved security measures\n\nwithout actually upgrading to a Wi-Fi 7 router for example.\n\n[upbeat electro music]\n\nIf you're looking to buy a smart device\n\nand you are thinking about your privacy and security,\n\nwhat's some advice you have for people\n\nfor what to look for or what to avoid?\n\nYou probably wanna stick\n\nto some well-known, established brands.\n\nThey have a better track record and the resources\n\nto have a security team, to have security practices,\n\nand follow the best approach.\n\nBeing able to patch and quickly update devices\n\nif there is a security breach.\n\nIt's not about if your company's product gets,\n\nyou know, hacked, it's about when.\n\nAnd one other thing you could also do is,\n\nyou know, when you're shopping for a device,\n\ndo you really need X feature, right?\n\nLike checking to see if your robot vacuum has lidar,\n\nfor example, which is what cars use,\n\nrather than a camera on it.\n\nA security camera.\n\nShould you buy one with a privacy shutter\n\nso that you don't have to keep unplugging it every time?\n\nLook at all the features that the product provides.\n\nIf there's a genuine need for something,\n\nlike that Wi-Fi connectivity, which it enables,\n\nthen is there a way to at least mitigate\n\nthat type of risk by opting for technology\n\nthat is a little more privacy friendly?\n\n[calm music]\n\nHere are six things you can do right now\n\nto make your home more safe if you use smart devices.\n\nFirst, use a strong password\n\nand definitely make sure you're not using\n\nthe default password that comes with your device.\n\nMake sure you turn on two-factor\n\nor multi-factor authentication whenever available.\n\nAlways make sure your software is up to date\n\non both your companion apps and on the devices themselves.\n\nMake sure you router's secure.\n\nThat means changing the password, changing the network name,\n\nand upgrading the connection to be encrypted if possible.\n\nDo your research.\n\nMake sure you're getting them from a reputable company\n\nthat has a good track record with handling your data\n\nand dealing with data breaches.\n\nSet up separate Wi-Fi networks.\n\nThat way, your laptop and other sensitive devices\n\nare not connected to the same network\n\nas all your smart devices.\n\nThis was Incognito Mode.\n\nUntil next time.\n\n[calm humming music]",
  "authors": [
    "Condé Nast"
  ],
  "url": "https://www.wired.com/video/watch/incognito-mode-how-smart-devices-spy-on-your-home-and-how-to-avoid-it"
}