{
  "title": "'Everyone can relate to it': How 2015 TV masterpiece Reply 1988 sparked the Korean drama boom",
  "text": "Hitherto, K-dramas generally fell into one of two camps: highly-rated series that catered to older viewers but had little impact online, and more niche dramas aimed at younger viewers that thrived through memes and virality. However, Reply 1988 proved to be a show for everyone. As South Korean culture critic Kim Hern-sik says, the way it reflected Seoul's \"alley culture\" – of tightly bonded neighbourhoods existing within the city's narrow streets – and featured multi-generational characters made it a show the whole family wanted to watch together.\n\nIt's hard to overstate how profound an impact Reply 1988 had in South Korea. Contrasting with the thrillers and melodramas that made up so much of the country's drama output, Reply 1988's textured, undecorated realism offered viewers something much more subtle yet affecting. For younger viewers, especially, the series provided a way to look back in time and recognise in past generations – including their own parents – a youth not so removed from their own. That's a sentiment echoed by Ryu Hye-young, who played Deok-sun's older sister (and regular tormentor), Bo-ra. \"Playing Bo-ra allowed me to better understand an era I hadn't experienced,\" she tells the BBC. \"It made me realise that the peaceful life I enjoy today exists thanks to the young people who paved the way.\"\n\nCJ ENM The series richly depicts a Seoul neighbourhood and its different generations (Credit: CJ ENM)\n\nMore materially, in featuring Air Jordans, Walkmans, Puck Man (the original name for Pac-Man), and a host of 1980s and 1990s musical hits, the show led to a retro revival in South Korea. Pop stars and styles of the 80s returned to the charts, Crown Beer was revived after two-decades off shelves, and fashion of the decade became the new retro trend. \"While we can't say our series was the first to explore retro themes, I believe it initiated the rise of retro culture [in South Korea] and 90s Korea-centred dramas,\" says series writer Lee Woo-jung, referring to the wave of nostalgic and slice-of-life series that followed, such as Twenty-Five Twenty-One, My Mister, and Shin and Lee's next collaboration Hospital Playlist.\n\nHow it went global\n\nIts story was one that also resonated far beyond its home country, however. \"Reply 1988 portrays a warm, ordinary, and universal family – the kind of family everyone can relate to or long for,\" says Ryu. The first signs that it would have an impact beyond its home country came from China, where it screened in 2016, reaching a staggering 235 million viewers within a month. As streaming made the TV landscape more globalised, Reply 1988's reach only grew – first through streaming service Viki from 2016, but particularly when it was added to Netflix's library in 2020. According to the streamer's own data, it continues to rack up millions of viewing hours globally each year.",
  "authors": [],
  "url": "https://www.bbc.com/culture/article/20251112-the-tv-masterpiece-that-sparked-the-k-drama-boom"
}