{
  "title": "Tribunal bloquea orden de juez de liberar a cientos de inmigrantes arrestados en la ofensiva migratoria de Illinois",
  "text": "CNN —\n\nUn tribunal federal de apelaciones pausó la liberación de cientos de inmigrantes que fueron arrestados durante las acciones agresivas de inmigración del Departamento de Seguridad Nacional en el área de Chicago a principios de este año, según un documento judicial presentado este jueves.\n\nEl miércoles pasado, el juez de distrito de EE.UU. Jeffrey Cummings ordenó al Gobierno de Trump liberar bajo fianza de US$ 1.500 a cientos de detenidos después de determinar que los arrestos violaron un decreto de consentimiento local que prohíbe arrestos de inmigrantes sin orden judicial.\n\nLos registros judiciales mostraron que el viernes pasado el Departamento de Justicia (DOJ, por sus siglas en inglés) presentó una lista de más de 600 personas para ser evaluadas para su liberación. La lista mostró que solo una fracción de los detenidos fue considerada de “alto riesgo” por funcionarios federales.\n\nLa lista incluyó antecedentes penales de solo 16 acusados. Esos antecedentes incluían condenas o arrestos por asalto agravado, conducir bajo la influencia, exhibicionismo, agresión y seducción de un menor y secuestro.\n\nUn análisis de CNN del documento del DOJ mostró que los inmigrantes arrestados en el área de Chicago fueron trasladados a centros de detención tan lejanos como Texas y Kentucky.\n\nEste jueves, el Tribunal de Apelaciones del Séptimo Circuito falló a favor del Gobierno de Trump para mantener bajo custodia a los incluidos en la lista, apenas un día antes de que los detenidos fueran liberados.\n\nLas tensiones entre el Gobierno de Trump y líderes locales, manifestantes y periodistas en Chicago e Illinois han aumentado desde que comenzó la Operación Midway Blitz en el verano. El Gobierno enfrenta múltiples demandas legales por el uso de la fuerza contra manifestantes, el trato a medios y miembros del clero, y las detenciones sin orden judicial.\n\nLa ofensiva federal contra la inmigración ha generado preocupación en la comunidad por el posible perfilamiento racial y violaciones de derechos constitucionales, tanto de personas documentadas como indocumentadas, ya que la política de deportaciones masivas ha afectado a personas de todas las edades, desde niños y familias hasta presuntos delincuentes, con arrestos en tiendas, granjas, audiencias judiciales, controles de tráfico y lugares de trabajo.\n\nEn su solicitud para pausar la liberación de inmigrantes indocumentados, el Gobierno de Trump argumentó que las órdenes del juez Cummings interpretaron incorrectamente la ley, excedieron el alcance del acuerdo y la autoridad legal del tribunal, e interfirieron con la labor de los agentes migratorios.\n\nAunque el tribunal de apelaciones no explicó por qué falló a favor del Gobierno de Trump, su decisión llegó un día después de que un panel de tres jueces del Séptimo Circuito bloqueara la orden de otro juez por considerar que había excedido su autoridad al imponer límites estrictos a la actuación de agentes federales en Chicago.\n\nEn ese caso, la jueza Sara Ellis respondió a preocupaciones de manifestantes, clérigos y medios sobre el aumento de la fuerza utilizada por agentes federales. Ellis prohibió el uso de ciertos métodos de control, impuso requisitos para cámaras corporales e identificación y ordenó al Gobierno entregar numerosos registros internos.\n\n“Los demandados quieren hacer creer que el área de Chicago está sumida en la violencia, saqueada por alborotadores y atacada por agitadores, lo que justificaría el uso indiscriminado de la fuerza contra periodistas, manifestantes pacíficos y religiosos. Esa narrativa simplemente no es cierta”.\n\nAmbos casos bajo los jueces Cummings y Ellis siguen en curso. El Séptimo Circuito escuchará los argumentos orales sobre las detenciones de inmigrantes indocumentados el 2 de diciembre.\n\nEl Centro Nacional de Justicia para Inmigrantes y la Unión Estadounidense de Libertades Civiles, abogados principales en la demanda colectiva, dijeron estar “profundamente decepcionados” por la decisión del jueves.\n\n“La suspensión del Séptimo Circuito significa que las familias del área de Chicago enfrentarán, al menos, semanas adicionales de separación, y que las personas seguirán en centros de detención de inmigrantes en condiciones inhumanas, en riesgo de deportación sin el debido proceso. Esto es especialmente triste porque las familias ya han estado separadas de sus seres queridos durante semanas”, dijeron las organizaciones en un comunicado conjunto.\n\nIncluso después de que la orden del juez Cummings allanara el camino para la liberación de los detenidos, el destino de quienes permanecían bajo custodia seguía siendo incierto. Varios de los arrestados habían presentado sus propios casos individuales, y algunos, de acuerdo con el documento del DOJ, ya habían sido liberados.\n\nDe las 3.000 personas arrestadas entre junio y octubre, 615 —una quinta parte— no están sujetas a detención obligatoria ni tienen órdenes finales de deportación, de acuerdo con el fallo de Cummings. El juez ordenó que quienes permanezcan detenidos de ese grupo, siempre que no representen un alto riesgo para la seguridad pública, debían recibir fianza antes del mediodía del 21 de noviembre.\n\nVarios abogados con los que habló CNN no estaban seguros de cómo la decisión de Cummings afectaría a sus clientes que fueron trasladados fuera de la jurisdicción del juez Cummings.",
  "authors": [
    "Whitney Wild"
  ],
  "url": "https://cnnespanol.cnn.com/2025/11/20/eeuu/bloqueo-orden-liberar-inmigrantes-arrestados-illinois-trax"
}