{
  "title": "Los equipos de rescate buscan supervivientes entre los escombros del mortífero ataque ruso en el oeste de Ucrania",
  "text": "Kyiv CNN —\n\nLos rescatistas trabajaron durante toda la noche para encontrar sobrevivientes de un ataque ruso que afectó edificios de apartamentos en el oeste de Ucrania y que dejó al menos 26 muertos, entre ellos tres niños, informó este jueves el presidente Volodymyr Zelensky.\n\nMás de 20 personas siguen desaparecidas tras los ataques aéreos contra dos bloques de apartamentos en la ciudad occidental de Ternopil, que según el ministro del interior de Ucrania podrían haber aniquilado a familias enteras.\n\nEl ataque ruso a gran escala perpetrado la noche del martes fue uno de los más mortíferos contra el oeste de Ucrania desde el inicio del conflicto e impulsó a la OTAN a desplegar aviones de combate sobre la vecina Polonia y Rumania.\n\nZelensky advirtió que el número de muertos podría aumentar, ya que hay personas atrapadas bajo los escombros, y afirmó que Rusia “nunca se detendrá por sí sola”. En una publicación en Telegram, instó a sus aliados a aumentar la presión sobre Moscú para que detenga la violencia y restablezca la paz.\n\nEl hijo de Oksana Kobel se encontraba en un apartamento del noveno piso del edificio en el momento del bombardeo.\n\n“Fui a trabajar, oí las explosiones. Lo llamé y le dije: ‘Bohdan, ve al refugio, vístete’. Él respondió: ‘Mamá, ya estoy despierto. Todo estará bien’”, contó el miércoles, según Reuters.\n\nLos ataques de Rusia se han dirigido principalmente contra la parte oriental del país y grandes ciudades como Kyiv, y muchos ucranianos han huido al oeste.\n\nLa Fuerza Aérea ucraniana afirmó que Rusia lanzó cientos de drones y decenas de misiles durante el bombardeo. Según la Fuerza Aérea, los edificios de Ternópil fueron alcanzados muy probablemente por el potente misil de crucero ruso Kh-101, diseñado para evadir las defensas antiaéreas y equipado con un avanzado sistema de guiado de precisión.\n\nEl Ministerio de Defensa de Rumania informó que desplegó dos Eurofighters, parte de la flota de la OTAN, y posteriormente dos cazas F-16 rumanos después de que un dron ruso ingresara en su espacio aéreo durante el ataque.\n\nAviones de combate de Polonia y aliados también fueron desplegados el miércoles por la mañana para proteger el espacio aéreo polaco, según informó el mando operativo del país.\n\nEquipos de rescate extinguen un incendio en un edificio residencial dañado por un ataque ruso en Járkiv, Ucrania, el miércoles 19 de noviembre de 2025. Andrii Marienko/AP\n\nMientras tanto, el secretario del Ejército estadounidense, Dan Driscoll, y una delegación de alto nivel del Pentágono estuvieron el jueves en Ucrania para reunirse con funcionarios tras los informes de que Rusia y Estados Unidos están trabajando en propuestas que podrían implicar la cesión de territorio a Ucrania y la reducción del tamaño de su ejército.\n\nEl ministro de Asuntos Exteriores de Polonia, Radosław Sikorski, declaró a CNN que cualquier plan de paz tendría que involucrar a Europa y dejar a Ucrania con la capacidad de defenderse.\n\n“Polonia es vecina tanto de Rusia como de Ucrania, y la Unión Europea está ayudando a Ucrania más que Estados Unidos, tanto militar como financieramente. Por lo tanto, tenemos mucho más en juego en este asunto que Estados Unidos”, afirmó.\n\nEn los últimos meses, los aliados de la OTAN han desplegado cada vez más aviones de combate durante los ataques rusos contra Ucrania, o cuando municiones, drones y aviones de guerra rusos se han acercado demasiado a sus fronteras o las han cruzado.\n\nLa última medida de la OTAN se produce en una semana tensa. Funcionarios polacos han señalado a Rusia como responsable tras la destrucción de una vía férrea clave en lo que Varsovia calificó como un “acto de sabotaje sin precedentes” cometido por dos ciudadanos ucranianos que “colaboraban con los servicios rusos”.\n\nMoscú ha negado la acusación.\n\nEl miércoles, el primer ministro de Polonia, Sikorski, anunció el cierre del último consulado ruso en el país en respuesta a la destrucción de la vía férrea. El portavoz del Kremlin, Dmitri Peskov, lamentó la medida.\n\nUn avión de combate Rafale, drones y municiones en la base aérea de Villacoublay, en Velizy-Villacoublay, Francia, antes de la llegada del presidente de Ucrania, Volodymyr Zelensky, el lunes. Christophe Ena/AFP/Getty Images\n\nEl martes, el Departamento de Estado de EE. UU. aprobó una posible venta de US$ 105 millones que permitiría a Ucrania modernizar su sistema de defensa aérea Patriot, un escudo fundamental contra los ataques aéreos rusos.\n\n“La venta propuesta mejorará la capacidad de Ucrania para hacer frente a las amenazas actuales y futuras, al equiparla aún más para llevar a cabo misiones de autodefensa y seguridad regional con una capacidad de sostenimiento local más sólida”, señaló un comunicado del Pentágono.\n\nA principios de esta semana, Zelensky cerró un acuerdo durante una visita a París para comprar “hasta 100” aviones de combate Rafale de fabricación francesa, así como defensas antiaéreas y drones.\n\nEsta noticia y su titular han sido actualizados con información adicional.",
  "authors": [
    "Victoria Butenko",
    "Kosta Gak",
    "Todd Symons",
    "Catherine Nicholls"
  ],
  "url": "https://cnnespanol.cnn.com/2025/11/19/mundo/polonia-aviones-combate-rusia-ataque-combinado-ucrania-trax"
}