{
  "title": "18 Easy and Cheap Ground Beef Recipes That You’ll Make On Repeat",
  "text": "Advertisement\n\n18 Easy and Cheap Ground Beef Recipes That You’ll Make On Repeat And you can substitute practically any ground meat. Priya Krishna’s homemade hamburger helper, adapted from Mark Rosati’s recipe. Credit... Ryan Liebe for The New York Times. Food Stylist: Simon Andrews.\n\nThe other day, I came home from the grocery store and laughed aloud as I unloaded a three-pound package of ground beef, a three-pound package of ground turkey, a two-pound package of ground pork and a one-pound package of ground chicken. (Somewhere in the great beyond, my Midwestern mother is beaming with pride.) Even if I have no idea what I’m going to cook, I always pick up at least a pound of ground beef or turkey because with it, I know I can make something fast and delicious that my family will eat.\n\nGround beef is really hard to beat as far as bang for your buck goes: It’s typically economical, it’s high in protein, it freezes well and it’s wildly adaptable: meatballs, laab, chili, burgers, cottage pie — the list goes on. Below are 18 of our best weeknight ground beef recipes (all of which you can make with any ground meat that you have on hand, or maybe more important, that you found on sale.)\n\nCredit... Christopher Testani for The New York Times. Food Stylist: Simon Andrews.\n\nReady in: 30 minutes\n\nThis gorgeous noodle salad from Kay Chun is bright and cheery in color and flavor — the ideal antidote to a dreary winter day. Browned ground beef is layered over romaine, cherry tomatoes, bell peppers and rice noodles and then drizzled with a tart and spicy vinaigrette of lime juice, fish sauce, chile and garlic.\n\nRecipe: Laab Noodle Salad\n\nAdvertisement\n\nCredit... Rachel Vanni for The New York Times. Food Stylist: Monica Pierini.\n\nReady in: 35 minutes\n\nTaco soup, baked potato soup, cabbage roll soup and now cheeseburger soup. I’m a sucker for an “inspired by” soup, and this one from Dan Pelosi combines all the satisfying flavors of a cheeseburger into a soup that’s cozy and filling. Chunks of ground beef, carrots, celery, onions and potatoes simmer in a Cheddar-y roux.\n\nRecipe: Cheeseburger Soup\n\nCredit... Linda Xiao for The New York Times. Food Stylist: Monica Pierini.\n\nReady in: 30 minutes\n\nThis cheater version of beef biryani from Kay Chun doesn’t taste like a shortcut at all. The rice, which is seasoned with cardamom, cinnamon and cloves, gets a head start in a Dutch oven, while the ground beef sizzles in a skillet with garlic, ginger, garam masala, chile powder, fennel, turmeric, star anise and cumin. The beef finishes cooking on top of the rice, which is then fluffed and served.\n\nRecipe: Beef Biryani With Cumin Raita\n\nCredit... Ryan Liebe for The New York Times. Food Stylist: Barrett Washburne.\n\nReady in: 25 minutes\n\nThis recipe from Zaynab Issa is one of those unicorn dishes that everyone in my family gets excited about. Ground beef — seasoned with turmeric, onion, salt and pepper — gets hard-seared on one side and then combined with walnuts and raisins. Pile it atop a bed of cucumber yogurt and serve with big chunks of pita for swiping through.\n\nRecipe: Smashed Beef Kebab With Cucumber Yogurt\n\nAdvertisement\n\nCredit... Romulo Yanes for The New York Times. Food Stylist: Vivian Lui\n\nReady in: 20 minutes\n\nAll hail the mighty sloppy Joes, a 1980s school cafeteria favorite. This one from Marian Burros is as classic as can be, made with tomato sauce, ketchup, Worcestershire sauce, a touch of molasses and the surprising addition of orange zest. Serve them with Tater Tots, obviously.\n\nRecipe: Classic Sloppy Joes\n\nCredit... David Malosh for The New York Times. Food Stylist: Simon Andrews.\n\nReady in: 35 minutes\n\nIf anyone can make a weeknight Bolognese taste as if it’s been simmering for hours, when it’s really only been 35 minutes, it’s Genevieve Ko. The secret? Red curry paste, which gives it a little kick and a lot of depth.\n\nRecipe: Spicy, Creamy Weeknight Bolognese\n\nCredit... Julia Gartland for The New York Times. Food Stylist: Barrett Washburne.\n\nReady in: 20 minutes\n\nKay Chun certainly knows her way around a meatball. Every single one of her meatball recipes is a tried-and-true favorite in our house, and this savory-sweet, Korean-inspired version is one of the best. Take her advice and use Ritz crackers instead of bread crumbs, and you’ll be delighted by the pillowy tenderness.\n\nRecipe: Korean BBQ-Style Meatballs\n\nAdvertisement\n\nCredit... Ryan Liebe for The New York Times. Food Stylist: Simon Andrews.\n\nReady in: 1 hour 15 minutes\n\nWhen I was in college, a “fancy dinner” looked like sharing a big skillet of Hamburger Helper with my roommate while watching “The Young and the Restless.” The dish was absolutely delicious, but Priya Krishna’s version — which she adapted from Mark Rosati, the culinary director of Shake Shack — is a big, spicy upgrade we would have devoured with equal gusto.\n\nRecipe: Homemade Hamburger Helper\n\nCredit... Andrew Purcell for The New York Times. Food Stylist: Carrie Purcell.\n\nReady in: 1 hour 15 minutes\n\nIn Lidey Heuck’s riff on the classic that never gets old, ground beef (or pork, chicken or turkey) is combined with tomatoes, onions, oregano and leftover rice and then stuffed into bell pepper halves, topped with mozzarella and baked until fork-tender.\n\nRecipe: Stuffed Peppers\n\nCredit... Bryan Gardner for The New York Times. Food Stylist: Barrett Washburne.\n\nReady in: 25 minutes\n\nThese mash-up meatballs from Ifrah F. Ahmed are not at all traditional, but I mean that in the best possible way. Parmesan and berbere seasoning, the fenugreek-and-chile spice mix used in Ethiopian and Eritrean cuisines, give them a hit of umami and heat.\n\nRecipe: Berbere Meatballs\n\nAdvertisement\n\nCredit... Christopher Testani for The New York Times. Food Stylist: Simon Andrews.\n\nReady in: 45 minutes\n\nI make this soup from Melissa Knific at least once a month with the dregs of my freezer and refrigerator, and it never disappoints. It’s belly-warming and wholesome — exactly what I want to eat when I can smell snow in the air.\n\nRecipe: Hamburger Soup\n\nCredit... Chris Simpson for The New York Times. Food Stylist: Maggie Ruggiero. Prop Stylist: Sophia Eleni Pappas.\n\nReady in: 35 minutes\n\nEric Kim revives another school cafeteria classic: Salisbury steak. Not really a steak at all, but patties of ground beef that have been mixed with Worcestershire sauce, ketchup, brown sugar, bread crumbs and egg and then flattened and browned in a skillet and topped with a mushroom-onion gravy. Serve over mashed potatoes for the ideal comfort meal.\n\nRecipe: Salisbury Steak\n\nCredit... Armando Rafael for The New York Times. Food Stylist: Cyd Raftus McDowell.\n\nReady in: About 1 hour and 15 minutes\n\n“This is one of those recipes where when we took our first bite, my husband and I just looked at each other with wide eyes. It is SO delicious!” wrote a reader about Lidey Heuck’s Morrocan-inspired shepherd’s pie, in which a savory-sweet filling of ground lamb, chickpeas, dates, cumin and smoked paprika is topped with mashed sweet potatoes.\n\nRecipe: Sweet Potato Shepherd’s Pie\n\nAdvertisement\n\nCredit... Kelly Marshall for The New York Times. Food Stylist: Samantha Seneviratne.\n\nReady in: 35 minutes\n\nThis recipe from Carolina Gelen takes all the ingredients of a cabbage roll — meat, rice, cabbage — and turns them into a warming weeknight meal. As a shortcut, she calls for using store-bought sauerkraut, which adds dimension and tang, but you can also use fresh cabbage and a touch of vinegar to get similar results.\n\nRecipe: One-Pot Cabbage Roll Soup\n\nCredit... Ryan Liebe for The New York Times. Food Stylist: Brett Regot.\n\nReady in: 20 minutes\n\nThis quick, protein-rich traditional Chinese soup from Cybelle Tondu features ground beef, egg whites, mushrooms and tofu in a warming gingery broth. It is comfort in a bowl.\n\nRecipe: West Lake Beef Soup\n\nCredit... Craig Lee for The New York Times\n\nReady in: 30 minutes\n\nA reader favorite from Mark Bittman with more than 4,000 reviews, this is the kind of dish you can throw together in a snap. Just brown the ground beef, season with cumin, garlic and chile, and then toss in some chickpeas and cook until they pop and split apart. Serve over rice and be very pleased with yourself.\n\nRecipe: Crispy Chickpeas With Beef\n\nAdvertisement\n\nCredit... Ryan Liebe for The New York Times. Food Stylist: Brett Regot.\n\nReady in: 45 minutes\n\nPick up a package of those really big flour tortillas and make a Taco Bell Crunchwrap Supreme at home, using this recipe from Alexa Weibel as a guide. Folding them up like little presents is almost as fun as eating them.\n\nRecipe: Crunchy Queso Wrap\n\nCredit... Christopher Testani for The New York Times. Food Stylist: Simon Andrews.\n\nReady in: 45 minutes\n\nThis recipe from Paola Briseño-González takes inspiration from chorizo verde, which is a green chorizo popular in Central Mexico. Here, ground beef stands in for pork, and a combination of roasted poblano chiles, herbs and spinach gives it a vibrant green hue. Stir the beef filling into crispy potatoes for classic chorizo con papas or tuck it into quesadillas.\n\nRecipe: Chorizo Verde Tacos\n\nFollow New York Times Cooking on Instagram, Facebook, YouTube, TikTok and Pinterest. Get regular updates from New York Times Cooking, with recipe suggestions, cooking tips and shopping advice.",
  "authors": [
    "Margaux Laskey"
  ],
  "url": "https://cooking.nytimes.com/article/ground-beef-recipes"
}