{
  "title": "Why Our Collective Queer Rage Matters In A Post-Roe Era",
  "text": "Ever since it became evident that the right to a safe abortion was going to get the boot, experts have been speculating that marriage equality could be next. Despite the reality that many queers reject the idea of marriage altogether, the fact that our right to marry is even up for debate proves that queer people are still not deemed equal citizens. No matter how many commercials you put us in, queer people still face the daily risk of hate-based violence, abuse, addiction and suicide. All of these harsh realities made this past June, aka corporate rainbow-washing season, feel like an exhausting performance of mass cognitive dissonance.\n\nFor many of us, participating in Pride™ now requires a type of queer double consciousness. What used to be a celebration of and for queer communities now includes a deeply performative element that uses us as a viable market demographic in a capitalistic culture that is — seemingly — never actually going to see us as valid members. I’m so tired of prancing in parades to win acceptance into cis-het society that I skipped it this year. I refuse to masquerade in respectability drag to be a more palatable mascot. My identity is not brandable content.\n\nPride hasn’t always been this way. It was different when the summer glitter parades really were just for queer people, but now they’re for everyone. And while that sounds nice in theory, “allied” sponsors have begun to take up so much space in our parades that it doesn’t feel like there’s enough room for the complexity of our experience anymore. It’s not too late to take back our stolen celebration. But if we want what is rightfully ours, we must tap into our rage.\n\nAdvertisement\n\nA few years ago, Them Magazine dubbed July “Queer Wrath Month.” It finally seems like it’s catching on. Maybe it’s finally sunk in that we can take nothing for granted in this post-Roe hellscape and we might want to start fighting for our rights before they begin to dissipate. We can’t glitter-gloss over the fact of our threatened existence and we can’t sashay our way out of prison. Not only do we as queer people need to enthusiastically embrace our rage in this post-Roe moment, we need everyone who reaps the rewards of our long struggle for liberation to get pissed and fight with us.\n\nYou don’t have to work very hard to find the queer battles already being fought with force — you just have to look past the mainstream headlines. In May, as normies obsessively planned their Pride itineraries, queer activists in Louisiana were locking their bodies in solidarity to protest the state’s vote to ban trans women and girls from playing on female school sports teams. Protesters from The Real Name Campaign — a New Orleans-based grassroots group that fights for trans people in Louisiana — occupied the state Capitol until they were forcibly removed by security guards.\n\nWhen the Supreme Court overturned Roe v. Wade, thousands of queer people (and real allies) opted out of Pride parades and organized abortion rights protests instead. And some Pride parades in major cities such as New York and Chicago turned into equal parts gay parade and abortion rights protest. Not only is the coexistence of joy and rage the real spirit of what Pride means, it’s also a reminder that we don’t have to choose between recognizing what we have and demanding what we need.\n\nAdvertisement\n\nPeople stop for a moment of silence and raise their arms at the 30th Annual New York City Dyke March on June 25 in New York City. People also protested against the Supreme Court overturning the 50-year-old landmark Roe v. Wade decision ending federal abortion protection. Alexi Rosenfeld via Getty Images\n\nSmall groups of focused gays are already leading the fight against our government’s tepid response to the emerging monkeypox crisis. To be clear, monkeypox is not a “gay disease” — nor does such a thing exist — but queer people are being disproportionately impacted by the virus. Alice B. Toklas LGBTQ Democratic Club, the oldest queer democratic society in the U.S., recently took action at the Department of Health and Human Services headquarters in San Francisco to demand a more robust response to monkeypox.\n\nThe truth is that we have a lot to be angry about right now, and rage has been proven to shift tides. Queer and trans people know that any threat to the bodily autonomy of any human is a threat to us all, and we know what kind of tragedy awaits when a virus that could infect anyone gets dubbed a “gay disease.” We also know how to channel our outrage into action.\n\nAdvertisement\n\nRight now, it may seem like unicorns dominate queer culture, but that’s just what looks good on TV. Queer people are not just gorgeous mythical creatures, we are also rebellious and dangerous when oppressed. Right now, queer activists are organizing to fight against oppressions new and old, and we are unwilling to smile gayly in the face of oppression. To be clear, I am not gay as in happy. I am queer as in fuck the police.\n\nLook, I know that some people are turned off by the energy of rage. We’ve been told our whole lives that anger is bad and should stay under wraps. But the fundamentally binary logic underlying the notion that a natural human emotion is bad and should be repressed is the same logic that undergirds systemic oppression.\n\nRage is not the opposite of love. In fact, my outrage in this post-Roe moment is 100% fueled by love. I love women and I love trans people and I love queers, and that love is not just hearts and flowers. It’s also fierce and not to be trifled with.\n\nAdvertisement\n\nOur queer rage could be not just a weapon in the fight for liberation, but also an antidote to the apathy so many of us have been hypnotized into by the (failed) promises of acceptance and equality. No matter what the white cis heteropatriarchy tells you about anger being a toxic emotion, it’s all just sedative blather. Queer history is mired in resistance and yet our rage has never destroyed us. Instead, our collective anger when channeled, has always given us the energy we need to come together and protect our lives and our liberation.\n\nIf we stay grounded in love and rise up in rage, we can render our wrath into something that is both a weapon and a salve. We all know the first Pride was a riot, but the second was both a protest and a celebration. We can have acceptance and liberation. But only if we are willing to fight for it.\n\nIn the earlier days of the queer liberation movement, we had to force ourselves into the spotlight. First we had to fight for basic human rights and then we had to fight for the world to like us. Well, now everybody’s gay, but the fight isn’t over. The price we paid for assimilation into respectable society can’t be our souls. No shade to Lizzo (like never ever) but if you’re not angry as hell right now, you’re not gay and you’re not an ally. You’re just a mid in glitter.",
  "authors": [
    "Contributing Writer"
  ],
  "url": "https://www.huffpost.com/entry/queer-rage-post-roe-v-wade_n_62e7e96ae4b09d14dc44fec8"
}