{
  "title": "COP30: India's delayed action plan raises eyebrows at UN climate summit",
  "text": "India's delayed action plan raises eyebrows at COP30 climate summit\n\nAt this year's UN climate summit (COP30), under way in Brazil's Belem city, all eyes are on India - the world's third largest carbon emitter.\n\nIndia has not yet submitted a key climate plan that countries are required to do every five years, even as international assessments have deemed India's climate action as being \"worryingly inadequate\". Delhi has argued otherwise.\n\nKnown as Nationally Determined Contributions (NDCs), the updated plan from each member country to the UN Framework Climate Convention (UNFCC) is expected to have more ambitious carbon reduction targets as the world has failed to make the required level of cuts to avoid dangerous global warming.\n\nSo far, around 120 of the 196 member countries of the UNFCCC have submitted their updated plans and India is among the remaining ones.\n\nThe Paris climate agreement signed in 2015 has the goal of limiting average global temperature rise to well below 2C and to strive for 1.5C to avert drastic climate change.\n\nThe United Nations Environment Programme (UNEP) says that by 2035, annual emissions will have to be reduced by 35% and 55%, compared with 2019, to align with the goals of the Paris agreement.\n\nBut emissions have continued to rise almost every year since then, and the climate plans submitted to the UNFCCC until 10 November show that there will be emissions reduction of only around 12% by 2035 – that too if countries fully implement their policies.\n\nUNEP warns that current emission policies put the world on track for 2.8C of warming this century, underscoring the need for far more ambitious carbon-cutting targets.\n\nThe first deadline for the updated climate plan (NDC3) was February, but it was extended until September as more than 90% of member countries failed to meet it.\n\nAll eyes were on top emitters like China, India and the European Union, also because US President Donald Trump once again announced his country's exit from the Paris agreement, leaving the world wondering if other major emitters would offer to plug the gap.\n\nBut many countries missed the September deadline too. While some began to submit their plans before COP30, there were expectations that the remaining would do so during the climate meet in Belem.\n\nSome have done so, but India kept the world guessing until environment minister Bhupender Yadav, who led the country's delegation in Belem, told the media this week that Delhi would submit its plan only by the end of December.\n\nSo, why has India delayed submitting its climate plan, even though it could mean inviting negative press during COP30?",
  "authors": [],
  "url": "https://www.bbc.com/news/articles/cy8v8k8mlego"
}