{
  "title": "Elon Musk’s SpaceX will build NASA’s lunar lander",
  "text": "is a reporter who writes about tech, money, and human behavior. She joined The Verge in 2014 as science editor. Previously, she was a reporter at Bloomberg.\n\nPosts from this author will be added to your daily email digest and your homepage feed.\n\nNASA picked Elon Musk’s SpaceX to receive $2.9 billion to build a lunar lander as part of the Artemis mission to send humans to the Moon by 2024, the agency announced today. It’s a major vote of confidence in SpaceX from NASA — as no other company received money. The contract between NASA and SpaceX is expected to be signed on May 1.\n\nFour astronauts will launch on NASA’s Space Launch System, aboard the Orion spacecraft. From there, two people will then transfer to SpaceX’s lunar lander. They’ll spend about a week exploring the surface of the moon, then get aboard the lander and head back to Orion. SpaceX will have to do an uncrewed flight of the lander before any humans come aboard, though.\n\nGiving the contract to SpaceX alone is a slap in the face to Blue Origin\n\nThe SpaceX contract is for an uncrewed flight and a single crewed landing. Subsequent landings will be awarded under a follow-up procurement program. NASA said it would begin talking with the industry about the follow-up program next week.\n\nThere were three major contenders for the project. SpaceX beat out Jeff Bezos’ Blue Origin, working with a selection of other aerospace companies, and Dynetics, a defense contractor. NASA had previously rewarded all three contenders with a combined $967 million to develop lunar lander concepts.\n\nThe Washington Post first reported that SpaceX won the contract, before the NASA announcement. In an internal letter to NASA employees, obtained by The Verge, Human Lander Selection program manager Lisa Watson Morgan says she’s “very disappointed that information was leaked prior to the event today... I am sorry you had to find out about it that way as well.”\n\nNASA was expected to pick two companies to receive contracts for the first Moon landing mission since the Apollo program. So giving the contract to SpaceX alone is a slap in the face to Blue Origin in particular — and its team, which included Lockheed Martin and Northrop Grumman. In the commercial crew program, for instance, both Boeing and SpaceX received contracts. The redundancy gave NASA options in case one of the companies didn’t deliver.\n\n“There is important work for us ahead, just not at the funding levels we initially expected.”\n\n“There is important work for us ahead, just not at the funding levels we initially expected,” Morgan wrote in her email. With only one partner, the number of people who work on the program will also be reduced, she wrote. The agency chose to award only one partner in order to get the program running quickly.\n\nThe SpaceX bid was Starship, the next-generation spacecraft the company is building in Boca Chica, Texas. It’s expected to be able to carry a crew of astronauts and 100 tons of cargo. Starship is supposed to use its main engines to lower itself to a hard surface, such as the Moon or Mars. SpaceX has successfully landed Starship once on March 3rd, though it blew up almost immediately afterward. Another landing attempt, on March 30th, also ended in flames.\n\n“The human landing system is going to allow us to be able to access different parts of the lunar surface,” said Kathy Lauders, the associate administrator for NASA’s Human Exploration and Operations Mission Directorate, in a NASA livestream. “It also allows us to explore new technology and capabilities that will help us when we are trying to figure out our next round of technologies to be able to help us land on Mars or other planets out there.”\n\nThe Artemis mission will land the first woman on the Moon, as well as the first person of color. (So far, only white men have walked on the lunar surface.) In November, the 18 astronauts who were part of the Artemis team were introduced.\n\nPresident Joe Biden’s 2022 budget request includes $24.7 billion meant for NASA, and he’s nominated former senator Bill Nelson as NASA chief.\n\nWith reporting by Joey Roulette.\n\nUpdate 4:43PM ET: Adds details on the program, and email from HLS program manager Lisa Watson Morgan.",
  "authors": [
    "Elizabeth Lopatto"
  ],
  "url": "https://www.theverge.com/2021/4/16/22387887/elon-musk-spacex-win-nasa-lunar-lander-contract-artemis"
}