{
  "title": "Hands-free home security is here, thanks to ADT and Google — but it’ll cost you",
  "text": "is a senior reviewer with over twenty years of experience. She covers smart home, IoT, and connected tech, and has written previously for Wirecutter, Wired, Dwell, BBC, and US News.\n\nPosts from this author will be added to your daily email digest and your homepage feed.\n\nMy front door unlocks automatically as I walk up to it, and the home security system disarms itself — no code or app required. The system has recognized me using the Google Nest Doorbell’s Familiar Faces, and confirmed I’m me using my phone’s location. The dual-factor authentication triggers the automatic disarming and unlocking, so all I have to do is walk inside.\n\nThis hands-free Auto Unlock experience is powered by ADT Plus, the newest security system from America’s oldest security company. It features the usual hardware — a base, sensors, and various accessories — but represents a major upgrade from fumbling for keys or racing to silence a beeping keypad.\n\nI hate that “beeping pressure” home alarm systems put on you, so I tend to avoid turning them on. But ADT’s Auto Unlock, along with other automated features the system offers, has meant I’ve found myself using it much more consistently than any security system I’ve tested. That alone makes it better.\n\nA home that responds to you automatically, without requiring you to bark commands, punch in codes, or fiddle with apps, is the future of the smart home. The most surprising part is that this is coming from a legacy security company like ADT (with help from Google). Less surprising is that you have to pay ADT prices for this convenience.\n\n6 Verge Score ADT Plus Home Security System $ 199 $ 199 The Good Auto Unlock is very useful\n\nLots of automated options for arming / disarming\n\nTrusted Neighbors is interesting tech\n\nFully integrated with Google Home / Nest Cams\n\nZ-Wave support\n\nCan be self-installed The Bad Expensive with complicated contract pricing\n\nNo self-monitoring option\n\nOnly works with newer-gen Nest cams\n\nNeed Google Home app for recorded video\n\nNo support for Amazon Alexa, Apple Home $199 at ADT How we rate and review products\n\nNeighborhood watch goes high-tech\n\nA high-tech, innovative security system, ADT Plus is the company’s first complete product that can be self- or pro-installed. Both versions offer 24/7 professional monitoring for a monthly fee, which can include video verification through any connected Nest cameras. The key difference is that having pros come install the devices will lock you into a three-year monitoring contract, but there’s no required contract if you self-install (more on pricing later).\n\nIf you’re a Google Home user, it’s your best option for a professionally monitored security system\n\nI’ve been testing ADT Plus for a few months, and I’ve been impressed by its tight integration with Google Nest products (including Nest thermostats), vastly improved security hardware, and intuitive app.\n\nIf you’re a Google Home user, it’s your best option for a professionally monitored security system. But if you use any other smart home platform — such as Apple Home or Amazon Alexa — there are better-integrated options from companies like Abode and Ring, respectively. ADT Plus is only compatible with Google Home. Also, if you’re averse to high-cost monitoring packages, you should look elsewhere — for the full feature set I tested, ADT Plus will set you back $40 a month.\n\nThe Yale smart lock and the Google Nest doorbell connect to ADT Plus to confirm who is approaching the home and automatically unlock and disarm the system for authorized users.\n\nThe standout feature of ADT Plus is its compatibility with Google’s Nest cameras, which leverages the camera’s advanced AI capabilities to identify packages, people, pets, vehicles, and more. While most security companies manufacture their own cameras, and mostly poorly, ADT’s integration with the excellent Nest cams is a significant bonus.\n\nThe Nest doorbell specifically helps power Auto Unlock and a unique feature called Trusted Neighbor. This uses the same principles as Auto Unlock, but instead of only allowing in residents of the home, it can unlock the doors (and deactivate the alarm) for any approved person based on set parameters.\n\nFor example, if a package is delivered while you’re away, ADT can send a notification to a designated neighbor. The system then opens a temporary access window, allowing them to put the package inside. It unlocks the door and disarms the alarm when they arrive, using their phone and optional facial recognition to confirm it’s them. You can also choose to have them authenticate with their phone via the ADT app (which they’ll need to download to be a Trusted Neighbor). When they leave, the system automatically relocks and rearms.\n\nAlong with package alerts, the system can notify a neighbor when the Nest Doorbell spots an animal (useful if they have an escape artist puppy like mine), a person, a vehicle, or any motion. It can also be set to tell them if the burglary alarm or any life safety alarm goes off (such as smoke or CO). The homeowner gets all these alerts as well, but only the last two notify ADT’s monitoring center.\n\nPrevious Next\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n1 / 9 Screenshots of the onboarding process for a Trusted Neighbor, showing the permissions you can grant and the different events to which they can respond. The neighbor downloads a light version of the app.\n\nBut yes, it is probably easier to just give your neighbor the code to your door lock (which you can set to disarm the system) and then send a text message asking them to put the package inside. They might even be more comfortable with that, since they won’t have to download ADT’s app or add their photo to your Google Nest Familiar Faces database. But the advantage of using Trusted Neighbor’s system is that they’ll receive alerts and can respond to any issues at your house if you’re away and not checking your phone.\n\nI also like that you can assign different incidents to different people. So, while my elderly next-door neighbor is my go-to for packages and missing pets, I want my dad, who lives a couple of minutes away, to be notified if someone breaks in or there’s a water leak in the kitchen.\n\nIn the ADT Plus app, I can set parameters for every “trusted neighbor” and assign them a specific time window for access. There’s also the option to add a “Helper or Guest,” who won’t get any alerts but can use the auto-unlocking / disarming feature.\n\nIn testing, both Auto Unlock and Trusted Neighbor worked reliably with the Google Nest Doorbell, but took a few seconds to unlock after the authorized person arrived at the door. I have this issue with most auto-unlock services (several smart locks have this feature, although they don’t also disarm your security system). I have poor GPS and cell service at my home, which seems to slow them down — your mileage may vary.\n\nThe advantage is your neighbors receive the same alerts and can respond to issues if you’re away and not checking your phone\n\nWhile both systems worked eventually, if I was in a hurry and didn’t want to wait a couple seconds, I just ended up typing the code into the lock. (I tested the regular keypad Yale lock, but the Yale Assure 2 Touch is also compatible, so you can use your fingerprint to unlock and disarm.)\n\nWhile I used Auto Unlock all the time, Trusted Neighbor wasn’t useful to me — I live in a safe neighborhood, I never have to deal with package thieves, and my neighbors all have the code to my door. I was also worried that it would mistake a delivery driver for my neighbor or me (Google Nest’s Familiar Faces constantly confuses me with the UPS guy). But because it also requires them to have their phone with them, that wasn’t an issue. I had my neighbor test it with me for a while, but she quickly got annoyed by all the notifications (I receive a lot of packages!). However, I can see the value.\n\nThe biggest issue is that Trusted Neighbor is very expensive — the top-tier $40 subscription is required, and, depending on the package you purchase, you may be committed to a three-year contract (more on this later) — which amounts to around $1,500. Of course, that includes 24/7 professional monitoring, which is an expensive feature with most security systems.\n\nTheoretically, you could set up something similar with other smart home systems. Aqara, for example, has facial recognition on its video doorbells that could be set to unlock an Aqara smart lock and tell an Aqara security system to disarm. But it won’t notify your neighbor as ADT does, and there’s no professional monitoring.\n\nWhat ADT is doing here is a great example of how — when it all works together — smart home tech can make your life easier. And while I think Trusted Neighbor is too expensive for what it does today, ADT tells me it plans to add more features in the future. I also think we’ll start to see other companies leveraging these types of integrations.\n\nADT’s glow-up\n\nThe ADT Base has a built-in keypad that lights up as you approach. It’s clear and easy to use with tactile buttons and lots of shortcut options.\n\nNovelty features aside, ADT Plus still has to prove itself on the basics — hardware, ease of use, and price. A standard home security system, it includes a central base that communicates to door and window sensors, motion sensors, glass break sensors, a keyfob, and smoke, CO, heat, and leak detectors, among other accessories. (There’s no compatibility with the Nest Protect.)\n\nADT has ditched its third-party manufactured sensors and 433MHz RF protocol in favor of building its own devices (with the help of Nest engineers) on a new communication protocol, DECT ULE (Digital Enhanced Cordless Telecommunications Ultra Low Energy).\n\nDECT is best known as the radio frequency for cordless phones, but DECT ULE brings low power capabilities and long range, making it a good option for battery-powered IOT devices like sensors. It has two-way communication capabilities, which allow for ADT Plus’ deeper integration with smart home devices compared to a lot of professionally monitored security systems.\n\nPrevious Next\n\n1 / 2 The ADT Plus motion sensor. Photo by Jennifer Pattison Tuohy / The Verge\n\nThe base is the brain of the system, and includes Thread and Z-Wave radios along with Wi-Fi, cellular, Bluetooth, and DECT ULE. This allows you to connect Z-Wave smart home devices like lights and locks and control them in the ADT Plus app. Thread isn’t in use yet, but ADT CTO Gilles Drieu, the former director of engineering at Google Nest, tells me they are exploring Matter integration.\n\nThe cheapest ADT Plus starter kit includes a base and a single sensor for $270. There are often deals on packages for as low as $199, but these have fewer sensors than the less expensive starter kits from Ring and SimpliSafe. The Beginner’s Kit adds three sensors and a motion detector for $350 and prices increase quickly from there, with packages that include Nest cameras starting at around $700 before discounts.\n\nI tested the $740 Front Door Protection package (currently on sale for $289, which is a very good deal). This adds a Nest video doorbell (battery) and a Yale Assure 2 Z-Wave lock, both of which you need to use Familiar Faces with Trusted Neighbor. You can also add any Google Nest cameras you already have to the system (although only the doorbell works with Trusted Neighbor), as long as they are a supported model. That doesn’t include older-gen Nest cams, but ADT tells me it will soon include Google’s newest cameras, which launched this month.\n\nNo Nest\n\nThe new ADT hardware is a significant upgrade from the company’s previous iterations (anyone remember Blue?), but while it resembles the Nest Secure hardware, it’s nowhere near as nice.\n\nThe Base is much larger than the Nest Guard base, and while it lights up as you approach, there’s no option for NFC tap to disarm as there was with Nest (although with Auto Unlock, that feature is largely moot). The standard door/window sensors are basic, chunky contact sensors.\n\nIf you want any of the features of the old Nest Detect sensors, you have to upgrade to the Premium sensor ($40 each), which adds the neat bypass button that lets you disarm the sensor so you can open the door without triggering the alarm. But there’s no built-in motion detection or night light as with the Detect. Instead, you need a separate motion sensor, which is also large but has a nice, rounded design. The sensors all reacted instantly.\n\nThe Premium door sensor features a bypass button, but none of the Nest Detect’s other neat additional features.\n\nThe integration with the Z-Wave Yale Assure 2 lock lets you disarm the system when you unlock the door (even if you don’t use Trusted Neighbor), a feature the Nest X Yale Lock had with Nest Secure. But this only works with the Yale Assure 2 locks (fingerprint or non-fingerprint version), not any other Z-Wave lock you connect to the system. (and you can connect a number of different Z-Wave devices, like lights and thermostats.)\n\nOverall, ADT Plus is not a like-for-like replacement for Nest Secure, but it’s a good smart home security system with innovative and useful features. There’s a one-touch arming button on the base station, and when you hover your hand over the keypad, the shortcuts for arming and disarming show up.\n\nPrevious Next\n\n1 / 2 The ADT Plus app homepage allows for control of the Yale smart lock and quick access to disarm and arm the system. You can also view live feeds from connected Nest cameras, but you need to use the Google Home app for recorded video.\n\nThe ADT app is clean and easy to use, with lots of customization options. I like that I could set up rules to automatically arm and disarm the system based on time of day and Home / Away Status (using my phone’s location and the ADT app, not Google’s Home & Away feature). It pulls in live feeds of connected Google Nest cameras (no recorded video, though) and sends the same alerts for people, packages, animals, and vehicles. (Yes, exactly the same alerts. I had to disable camera alerts in Google Home to avoid the double pings.)\n\nYou can use ADT’s sensors in the Google Home app as triggers for automations. I set an automation to turn on the lights when I open the door, and it responded instantly. Plus, you can arm and disarm the system from a Nest Hub — though weirdly, you can’t do this via the Google Home app. While you can do a lot in the ADT Plus app and vice versa, you can’t control everything in one — specifically around video — so you do have to use both apps, which is tiresome.\n\nThe contract catch\n\nADT Plus’ features are forward-thinking and impressive, but its pricing system is stuck in the past. Reddit is littered with complaints about ADT’s contract practices and steep cancellation fees. My advice is to avoid getting into a monitoring contract. They are for 36 months (24 in California), and you can’t cancel or go month-to-month for monitoring until the term is up. If you do, you’ll face an early termination fee “typically 75 percent of the remaining balance,” according to ADT. The best way to avoid one is to opt for self-setup (pro-installation requires a contract) and to pay for your equipment outright.\n\nHowever, you will want professional monitoring, as ADT Plus doesn’t function as a self-monitored system; you cannot arm and disarm using the app without paying $25 a month for the lowest monitoring package. But that doesn’t let you set up any automations. For that, you need the Smart package for $30 a month. Want to see recorded video from any of your cameras? You’ll need to pay $35 a month to incorporate a Nest Aware subscription (not Google Home Premium, yet). Want smart automations, recorded video, and Trusted Neighbor? That’s $40 a month.\n\nA comparable Ring Alarm subscription for professional monitoring, recorded video, and some AI features will set you back $35 a month, around $25 a month for Arlo. SimpliSafe is about $32, although if you add its AI and live monitoring, it goes up to $50. The cheapest option is probably Abode at around $25, but without any advanced AI features.\n\nADT Plus’ ability to combine Nest cameras and Yale smart locks with its security system makes for smarter home security\n\nADT Plus is a big step into the future for this legacy security company, finally combining smart home convenience with advanced home security in innovative and useful ways. However, its contract system is still stuck in the past. If you can buy a system without being locked into a three-year commitment — and you like using Google Home and its Nest cameras — ADT Plus is a good, albeit expensive, smart security solution.\n\nPhotography by Jennifer Pattison Tuohy / The Verge",
  "authors": [
    "Jennifer Pattison Tuohy"
  ],
  "url": "https://www.theverge.com/tech/803867/adt-plus-home-security-google-nest-smart-home"
}