{
  "title": "Alice Guo, Chinese national who ran huge scam centre while Philippines mayor, sentenced to life in prison",
  "text": "Alice Guo, a Chinese national who became a mayor in the Philippines while masquerading as a Filipina, has been sentenced to life in prison along with seven others on human trafficking charges, state prosecutors have said.\n\nGuo, who served as mayor of a town north of Manila, was found guilty of overseeing a Chinese-operated online gambling centre where hundreds of people were forced to run scams or risk torture.\n\nThe sprawling complex – which included office buildings, luxury villas and a large swimming pool – was raided in March 2024 after a Vietnamese worker escaped and called police.\n\nMore than 700 Filipinos, Chinese, Vietnamese, Malaysians, Taiwanese, Indonesians and Rwandans were found on site, along with documents allegedly showing that Guo was president of a company that owned the compound.\n\nAll eight defendants, some of whom were foreign nationals, were sentenced to life in prison, state prosecutor Olivia Torrevillas said outside a regional courthouse in Manila.\n\n“After over just one year, the court ... gave us a favourable decision. Alice [Guo] was convicted along with seven other co-accused. Life imprisonment,” Torrevillas said, declining to name Guo’s co-defendants due to a confidentiality law.\n\nA spokesperson for the Philippine Anti-Organised Crime Commission told reporters in a group chat that Guo and three others had been convicted of “organising trafficking” inside the compound.\n\nFour more were found guilty of “acts of trafficking”, the spokesperson said.\n\nGuo, 35, was arrested by Indonesian police in September 2024 after fleeing the Philippines.\n\nAlthough she was elected mayor of Bamban town, the site of the scam centre, a Manila court ruled in June that as a Chinese citizen Guo was never eligible for the position.\n\nThe Chinese embassy on Thursday did not immediately return calls seeking comment.\n\nThe transnational scam industry has ballooned in south-east Asia in recent years, with thousands of scammers estimated to be involved. Victims in the wider region were conned out of up to $37bn in 2023, according to a UN report, which said global losses were likely “much larger”.\n\nThe centres flourished in the Philippines under then president Rodrigo Duterte after the government regulator was given the right to issue operating licences nationwide.\n\nPresident Ferdinand Marcos Jr announced a ban on offshore gambling operations amid mounting public fury over the Guo case in 2024, ordering foreign nationals working at the sites out of the country.",
  "authors": [],
  "url": "https://www.theguardian.com/world/2025/nov/20/alice-guo-chinese-national-who-ran-huge-scam-centre-while-philippines-mayor-sentenced-to-life-in-prison"
}