{
  "title": "21 Easy Pumpkin Desserts to Make With the Canned Pumpkin You Impulse Bought",
  "text": "Advertisement\n\n21 Easy Pumpkin Desserts to Make With the Canned Pumpkin You Impulse Bought Bake pumpkin bread, pumpkin cookies and more fall-flavored treats, many of which can be made in about an hour. Credit... Rachel Vanni for The New York Times. Food Stylist: Simon Andrews.\n\nIn this house, we love pie. But canned pumpkin purée can be used for so much more: Cakes! Cookies! Cheesecakes! It’s an incredibly versatile pantry ingredient that shouldn’t be slept on. Whether you’re craving something warm and spiced, light and creamy, make-ahead or kid-friendly, these 21 easy recipes prove that a can of pumpkin can go a long way.\n\nCredit... Christopher Testani for The New York Times. Food Stylist: Eugene Jho.\n\nThe beauty of pumpkin bread lies in its versatility: enjoy it plain, with a cup of afternoon tea; throw in more spices like nutmeg and cloves; toss in a handful of chopped bittersweet chocolate or nuts; or scatter some pepitas over the top. Samantha Seneviratne likes to add a simple cream cheese glaze. Whatever you choose, you really can’t go wrong.\n\nRecipe: Pumpkin Bread\n\nAdvertisement\n\nCredit... Rachel Vanni for The New York Times. Food Stylist: Spencer Richards.\n\n“Everyone loved this recipe, especially my 4-year-old. And I loved that it was easy to make,” one reader wrote. Studded with white chocolate and butterscotch chips, these blondies from Annie Marshall of Everyday Annie, adapted by Margaux Laskey, are fudgy like a brownie (but also light!) thanks to the pumpkin purée. Add nuts if you wish, and remember to chill it a bit before cutting to get clean, even squares.\n\nRecipe: Pumpkin Blondies\n\nCredit... Armando Rafael for The New York Times. Food Stylist: Yossy Arefi.\n\n“These are stunning. Like a warm hug. Or the perfect leaf crunch. Or the smell in the air on Oct. 30,” one reader wrote about Yossy Arefi’s chewy, cakelike cookies. The cookies are wonderful on their own, but a bit of pumpkin spice frosting (with more of that pumpkin purée!) makes them even better.\n\nRecipe: Pumpkin Oatmeal Cookies\n\nCredit... Rachel Vanni for The New York Times. Food Stylist: Simon Andrews.\n\nThis icebox cake from Yossy Arefi proves that you don’t have to turn on your oven to make a perfect autumnal dessert. Just whip, then flavor heavy cream with a pumpkin spice blend, fold in a can of pumpkin purée, layer the mixture with speculoos or gingerbread cookies, and chill until the cookies are soft enough to slice through.\n\nRecipe: Pumpkin Icebox Cake\n\nAdvertisement\n\nCredit... Rachel Vanni for The New York Times. Food Stylist: Simon Andrews.\n\nMarble cake, but make it autumn. One batter yields two distinct flavors in this recipe from Kayla Hoang. A cinnamon-spiced pumpkin batter acts as the base of the loaf, while Dutch-process cocoa powder flavors the chocolaty swirl. Sour cream produces a soft, plush crumb that stays moist for days.\n\nRecipe: Pumpkin Marble Loaf\n\nCredit... Rachel Vanni for The New York Times. Food Stylist: Samantha Seneviratne.\n\nBrowned butter takes Samantha Seneviratne’s adorable treats to the next level. When added to batter and baked, the nutty flavor of browned butter can easily get lost. So here, it’s whipped into a cream cheese frosting and sandwiched between two fluffy, spiced pumpkin cakes.\n\nRecipe: Mini Pumpkin Spice Whoopie Pies\n\nCredit... Linda Xiao for The New York Times. Food Stylist: Monica Pierini.\n\nSue Li’s pumpkin cheesecake bites are inspired by Japanese soufflé pancakes, which call for whipped egg whites to create a fluffy, cloudlike texture. (Just make sure the cream cheese is room temperature to avoid lumps.) Baked in a cupcake pan, then chilled, serve these naturally gluten-free desserts with a dollop of whipped cream and a sprinkle of ground cinnamon.\n\nRecipe: Pumpkin Spice Cheesecake Bites\n\nAdvertisement\n\nCredit... Linda Xiao for The New York Times. Food Stylist: Samantha Seneviratne.\n\nSamantha Seneviratne’s pumpkin roll is so pretty and so riffable. Her recipe calls for a soft and airy, cinnamon-scented cake with buttercream filling. But feel free to play: Fold in chopped chocolate, toasted coconut, raisins or your favorite nuts; or flavor the buttercream with bits of candied ginger, molasses, maple syrup or honey. You could even swap the buttercream altogether and fill the cake with cream cheese frosting or a simple whipped cream.\n\nRecipe: Pumpkin Roll\n\nCredit... Julia Gartland for The New York Times. Food Stylist: Ali Slagle.\n\nAlison Roman’s sweet, lightly spiced muffins are very orange, thanks to the addition of ground turmeric in the pumpkin-maple batter. To get that deeply caramelized fall flavor, she browns the butter as well. The easy recipe is great for any skill set, as one reader put it: “I’m not a baker, but I will definitely be making this again.”\n\nRecipe: Pumpkin Maple Muffins\n\nCredit... Yossy Arefi for The New York Times (Photography and Styling)\n\nVallery Lomas’s fuss-free (no electric mixer required!) recipe is loaded with pumpkin pureé and flavored with classic fall spices. Once out of the oven, the orange-colored doughnuts are finished with a simple and forgiving vanilla glaze that sets beautifully. While the recipe calls for a doughnut pan, you can also bake these in a muffin pan.\n\nRecipe: Baked Pumpkin Doughnuts\n\nAdvertisement\n\nCredit... Rachel Vanni for The New York Times. Food Stylist: Simon Andrews.\n\nThe pumpkin in Yossy Arefi’s pumpkin bread pudding isn’t in the bread, but in a silky pumpkin custard that coats pillowy challah or brioche. The recipe makes use of an entire can of pumpkin pureé, so you don’t need to worry about having leftovers. Bake it for brunch or as a cozy dessert with a dollop of cinnamon whipped cream.\n\nRecipe: Pumpkin Bread Pudding\n\nCredit... David Malosh for The New York Times. Food Stylist: Simon Andrews. Prop Stylist: Megan Hedgpeth.\n\nCan't decide between pumpkin or pecan pie? How about both (but also neither) in the form of Sohla El-Waylly’s spiced pumpkin cake slathered in brown-sugar caramel and topped with toasted pecans. The oil-based cake stays moist for days, thanks to the addition of corn syrup.\n\nRecipe: Pumpkin Pecan Sheet Cake\n\nCredit... Rachel Vanni for The New York Times. Food Stylist: Simon Andrews.\n\nThe ideal pumpkin cookie should be a little bit chewy and a little bit crisp, but because of the moisture found in pumpkin purée, as well as in the eggs and butter, cookies made with it often come out cakey. Kayla Hoang has several tricks to ensure that her cookies come out with a crisp exterior and an almost fudgy center: Brown the butter, to remove some of the water in it, then add the pumpkin purée to the hot butter, which draws out some of the moisture and concentrates the pumpkin flavor.\n\nRecipe: Brown Butter Pumpkin Cookies\n\nAdvertisement\n\nCredit... Armando Rafael for The New York Times. Food Stylist: Cyd Raftus McDowell.\n\nThis dessert from Yossy Arefi has sugar and spice and everything nice. It’s got a buttery, Biscoff cookie crust; a fluffy cheesecake filling rich with pumpkin pureé and pumpkin spice blend; and a cinnamon-flecked whipped cream on top. Another draw: If you decide to make this for Thanksgiving, it won’t need any precious oven space, and it can be prepared up to four days in advance.\n\nRecipe: No-Bake Pumpkin Cheesecake\n\nCredit... Ryan Liebe for The New York Times. Food Stylist: Barrett Washburne.\n\nThis butterscotch custard from Melissa Clark is infused with pumpkin purée for peak fall flavor. Because it needs to be prepared almost entirely in advance — and is baked in a travel-friendly 9-by-13 pan — it’s the perfect potluck dessert. Finish it off with a fluffy, spiced whipped cream topping. Serve it scooped into bowls, with some crisp cookies on the side.\n\nRecipe: Pumpkin-Butterscotch Custard With Spiced Whipped Cream\n\nCredit... Armando Rafael for The New York Times. Food Stylist: Maggie Ruggiero.\n\nYossy Arefi’s pumpkin-packed cake with spicy, crispy streusel makes a wonderful afternoon pick-me-up, and a great breakfast the next day. Use any pumpkin spice blend you like, but Yossy’s D.I.Y. blend includes a bit of cardamom, which isn’t typical, but adds a nice citrusy, floral note. The pumpkin-spice glaze is optional, but it shouldn’t be.\n\nRecipe: Pumpkin Crumb Cake\n\nAdvertisement\n\nCredit... Christopher Testani for The New York Times. Food Stylist: Simon Andrews.\n\nThese simple, spiced pumpkin cookies from Samantha Seneviratne are like portable, fluffy cakes. They’re tender and moist, and absolutely divine with a cup of coffee. Eat them as-is or top them with powdered sugar, more ground cinnamon, a drizzle of a confectioners’ sugar glaze, or maybe a swipe of cream cheese frosting. They also freeze well, so you can make them in advance and thaw before your next fall function.\n\nRecipe: Pumpkin Cookies\n\nCredit... Lucy Schaeffer for The New York Times (Photography and Styling\n\nMelissa Clark’s bittersweet torte falls somewhere between a pudding and a ganache. The whipped cream topping, run through with spiced pumpkin purée, is a airy contrast to the torte’s richness. “I made this dessert for a Canadian Thanksgiving, and it is absolutely delicious! A big hit,” one reader wrote. Save the recipe for your holiday menu.\n\nRecipe: Pumpkin Fudge Torte\n\nCredit... David Malosh for The New York Times. Food Stylist: Barrett Washburne.\n\nJesse Szewczyk bakes these pumpkin bars at a low temperature to keep the edges soft, resulting in a surprisingly chewy cookie texture with pockets of molten chocolate. The recipe also ditches the eggs, and features browned butter to counteract the added moisture from the pumpkin purée.\n\nRecipe: Chewy Pumpkin Chocolate Chip Cookie Bars\n\nAdvertisement\n\nCredit... Julia Gartland for The New York Times. Food Stylist: Samantha Seneviratne.\n\nThese pumpkin pie bars from Samantha Seneviratne offer the same creamy, spiced pumpkin filling as a classic pumpkin pie, but with a more equal ratio of base to filling. The “crust” is made with gingersnap cookie crumbs, flour, butter and sugar for a base that’s really more like a soft cake. Easy to transport, bring these to your next fall picnic and you’ll be the most popular person there.\n\nRecipe: Pumpkin Pie Bars\n\nCredit... John Kernick for The New York Times. Food Stylist: Simon Andrews.\n\nThis 40-minute pumpkin cake from Erin Jeanne McDowell can be made in one bowl and baked in a skillet. The frosting will be fluffier and come together more quickly with the help of an electric mixer, but it can be mixed by hand in a pinch. Or serve this simple spiced cake unadorned.\n\nRecipe: Pumpkin Skillet Cake With Cream Cheese Frosting\n\nFollow New York Times Cooking on Instagram, Facebook, YouTube, TikTok and Pinterest. Get regular updates from New York Times Cooking, with recipe suggestions, cooking tips and shopping advice.",
  "authors": [
    "Sharon Attia"
  ],
  "url": "https://cooking.nytimes.com/article/easy-pumpkin-desserts"
}