{
  "title": "The Trump Backlash Quietly Underway: Young Progressives Signing Up To Run For Office",
  "text": "WASHINGTON ― The backlash to Donald Trump’s second term has been coming in big waves. Democrats’ sweep in last week’s elections. The 7 million people who turned out nationwide for last month’s “No Kings” protests.\n\nBut there’s been another, less obvious kind of blowback playing out all year, too: a massive surge in young progressives signing up to run for office.\n\nAdvertisement\n\nIn the year since Trump won reelection, nearly 75,000 people have signed up to run for local or state office through Run for Something, a grassroots political group that recruits young progressives in down-ballot races across all 50 states.\n\nFor context, about 67,000 people signed up with the group in Trump’s first term ― over the entirety of those four years.\n\nThere’s a different energy driving young people to consider bids for public office this year, says Amanda Litman, the organization’s co-founder and executive director.\n\nAdvertisement\n\n“You’re hearing people pretty explicitly saying, ‘I’m not waiting my turn,’” she told HuffPost in a recent interview. “‘I didn’t want to run for office. But I feel like I have to.’”\n\nRun For Something, which launched in 2017 in response to Trump’s first presidential win, recruits people who are under 40, who are generally left-of-center Democrats and who align with the group’s stated values. Those values include things like supporting abortion rights, LGBTQ+ equality, climate protections and ending gun violence. Beyond that, it’s up to each candidate to decide how to reflect those values in their campaigns.\n\nThe group had a very good night in last week’s elections. It was backing 222 candidates in general elections, and of the 193 of those races that have been called, 129 of its candidates won in state and local races across 23 states. They include 36 candidates who flipped Republican-held seats to Democrats. That’s a 66% win rate so far, the group’s highest ever.\n\nAdvertisement\n\n“We now know, as we saw earlier this week, that we can win,” Litman said on a call last week with reporters. “Local candidates can be some of the best messengers of the party right now.”\n\nThe election itself spurred more people to sign up with Run for Something. In the week after Democrats swept at the polls, another 5,000 people signed up to run. And there was a spike within that spike: Nearly 1,200 of them signed up within 24 hours of moderate Senate Democrats caving Sunday in their party’s fight to protect health care subsidies for millions of people in exchange for reopening the government.\n\n“This shit is why people don’t trust the Democratic Party,” Litman quipped Sunday night on social media, in response to the Democrats giving in.\n\nAdvertisement\n\nMoments later, she connected the dots for anyone who had missed it: “Primaries are good, healthy, and useful. It’s not too late to get started for 2026.”\n\nRun for Something saw a big spike in sign-ups after Democrats swept at the polls on Nov. 4 ― and then again, days later, after moderate Senate Democrats caved in the government shutdown fight. Run for Something\n\nThe waves of sign-ups at Run for Something are happening at a time when young people have reason to feel disillusioned about their path ahead.\n\nAdvertisement\n\nAdd to the mix a wildly unstable political climate and AI increasingly stealing jobs from humans, and it’s not hard to see why young people might feel compelled to try to tackle the bigger problems holding them back in life. What better way to do that than by changing the policies that put them in this grim position in the first place?\n\n“They are over it,” Litman said. And seeing so many turn despair into action “is a really exciting feeling.”\n\nAdvertisement\n\nJustice Horn, 27, is one of those people. He was managing Energy Department projects for a Missouri nonprofit when his federal grant was suddenly terminated earlier this year as part of Trump’s sweeping cuts. Packing up his office in a haze of anger and disappointment, Horn got to thinking about running for local office as another way to see through the kinds of workforce development projects he’d been working on in his job.\n\n“I’m like, OK, if I’m gonna have all this free time, I’m on unemployment, I’m gonna commit fully to this,” Horn said. Citing the motto of the late civil rights icon John Lewis, he added, “Because when we have a lot of free time, you can get in some trouble. Some good trouble.”\n\nHe’d heard about Run for Something through friends in progressive politics and filled out the group’s questionnaire, which screens prospective candidates on why they want to run for office, how they plan to engage with voters in their community, and what kind of “heart and hustle” they can bring to a campaign. Not everyone who applies gets the group’s endorsement, but if they do, they inherit a wealth of resources, including a campaign advisor, an alumni advisor, and access to trainings and guides for a successful run.\n\nAdvertisement\n\nHorn checked all the group’s boxes. In late May, he announced his bid for an at-large seat in the Jackson County Legislature, which represents Kansas City. If he wins this election, which is happening in August 2026, he’d be the first Gen Z resident ever elected to a position in the Jackson County government.\n\nHorn has spent months door-knocking in his community, meeting lots of people who are unemployed and who, like him, lost their jobs at nonprofits or in city government because federal funding was cut. He talks to them about his priority issues, like launching a guaranteed jobs program and tackling the affordable housing crisis.\n\nYoung people uniquely understand the “urgency” of these things, Horn said, because they are directly affected. Like many of his peers, he’s getting by on credit cards and loans.\n\nAdvertisement\n\n“We’re all unemployed. We know how it feels to navigate these bureaucracies,” he said, referring to federal food assistance and unemployment benefits. “That anger ― I just like that people are using it to do better and change things, you know?”\n\nHorn added, “Because a lot of people are down, you know?”\n\nJustice Horn, 27, was asked to give remarks at the Clinton Global Initiative in New York about his efforts to stay in public service after losing his job. \"I spoke about young people stepping up and saving democracy.” JP Yim via Getty Images\n\nPrior to last week’s elections, Litman said there were four distinct moments in the past year when waves of people signed up with Run for Something: right after Trump won reelection in November 2024; when Trump carried out his first big wave of federal firings in February through his so-called Department of Government Efficiency; when Senate Minority Leader Chuck Schumer (D-N.Y.) infuriated progressives in March by voting for a GOP bill to avert a government shutdown; and when New York City mayoral candidate Zohran Mamdani won the Democratic primary in July. (Mamdani won the general election last week, too.)\n\nAdvertisement\n\nThe post-Mamdani surge was the biggest. Litman speculated his primary win resonated with young people partly because of his focus on affordable housing, an issue that keeps coming up with Run for Something prospects. But Mamdani, 34, also showed that a young progressive can take on the political establishment and, against the odds, win.\n\n“They’ve seen proof points that it is possible,” she said. “A lot of people are gonna try, and not do it. But it is possible, and that it is possible is inspiring.”\n\nTo be sure, Litman’s group isn’t the only left-leaning organization supporting young people in bids for local and state office. This is core to the Democratic Party’s efforts, too, through its state chapters and the Democratic Legislative Campaign Committee. The difference is Run for Something is recruiting people to the left of the establishment, and is uniquely focused on building a pipeline of young, diverse progressives who can launch careers in public office.\n\nAdvertisement\n\nSome of its alums have made their way into Congress, like Reps. Jasmine Crockett (Texas) and Sarah McBride (Del.). Some are running for Senate in 2026, like Michigan state Sen. Mallory McMorrow and Iowa state Sen. Zach Walls. More than 20 Democrats under the age of 40 are currently running for Congress, and nearly half are Run for Something alumni.\n\nThey are all among the more than 230,000 people in the Run for Something pipeline. To date, the group has backed more than 3,500 candidates and elected more than 1,600 people across 48 states to state legislatures, city councils, school boards and mayorships.\n\nIn its appeals to prospective new candidates, Run for Something dunks on the current crop of Democratic leaders in office as old and out of touch.\n\nAdvertisement\n\n“Politics is stuck on repeat. The same older generation calls the shots, and the people making the rules don’t look like the people living under them,” reads the group’s website. “Ready to change that? Run for Something manages the biggest candidate pipeline in Democratic politics, filled with young, diverse progressives who truly represent the people.”\n\nThere are times when Run for Something candidates have directly challenged incumbents backed by the Democratic Party. That intraparty friction is fine by Litman.\n\n“It’s like, if the incumbent’s doing a good job, they’re going to win,” she said. “If they’re not, then you’re going to get a better Democrat.”\n\nAdvertisement\n\nDemocrat Andrew Harbaugh, 31, just won a seat on the Clarion Borough Council in deep red Clarion County, Pennsylvania. Andrew Harbaugh\n\nIn some cases, people have signed up with Run for Something and then hit pause. That still works for the group, as it keeps a lifetime pipeline of potential future candidates.\n\nTheora Tiffney lost their job in April as a federal contractor at the National Institutes for Health after Trump’s cuts to federal funding. Tiffney, who is gender nonbinary and in their 30s, had always planned for a career in public health policy, and they see a natural connection between the work they’d been doing and elected office.\n\nAdvertisement\n\n“There’s a really powerful spirit of service for anyone who goes into federal employment,” they said. “You’re usually earning 30% less than the private industry. There are supremely intrusive background checks. Ethics stipulations. You really get into this if you want to make the world a better place.”\n\nTiffney signed up with Run for Something last spring, but there isn’t an obvious seat to run for in their community in Montgomery County, Maryland. In the meantime, they were selected for a two-month residency at Brocher Foundation, a group that studies the impact of medical development on society. It’s not paid, but it’s a prestigious post and will take them to Geneva, Switzerland, next summer to continue their health research.\n\nThey’ve put their political ambitions on hold for now, but have an eye on elected office in the future. The fulfillment Tiffney gets from being in public service is something they think young people are naturally drawn to ― and something the current president will never understand.\n\nAdvertisement\n\n“One of the reasons the Trump administration is attacking the civil service the way it is is that it’s entirely alien to them,” they observed. “They want it to go back to being a tool of reinforcing power structures, instead of a tool for helping people.”\n\n“My 'progressive' is different from yours, because my area’s 'progressive' is different than yours.”\n\nAndrew Harbaugh, 31, would agree. He lives in a tight-knit community in deep red Clarion County, Pennsylvania, and used to be a Republican. But last week, he won a seat on the Clarion Borough Council as a proud Democrat.\n\nAdvertisement\n\nHe fully embraces Run for Something’s philosophy that the concept of “progressive” means something different to every candidate and the community they come from.\n\n“My ‘progressive’ is different from yours, because my area’s ‘progressive’ is different than yours,” Harbaugh said. “If Google Maps is trying to get you somewhere, it gives you four different ways. But you still end up getting from point A to point B.”\n\nHe said conservatives in his community have been willing to look past his party affiliation because they see he’s genuinely invested in them and in delivering results for them. That was the message that inspired him to run for office in the first place, when he first heard it from former Democratic vice presidential nominee Tim Walz at last year’s party convention.\n\nAdvertisement\n\n“It was one of those moments when something clicks inside of you,” Harbaugh said. “I totally understand being a Democrat in a red area. You have to work extra hard for it. And Walz’s whole thing was like, we’re not all going to love the same, we’re not all going to think the same, we’re not all going to pray the same. But at the end of the day, we’re all neighbors.”\n\nHis approach seems to be resonating. As the dad of a fourth-grade son with autism, Harbaugh said he’s connected with people in his community about how he’s been personally hurt by Republicans’ cuts to Medicaid and federal education funding. He’s heard their worries about health care costs rising and how to navigate local budget challenges.\n\nHe’s even convinced some of his Republican friends to consider signing up with Run for Something. That may sound counterintuitive, Harbaugh said, but they care about their community, too, and have real potential to help lead it. And despite being Republicans, they recognize that when Trump is doing things like sending ICE into communities to terrorize families or driving up costs on Americans with his tariffs, “none of this is right.”\n\nAdvertisement\n\n“It reminds you that good ideas are still possible and can still be listened to instead of all this inflammatory bullshit,” Harbaugh said.\n\n“I think we showed [in last week’s elections] that ideas don’t have to have letters next to your name, they have results in mind,” he added. “That was good enough here. I think that was good enough everywhere.”",
  "authors": [
    "Senior Politics Reporter"
  ],
  "url": "https://www.huffpost.com/entry/trump-backlash-progressives-run-for-something_n_691160c5e4b003bdc184ebf0"
}