{
  "title": "Our first look at the Steam Machine, Valve’s ambitious new game console",
  "text": "Valve is about to challenge the Xbox and PlayStation on their home turf. Ten years to the month after Valve’s original Steam Machines went on sale, the company is announcing… the Steam Machine.\n\nI flew to Valve’s headquarters to try the company’s new PC-based game console, alongside a brand-new Steam Controller and the new Steam Frame gaming headset. It’s the culmination of Valve’s hardware and software efforts over the last decade, and it looks a lot like the leaks that have been coming out over the past year.\n\nHere’s what the new Steam Machine is all about.\n\nPhoto by Everything Time Studio / The Verge\n\nThe promise\n\nShipping early 2026 in every region where the Steam Deck is sold today, Valve’s new living room box is best thought of as a far more powerful, stationary version of the same technology. It’s a 6-inch cube that runs Windows games, but without Windows at the helm. Like the Steam Deck, it runs Valve’s Linux-based SteamOS operating system, using a compatibility layer called Proton to make games think they’re running on Windows and translate their API calls.\n\nIf that sounds like a huge compromise, you should know that countless happy Steam Deck users disagree. The Steam Deck has dramatically outsold Windows handhelds through word of mouth alone, because Linux now runs Windows games better than Windows, and because Windows is far from the Steam Deck’s pick-up-and-play console experience. I’ve heard many lapsed gamers say the Steam Deck brought them back.\n\nBut the Steam Machine has two things the Steam Deck does not: raw power, and the promise that you’ll never be waiting around for a game to update. “The Steam Machine has the ability to keep all your software, your OS, your games, and your cloud saves updated in the background … so the games are always ready for you to play,” says Valve hardware engineer Yazan Aldehayyat.\n\nWhile the Steam Deck is more powerful than a Nintendo Switch, it’s nowhere near a PS5. Big-budget games are beginning to leave it behind, and even the Nintendo Switch 2 can provide better 4K-upscaled TV graphics in its docked mode.\n\nThe Steam Machine is Valve’s answer, bringing the Deck experience to your TV with far more powerful guts. Valve says it offers six times the power of a Steam Deck, and it looks like it’ll offer at least PS5-level performance and possibly beat the PS5 Pro.\n\nPhoto by Everything Time Studio / The Verge\n\nTwo chips for PS5-plus performance\n\nUnder the hood, you get not one but two AMD chips along with 16GB of DDR5 RAM: The CPU is a six-core AMD Zen 4 chip with up to 30 watts of headroom and 4.8GHz boost, while the graphics are a semi-custom discrete AMD RDNA 3 “Navi 33” GPU, with 28 compute units and up to 2.45GHz clock, up to 110-watt TDP, and 8GB of GDDR6 memory. These are unusual components for a gaming PC, but they might work well together!\n\nWhile I didn’t have time for robust testing at Valve’s headquarters, my first impressions were promising. On a 4K TV, the demanding Cyberpunk 2077 benchmark averaged a smooth 65fps at medium settings with basic ray tracing turned on, while being upscaled to 4K from a native 1080p output using AMD’s FSR 3.0. The benchmark never dipped below 58 frames per second, and when I took the controls for a spin in one of the more demanding regions of the game, the lowest I saw was 55fps in a quick firefight. It looked nice and crisp from about 9 feet away.\n\nThe prototype didn’t do nearly as well at native 4K — just 24fps average — but consoles generally don’t play the most demanding games at native 4K, either. I also benched with the same 720p settings I use to test every handheld and saw a solid 131fps, though the low resolution looked pretty ugly on a 4K TV!\n\nPhoto by Everything Time Studio / The Verge\n\nCompressed steam\n\nHow did Valve fit PS5 power into a box around half the size of a PS5 at just 3.8 liters, including an internal power supply so you don’t need a separate brick? When Valve hands me a peeled-apart Steam Machine to let me peek inside, the answer is: there’s almost no wasted space within.\n\nAldehayyat says the team designed the entire Steam Machine around its cooling system — starting with a whisper-quiet 120mm PC fan with custom blade geometry. “We probably have more computational fluid dynamics time on this than an F1 team in a calendar year,” he jokes. “We have a lot of wind tunnel time on it as well.”\n\nPrevious Next\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n1 / 10 Gallery: Peek inside Valve’s new Steam Machine with our photos.\n\nThen, Valve and component partners built a massive finned heatsink just as tall as that fan, with embedded heat pipes — and made it pull double duty as the RF shielding between the motherboard and its four dedicated antennas, including two for Wi-Fi 6E, one for Bluetooth, and one just for connecting to its new Steam Controllers. Below the custom motherboard is a custom Chicony power supply that also doubles as RF shielding for the Steam Machine’s bottom components, including a full-size M.2 2280 SSD bay that also accepts the smaller M.2 2230 drives the Steam Deck uses.\n\nThe front panel floats atop a huge vent. Photo by Everything Time Studio / The Verge\n\nIt’s all sandwiched together into an incredibly dense, weighty package where the main gaps are all dedicated to airflow: the space around the massive heatsink’s fins, the vents on the bottom, and the multiple vents in front. Aldehayyat says Valve knew it couldn’t count on a lot of airflow in the living room, so it designed a lot of redundancy. “It’s really hard to block every single one of those vents.”\n\nPlus, those vents on the front are where the Steam Machine’s swappable magnetic front panel lives. While the basic design is plain black, Valve shows me a wood panel that gives the Steam Machine a Fractal vibe and a Team Fortress 2-themed panel, and I even spot a panel with an embedded e-paper display which reveals that the Steam Machine is codenamed “Fremont” after all.\n\nAn e-paper variant that’s internal only. Photo by Everything Time Studio / The Verge\n\nExpandability\n\nValve won’t necessarily sell any of those extra panels, but says it’ll release the CAD files so you can design and 3D print your own. “I’m sure someone will make a [Portal] Companion Cube out of this, but we did not,” Valve engineer Steve Cardinali tells us when we ask. Below the panel, Valve also has a customizable RGB light bar that it plans to turn into a progress indicator for downloads and updates.\n\nAnd this Steam Machine will finally be (optionally) sold with a gamepad that’s both familiar and worthy of playing PC games from the couch. The new Steam Controller is no longer a bulbous experiment in precision but now a comfortable, familiar, and powerful twist on a traditional gamepad (read my colleague Jay Peters’ story for more).\n\nPhoto by Everything Time Studio / The Verge\n\nThe downside of Valve’s impressive sandwich is that the Steam Machine isn’t really upgradable beyond the SSD and — if you dig deep — the 16GB of memory, which does come on standard laptop memory sticks. But the upside is an incredibly tiny game console that can alternatively double as a full desktop PC.\n\nThe Steam Machine has twin display outputs (HDMI 2.0, DisplayPort 1.4) so you can hook up two desktop monitors at a time or daisy-chain DisplayPort for a third. Across the front and back are four USB-A ports (two USB 2, two USB 3) for peripherals, with both a 10Gbps USB-C port and Gigabit Ethernet around back.\n\nYou should be able to plug in just about anything — including Valve’s new 6GHz dongle that gives the console a direct wireless connection to the Steam Frame headset — and you can install Windows if you really want.\n\nWe answered your burning questions about Valve’s new hardware. We hosted a subscriber-exclusive AMA about the Steam Machine, Steam Frame, and Steam Controller, and you can check out our responses here.\n\nIf this exact Steam Machine is not your cup of tea, the company hints that other versions might be available through partners in the future. While Valve won’t repeat history, letting companies go wild and create a ragtag band of various kinds of Steam Box like it did a decade ago, Valve says it’s willing to let end users try desktop SteamOS on their own PCs — and selectively work with companies, like it did with Lenovo, to bring future Steam Machines to market.\n\nBut partners probably will want to see how Valve’s own Steam Machine fares first, designer Pierre-Loup Griffais suggests to me.\n\nFront panel on, and an alternate wood variant that might not be sold. Photo by Everything Time Studio / The Verge\n\nThe burning question\n\nIn the two weeks since I set foot in Valve’s headquarters, there’s only been one big question on my mind: What will this cost? Will Valve price it like a console, putting the Steam Machine toe-to-toe with PS5 Pro? Or will it be priced like a PC, making buyers weigh a heftier price against the opportunity to tap the PC’s wider library of games?\n\nValve says it hasn’t finalized pricing yet. But when I explicitly ask if the console will cost more than a PS5 Pro, the answer is: “Steam Machine’s pricing is comparable to a PC with similar specs.” When I listen to my interview audio, I find an additional hint from Griffais: “We intend for it to be positioned closer to the entry level of the PC space, but to be very competitive with a PC you could build yourself from parts.”\n\nPoking around the web, I find I could probably assemble a computer with this performance for $800, not including labor. But it could easily consume half the room under my TV. A compact system with a similar GPU can cost $1,000 without storage, memory, operating system, or a gamepad.\n\nBut hey, everything about buying video games is getting more confusing and expensive these days. If Valve can deliver a pick-up-and-play console that supports decades of inexpensive PC games, I know people who’ll put down PC amounts of money to get it.\n\nCorrection, November 13th: An earlier version of this story misstated the GPU’s maximum TDP. It is 110 watts, not 130 watts.",
  "authors": [
    "Sean Hollister"
  ],
  "url": "https://www.theverge.com/tech/818111/valve-steam-machine-hands-on-preview-specs-announcement"
}