{
  "title": "Golden State Killer case update: A prosecutor reveals new details about the capture of one of America’s most notorious serial killers",
  "text": "Joseph DeAngelo moved through California neighborhoods like a shadow.\n\nHe stalked his victims for days, learning their routines before slipping into their homes in a mask to torture, rape and kill. At first, he preyed on women who lived alone but later expanded his attacks to include couples. He pocketed wedding rings, photos and other grim tokens from crime scenes.\n\nWhat started as burglaries and break-ins escalated into brutal attacks and murders that left entire neighborhoods too terrified to sleep. Each wave of terror in a different part of California came with a new nickname: The Visalia Ransacker. The Original Night Stalker. The East Area Rapist. And finally, the Golden State Killer.\n\nDeAngelo killed at least 13 people and raped dozens more in the 1970s and 1980s. In April 2018, nearly four decades after his last known crimes, police armed with DNA evidence surrounded his house in the quiet Sacramento suburb of Citrus Heights and arrested him.\n\nDressed in a T-shirt, cargo shorts and tube socks, a shocked DeAngelo offered no resistance when detectives moved in after he stepped into his yard. In a jarring contrast to the cruelty he once inflicted, the predator who’d terrorized residents in 11 counties did not fight back. But he protested in a high-pitched voice, ‘I have a roast in the oven!’”\n\nOnce inside the cold and bare interrogation room of the Sacramento County Sheriff’s Department, he slumped into a plastic chair. Alone, he quietly stared at the fluorescent-lit walls for nearly two hours, drawing in large gulps of air.\n\nA view of the home of accused rapist and killer Joseph DeAngelo on April 24, 2018, in Citrus Heights, California. Justin Sullivan/Getty Images\n\n“He reminded me of a sloppy grandpa or an alcoholic uncle whom you avoided at Thanksgiving dinner. He did not seem … particularly menacing,” writes Thien Ho, the lead prosecutor in the case, in his new book, “The People vs. the Golden State Killer.” “The monsters of our imagination can look and feel very different in the bright light of reality.”\n\nDetectives offered DeAngelo a can of Dr Pepper – the same drink he’d left behind at several crime scenes. He didn’t touch it nor acknowledge it. Investigators believe he feared he’d leave his DNA on it – unaware that they’d already obtained it from his trash can, said Ho, now the District Attorney of Sacramento County.\n\nDeAngelo was convicted of multiple murders in August 2020 and sentenced to life in prison without the possibility of parole.\n\nHo’s book, released this month, offers a rare look inside the investigation that brought down one of California’s most notorious killers.\n\n\"The People vs. The Golden State Killer\" was published this month. Third State Books\n\nThien Ho speaks during a hearing for the Golden State Killer on June 29, 2020, in Sacramento, California. Fred Greaves/Reuters\n\nCNN talked to Ho about the new revelations in his book. This interview has been edited for length and clarity.\n\nWhy do you think DeAngelo shut down in the hours after his arrest?\n\nHe was being calculating and manipulative. When he was sitting inside that room for those two hours, I was watching the video of it, and I thought a couple times that the video kind of just froze because he’s sitting there, not moving at all. And after he was confronted with the murders and rapes, he started mumbling to himself, talking to himself, saying, “I didn’t want to do it. Jerry made me do it.” He was trying to present this mental defense of a split personality … where he was blaming Jerry for taking over and kind of forcing him to do these things.\n\nHe didn’t realize that his mental defense didn’t work, because this isn’t the first time he tried it. In 1979, when he was arrested for shoplifting dog repellent and a hammer, he was caught by store security, and he was acting like he was crazy, mumbling to himself, saying crazy things. And when the police came, he admitted he was pretending to be crazy, hoping that security wouldn’t call them. He has used this technique of pretending to be crazy, so we knew it was fake.\n\nAt the beginning of his crime spree, he was a police officer, even working on task forces hunting him. Did that help him evade capture?\n\nIt did. The first series of crimes, he was the Visalia Ransacker from 1974 to 1975. There were 120 burglaries in a three-mile square radius. It turned out he was a police officer in a nearby town, and he was on the task force to find the Visalia Ransacker, and he was the ransacker. He left Visalia in central California and moved up to Sacramento, where he started committing rapes there. As a police officer, he knew how everything operated, how long it took to respond to the scene, where they would set up their blockades and how to get around that. He used his expert knowledge as a police officer to commit his crimes, find his victims and then escape.\n\nWhat drove his escalation from voyeurism and burglary to rape and murder?\n\nIt was that insatiable appetite for power.\n\nWhen we caught him, I tried to recreate every aspect of his life, from when he was born in Bath, New York, all the way to his arrest. We found out that in his personal life, he felt … like he didn’t have control or power. For example, when he was a young boy, he witnessed his little sister, who was 8 or 9 at the time, get raped by two military service members, and he was held down and had to watch that. His parents constantly beat him.\n\nAuthorities process evidence at the home of killer and rapist Joseph DeAngelo in Citrus Heights, California, on April 25, 2018. Randall Benton/Sacramento Bee/Tribune News Service/Getty Images\n\nAnd … many of the victims talked about how small his penis was. So when we arrested him, … we did a search warrant to take pictures of his penis, and it was micropenis. He felt very small and powerless all his life.\n\nAnd when he became a police officer, it was his way of exerting control and power over other people. When he went in and raped and tied up people, he was drinking their beer, eating their food in their home, violating their marriage. He would take one earring and leave the other behind. He would take the wedding band. And when he would bludgeon them to death … he was playing God over their lives. He had power and control over their lives, because he didn’t have any in his life.\n\nSome of the survivors made their voices heard in court. How did you track them down decades later and prepare them to testify?\n\nAfter he was caught, we (victim advocates, law enforcement and prosecutors) started reaching out to people and telling them what’s going on. Some people reached out to us when they saw it on the news. We found people across the country … we went to the Midwest and different parts of the country to interview people.\n\nWe tried to make everything victim-centered – we connected the survivors with counseling services, sat down with them and went over their testimony and prior statements, talked to them about what court’s like and gave them a tour of the courtroom before trial. We prepared them as best as we could to go through that process.\n\nYour book focuses more on the survivors and law enforcement officials than on the killer himself. What was the reasoning behind that approach?\n\nA lot of times, true crime books focus on the criminal and the crimes. But here, I wanted to focus on the law enforcement officers that never gave up the search for him, and on the victims. There’s an amazing moment in the case that I’ll never forget and sort of led me to that … in a criminal case, the victims get to read their impact statement. And one of them was Jane Carson, who retired from the military as a colonel. She wrote her own book on being raped by him.\n\nDuring the impact statement, she says, ‘I’ve brought somebody here with me today that was also a victim, and her name is Bonnie.’ And Bonnie comes up. And Bonnie was actually engaged to DeAngelo about 40 years ago but had broken up with him.\n\nBonnie Ueltzen looks at her former fiance Joseph DeAngelo, known as the Golden State Killer, on the second day of victim impact statements on August 19, 2020, at the Sacramento County Courthouse in Sacramento, California. Santiago Mejia/Pool/Reuters\n\nAnd the Golden State Killer is all about control, and so here was Bonnie, who he couldn’t control because she dumped him. And Bonnie stood there, and they both stared at him. I was six feet away from him. And this guy’s all about control and maintaining control. He’s sitting there, just looking straight ahead, not reacting to anything, trying to maintain control. But when Bonnie was brought into the courtroom, I looked at him, and his breathing had stopped.\n\nCarson also told him, ‘Oh, by the way, DeAngelo, do you remember the roast you had cooking in the oven the day you were arrested? … The only roast you’ll experience is when you roast in hell, because that’s where you’re going.’\n\nIt was the victim and Bonnie seizing control back … you could see there was a reaction. It was a very empowering moment in the courtroom.\n\nHis crimes were horrifying. Is there a particular survivor whose story has stayed with you?\n\nWhen I think about the case now, I don’t think about him or the crimes. I think about the survivors. One of them, Phyllis Hennemann, was the very first rape victim in Sacramento. She was diagnosed with cancer, and when it was time for court she couldn’t be there because she was having chemo. But when DeAngelo was sentenced, I looked across the courtroom, and there’s Phyllis sitting there. And she had this twinkle on her eye. For the first time in 40 years, she got justice. About three months later, she died from cancer. I think about her a lot … that we were able to get her that justice.\n\nAfter four decades, was there a moment in the investigation that marked a turning point?\n\nDNA technology shifted the direction of this case. We took some of the DNA, some of the semen from the Ventura rape and converted into a DNA profile that you use in the genealogy database, and then we uploaded it. We found out he had a distant relative, and so we then took that relative and built a family tree. You know, who was that person’s brothers and sisters, their parents, their uncles and aunties, their grandparents, their great-grandparents. We built this massive family tree with a thousand-plus names on it.\n\nAnd from that family tree, we investigated and looked at everybody. How many were male? How many of them were white? How many of them were police officers or military? How many lived at these crime scenes? And we were able to narrow it down to three people. And lo and behold, he was one of them. We collected his trash and found a piece of tissue that we tested for DNA that matched the killer from all these other locations.\n\nProsecutors Thien Ho and Amy Holliday read a statement on behalf of an Alameda County victim during the second day of victim impact statements in Sacramento, California. Santiago Mejia/Pool/EPA-EFE/Shutterstock\n\nHaving seen the evidence up close, which details have stayed with you?\n\nThe brutality of the murder scenes in Southern California … For many of those murders, he bludgeoned the victims to death with a blunt instrument. A gunshot would draw the neighbors’ attention … (so) killing them with a log, a lamp base or a brass sprinkler head allowed him time to take in the crime scene at his leisure before leaving.\n\nDo you believe there are more victims out there?\n\nI do. His last known crime was the 1986 murder of Janelle Cruz in Orange County. People ask me, ‘Why did he stop in 1986’? And my answer is, ‘How do you know he stopped in 1986?’\n\nThere’s a three-year period from 1986 to 1989, when he was living in LA, that we’re not sure exactly where he was and what he was doing. And he was already beginning to evolve as a killer. So what’s to say he didn’t continue to kill his victims, but he discarded the bodies somewhere that we never found?\n\nYou describe justice in this case as not just a legal victory but a personal, full-circle moment for you. Why?\n\nI escaped Vietnam on a fishing boat and lived in a refugee camp. When I came to the US, I learned how to speak English by watching Bugs Bunny cartoons. Twenty years later, I graduated from law school, and I became a lawyer.\n\nI come from a country that doesn’t have the rule of law … it’s governed, essentially, by a dictatorship. And to come to this country, and give back to victims rights, be part of a system of justice that works, it meant everything in the world.\n\nWhat’s DeAngelo’s life like in prison today?\n\nHe was sentenced to multiple life sentences without the possibility of parole and is in a prison in the Central Valley in California. He’s in a protective unit – this is where you put the child molesters, the rapists, the snitches, people who drop out of gangs because other prisoners want to hurt them. He’s not in the general population. And in that unit, he is constantly looking over his shoulder, worried that somebody’s going to attack him.\n\nSo he’s in his own version of hell, where he belongs.",
  "authors": [
    "Faith Karimi"
  ],
  "url": "https://www.cnn.com/2025/11/20/us/golden-state-killer-case-update-cec"
}