{
  "title": "The White House wants to eliminate ‘gender ideology’ and ‘trans ideology.’ What does that mean?",
  "text": "Last week, the board of regents of the Texas A&M University System voted to forbid professors from teaching courses that “advocate race or gender ideology, or topics related to sexual orientation or gender identity” without advance permission from their university’s president. It was the newest escalation in a running conflict that began when a student in a summer course on children’s literature recorded video of herself accusing her professor of going “against our president’s laws” by teaching “gender ideology” and declared that she was reporting the purported violation to the administration.\n\nTexas Republican politicians seized on the video as a scandal, with one state representative calling it “TRANSGENDER INDOCTRINATION.” The Trump administration joined in, with Assistant Attorney General for Civil Rights Harmeet Dhillon calling it “deeply concerning” and declaring she would look into it. Within days, the professor had been fired, students led academic freedom protests, and the president of the system’s flagship university resigned for reasons unspecified — all in the wake of a controversy about whether a class about children’s literature could legally discuss a children’s book about a 12-year-old coming out as nonbinary.\n\nIn the past year, the terms “gender ideology” and its sibling, “transgender ideology,” have become ubiquitous — in government documents and policy announcements, in mass media and in online disputes. The White House has declared its intention to stamp them out. Yet what do they mean, exactly?\n\nDonald Trump demands ‘biological truth’\n\nIn 2016, North Carolina passed the law HB2, colloquially known as the “Bathroom Bill,” banning people from using public restrooms that did not correspond with the sex listed on their birth certificates. The backlash was immediate: advocates nationwide sprang into action against it, the general public was appalled, the state lost millions of dollars in business and the NCAA pulled its high-profile sporting events. One year later, the bill was repealed.\n\nYet less than a decade later, restrictions on transgender people have taken hold of state and national policy. While HB2 was viewed by some as a blatant form of transgender discrimination, similar mandates are being imposed and upheld by every level of government today.\n\nDemonstrators call for the repeal of HB2 in Raleigh, North Carolina, on April 25, 2016. Jill Knight/Raleigh News & Observer/Tribune News Service/Getty Images\n\nOn President Donald Trump’s first day in office this year, he signed an executive order titled “Defending Women from Gender Ideology Extremism and Restoring Biological Truth to the Federal Government.” In it, he ordered the federal government to replace the term “gender” with “sex” throughout its policies and documents and declared that “sex” referred to “an individual’s immutable biological classification as either male or female.”\n\n“Gender ideology includes the idea that there is a vast spectrum of genders that are disconnected from one’s sex,” the executive order read. “Gender ideology is internally inconsistent, in that it diminishes sex as an identifiable or useful category but nevertheless maintains that it is possible for a person to be born in the wrong sexed body.”\n\nZaya Perysian, however, said Trump’s order brought a new and dangerous inconsistency to her life. Under the new White House rules, Perysian, a content creator who has documented her transition online, was issued a passport that identifies her as male, the sex she was assigned at birth. This left Perysian — with her chest-length curls and low-cut clothes, after more than five years on estrogen and both top and bottom surgery — holding a government ID that didn’t match her other legal documents. All the passport does, she said, is put her at risk.\n\n“We’re 1% of the population and 90% of the conversation,” Perysian said. “It’s just so ridiculous. We’re always being forced to defend ourselves against complete nonsense and complete propaganda.”\n\nFinding ideology everywhere\n\nThe term “gender ideology” didn’t originate in the US. The phrase has been part of a larger anti-gender movement taking shape across the world — first in Europe in the 2010s and now in Latin America, Africa and the US — particularly among conservative governments, religious groups and civil society groups, according to a United Nations report. In 2018, Brazilian President Jair Bolsonaro centered his right-wing election campaign against “gender ideology.” Brazil is one of the deadliest countries for transgender people.\n\nThe worldwide movement against “gender ideology” views the use of the term “gender” in classifying people’s social identities as a way to “destroy the traditional family and family values,” the UN report states. Indeed, much of the opposition is framed as a religious, moral choice: When Bolsonaro visited the White House in 2019, he decried “gender ideology” by saying both countries share a “respect to traditional and family lifestyles, respect to God, our creator, against the gender ideology of the politically correct attitudes and fake news.”\n\nUS President Donald Trump and former Brazilian President Jair Bolsonaro participate in a joint news conference at the White House in March 2019. Alex Wong/Getty Images\n\n“Transgender ideology,” a phrase largely used in the US, is, if anything, even more amorphous. Trump, in various public remarks or executive orders, has vowed to “get transgender ideology the hell out of our military,” to stop child abuse by “prohibiting public schools from indoctrinating our children with transgender ideology,” and to undo what he called the Biden administration’s efforts to “force Christians to affirm radical transgender ideology.” During the investigation of the killing of Charlie Kirk, law enforcement leaked a preliminary internal report to the media incorrectly claiming the shooter’s ammunition had been marked with “transgender ideology.”\n\nThe president and his followers now use “gender ideology” and “transgender ideology” more or less interchangeably. A scroll through social media shows both phrases cropping up in conservative and right-wing corners of the internet, largely as a shorthand for anything pertaining to transgender people. Using a transgender person’s correct pronouns? That’s transgender ideology. A Glamour magazine cover celebrating transgender women? Also transgender ideology.\n\nSometimes, the content of the “ideology” isn’t even stated. Florida’s commissioner of education removed a sociology professor from a curriculum workgroup for “promoting gender ideology,” he announced on X, without ever specifying how that ideology had actually been promoted. His replies were filled with hundreds of thank yous anyway.\n\nWhat makes trans people a unique target\n\nJay W. Richards is a director at The Heritage Foundation and a contributor to the conservative policy blueprint Project 2025, who wrote about “gender ideology” back in 2023. That people can be divided into two sexes, male or female, is a matter of “biological reality,” he said — though biological research on sex distinctions has yielded more complicated results. Richards described “gender ideology” as “toxic,” saying it causes people to misunderstand who they are. Having a subjective, internal sense of gender, he told CNN, should not constitute one’s literal identity. Those who are questioning their gender need help “to understand their bodily reality.”\n\nThe goal, he said, is to successfully “defeat gender ideology.”\n\n“Say, 25 years from now, it never occurred to a child that he or she might be born in the wrong body, that to be whole, he or she needs to take body and mind-altering drugs and undergo radical surgery in order to be whole,” Richards said.\n\nThat goal goes against the advice of major medical organizations. The American Medical Association, the American Psychiatric Association and the American Academy of Pediatrics support what they call gender-affirming care — a multidisciplinary approach that includes medically necessary and scientific evidence-based practices that has been shown to be life-saving for transgender people.\n\nYet more than half of US states have banned some care for transgender youth including puberty blockers, other hormone therapy, and gender-affirming surgery (although research shows such surgeries are rarely performed on minors in the US).\n\nA protester holds a sign in support of gender-affirming care for transgender youth outside of the US Supreme Court Building on June 18 in Washington, DC. Anna Moneymaker/Getty Images\n\nBy using “gender ideology” and “transgender ideology,” people are explicitly trying to diminish the human nature of gender identity, said Dr. Demetre Daskalakis, an infectious disease physician and former director at the US Centers for Disease Control and Prevention.\n\n“They want it to be like, this person isn’t a transgender person, they’re an ideologue,” he said. “These are not evidence and science-based things that they’re saying. They’re really trying to destabilize the base of science that brought us to the place where gender diversity was something that we were supporting for people’s health.”\n\nIn most other areas of medical care, it’s a generally accepted premise that people and their doctors make decisions together. When it comes to questions like avoiding vaccination, the Trump administration encourages people to follow their subjective beliefs, even amid rampant disinformation and, in some cases, limited access. Yet the government’s program of fighting “trans ideology” means that trans people are excluded from those principles — along with everyday principles like “call people what they want to be called” and “don’t fire people from their jobs because of their personal identity.”\n\nThe usage casts transgender and nonbinary people as having succumbed to an undefined doctrine, rather than experiencing a differing gender identity. Trans personhood isn’t an identity, these terms suggest, it’s a belief imposed on people by outside ideological forces. And those forces, those so-called ideologies, can be overturned.\n\n“When you make our existence into an ideology, it becomes much easier to dismiss us than it is if you approach us as people,” said Laurel Powell, communications director for the Human Rights Campaign.\n\nBan gender, spread measles\n\nUltimately, the language is “demonizing transgender people as a group,” said Chase Strangio, attorney and co-director of the ACLU’s LGBT & HIV Project. Using this rhetoric suggests that people’s identities are an ideological threat to a country’s national order.\n\n“Part of what’s happening here is, ‘Oh, the world is changing in scary ways. It’s a threat to the order,’” Strangio said. “‘Gender ideology is at the root. We’re going to root it out.’”\n\nThe effects of this rooting out are already seen. Already, between May 2024 and May 2025, hate attacks against transgender people increased by 14% compared with the year before, according to GLAAD data. More than half of all anti-LGBTQ incidents tracked over the year targeted transgender and gender diverse people specifically. Political rhetoric can have potentially deadly effects. One study found that when states pass anti-trans laws, like bans on trans-specific health care or sports participation, there’s a rise in transgender and nonbinary teens’ suicide attempts.\n\nThe downstream effects of politicizing gender identity aren’t only harmful to transgender people.\n\nOne of the most notable uses of this terminology was earlier this year, when an array of government health webpages were taken down in order to scrub references to “gender ideology.” To comply with the executive order, Daskalakis said the CDC had to pull down a 45-minute video educating providers about measles care — in the midst of a measles outbreak in Texas — because they uttered the phrase “gender identity” once.\n\n“It’s a prime example of what happens when ideology is powered up beyond science and concern for the health of people,” Daskalakis said.\n\nWhen identity becomes politicized, vulnerable populations start to falter and the entire country is weakened. In the long term, Daskalakis said vulnerable populations “will experience worse health, will get sick, and some will die.”\n\n“The stakes are high,” he said. “There will be people who are going to further demonize and vilify people based on who they are. And we know how that goes in the US.”",
  "authors": [
    "Leah Asmelash"
  ],
  "url": "https://www.cnn.com/2025/11/20/us/transgender-ideology-gender-cec"
}