{
  "title": "How the shutdown left Democrats questioning Chuck Schumer’s future more than ever",
  "text": "Washington —\n\nAs eight senators in Chuck Schumer’s caucus broke ranks to side with Republicans and vote to end the government shutdown fight he had engineered, the New York Democrat was on the phone trying to make it clear it wasn’t his fault.\n\nDialing governors and influential party leaders, Schumer had a basic request: attack Republicans over rising health care costs, not Senate Democrats or him. Schumer knew he’d have to rebut accusations that he secretly guided the deal, while others would see him as not being able to control his caucus.\n\nHe’d kept Senate Democrats united longer than they wanted to be, Schumer said in the calls, even as he’d been trying to keep the shutdown going until Thanksgiving. According to people familiar with his request, he wanted public backup for his strategy.\n\nSome of those Schumer called told him no. Some just didn’t do it.\n\nComing out of the nation’s longest shutdown, the Senate minority leader is more vulnerable than he’s ever been, both on Capitol Hill and back home in New York, and is facing serious doubts about whether he can drive opposition to President Donald Trump.\n\nFew believe Schumer, who turns 75 this month, will run for a sixth term in 2028 — and they say he could go down in a primary challenge if he tries, with some contenders already quietly preparing to run. And inside the Senate Democratic ranks, Schumer is facing more grumbling than he ever has, not unlike past House and Senate leaders in their final years on the job.\n\nCNN’s interviews with two dozen top Democrats in Congress and in New York revealed grimaces and sighs amid a reluctance to speak on the record about Schumer. Many expressed sympathy for him and said they don’t want to fuel further infighting as Democrats seek to refocus on challenging Trump.\n\nBut many echo what Antonio Delgado, the former House member and current New York lieutenant governor, said out loud as he wages his own upstart primary challenge against Gov. Kathy Hochul.\n\n“I would hope he doesn’t run for reelection,” Delgado told CNN. “I hope that by the time we get to 2028, we’re talking about different voices, we’re talking about folks that are younger that can bring a different kind of energy.”\n\nIllinois Gov. JB Pritzker, who is seen as a likely presidential candidate in 2028 and has spent the year leading pushback to Trump, was asked by CNN whether he sees Schumer as a leader for the Democrats’ future.\n\n“That’s an interesting question, a leader of the future. I mean, he’s a reasonable amount older than I am. So it’s hard to say about somebody —what is he, in his 70s? — ‘leader of the future,’” said Pritzker, 60.\n\nPrivately, the assessment is even blunter.\n\n“It’s his last term, and he may be the only one on Earth unaware of it,” one House Democrat from New York told CNN.\n\nSchumer and close advisers, meanwhile, are angry at how much he’s being blamed: by Democratic senators they consider disloyal, by pundits on the left they think are making the fight internal rather than about Republicans, and by House Democrats they think didn’t do enough.\n\nA person familiar with Schumer’s thinking argued his focus is taking back the Senate majority in 2026, an uphill climb given the Republican-friendly map, but which could dramatically change the mood of the party and Schumer’s own standing. Asked whether he would run again or could survive a primary challenge, the source said Schumer is “not even thinking of 2028” while he digs in on the midterms.\n\n“We’ll go from there,” said the person, speaking on condition of anonymity to discuss internal political calculations.\n\nThe US Capitol in Washington, DC, on November 13, 2025, a day after the government reopened. Andrew Caballero-Reynolds/AFP/Getty Images\n\nInside Schumer’s handling of the shutdown\n\nFrustrated after the 2024 election swung to Republicans on what he thought should be Democratic ground of affordability, Schumer gamed out this year early. He felt he couldn’t win an argument against Trump in the first few months of his presidency; he had to find a way to break the president’s connection with voters by the fall and then hope to win them over into the midterms.\n\nAfter the fury among Democrats when he backed down from a spending fight in March, Schumer knew he needed to be ready for a shutdown in the fall. Deciding to make it about health care came second, after a summer of voters angry about Medicaid work requirements and eligibility reviews estimated to leave millions of people without coverage from Trump’s “One Big Beautiful Bill.”\n\nDemocrats in the House and Senate landed on saying the shutdown would be about extending expiring Obamacare subsidies. Trump’s refusal to negotiate with him only helped the argument, Schumer figured.\n\nPolls suggested Democrats were winning the public argument on health care and who was to blame for the shutdown. And on November 4, Democrats swept the off-year elections.\n\nBut Schumer strained to keep the shutdown going another week.\n\nHe could tell some senators were cracking as the costs became worse. A few, like his deputy, Illinois Sen. Dick Durbin, said they couldn’t bear to see the lines of people going hungry. A few said they were worried about a Thanksgiving travel meltdown with the shortage of air traffic controllers. Nevada Sen. Jacky Rosen, meanwhile, was upset about a friend who had been furloughed and died by suicide.\n\nSchumer kept tabs on the senators negotiating with Senate Majority Leader John Thune, arguing that the top Republican was meeting with them and not Schumer because he’d be harder to satisfy.\n\n​“The idea” Schumer “orchestrated this is f***ing ridiculous,” the person said, referring to the deal to reopen the government that didn’t include health care provisions, only a separate Senate vote later that the House hasn’t committed to matching.\n\nThe person was also reflecting the rage the senator and people close to him have for Democratic pundits for focusing on him rather than on Trump, and for House Democrats for complaining after most stayed out of Washington for more than a month.\n\nSchumer is still attempting to call the outcome a victory in the long term. Polls suggest voters blame Republicans more than Democrats for the rising costs of health care and other costs of living, with affordability concerns expected to dominate the 2026 midterm campaign.\n\n“No one’s going to remember six months from now which week it ended,” the person familiar with Schumer’s thinking said. “They’re going to remember health care. And we made health care the prime issue — and an issue that we’re going to move forward on.”\n\nA fight for credit\n\nSchumer has defenders like New York Rep. Adriano Espaillat, who told CNN, “He held for many weeks, and he voted no. I think the others voted yes and they should be held accountable.”\n\nBut Rep. Alexandria Ocasio-Cortez, the progressive New Yorker who is seen as Schumer’s biggest primary threat, accused him of having “knowledge” of the deal cut to reopen the government “in exchange for nothing.”\n\nNo one expects a coup or immediate change. But many are already counting on the pressure ramping up by the end of next year, fueled by newer senators and presidential candidates (some of whom are likely to be senators) eager to strut their new-generation bona fides.\n\nPritzker said most of his anger is at the “mutineers,” as he called the eight Democratic caucus members who voted to end the shutdown, and at Trump, who “has weaponized food assistance and health care. And I know that Chuck Schumer cares about those things. I just would say that we are in a world where you’re going to have to pick sides, and Democrats need to pick ‘team fight.’”\n\nA spokesperson for New York City Mayor-elect Zohran Mamdani, the new hero of the left whom Schumer pointedly wouldn’t endorse, did not respond when asked whether he sees the senator as part of the party’s future or wants to see him run again. But one of Mamdani’s closest advisers on Friday expressed support for a consortium of liberal groups pushing for Maryland Sen. Chris Van Hollen to take over as leader.\n\nIf Democrats don’t win the majority next year, even people loyal to Schumer acknowledge he will undoubtedly face calls to step down.\n\nSenators vote by secret ballot in leadership elections, based out of their personal relationships and their own self-interest. So far, none of Schumer’s Democratic senators have called on him to step aside.\n\nSchumer’s chances of staying leader are better if Democrats win back the majority, but that would require several upsets in red states.\n\nSchumer is working to recruit former Rep. Mary Peltola to run for Senate instead of Alaska governor, much like when he got former Sen. Sherrod Brown to make that same choice in Ohio. He worked all year and through much refusal to get Maine Gov. Janet Mills into the race against Sen. Susan Collins, convinced Mills was their best chance of winning even as she’d become the oldest freshman senator in history and while others in Schumer’s caucus praise the younger Graham Platner.\n\nHis concern goes beyond legislating. Schumer believes that if Republicans keep the Senate, Supreme Court Justices Clarence Thomas and Samuel Alito, both in their mid-70s, will retire to let Trump replace them with judges in their 40s who would be reliable conservative votes for decades.\n\nBut the politics and agita of the post-Joe Biden Democratic Party are different now than even a year ago, Schumer critics warn and loyalists acknowledge. The guy who pioneered the Sunday news conference back home and mastered Washington media isn’t a natural fit for TikTok politics, some Democrats say.\n\n“2028 is far away,” said New York Rep. Grace Meng, without making any commitments.\n\n“We will have time to debate how we handle things as a big-tent party. But this is not the time or place while we need to be laser-focused on winning back the House and protecting Americans against the actions of the administration and the Republican majority,” she said.\n\nRep. Alexandria Ocasio-Cortez attends House Committee on Energy and Commerce meeting on Capitol Hill on May 13, 2025. Anna Moneymaker/Getty Images\n\nNew York Democrats are already maneuvering for his seat\n\nNew York politicians are already coalescing around the expectation that Schumer won’t run in an election that will come right before 78th birthday. That would create the first open Senate race in New York since Hillary Clinton upended years of Democratic rank-and-file planning when she swooped in for the 2000 race.\n\nOcasio-Cortez is still the main factor, seen as unbeatable in a primary were she to run, given her political celebrity and enthusiasm on the left.\n\nThat has New York’s ambitious politicians rooting for her to run for president in 2028 instead and leave them to fight over the Senate seat.\n\nA list of other names is quietly going around. New York Attorney General Letitia James, another potential field clearer, is not seen as likely to want it. Rep. Tom Suozzi, the moderate from Long Island, has abandoned his statewide dreams after his failed 2022 gubernatorial run. Some see Rep. Ritchie Torres from the Bronx as a possibility.\n\nThe one generating the most chatter is Rep. Pat Ryan, an Army intelligence veteran who first came to Congress in a 2022 special election in which he championed abortion rights and who last year significantly outperformed Kamala Harris in his Hudson Valley district. He’s brought Ocasio-Cortez to campaign with him, he’s close to the governor and he spoke out in favor of Mamdani at a key moment over the summer. Earlier this month, Ryan appeared at a fundraiser for Suozzi and endorsed 55 candidates for state and local office through his Patriot PAC created in September.\n\nAsked about his own plans, Ryan declined to comment.\n\nOcasio-Cortez said only slightly more when asked about her plans.\n\n“He’s not up for election this cycle,” she told CNN when asked whether she was considering a primary challenge to Schumer. “So, I’ll see you.”",
  "authors": [
    "Edward-Isaac Dovere",
    "Manu Raju"
  ],
  "url": "https://www.cnn.com/2025/11/16/politics/chuck-schumer-democrats-future"
}