{
  "title": "The Best Home Cocktail Machines—and Whether You Need One",
  "text": "Right now the Barsys is making me an Oaxaca old-fashioned, but it could have been any of literally 2,000 other drinks, if I only had the ingredients. Among “Oaxaca” drinks alone we potentially also have a “Flower,” a “Gold,” and a “Tail.” The Barsys promises nearly 50 takes on an old-fashioned, and more than 70 versions of the mule. (A third cocktail machine option, the Bev by Black + Decker, uses Bartesian’s capsules with a different device design. It is likely being discontinued according to reps, but is still available on Amazon.)\n\nIt’s all very ridiculous, my friends assure me, when I send them videos of the Barsys aggressively spitting ingredients into a glass whose magnetic bottom spins the liquid inside into an icy, frothy whirlpool.\n\n“I am embarrassed to be watching this,” wrote my editor at WIRED.\n\n“That is so dumb,” echoed a friend, before adding, “You should definitely bring it over.”\n\nNo one really needs a machine to make a decent cocktail, of course. But you might want one anyway. I have a theory, the kind of big idea you hear sometimes in small bars. The promise of an automatic cocktail machine is not ease, nor necessity, nor even usefulness. It is, instead, excitement. It is fun. It is whatever will make today different from yesterday. It's that little bit of dumb gee-whiz that makes your neighbor happy to come over, gives people something to talk about at a holiday party, or keeps your partner mildly entertained after a Tuesday that just kind of sucked the life out of her.\n\nAs holiday party season arrives, here’s how to choose between two flawed but kinda fun cocktail machines. Machines that mirror the life they indulge.\n\nBest for Parties: The Barsys 360\n\nPhotograph: Matthew Korfhage\n\nPhotograph: Matthew Korfhage Chevron Chevron Barsys Barsys 360 $375 $240 (36% off) Amazon WIRED/TIRED AccordionItemContainerButton LargeChevron WIRED Machine pours very precise measurements by weight\n\nPhone app suggests any of 2,000 cocktails, depending on ingredients\n\nIt looks cool, doesn't it? TIRED Cleaning, flushing, and changing ingredients is a lot of effort\n\nThe app can be a little buggy, and hard to navigate\n\nIt's a sloshy thing. Cleaning, again\n\nThe Barsys 360 is a flashy machine, literally. Select your drink on the device’s phone app and the machine will light up like a discotheque or a try-hard bowling alley. The Barsys pours in hard, aggressive squirts—impressively accurate to within three-hundredths of an ounce, by my measure.\n\nAs it pours your drink, the device’s lights will change from white to blue to green when your cocktail is ready. And if you’ve also bought Barsys’ mixer glass ($45) with a magnetic spinner, the cup will now very rapidly swirl your drink, ice and all, as it spins your tropical diamond daiquiri into a green-lit froth. Whoopee! Glowing, spinning drink!\n\nWe are firmly in party-trick territory here. And lord, it’s stupid. And fun. And stupid. If you keep it on your kitchen counter, the device may cause you to make too many drinks just because you can, and because you’ve filled the reservoirs anyway. This can be dangerous on a work night.",
  "authors": [
    "Matthew Korfhage"
  ],
  "url": "https://www.wired.com/story/cocktail-machines-bartesian-versus-barsys/"
}