{
  "title": "Has The U.S. Become A Surveillance State?",
  "text": "Transcript\n\nSince the start of the second Trump administration,\n\nmany people have wondered whether the U.S.\n\nis becoming a surveillance state.\n\nBut is there any truth to that?\n\nToday, we'll dig in.\n\nThis is Incognito Mode.\n\n[suspenseful music]\n\nWhat I think about is a state\n\nwhere the government's tracking or recording\n\nof people living in this state keeps them from doing things,\n\nchills their speech.\n\nTo me, that's what a surveillance state is.\n\nI think about this idea of a panopticon\n\nwhere perhaps the government isn't watching\n\neverything that everyone's doing,\n\nbut there's always the potential\n\nthat you could be watched and you feel watched all the time\n\nbecause you never know if they're watching,\n\nand, therefore, you have no fundamental sense of privacy.\n\nTo me, a surveillance state is a society\n\nwhere the government is fundamentally hostile to privacy.\n\nI would agree with both of those definitions.\n\nI guess, for me, it's a state that has both the capabilities\n\nto surveil everyone on a mass scale\n\nand the political will to do so,\n\nand that results in impacting people's lives\n\nin meaningful ways.\n\nAccording to Privacy International,\n\na surveillance state\n\nhas a number of specific characteristics.\n\nThis includes mass surveillance of residents,\n\navoidance of democratic oversight,\n\nsurveillance of threats to the state,\n\nand of threats to the surveillance apparatus itself,\n\noperates in secrecy,\n\nand vilifies those who protest or resist the surveillance,\n\ncompels the private sector to share data on people\n\nwith the government\n\nor even sells data on people to the private sector,\n\nuses surveillance as a solution to social problems,\n\nand uses its surveillance powers\n\nbeyond the original justification for them.\n\nWhy would a state want to impose\n\nso much surveillance on its citizens?\n\nIt seems like it's creating a lot of work\n\nand spending a lot of money to do something\n\nthat might not have a lot of benefits to anyone.\n\nI think that, you know, a surveillance state\n\npreserves the status quo\n\nand makes the powerful more powerful.\n\nThat's what dictators want.\n\nThat's what the elites always want in any country,\n\nincluding the U.S.,\n\nwhich I think is why we're asking this question today\n\nof whether the U.S.\n\nis one of these surveillance states now too.\n\n[suspenseful music]\n\nPerhaps the three most common examples\n\nare China, North Korea, and Russia.\n\nChina has built the most technologically-advanced\n\nand expansive surveillance apparatus on Earth.\n\nThe country has roughly 700 million cameras.\n\nMany are equipped with facial recognition\n\nas well as a system called City Brain,\n\nwhich uses AI and data collection\n\nfor so-called urban management.\n\nThe system fuses information from public cameras,\n\ncell phones, financial transactions,\n\nand even health and e-commerce information\n\nto track citizens in real time.\n\nThe system was developed by Alibaba Group,\n\nand that's just talking about cameras.\n\nChina's government developed the internet\n\nand all types of telecommunications\n\nto be centralized in a way\n\nthat it can surveil pretty much everything\n\neveryone does online or over the phone at any time.\n\nChina has been developing\n\na digital surveillance state for decades.\n\nThat has sort of been a hallmark initiative\n\nof their regime, is the Great Firewall.\n\nTheir model was to build that\n\ninto all their digital technology,\n\nall the infrastructure of the telecoms,\n\neverything from the ground up.\n\nThe amount of internet censorship in China\n\nis widespread and really obvious.\n\nPopular social media sites are banned in China.\n\nInstead, you have to use social media\n\ndeveloped domestically in China,\n\nwhich the government has a massive amount of control over.\n\nA lot of this might sound similar\n\nto what's happening in the U.S. or other Western countries,\n\nbut the reason people call China a surveillance state\n\nis because its systems were developed\n\nwith surveillance in mind from the very beginning.\n\nJust as the open internet was developing across the world,\n\nChina was building an alternative version\n\nthat had tight, centralized control\n\nthat really imposed a lot of limits\n\non what people could say and do online.\n\nAnd then there's a true totalitarian state,\n\nlike North Korea,\n\n[North Korean soldiers chanting in foreign language]\n\nwhich I think of as the quintessential surveillance state\n\nthat actually is not digital at all for most people.\n\nMost people don't even have access to the internet.\n\nThose who do, it's completely, entirely surveilled.\n\nThose are mostly elites and government employees.\n\nBut then for everyone else,\n\nthere's a kind of analog surveillance state\n\nthrough informants,\n\nthrough a whisper network of neighbors,\n\nsnitching on each other and being incentivized to do so,\n\nso that there really is no privacy,\n\nor at least that is the intention\n\nof the regime of Kim Jong Un.\n\nIn North Korea, surveillance enforces loyalty,\n\nand dissent there can mean imprisonment.\n\nVirtually, all aspects of life\n\nare under surveillance in North Korea.\n\nClassrooms, workplaces, roads, even homes,\n\nare subject to surveillance.\n\nIt's been reported that as many as one in 20 North Koreans\n\nparticipate in the surveillance network,\n\nmaking privacy virtually non-existent.\n\nIn Russia, the surveillance state\n\nis really geared toward shutting down dissent.\n\nSo much so that human rights advocates\n\ncall this a cyber gulag.\n\nAuthorities scan the internet every day\n\nto find photos and videos showing banned content.\n\nThey use cameras equipped with facial recognition\n\nto identify and track protestors.\n\nOnline censorship has expanded drastically,\n\nwith hundreds of thousands of webpages blocked annually.\n\nRussia is more of an example of trying to retrofit\n\nand come to that digital surveillance later\n\nand invest the time and the energy retroactively.\n\nBut what's interesting to me now\n\nis that I think digital technology has potentially evolved\n\nto the point where that is an even lighter lift\n\nthan ever for a state\n\nbecause of the private sector capabilities\n\nthat are already in place.\n\nYeah, I mean, you see this in just kind of the nature\n\nof the internet where things are so centralized now.\n\nWe have so much internet traffic\n\nthat goes through Silicon Valley companies,\n\nthe cloud giants, like Amazon and Google.\n\nRetrofitting the surveillance is relatively easy\n\ncompared to how it might've been\n\nin the earlier days of the internet\n\nwhere everything was much more decentralized.\n\n[suspenseful music]\n\nSo there are a lot of elements\n\nthat make a surveillance state a surveillance state or not.\n\nTo try to whittle this down, on a scale of one to 10,\n\nwith 10 being North Korea,\n\none being a place that no longer exists in the world,\n\nI guess, Antarctica,\n\nwhere would you place the United States\n\nas a surveillance state or not?\n\nLike a seven,\n\nbut I start my surveillance state zone\n\nat, like, a five or a six.\n\nI was gonna say a kind of creeping six,\n\nbut that already puts the U.S.\n\ninto surveillance state territory\n\nby your definition. We can have\n\ndifferent scales. I think a five or a six.\n\nI feel like we are more than halfway there\n\nand creeping up all the time.\n\nI would put it at about a seven or even an eight\n\nbecause the switch could be flipped pretty easily\n\nfor all the tools that exist,\n\nall the data that's being collected to be used in a way\n\nthat we have never imagined would be possible\n\nin the United States.\n\nI would amp it up just a little bit\n\nbecause the risk is so obvious in this moment\n\nthat I think we have to take it very seriously.\n\n[dramatic music]\n\nLily, do you consider the U.S.\n\na surveillance state right now?\n\nI think the U.S. has been moving\n\ntoward becoming a surveillance state for a while,\n\nbut, to me, that means that the capability exists\n\nfor it to be classified that way\n\nif there was the political will,\n\nand now I think it is starting to fully qualify\n\nfor that title.\n\nThere are lots of groups of people around the U.S.\n\nwho don't feel comfortable posting\n\nwhat they really think about things on social media anymore.\n\nPeople talk about,\n\nwell, if somebody already knows everything\n\nthat's on my phone anyway, or things like that.\n\nSo to me, yes,\n\nI think the U.S. is in the transition to becoming one.\n\nWell, I don't wanna sound like an apologist\n\nfor the U.S. government,\n\nbut I don't think it's maybe helpful\n\nto call the U.S. a surveillance state yet,\n\nmaybe it is becoming one.\n\nThere's a really big difference\n\nbetween the U.S. and a country like China or Russia,\n\nor God forbid, North Korea.\n\nAnd the main one to me seems\n\nthat the U.S. has outsourced surveillance\n\nto the private sector in many ways.\n\nI wouldn't call the U.S. a surveillance state\n\nso much as maybe a surveillance economy at this point.\n\nWe are the world's epicenter of surveillance capitalism.\n\nWe practically invented it.\n\nSo your phone is constantly being tracked\n\nby which cell towers it's connecting to\n\nand the crappy mobile games that you have on it\n\nthat are watching your every move.\n\nBut that's not actually the NSA\n\nlistening to your phone calls in the way\n\nthat the Ministry of State Security might in China.\n\nThe end result might be the same though.\n\nAnd there are ways in which I think to your point, Lily,\n\nU.S. government is completely co-opting\n\nthat private sector surveillance\n\nand using it and also dialing up its own surveillance too.\n\nI guess I agree with both of you\n\nin that we are unique in just the level of surveilling\n\nwe're doing ourselves,\n\njust by engaging in the digital economy\n\nand having phones and being on the internet all the time,\n\nand we've normalized being tracked, being monitored,\n\nthat everything we post is public,\n\nor you can't assume that it's not.\n\nI think we are a surveillance state\n\nif you are a vulnerable person.\n\nI think it really depends on who you are\n\nand what your vulnerabilities are,\n\nand that is gonna determine whether you feel like you live\n\nin a surveillance state or not.\n\nAnd I think if you feel perfectly free\n\nto say whatever you want to say\n\nor anything of that nature,\n\nyou probably don't feel like you live\n\nin a surveillance state.\n\nIf you don't feel like you can leave your house\n\nbecause masked agents are going to snatch you\n\nor members of your family,\n\nyou probably feel like you're very much living\n\nin a surveillance state.\n\nAnd that's where we're at right now.\n\nThere's a class system within the level of surveillance\n\nthat we have in the United States.\n\nYeah, to Andrew's point, we are already seeing\n\nwhat a U.S. surveillance state looks like for the have-nots.\n\nWe are a have and have-nots society.\n\nFor undocumented migrants,\n\ntheir surveillance by ICE is equivalent\n\nto a surveillance state.\n\nFor people who are in the margins of society\n\nand are forced into the drug trafficking trade,\n\nthe war on drugs remains the source of the vast majority\n\nof U.S. government surveillance.\n\nLast year, 80% of court-authorized wire taps\n\ntargeted drug operations, drug dealers.\n\nSo that is who is actually in a surveillance state today.\n\nI would say that the rest of us,\n\nwe have this luxury of maybe for now pretending\n\nthat's not happening,\n\nbut also are being surveilled in our own ways,\n\nlargely through the for-profit services we use.\n\nPart of a state being a surveillance state\n\nis the political will to make it such,\n\nand we are seeing an expansion\n\nof who is deemed an enemy within the United States,\n\nand even just declaring the Democratic Party\n\npart of a terrorist organization\n\nhearkens back to the PATRIOT Act\n\nand everything that followed the September 11th attacks\n\nand the vast expansion of the actual surveillance state\n\nthat exists in the United States in the past 24 years.\n\nAnd right now, we're seeing kind of a vast expansion,\n\nnot just of the technical capabilities,\n\nwhich continue in the background all the time,\n\nbut in the political will to surveil\n\nan increasing number of Americans.\n\nExactly.\n\nIf you looked at what Edward Snowden revealed in 2013\n\nand what he said about it even,\n\nhe was, in many cases, not actually trying to point\n\nto contemporaneous surveillance.\n\nHe was warning about the capability for surveillance,\n\nand he talked about this idea of turnkey tyranny.\n\nThe capability is there,\n\nand as soon as we have a tyrants in place\n\nwho wants to exploit those capabilities,\n\nwe will be in a surveillance state.\n\nThe question now is, is that tyrants in the White House?\n\nWell, and part of the definition\n\nof privacy protections relates to the idea\n\nthat privacy has to be preserved\n\neven for people who are doing bad things,\n\nthat privacy as a right can't be applied selectively\n\nto certain groups.\n\nIt has to be applied to all in order to exist for all.\n\nI think that's true.\n\nMoxie Marlinspike,\n\nthe inventor of the Signal encryption app\n\nused to say, yes, the idea of privacy tools\n\nis to enable people to break the law in some cases\n\nbecause that is actually how society evolves,\n\nand people didn't have the privacy\n\nto have LGBT relationships.\n\nWhen that was illegal in the U.S.,\n\nwe would never have gay marriage in this country.\n\nSo this freedom to push the boundaries\n\nof what is not just accepted but legal\n\nis how we have progress in this country.\n\nI think in terms of surveillance being applied\n\nbecause there's bad guys doing bad things\n\nand we need to catch them,\n\nthat is always the justification initially for surveillance.\n\nBut what is also true\n\nis that the surveillance never stops there.\n\nIt increasingly expands\n\nbecause the authorities can see blind spots\n\nor they just think that they're gonna have more success\n\nin doing whatever their job is\n\nif they surveil more and more people.\n\nIn prior generations,\n\nthere are space to have underground movements.\n\nNow those spaces are online\n\nwhere they are, by default, in a panopticon.\n\nI think it's an excellent point\n\nthat digital technology puts communication into a platform\n\nthat can easily be surveilled,\n\nand I think DOGE's activities\n\nin the centralization of all that data\n\nin a very quick, casual way\n\nwithout very much oversight\n\nwas a good example of evolving sentiment\n\nor views on privacy.\n\nHistorically, the U.S. would've been allergic\n\nto that type of data sharing between agencies,\n\nstate and federal data has always been very separated,\n\nand so the fact that now this administration\n\nis grabbing data,\n\ncombining data from different sources so readily\n\nindicates a big shift.\n\nSo what are the arguments that the U.S.\n\nis a surveillance state, or at least becoming one?\n\nThe U.S. has a long history of surveillance,\n\ndating back to at least the 1700s,\n\nand the creation of slave patrols,\n\nwhich would quash uprisings and track down escaped slaves.\n\nFast forward to World War I and II,\n\nwhere we saw the beginning of the modern surveillance state,\n\nwhich was primarily used to surveil foreign enemies.\n\nThen we get into the 1950s\n\nand the FBI under J. Edgar Hoover monitoring for communists\n\nand the whole Red Scare and the Cold War\n\nand the establishment of the NSA.\n\nAnd then in the 1960s,\n\nsurveillance apparatus was turned on anti-war\n\nand anti-establishment protestors\n\nand other dissident groups.\n\nIn the 1980s, we saw the rise of the war on drugs\n\nand the surveillance of Black and Hispanic communities.\n\nAnd then there's 9/11\n\nand the passage of the U.S. PATRIOT Act,\n\nwhich really established\n\nthe US' modern surveillance capabilities as we know them.\n\nThe culmination of hundreds of years of surveillance\n\nare a wide swath of intelligence agencies\n\nthat engage in surveillance of all types,\n\nthe NSA, the CIA, the FBI, Department of Homeland Security,\n\nthe National Reconnaissance Office,\n\nthe Defense Intelligence Agency, and many more.\n\nNow under the second Trump administration,\n\nwe're seeing surveillance tools historically used\n\nfor combating serious crime and terrorism\n\nused against a widening group of people,\n\nfrom undocumented immigrants\n\nto the so-called radical left.\n\nThe Department of Government Efficiency, or DOGE,\n\nhas created a master database\n\nthat includes information\n\nfrom the Social Security Administration, the IRS, DHS,\n\nand even voting records.\n\nInternal memos obtained by WIRED\n\nshowed DOGE officials cross-referencing Social Security\n\nand IRS data against immigration data\n\nto track immigrants in real time.\n\nOversight offices meant to protect civil rights\n\nhave been gutted.\n\nIn March, 2025, executive order instructed agencies\n\nto share and consolidate\n\nall unclassified data across departments.\n\nOne of the big red flags\n\nis how close many big tech executives\n\nhave become with the Trump administration.\n\nThese companies have massive amounts of data\n\non pretty much everyone,\n\nand we don't know exactly how they're sharing that data\n\nwith the administration.\n\nSo what are the reasons the U.S. isn't a surveillance state?\n\nThe first big one is that the U.S. is a democracy.\n\nThat gives people the power\n\nto decide how much or how little they want to be surveilled,\n\nat least in theory.\n\nThe U.S. also has laws that limit the government's ability\n\nto surveil its own people,\n\nand as powerful as the U.S. presidency is,\n\nthere are checks and balances in place\n\nthat limit the ability of the U.S. president\n\nto abuse surveillance powers,\n\nlike you might see in North Korea or China.\n\nOne of the core elements\n\nthat makes a country a surveillance state\n\nis its political will to use surveillance\n\nagainst its own people.\n\nIn the United States, we've seen examples\n\nof surveillance powers even being pulled back,\n\nwhich is really rare.\n\nTake for example, the USA FREEDOM Act,\n\nwhich was passed in 2015\n\nin response to revelations by Edward Snowden,\n\nwho leaked a ton of classified information\n\nabout the National Security Agency's surveillance\n\nof Americans and the world.\n\nThat shows the US has the capability\n\nof stopping surveillance that might be harmful\n\nfor its own citizens, even if it has the tools to do so.\n\nAnd unlike under the regimes in China, Russia,\n\nand North Korea, Americans still have the ability\n\nto debate these issues openly.\n\nThis episode is an example of that.\n\nI think that what makes the U.S.\n\ndifferent from China or Russia\n\nis in part that we have the option\n\nto turn on privacy, to seek it.\n\nTools like Signal or the anonymity tool Tor\n\nare legal in the U.S. and available and free.\n\nThen Tor, in fact, came from ideas\n\ndeveloped in the U.S. government,\n\nand Signal was initially funded\n\nby a U.S. government agency.\n\nThat's really different.\n\nYeah, and I think that really is at the core\n\nof why we're having this conversation\n\nis that maybe there is a feeling\n\nthat privilege is imperiled.\n\nThis has been Incognito Mode. Until next time.\n\n[bright music]",
  "authors": [
    "Condé Nast"
  ],
  "url": "https://www.wired.com/video/watch/incognito-mode-has-the-us-become-a-surveillance-state"
}