{
  "title": "'Butterfly' Actor Daniel Dae Kim On Getting His First Leading Role",
  "text": "LOADING ERROR LOADING\n\nDaniel Dae Kim has been a familiar face on television for decades — from his breakout role on “Lost” to his years on “Hawaii Five-0.” But in “Butterfly,” the new spy thriller premiering on Amazon Prime Video, Kim takes on a brand new challenge: a leading role. (Watch the full interview above.)\n\n“I’ve been in this business 30-plus years, and this is really the first time I’ve been the lead of a show,” he says. “And that’s not lost on me. No pun intended.”\n\nAdvertisement\n\nThat milestone is more than a personal win. For Asian American men, who have historically been pushed to the sidelines of Hollywood storytelling, Kim’s first lead role represents a seismic shift.\n\nFor decades, Asian American men were depicted through a narrow lens: martial arts fighters, math nerds, comic sidekicks or quiet background characters. They were rarely portrayed as complex leads, and almost never as romantic ones.\n\n“Often in the past I’ve done action and I’ve been in sci-fi shows. I’ve been in deep space way into the far future,” he says. “But I very rarely had the chance to do a kitchen sink drama where I can just talk about the struggles of my relationship, romantically, or, in this case, with family.”\n\nAdvertisement\n\nThat’s why “Butterfly” feels like a breakthrough — not just for Kim, who finally gets the space to explore emotional depth and intimacy as a husband and father wrestling with love, loyalty, and the fragility of family, but also for audiences who have long awaited more nuanced Asian American male leads.\n\nAt the same time, global culture is shifting, opening the door to a wider spectrum of Asian representation. In recent years, the rise of K-pop, led by groups like BTS, has helped disrupt outdated stereotypes, reshaping masculinity on the world stage and showing that Asian men can be desirable and multifaceted.\n\n“I’ve heard of women going to Korea looking for a Korean boyfriend now,” he says with a laugh. “If you would have told me that 20 years ago, I wouldn’t have believed you.”\n\nAdvertisement\n\nAt its heart, the 57-year-old actor and producer hopes the Prime Video show speaks to something larger than representation alone. “There are certain human traits that are universal,” he says. “Whether you’re Korean, American, Asian, whatever nationality you are, there is a path to understanding and there is a path to love.”",
  "authors": [
    "Senior Producer"
  ],
  "url": "https://www.huffpost.com/entry/why-daniel-dae-kims-first-leading-role-is-a-big-deal_n_68b856f9e4b042094acfd556"
}