{
  "title": "Sali Hughes on beauty: from nail polish to powder, the best new makeup of 2025",
  "text": "This has been an excellent year for new makeup, starting with Givenchy’s comeback. Having infuriated the beauty community by (badly) reformulating its classic loose powder, it won back detractors with the exceptionally good Prisme Libre Pressed Powder, which blurs, smoothes and near-perfects a face of makeup, and now lives full time in my handbag. This was followed by a Bronzer Powder version, also £45, which succeeded in moving me away from creams to achieve a filtered, sun-kissed finish. Full marks with distinction for both.\n\nThe Guardian’s journalism is independent. We will earn a commission if you buy something through an affiliate link. Learn more.\n\nI won’t dwell on Nars The Multiple (£33), because I so recently have, but the reboot of this classic cheek, eye and lip cream improved on the legend with nuanced, muted shades and a soft, lasting, flattering finish.\n\nMy most used lipstick was Charlotte Tilbury’s Pillow Talk Love Effect (£29) in Naughty Talk, a neither warm nor cool pinky nude in a satin finish, now back permanently after a limited – and quickly sold-out – run.\n\nNever have my not-pretty hands received more compliments than when dressed in Thornbird khaki\n\nWhile Merit Signature Lip Liners (£21) haven’t been my own most worn, I commend them because they offer an easy and ingenious solution for those who’d like a defined, non-bleeding lipline but fear the commitment and unforgiving nature of a traditional pencil. These are to other lipliners what tinted lip balms are to lipsticks – sheer, moist and mistake-proof. They offer a perfect solution to minimal makeup wearers in search of some extra polish. Bespoke, Merit’s beloved rosy brown, looks pretty and cool on everyone.\n\nRegulars will know it takes a lot for an eye palette to excite me. I generally favour single cream shadows from Bobbi Brown, Armani, Makeup by Mario and Vieve. But Viseart’s VisePRO Étendu powder eyeshadow palettes (£40) have my heart. Viseart is a professional brand, which, I think, conveys the idea that one needs to be technically skilled to get the best from the products, but the opposite is true. Shades are curated so well as to have done away with the need for thinking time. But it’s the exceptional textures that knock off my socks. You will not find smoother, silkier, more easily blendable shadows anywhere.\n\nskip past newsletter promotion Sign up to Inside Saturday Free weekly newsletter The only way to get a look behind the scenes of the Saturday magazine. Sign up to get the inside story from our top writers as well as all the must-read articles and columns, delivered to your inbox every weekend. Enter your email address Sign up Privacy Notice: Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on theguardian.com to send you this newsletter. You can complete full registration at any time. For more information about how we use your data see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nThis was the year I moved exclusively to the allergy-conscious nail brand Bio Sculpture, and for the first time ever I wore the same shade for three manicures in a row. Never have my not-pretty hands received more compliments than when dressed in Thornbird (£15.50), a sophisticated, neutral khaki green that adds interest and edge while sitting appropriately against any outfit.",
  "authors": [
    "Sali Hughes"
  ],
  "url": "https://www.theguardian.com/fashion/2025/nov/19/sali-hughes-beauty-best-new-makeup"
}