{
  "title": "Apple’s AirPods Pro 3 just got their biggest discount ahead of Black Friday",
  "text": "Posts from this author will be added to your daily email digest and your homepage feed.\n\nThe AirPods Pro 3 are Apple’s most impressive wireless earbuds yet, offering improved active noise cancellation, a more comfortable fit, and excellent audio performance. Thankfully, you can snag the wireless earbuds for just $219.99 ($30 off) at Amazon, Walmart, and Best Buy. It’s the biggest discount we’ve seen since they became available in September.\n\nThe AirPods Pro 3 are a marked upgrade over their predecessor, with senior reporter Victoria Song calling them a “no-brainer upgrade” in her review. She put the earbuds’ improved ANC to the test in various real-world situations, including at a concert, and found they performed fantastically well. They’re especially better at dampening high frequency sounds, like voices, than prior generations of AirPods Pro, and they had no problem eliminating the dull hum of an airplane.\n\nPart of what makes the ANC performance so good is the fit. The AirPods Pro 3 feature a tweaked design that’s more angled, so they fit more naturally into your ear canal. The tips have also been infused with foam that expands slightly in your ear to create a better seal, and Apple includes a new XXS size tip to fit more ears. If you’ve had issues with previous AirPods Pro falling out of your ear, the newer design of the AirPods Pro 3 should be a big improvement.\n\nIn terms of audio quality, Apple’s latest wireless earbuds deliver more bass, and we noticed new elements in the sound production of old favorites, too. Overall, they provide a richer listening experience, whether you’re playing your favorite tunes or watching a movie. The AirPods Pro 3 also offer around eight hours of battery life and an IP57 rating for water and dust resistance. Meanwhile, they feature a heart rate sensor, allowing iPhone owners to track calories burned in over 50 types of workouts from the Fitness app. If you don’t need the latest features, you can still grab the second-gen AirPods Pro for just $139 ($110 off) at Walmart.\n\nVerge Deals Sign up for Verge Deals to get deals on products we’ve tested sent to your inbox weekly. Email (required) Sign Up By submitting your email, you agree to our Terms and Privacy Notice . This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.",
  "authors": [
    "Brandon Russell"
  ],
  "url": "https://www.theverge.com/gadgets/825107/apple-airpods-pro-3-black-friday-deal-sale"
}