{
  "title": "Baja participación en segunda marcha de la Generación Z en México, mientras Sheinbaum celebraba aniversario de la Revolución",
  "text": "EFE —\n\nLa escasa asistencia, apenas dos centenares de personas, y un fuerte dispositivo policial marcaron la segunda marcha de la autodenominada Generación Z celebrada este jueves en Ciudad de México, que coincidió sin incidentes con el tradicional desfile militar en conmemoración de la Revolución mexicana.\n\nLa segunda movilización de la Generación Z ocurrió cinco días después de la primera que reunió a unos 17.000 manifestantes y que acabó con cerca de una veintena de policías y 100 civiles heridos, así como una veintena de personas detenidas, luego de un enfrentamiento entre las autoridades y un grupo de personas encapuchadas en las puertas de Palacio Nacional en el centro de la capital mexicana.\n\nLa policía de Ciudad de México entró en alerta días antes porque los convocantes de la marcha buscaban hacer coincidir su manifestación con el tradicional desfile militar del 20 de noviembre del Gobierno mexicano, encabezado por la presidenta Claudia Sheinbaum, por posibles disturbios después de la protesta del pasado sábado.\n\nEn su discurso, Sheinbaum defendió este jueves, durante la conmemoración del 115 aniversario de la Revolución mexicana, la soberanía del país y aseguró que “se equivoca” quien convoque “a una intervención extranjera”.\n\nSheinbaum destacó que, a diferencia del pasado, en el México actual “ya nadie es silenciado, ya nadie es perseguido por pensar distinto” y cerró su discurso con un reconocimiento a las Fuerzas Armadas, surgidas de la Revolución.\n\nDesde dos puntos\n\nLa movilización fue convocada en dos puntos de la capital, el Ángel de la Independencia y en Ciudad Universitaria, en el campus central de la Universidad Nacional Autónoma de México, donde no se reunió nadie.\n\nDesde el Ángel de la Independencia, un grupo de cerca de 200 personas iniciaron la caminata que recorrió la céntrica avenida Reforma hasta una calle antes del Zócalo donde una línea de agentes les bloqueó el paso, ya que a esa misma hora se desarrollaba el desfile militar del 20 de noviembre.\n\nLa movilización transcurrió con tranquilidad y fue notable la mayor asistencia de medios de comunicación y vendedores ambulantes que los asistentes a la marcha.\n\nPrecisamente para evitar incidentes, la Secretaría de la Defensa Nacional (Sedena) modificó días antes la ruta del desfile cívico-militar del 20 de noviembre, que inició en el Zócalo y terminó en el Monumento a la Revolución.\n\nUn manifestante sostiene una bandera con el logo del popular manga japonés One Piece, un símbolo adoptado por los movimientos de protesta de la Generación Z en todo el mundo, en la Ciudad de México, el 20 de noviembre de 2025. YURI CORTEZ/AFP/AFP via Getty Images\n\nEn un comunicado, la Secretaría de Gobierno de la Ciudad de México (SECGob)y la Secretaría de Seguridad Ciudadana (SSC) informaron que la manifestación registró “una afluencia aproximada de 150 personas” y tras un diálogo sostenido en Reforma, “se acordó permitir su avance una vez que la retaguardia del desfile concluyó su paso y el personal operativo se retiró de la ruta”.\n\nLa nota indicó que durante el recorrido, en el entronque de Reforma y Guerrero, se registró una riña entre particulares y como resultado cinco hombres fueron presentados ante el Juez Cívico.\n\nAdemás, sobre la calle de Madero, personal de la SSC confiscó garrotes, máscaras de gas y cadenas que portaban algunas personas al tiempo que un grupo reducido de personas encapuchadas ingresó al Zócalo, donde no se generaron incidentes relevantes.\n\nEl movimiento, que dice no tener vinculación partidista, publicó un documento en el que exige mayor representación popular en el Congreso, combate a la corrupción y el fortalecimiento de la seguridad local con supervisión ciudadana en medio de la ola de violencia por parte del crimen organizado que viven ciertas partes de México.",
  "authors": [],
  "url": "https://cnnespanol.cnn.com/2025/11/20/mexico/segunda-marcha-gen-z-mexico-efe"
}