{
  "title": "Ryan Gosling is not an astronaut in Project Hail Mary’s first trailer",
  "text": "is a senior reporter who’s been covering and reviewing the latest gadgets and tech since 2006, but has loved all things electronic since he was a kid.\n\nPosts from this author will be added to your daily email digest and your homepage feed.\n\nFollowing the success of 2015’s The Martian, Amazon MGM Studios has released the first trailer for Project Hail Mary based on another best-selling Andy Weir novel. The film features Ryan Gosling, who’s entering his sci-fi era after being cast in Star Wars: Starfighter, as science teacher-turned-astronaut Ryland Grace who wakes up on a spaceship with no memory of who he is or why he’s light years from Earth.\n\nThe trailer starts with a very bearded Grace waking up from a coma on a spaceship that he discovers is 11.9 light years from Earth. Through a series of flashbacks we learn that Earth’s sun, as well as countless neighboring stars, are all dying as a result of a mysterious substance — except one. A reluctant Grace, who has a Doctorate in molecular biology, is recruited as an astronaut to visit this star and hopefully find out why it’s not affected in an effort to save mankind.\n\nBut it turns out Earth isn’t the only planet with a dying sun who has sent a savior to this star, and Grace finds himself meeting an alien ally who we only see brief glimpses of in this first trailer.\n\nThe film is produced and directed by Phil Lord and Christopher Miller who created the animated Spider-Verse franchise and who wrote and directed the original Lego movie. The Project Hail Mary novel was adapted by Drew Goodard (who previously adapted Weir’s The Martian) and the film, which hits theaters on March 20th, 2026, also stars Sandra Hüller, Lionel Boyce, Ken Leung, and Milana Vayntrub.\n\nRyan Gosling starts in Amazon MGM Studios’ Project Hail Mary hitting theaters next year. Image: Amazon MGM Studios",
  "authors": [
    "Andrew Liszewski"
  ],
  "url": "https://www.theverge.com/news/694319/project-hail-mary-trailer-ryan-gosling-phil-lord-christopher-miller"
}