{
  "title": "How Native American Culture Expands Queerness",
  "text": "When they lived in Utah, Sean Snyder and Adrian Matthias Stevens often ran into each other at pow wows. For both Snyder and Stevens, these events served as spaces to share the dance and songs of their culture, while also competing with other tribes. But above all, the gatherings were a means for building community.\n\nAfter a few casual yet pleasant run-ins, Snyder and Stevens, who both identify as Two-Spirit, began dating. Ten years later, they’re still dancing at pow wows all over the country — but now, as a same-sex couple.\n\nLong-lasting, healthy queer love is something I’ve always loved to witness, but it feels particularly special when there’s a connective thread in the relationship, rooted in an identity at odds with so much of the world. Two-Spiritness, for those unfamiliar, is not quite gayness or transness as we would define it in binary terms. Instead, it’s an identity that actively embraces the duality of femininity and masculinity within a single person. It’s an identity that can, and should, teach all of us about how expansive queerness can be.\n\nAdvertisement\n\nSynder (left) and Stevens dance at pow wows all over the country. Nia MacKnight for HuffPost\n\nSnyder, who is Navajo and Ute, is a beadwork artist who was born in Iowa and grew up in several states, including Alaska and Arizona. Stevens, who is Northern Ute and Apache, was born and raised in Utah, where his fondest memories were of celebrating the Bear Dance, a 10-day springtime festival of feasting. Although both Snyder and Stevens were intimately connected to their Native heritage growing up, it wasn’t until later in life that they learned the term “Two-Spirit.”\n\nStill, they both describe intuitive reactions to their Two-Spirit identities from their families, even if they weren’t verbally articulated. For example, Stevens’ parents allowed him to take part in activities that were traditionally reserved for women in ceremonies, such as carrying water, which was their way of acknowledging that they understood something about Stevens that he might not have fully understood about himself yet.\n\nAdvertisement\n\nStevens (left) is Northern Ute and Apache, while Snyder is Navajo and Ute. Nia MacKnight\n\nTo him, this is evidence of the link between queerness and the universe. “Two-Spirit is not physical. It’s spiritual, being able to embody both masculine and feminine energy within you,” he says. “I’ve been able to move through both masculine and feminine spaces with a natural fluidity.”\n\nWhen I spoke to Snyder and Stephens, they had recently returned from Los Angeles Pride. I went to LA Pride this year, too, and noticed a lot of hypermasculine energy in the form of shirtless men at an outdoor Mariah Carey concert. I asked them how they navigated what can seem like rigid notions of gayness in places like West Hollywood — where clubs lure in patrons with flyers of cis men flaunting rock-hard abs — while holding an identity as nuanced as Two-Spirit.\n\nAdvertisement\n\nShowing up to those spaces in full regalia from their culture is a big part of the battle itself. Visibility is key here; dressing to reflect their authentic selves is a reminder that there are other ways of existing. Often, they tell me, just attending an event as visibly Indigenous is enough to spark interest and conversations about their identity. Another, more fundamental part of being in gay spaces as Native American people is simply to remind others that tribal communities are still here, thriving — and they have something to teach everyone.\n\nStevens (left) and Snyder say just attending an event as visibly Indigenous is enough to spark interest and conversations about their identity. Nia MacKnight for HuffPost\n\nIn a world where a Western way of expressing queerness has triumphed on our TV screens and in media, it’s important to be reminded that there are alternatives. We don’t all have to have the same coming-out stories and identify with labels like “gay” or “lesbian” — there are limitless possibilities out there for how we navigate our queerness.\n\nAdvertisement\n\nBut Snyder’s and Stevens’ mission exists outside of gayborhoods, too. Not all Indigenous communities embrace people who are Two-Spirit, and many are not immune to the queerphobia that exists everywhere else in the country. Snyder tells me that one of his dreams is to help create a pan-tribal sense of Two-Spirit identity, so that more Native American people who identify with the label can come together and shape its future.\n\nSynder (left) and Stevens reflect the powerful ways Indigenous culture and gender fluidity intersect. Nia MacKnight for HuffPost\n\nWhen you’re in LA or New York, it’s easy to feel like you’re at the center of the queer world. In reality, the axis of that center shifts depending on what your values are. For Snyder and Stevens, I get the sense that that queer center lies not in gay clubs, bars and parades, but at pow wows and within each other. When they are dancing in sync it’s hard not to see them as two spirits that, once they connect to centuries-old ancestral beats, become one.",
  "authors": [
    "Contributing Writer"
  ],
  "url": "https://www.huffpost.com/entry/native-indigenous-queer-couple-two-spirit_n_64ad821fe4b0e87d6557141a"
}