{
  "title": "Una fuerte tormenta en el Pacífico aumenta el riesgo de inundaciones y deslizamientos en el sur de California",
  "text": "CNN —\n\nUna fuerte tormenta del Pacífico está dejando intensas lluvias en el sur de California, lo que incrementa el riesgo de inundaciones potencialmente mortales, deslizamientos de tierra y flujos de escombros, especialmente cerca de zonas afectadas por incendios recientes en el área de Los Ángeles.\n\nEl Servicio Meteorológico Nacional (NWS, por sus siglas en inglés) informó en su reporte de la 1:00 a.m. hora de Miami de este domingo (10:00 p.m. hora del Pacífico del sábado) que las alertas de inundación se cancelarían a partir de las 3:00 a.m. hora de Miami para parte del suroeste de California, incluyendo el condado de Los Ángeles.\n\nEntre los impactos previstos por el NWS están inundaciones menores en áreas bajas y de mal drenaje, aumento del cauce en pequeños arroyos y cauces normalmente secos, acumulación de agua en áreas urbanas y flujos menores de escombros en zonas recientemente quemadas.\n\nThe Los Angeles Times reportó el sábado que una niña de 5 años está desaparecida y su padre murió después de que una ola los arrastrara al océano en Garrapata State Park, a lo largo de la costa de Big Sur, la tarde del viernes, según las autoridades.\n\nSe han emitido órdenes de evacuación para “propiedades vulnerables” en las zonas de Palisades, Hurst y Sunset, según un comunicado del viernes de la alcaldesa de Los Ángeles, Karen Bass.\n\nLa amenaza está relacionada con una tormenta que se extendió durante varios días y que comenzó el jueves en el norte y centro de California. En muchas localidades, el sábado cayó más lluvia de la que suele registrarse en un mes, y se espera que continúe.\n\nNoviembre marca el inicio de la temporada de lluvias, siendo diciembre a febrero los meses más húmedos en el área de la bahía.\n\nDurante la tormenta del viernes, un hombre de 71 años falleció cuando su auto fue arrastrado por un puente inundado en el valle de Sacramento, y un padre murió al intentar rescatar a su hija de 5 años de olas de seis metros en una playa del parque estatal en la costa central.\n\nVehículos circulan por zonas inundadas en la rampa de conexión de la autopista 880 en dirección norte con la autopista 24 en Oakland, California, el 13 de noviembre de 2025. San Francisco Chronicle/Hearst/Getty Images\n\nEl riesgo de inundaciones ha aumentado debido a un río atmosférico que aporta humedad desde el océano.\n\nPartes de la región, incluyendo gran parte del área de Los Ángeles, se encuentran bajo un riesgo de lluvias torrenciales de nivel 3 de 4 para el sábado, según el Centro de Predicción Meteorológica.\n\nDesde la madrugada de este sábado, se han registrado hasta 38 milímetros de lluvia en el área de Los Ángeles, con acumulados superiores a 50 milímetros al noreste, en el condado de Ventura.\n\nLos Ángeles y Long Beach, entre otras ciudades del sur de California, han recibido más lluvia este sábado que el promedio de todo noviembre. Oxnard registró 40 milímetros, cuando el promedio mensual es de 18 milímetros.\n\nLos Ángeles ha acumulado 70 milímetros de lluvia desde la madrugada del viernes, más del triple del promedio de noviembre en menos de 48 horas.\n\nEsta segunda ronda de lluvias conlleva el peligro adicional de caer sobre suelo ya saturado, que tiene dificultades para absorber más agua y comenzará a inundarse más rápidamente que el suelo seco.\n\nAdemás, existe la posibilidad de que se produzcan tormentas eléctricas severas aisladas dentro de las lluvias más intensas entre la noche del viernes y el sábado. Algunas de estas tormentas podrían generar ráfagas de viento dañinas, granizo y quizás un tornado de corta duración.\n\nGran parte del área de Los Ángeles permanece bajo vigilancia de inundaciones hasta la noche del sábado. El Servicio Meteorológico Nacional (NWS, por sus siglas en inglés) advierte que la tormenta podría provocar flujos de escombros peligrosos, cortes de energía e inundaciones en carreteras.\n\nLas zonas afectadas por incendios forestales, en alerta\n\nLas zonas afectadas por los recientes incendios forestales en la región serán particularmente vulnerables a deslizamientos de tierra y aludes de escombros.\n\nLos incendios forestales no solo destruyen la vegetación que normalmente absorbería parte de la lluvia, sino que su calor extremo puede alterar el suelo, creando una capa impermeable justo debajo de la superficie.\n\nLas órdenes de evacuación vigentes hasta la mañana del domingo incluyen partes de las zonas de Palisades, Hurst y Sunset, pero no son las únicas en riesgo de flujos de escombros peligrosos.\n\nCNN\n\nEl NHS en Los Ángeles advirtió el viernes que partes de las zonas de Eaton y Bridge también presentan una alta amenaza de flujos de escombros “significativos”.\n\nSe espera que las lluvias más intensas disminuyan a finales del sábado, pero la región no estará fuera de peligro de inmediato. Las lluvias persistirán hasta el domingo y el suelo estará saturado. No se necesitará mucha lluvia para provocar inundaciones menores o mantener las carreteras resbaladizas, especialmente en lugares que suelen drenar lentamente después de grandes tormentas.\n\nEste reporte fue actualizado con nueva información.",
  "authors": [
    "Briana Waxman",
    "Taylor Ward",
    "Mary Gilbert"
  ],
  "url": "https://cnnespanol.cnn.com/2025/11/14/clima-y-tiempo/california-tormenta-inundaciones-trax"
}