{
  "title": "Precipice review – horror on the Thames in a baffling musical dystopia",
  "text": "This climate disaster musical takes place in a tower block overlooking the Thames. The setting is central because the dystopia has been caused by a biomedical waste dump in the river. London is flooded and this flat on the 16th floor is the safest place to live.\n\nOr so it seems, because things are very opaque in this experimental production. Devised by director Adam Lenson, Stu Barter, Rachel Bellman, Annabelle Lee Revak, Darren Clark and Shaye Poulton Richards, it brings an electro-folk sound to bitty storylines in two timezones. There are the tower block survivors – it is unclear which century they are living in until close to the end when they mention the year 2425 – and a second storyline in the past which might be the 1990s (there is talk of DVDs) in which a couple moves into a luxury high-rise overlooking the Thames (the same 16th-floor flat?).\n\nAsh (Eric Stroud) is a scientist, Emily (Holly Freeman) a civil servant. Both are, handily, implicated in the climate disaster to come. Short scenes take us through their relationship and the storyline on toxic waste but they seem like filler between the songs.\n\nView image in fullscreen Meditative music … Precipice. Photograph: Alex Brenner\n\nThe music is meditative in pace and grounds the story rather than propelling it, especially as the relationship between the couple begins to fray. Some instrumental accompaniments are nice (with synth, guitar, cello and harmonica) but the songs are not infectious in themselves, with cumbersome lyrics that aspire for emotional interiority but sound waffly and pedestrian. There is one about a game of Monopoly, another about a mudlarker that does not seem to belong to this musical, and one about the increase of anti-microbial resistance, which is quite a mouthful.\n\nIts various strands hold promise but none engage or progress enough. There is haphazard worldbuilding within the dystopia: we meet characters as they celebrate “The Balance” (what is this?) and give thanks to its founder, Robin Blake (who is he?). There is a deadly, Hunger Games-style Tombola which ends in one resident’s eviction but we do not gather enough detail about the dangers of the world beyond this tower so the stakes remain low. A character called Biscuits (Max Alexander-Taylor) gets the short straw but we know so little of his backstory or his fears that the force of this storyline is neutered. Flashbacks lack significance and elementary facts are revealed too late (we are told that martial law was established in this society in the year 2034).\n\nThe endeavour to create a new, boundary-breaking musical form is clear but the attempt at reconception drowns out the drama.",
  "authors": [
    "Arifa Akbar"
  ],
  "url": "https://www.theguardian.com/stage/2025/nov/19/precipice-review-climate-disaster-musical-new-diorama-london"
}