{
  "title": "Men of the Manosphere review – a truly terrifying hour",
  "text": "Just as you can accurately measure the quality of a documentary about pornography by the number of examples of its subject that it does not show, so too you can judge a programme about “incel” culture/the manosphere/toxic masculinity by the amount of time it does not devote to the noxious leaders of the subculture. Porn documentary makers often seem to use their commission to indulge their own murky fascinations, or at the very least fill the screen with naked women as an easier way to hook viewers than constructing a decent programme. Similarly, stuffing any programme with footage of the poster boys’ diatribes, generally about pussies (female, metonymically; males metaphorically), power and the need for men to wield one over the other is a titillating opportunity and an easy shortcut to engagement.\n\nBelfast broadcaster James Blake admirably avoids this trap in his hour-long film Men of the Manosphere. It has snippets of the loudest, vilest voices, doing their loudest, vilest thing, telling young, disaffected, vulnerable men what they want to hear: that the problems in their lives are the fault of women, feminism, woke society, beta men and anyone who is not full of ambition, independent spirit and willing to subscribe to the influencer’s latest course on how to be a successful man. If you have spotted any inconsistencies here, you are probably a blue-pilled cuck and not the target market, so please move along.\n\nBut Blake’s main focus is on the recipients of these proliferating messages, the recruited rather than the recruiters – although, as we shall see, the line between the two is blurry almost by design. Blake himself, who is only 32, drifted towards the brutal comforts offered by the manosphere a few years ago after the breakup of a five-year relationship that he had expected to end in marriage and a family. At one point in the programme, he scrolls back through the material he was looking at – and reposting to his followers – at the time and is mortified by what he finds. “It’s almost like a different person,” he says. “I was hurting, and this content gave it a voice.” His journey into the manosphere was relatively brief, then he came to his senses. For the young men he interviews, however, the journey started earlier and goes further.\n\nSixteen-year-old Sam has been involved with the manosphere since he was 13. He is a paying subscriber to one influencer in particular (“He changed my life … He taught me how to grow up”), whose online success he hopes to emulate when he has learned enough. His own first TikTok video two years ago resulted in a huge amount of bullying at school. Since then he has taken further refuge online. “I don’t have any friends in real life any more,” he says.\n\nLike James, 22-year-old criminology graduate Shane found comfort in the “red pill” ideology after a breakup. Red-pilling means rejecting societal conventions – especially those around treating women with respect (“master manipulators” is a favourite refrain of red-pill promulgators) – and concentrating on yourself instead (especially your muscle mass and earning potential). “If you don’t get too invested [in women], you can avoid all the heartbreak and stuff,” says Shane. Couldn’t that be quite unfulfilling, wonders Blake, whose shared sex and closeness in age, class and experience to his subjects, as well as his evident sanguinity and compassion, elicits strikingly guileless and relatively elaborate answers from all of them. Shane says he is struggling with the fact he has feelings for his new girlfriend that are hard to reconcile with the recommendation to play the field because “nice guys get nowhere”.\n\nJack, 27, has been a follower of the red-pill lifestyle since the pandemic. Men, he says, need to stop feeling sorry for themselves: “No one’s coming to save them.” He dreams of becoming an online guru and is paying £650 a month to learn how to go about it. In the meantime, he is on a “semen retention journey”. “If you can control your lust and your sex drive,” he explains, “you can control your mind. People don’t realise it, every time you masturbate, you’re releasing your masculine energy, your testosterone.” Blake plays an admirably straight bat with it all.\n\nA combination of confusion, contradiction and loneliness – when Sam finally meets some of his online friends in the flesh, his joy is heartbreaking – suffuses every interaction James has with these young men. It is clear that none of them are evil or anything close to it. But they are adrift in a world that is changing in ways it is easy for them to believe are not for the better, and vulnerable to predators. They may not be being groomed by more powerful men for sexual reasons, but there are plenty of other types of exploitation, many of which make them even more of a potential threat to others’ happiness and safety than they are to their own. Men of the Manosphere is a thoughtful, tender, terrifying hour.",
  "authors": [
    "Lucy Mangan"
  ],
  "url": "https://www.theguardian.com/tv-and-radio/2025/nov/17/men-of-the-manosphere-review-a-truly-terrifying-hour"
}