{
  "title": "Framework’s franken-laptop is back with big chip upgrades and familiar frustrations",
  "text": "is a reviewer covering laptops and the occasional gadget. He spent over 15 years in the photography industry before joining The Verge as a deals writer in 2021.\n\nPosts from this author will be added to your daily email digest and your homepage feed.\n\nFramework did it again. It promised modular, upgradeable, and user-repairable laptops where other manufacturers dare not venture or have outright failed. And it’s delivered.\n\nThe 2025 version of the Framework Laptop 16 comes with not only new AMD Ryzen AI CPU options, but also Wi-Fi 7, a more powerful USB-C charger, redesigned cooling, and a new webcam — all of which are also sold separately, so existing owners can upgrade. But the biggest bump by far is a more powerful user-replaceable graphics card. The modular, removable GPU is what separates the Laptop 16 from any other laptop on the market. When it announced the Laptop 16, Framework called upgradable graphics the “holy grail.” Even after the Laptop 16 launched, the company was at times cagey about whether it could deliver future upgrades. Now it has, in the form of an Nvidia GeForce RTX 5070, offering a sizable improvement in graphics performance over the last-gen AMD Radeon card.\n\nThe original Laptop 16 was hot, loud, and creaky, and frankly, it felt a bit unfinished — some of which improved over time. The new model is a few small steps forward in many ways, and a leap forward in graphics power, but it’s still a long way from polished.\n\n6 Verge Score Framework Laptop 16 (2025) $ 1799 $ 1799 The Good Fully user-repairable and upgradeable\n\nSizable boost in gaming performance with RTX 5070\n\nAmazing levels of customization, from ports to keyboard / trackpad alignment\n\nNice quality high-res, high-refresh LCD The Bad A concerning amount of BSOD crashes during testing\n\nLid still has lots of flex\n\nSide spacers are still uneven and creaky\n\nAuto brightness is erratic and jumpy\n\nStill feels a little janky, like a Franken-laptop\n\nOriginal owners need to buy a new display for G-Sync $1799 at Framework How we rate and review products\n\nThe base model prebuilt Framework Laptop 16 starts at $1,799 with no discrete graphics. Our review unit is a DIY Edition with an AMD Ryzen AI 7 350 mainboard, an RTX 5070 graphics module, 16GB of RAM, and a 1TB SSD. This configuration with a 240W USB-C charger costs $2,524 before even adding extras like more expansion cards, colorful spacers, an optional number pad, an RGB macro pad, or the standard expansion bay module (in case you want to leave the GPU butt at home to save weight). The closest prebuilt version is the $2,449 Performance tier, which includes the 5070 and comes with a smaller 512GB SSD and a Windows 11 license.\n\nComponent report card Screen: B\n\nWebcam: C\n\nMic: C\n\nKeyboard: A\n\nTrackpad: B\n\nPort selection: A\n\nSpeakers: C\n\nNumber of ugly stickers to remove: 0\n\nSince this is much the same laptop as the 2023 model, owners of the original can upgrade their Laptop 16 piecemeal with new and improved second-gen parts. The enticing new Ryzen AI 300-series mainboards with included Wi-Fi 7 module and Framework’s revised heatsink design cost $749 to $1,049, while the standalone RTX 5070 graphics module is $699, and the new 240W USB-C charger to adequately power them is $109, making this double-chip upgrade $1,557 to $1,857. That’s the price of a whole laptop.\n\nPrevious Next\n\n\n\n\n\n1 / 4 Changing the graphics module is the same process as the first-gen model. Power down and remove the trackpad and keyboard.\n\nOther improvements add up further, including a second-gen 1080p webcam ($39), more rigid second-gen top cover lid ($139), and second-gen display ($279). The display hardware is actually the same, but with a firmware update for Nvidia G-Sync instead of the first-gen’s AMD FreeSync support. Unfortunately, if you have a first-gen Framework 16 and want to take advantage of variable refresh rate (VRR), which makes resource-constrained games feel far smoother on average, you’ll need to spend $279 on a display that’s hardware-identical to the one you already have; you can’t change that firmware yourself. That’s hugely disappointing, and it pushes the cost of getting everything out of GPU upgrade to nearly a thousand dollars.\n\nThe new Nvidia RTX 5070 module (top) and last-gen AMD Radeon RX 7700S module (bottom). The new 240W USB-C charger (left) isn’t much bigger than the last-gen 180W model (right).\n\nFramework CEO Nirav Patel told The Verge in an email, “Our display vendor hasn’t been able to create a technical solution that would enable firmware updateability on the panel we use in Framework Laptop 16, whether in users’ hands or in our own service centers.” And when asked about any sort of VRR for the first-gen display, Patel added, “Unfortunately VRR is not possible with the NVIDIA GPU and 1st gen display.” So you can still get the full performance boost of the new Nvidia GPU without the new display, but losing VRR is an odd omission. And frankly annoying.\n\nThe eight-core Ryzen AI 7 350 mainboard, meanwhile, is modestly faster than the last-gen Ryzen 9 7940HS, with Geekbench CPU, Cinebench, and PugetBench Photoshop gains as high as 21 percent and as low as just 1.5 percent. (There’s also a 12-core Ryzen AI 7 370 mainboard option, which I didn’t test. But based on my benchmarks from the Razer Blade 16, its main benefit is multi-core performance — scoring 15 percent higher than the 350 in our Photoshop test.)\n\nSystem Framework Laptop 16 (2025) / RTX 5070 / Ryzen AI 7 350 / 16GB / 1TB Framework Laptop 16 (2023) / Radeon RX 7700S / Ryzen 7940HS / 16GB / 512GB + 2TB Asus ROG Zephyrus G16 (2025) / RTX 5070 Ti / Intel Core Ultra 9 285H / 32GB / 2TB Asus ROG Strix Scar 16 / RTX 5080 / Core Ultra 9 275HX / 32GB / 2TB Razer Blade 16 (2025) / RTX 5090 / Ryzen AI 9 HX 370 / 32GB / 2TB Geekbench 6 CPU Single 2897 2386 2881 3113 2968 Geekbench 6 CPU Multi 12566 10490 17004 19709 15922 Geekbench 6 GPU (OpenCL) 122744 75031 155238 200189 213016 Cinebench 2024 Single 117 100 127 137 119 Cinebench 2024 Multi 858 808 1103 1965 1287 PugetBench for Photoshop 7560 7445.67 8058 8482 8679 Sustained SSD reads (MB/s) 5280.31 6913.12 6370.16 6832.06 6726.25 Sustained SSD writes (MB/s) 4560.47 4515.63 5883.37 6550.21 4931.41 3DMark Time Spy 13424 10003 13707 20977 22498\n\nThe new graphics card is the bigger update. Graphics-intensive tests like the Geekbench GPU benchmark and 3DMark’s Time Spy show 64 percent and 34 percent improvements, respectively. In fully rasterized gaming benchmarks across Black Myth: Wukong and Cyberpunk 2077, the new Laptop 16 yielded about a 36 to 50 percent increase in average frame rates over the original Radeon RX 7700S module. The delta increases further when using Nvidia’s DLSS 4 rendering on the new model compared to the last-gen with AMD’s FSR 3.1.\n\nI was able to play Battlefield 6 at its High graphics preset using the panel’s native 2560 x 1600 resolution and maintain a consistent 80 to 90fps with DLSS 4 set to Quality. Turning on frame generation boosted that to around 130 to 140fps, with 3x Multi Frame Generation eclipsing the panel’s 165Hz refresh rate. And I played BF6 with the Laptop actually on my lap, where it got very warm but not unbearably hot (though I’d be less tolerant and much sweatier in the summer).\n\nPrevious Next\n\n1 / 2\n\nThe original Laptop 16 got especially hot, and under load, its fans sounded like a small jet engine. Framework redesigned the thermal management system with new heatsinks and fans, and it makes a big difference. I torture tested both old and new models with a looping Black Myth: Wukong benchmark for over 30 minutes. The old Ryzen 9 7940HS averaged 58 degrees Celsius and reached a piping hot 93C; the new AMD Ryzen 7 AI 350 CPU averaged an internal temperature of 50C and peaked at 64C. The new Laptop 16 still gets loud, but it’s noticeably quieter. Instead of a constant jetlike whine, it’s more like white noise — albeit pretty loud white noise when the laptop’s really pushing it.\n\nThree ports on either side, and an extra USB-C on the rear. I love that I can ensure I have a full-size SD card slot. Framework has all kinds of expansion cards these days, including various colors. The fingerprint sensor is the only means of biometric sign-in. The mic and webcam kill switches are right besides the camera, just like other Framework laptops.\n\nAs with other Framework devices, the Laptop 16’s flexibility is its great strength. It wouldn’t be a Framework without swappable expansion cards — of which the Laptop 16 maintains six, for three customizable ports on each side; you can charge the laptop from any of the rear four. And the keyboard and trackpad are even more flexible than on Framework’s other laptops. You can center them and fill the sides with colorful spacers, or you can put a macropad or number pad either to the left or right, and align the keyboard and trackpad accordingly.\n\nThe keyboard is available with either white or RGB backlighting, and in a multitude of language options (or with clear keycaps). It’s one of the better notebook keyboards, with a touch of the Laptop 13’s pillowy feel and deep key travel, but with firmer tactile feedback. And it’s fully customizable using QMK. The mechanical trackpad is good, if slightly small for a laptop of this size (especially compared to those on the 16-inch MacBook Pro and Razer Blade 16), and having the freedom to left- or right-align is unique.\n\nPrevious Next\n\n\n\n\n\n1 / 4 The spacers have enough of a panel gap to sometimes notice the shiny internal metal shielding catch the light. It’s all such an eyesore.\n\nUnfortunately, Framework’s spacer-heavy design is ingenious in theory and infuriating in practice. The components often don’t line up quite right — you can feel the edges under your wrists — and it creaks a whole lot. It just doesn’t feel like something that costs two and a half thousand dollars.\n\nFramework included a prototype trackpad with a 3D-printed edge-to-edge surround, and as soon as I tried it I never wanted to go back to those annoying spacers. This one tweak to the Laptop 16’s design made it feel a tiny bit more like using something more well put-together, like an Asus ROG Zephyrus G16. Even though the prototype surround is cheap plastic and the spacers are made of aluminum, I was glad to ditch the frequent creaking. You can print your own trackpad surround for now, but I’d like to see Framework sell a proper all-metal alternative. It’d be foolish to expect a fully user-serviceable laptop to be as sleek and seamless as a MacBook Pro, but I wish it didn’t feel like such an erector set.\n\nPrevious Next\n\n\n\n\n\n1 / 4 The Framework Laptop 16 versus the lighter and more compact Asus ROG Zephyrus G16.\n\nThe lack of polish pops up in other areas. The IPS panel is crisp, with a 2560 x 1600 resolution and up to 165Hz refresh rate, just like the original. Its problem is an overly aggressive, erratic auto-brightness: rather than a smooth fade up or down, it increases and decreases in visible steps, like someone secretly hitting the brightness keys for you, trying to guess what you want. I asked Framework if this behavior might be improved, but rep Eric Schumacher gave only a lukewarm statement: “We’ll continue to do post-launch firmware updates to improve user experience and resolve issues found by customers.”\n\nAnd while Framework says the lid is sturdier than before, it’s still not sturdy enough. Closing it carefully from the center is fine, and it’s ever-so-slightly more solid than the first-gen in that spot. But grab a corner and gently pull or push the screen, and it’s flex city. Other slightly lackluster components include the speakers, which sound flat and lifeless until you crank them, and the webcam, which is sharp but often dark and muddy in low light.\n\nPrevious Next\n\n1 / 2 Weird flex, but okay.\n\nBattery life during my normal workday of many Chrome tabs, incessant Slack messaging, and simultaneous Spotify or Twitch streams was pretty good for a machine with discrete graphics, though it usually lasted a max of six-ish hours instead of a full eight-hour workday.\n\nBut where the second-gen Laptop 16 has faltered the most so far is in its reliability. It crashed around six times in the first two days, both while on battery and while plugged in — and sometimes while waking it up from sleep or when plugging it into power. It got slightly better after some initial BIOS and driver updates, but it still crashed another half dozen times over the next week.\n\nJust for fun, here’s the Framework doing its best Razer Blade impression.\n\nIn the two days since I installed the 3.04 BIOS update that will be shipping to customers, it’s only crashed once. Framework seems to be improving the stability of the Laptop 16, much like it did after the first one launched, but it might not be out of the woods just yet. I’ll have to keep testing it after further updates.\n\nIt’s easy to admire Framework’s commitment to repairability and upgradability, and its overall execution has been solid. The thin and light Laptop 13 has slowly been refined into an excellent all-around package, and the company’s Laptop 12 and Desktop both came out of the gate strong. Its biggest laptop still feels the most like a beta test.\n\nIt may still be a little janky, but there’s no denying that the color and customization options are fun.\n\nThe Laptop 16 is now updated with 2025 hardware, but its structural rigidity, fit, and finish still come up short. I’m hoping the incremental refinements will continue; something like a single-piece metal trackpad surround would go a long way. Because of the price, it’s hard to deny the temptation of non-upgradeable gaming laptops that are thinner and sleeker, such as the ROG Zephyrus G16, or more powerful. But maybe Framework can Ship of Theseus its way to a design that feels like less of a compromise.\n\n2025 Framework Laptop 16 specs (as reviewed) Display: 16-inch (2560 x 1600) 165Hz IPS with Nvidia G-Sync\n\nCPU: AMD Ryzen AI 7 350\n\nGPU: Nvidia GeForce RTX 5070 Laptop GPU\n\nRAM: 16GB DDR5 5600MHz\n\nStorage: 1TB M.2 NVMe 2280 SSD, with extra M.2 2230 slot\n\nWebcam: 1080p 30fps with privacy switch\n\nConnectivity: Wi-Fi 7, Bluetooth 5.4\n\nPorts: 6x modular ports for Framework Expansion Cards\n\nBiometrics: fingerprint sensor in power button\n\nWeight: 5.29 pounds / 2.4kg\n\nDimensions: 14.04 x 11.43 x 0.82 inches / 356.58 x 290.20 x 20.95mm\n\nBattery: 85Wh\n\nPrice: $2,524.00\n\nPhotography by Antonio G. Di Benedetto / The Verge",
  "authors": [
    "Antonio G. Di Benedetto"
  ],
  "url": "https://www.theverge.com/tech/821420/framework-laptop-16-2025-nvidia-rtx5070-review"
}