{
  "title": "Inside the hunt for the Louvre heist suspects",
  "text": "EDITOR’S NOTE: This account of the investigation into the Louvre heist is based on public statements by prosecutors and museum officials, as well as investigators in France and the United States who agreed to speak with CNN on the condition of anonymity.\n\nIt was early evening on Saturday, October 25, the surveillance team’s fourth day trailing a 34-year-old Algerian suspect through Seine-Saint-Denis, outside Paris.\n\nThe work had been tense and tedious. A diverse area, Seine-Saint-Denis is home to people of more than 130 nationalities, many of them of North African origin. For the surveillance team – an arm of the Paris Prefecture of Police known as the Brigade de Recherche et d’Intervention, or BRI – blending in among residents in tight-knit neighborhoods was challenging.\n\nNow, the suspect was on the highway. The team did not know where he was going, but he appeared by his route to be headed to Charles de Gaulle Airport.\n\nHe also had a bag. Inside, he might well have the crown jewels of France.\n\nSix days earlier, a heist at the Louvre museum had stunned the world. Four robbers moving with purpose and dispatch broke into the most visited museum on the globe and made off with a collection of jewels carrying an estimated value of more than $100 million.\n\nBut this was about more than money. It was a stab at the heart of French history. Among the items stolen were an emerald necklace set with more than 1,000 diamonds that Napoleon gifted to his second wife, and a diamond and sapphire jewelry set worn by Queen Marie-Amélie and Queen Hortense.\n\nThe set of jewelry worn by Queen Marie-Amélie and Queen Hortense sits on display in January 2020 inside the Louvre's Apollo Gallery. Stephane de Sakutin/AFP/Getty Images\n\nFollowing the suspect on the highway, the BRI played leapfrog, communicating by radio to manage the artful choreography of switching tails so no one car was behind the Algerian for too long.\n\nThe team leader asked the chain of command: If the target walks into the airport, do we take him?\n\nStay with him, the instructions came back. Let him go as far as you can.\n\nThe surveillance team spread out. Soon, the suspect had a ticket, passed through security and headed for a gate. He was booked on the next flight to Algiers.\n\nAt 8 p.m., with no one appearing to approach him, the order came down: Take him.\n\nAfter his arrest, a search of his bags revealed none of the jewels.\n\nThe investigators\n\nWe tend to romanticize the people who commit these crimes. The culprits we imagine are handsome, suave and sophisticated as they rappel from a skylight in black turtlenecks, navigating a spiderweb of laser-powered motion sensors. The priceless works of art and gems they steal end up in a supervillain’s collection in a faraway mountain castle. Maybe the works of Rembrandt, Vermeer and Degas stolen from Boston’s Isabella Stewart Gardner Museum in 1990 hang there, while their empty frames haunt the walls of the Gardner, waiting for them to come home.\n\nBut that’s the stuff of Hollywood. In this case, Paris prosecutors have described the four suspects currently in custody – three of whom are believed to have been directly involved in the heist – as local petty criminals with no connection to organized crime. None has been publicly identified by authorities.\n\nThe hunt for the Louvre suspects has relied on investigators like the BRI, which I spent time with after the 2015 Paris terrorist attacks as the then-deputy commissioner of intelligence for the NYPD. I was impressed by their mastery of blending in as they followed suspects to catch them in the act, using team members of mixed ethnicities who tailed their targets by whatever means best suited the situation: in nondescript cars, vans, taxis, scooters or motorcycles, or on foot on the street or in the Paris Metro.\n\nA surveillance camera is seen on the Louvre's facade, three days after the robbery. Thibault Camus/AP\n\nThe heist investigation has also involved the Paris police’s robbery squad, the Brigade de Répression du Banditisme, or the BRB. These detectives investigate crews like the Pink Panther gang, suspected of robbing diamonds across the continent and selling them in a black market in Antwerp, Belgium. And they’ve solved many high-profile cases, including the 2016 armed robbery of Kim Kardashian in Paris, in which thieves got away with nearly $10 million worth of cash and jewelry. The BRB’s work in that case led to the convictions of eight people.\n\nRich with informants across the Paris underworld, BRB detectives could tap their networks for immediate theories (and maybe a name or two) in the Louvre case. But they might all lead to dead ends.\n\nInstead, the BRB focused on forensics. A fingerprint, a hair, a trace of DNA – any of these could potentially lead to an actual name through France’s national DNA database, which holds samples taken from convicted criminals and suspects.\n\nThe 7-minute heist\n\nThe robbery was designed to be quick – in and out.\n\nOne month ago, on Sunday, October 19, four robbers drove a lift truck, stolen days earlier, below the windows of the Louvre’s Apollo Gallery, where the jewels were on display. To make their presence look legitimate, they placed orange cones around the truck and wore high-visibility vests.\n\nTwo stayed on the ground while two others went up in a bucket lifted along the truck’s extending tower. Using angle grinders, they forced open a window and entered the gallery. There, they broke into two high-security display cases and took nine items, brandishing their angle grinders whenever guards approached. Within four minutes, the pair was out the window and descending on the lift.\n\nThen, they dropped it: The imperial crown of Empress Eugénie slipped, falling nearly two stories with its 1,354 diamonds and 56 deep green emeralds. It landed between two fences in a dry moat, according to a source, who told CNN that bystander video showing the two men bent over, looking down from the lift, captured the moment the crown fell.\n\nFrench investigators are seen shortly after the heist, next to a lift truck robbers used to enter the Apollo Gallery. The truck itself had been stolen days earlier. Dimitar Dilkoff/AFP/Getty Images\n\nThey would have to leave without the crown of the crown jewels.\n\nWitnesses said the thieves tried to set the lift truck on fire with a handheld blowtorch and gasoline but were interrupted by a museum security officer.\n\nSoon, they were out of time. They hopped on Yamaha TMAX scooters and fled.\n\nThe entire heist took just seven minutes, French Interior Minister Laurent Nuñez said.\n\nClosing in\n\nOn the first day of the investigation, the Paris police’s forensic team worked slowly and deliberately, photographing the scene, swabbing for DNA, dusting for fingerprints and securing what clues had been left behind: an angle grinder, a white helmet, a blowtorch, the orange cones.\n\nMeanwhile, the BRB was working with the police command center, which controls thousands of cameras and license plate readers throughout Paris. Investigators found footage of the suspects on scooters escaping along the Seine at speeds of about 100 mph before they abandoned the scooters and switched to cars, headed east.\n\nOne of those scooters was recovered and processed for DNA and prints. Police were going to leverage every opportunity to collect forensic evidence.\n\nA police officer examines the lift used to steal jewels from the Louvre. Gonzalo Fuentes/Reuters\n\nTheir efforts paid off. DNA recovered from the getaway scooter matched that of the 34-year-old Algerian and was already in the criminal database, leading to his arrest at the airport on the night of October 25.\n\nAnd DNA from the angle grinder and the window at the Louvre matched that of another individual, according to prosecutors: a 39-year-old unlicensed taxi driver who was previously known to police for aggravated theft and was under judicial supervision for ramming a car into an ATM to get the cash inside.\n\nStill, the histories of both men seemed out of league with the daring Louvre heist, which seemed at first to be the work of seasoned professionals.\n\nBut investigators were confident they were onto the right suspects. The DNA evidence gave them a level of certainty.\n\nPulling in the nets\n\nShortly after taking the Algerian into custody at the airport, officials were faced with another decision. Once the taxi driver – already under BRI surveillance – knew his alleged accomplice was in custody, he might try to run, too.\n\nThe order came down to the team to arrest him immediately.\n\nFour days later, on October 29, French prosecutors claimed the two men had made “partial” admissions related to the crime. Sources told CNN the admissions came as the suspects tried to explain why their DNA would have been found at the scene, on the tools or a getaway vehicle.\n\nBased on those statements – along with information retrieved from the two suspects’ cellphones and other observations made during the surveillance operation – investigators developed other persons of interest.\n\nSoon after, the BRB detectives began to pull in their nets. They arrested several more people in Paris and Seine-Saint-Denis, though all but two would be released without charge within days.\n\nFrench police inspect and collect objects believed to be left by the perpetrators of the heist. Clément Lanot/CLPRESS\n\nOne of those two, a 37-year-old, is believed to be the third member of the Louvre robbery team. The fourth person is a 38-year-old woman said to be in a relationship with one of the male suspects. Whether investigators believe she was part of the planning or allegedly helped the suspects after the fact is unclear. Both of these suspects have denied any involvement, prosecutors say.\n\nAll four suspects have been placed under formal investigation for organized theft and criminal conspiracy.\n\nTaken together, the arrests mean police potentially have three of the four suspected robbers in custody. Still, the jewels have not been found.\n\nWill the crown jewels reappear?\n\nThere have been better outcomes in the wake of past heists. Take the 1964 case that became a prototype for much of the art-theft fiction that has followed.\n\nThat year, Jack “Murph the Surf” Murphy – a self-proclaimed violinist, Miami-based surfer and professional jewel thief – came to New York with an audacious plan to steal the Star of India, the world’s largest star sapphire, and a half dozen other diamonds and rubies locked inside glass cases at the American Museum of Natural History.\n\nWith a lookout posted outside, Murphy and an accomplice rappelled on a rope from above, gathered the gems, and disappeared into the night, undetected by alarms or security staff. In that way, it was just like the movies.\n\nBut within two days, the NYPD had arrested the first suspect, and a short time later, the other two, including Murphy. Months later, Murphy reached a deal with the district attorney. If the jewels were returned, the sentence would be short. Indeed, Murphy and his crew spent just three years in New York’s Rikers Island prison after the gems were recovered from a locker at a Miami bus depot, and today, the Star of India sits in its place at the museum.\n\nCould something similar happen in the Louvre case? Will the jewels be returned, or the tiaras and necklaces ransomed back by a third party? Or has the gold already been melted down, and the diamonds, rubies and sapphires pried from their settings and sold for the sum of their parts?\n\nPeople walk near the glass Pyramid of the Louvre museum in Paris, October 30. Abdul Saboor/Reuters\n\nFor that to have happened before the swift arrests of the suspects feels unlikely. It would have meant they had a jeweler talented enough to do the work, and unscrupulous enough to be willing. It may have meant having a buyer lined up. Even then, with the robbery in the headlines and police on the trail, the jewels in any form would likely have been too hot to handle, even on the black market.\n\nThat may mean there is hope yet for the crown jewels of France. History tells us that, for the right deal, they just might reappear.",
  "authors": [
    "John Miller"
  ],
  "url": "https://www.cnn.com/2025/11/19/europe/louvre-heist-robbery-suspects-thieves"
}