{
  "title": "We Mapped Elon Musk's Entire Empire",
  "text": "Transcript\n\nHis satellites shape wars.\n\nHis tweets shape elections.\n\nThere's barely a place on Earth\n\nthat doesn't feel the gravitational pull of the broligarch\n\nwhose grand gestures are erasing the line\n\nbetween private enterprise and political power.\n\nBut just how far does Elon's clout really stretch\n\nand what conflicts of interest are emerging?\n\nWIRED pulled the data\n\nand mapped out the key places that shape Elon's Empire.\n\n[rhythmic music]\n\nOur first stop is Washington DC.\n\nMusk was the single largest individual political donor\n\nin the 2024 election.\n\nAnd now he has his very own office\n\nright next door to the White House.\n\nFrom here, he administers\n\nthe newly created Department of Government Efficiency,\n\nor DOGE, whose goal is to slash a trillion dollars\n\nin so-called government waste.\n\nWith little transparency,\n\nMusk and team have fired thousands of federal employees\n\nand even locked out members of Congress\n\nfrom government offices.\n\nHe is someone who operates with a startup mentality,\n\nmove fast, rake things.\n\nHe is bringing those same tactics\n\ninto the infrastructure of the federal government,\n\nand that is what we are seeing play out in real time.\n\nMusk is basically leading\n\na restructured and rebranded US Digital Service,\n\nthe department responsible for streamlining data\n\nfrom across the federal government.\n\nSo Musk and team now have access\n\nto sensitive data about government employees\n\nand possibly proprietary data about US companies\n\nthat are government contractors,\n\nincluding his own competitors like GM, Ford,\n\nsubcontractors for OpenAI, Boeing,\n\nand Jeff Bezos's Blue Origin.\n\nPlus, Musk is now weakening agencies\n\nthat have sued or fined him in the past,\n\nsuch as the SEC, the FAA,\n\nand the National Labor Relations Board,\n\nwhich had 24 open investigations\n\ninto Musk's companies as of 2025.\n\nTheir investigations involve alleged surveillance\n\nof Twitter employees\n\nand interference with union organizing at Tesla.\n\nAt least five inspector generals\n\nthat were looking into Elon Musk's companies\n\nwere fired by the Trump-Musk administration.\n\nJust a few blocks over here\n\nis where DOGE first set up shop before Inauguration Day,\n\nin the offices of SpaceX's global government affairs\n\nand global satellite policy teams.\n\nSources tell WIRED that SpaceX engineers\n\nhave been brought in as senior advisors\n\ninside the Federal Aviation Administration,\n\nthe agency responsible\n\nfor regulating commercial space launches.\n\nSpaceX has received upwards of $18 billion\n\nin federal contracts, mainly from NASA,\n\nthe Defense Department\n\nand its National Reconnaissance Office\n\nbased in Chantilly, Virginia,\n\nwhich awarded SpaceX a $1.8 billion contract\n\nto develop a network of hundreds of spy satellites\n\nthat aims to provide\n\ncontinuous realtime surveillance capabilities globally.\n\nIn 2022, Musk played a crucial role\n\nin restoring Ukraine's communication infrastructure.\n\nThis was done in partnership with USAID.\n\nHowever, his decisions\n\nto restrict military use in certain areas\n\nled to geopolitical controversy\n\nover the privatization of critical battlefield technology.\n\nIn May of 2024, the inspector general of USAID\n\nrevealed that the agency was, quote,\n\nexamining USAID's oversight\n\nof Starlink satellite terminals in Ukraine.\n\nMusk, who became publicly hostile to USAID,\n\nrecently shut down the agency\n\nwith the blessing of Donald Trump,\n\nsparking concerns over a conflict of interest.\n\nAlthough US sanctions\n\nprohibit Starlink operations in Russia,\n\nUkrainian soldiers have claimed\n\nthat Putin's military utilizes the service.\n\nSo how extensive is Elon's web of satellites?\n\nThis constellation of dots represent thousands of satellites\n\nthat were shot into space on SpaceX rockets\n\non behalf of its subsidiary, Starlink.\n\nThey're designed and manufactured in Redmond, Washington\n\nto deliver satellite-based internet service\n\nto over 4 million global subscribers.\n\nBecause Starlink satellites are in a low Earth orbit,\n\nthe time it takes for data to travel\n\nbetween the satellite and the user is much lower\n\ncompared to traditional geostationary satellites,\n\nso it has the potential to compete\n\nwith traditional broadband internet services worldwide.\n\nStarlink launched its service in Nigeria in early 2023,\n\nand demand across Africa has surged.\n\nInterestingly, not in rural areas as anticipated,\n\nbut in major cities.\n\nMaybe Starlink's reputation for sudden rate hikes,\n\nas high as 97% in Nigeria,\n\ncontributed to the slower adoption\n\nin less developed regions of the continent.\n\nMusk's internet service has yet to get the green light\n\nin his native South Africa.\n\nOne possible reason is that by law there,\n\ncompanies applying for communications licenses\n\nmust be at least 30% owned\n\nby persons from historical disadvantaged groups,\n\nwhich includes Black people, women, youth,\n\nand people with disabilities.\n\nApparently, Starlink does not meet those requirements.\n\nRecently, Musk has called\n\nthe South African government racist\n\nbecause of a law he says unfairly targets\n\nwhite minority Afrikaners.\n\nTrump echoed Musk's position and cut aid to South Africa,\n\nmost of which supports health programs,\n\nparticularly for HIV/AIDS treatment.\n\nOne place you definitely won't get Starlink is Taiwan.\n\nWhy?\n\nWell, according to an article in the Wall Street Journal,\n\nMusk has been in contact\n\nwith Russian president Vladimir Putin since late 2022,\n\nthough the Kremlin denies this and Musk has not commented.\n\nAllegedly, Putin requested Musk\n\nrefrain from launching Starlink service in Taiwan\n\nas a favor to China,\n\nwhose military has been increasingly aggressive\n\nagainst its island neighbor.\n\nAs of February, 2025,\n\nMusk has not publicly addressed these allegations,\n\nand the Kremlin has dismissed the claims as absurd.\n\nElon Musk has strong business interests in China,\n\nhas openly said he thinks Taiwan should just go to China.\n\nStarlink's goal is to grow its constellation\n\nto 42,000 satellites, radically expanding its ability\n\nto beam the internet into more homes from space.\n\nBut on the ground, Musk's influence\n\ndoesn't stop at providing internet.\n\nIt extends to controlling the conversation itself\n\nthrough social media.\n\nIn 2022, Musk bought Twitter for $44 billion,\n\ntook it private, and eventually rebranded it as X.\n\nIt's now worth 15 billion.\n\nWith a user base of hundreds of millions\n\nof active accounts worldwide,\n\nthe social media platform's strong presence\n\nin countries like the US, Japan, Brazil, and India\n\nhighlights its significant impact across diverse regions.\n\nBut has it delivered on its promise of free speech?\n\nAfter acquiring Twitter, Musk fired most of the workforce,\n\nincluding much of the trust and safety staff,\n\nleading to a surge in hate speech\n\nand misinformation on the platform.\n\nAllegedly, at Musk's direction, X implemented code\n\nto boost his posts by a factor of 1,000\n\nto ensure they outrank others in the feed.\n\nHe has also been criticized for complying with demands\n\nfrom authoritarian governments to take down certain posts\n\nand for suspending journalists who were critical of him.\n\nMusk's vision is to transform X into an everything app\n\nthat even offers payment and financial services.\n\nThis would put X under scrutiny\n\nfrom the Consumer Financial Protection Bureau.\n\nAs of the filming of this video,\n\nDOGE is currently working to dismantle this agency,\n\nwhich is designed to protect consumers from financial abuse.\n\nMusk is no stranger to financial services.\n\nHere in Palo Alto, he founded another company\n\ncalled X.com in 1999, which ultimately became PayPal.\n\nHe sold his stake in PayPal\n\nto the tune of $180 million after taxes.\n\nHistorically, Musk's businesses have been deeply tied\n\nto California's tech and innovation hubs.\n\nHere in Mountain View is the former site of Zip2,\n\nwhich Elon and his brother Kimbal founded in 1995\n\nto provide online maps to newspapers.\n\nCompaq bought it four years later for $304 million.\n\nAll the way down the coast, in Hawthorne, California,\n\nwe can see where The Boring Company\n\ndug its first hole in 2017.\n\nA test of the feasibility\n\nof high speed underground transportation,\n\nthe 1.14-mile long test loop ran from here to here\n\nunder the parking lot\n\nof what was then the SpaceX headquarters at 1 Rocket Road.\n\nIn this office, Elon Musk famously burned the midnight oil,\n\noften working 80 to 100 hours per week,\n\nsetting the tone for what former employees described\n\nas a hardcore, high-pressure environment\n\ndriven by relentless deadlines.\n\nMusk built quite the resume in the Golden State,\n\nbut in 2020, in search of lower taxes,\n\nless regulation, and more space,\n\nhe started the process of closing down the headquarters\n\nof just about all of his businesses and moving to Texas.\n\nHe even sold three of his homes in Los Angeles.\n\nRight now, only a few major businesses\n\nremain headquartered in Silicon Valley\n\nin order to remain close to its specialized talent pool.\n\nHere in Fremont is the headquarters of Neuralink.\n\nValued at $8 billion,\n\nthe company hopes to treat neurological conditions\n\nand achieve human-AI symbiosis, but has only implanted\n\nthree brain computer interfaces so far in humans\n\nwhile euthanizing\n\nan estimated 1,500 test animals since 2018.\n\nAlso in Fremont, one of America's largest Tesla factories\n\nemploys 20,000 workers that make sedans and SUVs.\n\nAnd xAI in nearby Palo Alto,\n\nMusk's artificial intelligence startup,\n\nbirthed the AI chatbot Grok.\n\nIt was recently revealed that Grok was given instructions\n\nby xAI programmers to ignore all sources\n\nthat mentioned that Elon Musk and Donald Trump\n\nspread misinformation.\n\nDown in LA, in Hawthorne, SpaceX keeps the lights on\n\nfor the Falcon 9 rocket program,\n\nwhich launched in Santa Barbara County over here,\n\nwhich the company leases from the US military\n\nto send classified payloads\n\nfor intelligence agencies into space.\n\nTypically, the reusable rocket land somewhere over here,\n\non the drone ship named Of Course I Still Love You,\n\nElon's nod to a sentient spaceship\n\nin Ian Bank's sci-fi classic The Player of Games.\n\nBut these days, Musk's game is increasingly played in Texas.\n\nX relocated to Bastrop, 30 miles outside of Austin,\n\nand so did The Boring Company, right across the street.\n\nNot far away is the site of the Ad Astra School,\n\nMusk's private school which recently opened for enrollment\n\nto students aged three to nine.\n\nTax filings reveal that Elon Musk's foundation\n\ncontributed a hundred million dollars\n\nto support the school's launch.\n\nMusk had previously expressed support\n\nfor abolishing the Department of Education.\n\nAlso in Austin is the home base\n\nof the conservative America PAC.\n\nMusk was the primary donor to the PAC, providing 91%\n\nof the over quarter of a billion dollars raised.\n\nThe Musk Foundation is also based in Austin.\n\nDespite its $9.5 billion in cumulative assets,\n\nin 2021, 2022, and 2023,\n\nthe Musk Foundation dispersed less than legally required\n\nin order to keep its tax-exempt status.\n\nThe foundation has thus far saved Musk\n\nan estimated $2 billion plus in tax breaks.\n\nNeuralink is building new digs here in Del Valle, Texas,\n\na suburb to the east of Austin.\n\nOutside of Corpus Christi in Robstown, Texas, Tesla built\n\nthe first large scale battery-grade lithium refinery\n\nin North America.\n\nIn McGregor, Texas, about 20 miles southwest of Waco,\n\nis SpaceX's primary rocket engine testing\n\nand development facility.\n\nAnd all the way down here near the Mexican border\n\nis SpaceX headquartered in Brownsville.\n\nThis area is the hub for the development\n\nof the massive Starship project,\n\nfeaturing the largest rocket ever built,\n\ndesigned to carry humans and cargo to the moon.\n\nStarship's Human Landing System,\n\ndesigned specifically for NASA,\n\nwill also ferry astronauts between lunar orbit\n\nand the moon's surface.\n\nAnd since we're up here,\n\nwe may as well do a small detour over to Mars.\n\nSeveral uncrewed SpaceX Starships\n\nare slated to launch to Mars in 2026.\n\nCurrently, launches are estimated\n\nat around a hundred million dollars per launch.\n\nElon has also said it costs about $1 billion per ton\n\nto send cargo to Mars.\n\nJust outside the city limits of Austin\n\nis the Tesla corporate headquarters and gigafactory,\n\nthe primary production site for the Cybertruck and Model Y.\n\nThe company's market cap\n\nhas dipped to below $1 trillion recently from 1.54 trillion.\n\nAnd it's once 140,000 plus employees all over the world\n\nis down to 120,000.\n\nTesla produces 1.77 million vehicles annually,\n\nbut it only has the production capacity\n\nof 375,000 vehicles annually.\n\n650,000 Teslas can be produced annually\n\nin the old Fremont plant here,\n\nbut the vast majority are made\n\nin the Shanghai, China Tesla factory,\n\nwhich has the capacity to roll out 950,000 Model 3\n\nand Model Ys for the global market of Europe and Asia.\n\nAnother up to 375,000 can be built in Grunheide,\n\nnear Berlin, Germany.\n\nNot far away in Prum,\n\nthere's a Tesla factory that specializes\n\nin advanced automation systems for manufacturing.\n\nMusk seems invested in German politics,\n\npublicly endorsing the far right party there.\n\nI think there's like frankly too much of a focus\n\non past guilt, and we need to move beyond that.\n\nTesla claims to have 60,000 global Superchargers.\n\nIn the US, there are nearly 30,000 ports.\n\nThat accounts for 57%\n\nof all direct current fast charging ports in the US.\n\nOver here in Buffalo, this Tesla gigafactory\n\nmakes solar roof tiles for the energy generation\n\nand storage division.\n\nIn 2023, the division generated\n\napproximately $6 billion in revenue.\n\nThis gigafactory way over here in Sparks, Nevada\n\nproduces battery packs\n\nfor 1.3 million Tesla vehicles per year.\n\nAnother Musk company made its mark on Nevada.\n\nThe Boring Company has been building\n\na privately operated 68-mile tunnel system\n\n40 feet below the ground,\n\ndesigned to transport passengers\n\nat speeds up to 150 miles per hour using autonomous Teslas.\n\nThe stretch goal is to eventually connect\n\nall the way to Los Angeles.\n\nHowever, as of January, 2025,\n\nafter several years in operation\n\nand several unresolved workplace safety violations,\n\nThe Boring Company\n\nhas only completed a few miles of tunnels.\n\nHere in Abilene, Texas, the first data center\n\nof Stargate AI Initiative,\n\nlaunched by OpenAI, SoftBank, and Oracle, is being built.\n\nThey seem to be in direct competition\n\nwith xAI's Colossus supercomputer,\n\nwhich came online in September, 2024\n\nhere in an industrial park in South Memphis, Tennessee.\n\nPowered by 200,000 GPUs, Musk has said\n\nhe plans on increasing that amount significantly,\n\nwhich has some locals worried\n\nabout the strain the site places on the Memphis power grid\n\nand the potential increase in carbon emissions\n\nfrom the energy-intensive operations.\n\nCritics also point to the lack of transparency\n\nregarding water usage for cooling systems\n\nand reports of operating\n\nwithout proper environmental permits.\n\nThis wraps up our tour of Elon's empire.\n\nThe sheer scale of it is a lot to digest,\n\nand the news cycle is moving quickly.\n\nMore cuts are being made by DOGE\n\nas of this video being released.\n\nHead to wired.com for immediate information\n\nas our coverage of the story is unfolding.\n\nThanks for watching On the Grid.\n\n[lighthearted music]",
  "authors": [
    "Condé Nast"
  ],
  "url": "https://www.wired.com/video/watch/on-the-grid-elon-musk"
}