{
  "title": "Are you stuck in ordinary - but devastating - narcissism? There is a way out",
  "text": "When I picture what a good life means to me, I feel a tension in my chest. I see my daughter and my husband and I feel the profound fulfilment of being exactly where I need to be, tightened by the terror that life is so fragile and I cannot protect them from that reality. Then a memory: lying on my analyst’s couch and describing a feeling of hollowness inside that I felt deeply ashamed of, and her listening and thinking and understanding – and my noticing that while I felt horror and repulsion, she didn’t seem to. Next: different walks around different parks with different friends, each with the same feeling of being warmed from the inside out; also, bumping into neighbours at the playground and feeling a part of my community. I remember powerful moments with my patients, who have felt understood, by me and within themselves. And I think of the moving messages from readers who have got in touch, sharing precious stories from their lives.\n\nPeople often think that psychoanalysis and its NHS-friendly grandchild, psychodynamic psychotherapy, are all about looking inwards. And it’s true – good therapy should give us the time and space, the frame and the containment, to look inside and listen to ourselves.\n\nBut it doesn’t end there.\n\nSome of us don’t understand what it is inside us that means we cannot be in the outside world, or be with other people, in an ordinary way. We haven’t yet worked through whatever traumas or unconscious conflicts keep us trapped in the past. We don’t have the capacity to digest our own feelings, so we cannot bear, never mind relate to, the feelings of others. Sometimes, if we cannot tolerate whatever emotions spontaneously develop within us, we fend off these feelings with screens or drugs or sex or gambling or other self-harm, or work or sabotaging work or abuse of loved ones, and things get far more dangerous.\n\nWithout psychoanalytic help, many of us are stuck in our own ordinary and devastating narcissism, unable to relate to ourselves or to others in meaningful ways. If we are blind to what is going on inside, we can’t look outwards to find solace and meaning in community, in the natural world, in work and in love. Meaningful therapy doesn’t indulge narcissism; it lights the way out of it.\n\nI am sometimes criticised for writing about psychotherapy because it is perceived as the preserve of the privileged. And it is true that I am privileged to be able to afford it. But that doesn’t mean that it is only for the well-off – or that I shouldn’t write about it. There are low-fee schemes at reputable clinics and training organisations, and the British Psychoanalytic Council website now allows therapists to state on their profile when they offer low-fee vacancies. But not everyone can afford these low-fee schemes, and that is why my colleagues and I believe in and fight for the provision of sustained psychodynamic psychotherapy on the NHS. Crushingly, it is a fight that we are losing; provision has been consistently diminished over decades and there is now very limited psychodynamic psychotherapy available.\n\nEvery time an NHS service is forced to reduce the provision of psychodynamic psychotherapy – this highly effective, evidence-based treatment that helps people build better mental health and better lives – it is forced to act against whatever values of equality, quality of care, respect, diversity and inclusion and patient choice it is striving to uphold. These cuts make a mockery of parity of esteem for mental and physical health. It is not an acceptable state of affairs and we shouldn’t keep quiet about it. We should be marching in the streets. Who will join me?\n\nBecause it shouldn’t be about who can afford this treatment. I have treated patients from all different backgrounds, some of whom can use therapy to build a better life, and some of whom cannot. It has diddly squat to do with how much money they have or how well educated they are or what they do for a living. Although, it is true that when a patient has had a particularly rarefied education and has been stuck for a long time using their intellect to try to navigate around feelings that need to be felt, it can be very difficult to work through this to the deeper emotional currents and needs that are hiding underneath. But it’s worth persevering – at least, it has been for me as a patient.\n\nIf it weren’t for psychoanalysis, I don’t think I would still be in my marriage or have my daughter. I wouldn’t have been able to see my part in my relationship difficulties, or to listen to my partner so that we could grow together through the storms of married life. I couldn’t survive my own feelings, let alone try to help my child with hers. I couldn’t do the work that I do, shackled by an intellectual defence that was as brittle as it was shallow. I wouldn’t have been able to build any kind of better life on the emptiness I sensed but couldn’t bear to turn towards. I would not have been able to discover that there was something in there after all – the beginnings of a person.\n\nI don’t know what a better life means to you. And often when my patients come for psychotherapy, they don’t know either, and it becomes part of our work to find out. But now I do know something of what it means to me. I feel it inside – and I am extremely fortunate to be able to afford the therapy that’s helping me. If we want to build better lives and a better society, it should be available to anyone who needs it and can use it.",
  "authors": [
    "Moya Sarner"
  ],
  "url": "https://www.theguardian.com/lifeandstyle/2025/nov/17/are-you-stuck-in-ordinary-but-devastating-narcissism-there-is-a-way-out"
}