{
  "title": "This Khosla-backed startup can track drones, trucks, and robotaxis, inch by inch",
  "text": "For San Francisco-based startup Point One Navigation, the value of “location, location, location” extends well beyond real estate. And investors seem to agree.\n\nPoint One Navigation, a startup that has developed precise location technology, has just raised $35 million in a Series C round led by Khosla Ventures. The company’s post-money valuation is now $230 million, according to one insider familiar with the deal.\n\nPoint One, which was founded in 2016, has developed precise location technology that can be applied to any vehicle that moves, from autonomous consumer lawnmowers and drones to robots, consumer vehicles, agriculture equipment, and even humans donning a wearable device.\n\nFor Point One, precise location means exactly that. The technology, called a positioning engine, can determine location within 1 centimeter in the best conditions, co-founder Aaron Nathan told TechCrunch.\n\nTo achieve that, Point One has combined an augmented global navigation satellite system (GNSS), computer vision, and sensor fusion into an API. Typically that API is deployed as a software product because most new vehicles — like a slick EV or luxury car — come equipped with the necessary hardware. For vehicles like farm equipment or say a first responder that don’t, Point One adds a chipset into the mix.\n\nPoint One started with a focus on automotive clients — a sign of the bullish autonomous vehicle technology times. That sector continues to make up a large slice of its revenue. Point One couldn’t disclose most of its commercial customer names, but it did share that its technology supports the advanced driver assistance and infotainment needs of an EV maker and is included in more than 150,000 of its vehicles.\n\nPoint One also has contracts with some of the largest mowing and turf care manufacturers, a distribution company’s fleet of 300,000 last-mile delivery vehicles, and a global manufacturer of street and racing bikes.\n\nTechcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | WAITLIST NOW\n\nBut the startup began to branch out to other sectors around 2021 when it announced its $10 million Series A round, according to Nathan. That helped kick adoption into high gear. Over the past year, the number of manufacturers using Point One Navigation’s technology platform has increased tenfold and spans automotive, robotics, industrial, and wearable sectors.\n\n“And now it’s just accelerating,” Nathan said.\n\nPoint One’s Series C round will be used to build out all aspects of its technology, including its so-called Polaris RTK Network — a key piece of hardware that helps deliver centimeter-level accuracy even in sparsely populated areas in North America, Europe, and Asia.\n\n“The industry keeps pressing to higher precision, from precision agriculture to painting lines to mowing a yard,” Tom Weeks, the company’s COO told TechCrunch. “You can’t be off by 10 centimeters and go over in a flower bed. So everything’s pressing to the one to three centimeter range.”\n\nTo get that kind of precision, Point One spent eight years developing its RTK Network, a system of small lunchbox-sized units, installed in secure locations like a cell phone tower facility that provides corrections to location. To create a dense network, these stations need to be within 40 kilometers of that vehicle or device’s location. That means a lot of stations, which the company is building out, Weeks said.\n\n\n\n“Midwestern states where farming is going on, all the way to the East Coast in the U.S., require solid density, because you have people, you have farming, you have cars and trucks, a lot of middle-mile freight,” Weeks said. “So we’re in the process of filling that out; we’re almost there.”\n\nThe startup is also working to beef up the technology’s capability indoors. Today, vehicles traveling from outdoors to an indoor parking structure will continue to have that precise location. But Nathan wants to extend that capability to industrial settings where a robot, for instance, may spend the bulk of its life inside.\n\n“What we’re building next — and that’s part of what this fundraising is for — is, how do we do long-term indoor navigation as well,” he said. “When you look at the evolution of the business, we want to solve ubiquitous location, so eventually it will be indoors and all domains.”\n\n\n\n",
  "authors": [
    "Kirsten Korosec",
    "Transportation Editor",
    "Sarah Perez",
    "Julie Bort",
    "Lorenzo Franceschi-Bicchierai",
    "Ram Iyer",
    "Connie Loizos",
    "Anthony Ha",
    "Rebecca Bellan",
    "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var"
  ],
  "url": "https://techcrunch.com/2025/11/20/this-khosla-based-startup-can-track-drones-trucks-and-robotaxis-inch-by-inch/"
}