{
  "title": "How KPop Demon Hunters Star EJAE Topped the Charts",
  "text": "I mean, in our little circle, yes, it was a hit but definitely not this caliber at all. The melody came quite instantly. It was on my way to the dentist.\n\nThe most inspired.\n\nGetting a gold filling, by the way. So the melody came really fast, but when we finished it, I had this session with Mark [Sonnenblick], my cowriter, right after, and Mark was so excited. I was like, “I have this melody.” He heard it and was like, “Oh my God, this is amazing.” So when we finished the whole song and the lyrics, we just looked at ourselves and we’re like, “Wow, I think this is a smash.”\n\nIs there a formula to making a K-pop hit or an algorithm to it, or is it just different every time?\n\nFor a K-pop hit, a US hit, and a global hit, it’s all quite different. I think for a K-pop hit, being hooky is definitely important. Global hit, I’ve noticed, is a concept that everyone can say—everyone knows what “Golden” means. Everyone has a feeling of wanting hope in their life, especially right now at this time. In the US that’s also important too. So I think universally, when the concept is really good and it’s easy to say, and when there’s a good melody and a great message, you have a hit.\n\nThe Big Interview Read more deep, weird, smart conversations with the most important people in our world.\n\nDo you think the intense political atmosphere right now is part of why this movie and this song have taken off?\n\nI think so. A friend of mine told me that his friend has kids, and KPop Demon Hunters is bringing light to their kid that they can hold onto and just kind of focus on that and kind of ignore the dark times right now. It brings them hope. It has a really beautiful message, makes them want to love all of themselves, all their flaws and all their good parts too.\n\nI want to go back to you being a trainee for SM Entertainment. How old were you when that happened? Can you tell me a little bit about that world?",
  "authors": [
    "Manisha Krishnan"
  ],
  "url": "https://www.wired.com/story/how-k-pop-demon-hunters-star-ejae-topped-the-charts/"
}