{
  "title": "How opera is aiming for net zero",
  "text": "The power of Glyndebourne\n\nIn 2012, executive chairman Gus Christie oversaw the installation of a 67m (220ft)-tall wind turbine on a hill adjacent to the opera house, which between then and 2022 has generated the equivalent of 102% of the electricity used by the company in the same period. The turbine serves as an important statement of intent for Glyndebourne. Alison Tickell, the founder and chief executive of Julie's Bicycle, a non-profit organisation dedicated to mobilising the UK arts and culture sectors in a fight against climate change, says in the documentary: \"I know that many opera companies… don't have the luxury of space. But [the turbine] still remains a beacon for us all [demonstrating] that climate action really matters.\"\n\nGetty Images The grounds at Glyndebourne have been carefully tended for decades, and are central to the audience's experience (Credit: Getty Images)\n\nGlyndebourne has innovated in sustainable practice in the years since. In 2021, it joined the global Race to Zero, pledging to halve its direct carbon emissions by 2030, and to reach net zero by 2050. \"We are zero waste to landfill now, so any waste we have goes down to [an] incinerator, which provides power for local homes,\" Christie says of some of the measures he and his team have taken to achieve this. \"We compost all our garden waste, we recycle as much of our stage-set material, costumes, props [as we can]. We have about 32 electric vehicle charging points [for visitors] which are all charged from the wind turbine.\" They are drawing from their resources in other ways, too: by the end of this year, they predict, all water served at Glyndebourne will come from the property's own natural spring, while plants grown in their gardens are being used to produce dyes for the company's costumes. \"Rivers around the world are polluted by dyes a lot,\" says dye room supervisor Jenny Mercer in the documentary. \"This way everything goes back into the ground.\"",
  "authors": [],
  "url": "https://www.bbc.com/culture/article/20230731-how-opera-is-aiming-for-net-zero-amid-the-climate-crisis"
}