{
  "title": "Source: Kalshi’s valuation jumps to $11B after raising massive $1B round",
  "text": "Kalshi, a prediction market that allows people to bet on future events, has raised a massive $1 billion round at a $11 billion valuation, according to a person familiar with the deal. The round comes less than two months after the seven-year-old startup announced its previous fundraise of $300 million at a $5 billion valuation.\n\nThe latest round is led by the company’s returning investors Sequoia and CapitalG, the person said. Other investors in Kalshi include Andreessen Horowitz, Paradigm, Anthos Capital, and Neo.\n\nKalshi and Sequoia declined to comment. CapitalG didn’t respond to our request for comment.\n\nKalshi’s main rival, Polymarket, was reportedly in talks last month to raise another funding round at a $12 billion to $15 billion valuation, mere weeks after closing a $1 billion round at an $8 billion pre-money valuation, Bloomberg reported.\n\nKalshi and Polymarket surged in popularity last year after both prediction markets allowed people to bet on the outcome of the presidential election. These betting sites became even more prominent after they correctly predicted the results of New York City’s mayoral election earlier this month.\n\nFor the Mamdani versus Cuomo race, Kalshi purchased ad space on New York subway cars, running live screens that displayed the up-to-the-minute odds of each candidate winning, a marketing campaign that undoubtedly raised the company’s brand awareness among New Yorkers.\n\nKalshi allows people in over 140 countries to bet on various future events, ranging from who Time magazine will name Person of the Year for 2025 and the Rotten Tomatoes score for the film Wicked, to outcomes further in the future, like the next U.S. presidential election winner.\n\nTechcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | WAITLIST NOW\n\nIn mid-October, the company reached $50 billion in annualized trading volume, marking a more than a thousandfold increase from the approximately $300 million volume posted last year, the New York Times reported.\n\nKalshi was co-founded by two former hedge fund traders, Tarek Mansour and Luana Lopes Lara. The duo met as undergraduate students at MIT while studying computer science and mathematics.\n\nPrediction markets have historically been controversial and subject to legal challenges because they operate in the gray area between financial instruments and traditional gambling.\n\nWhile Kalshi has secured the right for Americans to use its platform after successfully suing the Commodity Futures Trading Commission (CFTC) last year, the company is currently engaged in legal disputes with numerous state regulators who claim its activities are illegal gambling.\n\nPolymarket has been barred from serving U.S. residents since 2022, following a settlement with the CFTC. In July, the company acquired a derivatives exchange and a clearinghouse. The move helped Polymarket receive the right to reenter the U.S. market. In September, the company’s CEO and founder, Shayne Coplan, said on X: “Polymarket has been given the green light to go live in the USA by the CFTC.”",
  "authors": [
    "Marina Temkin",
    "Reporter",
    "Sarah Perez",
    "Julie Bort",
    "Lorenzo Franceschi-Bicchierai",
    "Ram Iyer",
    "Connie Loizos",
    "Anthony Ha",
    "Rebecca Bellan",
    "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var"
  ],
  "url": "https://techcrunch.com/2025/11/20/source-kalshis-valuation-jumps-to-11b-after-raising-massive-1b-round/"
}