{
  "title": "When Tech and Entertainment Collide: A Conversation with Zack Snyder",
  "text": "Transcript\n\nThank you all very much for being here.\n\nVery excited to have you here,\n\nand I'm very excited to welcome my guest,\n\nas noted writer, director, producer,\n\ndirector of photography, Zach Snyder,\n\ngreat movies such as The Watchman.\n\nRebel Moon most recently.\n\nAnd we're here to talk to you a little bit today\n\nabout tech in Entertainment.\n\nHi, Zach.\n\n[Zach] Hey, thanks for having me.\n\nNo, thank you for being here.\n\nHey, everybody. [audience cheering]\n\nNice.\n\nI appreciate the woos.\n\nI appreciate the woos.\n\n[Zach] Where is that fire?\n\nIsn't this a fireside chat? Oh, we were having that.\n\nNo. Sorry.\n\nIt's just a little, just you and I.\n\nWe can make it intimate.\n\n[chuckles] Okay. Very good.\n\nOkay.\n\nSo you have a really specific vision, right?\n\nLike I feel like in your work, highly stylized,\n\nand I don't mean that as a criticism,\n\nbut how do you see...\n\nLet's start with, like, the big elephant in the room.\n\nHow do you see the advancing AI systems\n\nlike LLMs, visual models, influencing the industry?\n\nI know it's a broad question.\n\nNo, no, it's a cool question.\n\nBecause obviously it's an exciting time\n\nand obviously that technology, which is also\n\nstill slightly ambiguous about what exactly\n\nand how exactly it will land in entertainment.\n\nI think it's an exciting frontier\n\nand it's a cool thing to speculate about\n\nand have fun thinking about workflows and stuff.\n\nI've spent some time sort of thinking about\n\nlike, what a workflow and AI workflow might look like,\n\nMh-hm. You know?\n\nBut I do think it's a thing that...\n\nLike, for instance, I think, you know,\n\nwhen you have someone like myself or I think,\n\nyou know, anyone who's interested\n\nin making specific imagery, like very,\n\nvery specific imagery, I feel like that...\n\nWe're still evolving toward that, I think.\n\nWith AI, you know? Yeah.\n\nAnd so I've thought about it this way.\n\nLike, I think that in the not too distant future,\n\nI like to think about the AI, like\n\nthe potential for an AI interaction\n\nto be like, if the AI can create\n\na 3D world, like a game engine,\n\nbut like an instantaneous 3D world,\n\nwhich is not outrageous.\n\nNo, I think we're not far from that.\n\nNot far from that. Yeah.\n\nSo say I filmed you with my phone\n\nor some other capture device, or lidar\n\nor whatever, you're the actor,\n\nand you did your awesome performance\n\nand it was great, by the way.\n\nThank you so much. It was so good.\n\nAnd then we say we've got the performance now.\n\nOkay. And\n\nI can see a world where the production designer\n\nhas created all the sets and everything that we needed.\n\nThose have all been sort of loaded into an aesthetic bank.\n\nAnd that is to say that this bank...\n\nThe AI understands what the movie\n\naesthetic core will be, and that hopefully\n\nis a thing that I'm interested in, right?\n\nLike, Yeah.\n\nNow, like I like this kind of lensing,\n\nthis kind of moats of dust, this kind of backlight,\n\nthis kind of whatever, on and on.\n\nAnd also this kind of set design.\n\nIt's, for instance, we're doing our movie\n\nin France, so it's gonna be like a French landscape\n\nbut we're very specific about the French farmhouse,\n\nand this is the way it looks, and it's got\n\npatina walls and all that, we did it.\n\nOkay. So that exists.\n\nAnd I can imagine that now, when we make a shot,\n\nif that 3D world, if, if the AI understands,\n\nif I'm saying, Okay, I want the camera 10 feet away.\n\nI want it this high, you're by the window.\n\nSo you're lit by the window.\n\nI want the sun out the window.\n\nAnd if that can happen in real time,\n\nif that conversation could happen.\n\n'Cause like, you know, I converse with my-\n\nYou you were just conversing with your AI backstage.\n\nYes.\n\nAnd I find that like...\n\n'Cause I think that also this idea of, like,\n\nright now, this sort of...\n\nThe prompting gatekeepers of AI have this.\n\nYou know, there is this kind of prompting\n\nwhat I would call, which is cool in a way\n\nbecause like AI is like, Oh, no,\n\nit's available to everyone unless\n\nyou don't know how to do it.\n\nYeah.\n\nThen you can't do it.\n\nSo it's like a cool, there's a cool thing.\n\nDo you see it enhancing your filmmaking,\n\nor do you see it replacing filmmaking?\n\nI think where I was going with this is that,\n\nso in this world where I'm making that shot of you.\n\nYeah. The question\n\nreally becomes, unless there's something\n\nabout this shot that requires it to be made\n\nonly on the computer, or only in an AI universe,\n\nthen I think you have to say,\n\nOkay, well what's the why of it then?\n\nRight. Like, what does that\n\nkeep me from flying to France?\n\nIs that all that I saved?\n\nI mean, if it's a handheld shot\n\nof you sitting in a chair by window,\n\nWhy would you use AI. Why would you use it?\n\nYeah. Other than you can,\n\nand a lot, look, there's not to say\n\nthat that's not a reason. Right.\n\nYou know, does it democratize in some way,\n\nthe ability to not have to travel to France,\n\nand if I'm just at home, a filmmaker at home,\n\nand I captured my actor friend,\n\nand I wanna make a movie in France,\n\ncan I just do it?\n\nMaybe. Yeah.\n\nSo I mean, I think there is a potential\n\nfor it making things accessible,\n\nbecause obviously that same AI doesn't care\n\nwhether the house is on fire, or whether\n\nit's on Mars or whether it's underwater.\n\nThat's all the same conversation.\n\nSo all the things that might cost\n\na lot of money about what I just described\n\nare to the AI no different.\n\nRight. But to you as a filmmaker,\n\nis it gonna be different?\n\nLike, do you need the experience of like,\n\nbeing in the actual location?\n\nThat's a thing I don't know.\n\nBecause it's this theoretical...\n\nWhen I can have a conversation\n\nwith an image making device that is natural,\n\nthat is to say, if I say in real time,\n\nyou know, wouldn't it be cool if the that back wall\n\nwas like another 10 feet away, and the sun\n\nwas like, just nicking the horizon\n\nso that during the take the sun just goes down\n\nand now this ambient light takes over.\n\nYou know, that.\n\nAnd if that's happening as we speak,\n\nthat's an interesting way to understand\n\nvisual language. Right.\n\nBut is it a replacement for?\n\nI don't know. That's a thing I don't know.\n\nBut it is a fun conversation.\n\nI can see...\n\nThe thing that's weird is that people think like,\n\nOh, that's a great way to make storyboards\n\nor to make pre-visualized shots\n\nthat then you could take the set\n\nand use that to shoot with.\n\nYes, that's true.\n\nBut there's very little difference then\n\nbetween that and the actual shot, you know?\n\nYeah. But you also...\n\nWe've spoken in the past before\n\nand you, you know, have done all\n\nyour physical storyboards, like,\n\nyou hand draw everything for The Watchmen.\n\nIs AI gonna take a lot of the creative process\n\nout for you, if you're just like talking\n\nto the chat bot and saying, Draw this frame for me.\n\nDraw the sun setting.\n\nYeah, that's where I think the problem\n\nis for me, personally.\n\nI don't think that the drawing of it\n\nis so specific. Mh-hm! Mh-hm!\n\nAnd I'm not interested in the\n\nAI's interpretation of what I'm saying.\n\nRight. That's where\n\nthe rubber hits the road, I think, for me.\n\nAnd where I think the technology\n\nis really kind of quickly changing\n\nbecause it is quickly changing from\n\na suggestion like, Hey, I wanna see 1920s L.A.\n\n[Hemal] Right.\n\nYou know, like a woman walking\n\nwith a suitcase down to Hollywood Boulevard.\n\nIt'll give you its concept of that,\n\nand it'll be pretty awesome.\n\nBut it's not necessarily, if I drew it over here\n\nand then went like this, I'd be like,\n\nOh.\n\nIt's close, but it's not your vision.\n\nIt's close, but that's its own.\n\nYeah. Take.\n\nAnd I think that's where I think\n\nthe tool will become...\n\nAnd it's happening this moment, all the AI,\n\nlike, you know, video generators\n\nand image generators, they're the few holy grails\n\nthat came up immediately are staying on model.\n\nYou know, that's a big deal, right?\n\nLike, can I do two shots of you\n\nthat are like, okay, a closeup\n\nand a wide shot where you look the same?\n\nThat was a bit of a problem, you know?\n\nBut now they're starting to work that out because.\n\nWell, let me ask you, are you overall...\n\nWell, I'm not gonna ask you 'cause I think,\n\nI will already say we've talked a little bit before,\n\nbut you are generally very optimistic\n\nabout the use of artificial intelligence\n\nin filmmaking, in the creative process.\n\nYou do not come to it from a perspective\n\nof That technology shouldn't be involved\n\nin artistic endeavor.\n\nWell, yeah.\n\nI mean, I'm definitely not a gloom and doom\n\nAI person at all.\n\nI think that I've done so many movies\n\nwith so much visual effects, and so much technology\n\nand I've lived in a very virtual world\n\nwhen it comes to filmmaking,\n\nand also very organic handheld world.\n\nAnd those two worlds have mixed a lot for me too.\n\nSo I think for me personally, you know,\n\nI sort of put performance at the front,\n\nyou know, at the head of it.\n\nI think if you're capturing an incredible\n\nperformance, everything else around the actors,\n\nthat's context.\n\nYou know? And that's all it is.\n\nAnd so I think that...\n\nAnd AI...\n\nLook, I don't know that anyone's\n\ninterested in the AI's story.\n\nRight. Or its point of view.\n\nRight.\n\nYou know, maybe they are.\n\nThat's cool.\n\nThat's another sub genre.\n\nBut I think that for me, I think that\n\nit seems eager to get at\n\nwhat the stories that people are trying to tell.\n\nYou know, and I think that in the same way\n\nthat when, we all...\n\n'Cause look, every single person has a pretty good camera\n\nOn their phone. Pretty good camera\n\non their phone. Yeah.\n\nEvery single person.\n\nA pretty good movie camera.\n\nYeah. Yes.\n\nA legit movie camera.\n\nAnd yet, you know, we don't have\n\nright this second anyway, maybe that'll change.\n\nI hope it does.\n\nBut we don't have millions of awesome movies\n\njust being uploaded out of people's pockets.\n\nI feel like the AI represents another tool\n\nthat will help us make movies awesome, I hope.\n\nIt's been my experience that certainly\n\nas a research tool, and a little bit\n\nas an image making tool, I've found it really interesting.\n\nI'm curious to see how you're using it.\n\n'cause like I said, you have it on your phone,\n\nyou talking to it, asking it questions.\n\nIs it becoming a person to you?\n\nYour AI chat bot?\n\nPerson? That sounds weird.\n\nBut I mean- Is it\n\ndeveloping a personality?\n\n[laughs] You know, what it does say,\n\nUm. Which I find really interesting.\n\nSo when it's explaining something, it'll go,\n\nUm, you know, the Golden Gate bridge is, um.\n\nAnd I'm like, Oh, that's, that's cool.\n\nOr it'll breathe, you know, it inhales.\n\nOh. Which I think\n\nthat's all in the programming.\n\nIt's a Chat GPT for the, the language model.\n\nAnd it does [sighs] anyway.\n\nIt does that, you know, and it goes, [sighs].\n\nYou can hear they program that inhale\n\nand they program the, Um.\n\nobviously to make it Yeah.\n\nMore natural, right?\n\nAnd it's way better than like, look,\n\nI have the elevens lab reader.\n\nDo you know that company?\n\nAmazing. Yes.\n\nAnd I find that the voice on the Chat GPT\n\nis a scale more natural than that even.\n\nAnd it's just really...\n\nI don't know how it works, but it's awesome.\n\nSo you were talking about how performance\n\nis actually really important to your filmmaking process\n\nand how you've already used tools before.\n\nDo you think filmmakers should be required\n\nto disclose that they've used AI generators?\n\nIt's an interesting question.\n\nYou know, does the audience want that?\n\nYou know, I think is a better question\n\nonly because I mean...\n\nCertainly we don't ask,\n\nwhen you go see a movie,\n\nlike a Marvel film or a superhero movie\n\nthat has a lot of visual effects.\n\nAre people interested in knowing when\n\nthat was a digital double, that was really the person.\n\nYeah. Or is it the moment.\n\nOr afterward maybe, maybe that's the conversation\n\nafter you've seen the film,\n\nOh, we used AI in these little sections.\n\nOr is the question like,\n\nwhether it is an entirely AI generated movie?\n\nI feel like if that happened, we would know about it.\n\nFirst of all, everyone they would\n\nlove it or hate it or whatever that would be,\n\nI don't know.\n\nThat's still, I think up to debate.\n\nAbout how we feel about it. Yeah.\n\nAbout images being created that way.\n\nI mean, you've seen that Coke commercial.\n\nDo you see that Coke commercial?\n\nThe polar bear commercial? Yeah.\n\nThe polar bear spot. Yeah.\n\nI mean.\n\nWas the point for it not to fool us?\n\nI couldn't-\n\nI'm not even gonna talk about,\n\nI wouldn't speculate on that,\n\nthe Coca-Cola commercial right now.\n\nBecause, okay, obviously this is an AI generator.\n\nMaybe they wanted to make it, Right.\n\nLike really, obviously AI.\n\nDeliberately make a lot of people angry.\n\nYeah. Yeah,\n\nBut what made them angry, do you know?\n\nSo it sounds like you're advocating\n\nfor a really specific use of AI\n\nin your filmmaking, or leaving the door open for it.\n\nYou know, to me it's- But not replacing anything.\n\nI don't think it's replacing anything.\n\nAnd I don't know why you would want it to right now,\n\nbecause it's really quite, I mean, I think it's great.\n\nLike I say, you can imagine costume designers,\n\nproduction designers, editors, everyone having\n\nthis kind of central hub that the AI\n\nkind of manages and as a way of\n\nsort of creating an overall aesthetic\n\nthat is consistent and that where everyone can...\n\nBecause everyone's checking in,\n\neveryone is constantly sort of\n\nreaffirmed in the aesthetic of the\n\nYeah. Project.\n\nAnd you can imagine that that could be\n\nreally efficiently and kind of seamlessly\n\ncurated by an AI kind of,\n\nyou know, point of view.\n\nThat is to say that every time on this project,\n\nevery time we ask it a question,\n\nit's answering it from the point of view of-\n\n[Hemal] Right.\n\nThe aesthetic of the film. Right.\n\nWhich I think could be really awesome for, you know,\n\nsome immersive kind of movie making experience,\n\nwhether it be like, you know, I don't know,\n\nlike an animated film, Avatar.\n\nI don't know, something that really requires\n\na singular, That kind of focus.\n\nPoint of view, yeah. On that technology.\n\nSo you're talking about it in terms\n\nof, like, efficiency.\n\nHow do you see it changing the industry?\n\nI see it changing the industry.\n\nI mean, it'll be interesting its impact on visual effects.\n\nThe effects. Obviously that's\n\nhappening right now.\n\nBut like, motion capture, voiceover artists,\n\nanimators.\n\nYeah. I mean, voice over artists-\n\nIt has the potential to be very disruptive.\n\nYeah. That makes me nervous.\n\nI feel like you probably, you don't want it,\n\nyou know, voicing things.\n\nI mean, it can, obviously. Yeah.\n\nWhat I just said, you know?\n\nIt says Um. Pretty well. [Hemal laughing]\n\nBut I feel like...\n\nI feel like if there's an author\n\nand an artist at its base, then I think it's cool, you know?\n\nRight.\n\nBut it's not going to take away that,\n\nbut it is gonna streamline the industry.\n\nIt is going to kind of send ripples all the way through.\n\nI think it's doing that right now.\n\nIt absolutely is doing it right now.\n\nAnd I think that's what I'm saying is that\n\neducating yourself and understanding what it can do\n\nand what it can't do is important right now.\n\nEspecially at where it exists in image making\n\nand storytelling.\n\nBecause I think if you're in now and understand it\n\nwhat it's not capable of as well,\n\nI think that that's important.\n\nI think that you can really use it as a tool.\n\nYeah. As opposed to fighting it\n\nor as opposed to sort of standing on the sidelines,\n\nyou know, kind of with your hands on your hips.\n\nIt's going. Yeah.\n\nI mean, look, six months ago is different from now,\n\nand six months from now will be\n\nmuch different from where we are.\n\nAnd I think that it's important to stay with it.\n\nBasically, you're gonna be left behind\n\nif you don't embrace it.\n\n[Zach hums]\n\nDid I put words in your mouth?\n\nNo, no. But I'm worried. Yeah.\n\nIf you don't. Yeah.\n\nYeah. So you're worried if you don't.\n\nAnd like, I think you used the analogy\n\nputting toothpaste back in the tube, right?\n\n[Zach] The toothpaste is not going back on the tube.\n\nIt's not going back on that one.\n\nNo. All right.\n\nWell, shifting gears away from AI for a little bit.\n\nWe've got a few minutes left.\n\nI wanted to talk to you.\n\nYou've done a lot about streaming.\n\nAre you still invested in theatrical releases?\n\nYeah, I think that movies absolutely\n\ncan and should be experienced in the theater.\n\nI never really, like...\n\nWhen I made the Netflix films that I've made,\n\nthe two I've made, well, three really.\n\nBut the...\n\nFour, five. There's a lot.\n\nThere was a lot of cuts, you know how I am.\n\nBut the... [Hemal laughing]\n\nAnd then the TV show, I forgot about that.\n\nBut anyway the process of working\n\nin the format of a streamer, for me,\n\nI was really very clear about,\n\nOkay, I'm making a movie for TV.\n\nThat's fine.\n\nI'm not under any kind of misconception\n\nthat I'm making a movie for the theater.\n\nI'm happy to do that if that's the assignment\n\nand that's the way it's gonna be shown.\n\nBut like, you know, we know that\n\nso much of the material, like,\n\nwhen you make a movie that's going to play on Netflix,\n\nchances are if your movie ever is shown on Netflix,\n\nmore people will see it on Netflix\n\nthan ever saw it in the theater.\n\nRight? Right, right.\n\nThat's just a fact.\n\nAnd even a big blockbuster, you make\n\nblockbusters in the theaters, and then\n\nit gets licensed by Netflix.\n\nMore people will see it probably\n\non Netflix than also saw your Blockbuster.\n\n[Hemal] You're just going after the eyeballs.\n\nBut what I'm saying is that...\n\nAnd I'm not necessarily a pure eyeball guy.\n\nOkay. Because I don't...\n\nYou know, a lot of the movies that I've made\n\nhave a very particular audience\n\nand they're made in a very particular way.\n\nAnd they're not necessarily, you know,\n\npure mass audience.\n\nThat's not the way I think it happened.\n\nIt can happen, that's fine.\n\nBut what I'm saying is that\n\nthe assignments are different.\n\nAnd I'm fine if you're asking me\n\nto make a movie for your streaming,\n\n[Hemal] You're not precious about it.\n\nI'm not gonna say like,\n\nHey, like, I'm not an artist if it's not in a theater.\n\nYou know, like, that feels rude.\n\nI mean, that's great. Yeah.\n\nOnly because you're paying for the movie.\n\nRight. You know,\n\nyou're the streamer.\n\nYou're like, This is our format.\n\nWe have a giant streaming service.\n\n250 million people are gonna look at it\n\non their phone, probably.\n\nYou know?\n\nAnd at the very beginning of our conversation,\n\nI have to know that's the reality.\n\nRight. If I do,\n\nthen I should be fine with everything that happens after it.\n\nRight. But you're fine with that, though?\n\nLike, with Netflix?\n\nWell, I have an amazing relationship with Netflix.\n\nI think they're incredible.\n\nLike the pipe that delivers your ideas\n\nto people who are enjoying it, is pretty efficient.\n\nAt the same time, I would say that\n\nif the assignment was, if you were,\n\nUniversal Studios, and you came to me\n\nand said, Hey, we wanna make a movie\n\nthat's like a big theatrical release.\n\nYeah. You know,\n\nWhat do you think?\n\nI'd be like, That sounds amazing.\n\nI'd love that.\n\nIMAX, why not?\n\nOne last final question for you.\n\nIn the few minutes that we have left here.\n\nWith technology, with like streaming being\n\nthe primary way people consume movies right now,\n\nwhat is the story that you are most excited to tell?\n\nSo, do you mean, like, just for me personally?\n\nWith this technology, like with AI technology,\n\nI think you mentioned that like AI\n\nwas gonna let you do things that you hadn't\n\nreally figured out how to do yet.\n\nYeah, no, it's an interesting...\n\nI mean, I feel like I guess that's it, you know.\n\nThe way I see it working right now\n\nis really as an incubator, in kind of\n\nthe most efficient way possible.\n\nYou know, like, I can experiment, I can feel,\n\nI can work on things that normally\n\nwould require a big amount of effort from everybody.\n\nAnd that I can have ready on the day\n\nwhen now we have the crew standing by.\n\nBut like, you know, I think\n\nthat there's no substitute for, you know,\n\nwalking down a gritty street with an actor\n\nand me with the camera.\n\nI don't know that anyone would ever want\n\nthe sort of AI version of that.\n\nI don't know that that's...\n\nI mean, it could be done, but I just\n\ndon't know that-\n\n[Hemal] I mean, it can be done.\n\nThere's no need. Right.\n\nSo like there isn't a need for it.\n\nAnd also you're saying that it would strip\n\nlike the personal vision out of it.\n\nYes.\n\nAnd I'm not even saying that.\n\nI'm just saying that like, you know,\n\nthere is a texture and sort of a point of view.\n\nI think in the end, I always say this about filmmakers.\n\nYou know, my thing is that the only thing you have\n\nas a filmmaker is your point of view.\n\nThat's it.\n\nYou're not right. You're not wrong.\n\nYou're not morally correct.\n\nYou're not morally wrong.\n\nOkay. You are just you.\n\nYou are like a prism.\n\nAnd so the way you see kind of shines through you\n\nAnd goes.\n\nLike, my favorite movies are movies\n\nwhere I can kind of feel the director's hand\n\na little bit, right? Yeah. Yeah.\n\nTheir guide, they're showing me things\n\nI wouldn't have thought of.\n\nAnd I think that in the end,\n\nthat's what it comes back to, is that\n\nI want that point of view, that human point of view\n\nto really be kind of moving me, like\n\nin a narrative way through a story\n\nthat I wouldn't have thought of,\n\nor that I couldn't imagine what's gonna happen next.\n\nAnd I just think that that's really what we,\n\nas audiences, that's what we pay for.\n\nThat's what we hunger for.\n\nAnd so how that's gotten to,\n\nlike what tools are used to get to that\n\nvery human thing, that could change.\n\nYou're not precious about the tools that you're using.\n\n[Zach] I'm precious about that voice.\n\nThe vision and the voice. Yeah. Yeah.\n\nAll right.\n\nWell, I think that's a great way\n\nfor us to end it off.\n\nZach, thank you so much for being here.\n\nAwesome. Thanks, guys. [audience clapping]",
  "authors": [
    "Condé Nast"
  ],
  "url": "https://www.wired.com/video/watch/when-tech-and-entertainment-collide-a-conversation-with-zack-snyder"
}