{
  "title": "Bill Gates on His Early Years & The Inspiration Behind 'Source Code: My Beginnings'",
  "text": "Transcript\n\nSo I had like four times where I thought,\n\nhey, I'm pretty good at programming,\n\nand then I was either given a hard task or feedback\n\nand I said, No, there's another level here.\n\nAnd so by the time I go to Harvard,\n\nI've had thousands of hours\n\nof complex programming experience.\n\nI was so lucky in those things.\n\nHi, I'm Steven Levy.\n\nToday we spoke with Bill Gates about privilege,\n\nhis desire to succeed, and how,\n\nas a kid, he drove his parents insane.\n\nThis is The Big Interview. [intense music]\n\n[photos clicking]\n\nI know that you have been thinking\n\nabout doing a first-person book,\n\nsome sort of autobiography, for many, many years.\n\nI talked to you about it like 30 years ago maybe.\n\nWhy do that now?\n\nI hired Rob Gupt to help me dig out all the old facts,\n\nget the report cards, and go talk to all of my friends\n\nand colleagues from early days.\n\nSo yes, it's a project we've been working on for some time.\n\nIt was only about 18 months ago\n\nthat we decided taking this first phase of my life,\n\nabout 25 years, right as I start Microsoft,\n\nand doing a book where my parents, my upbringing,\n\nthe luck of what I was exposed to, that was the whole story.\n\nAnd once that idea came up, I got quite enthused about it,\n\nbecause we weren't getting into the current stuff\n\nwhere there's still a lot not figured out.\n\nI mean, the foundation's goals are ongoing.\n\nEven Microsoft, although I play a modest role as an advisor,\n\nthe AI stuff is of course very, very much ongoing.\n\nAnd so it was really fun to take this period\n\nand try and explain how amazing my father was, my mother,\n\nmy sisters, just a huge variety of things\n\nthat got me to be kind of forward looking.\n\nAnd by the time I'm 20 years old,\n\nI found myself more enmeshed in programming and the magic\n\nof what programming could do than almost anyone.\n\nSo I love the way it's come out,\n\nthat we just do this first 25-year period,\n\nwhich we're calling Source Code.\n\nAnd then another book can take the whole Microsoft story.\n\nAnd then a different one can take the philanthropic work\n\nand contemplate that.\n\nWell, by doing that, by breaking that out,\n\nit becomes way more personal\n\nthan anything that we've seen from you.\n\nPeople like me have been pounding you, asking you questions.\n\nWhen can these self-reflectives?\n\nAnd you've done it here.\n\nI know that you admire the Agassi book by J.R. Moehringer.\n\nI don't know whether you considered him to be a co-writer.\n\nIs that a thought you might have?\n\nNo, we, I mean, we had our team pretty early on.\n\nBut that's a great book.\n\nBut you, in a way, went on there\n\nand you held a mirror to yourself.\n\nThis is very much a bildungsroman,\n\nlike a coming-of-age story.\n\nAnd sometimes the mirror didn't portray\n\nsuch a flattering image, did it?\n\nI mean, I had my ups and downs.\n\nI had conflicts with my parents.\n\nI had, I was using Harvard computer time,\n\nand they were confused about what I was doing.\n\nThe first customer, you had MITS, we had a complex contract.\n\nWe ended up in a dispute, surprisingly, with them.\n\nMy relationship with Paul is a very central piece\n\nof how Microsoft comes together,\n\nand Paul and I are working together super well,\n\nand then disagreeing.\n\nSo yes, between my parents and Paul.\n\nAnd I had a lot of uncertainty,\n\neven though the software thing,\n\nthere were many experiences that made that\n\njust such a unique thing that, wow,\n\nwhy do I see this when other people don't see it.\n\nBut yeah, it's hopefully a very human story.\n\nIt's not immaculate conception.\n\nWell, it is a human story,\n\nand I think one where it gets to very emotional ground.\n\nI remember I did a profile of you, I think in 1999.\n\nAnd your father told me a little bit\n\nabout some of the stuff in here,\n\nand he said your mother was traumatized by the situation.\n\nYou wouldn't talk for days on end.\n\nYou say yourself that the things that really interested you\n\nwere like reading, and math, and being inside your own head,\n\nand in some ways you weren't kind to your parents.\n\nAnd I think unrolling some instances like that,\n\nyou seem a little remorseful.\n\nWell, I give both of my parents, each in their own way,\n\na lot of credit for how they shaped me.\n\nYou know, with my dad, it was much more setting an example\n\nof always being serious about his work,\n\nof sharing anecdotes.\n\nWith my mom, it was far more intense, that,\n\nOh, you didn't get up here as soon as I wanted,\n\nor, Your table manners weren't as good as I wanted.\n\nSo yeah, in the case of my mom, I was often falling short.\n\nShe did get me to interact with the adults that were around.\n\nThat was a skill that became quite valuable for me.\n\nSo she helped compliment my intense desire\n\nto study and understand things.\n\nBut yeah, the tension between my mom and I was,\n\nshe was always pushing for me to do better,\n\nand eventually proud of what I achieved.\n\nBut that was a complex relationship.\n\nVery amazing, I mean, my mom was a phenomenal person,\n\nnot just her social skills,\n\nor her ambition for herself, her husband, and me,\n\nbut just, she was a special person.\n\nClearly there was a lot of love,\n\nbut they were at their wit's end\n\nto figure out what to do with you.\n\nTowards the end of the book, you say something that,\n\nyou say if this were today you would've been diagnosed,\n\nyou said, probably, on the autism spectrum.\n\nWhat led you to that conclusion?\n\nWhen did you start thinking about that?\n\nWell, I know when I was growing up, this idea that they,\n\nI would go and talk to a therapist\n\nwas actually quite an unusual thing.\n\nAnd this guy, Dr. Cressey, who really got me thinking about,\n\nokay, what was I trying to achieve\n\nin this conflict with my parents.\n\nDid I really have some thought in mind\n\nor was I just trying to make trouble?\n\nThat was, I think, quite unusual.\n\nBut back then, the idea that kids were very different,\n\nand there some kind of interventions,\n\nthat just wasn't commonplace at all.\n\nI was clearly somewhat hyperactive.\n\nI could concentrate a great deal.\n\nI think, in fact, I did get to see that therapist was good.\n\nWho knows what it would've been like?\n\nKids are much more looked over.\n\nThe thing where I was able to go off to the computer center,\n\nor even spend all that time alone,\n\neven going out on those hikes,\n\npeople are protective enough, they might view a lot of that.\n\nYeah, you describe these epic, crazy hikes\n\nthat you wouldn't think of sending a 12-year-old\n\nor 13-year-old today.\n\nThey were super dangerous.\n\nYeah, even though now you'd have a GPS tracker.\n\nWell, has that realization sort of shaped you?\n\nYou're a super curious person.\n\nCuriosity is something that runs through this book.\n\nHave you like pursued the curiosity about that,\n\nin terms of understanding yourself?\n\nWell, I do, even at this age, I love learning new things,\n\nand I view all of my work as kind of being a student,\n\nand super lucky, not just the things I get to read, but.\n\nAnd these days you can learn so easily.\n\nAnd then I get access to experts.\n\nI mean, when I'm confused about AI,\n\nSam Altman gets 10 people together and we sit and talk.\n\nI'm very lucky that my career path has meant\n\nthat my deep curiosity, I've been able to maintain it.\n\nAnd I think it is part of my success,\n\nis really wanting to understand things in a pretty deep way.\n\n[photos clicking]\n\nAnother thing which struck me, reading the book,\n\nis I knew you came from a well-off family.\n\nAnd something, again, you refer to\n\ntowards the end of the book,\n\nhow much privilege is part of your story.\n\nYou say, I was like a white male\n\nthat's in a privileged position.\n\nBut your family was very well off.\n\nAt various parts, your father sort of like swoops down\n\nwith like legal help, and you get in trouble at Harvard,\n\nand he flies out across the country.\n\nAnd it seems that, just at other times,\n\nteachers would come in, even though you were\n\ninside your own head, people had your back at every turn.\n\nOh, there were teachers who put such a high percentage\n\nof their time into me versus the other students.\n\nI was so lucky in those things.\n\nAnd the one funny thing is my parents were well off,\n\nbut compared to the kids at this private school I was at,\n\nI was below average.\n\nI mean, they had bigger houses and they had wealth.\n\nMy dad was well paid to be a lawyer,\n\nbut we weren't a family that had wealth.\n\nSo I managed to both have the benefit\n\nof being at that school and actually have a little bit\n\nof a chip on my shoulder that, hey,\n\nyou guys are so much better off,\n\nyour parents gave you a car,\n\nand you didn't have to work in the summer.\n\nBut yes, you could hardly design a better childhood,\n\nincluding a timesharing computer terminal showing up\n\nwhen I'm 13 years old, and the high school scheduling,\n\nwhich is a super interesting algorithmic problem where,\n\nbecause I was good at math, they asked me to solve it.\n\nYeah, you did this unbelievable scheduling thing\n\nfor your school. Right.\n\nAnd the first time they asked me, I say,\n\nNo, I don't know how to do that.\n\nAnd then six months later when, tragically,\n\nthe people who are working on it are in a plane crash,\n\nI've actually figured out how to do it.\n\nSo the first serious algorithm was actually deciding\n\nwhen the classes would meet,\n\nand who would be in which classes,\n\nwhich is a very kind of cool problem.\n\nAnd so then to have that,\n\nthen to have TRW have this incredible project\n\nthat was very state of the art,\n\nin terms of real time reliability,\n\nand to have the great programmers there, including Norton,\n\nembrace me and say, Yeah, you think you're good,\n\nbut this code is not very good.\n\nRight, this was like a mentor you had\n\nwhen you were working on this project for TRW as a kid.\n\nRight, so I had like four times where I thought,\n\nhey, I'm pretty good at programming,\n\nand then I was either given a hard task or got feedback\n\nand I said, No, there's another level here.\n\nSo by the time I go to Harvard, I've had thousands of hours\n\nof complex programming experience.\n\nAnd then when I get there, I get to do even more.\n\nSo yes, the fact that parents encouraged me, as a male,\n\nthe idea of doing all, being weird like this was,\n\neh, it was kind of okay.\n\nThe school I went to,\n\nand that high school is a fantastic high school.\n\nI had at least five or six teachers\n\nwho kind of saw a spark in me and really engaged with me.\n\n[photos clicking]\n\nMalcolm Gladwell, in his book about outliers,\n\nsays that the ingredients are like 10,000 hours,\n\ncertainly you've topped that by a big number,\n\nin terms of programming,\n\n10,000 hours of practice doing something.\n\nI guess a degree of timeliness, which you just talked about.\n\nI still find that kind of unsatisfying.\n\nWhat makes Bill Gates, Bill Gates?\n\nWell certainly it's not just the circumstances,\n\nbut that's gigantic.\n\nI mean that eliminates people born at a different time,\n\nand many people\n\nwho didn't get the educational opportunities.\n\nYes, there's still a few million kids\n\nwho are in the same milieu that I am.\n\nAnd then it's okay, seeing my father,\n\nunderstanding the common sense of business,\n\nseeing a business like Physio Control that was up and down,\n\nthe early engagement with Digital Equipment Corporation,\n\nwhich to me was this vaunted company\n\nthat proved that it wasn't just mainframes,\n\nand those people embraced me.\n\nI mean, I got to know them in many phases,\n\nincluding once they offered me a job,\n\njust 'cause I wanted that reinforcement.\n\nSo yes, there's something about my desire to succeed,\n\nand my skillset, being forward looking,\n\nwhich my friend Kent Evans, who's in the book,\n\nhelped really cement that.\n\nKent helped shape me as forward looking, amazing person.\n\nAnd then Paul's more off reading about the chip stuff.\n\nI didn't read Electronics magazine.\n\nWell after Paul showed me it, okay, then I did.\n\nBut that's Paul, and it's actually pretty unnatural,\n\n'cause he's two years ahead of me,\n\nthe fact that he seeks me out and says,\n\nBill, what does exponential improvement mean?\n\nAnd I say, Are you kidding?\n\nThat is mine.\n\nExponential improvement is a very, very special thing\n\nthat doesn't happen except in rare, rare, rare cases.\n\nPaul also clued you on to LSD,\n\nwhich you talk about taking a couple times.\n\nSteve Jobs would always say\n\nthat was like the formative experience\n\nand helped open up the gates of design in his mind.\n\nI don't get that impression that you felt that\n\nto be a life-changing experience.\n\nI think the batch that he got\n\nmust have really been good [Steven laughs]\n\nfor product design and marketing.\n\nI mean, my god, just think if I'd had that batch.\n\nYeah, I did some crazy things when I was young,\n\nand Paul deserved some credit for that.\n\nBut yeah, we did that together a few times.\n\nEventually we gave it up.\n\nBy the time we get serious about work,\n\nwe're not doing that anymore.\n\nYou also mentioned the famous time you got busted\n\nfor speeding and spent the night in jail.\n\nI was hoping to learn more about that.\n\nDid that freak you out, spending a night in jail?\n\nNo, it was just kind of a funny thing.\n\nI mean, they thought it was strange to have somebody\n\nso young that had a nice car.\n\nYou had a Porsche.\n\nWhat was the story with this kid?\n\nWas I a drug dealer or something?\n\nI clearly didn't fit their normal pattern.\n\nWe kept enough cash around\n\nthat Paul was able to come down and bail me out,\n\nbut took him a few hours to get it together.\n\nSo yeah, there's that, a famous mugshot of me in Albuquerque\n\nbecause I got pulled over and didn't have my license.\n\nIn the end of the book,\n\nyou say that sometimes you look back\n\nand wish you were back again\n\nwhere you were when you were 13 years old,\n\nand just like learning about everything.\n\nAnd you describe yourself, at that time,\n\nas someone who just lived largely inside your head.\n\nTalk about that. Are you?\n\nWith all your success, and all the access to the world,\n\nreally, that you have, you look back,\n\nand wanna roll the tape back?\n\nWell, I've been so lucky\n\nthat I'm not saying I want to go back and change something.\n\nBut it was kind of amazing to live through that,\n\nhey, I'm just this kid and all of us are the same,\n\nto okay, here's something I'm curious about,\n\nhere's some people to do it with me.\n\nHaving a dream, a computer on every desk in every home,\n\nthe importance of software,\n\nto actually have it come completely true\n\nand get to work with, in this phase of my life,\n\nwith Kent, and with Paul,\n\nand I'm just meeting Steve Ballmer at Harvard,\n\nbut he hasn't come to help.\n\nI'm sure we'll hear a lot about that.\n\nThat'll be right at the start of the Microsoft book.\n\nWe're up in Seattle and I decide,\n\nboy, I can't run this thing myself.\n\nI need my friend who really gets business,\n\nand management, and people, and so he comes in.\n\nSo it was so magical and so incredible\n\nthat I do kind of miss that wonderful thing\n\nwhere the whole thing was in doubt.\n\nThere were days when I thought, oh, we are so messed up,\n\nand other people are ahead of us,\n\nand who do we think we are to have these wild dreams,\n\nand yet, step by step,\n\nwe build this incredible group of people.\n\n[photos clicking]\n\nYou know, it's interesting, the book, again,\n\nis a coming-of-age story.\n\nBut you talk about, you look back\n\nand say how much we are shaped by who we are,\n\nand we are like who we are.\n\nYou talk about saying, boy,\n\nI think somewhat remorsefully saying,\n\nI was like a smart aleck in school\n\nand that wasn't a smart thing to do.\n\nAnd you talk about being, pushing back about everyone.\n\nAnd it made me think really the way you behaved\n\nin your deposition, being a smart aleck there.\n\nAh, you think I was a smart aleck, that lawyer,\n\nnow that's a smart aleck. [Steven laughs]\n\nNot recalling the specifics of the interview is\n\nthat it's very unlikely I would make a statement like that\n\nwithout some common understanding between myself\n\nand the reporter of what that term,\n\nwhich, out of context, is incredibly ambiguous,\n\nwhat it meant in the context of her series of questions.\n\n[Lawyer] And just to be sure I understand it,\n\nwhat you're saying is that you don't remember\n\nwhat the definition was,\n\nand you don't even remember that there was a definition,\n\nbut you believe there must have been a definition\n\nor you wouldn't have been using these words.\n\nIs that fair?\n\nThere must have been a common understanding,\n\nI wouldn't say a definition.\n\nThere's a certain clever boy shortcut use of sarcasm\n\nthat allows you to communicate efficiently.\n\nIt can be kind of funny.\n\nAnd yes, that whole kind of sparring,\n\nthat sitting at night at Harvard, talking to each other,\n\nthat kind of dialogue doesn't work\n\nwhen you're managing people.\n\nOr even my skill of procrastination, which at Harvard,\n\nthat was my personal position was,\n\nah, I don't work in these classes 'til late.\n\nSo yeah, there's a lot of habits of being a young,\n\ntrying to be a cool, maybe not succeeding,\n\nbut trying to be a cool student,\n\nthat I actually had to break those habits,\n\nprocrastination, being super clever and kind of sarcastic,\n\ntearing somebody's argument apart.\n\nI mean, yes, the underlying skill is actually worthwhile,\n\nbut knowing not to deploy it as the kind of go-to approach,\n\nwhich when I was a student was kind of my whole way\n\nof engaging with other people.\n\nWe have the one anecdote in there\n\nwhere I told this professor how wrong he was,\n\nand I was just so certain of myself.\n\nAnd you were wrong.\n\nAnd then five minutes after I attack him,\n\nI realized, oh god,\n\nthere's a reason why it actually comes back.\n\nAnd his thing was completely right\n\nand I was completely wrong.\n\nThat was a helpful experience\n\nbecause the guy was so nice about it,\n\nand I was so outta line.\n\nOne final question, do people really change?\n\nNo, I think you moderate,\n\nand you become wiser, and you grow.\n\nBut the idea of, am I still pretty much\n\nthat same kind of hyperactive, curious,\n\nmaybe I can figure this out\n\nthat other people can't figure out.\n\nAnd if I do figure it out, what am I gonna do about it?\n\nWho do I work with on this?\n\nI'm still 95% that same person.\n\nBill, thanks so much for doing The Big Interview.\n\nThank you. [intense music]\n\n[photos clicking]\n\n[distorted music]",
  "authors": [
    "Condé Nast"
  ],
  "url": "https://www.wired.com/video/watch/bill-gates-on-his-early-years-and-the-inspiration-behind-source-code-my-beginnings"
}