{
  "title": "Walmart is poised to be a holiday season winner",
  "text": "Walmart banks on strong holiday sales as shoppers seek deals\n\n14 hours ago Share Save Danielle Kaye Business reporter Share Save\n\nReuters A person looks at Butterball frozen turkeys for sale at a Walmart store. Walmart's dominance in the US retail sector is setting it up to be a holiday season winner.\n\nUS retailers are on edge as they enter the crucial holiday season marked by consumer angst. But Walmart's confidence has not been shaken. While many stores are wary about their year-end sales, Walmart's dominance in the US retail sector may help it be a holiday season winner, drawing in low and higher-income shoppers alike as they grapple with an uncertain economic outlook. The retail giant on Thursday reported US sales that beat analysts' expectations, rising 4.5% during the three months to 31 October. Walmart now expects to make a larger profit this year than previously thought, citing success in beating out rivals for shoppers' limited dollars and a rosy holiday sales forecast.\n\nAnnual net sales are expected to grow by 4.8% to 5.1%, Walmart said, up from a earlier forecast of 3.75% to 4.75% sales growth. The biggest retailer in the US, known for its low prices, reported strong sales across its key sectors in the recently-ended quarter, including grocery and clothing. E-commerce sales in the US jumped 28%, propelled by online orders and advertising. Walmart bosses said there was some easing in spending among lower-income shoppers. But they stressed that spending was still robust among Americans across income groups - notably, among wealthier consumers. The Conference Board's US consumer confidence index for October edged down to its lowest level since the spring and showed a sharper decline in sentiment among households earning less than $75,000. It is a dynamic that reflects a growing divide in the US, or a so-called \"K-shaped\" economy. Lower-income consumers are pulling back as they buckle under financial strain, while Americans with larger salaries increasingly prop up spending and economic growth. \"Walmart is better insulated than just about anybody given the value proposition we have,\" John David Rainey, Walmart's chief financial officer, said on a call with analysts. Shares in Walmart rose more than 6% in Thursday morning trading after the company's quarterly report. Higher earners drove much of Walmart's margin growth, said Hitha Herzog, a retail analyst. The chain \"mixed the prices around so that you had that margin expansion, but you were able to not eliminate or get rid of those customers that needed to be saving,\" she said. Walmart executives said the effects of US President Donald Trump's tariffs have been more muted than initially expected. The Trump administration's latest move to roll back tariffs on more than 200 food products is \"really appreciated\" and will benefit consumers, they said.\n\nNavigating tariffs",
  "authors": [],
  "url": "https://www.bbc.com/news/articles/cjd0d9jjgrxo"
}