{
  "title": "The Ice Tower review – Marion Cotillard focus of obsession and idolisation in death-wish fairytale",
  "text": "An eerie and unwholesome spell is cast in this film; it is a fairytale of death-wish yearning and erotic submission. It wittily fuses the real and the fictional into a trance-state – and that’s the state that I’ve sometimes found a little static in previous films by Lucile Hadžihalilović, but not here. Dreamily strange it might be (and in fact, on the face of it, entirely preposterous) this movie had me gripped with its two outstanding lead performances – from Marion Cotillard and newcomer Clara Pacini – and a clamorous musical score.\n\nCotillard plays a diva-ish movie actor called Cristina, who is the lead in a new adaptation of Hans Christian Andersen’s The Snow Queen being filmed on a soundstage which is in a remote and snowy spot in late 60s France; she is gorgeously costumed in a sparkling white form-fitting gown and crown, a look she carries off with great unsmiling hauteur. Pacini plays Jeanne, a teenage girl in a foster home nearby, stricken with memories of the death of her mother, whose bead necklace she keeps. In her loneliness and grief, Jeanne has projected her feelings into an obsession with the story of the Snow Queen, an obsession further displaced at another remove into idolising the teen girls who ice-skate at the local rink. One day she runs away, stealing the ID of an older girl called Bianca and breaks into the film studio to sleep overnight; she somehow gets a job as an extra, astonished to realise what story is being filmed, and it is here that her gamine prettiness and air of demurely sensitive adoration for the queen catches Cristina’s eye.\n\nCristina’s somewhat louche director Dino, played by cameo by Hadžihalilović’s partner Gaspar Noé, is in the habit of telling likely young actresses that he might cast them in his next project, a Hitchcockian thriller. In fact, there is something Hitchcockian in this shoot, with an attack carried out by a bird, and in Cristina’s own cold, cruel detachment from the victim’s suffering. Hadžihalilović might intend us to notice in one shot a movie poster for The Red Shoes, but the Powell/Pressburger film that this more resembles is surely Black Narcissus with its female desire and delirium in the bitter mountain cold.\n\nCristina and Jeanne become very close in a dangerous way, although the younger woman is always subject to Cristina’s whim and caprices, the starry mannerisms which Cristina has learned to enforce her own status and mask her vulnerability. There is a great shot of Jeanne’s awestruck gaze as she turns the pages of a glossy-magazine profile of Cristina. She learns, along with the audience, that they have much in common: Cristina herself was once in a foster home, and appears to have been guided and protected in her early years by a male confidant, Max (August Diehl), who calls himself her friend and doctor. Has Max been prescribing certain medications for Cristina?\n\nSequences in the film let us drift on to the set of The Snow Queen, as if in a dream; it is a production design which fabricates the ice-realm in all its seductive artificiality, with the ice tower in one shot juxtaposed with Cristina’s own statuesque poise. We can feel what Jeanne woozily feels: that she has miraculously found herself in the ice realm with the ice queen herself. But what does Cristina want of Jeanne – and what can she want of Cristina? It is a mesmeric melodrama, mixing sensuality with a teetering anxiety, balancing on a cliff-edge of disaster.",
  "authors": [
    "Peter Bradshaw"
  ],
  "url": "https://www.theguardian.com/film/2025/feb/16/the-ice-tower-review-marion-cotillard-focus-of-obsession-and-idolisation-in-death-wish-fairytale"
}