{
  "title": "Liars by Sarah Manguso audiobook review – livid tale of marriage gone awry",
  "text": "Halfway through Liars, the story of a new relationship that becomes a marriage, our protagonist, Jane, is asked by a neighbour: “Why are you with him?” It’s a question that has been on the listener’s mind for some time.\n\nJane’s partner, John, lies about his feelings, his financial status, where he is going and where he has been. He is chaotic, lazy, resentful, entitled and given to getting drunk and spending money he hasn’t got. At the start of their marriage, Jane’s career as a writer and academic is on the up, while John – a visual artist and aspiring film-maker – has hit a professional wall. Time and time again, he insists they move cities for better work opportunities, which soon puts a spanner in his wife’s working life. It comes as no surprise that, after their son is born, Jane is left to do the parenting while her husband absents himself from his responsibilities.\n\nVoice actor Rebecca Lowman is the narrator whose seething, staccato delivery finds a natural home in Sarah Manguso’s quietly livid prose. “My husband asked me why I was so much angrier than other women. It always made me smile,” Jane reflects. “I was exactly as angry as every other woman I knew.”\n\nBut is John solely to blame for the couple’s troubles? As Jane chronicles one slight after another, all the while making excuses for them both, you begin to wonder about her collusion and self-deception in this unhappy setup. Manguso’s ultimate message is that, despite the best intentions, marriage makes liars of us all.\n\nAvailable via Picador, 6hr 7min\n\nFurther listening\n\nFinding My Way Back\n\nMalala Yousafzai, Weidenfeld & Nicolson, 8hr 56min\n\nThe second memoir from the Nobel peace prize-winning activist focuses on the aftermath of her attempted assassination by the Taliban, during which she navigates fame, friendship, first love and studying for a degree at Oxford. Read by the author.\n\nskip past newsletter promotion Sign up to Inside Saturday Free weekly newsletter The only way to get a look behind the scenes of the Saturday magazine. Sign up to get the inside story from our top writers as well as all the must-read articles and columns, delivered to your inbox every weekend. Enter your email address Sign up Privacy Notice: Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on theguardian.com to send you this newsletter. You can complete full registration at any time. For more information about how we use your data see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nThe Maid’s Secret\n\nNita Prose, HarperCollins, 11hr 4min\n\nLauren Ambrose narrates the third novel in Prose’s crime series featuring a sleuthing hotel maid named Molly. After a priceless Fabergé egg goes missing from the Regency Grand Hotel, Molly receives a threat to her life.",
  "authors": [
    "Fiona Sturges"
  ],
  "url": "https://www.theguardian.com/books/2025/nov/20/liars-by-sarah-manguso-audiobook-review-livid-tale-of-marriage-gone-awry"
}