{
  "title": "What does it take to work in the same job for decades?",
  "text": "What does it take to work in the same job for decades?\n\nJUANA SUMMERS, HOST:\n\nThink about a workplace where there's maybe one person who's been there forever, that person who has all the institutional knowledge and the answer to almost any question. In so many workplaces, it feels like the veteran employee is becoming rare. People switch jobs all the time, and holding on to the same job for decades, well, it's just a lot less common. We're joined now by Wall Street Journal reporter Chip Cutter, who recently spoke with a bunch of the longest-tenured employees at a range of companies in all of these different fields, and he joins us now. Welcome back.\n\nCHIP CUTTER: Hi there. Thanks for having me.\n\nSUMMERS: Thanks for being here. Chip, just start by telling me, how did you come up with this idea? What made you want to talk to some of the longest-tenured employees in the United States?\n\nCUTTER: This has been something I've wanted to do for years because I'm so fascinated by these people. You know, I really wanted to figure out not only who has been at a company for a long time, but who are the single longest-serving employees inside America's biggest companies. I just thought they would be able to tell us so much about how work has changed, where it's going, what they've seen. And it was fascinating for me to sort of figure who are people who have spent decades and decades inside these companies we all know. And what was interesting is that some of these employees are well into their 80s, and they still can't think of the idea of retirement. And I think that just says so much to us about the importance of work, particularly this very American idea of how work provides such a core part of our identity in many ways.\n\nSUMMERS: OK, let's stick with that for a second. I have to tell you - I love my job. I'm not sure that I will still be wanting to do it at 80.\n\nCUTTER: (Laughter).\n\nSUMMERS: How did some of these employees that you talked to explain their willingness to still want to be in these jobs all of those decades into later life?\n\nCUTTER: OK, so let's give some examples. Like, I think about someone - this woman, Jacqueline Graf. She is Target's longest-serving employee. So of Target's 400,000 employees, she has been there longer than anyone else. She is essentially a cashier. Her title is guest advocate. She works at a Target outside of Denver. She joined in 1970. When she started there, barcodes weren't even a thing. They hadn't been introduced yet. Cashiers would type in this long string of digits to ring up orders, and then cash registers punched holes into paper tape to record sales, so a lot different from where things are today.\n\nAnd she told me that she actually has just really enjoyed her decades and decades at Target, partly because she knows everyone in the store. She has trained, by her estimate, at least hundreds of different people. She told me something, and she said is that, you know, she could possibly stay home, but she doesn't want to do that. She said she doesn't want to stare at walls, was how she put it to me. She just finds that being there in the store actually adds to her life.\n\nSUMMERS: I mean, you can't talk about these kinds of long tenures in the workplace without talking about just how much the American workplace has changed over the last 50 years or so, particularly when it comes to the technology that exists in all of our workplaces now. Are there any examples of that technological change that came up in your conversations with these workers?\n\nCUTTER: Constant. There was so much that - I mean, a lot of these employees joined before email was common, before sort of - obviously, sort of the way that, you know, sort of we process work now through the internet and through digital communication. I mean, some workers said, for example, that they still remember when the first smartphones were given out at their company - the first mobile phones, period, were given out. That was almost like a badge of honor, that you were important enough to get a phone at your company. And of course, now we're all tethered to them.\n\nFord's longest-serving employees are really interesting. They both work at the same stamping plant outside of Chicago - Art Porter and Calbert Wright. Art is 86 years old. Calbert is 85. They said that they joined before robots were common throughout that facility.\n\nSUMMERS: Wow.\n\nCUTTER: And they said the work was just so much harder then. It was more dangerous. One of the workers said that he remembers when it would be a hundred degrees in the plant. You'd get all that heat out of the basement of the facility coming up, blowing in your face. And so they would argue that automation has kind of made their jobs better, even though it certainly changed them.\n\nSUMMERS: Now, I understand that most U.S. employees switch jobs on average every four years, so what did your reporting tell you about those people? I mean, are those kind of job switchers just doing it all wrong?\n\nCUTTER: I don't think they're doing it all wrong. I think they're sort of just realizing this is how careers go these days. I mean, I think there used to be this contract where if you would stay loyal, the company would take care of you. I think it's a little more transactional now. You may have to job hop. Some people now talk about careers almost as, like, tours of duty, where you might spend a few years inside of a company and then realize you need to go somewhere else because that job changed, because you realized that job, you know, no longer exists at your company - whatever it might be. So I think sort of this idea that you can have decades and decades inside of one company, it's becoming increasingly rare - one reason these people are so interesting.\n\nSUMMERS: And Chip, I do have to ask you, in all of these conversations, in all of this reporting, did you learn anything that changed the way you think about work?\n\nCUTTER: Well, I did. Actually, I mean, partly, it made me realize that I just have to embrace change myself. I can't resist it. But I also - I thought a lot about sort of how these employees maintain their longevity. There was one worker in particular that is in my head. His name is Ron Stafne. He's a manufacturing engineer at 3M. He's 79 years old, and even now, he still gets up at 4 a.m. every day and does at least 50 pushups and seven minutes of planks. And then he'll...\n\nSUMMERS: Oh, my gosh.\n\nCUTTER: I know. I mean, I am not doing that. And he makes me - I think about him all the time now when I don't want to go to the gym. And so he said, you know, he'll get to 3M's facility and then do more pushups, more calisthenics in his office. And so I think about just how you maintain your health and how you think about just keeping your body sort of ready to sort of be able to have these long careers. Some of these folks really pay attention to it, work at it, and it's made me realize I can't slack off there either.\n\nSUMMERS: Chip Cutter is a reporter with The Wall Street Journal covering workplace, management and leadership issues. Chip, thanks.\n\nCUTTER: Thanks so much.\n\nCopyright © 2025 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\n\nAccuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.",
  "summary": "NPR's Juana Summers speaks with <em>Wall Street Journal</em> reporter Chip Cutter, who recently spoke with a bunch of the longest-tenured employees at a range of companies, all in different fields.",
  "published": "Tue, 18 Nov 2025 17:13:51 -0500",
  "url": "https://www.npr.org/2025/11/18/nx-s1-5606082/what-does-it-take-to-work-in-the-same-job-for-decades",
  "source": "NPR Topics: Business"
}