{
  "title": "Your guide to women's college basketball Feast Week: Best games to watch over the next 10 days",
  "text": "Taylor Stremlow takes her time and comes up with the bucket for Iowa. (0:18)\n\nOpen Extended Reactions\n\nLas Vegas has already hosted some important and exciting early-season games, but nothing tops next week's Players Era Women's Championship, a chance for players to earn NIL money and for teams to separate themselves from the other elite squads in the country.\n\nFour of the nation's best -- Duke, South Carolina, Texas and UCLA -- meet up at Michelob ULTRA Arena, the home of the WNBA champion Las Vegas Aces, on Wednesday and Thanksgiving Day to compete in a Final Four-caliber event.\n\nThat's the highlight of the holiday week tournaments and games -- but far from the only intriguing action across the globe over the next 10 days. Games from Puerto Rico to Cancun and from Florida to Texas help create one of the best stretches on the basketball calendar this season.\n\nMany of these games will have far-reaching implications into March and could be the difference between being in or out of the NCAA tournament field.\n\nIt's a crowded sports calendar this time of year, but this is your guide to the best games and how to watch them. Come back after the final whistle to see how each game ended and for analysis on how it might impact March.\n\nAll times Eastern\n\nJump to: Results and analysis\n\nFriday\n\nMichigan vs. UConn\n\n8 p.m., Fox, Hall of Fame Showcase (Uncasville, Connecticut)\n\nSyracuse and Utah tip off the event (5 p.m., FS2), but this is the marquee game of the two days at Mohegan Sun -- and it got even bigger after Michigan's 39-point win over Notre Dame on Saturday.\n\nSaturday\n\nMiami vs. Iowa\n\n8 p.m., ESPN+, WBCA Showcase\n\nThe Hawkeyes get two notable games in Orlando. A Hurricanes team with 12 new players gets its first true test.\n\nSunday\n\nUtah vs. UConn\n\n2:30 p.m., FS1, Hall of Fame Showcase\n\nThe Utes are another potential bubble team that needs a boost. Winning is not essential here, but a good performance against the No. 1 team in the country will be enough to help.\n\nWashington State vs. Missouri\n\n3 p.m., ESPN+, WBCA Showcase\n\nThe WBCA Showcase wraps up with this single game on Sunday. The Tigers need to string together some wins after falling to Kansas over the weekend if they want to remain in bubble contention before SEC play begins.\n\nMonday\n\nBelmont vs. Ohio State\n\n11 a.m., FloHoops, Baha Mar Hoops Pink Flamingo, Goombay Division (Nassau, Bahamas)\n\nThe Buckeyes weren't able to hang with UConn on Sunday, making this game that much more important. Ohio State's Jaloni Cambridge against Belmont's deep and experienced backcourt is the matchup to watch.\n\nMinnesota vs. South Florida\n\n4 p.m., FloHoops, Baha Mar Hoops Pink Flamingo, Junkanoo Division\n\nIf the Bulls want to be in the running for an at-large bid, this is the kind of game they need to win. Minnesota has many more opportunities for résumé wins in the Big Ten, but a good showing in the Bahamas sets up the Gophers nicely.\n\nTuesday\n\nEmerald Coast Classic, Bay Bracket championship game\n\n1:30 p.m., FloHoops (Destin, Florida)\n\nMississippi State and Middle Tennessee will be favored to get here. Winning both games is especially important to the Bulldogs, who have gotten off to a good start but need to build up the win total with the SEC gauntlet awaiting.\n\nAll of ESPN. All in one place. Watch your favorite events in the newly enhanced ESPN App. Learn more about what plan is right for you. Sign Up Now\n\nOregon vs. Saint Mary's\n\n2:30 p.m., FloHoops, Hoopfest Women's Basketball Classic (Frisco, Texas)\n\nThe Gaels and the Ducks have gotten off to good starts against the softer parts of their schedules, so this Thanksgiving trip provides some key tests. Oregon can't afford a stumble because December brings games against Oregon State, UCLA, Stanford and Michigan.\n\nTexas A&M vs. Colorado\n\n7 p.m., BallerTV, Hawaii North Shore Showcase (Laie, Hawaii)\n\nNy'Ceara Pryor, who dominated for three years at Sacred Heart, has made her way to a Power 4 school with the Aggies. She's filling the stat sheet, leading the team in points, assists and steals.\n\nEmerald Coast Classic, Beach Bracket championship game\n\n7:30 p.m., FloHoops (Destin, Florida)\n\nVirginia and Nebraska are the favorites to meet for the Beach Bracket title. A backcourt meeting of the Cavaliers' Kymora Johnson, one of the underrated players in the country, against the Huskers' Britt Prince is worth tuning in to see.\n\nWednesday\n\nBaha Mar Hoops Pink Flamingo, Goombay Division championship game\n\n1:30 p.m., FloHoops (Nassau, Bahamas)\n\nWest Virginia will likely get the Belmont-Ohio State winner. After beating Duke with just five players in the second half last week, the Mountaineers are getting much more attention.\n\nTexas vs. UCLA\n\n2 p.m., truTV, Players Era Championship (Las Vegas)\n\nThis is the event of the week -- and possibly the event of the season prior to March. The Bruins have already had a difficult nonconference schedule with wins over Oklahoma and North Carolina, but nothing on their schedule matches the quality of the Longhorns.\n\nJoyce Edwards and South Carolina and Madison Booker and Texas join Duke and UCLA in the Players Era field in Las Vegas. Adam Davis/Icon Sportswire\n\nBaha Mar Hoops Pink Flamingo, Junkanoo Division championship game\n\n4 or 6:30 p.m., FloHoops (Nassau, Bahamas)\n\nIf Alabama survives Harvard on Monday, the Crimson Tide will have a game against either South Florida or Minnesota that could have significant bubble implications in March.\n\nDuke vs. South Carolina\n\n4:30 p.m., truTV, Players Era Championship (Las Vegas)\n\nAs we were saying, nothing on UCLA's schedule matches the quality of the Longhorns ... unless the Bruins end up meeting the Gamecocks in the Players Era final on Thursday. Duke, meanwhile, has gotten off to a slow start and needs some redemption after losses to Baylor and West Virginia. This is that opportunity.\n\nplay 1:17 Winthrop Eagles vs. South Carolina Gamecocks: Game Highlights Winthrop Eagles vs. South Carolina Gamecocks: Game Highlights\n\nMaryland vs. Kentucky\n\n6:30 p.m., FloHoops, Puerto Rico Shootout (Carolina, Puerto Rico)\n\nEasily the best game of the Puerto Rico Shootout, the Terps and Wildcats meet in the final game of Day 1. Both programs are having success on the fly after major personnel changes in the offseason. Kentucky will play Louisville right before heading south, and Maryland has already beaten Princeton, but this will be the biggest test for either team thus far.\n\nCal vs. Auburn\n\n7:30 p.m., FloHoops, Hoopfest Women's Basketball Classic (Frisco, Texas)\n\nThese are two teams on the periphery of the bubble -- and they'll only stay there with a pair of wins in Texas. Auburn plays UTSA and Cal meets Grand Canyon two days earlier.\n\nThursday, Nov. 27\n\nSouth Dakota State vs. North Carolina\n\n11 a.m., FloHoops, Cancun Challenge (Cancun, Mexico)\n\nAfter the Players Era Championship, this is the next-best event of Thanksgiving week. The Jackrabbits and Tar Heels lead off a great first day. South Dakota State's Brooklyn Meyer is off to a great start and ranks among the national leaders in scoring. North Carolina's success starts with defense. The winner of that matchup likely wins the game.\n\nNC State vs. Green Bay\n\n4 p.m. ET, FloHoops, Cancun Challenge (Cancun, Mexico)\n\nThe Wolfpack and Phoenix represent a contrast in styles. NC State wants to run. Green Bay likes to control the pace. This is a dangerous game for the Wolfpack, who can't afford any more nonconference losses if they want a top-four seed in the NCAA tournament.\n\nPlayers Era championship game\n\n8 p.m. ET, truTV (Las Vegas)\n\nNo matter how this shakes out and what the matchup is in this game, a clear No. 2 team in the country will emerge from this first-of-its-kind women's event.\n\nRichmond vs. TCU\n\n9 p.m., FloHoops, Cancun Challenge (Cancun, Mexico)\n\nComing off the most successful season in program history, and with All-American candidate Maggie Doogan back, the expectations are high for Richmond. Four games removed from a 29-point loss at Texas on Nov. 7, this represents a chance to check the Spiders' progress. The pieces have come together quickly for the Horned Frogs, who should be unbeaten heading into Big 12 play with a win over the Spiders.\n\nOregon State vs. Vanderbilt\n\n9 p.m., ESPN+, Paradise Jam (U.S. Virgin Islands)\n\nCoach Scott Rueck always seems to find a way at Oregon State -- and how he defends Vanderbilt's Mikayla Blakes will be another test. After the Beavers' win over Illinois, they are back in the NCAA tournament hunt.\n\nplay 0:18 Mikayla Blakes eases in long jumper for Vandy Mikayla Blakes eases in long jumper for Vandy\n\nPlayers Era consolation game\n\n10:30 p.m., truTV (Las Vegas)\n\nDespite the quality of the opponents at the Players Era Championship, two losses in Las Vegas would be devastating to No. 1 seed aspirations -- or possibly even No. 2 seed prospects given how many more challenges in and out of conference await the Blue Devils, Bruins, Gamecocks and Longhorns.\n\nFriday, Nov. 28\n\nIowa State vs. Marquette\n\n11 a.m., FloHoops, Coconut Hoops (Fort Myers, Florida)\n\nThe Cyclones won't have been challenged until this trip to Florida. Marquette was dominated by Minnesota two weeks ago and should approach this game with some desperation if the NCAA tournament is part of the Golden Eagles' future.\n\nplay 1:19 Marquette Golden Eagles vs. Milwaukee Panthers: Game Highlights Marquette Golden Eagles vs. Milwaukee Panthers: Game Highlights\n\nIndiana vs. Gonzaga\n\n1 :30 p.m., FloHoops, Coconut Hoops\n\nAllie Turner of Gonzaga and Indiana's Shay Ciezki are two of the best small guards in the country. Ciezki is off to a fast start and is one of the best 3-point shooters in the nation.\n\nKansas vs. Georgia\n\n7:30 p.m., ION, Fort Myers Classic (Fort Myers, Florida)\n\nNeither team was on the NCAA tournament radar until a combined 9-0 start to the season. This could be the game that proves whether postseason hopes are realistic.\n\nSaturday, Nov. 29\n\nOklahoma State vs. Miami\n\n11 a.m., FloHoops, Cayman Islands Classic (Grand Town, Cayman Islands)\n\nExpect plenty of points to be scored in this one. The Cowgirls hit the 100-point mark four times in their first five games.\n\nSouth Dakota State vs. Kansas State\n\n11 a.m., FloHoops, Cancun Challenge\n\nSpin the wheel again in Cancun and more good matchups emerge. The Wildcats have eight players averaging at or around seven points per game. That kind of balance will help against a SDSU defense that is consistently good, especially in the half court, under coach Aaron Johnston.\n\nParadise Jam, Island Division championship game\n\n1 p.m. or 3:30 p.m., ESPN+ (U.S. Virgin Islands)\n\nThe Vanderbilt-Oregon State winner will meet either BYU or Virginia Tech. Regardless of the matchup, this game will have meaning. If the Beavers come out of the Paradise Jam with two wins, they are not only the clear WCC favorite but also in a position to earn an at-large bid. The Hokies won't likely threaten for the top of the ACC, but their at-large chances increase significantly with a championship here.\n\nNorth Carolina vs. Columbia\n\n1:30 p.m., FloHoops, Cancun Challenge\n\nThe Lions' Riley Weiss scored 24 points in an NCAA tournament win over Washington last season. If you missed that, here is another chance to watch Weiss, who is having an even better junior season.\n\nGeorge Mason vs. Ole Miss\n\n3 p.m., BallerTV, Daytona Beach Classic (Daytona, Florida)\n\nIf the Atlantic 10 is going to get multiple bids to the NCAA tournament like it did a year ago, George Mason is the key. A game at Maryland right before this trip to Florida and this matchup with Ole Miss gives the Patriots their two biggest opportunities for a foundational résumé win.\n\nGeorgia Tech vs. Florida\n\n5 p.m. ET, FloHoops, Cayman Islands Classic (Grand Town, Cayman Islands)\n\nIn the four games with sophomore Liv McGill, the Gators have scored at least 87 points. In the game she missed with a leg injury, they scored 54. If she's on the floor, Florida is a must-watch.\n\nParadise Jam, Reef Division championship game\n\n8:30 p.m., ESPN+ (U.S. Virgin Islands)\n\nLSU and Washington State is the likely matchup here. The Tigers' nonconference schedule once again doesn't provide many challenges, and the Cougars are struggling this season. But this might be a chance to see MiLaysia Fulwiley in her new surroundings. She's leading LSU in scoring despite still coming off the bench.\n\nplay 1:19 LSU Tigers vs. Tulane Green Wave: Game Highlights LSU Tigers vs. Tulane Green Wave: Game Highlights\n\nSunday, Nov. 30\n\nCoconut Hoops, Blue Heron Division championship game\n\n11 a.m. or 1:30 p.m., FloHoops (Fort Myers, Florida)\n\nAn Indiana-Iowa State meeting seems most likely here, and the Hoosiers have some size to throw at Cyclones star Audi Crooks, who already has a 43-point game this season.\n\nCoconut Hoops, Great Egret Division championship game\n\n4 or 6:30 p.m., FloHoops (Fort Myers, Florida)\n\nWith their fast pace, ability to shoot and the addition of freshman Aaliyah Chavez, Oklahoma is fun to watch. The Sooners meeting Florida State here is the likely matchup in one of the final games of the weekend.\n\nBaha Mar Hoops Pink Flamingo, Junkanoo Division championship game\n\n6:30 p.m., FloHoops (Nassau, Bahamas)\n\nMichigan State and Clemson will be the big favorites to meet in this one. The Tigers' early losses were to South Carolina and Louisville, but they played well for long stretches in both. The Spartans opened the season by scoring at least 92 points in four straight games, sparked by Grace VanSlooten and the best assist totals in the country.\n\nRESULTS AND ANALYSIS\n\nTHURSDAY\n\nIowa 57, Baylor 52\n\nNo. 19 Iowa has three significant nonconference games on its schedule. This WBCA Showcase matchup was one of them. So getting this win, on a neutral court, could prove huge for the Hawkeyes, who can now enter the conversation of deserving to be in the top 16 seeds of the NCAA bracket. No. 7 Baylor, which suffered its first loss of the season, should still be one of the best teams in the Big 12 making, this a foundational win for a young Iowa team whose two top scorers in the game -- Ava Heiden and Taylor Stremlow -- are sophomores.",
  "summary": "From the Players Era in Las Vegas to Bahamas tournaments, the next 10 days are filled with big nonconference games.",
  "published": "Thu, 20 Nov 2025 23:43:15 EST",
  "url": "https://www.espn.com/womens-college-basketball/story/_/id/47011600/womens-college-basketball-2025-thanksgiving-tournament-feast-week-schedule-viewer-guide",
  "source": "www.espn.com - TOP"
}