{
  "title": "No let-up in offensive against Maoists: Day after Hidma encounter, 7 more killed in Andhra Pradesh",
  "text": "At least seven Maoists, including four men and three women, were killed in Andhra Pradesh on Wednesday morning as the operation that led to the deaths of Madvi Hidma, one of the most wanted Naxal leaders, and five others continued in Alluri Sitarama Raju district.\n\nAdditional Director General of Police (ADGP) Mahesh Chandra Laddha confirmed the development, saying that the Maoists were killed in an exchange of fire with the Greyhounds and the local police.\n\nOne of the deceased has been identified as bomb specialist Metturu Jogarao from Andhra Pradesh’s Srikakulam district. Also known as Babu and Tech Shankar for his ability to build improvised explosive devices, Jogarao was wanted by the National Investigation Agency (NIA).\n\nLaddha said that while Hidma, his wife Madakam Raje, State Zonal Committee Member Deve, Lakmal, Malla and Kamlu were killed during Tuesday morning’s exchange of fire, a few Maoists managed to escape. Sources said that those killed in Wednesday morning’s encounter could include those who fled earlier.\n\nAccording to Laddha, at least 50 Maoists have been arrested from Vijayawada city, and various places in Krishna, NTR and Kakinada districts. “All of them are from Chhattisgarh. They escaped the security forces and moved to various parts of Andhra Pradesh. We had intelligence inputs about their presence, but if we had acted on that information, Tuesday morning’s encounter in which Hidma was killed would probably not have happened. They would have been forewarned had we acted before,” he said.\n\n“Our intelligence officers were keeping a watch over them. We used drones to conduct surveillance, and within two hours after the Hidma encounter, we took them into custody. A few weapons have been seized from some of them. Before taking them into custody, we used bullhorns to warn them and asked them to surrender. None of them fired upon us, although we were prepared for an exchange of fire,” he added.\n\nLaddha said the Maoists wanted to regroup and move towards the Andhra Pradesh-Odisha border. “That is the information we have now. We are checking their identities…some of them could be senior area commanders,” Laddha said.\n\nStory continues below this ad\n\nBased on intelligence inputs, political leaders, including MLAs and MPs, especially those from the tribal areas, have been advised to take additional security precautions, Laddha added. “The DGP and other senior officers have arranged to beef up security of some political leaders who may be targeted in retaliation for the Hidma encounter,” he said.\n\nOf the 50 Maoists arrested so far, 27 are from Hidma’s battalion, while others are from various battalions of South Bastar, Laddha said. “We are again appealing to the Maoists to surrender peacefully and join the mainstream. There is no need to be afraid. If there is a bounty on their heads, we will give them that reward as well as provide all the assistance to them to help them join the mainstream,” he added.",
  "summary": "",
  "published": "Wed, 19 Nov 2025 04:56:39 +0000",
  "url": "https://indianexpress.com/article/india/day-madvi-hidma-encounter-maoists-killed-andhra-pradesh-10373753/",
  "source": "India | The Indian Express"
}