{
  "title": "Germany win thriller to set up semi against Spain",
  "text": "Germany completed a remarkable comeback to beat Argentina in a thrilling doubles decider and set up a Davis Cup semi-final against Spain.\n\nKevin Krawietz and Tim Puetz saved three match points in a final-set tie-break to overcome Horacio Zeballos and Andres Molteni 4-6 6-4 7-6 (12-10) in a gruelling contest lasting two hours and 31 minutes.\n\nArgentina had put the first point on the board when world number 60 Tomas Etcheverry hit 23 aces to beat Jan-Lennard Struff 7-6 (7-3) 7-6 (9-7) in a high-quality encounter.\n\nBut world number three Alexander Zverev launched Germany's recovery, beating world number 21 Francisco Cerundolo 6-4 7-6 (7-3) to force the deciding doubles.\n\nZverev, the only top 10 singles player competing in the Davis Cup this week, was not at his best but a brilliant tie-break performance kept Germany's hopes of progressing to a second straight semi-final alive.\n\nThose hopes were on their way to being extinguished when Zeballos and Molteni dominated the opening set of the doubles rubber.\n\nBut Krawietz and Puetz, who have three Grand Slam doubles titles between them, took the second set before a stalemate in the decider sent the match to a tie-break.\n\nThe Germans missed four match points, including three in a row, in an astonishing tie-break before clinching victory with the fifth.\n\n\"Incredible. There's not many matches you play in your career like that,\" said Puetz. \"It feels better to win in the end but what a great match and a great Davis Cup tie.\"\n\nNot since their title-winning 1993 campaign have three-time champions Germany reached the final of the tournament.\n\nEarlier on Thursday, Spain brushed aside the absence of Carlos Alcaraz to come from behind and beat the Czech Republic 2-1 and move one step closer to a first title in six years.\n\nSpain will meet Germany in Bologna on Saturday with two-time defending champions Italy taking on Belgium in the first semi-final on Friday.",
  "summary": "Germany complete a remarkable comeback to beat Argentina in a thrilling doubles decider and set up a Davis Cup semi-final against Spain.",
  "published": "Fri, 21 Nov 2025 00:26:19 GMT",
  "url": "https://www.bbc.com/sport/tennis/articles/cqjwjg7gq4lo?at_medium=RSS&at_campaign=rss",
  "source": "BBC Sport"
}