{
  "title": "Scientists uncover hidden atomic process that supercharges propylene production",
  "text": "Many familiar items, from plastic squeeze bottles to outdoor furniture, rely on a process that converts propane into propylene. In 2021, a study in Science showed that chemists could use tandem nanoscale catalysts to merge several steps of this conversion into a single reaction -- an approach that increases yield and reduces costs. However, the underlying atomic activity remained unclear, which made it difficult to adapt this strategy to other important industrial reactions.\n\nNew Algorithms Reveal Hidden Atomic Behavior\n\nResearchers at the University of Rochester created algorithms capable of identifying the atomic features that control the complicated chemistry occurring as nanoscale catalysts transform propane into propylene. Their study, published in the Journal of the American Chemical Society, explores these detailed interactions, which are made even more complex because the materials involved shift between multiple states.\n\n\"There are so many different possibilities of what's happening at the catalytic active sites, so we need an algorithmic approach to very easily yet logically screen through the large amount of possibilities that exist and focus on the most important ones,\" says Siddharth Deshpande, an assistant professor in the Department of Chemical and Sustainability Engineering. \"We refined our algorithms and used them to do a very detailed analysis of the metallic phase and oxide phase driving this very complex reaction.\"\n\nUnexpected Oxide Behavior and Catalyst Stability\n\nDeshpande and his chemical engineering PhD student Snehitha Srirangam uncovered several unexpected patterns during their investigation. They found that the oxide in the reaction tended to form around defective metal sites in a highly selective way, a feature that played an essential role in stabilizing the catalyst. Even though the oxide can appear in various chemical compositions, it consistently remained positioned around the defective metal sites.\n\nBroader Potential for Industrial Chemistry\n\nAccording to Deshpande, these findings and the algorithmic tools used to obtain them can help researchers probe the atomic structure of other reactions, including methanol synthesis used in products that range from paints to fuel cells. Over time, he believes this insight could guide companies toward more efficient methods of producing propylene and other industrial materials while reducing their dependence on trial-and-error approaches that have dominated the field for decades.\n\n\"Our approach is very general and can open the doors to understand many of these processes that have remained an enigma for decades,\" says Deshpande. \"We know these processes work, and we produce tons of these chemicals, but we have much to learn about why exactly they're working.\"",
  "summary": "Scientists have decoded the atomic-level secrets behind catalysts that turn propane into propylene. Their algorithms reveal unexpected oxide behavior that stabilizes the catalytic reaction by clustering around defective metal sites. The findings could help streamline industrial chemistry and inspire better catalysts for major processes like methanol synthesis.",
  "published": "Fri, 14 Nov 2025 07:24:04 EST",
  "url": "https://www.sciencedaily.com/releases/2025/11/251114041152.htm",
  "source": "All Top News -- ScienceDaily"
}