{
  "title": "Delhi Trade Fair 2025: Dates, Ticket Prices, Entry Timings, Theme, How To Book, and Other Details",
  "text": "Delhi Trade Fair 2025 Dates, Ticket Prices, Entry Timings and Theme: The 44th India International Trade Fair (IITF), one of India’s largest and most culturally engaging exhibitions, will take place at the Bharat Mandapam at Pragati Maidan, with the theme ‘Ek Bharat Shreshtha Bharat’ for 2025.\n\nJitin Prasada, Minister of State for Commerce and Industry, launched the exhibition on Monday, kicking off a 14-day event that will run until November 27th.\n\nDelhi Trade Fair 2025: Date and Timings\n\nThe first five days of IITF, i.e., November 14 to 18, are exclusively reserved for business days. It will open to the general public from November 19 to November 27, with the timings of the fair being 9.30 AM to 7.30 PM daily.\n\nDelhi Trade Fair 2025: Ticket Prices and How to Book\n\nAdult tickets cost ₹80 on weekdays and ₹150 on weekends, while children’s tickets cost ₹40 and ₹60 on weekends.\n\nSenior citizens and people with disabilities can enter the fair for free.\n\nVisitors can purchase tickets from the official website. Fair tickets can also be purchased at 55 Delhi Metro stations and through the ‘Saarthi’ app.\n\nStep 1: Go to ITPO’s official website, indiatradefair.com.\n\nStep 2: From the home page, click on the ‘Buy Tickets for IITF 2025’ link.\n\nStep 3: Enter your mobile number to register.\n\nStory continues below this ad\n\nStep 4: Enter the OTP sent to the same mobile number.\n\nStep 5: Before proceeding to the checkout and payment, select the ticket category and quantity.\n\n44th India International Trade Fair (Image Source: ANI) 44th India International Trade Fair (Image Source: ANI)\n\nDelhi Trade Fair 2025: Metro Route and Traffic Advisory\n\nThe Supreme Court metro station serves as the nearest stop to the venue.\n\nFurther, the Delhi Traffic Police have warned commuters of anticipated traffic congestion on roads near Pragati Maidan, including Mathura Road, Bhairon Marg, Ring Road, Shershah Road, and Purana Quila Road.\n\nStory continues below this ad\n\nNon-visiting commuters should avoid these routes or choose alternate routes to guarantee smooth transport.",
  "summary": "",
  "published": "Thu, 20 Nov 2025 08:14:31 +0000",
  "url": "https://indianexpress.com/article/india/delhi-trade-fair-2025-dates-ticket-prices-entry-timings-theme-how-to-book-and-other-details-10375825/",
  "source": "India | The Indian Express"
}