{
  "title": "Energy price cap fall expected as temperatures plunge",
  "text": "Energy price cap fall expected as temperatures plunge\n\n6 hours ago Share Save Kevin Peachey Cost of living correspondent Share Save\n\nGetty Images\n\nRegulator Ofgem will announce the next energy price cap later on Friday, with prices for millions of households expected to fall slightly at the height of winter. Gas and electricity bills remain relatively high, and the sudden drop in temperature has brought the costs to the forefront of people's minds. The next price cap will take effect at the start of January, and affect those on variable tariffs in England, Wales and Scotland. Ofgem will announce the details at 07:00 GMT. Analysts have predicted a 1% fall in prices.\n\nThe cap sets the maximum price that can be charged for each unit of gas and electricity, not the total bill - so those who use more energy, pay more. A 2% increase in October to the end of December means a household using a typical amount of energy is currently paying £1,755 a year.\n\nThe Ofgem cap is illustrated with a household using a \"typical\" amount of 11,500 kWh of gas and 2,700 kWh of electricity a year with a single bill for gas and electricity, settled by direct debit. However, the amount used varies significantly between households, so the best way to calculate the change is to work out the percentage change from your own usual annual bill. Analysts at the consultancy Cornwall Insight have predicted a 1% fall from the current cap to take effect in January, but for prices to then head back up in April. The forecaster, widely respected for the accuracy of its predictions, said the main driver of energy bills was shifting from sky-high wholesale prices to the cost of overhauling and maintaining the country's energy networks.",
  "summary": "Regulator Ofgem will announce its next price cap, affecting the bills of millions of people from January.",
  "published": "Fri, 21 Nov 2025 00:00:06 GMT",
  "url": "https://www.bbc.com/news/articles/c2lplg7d9ewo?at_medium=RSS&at_campaign=rss",
  "source": "BBC News"
}