{
  "title": "Lack of online age verification sparks concern",
  "text": "Lack of online age verification sparks concern\n\n17 hours ago Share Save Ammar Ebrahim Jersey political reporter Share Save\n\nBBC A review by politicians has found age verification restrictions introduced in the UK did not protect children in Jersey\n\nPoliticians have expressed concern for children's safety after a review found there was no age verification on adult sites in Jersey. The UK introduced age verification on porn sites in July to make it harder for under-18s to see explicit material. The review by the education scrutiny panel found assumptions UK regulations would indirectly protect children in Jersey were not wholly correct, meaning \"children in Jersey may now face fewer barriers to accessing inappropriate content than their UK counterparts\". Responding to the review, Economic Development Minister Kirsten Morel said legislation was being drafted that would allow people to have harmful content removed.\n\nDeputy Morel had told the children's scrutiny panel in May the government had not been looking at introducing age verification for adult sites in Jersey. \"The reality is that, if the UK brings in age verification for pornography or any sites, anyone in Jersey wanting to access them is probably going to have to engage with that UK age verification system of where we sit today,\" he said. \"That is the truth of it.\"\n\nIn a speech to the States Assembly about the review on 11 November, deputy Catherine Curtis said: \"On the day that age verification measures came into force in the UK, we checked whether they were also in place in Jersey and they were not. \"The evidence shows that due to children's curiosity they will access this sort of thing at a young age. \"Surveys show that one in 10 children will have accessed adult porn sites by the time they are nine years old.\" Responding, Morel said online safety was important and the review was \"incredibly helpful\". \"There is legislation in progress within the government and one of those pieces of legislation... will enable people of all ages to be able to have harmful content removed,\" he said.\n\nFollow BBC Jersey on X and Facebook. Send your story ideas to channel.islands@bbc.co.uk.",
  "summary": "A review finds an assumption UK age verification would apply in Jersey was not correct.",
  "published": "Thu, 20 Nov 2025 12:44:59 GMT",
  "url": "https://www.bbc.com/news/articles/ce9d900zd58o?at_medium=RSS&at_campaign=rss",
  "source": "BBC News"
}