{
  "title": "COP30 attendees in Brazil forced to evacuate pavilion following fire",
  "text": "Officials at the climate conference say the fire was contained within six minutes, and 13 attendees were treated for smoke inhalation.\n\nSao Paulo, Brazil – Attendees have been forced to evacuate the 2025 United Nations Climate Change Conference, known as COP30, after a fire broke out at the venue in Belem, Brazil.\n\nThere were no injuries in Thursday’s blaze, according to Brazil’s Tourism Minister Celso Sabino. In a news conference afterwards, he downplayed the seriousness of the fire.\n\n“There was a small fire here, which is possible at any large event,” he told journalists. “This small fire could happen anywhere on planet Earth.”\n\nOrganisers reported that the evacuation was “fast” and the fire was controlled within six minutes, leaving only minor damage.\n\nThirteen people were treated for smoke inhalation, according to a joint statement from the UN and COP30 leaders.\n\nThe affected area, known as the Blue Zone, is expected to remain closed until 8pm local time (23:00 GMT).\n\nThe cause of the fire remains unclear. But Helder Barbalho — the governor of the state of Para, where the summit is taking place — told the Brazilian channel GloboNews that authorities believe a generator failure or short circuit might have sparked the incident.\n\nOn social media, Barbalho assured the public that other parts of the COP30 conference zone continued to be in operation.\n\n“We will find out what caused it, whether we can restart work here in the Blue Zone today or not,” he wrote. “The Green Zone is operating normally.”\n\nReports emerged about 2pm local time (17:00 GMT) of flames in the Blue Zone pavilion, a restricted area for negotiators and accredited media.\n\nAdvertisement\n\nVideos on social media showed scenes of panic and security officials ordering attendees to exit the venue.\n\ncaralho, fogo na zona azul aqui da COP 30. uma loucura de gente correndo. meu deus! pic.twitter.com/ebXubnHwiR — ralfer (@ralferr) November 20, 2025\n\nAl Jazeera spoke to Fernando Ralfer Oliveira, an independent journalist who was in the Blue Zone when the fire broke out and shared footage of the flames.\n\n“I was in the big corridor that leads to the meeting rooms when a commotion of people started running. I had my phone in my hand and immediately started recording,” said Ralfer.\n\n“When I got close to the pavilion, someone ran past me shouting, ‘Fire, fire, fire!’ So I ran a little and managed to record that bit of the fire. But at that moment, security was already coming towards us in force, saying ‘Evacuate, evacuate, evacuate.’”\n\nRalfer and other evacuees were then directed to the COP30’s food court area, located outside the pavilion.\n\nRoughly an hour after the fire broke out, the UN Framework Convention on Climate Change (UNFCCC), which organises the conference, sent an email to attendees saying that the local fire service would conduct “full safety checks” at the venue.\n\nThey then announced the Blue Zone’s continued closure: “Please note that the premises are now under the authority of the Host Country and are no longer considered a Blue Zone.”\n\nThe Blue Zone fire happened a week after Brazil responded to the UN’s concerns around safety at COP30.\n\nOn November 13, Simon Stiell, the executive secretary with the UNFCCC, sent a letter to Brazilian President Luiz Inacio Lula da Silva and his government, raising issues ranging from faulty doors to water leaks near light fixtures.\n\nThat same day, the Brazilian government published a statement saying that “all UN requests have been met”, including the repositioning and expansion of police forces between the Blue and Green Zones.",
  "summary": "Officials say the fire was contained within six minutes, and 13 attendees were treated for smoke inhalation.",
  "published": "Thu, 20 Nov 2025 21:46:38 +0000",
  "url": "https://www.aljazeera.com/news/2025/11/20/cop30-attendees-in-brazil-forced-to-evacuate-pavilion-following-fire?traffic_source=rss",
  "source": "Al Jazeera – Breaking News, World News and Video from Al Jazeera"
}