{
  "title": "Nelly Cheboi, who creates computer labs for Kenyan schoolchildren, is CNN's Hero of the Year",
  "text": "CNN —\n\nNelly Cheboi, who in 2019 quit a lucrative software engineering job in Chicago to create computer labs for Kenyan schoolchildren, is the 2022 CNN Hero of the Year.\n\nOnline voters selected her from among this year’s Top 10 CNN Heroes.\n\nCheboi’s nonprofit, TechLit Africa, has provided thousands of students across rural Kenya with access to donated, upcycled computers — and the chance at a brighter future.\n\nCheboi accepted the award with her mother, who she said “worked really hard to educate us.” At the beginning of her acceptance speech, Cheboi and her mother sang a song onstage that she explained had a special meaning when she was growing up.\n\nAs CNN Hero of the Year, Cheboi will receive $100,000 to expand her work. She and the other top 10 CNN Heroes honored at Sunday’s gala all receive a $10,000 cash award and, for the first time, additional grants, organizational training and support from The Elevate Prize Foundation through a new collaboration with CNN Heroes. Nelly will also be named an Elevate Prize winner, which comes with a $300,000 grant and additional support worth $200,000 for her nonprofit.\n\n“The world is your oyster when you are educated”\n\nCheboi grew up in poverty in Mogotio, a rural township in Kenya. “I know the pain of poverty,” said Cheboi, 29. “I never forgot what it was like with my stomach churning because of hunger at night.”\n\nA hard-working student, Cheboi received a full scholarship to Augustana College in Illinois in 2012. She began her studies there with almost no experience with computers, handwriting papers and struggling to transcribe them onto a laptop.\n\nEverything changed in her junior year, though, when Cheboi took a programming course required for her mathematics major.\n\n“When I discovered computer science, I just fell in love with it. I knew that this is something that I wanted to do as my career, and also bring it to my community,” she told CNN.\n\nMany basic computer skills were still a steep learning curve, however. Cheboi remembers having to practice touch-typing for six months before she could pass a coding interview. Touch-typing is a skill that is now a core part of the TechLit curriculum.\n\n“I feel so accomplished seeing kids that are 7 years old touch-typing, knowing that I just learned how to touch-type less than five years ago,” she said.\n\nOnce she had begun working in the software industry, Cheboi soon realized the extent of which computers were being thrown away as companies upgraded their technology infrastructure.\n\n“We have kids here (in Kenya) — myself included, back in the day — who don’t even know what a computer is,” she said.\n\nSo, in 2018, she began transporting donated computers back to Kenya — in her personal luggage, handling customs fees and taxes herself.\n\n“At one point, I was bringing 44 computers, and I paid more for the luggage than I did for the air ticket,” she said.\n\nA year later, she co-founded TechLit Africa with a fellow software engineer after both quit their jobs. The nonprofit accepts computer donations from companies, universities and individuals.\n\nThe hardware is wiped and refurbished before it’s shipped to Kenya. There, it’s distributed to partner schools in rural communities, where students ages 4 to 12 receive daily classes and frequent opportunities to learn from professionals, gaining skills that will help improve their education and better prepare them for future jobs.\n\n“We have people who own a specific skill coming in and are just inspiring the kids (with) music production, video production, coding, personal branding,” Cheboi said. “They can go from doing a remote class with NASA on education to music production.”\n\nThe organization currently serves 10 schools; within the next year, Cheboi hopes to be partnered with 100 more.\n\n“My hope is that when the first TechLit kids graduate high school, they’re able to get a job online because they will know how to code, they will know how to do graphic design, they will know how to do marketing,” Cheboi said. “The world is your oyster when you are educated. By bringing the resources, by bringing these skills, we are opening up the world to them.”\n\nVideo Ad Feedback Watch the moment CNN's Hero of the Year is announced 01:30 • Source: CNN Watch the moment CNN's Hero of the Year is announced 01:30\n\nAn inspiring night of heroism and advocacy\n\nCNN’s Anderson Cooper and ABC’s Kelly Ripa co-hosted the 16th Annual “CNN Heroes: An All-Star Tribute,” which featured more than a dozen celebrity presenters.\n\n“We’re so deeply honored to be here,” said actress and singer Sofia Carson, who perfomed a song with award-winning songwriter Diane Warren at the event. “Diane wrote this incredible anthem ‘Applause’ for those leading, surviving and fighting and tonight we dedicate this song and performance to our heroes.”\n\nActor Aubrey Plaza introduced CNN Hero Aidan Reilly, who launched his nonprofit while home from college during the early months of the Covid-19 pandemic.\n\n“From his pandemic couch, Aidan and his friends co-founded Farmlink Project,” Plaza said. The nonprofit connects excess food from farms across the US – food that would otherwise be wasted – to those who need it. “In just two years, he .. has moved more than 70 million pounds,” Plaza added.\n\nDebra Vines – whose nonprofit The Answer Inc. supports families impacted by autism in underserved communities across Chicago – was honored by actress Holly Robinson Peete, a “fellow autism mom.”\n\nVines says her group has provided programming and guidance to more than 4,000 families. “Join me and be a servant for the change today,” Vines said when accepting her award.\n\nAnd Emmy award-winning actor Justin Theroux brought his rescue dog Kuma, on the stage to honor Carie Broecker ​​and her nonprofit, Peace of Mind Dog Rescue.\n\nTwo teenagers making a difference in their communities were also honored as 2022 Young Wonders:\n\nRuby Chitsey, a 15-year-old from Harrison, Arkansas, started “Three Wishes for Ruby’s Residents,” which donates personal items to nursing home residents who couldn’t otherwise afford them.\n\nSri Nihal Tammana, a 13-year-old from Edison, New Jersey, started “Recycle My Battery,” which keeps used batteries out of the ecosystem through a network of collection bins.\n\nThe show also honored two Georgia poll workers, Shaye Moss and her mother Ruby Freeman, whose lives were upended after false allegations that they had been involved in election fraud spread on social media.\n\nContribute\n\nCNN has partnered with GoFundMe to enable donations to this year’s Top 10 honorees. GoFundMe is the world’s largest fundraising platform that empowers people and charities to give and receive help. Supporters can make online donations to the Top 10 CNN Heroes’ non-profit organizations directly from CNNHeroes.com. Subaru is matching all donations up to $50,000 for each of this year’s honorees through January 3, 2023.\n\nNominate someone for next year\n\nDo you know someone in your community doing amazing things to make the world a better place? Keep an eye on CNN.com/heroes and consider nominating that person as a CNN Hero in 2023. You can also read more about many of the 350 past CNN Heroes who have helped over 55 million people across all 50 US states and in more than 110 countries around the world.",
  "summary": "Celebrities and musicians are coming together tonight to honor everyday people making the world a better place.",
  "published": "Mon, 12 Dec 2022 10:38:27 GMT",
  "url": "https://www.cnn.com/2022/12/11/us/cnn-heroes-all-star-tribute-hero-of-the-year/index.html",
  "source": "CNN.com - RSS Channel - World"
}