{
  "title": "Nazi bombs, torpedo heads and mines: how marine life thrives on dumped weapons",
  "text": "In the brackish waters off the German coast lies a wasteland of Nazi bombs, torpedo heads and mines. Thrown off barges at the end of the second world war and forgotten about, thousands of munitions have become matted together over the years. They form a rusting carpet on the shallow, muddy seafloor of the Bay of Lübeck in the western tip of the Baltic Sea.\n\nOver the decades, the Nazi arsenal was ignored and forgotten about. A growing number of tourists flocked to the sandy beaches and calm waters for jetskiing, kite surfing and amusement parks. Beneath the surface, the weapons decayed.\n\nA shore crab in a video taken by a submersible. Photograph: DeepSea Monitoring/Geomar\n\nWhen the first scientists went looking to see what they were doing to the ecosystem, “some of us expected to see a desert, with nothing living there because it was all poisoned”, says Andrey Vedenin, from the Senckenberg Research Institute in Frankfurt am Main, who led a team of scientists to catalogue for the first time what life is able to survive on underwater weaponry.\n\nWhat they found astonished them. Vedenin remembers his colleagues shouting with surprise when the submersible first sent the images back. “It was a great moment,” he says.\n\nThousands of sea creatures had made their homes amid the munitions, creating a regenerated ecosystem more populous than the sea floor around it.\n\nThis underwater metropolis was testament to the tenacity of life. “It is actually astonishing how much life we find in places that are supposed to be toxic and dangerous,” he says.\n\nMore than 40 starfish had piled on to one exposed chunk of TNT. They were living on metal shells, fuse pockets and transport cases just centimetres from its explosive filling. Fish, crabs, sea anemones and mussels were all found on the old munitions. “You could compare it with a coral reef in terms of the amount of fauna that was there,” says Vedenin.\n\nVideo footage of crabs, starfish and sea anemones on munitions on the sea floor The munitions host a regenerated ecosystem of fish, crabs, sea anemones and mussels. ‘A lot of species that are otherwise rare or declining, such as the Baltic cod, are thriving,’ says Andrey Vedenin\n\nAn average of more than 40,000 animals were living on every square metre of the munitions, scientists wrote in their paper on the discovery, published in the journal Communications Earth & Environment in September. The surrounding area was much less diverse, with only 8,000 individuals on every square metre.\n\nIt is ironic that “things that are meant to kill everything are attracting so much life,” says Vedenin. “You can see how nature adapts after a catastrophic event such as the second world war and how, in some way, life finds its way back to the most dangerous places.”\n\nWhat the researchers found in the Bay of Lübeck reveals a surprising truth about how underwater life can repurpose human debris.\n\nTypically “urban sprawl” is considered bad for nature, but underwater, the script can be flipped. This is because every day, an average of 1m dumper trucks of rock, gravel, clay and silt are removed from the marine environment. These hard surfaces provide homes for corals, sponges, barnacles and mussels, as well as nursing grounds for fish.\n\nBefore the war, this area of the Baltic Sea was full of boulders and rocky outcrops, but virtually all of them were removed for construction, to build homes and roads.\n\nThings that are meant to kill everything are attracting so much life … You can see how nature adapts Andrey Vedenin\n\nArtificial structures such as shipwrecks, offshore windfarms, oil rigs and pipelines can provide substitutes, replacing some of the lost habitat. This study shows that munitions could be similarly beneficial – the bloom of life on those in the Bay of Lübeck is likely to be repeated elsewhere.\n\nBetween 1946 and 1948, 1.6m tonnes of arms were dumped off the German coast. Thousands of people loaded them in barges; some were dropped in designated sites, others just thrown overboard en route. This is the first time researchers have documented how marine life has responded.\n\nView image in fullscreen The seabed of the North and Baltic Seas off Germany are littered with munitions from the first and second world wars, such as shells once fired from German warships. Photograph: SeaTerra\n\nBut the phenomenon is not restricted to weapons. In the US, decommissioned oil and gas structures have turned into coral reefs; the Rigs-to-Reefs programme encourages authorities to leave the clean and stable structures underwater for the environmental benefits. Sunken ships from the first world war have become habitats for wildlife along the Potomac River in Maryland.\n\nThese places become even more important for wildlife as the oceans are increasingly denuded by fishing, bottom trawling and anchoring. Sunken ships and weapons dump sites “essentially act as protected areas – they are not national parks, but almost any kind of human activity is prohibited”, says Vedenin. “Therefore a lot of species that are otherwise rare or declining, such as the Baltic cod, are thriving.”\n\nAnywhere where military conflict has occurred in the past 100 years, surrounding seas are usually strewn with munitions, says Vedenin. Millions of tonnes of explosive material lie in our oceans.\n\nThe locations of these munitions are poorly documented, partly because of national borders, classified military information and the fact that records are buried in historic archives. They pose an explosion and security risk, as well as risk from the ongoing release of toxic chemicals.\n\nIn the 1990s, academics started warning about the “danger from the deep”, and the need to remove potentially explosive material. Pressure to remove the weaponry also came from a growing demand to use the seabed for something else, such as dredging or offshore infrastructure such as windfarms, cables, and oil and gas pipelines.\n\nA black goby (Gobius niger), which feeds on the small crustaceans, fish, molluscs and worms living on the munitions in the Baltic Sea. Photograph: DeepSea Monitoring/ Geomar\n\nAs Germany and other countries embark on removing these relics, scientists hope to protect the ecosystems that have formed around them. In the Bay of Lübeck munitions are already being removed.\n\n“We should replace these metal carcasses left from munitions with some safer, some non-dangerous objects, like maybe concrete structures,” says Vedenin.\n\nHe now hopes that what happens in Lübeck sets a precedent for replacing material after munitions removal elsewhere – because even the most destructive weaponry can become scaffolding for new life.\n\nView image in fullscreen Tank tracks that have become home to coral off Asan beach, Guam, came from US equipment lost during the invasion of the Pacific island in 1944. Photograph: National Park Service via Guam\n\nFind more age of extinction coverage here, and follow the biodiversity reporters Phoebe Weston and Patrick Greenfield in the Guardian app for more nature coverage",
  "summary": "<p>Scientists discover thousands of sea creatures have made their homes amid the detritus of abandoned second world war munitions off the coast of Germany</p><p>In the brackish waters off the German coast lies a wasteland of Nazi bombs, torpedo heads and mines. Thrown off barges at the end of the second world war and forgotten about, thousands of munitions have become matted together over the years. They form a rusting carpet on the shallow, muddy seafloor of the Bay of Lübeck in the western tip of the Baltic Sea.</p><p>Over the decades, the Nazi arsenal was ignored and forgotten about. A growing number of tourists flocked to the sandy beaches and calm waters for jetskiing, kite surfing and amusement parks. Beneath the surface, the weapons decayed.</p> <a href=\"https://www.theguardian.com/environment/2025/nov/20/oceans-germany-baltic-sealife-reefs-toxic-second-world-war-munitions-aoe\">Continue reading...</a>",
  "published": "Thu, 20 Nov 2025 05:00:16 GMT",
  "url": "https://www.theguardian.com/environment/2025/nov/20/oceans-germany-baltic-sealife-reefs-toxic-second-world-war-munitions-aoe",
  "source": "The Guardian"
}