{
  "title": "PM Modi urges 10-year national pledge to shed colonial mindset rooted in Macaulay’s legacy",
  "text": "Whether under the British Raj or during the Emergency, Ramnath Goenka, founder of the Express Group, embodied the people’s resistance to attempts at “enslavement” and affirmed the power of dissent. It was this spirit, Prime Minister Narendra Modi said Monday, that should guide a national pledge to “put the locks on” the Western mindset embedded in India since 1835 through Thomas Macaulay’s project of reshaping Indian thought by dismantling indigenous knowledge systems and enforcing colonial education.\n\nDelivering the Sixth Ramnath Goenka Lecture, the Prime Minister set a 10-year timeframe — leading up to the 200th year of Macaulay’s campaign — to reverse that legacy.\n\nAdvertisement\n\nMacaulay’s aim, Modi said, was to create Indians who “are Indians by appearance but British at heart.” India “paid a heavy price” for this, he argued, as the belief that the Western or foreign was superior took deep root. Macaulay, the PM said, broke India’s “self-confidence and instilled a sense of inferiority. In one stroke, he discarded thousands of years of India’s knowledge, science, art, culture, and entire way of life.”\n\n(Express Photo by Praveen Khanna) (Express Photo by Praveen Khanna)\n\nThat imprint persisted after Independence, Modi continued, as India’s “education, economy, and societal aspirations became increasingly aligned with foreign models.” When a nation does not honour itself, he said, “it ends up rejecting its indigenous ecosystem.”\n\nAs an illustration, he pointed to tourism: countries that have built flourishing tourism industries do so by taking pride in their heritage, he said, whereas post-Independence India often sought to distance itself from its own legacy. “Without pride in heritage, there is no motivation for its preservation, and without preservation, such heritage is reduced to mere ruins of brick and stone,” he said.\n\nAdvertisement\n\nModi noted that nations such as Japan and South Korea did adopt Western ideas but remained rooted in their own languages. This was a balance India’s new education policy also seeks to encourage, he said, stressing that he was not opposed to English but supportive of Indian languages.\n\nTurning to politics, he recalled the NDA’s recent victory in Bihar and advised state governments that their politics today will shape their parties’ future, whether of the “left, right or centre.” He said Lalu Prasad had 15 years in power and could have driven development, but instead “brought in ‘jungle raj’.”\n\n(Express Photo by Praveen Khanna) (Express Photo by Praveen Khanna)\n\nThe PM also addressed commentary that he and the BJP remain perennially in campaign mode. “Not election mode — one must remain in emotion mode 24 by 7,” he said, explaining that public service requires continuous commitment to the poor.\n\nHe criticised parties that “in the last few decades… worked for their own interest in the name of social justice,” arguing that true social justice lies in expanding welfare. Today, he said, “about 94 crore people in India… are covered by the social security net. A decade ago, this number stood at just 25 crore… This is a remarkable expansion of social welfare coverage and a true example of social justice in action.”\n\nModi said the footprint of Maoism was shrinking, accusing the Congress of having earlier encouraged its spread into urban spaces. “Congress promoted Naxalism even in urban areas,” he said, adding that “urban Naxals have now transformed the party into the ‘Muslim League-y Maoist Congress’.”\n\nReturning to the legacy of Ramnath Goenka, the PM described Goenka’s famed impatience as a virtue “not in a negative sense, but in a positive one,” the kind that “stirs still waters into motion.” Today’s India, he said, shares that drive: “impatient to become developed, impatient to become self-reliant.”\n\n(Express Photo by Praveen Khanna) (Express Photo by Praveen Khanna)\n\n“At a time when the world is fearful of disruption, India is confidently moving in the direction of a bright future,” he said, adding that “India is not just an emerging market, but also an emerging model.” Despite global turbulence since Covid, he noted, India continues to sustain growth at around 7 per cent.\n\nModi recalled that Goenka supported the Congress during the freedom struggle — even suspending publication rather than bowing to British diktats during Quit India — and later backed the JP movement and the Janata Party during the Emergency period. “He gave a new height to journalism and democracy. He established the Express Group not as just a newspaper but as a mission,” the PM said, noting that The Indian Express once published a blank editorial as a defiant act against censorship.\n\nGoenka, Modi said, drew inspiration from a Gita shloka urging duty without regard to loss or gain. His support for Sardar Patel during the Hyderabad liberation and for Nanaji Deshmukh and Jayaprakash Narayan during the JP movement, the PM said, reflected that spirit. The Prime Minister also acknowledged the Express Group as a witness to India’s transformations, commending its “dedicated efforts in preserving the ideals of Ramnath Goenka.”\n\nEarlier, Chairman and Managing Director, Express Group, Viveck Goenka said: “Today, as the world’s power equations are being rewritten, India under your leadership stands out – ancient, yet modern, confident in its heritage, yet fearless in its embrace of the future… Your call for Atmanirbhar Bharat resonates deeply with Ramnath Goenka’s conviction that the Indian mind must never outsource its courage or its thinking.”\n\n“That you have chosen to speak in his name,” Goenka said, “is a powerful message from you of engagement, a reaffirmation that the dialogue between the state and the free press remains the heartbeat of a confident nation.”\n\nSpeaking after the PM in his vote of thanks, Executive Director Anant Goenka said Ramnath Goenka’s journalism was patriotic and honest, grounded in the belief that journalism must be balanced and open to all perspectives, the very approach that prevents polarisation. While some in the industry might find balance “bland and boring,” he noted that the Express Group’s position as one of the world’s leading digital news platforms affirms the value of that tradition.\n\nAmong those who attended the event were Delhi Lieutenant Governor V K Saxena; Delhi Minister Parvesh Verma; Supreme Court judge Justice Manmohan; BJP Lok Sabha MP Anil Baluni; BJP leaders Ravi Shankar Prasad and Vinay Sahasrabuddhe; Congress leaders Adhir Ranjan Chaudhary and Shashi Tharoor; former Congress leader Ghulam Nabi Azad; Law Secretary Dr Anju Rathi Rana; former Law Minister Ashwani Kumar; Rajiv Shukla; former MP and writer Rakesh Sinha; and Attorney General R Venkataramani; former Delhi Police Commissioner Sanjay Arora; Secretary to Vice President Amit Khare; former Election Commissioner Ashok Lavasa; Australian High Commissioner Philip Green; Delhi University Vice Chancellor Yogesh Singh; Nepal Ambassador Dr Shankar Sharma; DG (Press Information Bureau) Dhirendra Ojha; Awanish Awasthi, advisor to UP Chief Minister; Niti Aayog Vice Chairman Suman Bery; Vice Chancellor of National Law University G S Bajpai; Centre for Policy Research president Srinivas Chokkakula; economist Surjit Bhalla; writers Kishwar Ahluwalia and Nalini Singh.\n\nThe Ramnath Goenka Lecture series began with Marianne Pearl, wife of Wall Street Journal reporter Daniel Pearl, who was killed by terrorists in Pakistan. Speakers since have included RBI Governor Raghuram Rajan on India’s global economic role; President Pranab Mukherjee on the importance of a free press; Chief Justice Ranjan Gogoi urging a judiciary on the “front foot”; External Affairs Minister S Jaishankar challenging old diplomatic dogmas; and philanthropist Bill Gates on technology’s role in reshaping society.",
  "summary": "",
  "published": "Mon, 17 Nov 2025 19:10:50 +0000",
  "url": "https://indianexpress.com/article/india/india-not-just-an-emerging-market-but-also-an-emerging-model-pm-modi-at-ramnath-goenka-lecture-10371417/",
  "source": "India | The Indian Express"
}