{
  "title": "After Israel PM’s trip to occupied Syria, is a deal off the table?",
  "text": "Israeli PM Netanyahu visited Israeli forces in southern Syria, just as a deal between the neighbours seems further away.\n\nIsraeli Prime Minister Benjamin Netanyahu’s appearance with Israel’s troops in illegally occupied territory in southern Syria has angered Damascus, and raised further doubts over whether a security deal between the two countries can be agreed.\n\nNetanyahu’s Wednesday visit – accompanied by several of his senior officials – signals that he is not planning to shift from his hardline position on Syria, despite encouragement from the United States.\n\nIsrael seized territory in the Syrian Golan Heights following the 1967 war and has held it ever since. However, following the fall of ousted Syrian President Bashar al-Assad in December 2024, Israel violated a 1974 agreement and again invaded its neighbour’s territory, occupying more land along the border as part of a “buffer zone”, including the strategically vital summit of Mount Hermon.\n\nIsrael was already bombing Syria before the fall of al-Assad, an ally of its regional enemy Iran. But instead of seeking to start on a new path with Syria, Israel has doubled down on its bombing campaign and increased the number of strikes this year, including in the capital Damascus, leading to the deaths of several Syrian soldiers and hitting the Ministry of Defence.\n\nAfter the visit earlier this month of Syria’s new President Ahmed al-Sharaa to Israel’s key ally in the White House, US President Donald Trump, hopes were high that an agreement could be reached. Al-Sharaa has previously confirmed that direct talks with Israel were under way to secure a permanent settlement.\n\nAdvertisement\n\nBut earlier this week, Israel’s Kan broadcaster quoted an unnamed Israeli government official as saying the talks were at a dead end. So what went wrong and why? And does Netanyahu’s trip to the occupied Syrian territory signal that he has no intention to make a deal?\n\nWhat is Israel doing in Syria?\n\nWhen Israel’s tanks first entered Syria in December 2024, it expanded its territorial footprint within Syria by around 400 square kilometres (155 sq miles), including Mount Hermon, which offers a vantage point over southern Syria and northern Israel.\n\nNetanyahu described the incursion as a “temporary defensive position”. However, as time has worn on, both Israel’s position on the Golan Heights and its rhetoric have grown more entrenched, with Defence Minister Israel Katz saying in March that Israel would continue its occupation of parts of Syria for an “unlimited amount of time”.\n\nIsrael has also chosen to position itself as the defender of the Druze and Kurdish ethnic minorities against a government it has attempted to paint as “extremist”.\n\nWhy did talks break down?\n\nNeither government has issued a statement on why the talks have stalled.\n\nHowever, citing anonymous government sources, Israel’s public broadcaster, Kan, has claimed that talks broke down after Israel refused to withdraw its troops from Syrian territory without what it called a “comprehensive peace agreement”.\n\nDetails of what Israel might mean by a “comprehensive peace agreement” aren’t clear.\n\nIn September, leaked reports suggested that, as part of any peace agreement, Israel was demanding that Syria establish a demilitarised zone southwest of Damascus all the way up to the border with Israel. This would encompass a vast territory, including the governorates of Suwayda, Deraa, and Quneitra.\n\nIn return, Israel would gradually withdraw its forces from Syrian territory, apart from those on the summit of Mount Hermon.\n\nBut since then, it appears that Israel has hardened its stance, and reports in Israeli media indicate that the government’s position is that it will not withdraw from territory seized since December without a full peace deal with Syria – which is not on the table.\n\nThe news agency Reuters also reported that, at the last minute, Israel requested what negotiators termed a “humanitarian corridor”, allowing access between Israel and the heavily Druze populated southern governorate of Syria’s Suwayda.\n\nAccording to one source, a central principle of the Israeli proposal was maintaining an aerial corridor to Iran via Syria, which would allow for future Israeli strikes on Iran.\n\nSo, why did Netanyahu and others visit the buffer zone?\n\nNetanyahu told Israeli troops that their presence within Syrian territory was of “immense importance”, adding that their purpose there was vital in “safeguarding our Druze allies”, he said.\n\nAdvertisement\n\nSyria’s Druze minority provided a pretext for Israel’s last deployment to Syria in July, when Israel was accused of using the conflict between the group and local Bedouins to empower minority factions within the country as rival power centres to the recognised government in Damascus.\n\nExpanding buffer zones with neighbouring states ahead of opening diplomatic channels or contributing towards reconstruction following the often devastating attacks by its military forces appears to have become a central tenet of Israel’s regional strategy.\n\nIn Gaza, where Israel has killed almost 70,000 Palestinians, Israel is seeking to establish an extensive buffer zone as part of the US-imposed stabilisation deal that would reduce the already drastically limited space available to the enclave’s post-war population even further.\n\nIn Lebanon, where it killed more than 4,000 people during its invasion of October 2024, Israel has been accused of laying the groundwork to create a buffer zone within Lebanese territory, similar to that it is trying to establish in Gaza.\n\nWhat did Syria and others say about the visit?\n\nThe Syrian Foreign Ministry branded the visit “illegitimate” and “a grave violation of Syria’s sovereignty and territorial integrity”.\n\n“This visit represents a new attempt to impose a fait accompli that contradicts relevant United Nations Security Council resolutions and falls within the occupation’s policies aimed at entrenching its aggression and continuing its violations of Syrian territory,” a ministry statement read.\n\nOther nations, including Jordan, France and Qatar, have also condemned the Israeli prime minister’s visit, branding it a threat to regional stability.\n\nIn the UN, spokesperson Stephane Dujarric was also critical of what he called Netanyahu’s “very public visit”, adding that it was “concerning, to say the least”.\n\nDujarric noted that UN Resolution 2799, recently passed by the UN Security Council, “called for the full sovereignty, unity, independence, and territorial integrity of Syria”.\n\nHow might this affect negotiations?\n\nIt looks to have set them back and, to a degree, left Israel isolated.\n\nOn Wednesday, a senior UN official urged Israel to halt its activity in the occupied Golan Heights, cautioning that its actions were stoking regional tensions.\n\nNajat Rochdi, the UN deputy special envoy for Syria, told the UN Security Council that Israel’s operations were weakening the 1974 agreement establishing the buffer zone.\n\n“I received a strong appeal from [Syria’s] Foreign Minister [Asaad] al-Shaibani for the UN to act to put an end to these violations,” she said, urging the UN Security Council to assume its responsibilities under the 1974 agreement.\n\nIsrael’s principal ally, the US, along with many of the region’s powers, appears to have rejected Israeli characterisation of Syrian extremism.\n\nReceiving al-Sharaa at the White House earlier this month, US President Trump praised the Syrian leader, saying, “We’ll do everything we can to make Syria successful, because that’s part of the Middle East. We have peace now in the Middle East – the first time that anyone can remember that ever happening.”\n\nAdvertisement\n\nSaudi Arabia, Qatar and other Gulf countries have also been providing economic support to Syria since al-Assad’s ousting, with Saudi Arabia, a key focus of Israel and the US’s normalisation efforts, announcing a reconstruction programme as recently as September.\n\nWhat might Israel’s ultimate goals in Syria be?\n\nIsrael appears to be following its standard playbook when dealing with its neighbours – use force, ask questions later, and refuse to compromise.\n\nIt knows it is the strongest military power in the region, but also believes it faces existential threats, and therefore largely does not want to make agreements that it believes will benefit rivals. In essence, Israel prefers to conduct business through force of arms rather than deal-making.\n\nAs well as maintaining its illegal occupation of Syrian territory, Israel has continued to occupy Lebanese territory and launch attacks against its neighbour despite entering into a ceasefire in November 2024.\n\nSpeaking to Al Jazeera earlier this year, writer, researcher, and founder of The Fire These Times podcast, Elia Ayoub, said that “The Israelis believe that having weaker neighbours, as in states that aren’t really able to function, is beneficial for them because, in that context, they’re the strongest actor.”\n\nWhether that means dividing Syria, or simply retaining a large buffer zone, is unclear – and will perhaps be determined by how things pan out.",
  "summary": "Israeli PM Netanyahu visited Israeli forces in southern Syria, just as a deal between the neighbours seems further away.",
  "published": "Thu, 20 Nov 2025 17:59:52 +0000",
  "url": "https://www.aljazeera.com/news/2025/11/20/after-israel-pms-trip-to-occupied-syria-is-a-deal-off-the-table?traffic_source=rss",
  "source": "Al Jazeera – Breaking News, World News and Video from Al Jazeera"
}