{
  "title": "Welcome to the Ashes, the classic cricket rivalry that never really starts or stops",
  "text": "If it feels like the buildup to this Ashes series has lasted 842 days that is because it pretty much has. Test cricket’s oldest rivalry resumes on Friday inside Perth’s 60,000-seat thunderdome and with it, mercifully, comes fresh fuel for the ever-raging fire.\n\nBecause on one level the Ashes never really starts or stops. Since Stuart Broad nicked off Alex Carey at the Oval on 31 July 2023 – the final act of a dramatic 2-2 draw – the sides have been tracking each other, all while their supporters chip away from afar.\n\nTo the rest of the world this obsession must get a bit tiresome. In recent years, India having won in Australia in 2018-19 and 2022-23, and lost a classic here 12 months ago, there has even been talk that the Border-Gavaskar Trophy may have surpassed the Ashes as a rivalry. It is a terrific thing those two nations have got going on, no doubt.\n\nBut so storied is the Ashes – so intense the relationship – that this still feels a stretch. Sometimes that BGT chat feels like a stick used to beat England, given they have not won a Test match on these shores since Andrew Strauss led a 3-1 triumph in 2010-11. Fact is though, no team stirs Australia’s competitive instincts quite like the old enemy.\n\nSame goes for English cricket, with Australia the yardstick for nearly 150 years now. The fate of captains and coaches tends to hinge on the result, with teams either detonated or deified based on how they have fared against 11 hard-nosed men in Baggy Green caps.\n\nThere is an extra frisson to this one. Traditional media, social media, myriad podcasts and the like mean the Ashes discourse barely quietens down during the waiting game these days. Take the fallout from Jonny Bairstow’s stumping at Lord’s which, despite his absence from this tour, is somehow still very much a hot topic in Australian circles.\n\nView image in fullscreen Ben Stokes circles the England wagons before hostilities begin in Western Australia. Photograph: Gareth Copley/Getty Images\n\nEngland have moved on but the size of task that awaits is borne out by the numbers. And not simply that wretched recent run on Australian soil, or that Ray Illingworth’s men were the last English side to win back the little urn here in 1970-71, rather than retain it.\n\nFive-Test series – sadly the sole domain of the Big Three nations these days – have been staged 27 times this century and only three away sides have emerged as outright winners: the Strauss tour, England’s 2-1 victory in South Africa in 2004-05, and Steve Waugh’s galácticos claiming Australia’s last away Ashes win back in 2001. In short, five on the road is a bloody tough feat to pull off.\n\nYet this England side under Ben Stokes and Brendon McCullum do seem pretty unencumbered by history. Aware of it, certainly, so too Australia’s No 1 spot in the rankings to their second. As Stokes put it this week, while stressing the past counts for nothing: “Australia is and always will be one of the biggest forces in Test cricket.” But though England’s supporters may fret and fear the usual, 9,000 of them flying into Perth first up, this leadership pairing has spent nearly four years instilling new-world optimism into the players. Evidenced by the likes of Duncan Fletcher, Andy Flower, Kevin Pietersen, Eoin Morgan or Trevor Bayliss in the past, it often takes outsiders to achieve this.\n\nAs well as having the buffer of being holders, Australia may well squeeze one last hurrah out of a champion side.\n\nBut it can only be approaching its natural end, the graph due to trend downwards at some point. England’s line has looked more like something from a crypto exchange, the question now being whether it can spike above that of the hosts by 9 January.\n\nskip past newsletter promotion Sign up to The Spin Free weekly newsletter Subscribe to our cricket newsletter for our writers' thoughts on the biggest stories and a review of the week’s action Enter your email address Sign up Privacy Notice: Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on theguardian.com to send you this newsletter. You can complete full registration at any time. For more information about how we use your data see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nEngland have replenished their stocks since the last encounter but perhaps it will come down to the fortunes of the two all-time great batters.\n\nSteve Smith has been resurgent this past year and Joe Root pretty celestial for the past five. The latter’s challenge will once again be the extra bounce that adds greater risk to those late dabs behind square as he seeks to tick off that elusive first Test century in Australia.\n\nQuick Guide First Ashes Test probable teams Show England (likely): Zak Crawley, Ben Duckett, Ollie Pope, Joe Root, Harry Brook, Ben Stokes (c), Jamie Smith (wk), Gus Atkinson, Brydon Carse, Mark Wood, Jofra Archer\n\n\n\nAustralia (likely): Usman Khawaja, Jake Weatherald, Marnus Labuschagne, Steve Smith (c), Travis Head, Cameron Green, Alex Carey (wk), Mitchell Starc, Scott Boland, Brendon Doggett, Nathan Lyon Was this helpful? Thank you for your feedback.\n\nBut bowlers win Test matches and provided English hands are adhesive in the field, and their fitness holds, airspeed is what gives them a chance of taking 20 wickets this time. Mark Wood and Jofra Archer should test ageing reflexes. Gus Atkinson and Brydon Carse are no slouches. The one area of concern, clearly, is in the spin department.\n\nWood thought he felt a hamstring twinge last week, the scans said otherwise. But McCullum is a gambler and, on a quick pitch, now is the time to push all the chips into the middle. Australia’s two big absentees, Pat Cummins and Josh Hazlewood, may return in time for the pink-ball Test in Brisbane, with a nine-day gap between fixtures aiding their chances. England simply must capitalise before they do so.\n\nEither way, 842 days of curtain-twitching and taking notes, all while recycling the old arguments, finally make way for the very thing itself. Receipts will doubtless be kept, pre-series predictions rubbished in due course. But with a bit of luck, we could be about to witness a belter.",
  "summary": "<p>Some say the Border-Gavaskar Trophy is now pre-eminent, but there is nothing more intense than Australia v England</p><p>If it feels like the buildup to this Ashes series has lasted 842 days that is because it pretty much has. Test cricket’s oldest rivalry resumes on Friday inside Perth’s 60,000-seat thunderdome and with it, mercifully, comes fresh fuel for the ever-raging fire.</p><p>Because on one level the Ashes never really starts or stops. Since Stuart Broad nicked off Alex Carey <a href=\"https://www.theguardian.com/sport/live/2023/jul/31/england-v-australia-ashes-fifth-test-day-five-live-scores-updates-results-aus-vs-eng-cricket-the-oval\">at the Oval on 31 July 2023</a> – the final act of a dramatic 2-2 draw – the sides have been tracking each other, all while their supporters chip away from afar.</p> <a href=\"https://www.theguardian.com/sport/2025/nov/20/cricket-ashes-australia-england-ben-stokes-steve-smith\">Continue reading...</a>",
  "published": "Thu, 20 Nov 2025 08:00:18 GMT",
  "url": "https://www.theguardian.com/sport/2025/nov/20/cricket-ashes-australia-england-ben-stokes-steve-smith",
  "source": "The Guardian"
}