{
  "title": "Mumbai-Ahmedabad bullet train project: Surat-Bilimora section enters final construction phase | Latest update",
  "text": "Mumbai-Ahmedabad bullet train project, Mumbai-Ahmedabad bullet train route: The National High Speed Rail Corporation Ltd (NHSRCL) is working in full swing for the completion of India’s first bullet train corridor. The 508-km Mumbai–Ahmedabad High-Speed Rail (MAHSR) corridor passes through Gujarat, Maharashtra, and the Union Territory of Dadra & Nagar Haveli.\n\nMumbai-Ahmedabad bullet train update\n\nThe 47-km priority corridor between Surat and Bilimora is currently in an advanced stage of construction. All civil works and laying of track-bed have been fully completed so far. “Built with advanced engineering techniques on par with international standards, the project features 465 km (about 85% of the route) on viaducts, ensuring minimal land disturbance and enhanced safety.\n\nSo far, 326 km of viaduct work has been completed, and 17 out of 25 river bridges have already been constructed,” the Ministry of Railways said in a statement. The Ministry of Railways aims to make Surat-Bilimora section operational by 2027.\n\nEarlier, Railway Minister Ashwini Vaishnaw stated that the entire project is expected to be completed by December, 2029. The Railway Minister further added that the bullet train services will be extended to Thane by 2028 and will finally reach Mumbai by 2029.\n\nMumbai-Ahmedabad bullet train stations\n\nThe Mumbai-Ahmedabad Bullet train corridor will have 12 stations. These are: Mumbai, Thane, Virar, Boisar, Vapi, Billimora, Surat, Bharuch, Vadodara, Anand, Ahmedabad and Sabarmati.\n\nSurat bullet train station\n\nOn Sunday, Prime Minister Narendra Modi visited under construction Surat bullet train station and reviewed the progress of the Mumbai–Ahmedabad High-Speed Rail Corridor (MAHSR). The design of the Surat station draws inspiration from the city’s world-renowned diamond industry, reflecting both elegance and functionality.\n\nThe station has been designed with a strong focus on passenger comfort, featuring spacious waiting lounges, restrooms, and retail outlets. It will also offer seamless multi-modal connectivity with the Surat Metro, city buses, and the Indian Railways network.",
  "summary": "",
  "published": "Mon, 17 Nov 2025 12:37:01 +0000",
  "url": "https://indianexpress.com/article/india/mumbaiahmedabad-bullet-train-surat-bilimora-section-latest-update-10370708/",
  "source": "India | The Indian Express"
}