{
  "title": "Witchcraft rumours swirl, 3 adivasi schoolgirls are expelled from school in Jharkhand, relatives say",
  "text": "Three Adivasi students were allegedly expelled from a school in Latehar district in Jharkhand after being accused of engaging in “witchcraft activities”.\n\nAccording to the relatives of the Class 8 students, studying in a government school in Latehar town, a couple of days after their admission, their classmates and school staff started calling them witches and accused them of performing witchcraft activities. The girls were then forced to leave the school and hostel and when their families tried to reach out to the school authorities 10 days later, they refused to take them back, the relatives added.\n\nLatehar Deputy Commissioner Utkarsh Gupta said an inquiry has been ordered into the allegations.\n\n“We are conducting an inquiry into the matter. It does not appear to be a very serious issue at this stage. There seems to have been some mischief among the children. Neither have they been expelled from the school nor from the hostel. They have only been sent home for now. Once the inquiry report comes, we will take further action,” Gupta said.\n\nThe families of the three students said on November 16, the school authorities said that they would revoke their admission. The girls are now back home and no police complaint has been registered yet.\n\nWhile talking to The Indian Express, a relative of one of the students said, “One night around 8.30pm, the headmaster called us and asked us to come immediately and take the child back. We told him it was too late at night, but he kept insisting. The school authorities later refused to keep her and asked us to take her transfer certificate.”\n\n“Our classmates and the school staff called us witches and accused us of troubling other inmates at the hostel. We never did anything like that,” one of the students said, adding, “the harassment continued for nearly two weeks.”\n\nStory continues below this ad\n\nThe school headmaster did not respond to calls and messages seeking comment on the matter.",
  "summary": "",
  "published": "Thu, 20 Nov 2025 02:40:39 +0000",
  "url": "https://indianexpress.com/article/india/witchcraft-rumours-swirl-3-adivasi-schoolgirls-are-expelled-from-school-in-jharkhand-relatives-say-10375198/",
  "source": "India | The Indian Express"
}