{
  "title": "Nearly 47 million Americans live near hidden fossil fuel sites",
  "text": "Fossil fuels pollute the air when they are extracted and when they are burned, but the steps between those two points involve far more than familiar scenes of drilling equipment and smoke-filled power plants. These visible operations represent only the beginning and end of a five-stage process that brings fossil fuels from the ground to their final use.\n\nOil and gas move through several additional stages before reaching power facilities. They are refined to remove unwanted materials, stored in specialized facilities, and transported across the country. These activities form a vast mid-supply chain network that stretches across the United States and often operates out of public view.\n\nMillions Live Near Fossil Fuel Infrastructure\n\nA new analysis led by Boston University researchers provides the first nationwide estimate of how many people live close to this infrastructure. Published in Environmental Research Letters, the study finds that 46.6 million people in the contiguous United States live within 1.6 km (roughly a mile) of at least one component of the fossil fuel supply chain. This accounts for 14.1% of the population.\n\nPrevious studies have shown that communities near extraction sites and end-use facilities experience higher rates of adverse birth outcomes and asthma, and there is growing interest in potential links to other conditions, including leukemia. However, the health effects of living near facilities in the middle of the supply chain remain far less understood. Some sites in these stages have been found to emit volatile organic compounds and other harmful pollutants.\n\n\"This study helps us get a general size of the potential problem, and really starts the process of doing a better job of understanding exactly what the hazards are and how many people are potentially exposed,\" said Jonathan Buonocore, the paper's first author, an assistant professor of environmental health at BU's School of Public Health (SPH), and core faculty at BU's Institute for Global Sustainability (IGS). \"Especially for these more obscure pieces of energy infrastructure, this is the first step to tracking what emissions and stressors those are imposing on the communities.\"\n\nWhere Americans Live Along the Energy Supply Chain\n\nThe researchers also examined how exposure varies across different types of infrastructure. Nearly 21 million Americans live near end-use facilities such as power plants. More than 20 million live within a mile of extraction sites, including oil and gas wells. Storage locations, which include peak shaving facilities, underground gas storage sites, and petroleum product terminals, have over 6 million nearby residents. Fewer people reside near refining or transportation facilities. About 9 million people live close to multiple infrastructure types, meaning they are counted in more than one category.\n\n\"There is reason to believe that there could be air pollution coming from each of these stages, from consistent pollution, gas leaks, or blowouts, when gas or oil flows from a well uncontrollably,\" said Mary Willis, the study's senior author, an assistant professor of epidemiology at SPH, and core faculty at IGS. \"All of these stages can reasonably impact a range of population health outcomes, yet the basic information of who is even near the infrastructure components has not been examined to date.\"\n\nEnvironmental Inequities and Urban Concentration\n\nThe study highlights clear disparities in where fossil fuel infrastructure is located. Communities that are predominantly non-white experience higher exposure across all stages of the supply chain, reinforcing findings from previous environmental justice research.\n\nThe analysis also shows that proximity is far more common in urban areas. Almost 90% of the people living near end-use, transportation, refining, and storage sites are located in cities.\n\nLooking at individual infrastructure types revealed trends that could guide future policy. A single piece of storage infrastructure has, on average, 2,900 residents living within a mile, while an extraction site typically has only 17. This reflects the fact that extraction sites are more numerous but located in less populated regions, whereas storage facilities are fewer in number but tend to be placed in densely populated areas.\n\n\"That means that if a local policymaker in an urban area were to take interest in reducing exposures, they may receive the most impact per piece of infrastructure if they focus on storage,\" Buonocore said.\n\nA New National Database Makes This Research Possible\n\nThis study is the first to use the Energy Infrastructure Exposure Intensity and Equity Indices (EI3) Database for Public Health, introduced by Buonocore and Willis in spring 2024 at the Power & People Symposium. The research team also included Fintan Mooney, Erin Campbell, Brian Sousa, Breanna van Loenen, Patricia Fabian, and Amruta Nori-Sarma.\n\nBefore EI3, information on fossil fuel infrastructure was scattered across local, state, and federal databases, and some data sources required payment or special access. With support from an IGS Sustainability Research Grant jointly funded by IGS and SPH, the team combined available data into a single national resource. Their dataset is hosted on Harvard Dataverse. The grant also helped launch the SPH Energy and Health Lab, which Buonocore and Willis co-direct.\n\n\"The study really shows that there are big knowledge gaps across the supply chain, in terms of the hazards people are being exposed to, the consequent health impacts, and who is being exposed,\" Buonocore said. \"With a lot of these different types of infrastructure, the hazards have not been fully characterized. Characterizing hazards and understanding who is most heavily exposed should be the first steps of understanding the possible health impacts. This research takes the first steps down that path.\"\n\nLooking Ahead to Better Policies and Future Research\n\nAlthough some states and municipalities regulate where fossil fuel operations can take place, many areas still allow infrastructure to be located very close to homes and schools. The team hopes their work will lead to more studies that can support informed policymaking and improve public health. Future research may include detailed monitoring of air, water, noise, and light pollution near facilities, and investigations using new datasets such as Medicaid records or information on specific groups like pregnancy planners.\n\n\"We're really the first group thinking about this as an integrated system. By quantifying all of these factors at once, we're potentially able to, down the line, directly compare: what are the health effects of living near an extraction site, compared to living near a storage site?\" Willis said. \"Having that in one database is the first step to doing any health studies in the future on this integrated system.\"",
  "summary": "A nationwide analysis has uncovered how sprawling fossil fuel infrastructure sits surprisingly close to millions of American homes. The research shows that 46.6 million people live within about a mile of wells, refineries, pipelines, storage sites, or transport facilities. Many of these locations release pollutants that may affect nearby communities, yet mid-supply-chain sites have rarely been studied. The findings reveal major gaps in understanding how this hidden network affects health.",
  "published": "Thu, 20 Nov 2025 09:09:30 EST",
  "url": "https://www.sciencedaily.com/releases/2025/11/251118212039.htm",
  "source": "All Top News -- ScienceDaily"
}