{
  "title": "Gun, bullets found in raids on Kashmir Times office, probe agency claims; owners call it bid to silence",
  "text": "The State Investigation Agency (SIA) of J&K on Thursday said it had raided the office in Jammu of Kashmir Times — one of the oldest English newspaper houses in the region – as part of its probe in a case against the organisation for its alleged “involvement in criminal conspiracy with secessionist and other anti-national entities”.\n\nFollowing the searches, which started at 6 am at the Residency Road premises, the SIA said it had allegedly recovered “one revolver, 14 empty cases of AK-series weapon, three live AK rounds, four fired bullets, three grenade safety levers” and “three suspected pistol rounds”.\n\nThe newspaper’s owners and editors, Anuradha Bhasin and husband Prabodh Jamwal who are believed to be in the US, condemned the searches in a statement while describing the accusations as “unfounded” and an “attempt to silence” them.\n\nJ&K Deputy Chief Minister Surinder Choudhary referred to the SIA raids and claimed that such action follows only in cases where wrongdoing is established and “not for the sake of pressure”.\n\nThe SIA operation comes days after J&K Police said they had busted a terror module centred in Faridabad with the arrest of at least three doctors from J&K while a fourth was seen driving the car that exploded near Delhi’s Red Fort, killing nine, on November 10.\n\nFounded by Anuradha’s father and veteran journalist Ved Bhasin in 1954, Kashmir Times had stopped the publication of its print edition from Jammu and operates primarily online.\n\nAccording to the SIA, the listed charges include: “disseminating terrorist and secessionist ideology”; “spreading inflammatory, fabricated and false narratives”; “attempting to radicalise the youth” of J&K; “inciting disaffection and separatist sentiments”; “disturbing peace and public order”; and, “challenging the sovereignty and territorial integrity of India through print and digital content”.\n\nStory continues below this ad\n\nOfficials said the searches started after SIA officials called the newspaper’s manager Sanjeev Kerni from his home to open the office.\n\nAround noon, sources said, SIA took Kerni to the Gandhi Nagar residence of Jamwal where they conducted searches for nearly two hours. Ved Bhasin’s eldest daughter Anju Bhasin, the former vice-chancellor of Jammu’s Cluster University who currently stays at the address, is also believed to be abroad.\n\nOfficials said the SIA team also examined documents, digital equipment and other material as part of the investigation. The agency is likely to question Anuradha, they said, adding that the operation is part of the agency’s ongoing action against networks suspected to be aiding separatist narratives or unlawful propaganda.\n\nIn their statement, Bhasin and Jamwal said that allegations “are designed to intimidate, to delegitimise, and ultimately to silence”. “We call on the authorities to immediately cease this harassment, withdraw these unfounded allegations, and respect the constitutional guarantees of press freedom,” they said.",
  "summary": "",
  "published": "Thu, 20 Nov 2025 14:44:28 +0000",
  "url": "https://indianexpress.com/article/india/gun-bullets-found-in-raids-on-kashmir-times-office-probe-agency-claims-owners-call-it-bid-to-silence-10376824/",
  "source": "India | The Indian Express"
}