{
  "title": "Donald Trump and JD Vance snubbed for Dick Cheney’s funeral",
  "text": "Donald Trump and JD Vance have been snubbed, by not being invited to former vice-president Dick Cheney’s funeral, taking place on Thursday, according to a White House official familiar with the matter.\n\nCheney, the former US vice-president to George W Bush and a Republican defense hawk who became a fierce critic of the current US president, died earlier this month at the age of 84.\n\nThe funeral service at the National Cathedral in Washington DC was instead packed with old-school Republicans who held power in Cheney’s political era. Bush delivered the eulogy at the 11am service. The former president, 79, avoided mention of any power struggles with his vice-president and said: “They don’t come any better than Dick Cheney” and “he was everything a president should expect in a second-in-command.”\n\nIn the front pews was a bipartisan group: former president Joe Biden, former vice-presidents Kamala Harris, Mike Pence, Al Gore and Dan Quayle, former House speaker Nancy Pelosi and the US supreme court chief justice, John Roberts.\n\nNotable absences included Barack Obama and Bill Clinton. A spokesperson for Clinton said he had an unavoidable scheduling conflict.\n\nIn a further twist that perhaps illustrated the degree to which Trump has reshaped the nation’s political landscape and forged unlikely alliances, the liberal MS NOW host Rachel Maddow made an appearance at the service.\n\nTrump’s exclusion came as little surprise, given his animosity towards Cheney’s daughter Liz, the former Republican congresswoman who served as the vice-chair of the House January 6 committee and was deeply critical of Trump’s role in the Capitol riot.\n\nThe committee leaned in many ways on Liz Cheney’s deep Republican ties and her status as the third-ranking House GOP member for its objective credentials, which so angered Trump that he endorsed her primary challenger in the 2022 midterms.\n\nBoth Liz and Dick Cheney – once seen as key members of the Republican party – endorsed Harris in the 2024 election, a break that would have been unthinkable when the elder Cheney served as Bush’s second in command. Harris lost to Trump last November, giving the Republican his second term in office.\n\nRegarded as one of the most polarizing vice-presidents and once likened to Darth Vader, Cheney died on 3 November of complications of pneumonia and cardiac and vascular disease, according to his family.\n\nAs vice-president, Cheney helped direct the US response to the 9/11 terrorist attacks in 2001, muscled through an expansion of secret government surveillance power, and led the push to invade Iraq and Afghanistan.\n\nHe started his career in Washington as a 28-year-old in the Nixon administration, where he served as a special assistant to Donald Rumsfeld; he became the youngest White House chief of staff at 34 when he replaced Rumsfeld after he was named defense secretary.\n\nAfter Gerald Ford lost the 1976 presidential election to Jimmy Carter, Cheney returned to Wyoming to run for a congressional seat. Cheney spent a decade in the US House, where he rose to become the House minority whip.\n\nCheney resigned his congressional seat to join the George HW Bush administration as defense secretary and oversaw the US operation in the Gulf war. Cheney was chosen by George W Bush to be his running mate for the 2000 election, which they won over the incumbent vice-president, Al Gore, and Senator Joe Lieberman.\n\nLiz Cheney spoke at the funeral on Thursday about the great education she and her sister Mary received from their father in the importance of the American republic and public service.\n\nThen without overtly attacking the president she alluded to her father’s role in her decision to lead the effort to hold Trump to account for his role in the January 6 insurrection by his supporters. And she continued the effort, arguing it was her constitutional duty, despite most Republicans in Washington and the Maga base circling wagons around Trump and turning against her, costing her her congressional career.\n\nShe noted that the Democratic president John F Kennedy inspired Dick Cheney into public service, even though he chose the Republican party.\n\nThen she added of her father: “But he knew that bonds of party must always yield to the single bond we share as Americans. For him, a choice between defense of the constitution and defense of your political party was no choice at all.”\n\nLiz Cheney also broke with Trump over his lengthy campaign to overturn his defeat in the 2020 election, with her saying in the past that Trump’s “election fraud claims were false” and “no president can defy the rule of law and act this way in a constitutional republic, period.”",
  "summary": "<p>Joe Biden and George W Bush attend Republican’s service, while Barack Obama and Bill Clinton are notable absentees</p><p>Donald Trump and JD Vance have been snubbed, by not being invited to former vice-president Dick Cheney’s funeral, taking place on Thursday, according to a White House official familiar with the matter.</p><p><a href=\"https://www.theguardian.com/us-news/dick-cheney\">Cheney</a>, the former US vice-president to George W Bush and a Republican defense hawk who became a fierce critic of the current US president, died earlier this month at the age of 84.</p> <a href=\"https://www.theguardian.com/us-news/2025/nov/20/dick-cheney-funeral-trump-vance\">Continue reading...</a>",
  "published": "Thu, 20 Nov 2025 18:23:42 GMT",
  "url": "https://www.theguardian.com/us-news/2025/nov/20/dick-cheney-funeral-trump-vance",
  "source": "The Guardian"
}