{
  "title": "'Yunus can't touch my mother': Sheikh Hasina's son slams death verdict",
  "text": "Sheikh Hasina (ANI file photo)\n\n'Eternally Grateful': Sheikh Hasina's Son Thanks PM Modi For Saving Her Mother's Life, Slams Yunus\n\n\n\n\n\nOusted Bangladesh Prime Minister Sheikh Hasina ’s son, Sajeeb Wazed, on Thursday alleged that country's interim leader Muhammad Yunus would not be able to harm his mother. He insisted that “Yunus cannot touch my mother and he cannot do anything to her.”His remarks come at a time when Hasina’s future hangs in the balance after a tribunal in Bangladesh sentenced her to death over alleged involvement in the deadly student-led uprising of 2024. The tribunal linked her to the violent crackdown that preceded her ouster. Chief adviser and interim leader Bangladesh, Muhammad Yunus welcomed the verdict, insisting that no one is above the law.Speaking to IANS, Wazed said: “They will not be able to kill her, but they will execute the verdict. First of all, they can’t get her. And once there is a rule of law, this entire process will get thrown out. Everything here is so illegal and unconstitutional and violates every legal principle that, once there is rule of law, everything will get thrown out and it will not be sustainable. So, Yunus cannot touch my mother, and he cannot do anything to her. ”Launching a sharp attack on Bangladesh’s extradition request, Sajeeb Wazed thanked India for protecting Hasina’s life.He also reacted to calls for Yunus’ Nobel Peace Prize to be revoked amid allegations of rights abuses under the interim administration. “Well, Nobel committees never take back their prizes. But look at Nobel laureate Aung San Suu Kyi in Myanmar. She won the Nobel Prize as well. The Peace Prize is basically given by lobbying. But she led to Rohingyas getting killed, and now Yunus is turning Bangladesh into a failed state and an Islamist terrorist state,” he said.Asked what the Congress party in India might have done if it had been in power, the Indian-origin politician replied: “The Congress party would have done the exact same thing that the present government has done. In India, there is rule of law and you have constitutional process. You people have always followed the Constitution and laws.”Wazed sharply criticised the trial process that ended in Hasina’s death sentence, calling it entirely illegal. “This has been done completely illegally. It’s a mockery. First of all, there is a government that is unelected, unconstitutional, and illegal. Then, in order to fast-track the trial in the tribunals, they had to amend laws, which you can only amend with a Parliament. Currently, there is no Parliament. So the process itself was completely illegal. They terminated 17 judges on this tribunal and appointed a new judge who has no experience. He has publicly made a nasty comment about my mother. So he is clearly biased.”He accused authorities of denying Hasina her right to legal representation. “They have not allowed my mother to appoint any lawyer. They appointed their own lawyers to defend my mother. In the history of Bangladesh, such trials take years of hearings, but they completed this in 140 days. So, it’s a complete mockery of justice. There has been no due process. This is a joke,” he added.The ruling marks one of the most consequential legal decisions against a former Bangladeshi leader in decades and comes months before national elections expected in early February. Hasina, 78, has refused to return from India for the trial. The court examined allegations that she ordered a violent response to the mass student uprising that eventually forced her out of power in August 2024.The former prime minister -- Bangladesh’s longest-serving leader -- is facing multiple charges stemming from the period of unrest. A UN rights office report estimated that up to 1,400 people were killed between July 15 and August 15 during the “July Uprising,” which followed a sweeping security crackdown ordered by her government.",
  "summary": "Ousted Bangladesh Prime Minister Sheikh Hasina's son, Sajeeb Wazed, asserted that interim leader Muhammad Yunus cannot harm his mother, despite her death sentence. Wazed criticized the trial as illegal and unconstitutional, alleging a lack of due process and biased judges. He also drew parallels between Yunus and Aung San Suu Kyi regarding Nobel Prizes and alleged state failures.",
  "published": "Fri, 21 Nov 2025 08:45:17 +0530",
  "url": "https://timesofindia.indiatimes.com/world/south-asia/yunus-cant-touch-my-mother-sheikh-hasinas-son-slams-death-verdict-thanks-india-for-saving-her-life/articleshow/125475793.cms",
  "source": "Times of India"
}