{
  "title": "The two extraordinary young activists making me feel optimistic at Cop30",
  "text": "It is easy to criticise the UN climate conferences. But unless you’ve been, there’s one wonderful, almost miraculous, thing that you may not be aware of: it is a beautiful gathering of humanity, people from virtually every country on Earth, all thrown together in common cause.\n\nWhat’s more, many are incredibly smart, passionate and dedicating their lives to fighting the climate crisis. The more of them you meet, the more your hope grows that global heating can be defeated.\n\nSo I want to introduce you to just two of them I’ve met here at Cop30 in Belém, Brazil. The first is an extraordinary firebrand orator from Panama, whose uncompromising clarity shines through the dim halls of Cop. “We are literally paying criminals to kill us [by] giving subsidies to fossil fuel producers,” he says.\n\nThe second is one of the brightest young climate activists I have ever met, and she has a new project that may just change the world.\n\nMore from these two inspiring young people, after today’s climate headlines.\n\nEssential reads\n\nIn focus\n\nView image in fullscreen Juan Carlos Monterrey-Gómez, special representative for climate change for Panama, at Cop29 in Baku, Azerbaijan, last year. Photograph: Murad Sezer/Reuters\n\nJuan Carlos Monterrey Gómez is the special representative for climate change for Panama. You’d spot him easily at Cop by his trademark hat. Cop30 here in Brazil has been dubbed the “Cop of Truth” by Brazilian president\n\nLuiz Inácio Lula da Silva, meaning now is the time to face up to the reality of the climate crisis.\n\nMonterrey-Gómez picked up this challenge in his peerless way: “These are the truths that we really need to internalise in this ‘Cop of Truth’.”\n\n“Truth number one, we’re failing. The objective of the UN climate convention is to stabilise greenhouse gases. But in the past 33 years, instead of cutting them, we have more than doubled. If we look at biodiversity, we’re on a pathway to assassinate half of all living creatures.”\n\n“Truth number two is that we don’t need more reports, dialogues, committees of experts, roundtables. The science is quite clear. Fossil fuels are making the planet hotter and the best way to stop that heating is to phase them out.”\n\n“Truth number three is that the climate crisis, the biodiversity crisis, the land crisis, the ocean crisis, the plastic pollution crisis, they’re all the same crisis. They are the product of an economic system that favours unhinged production, that pollutes everything in its way to the detriment of humans.”\n\nHis final truth: “We are literally paying criminals to kill us. We’re giving subsidies to fossil fuel producers, when we know everything they produce kills us, quickly or slowly.”\n\nMonterrey-Gómez said Cop30 must deliver a clear statement on the phase-out of fossil fuels. It took 28 years of Cops for them to even get a mention, thanks to obstruction from petrostates. “If we cannot even mention fossil fuels, if we cannot commit to protect forests, what the heck are we doing here?”\n\nskip past newsletter promotion Sign up to Down to Earth Free weekly newsletter The planet's most important stories. Get all the week's environment news - the good, the bad and the essential Enter your email address Sign up Privacy Notice: Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on theguardian.com to send you this newsletter. You can complete full registration at any time. For more information about how we use your data see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nView image in fullscreen Ayisha Siddiqa, far right, and other panellists at a discussion during Cop27 in Sharm el-Sheikh, Egypt, in 2022. Photograph: Thomas Hartwell/AP\n\nAyisha Siddiqa (pictured above right, back at Cop27 in Egypt) is an American-Pakistani law student in Los Angeles, who at 26 has already, among other things, been an adviser to the UN secretary general and a commissioner for the International Energy Agency.\n\nShe is also the founder of the Future Generations Tribunal, the project her formidable intellect is now focused on, which is tackling a fundamental problem. Recent international court rulings have clearly concluded that a stable climate is a human right. But the people who will suffer the most are those yet to be born, so how can their rights be protected?\n\n“The international regime needs to have legal imagination, so that we can start talking about the rights of future generations. There is legal innovation happening in the Amazon, in Aotearoa/New Zealand, to give legal personhood to rivers, to whales, so they can stand in front of a court of law and ask for [justice]. But future generations don’t have that personhood.”\n\nSiddiqa and her team have now begun collecting citizen testimony from young people around the world on how the climate crisis is taking away their human right to a healthy environment, to safety, to clean air. These will be built into an international declaration on the rights of future generations.\n\n“Who is a fossil-free world for? It’s for future generations,” she said.\n\n“If we arrive at a place where future generations have legal personhood, we can sue the hell out of corporations in a way that has been difficult to date. I come from Indigenous peoples [in Pakistan] who, quite literally, in the next 50 years are going to be subjected to more heat than they’ve ever experienced before. I guess my role in life is going to be to combat that.”\n\nWith people such as Siddiqa and Monterrey-Gómez on the climate case, and many more like them, I feel optimistic that, as Martin Luther King Jr put it, the long arc of the moral universe will bend toward justice.\n\nRead more:",
  "summary": "<p>In today’s newsletter: Despite valid criticisms, the summits are filled with smart, passionate people dedicating their lives to fighting the climate crisis</p><p>• <a href=\"https://www.theguardian.com/global/2022/sep/20/sign-up-for-the-down-to-earth-newsletter-our-free-environmental-email\">Don’t get Down to Earth delivered to your inbox? Sign up here</a></p><p>It is easy to criticise the UN climate conferences. But unless you’ve been, there’s one wonderful, almost miraculous, thing that you may not be aware of: it is a beautiful gathering of humanity, people from virtually every country on Earth, all thrown together in common cause.</p><p>What’s more, many are incredibly smart, passionate and dedicating their lives to fighting the climate crisis. The more of them you meet, the more your hope grows that global heating can be defeated.</p><p><strong><a href=\"https://www.theguardian.com/environment/2025/nov/19/trump-emissions-policy-could-cause-climate-deaths\">Trump’s anti-climate agenda could result in 1.3m more deaths globally, analysis finds</a></strong></p><p><strong><a href=\"https://www.theguardian.com/environment/2025/nov/19/tropical-cyclone-fina-northern-territory-darwin\">Tropical cyclone Fina intensifies to category two and could hit NT coast on Friday</a></strong></p><p><strong><a href=\"https://www.theguardian.com/football/2025/nov/19/beth-mead-climate-change-football\">England’s Beth Mead: ‘If we don’t adapt to climate change, football becomes a privilege, not a right‘</a></strong></p> <a href=\"https://www.theguardian.com/environment/2025/nov/20/down-to-earth-cop30-belem-hope-optimism\">Continue reading...</a>",
  "published": "Thu, 20 Nov 2025 12:35:54 GMT",
  "url": "https://www.theguardian.com/environment/2025/nov/20/down-to-earth-cop30-belem-hope-optimism",
  "source": "The Guardian"
}