{
  "title": "Starmer arrives in South Africa as G20 gathers without Trump",
  "text": "Starmer arrives in South Africa as G20 gathers without Trump\n\n35 minutes ago Share Save Chris Mason, Political editor and Raphael Sheridan, Senior political producer, travelling with the prime minister Share Save\n\nReuters\n\nThe prime minister has arrived in Johannesburg in South Africa for a gathering of world leaders at the annual G20 summit. The summit brings together the 20 biggest economies, although Donald Trump has decided not to attend over widely discredited claims that white people are being persecuted in the country. Sir Keir Starmer, whose critics label him \"never here Keir\" because of the frequency of his international trips, will emphasise the benefits of a prime minister acting as an ambassador for UK businesses abroad. Before the summit formally opens, Sir Keir will visit a Johannesburg depot to see trains that were built in Derby and announce a new deal where the UK will \"provide strategic advice and consultancy services\" to South Africa's railways.\n\nAn organisation called Crossrail International, which is owned by the UK government, will carry out the work. It has also signed a deal with Vietnam to provide similar services there. Downing Street argues that Africa provides what it calls \"unparalleled future opportunities for UK businesses\" given half of Africans are under the age of 20 and more than a quarter of the world's population will live in Africa by 2050. \"I will focus on the deals we can do, the business we can do, with our partner countries and make sure that the work we do internationally is impacting directly at home,\" he told reporters on the flight to South Africa. \"If you want to deal with the cost of living and make people better off with good secure jobs, investment from G20 partners and allies is really important,\" he added.",
  "summary": "The PM is aiming to support British business on his trip to Johannesburg.",
  "published": "Fri, 21 Nov 2025 05:21:15 GMT",
  "url": "https://www.bbc.com/news/articles/ceq0q39812qo?at_medium=RSS&at_campaign=rss",
  "source": "BBC News"
}