{
  "title": "Paris court blocks auction of earliest-known calculator",
  "text": "Paris court blocks auction of earliest-known calculator\n\nScientists and researchers made a legal appeal to grant heritage protections to the historic instrument, arguing it should be classified as a \"national treasure\".\n\nValuations suggested the machine could fetch €2m to 3m (£1.7m to £2.6m), and Christie's called it the \"most important scientific instrument ever offered at auction\".\n\nAuction house Christie's has confirmed it will not proceed with bidding for the machine La Pascaline, developed by the French mathematician Blaise Pascal in 1642.\n\nOne of the world's first calculating machines will not go to auction as scheduled in France, after a Paris court provisionally blocked the historic item from being exported.\n\nPascal was just 19 years old when he developed the earliest version of a calculator, Christie's said. There are only nine of these machines still in existence.\n\n\"It is the first attempt in history to substitute the human mind with a machine,\" the official collection description reads.\n\n\"Its invention marks a breakthrough, a 'quantum leap' whose importance and significance take on a very special meaning today.\"\n\nLa Pascaline was exhibited at Christie's venues in New York and Hong Kong throughout the year.\n\nThe machine was included in Christie's auction of the library of the late Catalonia collector Léon Parcé, which also featured Pascal's philosophical piece Pensées and the first printed version of \"Pascal's wager\".\n\nOn Wednesday, a Paris administrative court temporarily blocked an earlier export authorisation provided by France's culture minister in May. Two experts had signed off on the minister's certificate, including one from the Louvre Museum.\n\nThe judge concluded there were \"serious doubts\" over the legality of the certificate, a statement from the Paris court said, adding the decision was provisional until a final judgment is delivered.\n\nIn a statement to the AFP news agency, a Christie's spokesperson said: \"Given the provisional nature of this decision and in accordance with the instructions of its client, Christie's is suspending the sale of La Pascaline.\"\n\nThe court noted La Pascaline's historic and scientific value could qualify it as a \"national treasure\", guaranteeing protections under France's heritage code.\n\nThe French heritage group Association Sites & Monuments, which was listed as an applicant in the court filing, welcomed the decision.\n\nAdditional reporting by Sebastian Usher, Global Affairs reporter",
  "summary": "The court blocked La Pascaline, a 400-year-old calculating machine, from being exported from France.",
  "published": "Thu, 20 Nov 2025 02:03:14 GMT",
  "url": "https://www.bbc.com/news/articles/c2kpkq90ygno?at_medium=RSS&at_campaign=rss",
  "source": "BBC News"
}