{
  "title": "Lamb: Missed Vegas curfew prompted benching",
  "text": "Stephen A. Smith breaks down why the next three weeks determine the fate of the Dallas Cowboys' season. (1:39)\n\nOpen Extended Reactions\n\nFRISCO, Texas -- Dallas Cowboys wide receiver CeeDee Lamb said he and George Pickens missed curfew Sunday, which resulted in both players missing the first series of Monday's game against the Las Vegas Raiders.\n\nLamb told reporters that he and Pickens were at Red Rock Casino having dinner and drinks. He denied he was throwing up outside the casino, which had been mentioned on social media.\n\nThe Cowboys had a 10 p.m. PT curfew Sunday night with a 5:15 p.m. PT kickoff Monday.\n\nAfter the Cowboys' 33-16 win, coach Brian Schottenheimer said, \"there were some things that were missed\" and the players were informed of the disciplinary action before the game. He did not get into specifics. Neither did Pickens or Lamb after the game.\n\nLamb finished with five catches for 66 yards and a touchdown, and Pickens had a career-high-tying nine catches for 144 yards and a 37-yard TD reception from Dak Prescott.\n\n\"I'm not going in-depth on that,\" Lamb said after the game. \"Honestly, I'm not. I'm sorry, I'm not.\"\n\nPickens was not asked why they were benched when he spoke to the media Thursday. Asked how it felt to watch the game start from the sideline, Pickens said, \"It definitely wasn't nice. Me and CeeDee definitely wanted to be out there.\"\n\nHe said his relationship with Schottenheimer, who hugged both receivers after Lamb's touchdown, has grown closer as the year has gone on.\n\nSchottenheimer said Tuesday he wants Pickens, who is scheduled to be a free agent after this season, to remain with the Cowboys. Last year, the Cowboys signed Lamb to a deal that averages $34 million a year.\n\nPickens has 58 catches for 908 yards and seven touchdowns. Lamb, who missed three games with a high ankle sprain, has 40 catches for 557 yards and two touchdowns.\n\n\"Sign me up. I mean, what do you say? Those two guys, I just love their relationship, man. I love the firepower that they give us,\" Schottenheimer said. \"That's one of those games where you never know which one it's going to be. Some games it's both of them, some games it's one of them, and again, like I said, I pinch myself at times. ... I'm very in favor of George having a long-term future with us.\"",
  "summary": "Cowboys wide receiver CeeDee Lamb said he and George Pickens missed curfew Sunday, which resulted in both players missing the first series of Monday's game against the Raiders.",
  "published": "Thu, 20 Nov 2025 23:07:46 EST",
  "url": "https://www.espn.com/nfl/story/_/id/47040252/missed-vegas-curfew-prompted-cowboys-discipline-lamb-says",
  "source": "www.espn.com - TOP"
}