{
  "title": "Indian-origin employee gifted $40,000 by McDonald’s restaurant owner. Here's why",
  "text": "After four decades of dedicated service at a McDonald's in Saugus, Massachusetts, Pargan Singh, endearingly called 'Balbir', has become a local hero. His colleagues, who have watched him grow from a beginner to a beloved team member, surprised him with a lavish red-carpet tribute and a generous $40,000 gift, celebrating an incredible journey of commitment and camaraderie.\n\n\n\n\n\nAn Indian-origin McDonald’s worker in Saugus, Massachusetts was celebrated in a big way after completing 40 years at the same restaurant, earning a $40,000 gift and a red-carpet evening from colleagues who call him “family”.Pargan Singh, also known to everyone as “Balbir”, first joined the Saugus McDonald’s when he moved to the United States. He recalled starting with basic tasks and slowly building his way up. “I worked in the kitchen, helping in the back, taking the trash, tried to do everything step by step. So I came in the front, they promoted me after three or four months to become a swing manager,” he said.Lindsay Wallin, the current owner of the restaurant, said Singh originally worked for her father and has remained an important person in the business ever since. She now runs four McDonald’s locations and considers Singh one of the organisation’s strongest pillars. “I was just excited to be able to hire Balbir and carry on with our organisation, and with our company, and he’s just such a pillar in our company,” she said.To honour his 40 years of service, Singh was taken for a limo ride and treated to a special dinner where staff rolled out a red carpet, reports Boston News. At the event, he was presented with a cheque for $40,000 as a gesture of gratitude.Wallin said celebrating him was an easy decision. “He’s just a great guy, he’s committed to the business, he’s committed to his employees, they all call him ‘papa bear’, they love him. It was just a no brainer to go big for him, for sure,” she said.For Singh, the reason he stayed so long is simple. “It’s kind of family, just put it that way. You know, that’s why I’m here so long,” he said.",
  "summary": "After four decades of dedicated service at a McDonald's in Saugus, Massachusetts, Pargan Singh, endearingly called 'Balbir', has become a local hero. His colleagues, who have watched him grow from a beginner to a beloved team member, surprised him with a lavish red-carpet tribute and a generous $40,000 gift, celebrating an incredible journey of commitment and camaraderie.",
  "published": "Fri, 21 Nov 2025 01:20:34 +0530",
  "url": "https://timesofindia.indiatimes.com/world/us/indian-origin-man-gifted-40000-by-mcdonalds-restaurant-owner-after-40-years-of-service-in-us/articleshow/125471561.cms",
  "source": "Times of India"
}