{
  "title": "Particles energized by magnetic reconnection in the nascent solar wind",
  "text": "New research led by a Southwest Research Institute scientist identified a new source of energetic particles near the Sun. These definitive observations were made by instruments aboard NASA's Parker Solar Probe, which detected the powerful phenomena as the spacecraft dipped in and out of the solar corona.\n\nThese new results offer fresh perspectives on how magnetic reconnection could heat the solar atmosphere, which then transitions into the solar wind, and also how solar flares accelerate a small fraction of charged particles to near-relativistic speeds.\n\n\"Through the SwRI-led Magnetospheric Multiscale mission, scientists made the first direct detection of the source of magnetic reconnection near Earth, observing how this explosive physical process converts stored magnetic energy into kinetic energy and heat,\" said SwRI's Dr. Mihir Desai, lead author of a new paper about this research. \"Now Parker has made direct observations of how magnetic reconnection at the heliospheric current sheet (HCS), where the interplanetary field reverses its polarity, energizes charged particles to extremely high energies.\"\n\nAs Parker crossed the HCS, scientists discovered a sunward-directed reconnection jet and sunward-propagating highly energetic protons, establishing their origin from HCS reconnection sites and not from unrelated processes at the Sun. Within the core of the reconnection exhaust, Parker detected trapped energetic protons a thousand times greater than the available magnetic energy per particle.\n\n\"These findings indicate that magnetic reconnection in the HCS is an important source of energetic particles in the near-Sun solar wind,\" Desai said. \"Everywhere there are magnetic fields there will be magnetic reconnection. But the Sun's magnetic fields are much stronger near the star, so there's a lot more stored energy to be released.\"\n\nMagnetic reconnection -- when magnetic field lines converge, break apart and reconnect in an explosive physical process -- energizes particles and generates high-speed flows. At the heart of space weather, reconnection is responsible for powerful solar events, such as solar flares and coronal mass ejections (CMEs), and drives disturbances in Earth's space environment. Such disturbances produce spectacular auroras but can also shut down electrical power grids and disrupt satellite-based communication and navigation systems.\n\n\"Reports from the American Meteorological Society indicated that the powerful solar events in May 2024 wreaked havoc with farmers when extreme geomagnetic storms disrupted the precise GPS-guided navigation systems used to plant, fertilize and harvest rows of seeds, causing an estimated loss of up to $500 million in earning potential,\" Desai said. \"Parker's access to this new data is critical, particularly as we remain in the midst of a very active solar cycle.\"\n\nParker was able to make these measurements due to its record-breaking proximity to the Sun, flying through its corona up to three times a year. Of particular interest is understanding how the Sun's atmosphere heats up and accelerates the solar wind. Understanding these processes can also help scientists develop ways to predict and mitigate the effects of solar flares and CMEs, as well as provide new insights for laboratory fusion research.\n\nThe Parker Solar Probe was developed as part of NASA's Living With a Star program to explore aspects of the Sun-Earth system that directly affect life and society. The Living With a Star program is managed by the agency's Goddard Space Flight Center in Greenbelt, Maryland, for NASA's Science Mission Directorate in Washington. The Johns Hopkins University Applied Physics Laboratory designed, built and operates the spacecraft and manages the mission for NASA.",
  "summary": "Scientists have identified a new source of energetic particles near the Sun. These definitive observations were made by instruments aboard NASA's Parker Solar Probe, which detected the powerful phenomena as the spacecraft dipped in and out of the solar corona.",
  "published": "Tue, 03 Jun 2025 11:46:31 EDT",
  "url": "https://www.sciencedaily.com/releases/2025/06/250603114631.htm",
  "source": "Latest Science News -- ScienceDaily"
}