{
  "title": "Master System at 40: the truth about Sega’s most underrated console",
  "text": "There’s an old maxim that history is written by the victors, and that’s as true in video games as it is anywhere else. Nowadays you’d be forgiven for thinking that the Nintendo Entertainment System was the only console available in the mid-to-late 1980s. If you were brought up in Nintendo’s target markets of Japan and North America, this chunky contraption essentially was the only game in town – the company had Mario after all, and its vice-like hold on third-party developers created a monopoly for major titles of the era. But in Europe, where home computers ruled the era, the NES was beaten by a technologically superior rival.\n\nThe Sega Master System was originally released in Japan in the autumn of 1985 as the Sega Mark III. Based around the famed Z80 CPU (used in home computers such as the Spectrum, Amstrad and TRS-80) and a powerful Sega-designed video display processor, it boasted 8kb of RAM, a 64-colour palette and the ability to generate 32 sprites on screen at one time – making the NES (based on the older 6502 processor) look like an ancient relic.\n\nAt first it was marketed domestically as a continuation of Sega’s SG-1000 series of machines, which were closer to affordable home computers than games consoles, with their optional keyboards and printers. But as the NES exploded in both Japan and the US, Sega had a rethink, removed some computing features and re-released the Mark III in 1986 as the Master System – an unapologetic games machine with a sleek, slimline, angular look, contrasting the beige Betamax visage of the NES.\n\nView image in fullscreen Sega Master System games came on two formats: a cartridge and a Sega Card for shorter, cheaper titles. Photograph: booksR/Alamy\n\nIt also came with a light gun, and Sega even released a pair of 3D glasses for the system and a range of compatible games. “I am going to call out the 3D version of OutRun,” says coder Chris White, who wrote a Master System emulator later used by Sega on its PlaySega website. “Sure it made your head hurt and the alternate flickering of the lenses was enough to trigger a mild seizure, but it’s reflective of an era when Sega wasn’t afraid to try wild experiments.”\n\nSega oversaw the distribution of the Master System in the US (at least initially), but looked to local companies to tackle the more fragmented European market. For the UK and France (and later Spain), that role would go to Virgin Mastertronic. “Sega’s partners had better marketing positioning in Europe,” says Nick Alexander, who was Virgin Mastertronic’s managing director at the time. “They also had better retail and distribution relationships than Nintendo did in those days. The video game industry magazine Computer Trade Weekly had a running joke that Nintendo saw Europe as where the dragons lived – they didn’t understand it, they were nervous of it. So they put their effort into the US.”\n\nAlexander, who had run Virgin Games since 1983, embraced that company’s edgy, youth-conscious approach. “I was trying to think of the video game equivalent of a band going on tour,” he explains. “So we bought a double-decker bus and drove it around the country. We took it to school playgrounds and shopping centres. It got an awful lot of coverage. Nintendo had always marketed their games as family entertainment, but the only market in Europe where that worked was Germany. We pitched to teenagers and we knew if we got them, their younger siblings would want a Master System too. That’s how we beat Nintendo in Europe.”\n\nAnd while Nintendo had Mario, Sega had a valuable asset of its own: its arcade heritage. The company set out to bring many of its hugely popular coin-op hits to the machine including Space Harrier, OutRun, Golden Axe and After Burner, marketing its new machine in the west as an arcade in your own living room. Although hardly perfect ports of the original titles, these were much faster and more colourful than any earlier home computer translations. To those of us who were teenage arcade addicts at the time, it felt wildly futuristic.\n\nView image in fullscreen ‘An arcade in your own living room’ … Shinobi on Sega Master System. Photograph: ArcadeImages/Alamy\n\n“The games are visually superior to other Z80 based systems as a result of Sega’s graphics hardware,” says White. “It presents the programmer with scrollable tilemaps and freely placeable sprites. They are both easy to use and offload a significant amount of processing from the CPU. The design had a number of parallels to Sega’s arcade hardware. In fact, the Master System’s graphics chip is actually based on the TMS9918, used by Sega’s older arcade machines.”\n\nFor European developers, the Master System hardware was a dream. “We’d been working on the Spectrum and Amstrad and our games were being ported to the C64,” says Andrew Oliver, who with his brother Philip was making the Dizzy games for Codemasters. “We went to the CES show in Las Vegas and I remember seeing the Sega stand. It was massive, and right alongside Nintendo – and their message was: ‘It’s all about speed.’ Back in the day, computers really were all about what was colourful and fast. So Codemasters cut a licensing deal, we got the dev kits – it’s a Z80, so we program it like a Spectrum, but the graphics chip is like a C64. The code ran really fast and you had all the nice parallax scrolling and sprites. It was very easy.”\n\nUK developers also found Sega to be more helpful than Nintendo. Mike Simpson was a coder at the British publisher Personal Software Services, later owned by Mirrorsoft. “We had set up a little internal development studio in Coventry, only about 20 people, and we were doing a variety of ports,” he says. “Someone asked us to port Xenon 2, a really high-end 16bit Amiga game, on to the Master System. It looked impossible, so we had to have a go! I was actually invited to Japan to learn how to program it: I spent a week at Sega in Tokyo being taught by Mark Cerny [later lead architect of the PlayStation 4 and 5]. I remember rows and rows of tightly packed desks, and the meeting room chairs were all being used to sleep on!”\n\nskip past newsletter promotion Sign up to Pushing Buttons Free weekly newsletter Keza MacDonald's weekly look at the world of gaming Enter your email address Sign up Privacy Notice: Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on theguardian.com to send you this newsletter. You can complete full registration at any time. For more information about how we use your data see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nView image in fullscreen Console classic … Sonic the Hedgehog. Photograph: Sega\n\nEven when the Mega Drive arrived, the Master System’s popularity in Europe (and later Brazil), meant that it continued to be supported with simplified versions of Mega Drive games such as Sonic the Hedgehog. The spin-off title Sonic Chaos, developed for both the Master System and Sega’s Game Gear handheld (which was based on the same hardware as the Master System), was one of the highlights of the series. Later, Sega rolled out a redesigned sequel, Master System 2, priced at a relatively affordable £50 with Sonic thrown in.\n\nBut the Master System wasn’t just a repository for arcade classics and ports from other machines. It has its own heritage. The beautiful platformers Wonder Boy III: The Dragon’s Trap, Psycho Fox, Fantasy Zone and Alex Kidd in Miracle World, the seminal role-playing adventure Phantasy Star, the excellent Zelda-alike Golvellius: Valley of Doom – these are genuine classics, up there with the NES-era titles for which they are often overlooked. For modern collectors, they are also more accessible, being free of the inflated pricing attached to many classic Nintendo titles.\n\nIt’s true that in the US, the NES was so dominant that the word “Nintendo” became a synonym for gaming. But in Europe, Brazil and elsewhere, the Master System won out. The history books have been cruel to it, but for those of us who were there, who read European gaming mags, or who studied the annual Argos and Grattan Christmas catalogues for Sega goodies, the Master System was the home arcade machine that hinted at the future of gaming. It was the promise that the Mega Drive would go on to fulfil.",
  "summary": "<p>Forty years ago, the Nintendo Entertainment System dominated the markets in Japan and the US. But in Europe, a technologically superior rival was making it look like an ancient relic</p><p></p><p>There’s an old maxim that history is written by the victors, and that’s as true in video games as it is anywhere else. Nowadays you’d be forgiven for thinking that the Nintendo Entertainment System was the only console available in the mid-to-late 1980s. If you were brought up in Nintendo’s target markets of Japan and North America, this chunky contraption essentially <em>was</em> the only game in town – the company had Mario after all, and its vice-like hold on third-party developers created a monopoly for major titles of the era. But in Europe, where home computers ruled the era, the NES was beaten by a technologically superior rival.</p><p>The Sega Master System was originally released in Japan in the autumn of 1985 as the Sega Mark III. Based around the famed Z80 CPU (used in home computers such as the Spectrum, Amstrad and TRS-80) and a powerful Sega-designed video display processor, it boasted 8kb of RAM, a 64-colour palette and the ability to generate 32 sprites on screen at one time – making the NES (based on the older 6502 processor) look like an ancient relic.</p> <a href=\"https://www.theguardian.com/games/2025/nov/18/sega-master-system-nintendo-entertainment-system\">Continue reading...</a>",
  "published": "Tue, 18 Nov 2025 12:00:51 GMT",
  "url": "https://www.theguardian.com/games/2025/nov/18/sega-master-system-nintendo-entertainment-system",
  "source": "The Guardian"
}