{
  "title": "Atmospheric chemistry keeps pollutants in the air",
  "text": "Nitrates in the atmosphere reduce air quality and play an important role in climate change. An international team led by Hokkaido University researchers has revealed how chemical processes in the atmosphere have led to persistently high nitrate levels despite a reduction in emissions over the past few decades. These findings, published in Nature Communications, will help improve climate modelling by refining our ability to assess and predict atmospheric nitrate levels.\n\nAtmospheric nitrate levels peaked between 1970 and 2000. The levels decreased somewhat with the decrease in the emission of nitrate precursors since the 1990s, but the drop in nitrate levels is smaller than the drop in the emission of precursors -- something is keeping nitrates in the atmosphere.\n\nNitrates can exist in either a gaseous or particulate form in the atmosphere. Gaseous nitrate is more easily deposited out of the atmosphere, while the particulate form -- particularly finer particles -- can be transported over long distances. Understanding the balance between gaseous and particulate nitrates is therefore important in getting a picture of the atmospheric dynamics and persistence of nitrates.\n\nThe persistence of atmospheric nitrates in source regions is explained by a buffering effect, where gaseous nitrates are converted to particulate nitrates, contributing to their persistence. The impact of this buffering over long timescales and at long ranges is unclear, but nitrates deposited in Arctic ice cores show the same patterns as atmospheric nitrates. These sites are far from the sources, so the continuing high deposition rates don't reflect local processes near the source but must be due to atmospheric transport and other processes in the atmosphere.\n\nTo understand these dynamics, a research team led by Professor Yoshinori Iizuka at the Institute of Low Temperature Science, Hokkaido University, examined the nitrate deposition history from 1800 to 2020 in an ice core taken from southeastern Greenland. As expected, nitrate levels within the core increased from the 1850s, peaking between the 1970s and 2000s before declining somewhat but remaining high. Overall, the increase in nitrates up to the 1970s happened more gradually than the increase in precursors, and the decrease after the 1990s was also slower and smaller than the decrease in precursor emission.\n\nThe delayed effect and persistence of nitrates indicates factors other than the emission of precursors are affecting nitrate levels. The researchers investigated these factors with a global chemical transport model and found that the difference between nitrate and precursor levels correlated with atmospheric acidity and not with other meteorological factors, such as air temperature.\n\nIn other words, the persistence of nitrates has been driven by chemical processes happening in the atmosphere rather than meteorological conditions or atmospheric dynamics. Changes in atmospheric acidity altered the proportion of nitrate that was gaseous or particulate. This affects the lifetime of nitrates in the atmosphere. Atmospheric acidity has increased the fraction of nitrates in particulate form, enabling this pollutant to persist longer and travel farther.\n\n\"Ours is the first study to present accurate information for records of particulate nitrates in ice cores, which has been a very challenging problem,\" says Iizuka. \"As it is more difficult to reduce anthropogenic emissions of substances that lead to increased nitrates, accurate measurements of particulate nitrates in the ice cores provides data for increasing the accuracy of predicting the amplification of Arctic warming in the future.\"\n\n\"It was difficult to present accurate nitrate from ice cores, but our team was able to do so this time.\" says Iizuka. \"In the future, nitrate will replace sulfate as the primary aerosol in the Arctic, suggesting this result leads to the higher accuracy of future predictions of Arctic warming amplification.\"",
  "summary": "A new study details processes that keep pollutants aloft despite a drop in emissions.",
  "published": "Tue, 03 Jun 2025 11:50:26 EDT",
  "url": "https://www.sciencedaily.com/releases/2025/06/250603115026.htm",
  "source": "Latest Science News -- ScienceDaily"
}