{
  "title": "Aravali protection: SC bars new mining leases; orders sustainable mining plan",
  "text": "'Aravali plan should have thorough analysis of cumulative green impact'\n\nNEW DELHI: To protect the Aravali hills and ranges - the only barrier against desertification of the Gangetic plains - Supreme Court Thursday barred grant of mining leases, but allowed existing ones to operate, while asking the Centre to prepare a management plan for sustainable mining for the entire range spread across four states.This is the last judgment to be authored by CJI B R Gavai, who as head of the green bench had zealously protected environment, ecology and forests while balancing the court's directions with sustainable development principles.The bench of CJI Gavai and Justices K Vinod Chandran and N V Anjaria accepted the definition of Aravali hills and ranges recommended by an expert committee and prohibited mining in core/inviolate areas, with certain exceptions. The committee had recommended prohibition of mining in core/inviolate areas, except for extraction of critical, strategic and atomic minerals.While accepting the recommendations for sustainable mining in the Aravali hills and ranges, and prevention of illegal mining, the bench directed the environment and forest ministry to prepare an MPSM through the Indian Council of Forestry Research and Education for the entire Aravalis, which is spread across Gujarat, Rajasthan, Haryana and Delhi.The Management Plan for Sustainable Mining (MPSM) must identify \"permissible areas for mining, ecologically sensitive, conservation-critical and restoration-priority areas within the Aravali landscape where mining shall be strictly prohibited or permitted only under exceptional and scientifically justified circumstances\", it said. The plan must also incorporate a thorough analysis of cumulative environmental impacts and the ecological carrying capacity of the region and include detailed post-mining restoration and rehabilitation measures, the bench said.\"We further direct that till MPSM is finalised by MoEF&CC through ICFRE, no new mining leases should be granted,\" the bench said, adding that allotment of new mining leases would be considered by govts concerned only after MPSM is prepared and identifies areas in Aravali where sustainable mining could be permitted. \"In the meantime, mining activities in the mines which are already in operation would be continued in strict compliance with the recommendations made by the (expert) committee,\" it said.SC said the Aravali mountain range faces \"escalating degradation pressures\" because of several factors - deforestation, unsustainable grazing, illegal and excessive mining, and urban encroachment - cumulatively causing widespread damage to the ecosystem.SC said the Aravali hills and ranges harbour rich biodiversity, with 22 wildlife sanctuaries, four tiger reserves, Keoladeo National Park, along with wetlands like Sultanpur, Sambhar, Siliserh and Asola Bhati, and aquifers that recharge river systems, including the ones at Chambal, Sabarmati, Luni, Mahi, and Banas, and insisted on preparation of MPSM.",
  "summary": "The Supreme Court has prohibited new mining leases in the Aravali hills to protect them from desertification, while allowing existing operations to continue. The court mandated the preparation of a sustainable mining management plan for the entire range across four states, emphasizing ecological impact analysis and restoration measures.",
  "published": "Fri, 21 Nov 2025 03:19:20 +0530",
  "url": "https://timesofindia.indiatimes.com/india/sc-bans-new-mining-leases-in-aravalis-allows-only-existing-ones-to-operate/articleshow/125472149.cms",
  "source": "Times of India"
}