{
  "title": "Accused of ‘illegally transferring govt land’, former Satna collector gets clean chit from Madhya Pradesh govt",
  "text": "The Chief Minister Mohan Yadav-led government in Madhya Pradesh has given a clean chit to IAS officer Ajay Katesaria, who had been charged with serious irregularities during his tenure as Collector of Satna district.\n\nKatesaria had been accused of issuing unlawful orders in multiple land-related cases between February 2020 and December 2021, allegedly facilitating the illegal transfer of government land to private individuals and violating conduct rules for All India Services officers.\n\nThe charges, first levelled through a departmental chargesheet issued on March 30, 2022, and an additional chargesheet on July 24, 2024, accused Katesaria of illegally entering government land in the names of private individuals in several cases, allegedly deleting the word “government” from government land records, passing orders contrary to government interest in at least nine separate land cases, and violating multiple provisions of the All India Services (Conduct) Rules, 1968.\n\nIn an order dated November 7, 2025, the General Administration Department exonerated Katesaria of all major charges, concluding that his actions were lawful and conducted within his judicial authority. However, it did ask him to “to exercise due caution in future”, and said that this “concludes this case at this stage without imposing any penalty”.\n\nThe order was signed by Farheen Khan, Under Secretary (Personnel), in the name of the Governor of Madhya Pradesh.\n\nKatesaria is currently serving as Deputy Secretary in the General Administration Department.\n\nAccording to the November 7 order, after examining Katesaria’s detailed replies, “the Commissioner observed that in most of the cases, the orders passed by him were judicial or quasi-judicial in nature and were issued in compliance with the directions of the Board of Revenue and the courts. His replies were found to be satisfactory and acceptable, because the final decisions in those matters are pending before the High Court, and as per Revenue Department Circular, all presiding officers of revenue courts enjoy protection from disciplinary action in respect of quasi-judicial proceedings.”\n\nStory continues below this ad\n\nHowever, the government did acknowledge one area of concern, as it was found that in dealing with a case, a “lack of adequate oversight and due vigilance on Katesaria’s part is evident while implementing the Revenue Board’s decision”.\n\nBased on these findings, the government took a lenient view, “issuing only a warning to Katesaria, IAS, to exercise due caution in future…”\n\nThe IAS officer, in his defence, had claimed that “the chargesheet sent by the Commissioner, Rewa, was malicious and that the facts were deliberately presented in a distorted manner”.\n\nThe officer had said that all his orders were “legal, rational, and in accordance with previous judicial decisions”. He claimed that “even during Assembly sessions, the Revenue Department had upheld the correctness of his orders, stating that the action was legally sound and pending at the Tehsil level”. He said that “all his decisions were taken after detailed examination of the relevant circumstances”.",
  "summary": "",
  "published": "Mon, 17 Nov 2025 22:55:12 +0000",
  "url": "https://indianexpress.com/article/india/accused-of-illegally-transferring-govt-land-former-satna-collector-gets-clean-chit-from-madhya-pradesh-govt-10371518/",
  "source": "India | The Indian Express"
}