{
  "title": "Scientists say next few years vital to securing the future of the West Antarctic Ice Sheet",
  "text": "Collapse of the West Antarctic Ice Sheet could be triggered with very little ocean warming above present-day, leading to a devastating four metres of global sea level rise to play out over hundreds of years according to a study now published in Communications Earth & Environment, co-authored by the Potsdam Institute for Climate Impact Research (PIK). However, the authors emphasise that immediate actions to reduce emissions could still avoid a catastrophic outcome.\n\nScientists at PIK, the Norwegian research centre NORCE and Northumbria University in the United Kingdom conducted model simulations going back 800,000 years to give an extended view of how the vast Antarctic Ice Sheet has responded in the past to the Earth's climate as it moved between cold \"glacial\" and warmer \"interglacial\" periods.\n\n\"In the past 800,000 years, the Antarctic Ice Sheet has had two stable states that it has repeatedly tipped between. One, with the West Antarctic Ice Sheet in place, is the state we are currently in. The other state is where the West Antarctic Ice Sheet has collapsed,\" lead author David Chandler from NORCE commented.\n\nThe major driver of change between the two states is rising ocean temperatures around Antarctica, because the heat melting the ice in Antarctica is supplied mostly by the ocean, rather than the atmosphere. Once the ice sheet has tipped to the collapsed state, reversal back to the stable present-day state would need several thousands of years of temperatures at or below pre-industrial conditions.\n\n\"Once tipping has been triggered it is self-sustaining and seems very unlikely to be stopped before contributing to about four meters of sea-level rise. And this would be practically irreversible,\" Chandler said.\n\n\"It takes tens of thousands of years for an ice sheet to grow, but just decades to destabilise it by burning fossil fuels. Now we only have narrow window to act,\" said co-author Julius Garbe from PIK.",
  "summary": "Collapse of the West Antarctic Ice Sheet could be triggered with very little ocean warming above present-day, leading to a devastating four meters of global sea level rise to play out over hundreds of years according to a new study. However, the authors emphasize that immediate actions to reduce emissions could still avoid a catastrophic outcome.",
  "published": "Tue, 03 Jun 2025 11:50:18 EDT",
  "url": "https://www.sciencedaily.com/releases/2025/06/250603115018.htm",
  "source": "Latest Science News -- ScienceDaily"
}