{
  "title": "Bihar wind has arrived in Tamil Nadu, Modi says during Coimbatore visit",
  "text": "Riding on the Bihar victory wave, Prime Minister Narendra Modi in Coimbatore told a crowd of farmers who were twirling green gamchas (towels) on Wednesday that it seemed that “Bihar winds had arrived in Tamil Nadu” before him, referring to the NDA landslide that crushed the Opposition Mahagathbandhan.\n\nThe PM’s remark also comes as the state gears up for the Assembly elections next year and amid protests over Special Intensive Revision (SIR) of electoral rolls. The first phase of the exercise was conducted in Bihar ahead of the elections. Earlier this month, Chief Minister M K Stalin had convened an all-party meeting, following which a total of 44 political parties decided to move the Supreme Court against the Election Commission’s SIR of rolls.\n\nPM Modi inaugurated the three-day South India Natural Farming Summit 2025, organised by the Tamil Nadu Natural Farming Stakeholders Forum, in Coimbatore, and from the platform outlined an expansive vision for India’s shift toward natural and chemical-free agriculture. Modi said he hoped that “new ideas and solutions” would emerge from Coimbatore—a city he hailed as central to India’s agricultural transformation.\n\nStory continues below this ad\n\nThe PM released the 21st instalment of PM-KISAN of Rs 18,000 crore to nearly 9 crore farmers as he said that India was “on the path to becoming a global hub for natural farming”, calling the movement both “a vision and a necessity” for reviving soil fertility and reducing the country’s dependence on chemicals.\n\nPM's Ramnath Goenka lecture | Modi urges 10-year national pledge to shed colonial mindset rooted in Macaulay’s legacy\n\n“Lakhs of farmers in Tamil Nadu have received funds in their accounts,” he said, adding that over Rs 4 lakh crore has been transferred to small farmers since the scheme began and highlighted the benefits that accrued to farmers following reduction in GST rates on bio-fertilisers.\n\nAs Modi arrived for the event, thousands of farmers who had flocked to the venue waved green towels. “I bow at the feet of Lord Muruga of Marudhamalai,” Modi said at the start of his address, invoking the temple deity on what he called the “sacred soil of Coimbatore.”\n\nHe described the industrial hub as a “land of culture, compassion, and creativity,” and highlighted its long-standing textile legacy. Coimbatore, he said, holds significance for another reason—C P Radhakrishnan, who was elected to the Lok Sabha for the first time in 1998 from the seat, is now the country’s Vice-President.\n\nStory continues below this ad\n\nGovernor R N Ravi, AIADMK chief Edappadi K Palaniswami, Tamil Maanila Congress leader G K Vasan, and state BJP president Nainar Nagenthran were among those who received the PM at the airport. After a short roadshow from the airport to the CODISSIA grounds, Modi toured an exhibition where farmers and start-ups displayed natural farming innovations.\n\nExcessive use of fertilisers, he warned, “is reducing soil fertility, affecting soil moisture, and increasing costs year after year.”\n\nHe urged farmers to adopt the “one acre, one season” model of natural farming and appealed to agricultural institutions to “make natural farming a fully science-backed movement.” At the same time, he drew on regional pride, citing Tamil Nadu’s tradition of Panchagavya (prepared by mixing five ingredients), Jeevamrit, mulching, and millet cultivation.\n\n“Natural farming is an indigenous Indian concept, not imported from elsewhere,” he said, adding that South India had long been “a living university of agriculture,” from ancient dams to multi-storey farming in the Western Ghats.",
  "summary": "",
  "published": "Wed, 19 Nov 2025 15:02:51 +0000",
  "url": "https://indianexpress.com/article/india/bihar-wind-arrived-tamil-nadu-modi-coimbatore-visit-10374834/",
  "source": "India | The Indian Express"
}