{
  "title": "Insect protein blocks bacterial infection",
  "text": "A protein that gives fleas their bounce has been used to boot out bacteria cells, with lab results demonstrating the material's potential for preventing medical implant infection.\n\nThe collaborative study led by researchers at RMIT University in Australia is the first reported use of antibacterial coatings made from resilin-mimetic proteins to fully block bacteria from attaching to a surface.\n\nStudy lead author Professor Namita Roy Choudhury said the finding is a critical step towards their goal of creating smart surfaces that stop dangerous bacteria, especially antibiotic-resistant ones like MRSA, from growing on medical implants.\n\n\"This work shows how these coatings can be adjusted to effectively fight bacteria -- not just in the short term, but possibly over a long period,\" she said.\n\nBacteria are often found on implants following surgery, despite sterilisation and infection controls. These can lead to infections requiring antibiotics, but with antibiotic resistance becoming more common, new preventative measures are needed.\n\n\"Antibiotic resistance has prompted greater interest in the area of self-sterilising materials and easy preparation of antibacterial surfaces,\" Choudhury said.\n\n\"Therefore, we designed this surface to completely prevent the initial attachment of the bacteria and biofilm formation to decrease the infection rates.\"\n\nChoudhury said potential applications could include spray coatings for surgical tools, medical implants, catheters and wound dressings.\n\nResilin to the rescue\n\nResilin, a protein found in insects, is known for its remarkable elasticity -- it enables fleas to jump more than a hundred times their own height in microseconds -- but it's also extremely resilient and biocompatible.\n\n\"These exceptional properties and non-toxic nature make resilin and resilin-mimetic proteins ideal for many applications requiring flexible, durable materials and coatings,\" Choudhury said.\n\n\"These applications range from tissue engineering and drug delivery to flexible electronics and sports equipment, but this is the first work published on its performance as an antibacterial coating.\"\n\nThe team created several forms of coating from altered forms of resilin, then tested their interactions with E.coli bacteria and human skin cells in lab conditions.\n\nThe study showed how the altered proteins in nano droplet form known as coacervates were 100% effective at repelling the bacteria, while still integrating well with healthy human cells, a critical part of medical implant success.\n\nStudy lead author from RMIT Dr Nisal Wanasingha said the nano droplets' high surface area made them especially good at interacting with and repelling bacteria.\n\n\"Once they come in contact, the coating interacts with the negatively charged bacterial cell membranes through electrostatic forces, disrupting their integrity, leading to leakage of cellular contents and eventual cell death,\" he said.\n\nWanasingha said the resilin-based coatings not only showed 100% effectiveness in stopping bacteria from attaching to the surface but also offered several advantages compared to traditional approaches.\n\n\"Unlike antibiotics, which can lead to resistance, the mechanical disruption caused by the resilin coatings may prevent bacteria from establishing resistance mechanisms,\" he said.\n\n\"Meanwhile, resilin's natural origin and biocompatibility reduce the risk of adverse reactions in human tissues and, being protein-based, are more environmentally friendly than alternatives based on silver nanoparticles.\"\n\nNext steps\n\nStudy co-author Professor Naba Dutta said resilin-mimetic protein is highly responsive to stimuli and changes in its environment, making it potentially tuneable for many functions.\n\n\"These early results are very promising as a new way to help improve infection control in hospitals and other medical settings, but now more testing is needed to see how these coatings work against a wider range of harmful bacteria,\" Dutta said.\n\n\"Future work includes attaching antimicrobial peptide segments during recombinant synthesis of resilin-mimics and incorporating additional antimicrobial agents to broaden the spectrum of activity.\"\n\nTransitioning from lab research to clinical use will require ensuring the formula's stability and scalability, conducting extensive safety and efficacy trials, while developing affordable production methods for widespread distribution, he added.\n\nThe study was in collaboration with the ARC Centre of Excellence for Nanoscale BioPhotonics and the Australian Nuclear Science and Technology Organisation (ANSTO).\n\nThe team used ANSTO's Australian Centre for Neutron Scattering facilities, and RMIT University's Micro Nano Research Facility and Microscopy and Microanalysis Facility.\n\nThe work was funded by the Australia India Strategic Research Fund, Australian Institute of Nuclear Science and Engineering top-up Postgraduate Research Award (PGRA) and supported by the Australian Research Council.",
  "summary": "Scientists have reported use of antibacterial coatings made from resilin-mimetic proteins to fully block bacteria from attaching to a surface. A protein that gives fleas their bounce has been used to boot out bacteria cells, with lab results demonstrating the material's potential for preventing medical implant infection.",
  "published": "Mon, 02 Jun 2025 15:48:56 EDT",
  "url": "https://www.sciencedaily.com/releases/2025/06/250602154856.htm",
  "source": "Latest Science News -- ScienceDaily"
}