{
  "title": "Researchers recreate ancient Egyptian blues",
  "text": "A team of Washington State University-led researchers has recreated the world's oldest synthetic pigment, called Egyptian blue, which was used in ancient Egypt about 5,000 years ago.\n\nReporting in the journal, NPJ Heritage Science, the researchers used a variety of raw materials and heating times to develop 12 recipes for the pigments, providing useful information for archaeologists and conservation scientists who study the ancient Egyptian materials. The work was done in collaboration with Carnegie Museum of Natural History and the Smithsonian's Museum Conservation Institute.\n\n\"We hope this will be a good case study in what science can bring to the study of our human past,\" said John McCloy, first author on the paper and director of WSU's School of Mechanical and Materials Engineering. \"The work is meant to highlight how modern science reveals hidden stories in ancient Egyptian objects.\"\n\nWhile Egyptian blue pigment was valued in ancient times, there is limited archaeological evidence of how it was made. It was used as a substitute for expensive minerals like turquoise or lapis lazuli and was used in painting wood, stone, and a papier-mâché-type material called cartonnage. Depending on its ingredients and processing time, its color ranges from deep blue to dull gray or green. After the Egyptians, the pigment was used by Romans, but by the Renaissance period, the knowledge of how it was made was largely forgotten.\n\nIn recent years, there has been a resurgence of interest in the pigment because it has interesting optical, magnetic, and biological properties with potential new technological applications, said McCloy. The pigment emits light in the near-infrared part of the electro-magnetic spectrum that people can't see, which means it could be used for things like fingerprinting and counterfeit-proof inks. It also has a similar chemistry to high-temperature superconductors.\n\n\"It started out just as something that was fun to do because they asked us to produce some materials to put on display at the museum, but there's a lot of interest in the material,\" said McCloy, who, in addition to being a professor in materials science and engineering, has a master's degree in anthropology.\n\nTo understand its makeup, the researchers, including a mineralogist and an Egyptologist, created 12 different recipes of the pigment from mixtures of silicon dioxide, copper, calcium, and sodium carbonate. They heated the material at about 1000 degrees Celsius for between one and 11 hours to replicate temperatures that would have been available for ancient artists. After cooling the samples at various rates, they studied the pigments using modern microscopy and analysis techniques that had never been used for this type of research, comparing them to two ancient Egyptian artifacts.\n\nEgyptian blue included a variety of blue colors, depending on where they were made and their quality. The researchers found that the pigment is highly heterogeneous.\n\n\"You had some people who were making the pigment and then transporting it, and then the final use was somewhere else,\" said McCloy. \"One of the things that we saw was that with just small differences in the process, you got very different results.\"\n\nThe researchers found that, in fact, to get the bluest color requires only about 50% of the blue-colored components.\n\n\"It doesn't matter what the rest of it is, which was really quite surprising to us,\" said McCloy. \"You can see that every single pigment particle has a bunch of stuff in it -- it's not uniform by any means.\"\n\nThe samples created are currently on display at Carnegie Museum of Natural History in Pittsburgh, Pennsylvania and will become part of the museum's new long-term gallery focused on ancient Egypt.",
  "summary": "Researchers have recreated the world's oldest synthetic pigment, called Egyptian blue, which was used in ancient Egypt about 5,000 years ago.",
  "published": "Mon, 02 Jun 2025 15:49:07 EDT",
  "url": "https://www.sciencedaily.com/releases/2025/06/250602154907.htm",
  "source": "Latest Science News -- ScienceDaily"
}