{
  "title": "Faridabad: Video shows ammonium nitrate cache in secluded hideout; what initial probe suggests",
  "text": "The video, filmed a day before the Red Fort car blast that killed 15 people, shows a house in an isolated location with sacks of ammonium nitrate stacked inside.\n\nCalm And Radical: Dr Umar’s Pre-Blast Video Exposes Educated New Face Of Terror Behind Delhi Attack\n\nFARIDABAD: A video showing 2,600kg of ammonium nitrate recovered from a cleric’s house in Faridabad on 9 November has resurfaced as the investigation into the Delhi car blast deepens.The video, filmed a day before the Red Fort car blast that killed 15 people, shows a house in an isolated location with sacks of ammonium nitrate stacked inside.The rented room cost Rs 1,500 a month.Investigators are also examining whether the arrested doctors, Shaheen Shahid and Muzammil Shakeel, bought multiple vehicles as part of a broader serial bombing plot linked to the Delhi attack.Initial findings suggest the duo may have arranged or financed several cars intended to be used as vehicle-borne improvised explosive devices (VBIEDs) for an “anniversary revenge attack” allegedly planned for the Babri Masjid demolition anniversary on 6 December.Separately, the National Investigation Agency (NIA) has arrested Amir, a resident of Pampore in Jammu and Kashmir, who allegedly conspired with suicide bomber Umar Un Nabi to carry out the attack.“Amir had travelled to Delhi to facilitate the purchase of the i20 car that was converted into a VBIED for the blast,” a senior NIA official said.The agency has also seized another vehicle linked to bomber Dr Umar, which is undergoing forensic examination for explosive residue, fingerprints and digital evidence.Investigators are checking whether Shaheen and Shakeel, both associated with Al-Falah University, helped procure additional cars beyond those already traced.Meanwhile, the National Investigation Agency (NIA) on Thursday took custody of three doctors and a preacher who were arrested in connection with the November 10 car blast outside the Red Fort in which 15 people were killed.Muzammil Ganaie, Adeel Rather and Shaheena Saeed as well as Maulvi Irfan Ahmed Wagay had been arrested by the Jammu and Kashmir police following the blast.\"They had all played a key role in the terror attack that killed several innocent persons and left many others injured,\" an NIA spokesperson said.With their custody shifting to the NIA, which formally took over the case on November 11, the number of people booked by the federal agency has gone up to six.The NIA has already arrested two people -- Amir Rashid Ali and Jasir Bilal Wani alias Danish.Dr Umar-un-Nabi, who was driving the explosives-laden i20 that detonated, had allegedly bought the car in Ali’s name. Wani was arrested after it emerged that Umar had been trying to convince him to become a suicide bomber. He was not persuaded but is alleged to have agreed to participate as an overground worker for the banned terror outfit Jaish-e-Mohammed.Those arrested are alleged to be at the centre of a 'white collar' terror module busted by Jammu and Kashmir police along with their counterparts in Uttar Pradesh and Haryana. Investigations led to the Al Falah university in Faridabad where 2,900 kg of explosives was recovered.It all started on the intervening night of October 18-19, when posters of the banned JeM surfaced on walls just outside Srinagar city. The posters warned of attacks on police and security forces in the Valley.Srinagar police decided to treat the matter as a serious issue and not just as a one-off incident and Senior Superintendent of Police (Srinagar) G V Sundeep Chakravarthy formed several teams to get into the depth of the case.Three people -- Arif Nisar Dar alias Sahil, Yasir-ul-Ashraf and Maqsood Ahmad Dar alias Shahid -- were arrested after CCTV footage showed them pasting the posters.During interrogation, they named former paramedic turned preacher Maulvi Irfan Ahmed from Shopian as the one who had supplied the posters. He was arrested.This was the thread that led to the unravelling of the plot. It was his interrogation that finally led investigators to Al Falah university and the group of Kashmiri doctors.The first person to be arrested was Ganaie from Faridabad. Then Saeed too from the town. Later, Adeel Rather was picked up from Saharanpur in Uttar Pradesh.",
  "summary": "Investigators are probing a Delhi car blast, with a video of 2,600kg of ammonium nitrate resurfacing. Terror accused Muzammil Shakeel allegedly sought a cleric's help to store explosives. Doctors Shaheen Shahid and Muzammil Shakeel are being questioned about a potential serial bombing plot linked to the attack.",
  "published": "Fri, 21 Nov 2025 08:53:43 +0530",
  "url": "https://timesofindia.indiatimes.com/city/faridabad/2600kg-of-terror-video-reveals-deadly-ammonium-nitrate-cache-hidden-in-secluded-faridabad-hideout-ahead-of-delhi-car-blast/articleshow/125476037.cms",
  "source": "Times of India"
}