{
  "title": "US clears Excalibur artillery shells, Javelin anti-tank systems for India",
  "text": "The US has approved the sale of Excalibur guided artillery projectiles and the anti-tank Javelin missile system and related equipment worth over $90 million to India, marking a significant step forward for Delhi’s big-ticket military procurements from Washington.\n\nThe Defence Security Cooperation Agency, in two separate statements, said the State Department has made a determination approving a possible Foreign Military Sale to India of Excalibur Projectiles and related equipment at an estimated cost of $47.1 million and of the Javelin Missile System and related equipment at an estimated cost of $45.7 million.\n\nThe Defence Security Cooperation Agency delivered the required certification notifying Congress about the sales. It said the proposed sale will improve India’s capability to meet current and future threats by providing precision capability equipment, which will increase first strike accuracy of its brigades.\n\n“India will have no difficulty absorbing these articles and services into its armed forces,” it said.\n\nThe US Marine Corps prepare an Excalibur 155 mm projectile round on Fire Base Bell, Iraq, while conducting fire missions. (File Photo: US Marine Corps) The US Marine Corps prepare an Excalibur 155 mm projectile round on Fire Base Bell, Iraq, while conducting fire missions. (File Photo: US Marine Corps)\n\nIt said the Indian request was for 216 M982A1 Excalibur tactical projectiles. Non-MDE (major defence equipment) items to be included in the sale are ancillary items; Portable Electronic Fire Control Systems (PEFCS) with Improved Platform Integration Kit (iPIK); primers; propellant charges; US Government technical assistance; technical data; repair and return services; and other related elements of logistics and programme support.\n\nIn 2019, the Army had procured around 600 rounds of the Excalibur munition to increase its artillery firepower. This included around 500 rounds of ammunition with an accuracy of 20 metres from the target and around 100 rounds which could hit targets with an accuracy of two metres. The range of the Excalibur munition bought by the Army is around 40 to 57 km, differing with the specific configuration and the howitzer it is fired from.\n\nThe ammunition can be fired from all 155 mm guns in the Army’s inventory, including Bofors, M777 Howitzer, K9 Vajra and Dhanush artillery guns. Soon after its induction in 2019, the Army had tested the Excalibur precision-guided shells from the US-made M777 Howitzer in Pokhran.\n\nStory continues below this ad\n\nAdditionally, in a separate statement, the Defence Security Cooperation Agency said India requested for 100 FGM-148 Javelin rounds; one Javelin FGM-148 missile, fly-to-buy; and 25 Javelin Lightweight Command Launch Units (LwCLU) or Javelin Block 1 Command Launch Units (CLU). Other non-MDE items to be included are missile simulation rounds; battery coolant unit; interactive electronic technical manual; and Javelin operator manuals as well as refurbishment services and other related elements of logistics and programme support.\n\nAccording to the Raytheon website, Javelin is an anti-tank guided munition that can be carried and launched by a single person. It is made by the Javelin Joint Venture, a partnership between Raytheon and Lockheed Martin. It is a medium-range, ‘fire-and-forget’ missile for use against multiple targets including armoured vehicles, bunkers and caves. The Javelin can be fired from a remote launcher mounted on an unmanned ground vehicle.\n\n“The proposed sale will improve India’s capability to meet current and future threats, strengthen its homeland defence and deter regional threats,” it said.\n\nThe agency said the sales will support US foreign policy and national security objectives by helping to strengthen the US-Indian strategic relationship and to improve the security of a major defence partner which continues to be an important force for political stability, peace, and economic progress in the Indo-Pacific and South Asia regions. It said neither of the proposed sales will alter the basic military balance in the region.",
  "summary": "",
  "published": "Thu, 20 Nov 2025 13:46:22 +0000",
  "url": "https://indianexpress.com/article/india/us-clears-excalibur-artillery-shells-javelin-anti-tank-systems-for-india-10376701/",
  "source": "India | The Indian Express"
}