{
  "title": "The best early Black Friday deals in the UK on the products we love, from coffee machines to heated throws",
  "text": "Like Christmas Day, Black Friday has long since ceased to be a mere “day”. Yuletide now seems to start roughly when Strictly does, and Black Friday kicked off around Halloween, judging by the landfill of exclamation-marked emails weighing down my inbox.\n\nThe Guardian’s journalism is independent. We will earn a commission if you buy something through an affiliate link. Learn more.\n\nBlack Friday is a devil worth dancing with if you want to save money on products you’ve had your eye on – and it can pay to start dancing now. Some of the Filter’s favourite items are already floating around at prices clearly designed to make them sell out fast. Other deals won’t land until the big day itself on 28 November, or even until the daftly named Cyber Monday (1 December).\n\nAs ever, we’d encourage you not to buy anything unless you really need it and have the budget to do so – read our advice on how to shop smartly.\n\nWe’ll keep this page updated over the next few days with more genuine Black Friday bargains on the Filter’s favourites, from Anker battery packs to KidiZoom cameras via the espresso machine you loved more than any other product this year.\n\nHow we selected these deals (and excluded others)\n\nThe key to shopping smart on Black Friday, Cyber Monday or any discount event is to know what you want – and we’re here to help you target the good stuff. We’ve tested thousands of products at the Filter in 2025 and warmly recommended hundreds of them, including many that have genuinely good Black Friday discounts.\n\nInstead of listing price cuts on all the products we’ve featured, we’ve focused on the things you’ve liked the most this year, and looked for deals that undercut their long-term average prices by a significant amount. Ideally, their Black Friday price will be their lowest of the year.\n\nWe don’t take retailers at their word on discount size, either. Amazon may say it’s “70%” off the RRP, but we study the price history of every item using independent tools such as the Camelizer to find out how generous a discount really is. If an item’s price has been all over the place in 2025, we’ll give the average price below instead of a “was …” price, so you can judge how good a deal it is.\n\nQ&A How is the Filter covering Black Friday? Show At the Filter, we believe in buying sustainably, and the excessive consumerism encouraged by Black Friday doesn’t sit easily with us. However, we also believe in shopping smarter, and there’s no denying that it’s often the best time of year to buy big-ticket items that you genuinely need and have planned to buy in advance, or stock up on regular buys such as skincare and cleaning products. Retailers often push offers that are not as good as they seem, with the intention of clearing out old stock, so we only recommend genuine deals. We assess the price history of every product where it’s available, and we won’t feature anything unless it is genuinely lower than its average price – and we will always specify this in our articles. We only recommend deals on products that we’ve tested or have been recommended by product experts. What we choose to feature is based on the best products at the best prices chosen by our editorially independent team, free of commercial influence. Was this helpful? Thank you for your feedback.\n\nThe best early Black Friday deals on the Filter’s favourite products\n\nThe best home deals\n\nShark vacuum cleaner\n\nShark PowerDetect vacuum, £314 (was £549)\n\nA vacuum cleaner that empties itself? Yes please, said our writer Andy Shaw in his roundup of the best cordless vacuum cleaners – and you agreed, making Shark’s ingenious and powerful cordless cleaner one of your favourite products of the year. Vacuums that look after themselves don’t come cheap, and it’s great to see this one heavily discounted at Shark’s own website as well as at Amazon.\n\nThe best robot vacuum cleaner\n\nEufy X10 Pro Omni, £499 (was £579)\n\nYou wait a lifetime for a self-emptying vacuum cleaner, then Black Friday brings you two at once. The Eufy X10 was named “best overall” by Stuart Andrews in his guide to the best robot vacuums, and it’s already one of the fastest-selling items in Amazon’s Black Friday sale. Its price cut isn’t quite the 38% Amazon suggests, because it cost £579 throughout 2025, but this is still a legitimately good deal.\n\nDamp-destroying dehumidifier\n\nProBreeze dehumidifier, from £151.99 (was £189.99)\n\nThis “workhorse”, which “extracted moisture powerfully” in our best dehumidifiers test, has tumbled to its lowest price of the year (except for a few days in May, because no one buys dehumidifiers in May). If the recent cold snap gave you the condensation blues, here’s your chance to snap up the ProBreeze for a chunk below its average Amazon price of just over £180.\n\nCuddly heated throw\n\nBeurer HD150 heated throw, £79.99 (was £84.99)\n\nBeurer’s “soft and sumptuous” fleece blanket was crowned “best throw overall” in our guide to the best electric blankets thanks to its ability to get toasty fast without using much energy. A fiver off is not a massive discount, but this is its cheapest recent price on Amazon, where it normally costs £84.99 – and other retailers still want over £100 for it. We’ll bring you any non-Amazon deals that emerge in the coming days.\n\nGoogle video doorbell\n\nGoogle Nest doorbell, from £119.98 (was £179.99)\n\nSort the cold-callers from the welcome visitors when they’re still metres away from your front door, with this outstanding battery-powered doorbell that crashes to its lowest price since Black Friday 2023. Andy Shaw named it the best video doorbell overall, but lamented that you also have to fork out for a Nest Aware subscription at £80 a year to save recordings.\n\nBudget electric blanket\n\nSlumberdown Sleepy Nights electric blanket, king size, from £30.59 (was £45.99)\n\nThis Slumberdown Sleepy Nights performed admirably in Emily Peck’s testing, heating quickly to a temperature that was comfortable to keep our reviewer warm through the night. It also has elasticated fitted straps to make fitment easy, and comes in a variety of sizes to suit your bed size. It’s the king-size one that’s been discounted.\n\nSubscription-free video doorbell\n\nEufy Security doorbell E340, £74.99 (avg £151.29)\n\nLots of video doorbells and home surveillance systems come with a recurring subscription to access some of their features, which you may wish to avoid. If so, then the Eufy Video Doorbell E340 was Andy Shaw’s pick in his testing of the best video doorbells out there. He liked the E340 precisely because of its dual camera setup to make keeping an eye on parcels a breeze, plus the onboard storage to stick it to cloud storage. Reliability of movement detection needed some work, though. At £75 from Amazon, it’s also at its lowest price ever this Black Friday from the big online retailer.\n\nThe best kitchen deals\n\nVersatile espresso maker\n\nDe’Longhi Stilosa espresso machine, £84.55 (was £89)\n\nThe promise of “ludicrously tasty” espresso and “perfect microfoam for silky cappuccinos and flat whites” proved so irresistible that this was one of the Filter recommendations you loved most in 2025. Our writer Sasha Muller was already wowed by its affordability in his espresso machines test, and it’s rarely discounted at all, so we’re not too sad to see it drop just a few pounds for Black Friday.\n\nskip past newsletter promotion Sign up to The Filter Free weekly newsletter Get the best shopping advice from the Filter team straight to your inbox. The Guardian’s journalism is independent. We will earn a commission if you buy something through an affiliate link. Enter your email address Sign up Privacy Notice: Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on theguardian.com to send you this newsletter. You can complete full registration at any time. For more information about how we use your data see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nCapsule coffee machine\n\nPhilips L’or Barista Sublime, from £45 (avg £69.40)\n\nThe price of this sleek machine has bounced between £105 and about £60 since 2023, only ever dipping to £45 for Black Friday each year. Its compatibility, compactness and coffee impressed the Filter’s cuppa connoisseur, Sasha Muller, enough to be named “best capsule machine” in his bid to find the best coffee machines.\n\nNinja air fryer\n\nNinja Double Stack XL, £188 (was £269.99)\n\nIf you’re still holding out on buying an air fryer, here’s a rare chance to grab a big-name, big-capacity Ninja without the big price tag. Not quite so big, anyway. Rachel Ogden named the Double Stack XL “best compact air fryer” in her guide to the best air fryers, but with its 9.5lL capacity and four cooking levels, this thing can cook a lot. Still not cheap, but far below its average price of £229.\n\nThe best blender\n\nBraun PowerBlend 9, from £140 (was £199)\n\nYou can spend about £500 on a premium blender, but this superb model from Braun costs below £200 even at full price – something our best blenders tester, Rachel Ogden, could hardly believe when she named it “best overall”. Hold on to your smoothie, Rachel, because it’s now less than £150, and not just at Amazon.\n\nTefal air fryer\n\nTefal Easy Fry Dual XXL, £119.99 (was £199.99)\n\nTefal is known mostly for its ActiFry tech, so when Rachel Ogden crowned the Tefal Easy Fry Dual XXL as the best air fryer, it made sense. She found it to be a sublime all-rounder in her testing, handling both chips and frozen food very well. With an 11-litre capacity, it’s also Tefal’s largest dual zone air fryer, making it handy for cooking a lot of food for larger families when you need to. Its price of £104 at Amazon is its best ever.\n\nThe best electric kettle\n\nBosch Sky Kettle, £64.99 (avg £85.38)\n\nThe Bosch Sky Kettle is our favourite electric kettle – as Rachel Ogden noted in her testing, it wins because it is a “good all-rounder that will suit most people”. That’s down to a number of factors, including how easy it is to pour, plus strong build quality and generally decent boil time. For £65 (a return to its best ever price), that seems like a useful reduction.\n\nThe best personal care appliance deals\n\nSunrise alarm clock\n\nLumie Sunrise Alarm, from £29.99 (was £49)\n\nOne of your favourite Filter recommendations of the year, this gentle sunrise alarm clock will wake you up with kittens purring, birdsong, gently brightening light – or a plain old alarm sound if you prefer. It’s been around for a few years and saw a price hike in 2022 (cost-of-waking-up crisis?) before settling at just under £50 from most retailers, so this is a deal worth grabbing.\n\nWater flosser\n\nWaterpik Ultra Professional, from £59.99 (was £91)\n\nBlast the gunk from your gums without having to grapple with floss. The Waterpik Ultra is a countertop model so it takes up more space than the cordless type, but this gives it more versatility and saw it score top marks with our water flosser tester Alan Martin. If you’d rather avoid Amazon, you can find it discounted by other retailers, albeit not by as much.\n\nThe best IPL device\n\nPhilips Lumea 9900, £404.99 (avg £501.33)\n\nIPL (intense pulsed light) hair remover devices promise to banish stubbly regrowth without the pain of waxing and epilation – at a price. The Philips Lumea 9900, Lise Smith’s pick for best IPL device overall, has cost as much as £599.99 for much of the year, and occasional discounts rarely go below £450. Amazon’s current price shaves more than £40 off any other Black Friday deal we’ve found.\n\nThe best beauty deals\n\nA bargain beauty Advent calendar\n\nW7 Beauty Blast Advent calendar, £16.95 (was £19.95)\n\nAdvent calendars are a Christmas staple, and we’ve seen lots of brands try to put a different spin on them in the past – beauty Advent calendars are some of the most prominent. This W7 Beauty Blast calendar provides excellent value for money at a deal-busting £16.95 from Amazon, especially as it provides genuinely useful products for most folks. The likes of the eyeshadows, primers, lip balms and such are travel-size, but apart from that, Sarah Matthews had little cause for complaint in her ranking of the best beauty Advent calendars.",
  "summary": "<p>We’ve cut through the noise to find genuinely good early Black Friday 2025 discounts on Filter-recommended products across home, kitchen and beauty</p><p>• <a href=\"https://www.theguardian.com/thefilter/2025/nov/19/how-to-shop-smart-black-friday\"><strong>Big savings – or big regrets? How to shop smart this Black Friday</strong></a></p><p>Like Christmas Day, Black Friday has long since ceased to be a mere “day”. Yuletide now seems to start roughly when Strictly does, and Black Friday kicked off around Halloween, judging by the landfill of exclamation-marked emails weighing down my inbox.</p><p>Black Friday is a devil worth dancing with if you want to save money on products you’ve had your eye on – and it can pay to start dancing now. Some of the Filter’s favourite items are already floating around at prices clearly designed to make them sell out fast. Other deals won’t land until the big day itself on 28 November, or even until the daftly named Cyber Monday (1 December).</p> <a href=\"https://www.theguardian.com/thefilter/2025/nov/20/best-early-black-friday-deals-uk-2025-filter-tested\">Continue reading...</a>",
  "published": "Thu, 20 Nov 2025 20:20:53 GMT",
  "url": "https://www.theguardian.com/thefilter/2025/nov/20/best-early-black-friday-deals-uk-2025-filter-tested",
  "source": "The Guardian"
}