{
  "title": "'Privilege, not a right': UK plans to make some legal migrants wait 20 yrs - all you need to know",
  "text": "Crackdown amid political pressure\n\nLonger waits for indefinite leave to remain\n\nConcerns over migration 'scale'\n\nReform UK pushes further Right\n\nAlbanian leader slams 'Far-Right rhetoric'\n\n\n\n\n\nBritain’s Labour government plans to require some legal migrants to wait up to 20 years before applying for permanent settlement, Home Secretary Shabana Mahmood announced on Thursday. The move is part of a broader strategy to curb legal migration and follows recent changes to rules governing irregular arrivals.The dual tightening of legal and irregular migration rules comes as public support grows for the hardline Reform UK party, led by anti-immigration campaigner Nigel Farage, and amid concerns over pressure on overstretched public services.“To settle in this country forever is not a right, but a privilege, and it must be earned,” Mahmood — herself the daughter of immigrants — told parliament.The government had already signalled plans to double the qualifying period for Indefinite Leave to Remain (ILR) from five to 10 years. On Thursday, Mahmood set out additional steps: migrants using regular routes who have claimed benefits for more than 12 months will face a 20-year wait for ILR. For those entering irregularly, the waiting period rises to 30 years.Some low-skilled workers on post-Brexit health and social care visas, as well as migrants with under 12 months of benefit claims, will face a 15-year wait.Doctors, nurses and other public service workers can still qualify after five years, while high earners may become eligible in three, the interior ministry said.The proposals, now open to a 12-week consultation, are intended to take effect from next April.Mahmood said migration would “always be a vital part of Britain’s story” but argued the recent “scale” of arrivals had been “destabilising.” Government estimates suggest that roughly 1.6 million people could become eligible for ILR between 2026 and 2030 due to rising net migration.Under the new rules, ILR applicants must have a clean criminal record, high-level English proficiency, no debts and at least three years of social security tax payments. ILR status allows individuals to live, work and study in the UK without restriction and is a key step toward citizenship.Reform UK -- which has led Labour in some polls this year -- has pledged to abolish ILR altogether and make migrants reapply for visas every five years, including those already granted permanent status. Mahmood stressed that Labour’s proposals would not affect people who currently hold settled status.Earlier in the week, she announced reductions in refugee protections and threatened visa bans for countries refusing to take back irregular migrants arriving by small boats. These measures have drawn criticism from refugee groups and triggered concern within Labour’s left flank.Albanian Prime Minister Edi Rama accused Mahmood of echoing “the rhetoric of the populist far-right” and engaging in “ethnic stereotyping” after she highlighted “700 Albanian families living in taxpayer-funded accommodation having failed their asylum claims.”",
  "summary": "",
  "published": "Fri, 21 Nov 2025 09:40:17 +0530",
  "url": "https://timesofindia.indiatimes.com/world/uk/privilege-not-a-right-uk-plans-to-make-some-legal-migrants-wait-20-years-all-you-need-to-know/articleshow/125476411.cms",
  "source": "Times of India"
}