{
  "title": "Pressure mounting from farmers, Madhya Pradesh rolls back land pooling scheme at Simhastha",
  "text": "Following months of simmering anger against Madhya Pradesh Chief Minister Mohan Yadav’s ambitious land pooling scheme for the Simhastha fair area in Ujjain, the state government has cancelled it following mounting pressure from the Bharatiya Kisan Sangh, just hours before a threatened mass agitation was set to paralyse the region.\n\nThe climbdown marks a significant setback for what was envisioned as a flagship infrastructure project spanning 3,360.6 hectares, with 2,344.11 hectares included in the development plan. Simhastha hosts a mega religious mela every 12 years. The Ujjain Development Authority had planned to use the land pooling mechanism to create comprehensive infrastructure, including roads, water supply, sewage lines, electricity networks, and gardens, along with facilities for akharas, ashrams, and devotees attending the religious fair.\n\nOn Monday morning, Yadav personally met with the Kisan Shakti administrative office of the Bharatiya Kisan Sangh at his personal residence in Bhopal to negotiate with the organisation’s leadership. The farmers’ body had scheduled a “Dera Dalo, Ghera Dalo” (camp and siege) agitation at the Ujjain Collector’s office for Tuesday, November 18, threatening to bring the Malwa region to a standstill.\n\nAccording to the BKS leaders, the central leaders presented four non-negotiable demands to the Chief Minister: withdrawal of the Land Pooling Act in the Simhastha area, cancellation of the Gazette notification under town development schemes TDS 8, 9, 10, and 11, withdrawal of all cases registered against farmers, and a ban on permanent construction in the Simhastha zone.\n\n“The central leaders of the Kisan Sangh clearly stated that the Land Pooling Act in the Simhastha area must be withdrawn, no permanent construction should take place in the Simhastha zone, the festival should be organised as earlier, and all cases registered against farmers should be withdrawn,” said senior BKS leader Rahul Doot.\n\nThe delegation, which included Regional Organisation Minister Mahesh Choudhary, Malwa Province General Secretary Ramesh Dangi, Province Minister Bharat Singh Bais, and Malwa Province Organisation Minister Atul Maheshwari, secured the government’s acceptance of all demands.\n\nChief Minister Yadav subsequently directed the Urban Administration and Development Department and the district administration to issue the necessary cancellation orders. The meeting was also attended by senior MLA and BJP state president Hemant Khandelwal, and MLA Anil Jain Kalukheda. Said a senior government official, “We want to develop the region for the Simhastha fair, taking all the important stakeholders along. This government listens to everyone…”\n\nStory continues below this ad\n\nLeaders from the BKS and local government officials informed that intelligence reports from 18 districts appear to have played a crucial role in forcing the government’s hand.\n\nThe assessments painted an alarming picture of what the Tuesday protest could unleash.\n\nThe Kisan Sangh noted that “thousands of farmers from 18 districts were preparing to stay for an extended period with their own supplies”. The reports warned that thousands of tractors would converge on Ujjain, with farmers carrying bedding and food supplies. Social media activity suggested farmers could become aggressive if their demands went unmet.\n\nThe cancelled project had proposed a controversial land distribution formula: 50 per cent of the pooled land would remain with farmers, 25 per cent would be allocated for roads, drainage, streetlights, and electricity, 5 per cent for parks with recreational facilities, 5 per cent for essential services including hospitals, schools, and parking, and 15 per cent for Kumbh-related activities. Farmers, however, viewed the scheme as a thinly-veiled land grab that would permanently alter the character of the sacred pilgrimage area.",
  "summary": "",
  "published": "Tue, 18 Nov 2025 01:40:20 +0000",
  "url": "https://indianexpress.com/article/india/pressure-mounting-from-farmers-madhya-pradesh-rolls-back-land-pooling-scheme-at-simhastha-10371510/",
  "source": "India | The Indian Express"
}