{
  "title": "Doctor, wife detained for ‘misusing position, radicalising youth’",
  "text": "IN A fresh case filed by the counter intelligence wing of the Jammu and Kashmir Police, a doctor and his wife from south Kashmir are being investigated for their alleged involvement in “recruitment” to terror ranks.\n\nThe Counter Intelligence Kashmir (CIK) conducted coordinated searches across three districts of the Valley — Srinagar, Kulgam and Anantnag — on Tuesday .\n\nThese searches, carried out with warrants issued by the designated court under the NIA Act, are part of an ongoing crackdown against social media “abusers” operating in connivance with handlers across the border, “who have been deliberately engaged in furthering terrorist, secessionist, and separatist agendas”, said the police.\n\nPolice sources said the couple was detained in the raids for their alleged involvement in “glorifying terrorists and radicalisation” with the aim of recruitment into terrorist ranks. No formal arrest has been made so far.\n\nAccording to the police, by “leveraging” their professional status and societal standing, the involved individuals were allegedly using social media platforms to spread disinformation, incite violence and disturb public order.\n\nThe CIK teams seized multiple digital devices and “incriminating” material having direct relevance to the investigation. The recoveries include five mobile phones, five SIM cards, one tablet device and additional digital and documentary evidence.\n\nPolice said the doctor, a government employee, was found engaging in “online unlawful activities, misusing his official position to engage in behaviour detrimental to public order and national security”.\n\nStory continues below this ad\n\nPolice said his wife has been involved in “radicalising local women through curated online and offline engagements, pushing divisive narratives, and influencing vulnerable groups under the pretext of community interaction”.\n\nHer affiliation with the banned ‘Dukhtaran-e-Milat’ is currently under investigation. “This dimension of the case highlights a concerning trend of exploitation of social roles and professional facades to advance disruptive agendas,” CIK officials said.",
  "summary": "",
  "published": "Wed, 19 Nov 2025 00:45:51 +0000",
  "url": "https://indianexpress.com/article/india/doctor-wife-detained-for-misusing-position-radicalising-youth-10373420/",
  "source": "India | The Indian Express"
}