{
  "title": "Surf's down! Munich, until now an inland surfing hotspot, has lost its biggest wave",
  "text": "Surf's down! Munich, until now an inland surfing hotspot, has lost its biggest wave\n\ntoggle caption Malin Wunderlich/Getty Images\n\nMUNICH — \"It was gnarly. Dangerous. Only the most experienced could surf it,\" says Jakob Netzer of what local surfers have come to call the \"E1,\" an ever-churning wave along a mountain stream that flows through central Munich — a swell that non-surfers and tourists know as the Eisbachwelle or \"ice stream wave.\"\n\n\"And it's very sad the wave is not working,\" says Netzer, staring at where the wave once regularly appeared, just below a bridge that marks the entrance to the city's English Garden.\n\nIn early November, as city engineers finished dredging the bottom of the Eisbach — a two-kilometer-long (1.2-mile) canal that is a side arm of the Isar River — they opened the floodgates to find the Eisbachwelle, typically a 1.5-meter (4.9 feet) high summit of icy river water, had transformed into a small, nondescript whitewater bump along a raging waterway.\n\nSponsor Message\n\n\"It's usually three sections,\" says Netzer, who has surfed the Eisbachwelle for years. The wave stretches across all three. \"On the far side, you jump in and there are these bumps, and then in the middle, you have a nice, smoother place where you can surf, but it's not easy, because you have to anticipate the sections and know where to make the turns.\"\n\ntoggle caption Michaela Stache/AFP via Getty Images\n\nNetzer recalls the first time he surfed the wave, at the age of 17. \"I was working in a bar and one of my bar colleagues took me to go on the Wave in the middle of the night after our shift ended,\" he remembers. \"I actually didn't think much about it, I just did it.\"\n\nIt was the beginning of a surfing addiction, says Netzer. He's regularly surfed both E1 and its less challenging sibling E2, further downstream, ever since — come rain, shine, or snow, when he dons his full-body wetsuit.\n\nFellow surfer Alexander Neumann of the Munich River Surfers' Association says over the years, the city's engineers have routinely dredged the Eisbach canal — but they did so with greater scrutiny this year due to the drowning death of a surfer on the Eisbachwelle last April.\n\ntoggle caption Malin Wunderlich/picture alliance via Getty Image\n\n\"They wanted to find if there are any danger zones where people could get stuck,\" he explains. \"So they took a bit too much out, which used to still lay on the ground of the wave, and the wave is not forming properly now.\"\n\nSponsor Message\n\nIn response to questions about how the city of Munich is addressing the disappearance of the Eisbachwelle, spokesperson Susanne Mühlbauer issued a statement to NPR: \"For Munich, the Eisbach wave is a symbol of urban sports and leisure culture, as well as a globally unique and popular tourist attraction that complements and rounds off the city's range of sights in an outstanding way — and that's why Munich Tourism hopes the Eisbach wave will return quickly.\"\n\ntoggle caption Rob Schmitz/NPR\n\nDown the street from where the Eisbachwelle used to exist, at the Technical University of Munich, hydrology professor Markus Disse opens up a textbook to a chapter on hydraulic jumps, a hydrological phenomenon that occurs along a fast-moving waterway like the Eisbach, which creates a surfable wave. Disse says a wave like the Eisbachwelle requires a certain water speed combined with a \"bump\" of sediment on the bottom of the stream.\n\nDisse says he thinks the city likely removed that underwater bump. \"They did their job too good,\" he says, smiling.\n\nHow to resurrect the Eisbachwelle? \"I would play around with the discharge,\" says Disse. \"Perhaps they should try lowering the discharge, wait half an hour, then you see the effect, and you could do a series of experiments.\"\n\nDisse says if that doesn't work, then Munich authorities should attempt to dump gravel into the canal to re-create the \"bump\" of sediment that likely created the wave in the first place.\n\nBack on the banks of the Eisbach Canal, Neumann watches an engineering team from Hamburg — hired by the city of Munich to study why the wave disappeared and in charge of bringing it back — fasten GPS and sonar equipment to a boogie board before they let it go into the river to test water flow and graph the underwater structure of the riverbed.\n\ntoggle caption Rob Schmitz/NPR\n\nHe says he trusts that the city has the surfers' best interests in mind. Surfing along this stretch of the canal — which was owned until 2010 by the state of Bavaria — used to be illegal until the city stepped in and initiated a land swap with Bavaria in order to legalize surfing along the Eisbachwelle.\n\nSponsor Message\n\nThe city's tourism board includes the site in its marketing, and Neumann says the Eisbachwelle has become an integral part of the city.\n\nStill, surfers have become impatient with the pace of the work to resurrect the wave. A week after it disappeared, Neumann says, a group of surfers submerged a wooden ramp where the wave once stood, and for a day, the wave came back. However, authorities deemed the ramp an illegal structure and removed it. The city continues to work on a solution.\n\nEsme Nicholson contributed to this report from Berlin.",
  "summary": "Munich's famous river wave, the <em>Eisbachwelle,</em> vanished after a dredging in early November. Authorities are working to resurrect the beloved wave but impatient surfers have also tried their own methods.",
  "published": "Thu, 20 Nov 2025 10:19:32 -0500",
  "url": "https://www.npr.org/2025/11/20/g-s1-98250/germany-munich-surfing-eisbach-eisbachwelle-e1-wave",
  "source": "NPR Topics: News"
}