{
  "title": "Inside Florida's 2025 national title rings: 36 wins, one statement",
  "text": "Open Extended Reactions\n\nOn Wednesday, the Florida Gators unveiled their rings for the 2025 men's NCAA championship, where they defeated then-top-ranked Houston 65-63. They were led in the title game by Will Richard, now a guard for the Golden State Warriors, who had 18 points and eight rebounds.\n\nFlorida's championship bling includes nods to the national championship game itself, the program's tournament history and traditional school branding.\n\nTwelve stones -- including a supersized one on top -- form the national championship trophy and represent the Gators' comeback win in the title game, where they faced a 12-point deficit in the second half.\n\nHovering over the trophy is Florida's signature \"Gators\" lettering, outlined in blue.\n\ndown to the details\n\n\n\npresented by @ShopIDC pic.twitter.com/VKj0aZ3VKm — Florida Gators Men's Basketball (@GatorsMBK) November 20, 2025\n\nThe national championship logo is on the left side of the ring with three diamonds representing the three national titles Florida has won. Before its 2025 title, Florida won national championships in 2006 and 2007. The final score of the championship game is under the logo.\n\nOn the inner ring is the Gators' team motto: \"We all can go.\"\n\nFlorida's SEC championship trophy is on the right side with five stones, representing the program's five conference titles (2005, 2006, 2007, 2014, 2025), and the score of its 86-77 SEC title win over then-No. 8 Tennessee. The team's 36-4 season record is displayed just under the trophy.\n\nThe inner latch displays the Gators' road to their title, including the scores and opponents they defeated. Six orange stones are above Florida's road, representing the program's six appearances in the Final Four, with three blue stones under the road that pay homage to its three national championships. Thirty-six stones surround the championship elements depicting each Florida win in the 2024-25 season.\n\nA gold Fighting Gator logo is on the inside of the ring, just above a depiction of the Stephen C. O'Connell Center -- where Florida plays its home games.\n\nFlorida's coaches made it a priority to deliver the rings to their former players who are currently playing in the NBA. On Tuesday, Gators associate head coach Korey McCray gave Utah Jazz guard Walter Clayton Jr. his ring ahead of his matchup against the Los Angeles Lakers.\n\n\"Obviously, my time at Florida helped me get to where I am now,\" Clayton said as he accepted the ring.\n\nFlorida assistant coach Taurean Green surprised Toronto Raptors guard Alijah Martin with his ring, and head coach Todd Golden and associate head coach Carlin Hartman presented Richard with his jewelry ahead of the Warriors' film session.\n\n\"Won one of these in college -- looking forward to winning one here,\" Richard said.",
  "summary": "Florida's championship rings feature significant nods to the national title game, its iconic season and program history.",
  "published": "Thu, 20 Nov 2025 19:46:15 EST",
  "url": "https://www.espn.com/mens-college-basketball/story/_/id/47040779/florida-gators-2025-national-championship-ring",
  "source": "www.espn.com - TOP"
}