{
  "title": "NASA really wants you to know that 3I/ATLAS is an interstellar comet",
  "text": "Since early July, telescopes around the world have been tracking just our third confirmed interstellar visitor, the comet 3I/ATLAS—3I, for third interstellar, and ATLAS (Asteroid Terrestrial-impact Last Alert System) for the telescope network that first spotted it. But the object’s closest approach to the Sun came in late October during the US government shutdown. So, while enough people went to work to ensure that the hardware continued to do its job, nobody was available at NASA to make the images available to the public or discuss their implications.\n\nSo today, NASA held a press conference to discuss everything that we now know about 3I/ATLAS and how NASA’s hardware contributed to that knowledge. And to say one more time that the object is a fairly typical comet and not some spaceship doing its best to appear like one.\n\nExtrasolar comet\n\n3I/ATLAS is an extrasolar comet and the third visitor from another star that we’ve detected. We know the comet part because it looks like one, forming a coma of gas and dust, as well as a tail as the Sun heats up its materials. That hasn’t stopped the usual suspect (Avi Loeb) from speculating that it might be a spacecraft, as he had for the earlier visitors. NASA doesn’t want to hear it. “This object is a comet,” said Associate Administrator Amit Kshatrya. “It looks and behaves like a comet, and all evidence points to it being a comet.”\n\nThe extrasolar descriptor comes from the shape of its orbit. The orbit’s shape is measured by eccentricity; an eccentricity of zero is a perfect circle, and that shifts to ever-narrower and longer ellipses as the eccentricity rises. By the time it hits one, gravity is no longer able to bend the far end of the ellipse closed. Instead, an object will trace a very narrow parabola—think something shaped like the business end of a champagne glass—before it escapes the gravitational clutches of the Sun and heads off into the galaxy.",
  "summary": "A rundown of what we know of the third extrasolar object we've identified.",
  "published": "Wed, 19 Nov 2025 22:44:20 +0000",
  "url": "https://arstechnica.com/science/2025/11/nasa-really-wants-you-to-know-that-3i-atlas-is-an-interstellar-comet/",
  "source": "Ars Technica - All content"
}