{
  "title": "The 53 Best Deals From REI’s 2025 Holiday Sale",
  "text": "This year marks a decade of REI's observance of the consumer high holy day, Black Friday. For the past 10 years REI has shut its doors for Black Friday, suggesting that instead potential customers should get outside and enjoy the world around you. That's great advice, but of course Black Friday is also one of the biggest retail spending days of the year, and REI is a for-profit co-op—what to do? Have your holiday sale early, of course.\n\nThis year the REI Holiday Sale runs from November 14 to 24. There are two member-exclusive coupons with the Holiday Sale. The first is for 20 percent off a regular-priced item at REI, the second is 20 percent off any item at REI Outlet. Many of the best REI deals this year are on the company's house brand gear, but we've also pulled in deals from competing sales at Backcountry, Six Moon Designs, Zenbivy, and other cottage industry retailers. Below are the best deals on all our favorite tents, backpacks, sleeping bags, pads, cookware, outdoor apparel, and more.\n\nNot sure what you need? Check out our many outdoor gear guides, including guides to the best backpacking tents, best sleeping bags, best sleeping pads for backpacking, best base layers, best merino wool clothes, best rain jackets and many more for all our well-tested picks.\n\nUpdated November 19: We've added a new section on tent deals, as well as some new deals on travel pants, sleeping pads, Yeti coolers, and plenty more.\n\nWIRED Featured Deals\n\nBackpack Deals\n\nPhotograph: Scott Gilbertson\n\nThe Flash 22 is possibly the best value daypack on the market, especially now, on sale. This is a very lightweight, minimalist pack, but it's surprisingly comfortable. It'll handle loads up to 15 pounds without straining your shoulders, and the side stash pockets are large enough for a Nalgene bottle or rain jacket. The Flash 22 is made of 70-denier recycled ripstop nylon, which is on the lighter side, but mine has held up well, even on some rough cross country hikes in the North woods.\n\nThe ultralight cousin to the Flash 22, the Flash 18 lacks the hip belt, side stash pockets, and floating lid. The result is a stripped-down, bare-bones pack that we like because you can stuff it in your carry-on, and have a nice backpack whenever you need it. Don't load it up with more than 8 pounds of gear, and avoid anything with pointy bits, as there's no padding here, but so long as you recognize its limitations, this is a great little pack.\n\nThis no-nonsense day pack is comfortable with loads up to about 10 pounds, and has plenty of pockets for organizing your gear. The ripstop nylon body fabric is DWR coated and the back is better padded and stiffer than the Flash packs above, making it overall bit more substantial. The U-shape access panel is nearly identical to Mystery Ranch's Ripruck series, with two zipper sliders to give you quick access to the main compartment. There's also a zip pocket just under the top to give you a place to stash keys and small items. The side pockets are big enough for a Nalgene bottle and the daisy chains on the bag give you somewhere to clip extra stuff if you need to.\n\nThis travel backpack from Six Moon Designs makes it so you no longer have to pick between optimizing for air travel or carrying long distances at your destination. It's the only bag I've used that maximizes your allotted carry-on space while remaining comfortable for a walk across a mid-sized European city or even a day on the trail. The bag's square shape and suitcase handle make it easy to show the flight crew you're compliant, but once you deplane, you have adjustable shoulder straps built by a brand that makes gear for serious backpackers. There's also a padded harness with water bottle holders and a zipper pouches for Clif Bars or a flashlight. —Martin Cizmar\n\nPhotograph: Scott Gilbertson\n\nIf I were going to live out of a single bag—traveling the world for the rest of my life—this is the bag I would bring. The GR2 is a gear-hauling monster with a ton of built-in organization options. This deal is on the 40L version, which I think is the perfect size for #onebag travel. It still manages to qualify as a carry-on bag for US flights (you may have trouble with that overseas though). The 34L waxed canvas version is also on sale for $340 ($115 off). And yes, it can double as a rucker, though there are better options if that's your main use case. See below.\n\nThis deal is only on a couple of colors, and only the X-Pac fabric, but this is the cheapest we've seen the GR1 go for in quite some time. The GoRuck GR1 (7/10, WIRED Review) is the pack that launched the company, and it’s still the best and most versatile of the GoRuck lineup. This deal is on the smaller 21L pack, which I think is the perfect size for rucking, everyday carry, and weekend trips. I have lived out of the 21L bag (with a shoulder bag for my camera gear) during a weeklong trip. It was a squeeze, but it worked. The 21L GR1 is deceptively large and always seems to swallow more gear than I think it can.\n\nIf rucking is your thing, this is the GoRuck to get. It's very close to the GR1 in size, layout, and fabric options, but the Rucker adds more handles, one on each side. The handles are so that the Rucker can be used as a weight (or kettlebell) in workouts. The interior has a Ruck Plate pocket for holding weight (the 20L version can handle up to 3-pound plates while the 25L can do up to 45-pound plates). The interior pockets are the same as the GR1, but instead of zippers, you get Velcro closures.\n\nOddly enough, for someone who isn't a big fan of lumbar packs, this is probably my most used bag. It's our top pick for all-day adventures thanks to its array of pockets. The Tour is loaded with stash spaces, allowing my to carry camera, binoculars, snacks, rain jacket, and more. Thanks to the shoulder strap (sold separately, $14) and the ability to tuck away the belt, the Tour can also be used as a shoulder bag. I even modified mine with a couple extra loops to secure it to the handlebars of my bike.\n\nTent Deals\n\nPhotograph: Scott Gilbertson\n\nSix Moon Design's Lunar Solo (7/10, WIRED Review) is my favorite single-wall ultralight solo tent. It's not without its quirks (read the pitching tips), but if you want something more than a tarp, that still weighs just 26 ounces (740 grams), this one is hard to beat. It's well ventilated for a single-walled tent, with the ability to raise up the front door when weather is nice. I also like that it only needs one trekking pole (or one pole if you don't hike with trekking poles). You'd be hard-pressed to find a tent even half this nice at this price.\n\nThe Big Agnes Copper Spur tents are a perennial favorite around the WIRED office. Well, actually none of us work in an office, but we still love the Copper Spur. The only one on sale at REI this year is this, the monstrous five-person version. I have not tested this model, however I have taken my three kids backpacking in the four-person version and very much wished I had this one. As with most backpacking tents, the Copper Spur's are more comfortable when you get one more person worth than you need. The miraculous thing about this five-person model is that it somehow only weighs 7 pounds, 5 ounces, which is not bad at all if you're distributing it among four people. Note that this is an REI Outlet deal, which means members can get an additional 20 percent off with the coupon HOLIDAY2025, bringing the sale price down to $467, which is a crazy good deal for this tent.\n\nThank you Public Lands for stepping up to put the two-person version of the Copper Spur on sale. It's currently our top pick for lightweight freestanding backpacking tents, and it's been a popular choice with readers for years. This is a high-quality, well-designed tent that's lightweight, easy to set up, and roomy enough to be livable in the backcountry. The “awning” design (with trekking poles or sticks) is a nice extra, and the mix of 15D nylon and 20D ripstop, while it feels fragile, has held up well over time.\n\nSea to Summit’s “3-plus season” tents are capable enough in almost any weather while staying crazy light—just 3 pounds, 12 ounces for this two-person model. I used the three-person version on a five-day trip to Loon Lake in northern California in early October, a true “shoulder season” trip with daytime highs in the 80s, nighttime lows in the 40s, and overnight winds of up to 60 mph. My favorite design detail is that the pole bag is kept rigid by an insert of opaque white plastic. Clip it to the tent’s ceiling, pop in your headlamp, and illuminate your abode. —Michael Calore\n\nPhotograph: Scott Gilbertson\n\nNemo's Dagger Osmo line of tents are reasonably light with roomy interiors and have proved very storm-proof in my testing. The three-person version has long been my tent of choice for trips with my kids. Setup is simple thanks to the single main pole design (which forks at each end) with a cross pole in the middle. There are two spacious vestibules for storing gear, and if you leave the rain fly off, the mesh room is excellent for stargazing.\n\nThe Nemo Mayfly is a three-season backpacking tent with a trail weight of 3 pounds, 8 ounces for the two-person version I tested. Split between two people, each is carrying under 2 pounds. The Mayfly uses a semi-freestanding design to keep weight down, which does mean you have to stake out the foot end. It's on the small side as well, at 27.9 square feet of living space, with two 7-square-foot vestibule areas. I find it plenty livable for two, and the cross pole gives you a wider roof area than most tents this size. I love the white mesh (instead of black) and the super simple clips that keep the rain fly secured.\n\nCamping and Backpacking Deals\n\nPhotograph: Scott Gilbertson\n\nI rarely bring a chair backpacking, but if I did, the Nemo Moonlite Elite would be in my pack. At 18 ounces, it's one of the lightest chairs around, and it packs down nice and small. It's comfortable and reasonably stable. Nemo also solved the main problem with all pole chairs; The included base pad keeps it from sinking into soft ground.\n\nThe Flexlite Air camp chair is a great example of the promise of REI brand gear: It offers 90 percent of the designer item, for 70 percent of the price. It's not quite as nice as the Nemo above, but it's still comfortable (it does wobble a little, side to side when you move) and it's nearly half the price.\n\nThis chair is the coziest way to hang out around camp. It is somewhat huge, heavy, and awkward to fold up and carry, but it's all worth it once you cram everyone you love on it in front of a fire. The even bigger and more awkward three-person version is also on sale for $108 ($71 off).\n\nI've noticed that, when trying to lighten their load with a smaller, lighter backpack, people then struggle to fit all their gear. The answer for sleeping bags and clothing is this compression stuff sack, which smashes anything soft down to about half the size of the same item in a regular stuff sack. This works well with sleeping bags and clothing, especially puffer jackets, but also fleece and merino wool.\n\nPhotograph: REI\n\nThe Petzl Tikka is the best headlamp you can buy. I've had the same Petzl Tikka for 14 years, and it's still going strong. The Tikka is not the brightest, topping out at 450 lumens, but it's plenty of light to cook by in the backcountry. There are three light modes: bright, brighter, and brightest. There's also a red light mode to retain some of your night vision. The Tikka runs on three AAA batteries (we recommend Panasonic Eneloop rechargeable batteries) and lasts over 5.5 hours.\n\nI have never slept so well camping as I have on this mat. Technically I have the car-friendly model, but in terms of comfort, they're the same. In our guide to car camping pads the Therm-a-rest MondoKing edges out the Megamat for top pick among the monster sleeping pads, but I prefer the Megamat for it's extra warmth (it has an R-value of 8.1 to the MondoKing's R 7.0) and the soft texture of the top. It's comfortable enough to sleep directly on the Megamat.\n\nIf you want just one pad that's plush enough for car camping yet reasonably lightweight (2 pounds, 2 ounces for the regular size linked here) and small enough for backpacking, this is the pad to get. That's why it's our favorite sleeping pad for car camping. There are lighter pads, there are comfier pads, but the Comfort Plus sets itself apart by being able to gracefully slip between those worlds.\n\nIf you're camping with a buddy and you want to snuggle up at night, this plush two-person sleeping pad is our top pick. The 5R rating means it's made for cold weather, but even cinched into its included stuff sack, it's fairly large and heavy, so it's best for car camping, canoe camping, or any situation where you don't have to haul it in a pack. (For summer backpacking, consider the lighter three-season 3R version, also on sale.) Each side has its own valve, so both sleepers can use the included inflation bag to pump up the pad to their desired firmness. —Michael Calore\n\nPhotograph: Ryan Waniata\n\nThe Yeti Hopper Flip 12 is a nice little personal-size cooler. Hopper Flip 12 closes with a water proof zipper, which has never leaked on me thus far. With 12 quarts of capacity, it's not huge. Think a six pack and sandwich, depending on what you use to keep things cold (ice packs are the way to go with this one).\n\nStove and Camp Cooking Deals\n\nPhotograph: Scott Gilbertson\n\nMy favorite stove for actually cooking real food in the backcountry, the Firebox Nano is a titanium (or steel, but I highly recommend titanium) shell that you can fit with an alcohol burner like the Trangia Spirit burner, or an isobutane burner. You can also use wood to cook directly over flames the way your ancestors did, and you should. For backpacking, with its frequent and pesky burn bans, the Firebox Gas Burner with its diffusion plate is hands down the best backcountry cooking system. It won't win you any prizes at the next /r/Ultralight get-together (the Firebox Nano on its own weighs 4.25 ounces for the titanium version), but you could be eating some delicious food in the backcountry.\n\nThe Stash is our favorite all-in-one backcountry cook system. The heat diffuser design is what speeds up boil times (Jetboil claims 2.5 minutes, which I was only able to match indoor in still air), but the real appeal here to me is the way this kit all packs down into itself. For weekend trips, this is the simplest system I've tested when it comes to cooking for two.\n\nCamp Chef's Explorer 2 is similar to our favorite Camp Chef stove, the Pro 60X. It's slightly less powerful, but it's still free-standing, ruggedly built, and cooks extremely hot. It's a wonderful stove to cook on, and I know more than a few river guides who swear by it. Your giant pot of water for spaghetti noodles will boil in no time, though it's not great for simmering. If you want to use a griddle, or simmer a sauce, pick up the heat diffuser. It's overkill in most circumstances, but for large groups, like a scout troop or guided trip, it's the best choice, hands down.\n\nPhotograph: Scott Gilbertson\n\nOur favorite way to avoid those green propane bottles is this propane growler. The Ignik Deluxe is a 1.2-pound propane tank with a nice padded/insulated sleeve and a handy strap for carrying. It makes your camp setup look much nicer than a bare tank. It also saves your shins during those inevitable run-ins with cold hard steel that come from lugging around a big propane tank. This size is the equivalent of five green propane bottles.\n\nOutdoor Apparel Deals\n\nCourtesy of REI\n\nThis is still the best budget rain jacket you can buy. REI's Rainier Jacket is impressively waterproof and reasonably long-lasting for $70. The durable water repellent (DWR) is PFAS-free, but still pretty good. You also get taped seams and an adjustable hood, two nice features you generally don't find in jackets this cheap.\n\nREI's Sahara Shade Hoodie offers UPF 50+ fabric (a polyester and spandex blend) to protect you from that high-altitude sun (or any sun). It's soft and stretchy, so you have a good range of movement, and there are thumbholes in the sleeves to keep them from riding up and exposing your arms. The three-panel hood has a drawstring you can use the cinch it down and keep your neck covered as well. I do prefer merino sun hoodies, but they're double the price, if not more.\n\nThese are my favorite travel pants. I wore these for two weeks traveling to southeast Asia from the United States and for shorter business trips. In the darker black and navy colors, they look more professional and not quite so sporty. The majority cotton blend looks crisp and washes and wears well. The pants still look good after 15 straight hours of flying (and several years) but they still dry quickly after I spilled a full cup of apple juice on my lap (thanks, kids).The drawcord means that it's easy to adjust the fit, depending on whether you're airplane bloating or traveler's diarrhea. Also, there are a ton of pockets and they all either snap or zip closed, which means your phone or earbuds won't fall out when you've fallen asleep while watching Leap Year for the 400th time. They also come in a men's version.—Adrienne So\n\nPhotograph: Scott Gilbertson\n\nSmartwool's 100 percent merino Classic Thermal base layer is a nice, heavy 250-gsm merino, base layer, making it a great base layer for cold weather. It's our top pick heavyweight base layer. It fits looser, making it feel more like a comfortable shirt. The looser fit makes it possible to use this as a second base layer over something like Ibex Woolies when it's extremely cold (this combo is something I wear all the time here in Northern Wisconsin). The bottoms are also on sale (Men's/Women's).\n\nIcebreaker's 200 Oasis base layer is a 200-gsm base layer. This is about what most of us call a mid-weight base layer, making it a good choice for everything from cool weather hiking in the fall or spring, to skiing in the front country. The 100 percent merino fibers here are not quite as soft at the Smartwool above, but they're equally good at regulating body temperature and wicking away moisture. This is also the fastest drying merino top in our base layers guide.\n\nREI's base layers are a solid value. If you want one base layer to do it all and don't want to spend a fortune, these are the base layers to get. You can have a crew top and bottom for less than a single garment of merino or a brand name synthetic. This is the mid-weight version, which is 220 GSM (92 percent recycled polyester, 8 percent spandex). They're comfortable with a tight, but not overly tight, fit that makes them easy to layer over, and there's nice extras like thumb loops on the sleeves.\n\nThere are tons of neck gators out there, but this is my favorite (I actually have the slightly longer version, but this is close). Like most things merino it puzzles me how this keeps me warm in the winter, and keeps the sun off my neck in the summer without making me overheat. Somehow it manages this. These make great gifts for your outdoorsy friends too.\n\nThese Fjällräven pants are among my favorite hiking pants. The G-1000 fabric is 65 percent recycled polyester and 35 percent organic cotton. They've got pockets everywhere and extras like ventilation zippers, reinforced knees (with openings for pads), and a loop on the leg to hold a axe. Do your pants have a axe loop? Didn't think so. Note that Fjällräven recently changed the fit, so if you're an old school wearer of these, size up.\n\nHiking Tech and Fitness Deals\n\nPhotograph: Kieran Alger\n\nThis is a good deal on Garmin's most popular satellite messenger, but we always like to add the caveat that not everyone needs one. If you frequently hike alone, or do a lot of high alpine hiking and climbing, it's probably worth carrying. As with any satellite messenger, you will have to subscribe to a safety plan, in addition to buying the device itself. If you only go on one or two big trips a year, you might want to consider a personal locator beacon (PLB) instead.\n\nThe Instinct 3 is our favorite Garmin watch and this deal makes the solar version the same price as the regular. The Instinct line has all the backcountry functionality of the Fenix watches but it's much cheaper. This latest model includes a built-in flashlight and a metal-reinforced bezel with a scratch-resistant display and built to the durable MIL-STD 810 standard, meaning that’s undergone heavy thermal and shock resistance tests.\n\nGoPro's Hero 13 Black is our favorite GoPro for recording all your outdoor adventures. It has an interchangeable lens system to offer many more shooting options than other action cameras (in fairness Insta360 just added lenses to its Ace Pro 2, but we haven't had a chance to try those yet). In addition to the standard wide angle action camera lens you can also invest in an Ultra Wide ($90), Macro ($120), and Anamorphic ($120) lens. All of these are automatically detected by the Hero 13 the minute you attach them. The camera will automatically adjust settings to match the lens and let you get back to what you were doing. It's lots of fun and video quality is excellent.\n\nThese are our all-around favorite 8 x 42 binoculars. With the M5 Nikon has struck a nice balance between optical power, quality, and price. The roof prism design includes phase coatings and ED glass (Extra Low Dispersion Glass). The multi-coated glass cuts down on chromatic aberrations (distortion or color fringing sometimes seen around objects in bright sunlight), and the Monarch M5s give nice, bright views with very little distortion, making them excellent birding binoculars. The eyepieces have large (21 mm) eye lenses and they're deeply recessed in the eye cups, which allows for nearly a full field of view even when wearing glasses. They're also light enough that they can hang around your neck all day without bothering you too much.\n\nSleeping Bag and Quilt Deals\n\nPhotograph: Scott Gilbertson\n\nREI's Magma 15 is one of our top sleeping bags. It's warm (comfort rated to 21 degrees Fahrenheit) with a 15-denier nylon ripstop nylon shell (Bluesign approved, with a non-fluorinated DWR coating to keep moisture at bay). Baffles are variably spaced and not stitched through, which helps the fill stay put and minimizes cold spots. I also really like the Magma hood, which is warm and stays on your head throughout the night. There's a nice interior stash pocket I use to keep my headlamp handy.\n\nNemo's Forte 20 is a 30-degree (comfort rated) synthetic-fill sleeping bag, making it a good choice for summer. It's our favorite synthetic bag. What I like most about this bag, and nearly all of Nemo's sleeping bags, is the wider cut through the torso area down to the knees. This bag is almost a hybrid of a mummy bag and your father's good old 1970s square sleeping bag. Which is to say, this bag is roomy.\n\nWe're still working on a guide to backpacking quilts, but it will probably surprise no one to learn that this is our current pick for best value quilt. Like the Magma 30 sleeping bag, the Magma quilt is not the lightest, nor the warmest, but you get a lot, for not a lot. The 15-denier shell encloses 850-fill-power water-resistant goose down that's comfort-rated down to 30 F. Weighing just 1 lb. 6 oz for a long, the Magma is on the light side for the temp rating. The foot box uses a zipper and drawstring system to be either completely open and flat, or zipped up and cinched down like a sleeping bag on cooler nights.\n\nPhotograph: REI\n\nOur favorite sleeping bag for summer car camping, the Siesta isn't fancy, but hey, it's car camping. If all else fails, there's a car to retreat to. With that in mind, don't spend a fortune on a car camping bag if that's all you need. The Siesta gives you a nice, roomy, rectangular cut, and the 20-degree rating makes it enough for three-season trips. The bonus here is the hood, which you don't often find in this type of bag. If you don't need the hood, REI also has the new Campwell 30 degree bag on sale for $70 ($30 off).\n\nThink of a Rumpl blanket as if your sleeping bag had a baby with the coziest lap blanket that your grandma knitted for you. They're made from DWR-treated ripstop polyester, so they're sturdy, durable, and resist getting soaked or stained. But they're also soft and warm enough to fall asleep under on the couch, and they come in a wide variety of colors and patterns (unfortunately only a couple patterns are on sale right now). —Adrienne So\n\nPuffer Jacket and Winter Gear Deals\n\nIt's already snowed once where I live. Now's the time to score some new ski gear—jackets, helmets, gloves, and googles are all on sale.\n\nPhotograph: Scott Gilbertson\n\nWith an 850-fill-power goose down and a recycled ripstop nylon shell, this is one of the warmer jackets in our best puffer jackets guide. I like the zippered chest pocket (there are also two zippered hand pockets, one of which the jacket stuffs into), and at 12.5 ounces this jacket is surprisingly light for how warm it is. The front zip has a wind flap, and there's even a draft collar, something you hardly ever find in a puffer at this price. Even better, you can cinch the hood to keep cold air from blowing in the sides.\n\nOur favorite bargain three-season puffer jacket, the REI 650 down jacket isn't as warm as the Magma above, but it's hard to argue with this price. If you need a cheap, packable jacket for those cold summits or stargazing on chilly nights, this is the jacket to get. The stitched-through baffles mean this one isn't as warm and is more susceptible to wind, but at this price, it's worth buying.\n\nInitially I did not like the idea of a down vest. If it's cold enough to need a down jacket, my arms are probably cold too right? But then I moved somewhere cold (Why? I don't know, but I did) and realized there is an infinite variety of shades when it comes to cold. For some shades of cold, the vest is the right move. Pair it with a good base layer, maybe even a hoodie, and you have something that's warm, but leaves your arms free to swing an ax or whatever you might be doing.\n\nFjällräven's hybrid fill jacket uses 700-fill-power down for most of the jacket but adds recycled polyester insulation over the shoulders to help resist moisture. That later works quite well when the snow is really coming down. The hood does a good job of keeping you warm while staying out of your way thanks to two drawcord tabs at the front, and an elastic drawcord at the back. It also, as the name suggests, packs down pretty small.\n\nMountain Hardwear's Ghost Whisperer down jacket will be a pick in my next update for the Puffer Jacket Guide. It's one of the best technical down puffers I've tested -- thanks to the 800-fill down it's warm, light, and packs down small. The medium weighs just about 8 ounces on my scale, though it does seem to run a bit small, I had to size up to large, the medium was a bit tight. Unfortunately the men's version is pretty much sold out, though there are a couple size/color combos left. The jacket version, without the hood, is also on sale.\n\nPaddleboard and Kayak Deals\n\nPhotograph: Scott Gilbertson\n\nSure it's odd to be buying a paddleboard in November, when there's possibly snow on the ground (there is at my house), but a deal is a deal, and this is a good deal on one of our favorite Bote paddleboards. This large, stable SUP is great for beginners, it tracks well and despite the stability it's surprisingly nimble and easy to steer. If you go all-in on the accessories you can end up with a two-in-one kayak/SUP hybrid, which makes it more versatile.\n\nThe Isle Switch 3 is by far my favorite inflatable that I have tested. Do you want to paddle out in glassy, still water and lie on your belly with your dog and watch fish? Then it’s a big, solid, stable paddleboard with a grippy, soft surface perfect for puppy paws. Is there a bit of a breeze and you want to put the full force of your paddling muscles in play? Slip the hooks into the eyes and tighten the straps to put on a big, comfy seat and foot brace. (I used mine as a seat for the kids behind me.) Even the paddle converts from an SUP paddle to a kayak paddle. I can’t believe I’ve never tried one of these before. This deal includes a free electric pump. —Adrienne So\n\nThe Breeze Aero inflatable paddleboard (7/10, WIRED Recommends) is well-built and durable, and it packs up reasonably small. It's also one of the stablest paddleboards I've tried, making it a good choice for beginners. It's easy to unpack and easy to use. Inflating is something of a chore with the hand pump, but once it's deflated, it's not hard to stow it away. This deal is on the 11'6\" model (which supports up to 355 pounds).\n\nI have never actually tried one of Oru's folding kayaks, but my editor and fellow gear tester Adrienne So loves them. The Inlet is one of Oru's beginner models, but with room to grow as you you get more comfortable with it. It's light and fast, and folds origami-style into a box that's 42\" x 10\" x 18\", a bit like an oversized briefcase and still plenty small enough to fit a couple in your trunk. It weighs just 20 pounds and can hold one person up to 6'2\", 275 pounds.\n\nPower up with unlimited access to WIRED. Get best-in-class reporting and exclusive subscriber content that's too important to ignore. Subscribe Today.",
  "summary": "The company that wants you to #optoutside for Black Friday is having its sale early. Gear up for next year with these great deals on packs, sleeping bags, merino wool, and more.",
  "published": "Wed, 19 Nov 2025 20:22:41 +0000",
  "url": "https://www.wired.com/story/rei-holiday-sale-nov-2025/",
  "source": "WIRED"
}