{
  "title": "She Studied How to Protect Children From Pollution and Heat",
  "text": "Lost Science is an ongoing series of accounts from scientists who have lost their jobs or funding after cuts by the Trump administration. The conversations have been edited for clarity and length. Here’s why we’re doing this.\n\nI’m a professor of environmental health at Drexel University. I study how the impacts of pollution can differ because of a person’s surroundings and individual circumstances. This will be an important influence on children’s health as the climate changes, an area that I have focused on in recent years.\n\nI had a grant from the Environmental Protection Agency to identify the relationships between heat, pollution and children’s health in New York State. It’s an important case study because New York State includes the most and least populated areas in the country, like Manhattan and the Adirondacks.\n\nInstead of looking at things that can cause stress, like income inequality, and how those can make the effects of heat and pollution worse, we were trying to identify the resources in communities where children appear to be less affected by heat and pollution. This information can help identify the most cost-effective changes communities can make to protect their children.\n\nWe combined data on 22 million child emergency department visits and hospitalizations with U.S. census information. We also considered a wide range of community factors not included in those data sets — everything from supermarket locations, transportation access, voter registration and broadband access. A Ph.D. student in my lab reached out to 350 school districts in the state. So a lot of groundwork was done to build up a really complicated and huge database that represented a massive number of children statewide.",
  "summary": "“There was no warning, no conversation,” said Jane Clougherty, an environmental health scientist, who had a federal grant canceled earlier this year.",
  "published": "Thu, 20 Nov 2025 10:00:05 +0000",
  "url": "https://www.nytimes.com/2025/11/20/climate/children-heat-pollution.html",
  "source": "NYT > World News"
}