{
  "title": "Eating an array of smaller fish could be nutrient-dense solution to overfishing",
  "text": "To satisfy the seafood needs of billions of people, offering them access to a more biodiverse array of fish creates opportunities to mix-and-match species to obtain better nutrition from smaller portions of fish.\n\nThe right combination of certain species can provide up to 60% more nutrients than if someone ate the same quantity of even a highly nutritious species, according to an analysis by Cornell University researchers.\n\n\"This research hopefully highlights the importance of biodiversity, not just because of a moral quandary that we're causing a mass extinction on Earth, but also because biodiversity can lead to better outcomes for fishery sustainability,\" said first author Sebastian Heilpern, a postdoctoral fellow who has done previous research related to this in the Amazon River.\n\nIn the study, Heilpern and colleagues began by identifying a list of fish species that people are known to consume. Heilpern cross-checked it with existing nutrient content data for each species. From there, researchers determined the fish species that are found in every country or territory on Earth. The biogeographic and nutrient data was then fed into a computer model.\n\n\"We can then ask, out of all these combinations of potential options of species, which ones could we select and how much of each, in a way that would provide us with sufficient nutrition to meet a person's diet [needs] with the lowest amount of fish biomass,\" Heilpern said.\n\nThe model revealed that when fisheries are more biodiverse, an optimal diet that uses the lowest quantity of fish skews towards species with traits that can give them greater resilience to anthropogenic pressures like overexploitation and climate change. Such species tend to be smaller, lower on the food chain, and can be substituted with a wider range of other small species that contain similar levels of nutrients, thereby providing people with many potential alternatives.\n\nSmaller species, like sardines, tend to be more ecologically resilient because they grow at faster rates than larger species. Additionally, optimal species are able to tolerate wider temperature ranges, making them more resilient to climate shocks.\n\nThe investigation showed that tropical coastal countries tend to have the most biodiverse fisheries, including countries in the Coral Triangle in the Pacific Ocean, Australia, India and the Amazon. The U.S. has good biodiversity, though Americans tend to consume a select few species; only 10 species account for up to 90% of fish that Americans eat.\n\nThe study was funded by the Schmidt Sciences programs, Cornell University, the National Science Foundation, the National Institute of Food and Agriculture, the Air Force Office of Scientific Research, and the David and Lucile Packard Foundation.",
  "summary": "To satisfy the seafood needs of billions of people, offering them access to a more biodiverse array of fish creates opportunities to mix-and-match species to obtain better nutrition from smaller portions of fish.",
  "published": "Tue, 03 Jun 2025 14:12:04 EDT",
  "url": "https://www.sciencedaily.com/releases/2025/06/250603141204.htm",
  "source": "Latest Science News -- ScienceDaily"
}