{
  "title": "Scientists uncover a hidden limit inside human endurance",
  "text": "When ultra-runners prepare for races that span hundreds of miles and last for days, they are not only challenging their determination and physical power. They are also exploring how far human physiology can be pushed. In a study published October 20 in the Cell Press journal Current Biology, researchers reported that even elite endurance athletes cannot consistently exceed an average \"metabolic ceiling\" equal to 2.5 times their basal metabolic rate (BMR) in daily energy use.\n\nThe metabolic ceiling refers to the upper limit of calories a person can burn in a sustained way. Earlier studies suggested that people might reach up to 10 times their BMR, which is the minimum amount of energy needed while resting, but only for short, intense periods.\n\n\"Every living thing has a metabolic ceiling, but exactly what that number is, and what constrains it, is the question,\" says lead author and anthropologist Andrew Best of the Massachusetts College of Liberal Arts, who is also an endurance athlete.\n\n\"To find out, we asked, if we get a group of really competitive ultra-athletes, can they break this proposed metabolic ceiling?\"\n\nTracking Energy Burn in Extreme Athletes\n\nTo explore that question, the research team monitored 14 ultra-runners, cyclists, and triathletes during both races and training blocks. Participants consumed water enriched with deuterium and oxygen-18, which are slightly heavier forms of hydrogen and oxygen. By following how quickly these isotopes left the body through urine, the scientists were able to determine how much carbon dioxide the athletes exhaled and, in turn, estimate total calorie expenditure.\n\nIn multi-day endurance events, several athletes temporarily reached energy burn levels six to seven times their BMR, which translated to roughly 7,000 to 8,000 calories per day. However, when the researchers averaged the athletes' caloric output across much longer intervals (30 and 52 weeks), their energy use consistently fell back near the expected ceiling of about 2.4 times their BMR. According to the researchers, this pattern demonstrates that even the most highly trained athletes eventually hit a metabolic limit, and sustaining anything above that boundary is extremely difficult.\n\n\"If you go over the ceiling for short periods, that's fine. You can make up for it later,\" says Best. \"But long term, it's unsustainable because your body will start to break down its tissue, and you'll shrink.\"\n\nHow the Body Reallocates Energy Under Stress\n\nThe study also highlighted how the human body balances competing energy demands during extreme endurance efforts. As athletes directed more energy toward running, swimming, and cycling, they naturally reduced energy use in other areas without realizing it.\n\n\"Your brain has a really powerful influence on how much you fidget, how much you want to move, and how encouraged you are to take a nap,\" says Best. \"All these fatigues we feel save calories.\"\n\nThe researchers noted that their findings reflect the physiology of the athletes who took part in the study. It is possible that unusually high-performing individuals who could exceed the identified ceiling were not included. While the results are important for understanding athletic performance, they also raise broader questions about how this metabolic cap might affect other biological processes.\n\nA Limit Most People Will Never Reach\n\n\"For most of us, we're never going to reach this metabolic ceiling,\" says Best. \"It takes running about 11 miles on average a day for a year to achieve 2.5 times BMR. Most people, including me, would get injured before any sort of energetic limit comes into play.\"\n\nThis work was supported by funding from Duke University and a Massachusetts College of Liberal Arts Faculty Incentive Award.",
  "summary": "Ultra-endurance athletes can push their bodies to extraordinary extremes, but even they run into a hard biological wall. Researchers tracked ultra-runners, cyclists, and triathletes over weeks and months, discovering that no matter how intense the effort, the human body maxes out at about 2.5 times its basal metabolic rate when measured long-term. Short bursts of six or seven times BMR are possible, but the body quickly pulls energy away from other functions to compensate, nudging athletes back toward the ceiling.",
  "published": "Thu, 13 Nov 2025 23:40:29 EST",
  "url": "https://www.sciencedaily.com/releases/2025/11/251113071616.htm",
  "source": "All Top News -- ScienceDaily"
}