{
  "title": "Covid decision-making in NI was 'chaotic', says inquiry",
  "text": "Covid decision-making in NI was 'chaotic', says inquiry\n\n10 hours ago Share Save Brendan Hughes, Political reporter and Barry O'Connor, BBC News NI Share Save\n\nPACEMAKER/Press Eye Then First Minister Arlene Foster, Deputy First Minister Michelle O'Neill pictured at a press conference on the 20 March 2020 shortly before lockdown in Stormont Castle, Belfast in relation to Covid-19\n\nSome meetings of Stormont's power-sharing executive were \"deeply divided along political lines and beset by leaks\", leading to an \"incoherent approach\" during the Covid-19 pandemic. The UK Covid-19 Inquiry has found that decision-making in Northern Ireland was \"chaotic\". The criticisms which were contained in the inquiry's second report examined government decision-making at the time. Inquiry chair Baroness Heather Hallett's report said the response of governments in all four UK nations repeatedly amounted to a case of \"too little, too late\".\n\nPA Media Some meetings of Stormont's power-sharing executive were \"deeply divided along political lines and beset by leaks\", leading to an \"incoherent approach\", the report said (Photo taken in Dec 2021)\n\n\"The decision-making in Northern Ireland was chaotic, and infected by political machination. \"The strained relationship between ministers contributed to an incoherent approach,\" Baroness Hallett continued. \"The circuit breaker restrictions were extended for a week, then lapsed for one week, before being introduced for two weeks.\" She said this one week lapse correlated to a 25% increase in cases. \"In Northern Ireland, the power sharing arrangements weakened the ability of the executive to respond, and decision making by the Northern Ireland Executive itself was marred by political disputes. Baroness Hallett said the relationships between ministers were \"poor\" and \"detrimental to good decision making\". The report said Northern Ireland's devolved structures offered an opportunity to show decisions were being made \"by all parties collectively for the greater good\" But \"on multiple occasions\" decision-making was \"marred by political disputes between Democratic Unionist Party (DUP) and Sinn Féin ministers\".\n\nPA Media The report said Sinn Féin's Michelle O'Neill (front row far right) attending the funeral of former senior IRA man Bobby Storey in June 2020 \"contributed to tensions\" in the five-party executive\n\nThe report said that Sinn Féin's Michelle O'Neill attending the funeral of former senior IRA man Bobby Storey in June 2020 \"contributed to tensions\" in the five-party executive. A four-day executive meeting in November that year was also described as \"a low point in Northern Ireland politics during the pandemic\". \"The confidentiality of discussions was undermined by leaks and there was inappropriate instigation of cross-community votes to make political points by the First Minister of Northern Ireland, Arlene Foster MLA (later Baroness Foster of Aghadrumsee),\" it said.\n\nSinn Féin and DUP ministers failed to put the \"common interest of all\" above their \"party political interests\" at critical points during the pandemic, the inquiry report said. It added that some political leaders in Northern Ireland were not always able to \"set aside political and sectarian divisions\", but that some instead \"allowed political interests to inform their decision-making\". The report said Stormont's power-sharing structures had the potential to give government decisions a \"higher degree of democratic legitimacy than in other parts of the UK\". But it added: \"Regrettably, some political leaders in Northern Ireland were not always able, in this time of extraordinary crisis, to set aside political and sectarian divisions and to govern jointly and effectively in the interests of the whole of Northern Ireland.\"\n\n'Health department operated in a silo'\n\nThe report said that the Department of Health (DoH) \"largely operated in a silo\", adding that it was \"unclear\" how decisions would have been made \"had power-sharing still been suspended when lockdown decisions were taken\". The pandemic hit shortly after Stormont was restored following a three-year collapse. The report's recommendations include proposals specific for Northern Ireland to avoid a \"potential vacuum\" if an emergency happens during a future suspension.\n\nHow have politicians reacted?\n\nFirst Minister of Northern Ireland Michelle O'Neill said the report is a \"welcome milestone in the long journey of recovery after the pain and trauma\" of the pandemic. \"Covid was an unprecedented global emergency and this report will provide further lessons from the experience at all levels of society,\" the Sinn Féin deputy leader added. \"Those lessons must inform our preparedness for, and response to, any future pandemic or society-wide emergency in the future,\" she said. Adding that her thoughts are with those who lost loved ones. The Ulster Unionist Party (UUP) assembly member Robin Swann was health minister at the time of the pandemic. In a statement, a spokesperson for the UUP said he \"acted on the best scientific advice available\" and that \"his guiding light at all times was keeping the public safe.\" \"We were deeply dismayed by the lack of seriousness shown by some Executive colleagues during this critical period, including persistent briefing against others and the leaking of confidential information.\" They added that the report's findings on Sinn Féin members attending the funeral of Bobby Storey were \"significant\" and that the decision to attend \"seriously undermined public trust\". \"It is also clear that DUP colleagues were largely driven by political opportunism and sought to create division within the Executive rather than focus on the collective challenge,\" they said. Posting on social media, Traditional Unionist Voice (TUV) leader Jim Allister called the executive \"dysfunctional as ever\", adding that \"even for covid\" ministers \"couldn't get it together\".\n\nWhat is the Covid Inquiry report?\n\nGetty Images\n\nThe latest report looks at many of the major political choices in early 2020 and beyond as coronavirus spread across the UK. Political leaders were involved in significant decisions including how lockdowns were introduced, the closure of businesses and schools, and restrictions on public gatherings. The report runs to around 800 pages and is the second of 10 separate modules to be completed as part of the inquiry. It found in the early stages of the pandemic, the political system across the four UK nations \"lacked urgency\". Devolved administrations \"failed to engage with the threat posed\" and were \"overly reliant on the UK government to lead the response\". \"The lack of urgency on the part of all four governments, and the failure to take more immediate emergency steps, are inexcusable,\" the report said. It said by the end of March 2020 a mandatory lockdown \"had become unavoidable\".\n\nPA Media The former Health Minister Robin Swann gave evidence to the UK Covid-19 inquiry in Belfast last year\n\nThe report also looked at decision-making in the Northern Ireland Executive at the end of 2020 during the \"second wave\" of Covid. \"Notwithstanding the imposition of circuit breaker restrictions, the decision-making in Northern Ireland was chaotic,\" it said. The report said executive meetings \"were deeply divided along political lines and beset by leaks, leading to an incoherent approach\". The findings follow the inquiry's first report published last year, which focused on \"resilience and preparedness\" for the health emergency. It found the UK was \"ill-prepared\" and the government and devolved nations \"failed their citizens\" as they planned for the \"wrong pandemic\". Previous hearings heard devastating evidence with multiple failings across several departments, including the DoH.\n\nHow have families reacted?\n\nPA Media Brenda Doherty's mother Ruth Burke, 82, was infected after being admitted to hospital in March 2020\n\nThe daughter of the first woman to die in Northern Ireland with Covid-19 has said the report \"hit the nail on the head\". Brenda Doherty's mother Ruth Burke, 82, was infected after being admitted to hospital in March 2020. Ms Doherty gave evidence to the inquiry about the last time she saw her mother, saying she took her mother's face in her hands, kissed her, and told her she would see her the next day. \"In module one, we felt like a footnote, but we cannot say that about this latest report,\" she told BBC News. \"Some really good recommendations have been made in relation to how the first and deputy first ministers need to, in the case of an emergency, have an oversight so that mechanisms can be put in place. Ms Doherty said she found today \"very emotional\". \"My mummy died on 24 March 2020, and the Chair has made it clear that had a lockdown been a week earlier, people like my mummy would have been saved.\"\n\nPA Media Catriona Myles was just one of the covid bereaved families who gave evidence to the UK Covid-19 Inquiry about how the UK responded to and the impact of the pandemic.\n\nCatriona Myles' father died alone in Antrim hospital during a Covid-19 lockdown in 2020. Ms Myles was just one of the covid bereaved families who gave evidence to the UK Covid-19 Inquiry about how the UK responded to and the impact of the pandemic. Speaking to BBC Radio Ulster's Good Morning Ulster programme, Ms Myles said the inquiry has been a \"rollercoaster\". \"A public inquiry is a lessons learned exercise and we're not really going to get justice as such. I mean, what would justice look like for all our families? I don't really know, to be honest,\" she said. \"When I found out that my father could have had someone with him all that time, it was just like a knife to the stomach.\"\n\nEnda McGarrity, solicitor for Northern Ireland Bereaves Families for Justice, said it has been a monumental day for the group. \"There's a mix of emotions, but at this stage we are quite pleased that the chair of the inquiry have listened to what we have to say\", he told BBC News NI's Evening Extra programme. He added they have been vindicated by Baronesses Hallett's comments about political divides affecting decision making during the pandemic. \"The message could not be clearer from the chair - those responsible with governance in Northern Ireland should set aside heavy party politics, particularly in a crisis scenario like this, and put the protection of lives first. \"It's very clear from the report that didn't happen.\"\n\nAnalysis: Damning and scathing report",
  "summary": "The criticisms were contained in the UK Covid-19 Inquiry's second report, which examined government decision-making at the time.",
  "published": "Thu, 20 Nov 2025 20:37:03 GMT",
  "url": "https://www.bbc.com/news/articles/czjpjd7ye1mo?at_medium=RSS&at_campaign=rss",
  "source": "BBC News"
}