{
  "title": "Black holes could act as natural supercolliders -- and help uncover dark matter",
  "text": "As federal funding cuts impact decades of research, scientists could turn to black holes for cheaper, natural alternatives to expensive facilities searching for dark matter and similarly elusive particles that hold clues to the universe's deepest secrets, a new Johns Hopkins study of supermassive black holes suggests.\n\nThe findings could help complement multi-billion-dollar expenses and decades of construction needed for research complexes like Europe's Large Hadron Collider, the largest and highest-energy particle accelerator in the world.\n\n\"One of the great hopes for particle colliders like the Large Hadron Collider is that it will generate dark matter particles, but we haven't seen any evidence yet,\" said study co-author Joseph Silk, an astrophysics professor at Johns Hopkins University and the University of Oxford, UK. \"That's why there are discussions underway to build a much more powerful version, a next-generation supercollider. But as we invest $30 billion and wait 40 years to build this supercollider — nature may provide a glimpse of the future in super massive black holes.\"\n\nThe research was published on June 3 in Physical Review Letters.\n\nParticle colliders smash protons and other subatomic particles into each other at nearly the speed of light, exposing the most fundamental aspects of matter. Subtle energy flashes and debris from the clash could reveal previously undiscovered particles, including potential candidates for dark matter, a critical but ghostly component of the universe that scientists have yet to detect. Facilities such as the Large Hadron Collider, a 17-mile circular tunnel, have also helped transform the internet, cancer therapy, and high-performance computing.\n\nA black hole can spin around its axis like a planet, but with much greater strength because of its intense gravitational field. Scientists are increasingly discovering that some rapidly spinning massive black holes at the centers of galaxies release enormous outbursts of plasma, likely because of jets powered by energy from their spin and surrounding accretion disks. It's these events that could potentially generate the same results as human-made supercolliders, the new study shows.\n\n\"If supermassive black holes can generate these particles by high-energy proton collisions, then we might get a signal on Earth, some really high-energy particle passing rapidly through our detectors,\" said Silk, who is also a researcher at the Institute of Astrophysics in Paris and at the University of Oxford. \"That would be the evidence for a novel particle collider within the most mysterious objects in the universe, attaining energies that would be unattainable in any terrestrial accelerator. We'd see something with a strange signature that conceivably provides evidence for dark matter, which is a bit more of a leap but it's possible.\"\n\nThe new study shows that plunging \"gas flows\" near a black hole can draw energy from its spin, becoming much more violent than scientists thought possible. Near a rapidly spinning black hole, these particles can chaotically collide. Although not identical, the process is similar to the collisions scientists create using intense magnetic fields to accelerate particles in the circular tunnel of a high-energy particle collider.\n\n\"Some particles from these collisions go down the throat of the black hole and disappear forever. But because of their energy and momentum, some also come out, and it's those that come out which are accelerated to unprecedentedly high energies,\" Silk said. \"We figured out how energetic these beams of particles could be: as powerful as you get from a supercollider, or more. It's very hard to say what the limit is, but they certainly are up to the energy of the newest supercollider that we plan to build, so they could definitely give us complementary results.\"\n\nTo detect such high-energy particles, scientists could use observatories already tracking supernovae, massive black hole eruptions, and other cosmic events, Silk said. These include detectors like the IceCube Neutrino Observatory in the South Pole or the Kilometer Cube Neutrino Telescope, which recently detected the most energetic neutrino ever recorded under the Mediterranean Sea.\n\n\"The difference between a supercollider and a black hole is that black holes are far away,\" Silk said. \"But nevertheless, these particles will get to us.\"\n\nDr. Andrew Mummery, a theoretical physicist at University of Oxford, is also an author of the study.",
  "summary": "Supermassive black holes might naturally replicate the colossal energies of man-made particle colliders possibly even revealing dark matter offering a cosmic shortcut to discoveries that would otherwise take decades and billions to pursue.",
  "published": "Tue, 03 Jun 2025 11:46:37 EDT",
  "url": "https://www.sciencedaily.com/releases/2025/06/250603114637.htm",
  "source": "Latest Science News -- ScienceDaily"
}