{
  "title": "Webb reveals the origin of the ultra-hot exoplanet WASP-121b",
  "text": "Observations with the James Webb Space Telescope (JWST) have provided new clues about how the exoplanet WASP-121b has formed and where it might have originated in the disc of gas and dust around its star. These insights stem from the detection of multiple key molecules: water vapour, carbon monoxide, silicon monoxide, and methane. With these detections, a team led by astronomers Thomas Evans-Soma and Cyril Gapp was able to compile an inventory of the carbon, oxygen, and silicon in the atmosphere of WASP-121b. The detection of methane in particular also suggests strong vertical winds on the cooler nightside, a process often ignored in current models.\n\nWASP-121b is an ultra-hot giant planet that orbits its host star at a distance only about twice the star's diameter, completing one orbit in approximately 30.5 hours. The planet exhibits two distinct hemispheres: one that always faces the host star, with temperatures locally exceeding 3000 degrees Celsius, and an eternal nightside where temperatures drop to 1500 degrees.\n\n\"Dayside temperatures are high enough for refractory materials -- typically solid compounds resistant to strong heat -- to exist as gaseous components of the planet's atmosphere,\" Thomas Evans-Soma explained. He is an astronomer affiliated with the Max Planck Institute for Astronomy (MPIA) in Heidelberg, Germany, and the University of Newcastle, Australia. He led the study published today in Nature Astronomy.\n\nUnveiling the birthplace of WASP-121b\n\nThe team investigated the abundance of compounds that evaporate at very different temperatures, providing clues about the planet's formation and evolution. \"Gaseous materials are easier to identify than liquids and solids,\" noted MPIA student Cyril Gapp, the lead author of a second study published today in The Astronomical Journal. \"Since many chemical compounds are present in gaseous form, astronomers use WASP-121b as a natural laboratory to probe the properties of planetary atmospheres.\"\n\nThe team concluded that WASP-121b likely accumulated most of its gas in a region cold enough for water to remain frozen yet sufficiently warm for methane (CH 4 ) to evaporate and exist in its gaseous form. Since planets form within a disc of gas and dust surrounding a young star, such conditions occur at distances where stellar radiation creates the appropriate temperatures.\n\nIn our own Solar System, this region lies somewhere between the orbits of Jupiter and Uranus. This is remarkable, given that WASP-121b now orbits perilously close to its host star's surface. It suggests that, after its formation, it undertook a long journey from the icy outer regions to the centre of the planetary system.\n\nReconstructing WASP-121b's eventful youth\n\nSilicon was detected as silicon monoxide (SiO) gas, but originally entered the planet via rocky material such as quartz stored in planetesimals -- essentially asteroids -- after acquiring most of its gaseous envelope. The formation of planetesimals takes time, indicating that this process occurred during the later stages of planetary development.\n\n\"The relative abundances of carbon, oxygen, and silicon offer insights into how this planet formed and acquired its material.\" -- Thomas Evans-Soma\n\nPlanet formation begins with icy dust particles that stick together and gradually grow into centimetre- to metre-sized pebbles. They attract surrounding gas and small particles, accelerating their growth. These are the seeds of future planets like WASP-121b. Drag from the surrounding gas causes the moving pebbles to spiral inward towards the star. As they migrate, their embedded ices begin to evaporate in the disc's warmer inner regions.\n\nWhile the infant planets orbit their host stars, they may grow large enough to open substantial gaps within the protoplanetary disc. This halts the inward drift of pebbles and the supply with embedded ices but leaves enough gas available to build an extended atmosphere.\n\nIn the case of WASP-121b, this appears to have occurred at a location where methane pebbles evaporated, enriching the gas that the planet supplied with carbon. In contrast, water pebbles remained frozen, locking away oxygen. This scenario best explains why Evans-Soma and Gapp observed a higher carbon-to-oxygen ratio in the planet's atmosphere than in its host star. WASP-121b continued attracting carbon-rich gas after the flow of oxygen-rich pebbles had stopped, setting the final composition of its atmospheric envelope.\n\nThe detection of methane requires strong vertical currents\n\nAs the temperature of an atmosphere changes, the quantities of different molecules, such as methane and carbon monoxide, are expected to vary. At the ultra-high temperatures of WASP-121b's dayside, methane is highly unstable and won't be present in detectable quantities. Astronomers have determined for planets like WASP-121b that gas from the dayside hemisphere should be mixed around to the relatively cool nightside hemisphere faster than the gas composition can adjust to the lower temperatures. Under this scenario, one would expect the abundance of methane to be negligible on the nightside, just as it is on the dayside. When instead the astronomers detected plentiful methane on the nightside of WASP-121b, it was a total surprise.\n\nTo explain this result, the team proposes that methane gas must be rapidly replenished on the nightside to maintain its high abundance. A plausible mechanism for doing this involves strong vertical currents lifting methane gas from lower atmospheric layers, which are rich in methane thanks to the relatively low nightside temperatures combined with the high carbon-to-oxygen ratio of the atmosphere. \"This challenges exoplanet dynamical models, which will likely need to be adapted to reproduce the strong vertical mixing we've uncovered on the nightside of WASP-121b,\" said Evans-Soma.\n\nJWST's role in the discovery\n\nThe team used JWST's Near-Infrared Spectrograph (NIRSpec) to observe WASP-121b throughout its complete orbit around its host star. As the planet rotates on its axis, the heat radiation received from its surface varies, exposing different portions of its irradiated atmosphere to the telescope. This allowed the team to characterize the conditions and chemical composition of the planet's dayside and nightside.\n\nThe astronomers also captured observations as the planet transited in front of its star. During this phase, some starlight filters through the planet's atmospheric limb, leaving spectral fingerprints that reveal its chemical makeup. This type of measurement is especially sensitive to the transition region where gases from the dayside and nightside mix. \"The emerging transmission spectrum confirmed the detections of silicon monoxide, carbon monoxide, and water that were made with the emission data,\" Gapp noted. \"However, we could not find methane in the transition zone between the day and night side.\"\n\nAdditional information\n\nThe MPIA scientists involved in this study included Thomas M. Evans-Soma (also at the University of Newcastle, Australia), Cyril Gapp (also at Heidelberg University), Eva-Maria Ahrer, Duncan A. Christie, Djemma Ruseva (also at the University of St Andrews, UK), and Laura Kreidberg.\n\nOther researchers included David K. Sing (Johns Hopkins University, Baltimore, USA), Joanna K. Barstow (The Open University, Milton Keynes, UK), Anjali A. A. Piette (University of Birmingham, UK and Carnegie Institution for Science, Washington, USA), Jake Taylor (University of Oxford, UK), Joshua D. Lothringer (Space Telescope Science Institute, Baltimore, USA and Utah Valley University, Orem, USA), and Jayesh M. Goyal (National Institute of Science Education and Research (NISER), Odisha, India).\n\nNIRSpec is part of the European Space Agency's (ESA) contribution to the Webb mission, built by a consortium of European companies led by Airbus Defence and Space (ADS). NASA's Goddard Space Flight Centre provided two sub-systems (detectors and micro-shutters). MPIA was responsible for procuring electrical components of the NIRSpec grating wheels.",
  "summary": "Tracing the origin of an ultra-hot exoplanet: The chemical composition of WASP-121b suggests that it formed in a cool zone of its natal disc, comparable to the region of gas and ice giants in our Solar System. Methane indicates unexpected atmospheric dynamics: Despite extreme heat, methane was detected on the nightside -- a finding that can be explained by strong vertical atmospheric circulation. First detection of silicon monoxide in a planetary atmosphere: Measurements of this refractory gas allow quantifying the rocky material the planet had accumulated.",
  "published": "Mon, 02 Jun 2025 15:53:32 EDT",
  "url": "https://www.sciencedaily.com/releases/2025/06/250602155332.htm",
  "source": "Latest Science News -- ScienceDaily"
}