{
  "title": "'I deeply hurt people by moving to Saudi Arabia'",
  "text": "Like many expats in Saudi Arabia, Plumptre lives in a gated community known as a compound.\n\nThese residential compounds offer a lifestyle more like Western suburban areas and have gyms, pools, restaurants and other amenities in a self-contained area. Some even have unofficial bars which serve alcohol, which is banned in Saudi Arabia.\n\nPlumptre says she feels happier and safer as a woman living in Jeddah than she did in the UK.\n\n\"I know international players, members of my family and friends who have come out here who genuinely feel safer here and calmer than in the UK,\" she said.\n\n\"A friend of mine who was out here, we described it as being like a peace bubble.\n\n\"I'll give an example. I had been to the supermarket and I had all these bags. I live in a compound. I had to take all these bags into the elevator, so I left my car out with the door open, engine on and keys in the car so I could take up my shopping.\n\n\"In the UK I would never leave my car out with the keys in. Here I have no problem.\n\n\"Naturally everyone is a bit fearful walking around at night, but I don't have to check my shoulder all the time. I know this is just the perspective of myself, not of everybody who lives here, but with the safety I feel I can't agree with some of the views the Western world have of this place.\"\n\nAs Plumptre says, this is just one perspective on life for a woman in Saudi Arabia.\n\nSome of the most notably unequal practices in the country are no longer in place. Women have been allowed to drive since 2018. A year later those over 21 could apply for a passport.\n\nBut the concept of guardianship, or 'wilaya', is central to Saudi culture. Traditionally every woman has a 'wali', a male guardian who makes decisions on her behalf.\n\nThere has been some reform - women over 21 no longer need approval to access healthcare or education - but reports from organisations such as Amnesty International say this is not always practically implemented and women are still heavily restricted in what they can do, wear and say.\n\nAsked about how she has been treated since her move, Plumptre says: \"I don't feel threatened at all here.\n\n\"Men are encouraged to treat women a certain way, and there are consequences if they do not.\n\n\"Every woman can say there is a level of fear within them if they were to be out walking at night whether in the Saudi or in the UK, but there are levels of fear, and there are lower levels in Saudi based on the way men behave.\"",
  "summary": "In an interview with BBC Sport, Ashleigh Plumptre says she regrets losing the trust of some LGBT fans in women's football by moving to Saudi Arabia.",
  "published": "Tue, 07 Oct 2025 06:38:54 GMT",
  "url": "https://www.bbc.com/sport/football/articles/c99gl941vedo?at_medium=RSS&at_campaign=rss",
  "source": "BBC Sport"
}