{
  "title": "South African women call purple protest over gender violence",
  "text": "South African women call purple protest over gender violence\n\n6 hours ago Share Save Khanyisile Ngcobo , Nomsa Maseko, BBC Africa, Johannesburg and Danai Nesta Kupemba Share Save\n\nAFP via Getty Images Many activists want gender-based violence to be declared a national disaster\n\nSouth African women's rights groups are calling for nationwide protests to demand that gender-based violence (GBV) be declared a national disaster in a country where attacks on women have become commonplace. The campaign began with a viral social media movement and will culminate in a nationwide \"shutdown\" on Friday, ahead of the G20 Summit in Johannesburg. Celebrities, citizens and nations have shown their solidarity by changing their social media profile pictures to purple – a colour often linked to GBV awareness. South Africa experiences some of the world's highest levels of GBV, with the rate at which women are killed five times higher than the global average, according to UN Women.\n\nBetween January and March this year, 137 women were murdered and more than 1,000 raped, according to South African crime statistics. Warning: This report contains descriptions of sexual assault On Friday, women are being urged to refrain from going to work or school, \"withdraw from the economy for one day\", and lie down for 15 minutes at 12:00 local time (10:00 GMT) in honour of the women murdered in the country. They are also being urged to wear black as a sign of \"mourning and resistance\". The protest, dubbed the G20 Women's Shutdown, has been organised by Women for Change, which has also been spearheading the online campaign. There has also been an online petition, signed by over one million people, calling for the government to take an even tougher stance against the scourge. The National Disaster Management Centre (NDMC) has rejected the calls to declare GBV a national disaster, saying it doesn't fall within the legal requirements. On Thursday, President Cyril Ramaphosa told the G20 Social Summit that South Africa had \"declared gender-based violence and femicide a national crisis\" in 2019. However, activists say that little has changed and they want the government to take more action. Women for Change spokesperson Cameron Kasambala lamented the enactment of \"so many beautiful acts and legislations\" over the years to try and tackle the issue, which are followed by \"lack of implementation and transparency\" on the government's part. \"We've integrated violence… into our culture [and] into our social norms,\" she told the BBC. \"Once the government truly reacts to this issue, I feel like we'll already be able to see a reaction on the ground. Because they set the precedent and the tone for how the country responds,\" she said.\n\nGrammy-award winning singer Tyla is among the thousands of celebrities and citizens who have rallied behind the call and changed their social media profiles. Some have gone further, posting pictures of purple hearts, nail polish and even clothing in what has since been dubbed the \"purple movement\". A South African professor who asked to remain anonymous told the BBC she had taken leave so she could travel to Johannesburg from Free State province to take part in the silent protest. It's important for her because she said she had second thoughts about simple things like jogging and hopes that the protest will \"slow the scourge\" of GBV. However, some women have faced a backlash from employers for wanting to participate in the protest. One product designer who works for a major cooperation said they were strongly advised against taking part.\n\nSome women who feel the government is not doing enough have taken matters into their own hands. Lynette Oxeley founded Girls on Fire to help women protect themselves through gun ownership. It is legal to own a firearm in South Africa for self-defence if a person has a valid licence. Most of the women in her group have been raped, attacked, robbed, or experienced some level of violence. Prudence joined the group after she was raped in 2022. \"I said: 'No'. I screamed, I cried but he didn't take no for an answer,\" she told the BBC. Trying to find justice was an \"uphill battle\" as her case was withdrawn because her rape kit - the DNA they take after the crime - was lost. It isn't a \"police problem, it is a nation problem,\" she said. Although the women are trained to shoot firearms, Ms Oxeley said using a gun was a \"last resort\". \"It's not about actually defending yourself with a firearm. I want ladies to change what they think about themselves. Stop being silent,\" she said. \"Even if you do not win the fight, at least you are fighting back.\"\n\nA growing number of women in South Africa are learning to use guns to protect themselves\n\nMore about South Africa from the BBC:\n\nGetty Images/BBC",
  "summary": "Nearly 1,000 women were raped and 137 murdered in the first three months of this year.",
  "published": "Fri, 21 Nov 2025 00:02:57 GMT",
  "url": "https://www.bbc.com/news/articles/cn979g302l9o?at_medium=RSS&at_campaign=rss",
  "source": "BBC News"
}