{
  "title": "Who are Afrikaners, the group at the center of Trump's dispute with South Africa?",
  "text": "Who are Afrikaners, the group at the center of Trump's dispute with South Africa?\n\ntoggle caption Marco Longari/AFP via Getty Images\n\nWhen the G20 meeting kicks off in South Africa this weekend, one member country will be conspicuously absent: the United States.\n\nPresident Trump has decided that the U.S. will completely boycott the conference over what he considers the discriminatory treatment of Afrikaners by the South African government. They are the largest subset of the country's white minority, and Afrikaners ran South Africa's government for much of the 20th century and famously oversaw the racist system of apartheid until 1994.\n\nTrump has repeated false claims that the South African government is stealing land from white farmers and that there is an ongoing \"white genocide\" and \"extermination\" of Afrikaners, even taking the unprecedented step of offering refugee status to Afrikaners who want to flee. The first 59 Afrikaner refugees arrived in the U.S. in May.\n\nSponsor Message\n\nSouth African officials — including President Cyril Ramaphosa — have said Trump's claims are untrue and point to official government data showing that attacks against rural Afrikaners are rare, and that the country's Black majority bear the brunt of South Africa's rampant crime.\n\nLindie Koorts, a historian at the University of Pretoria, said the false narrative has strained some of the progress made in post-apartheid South Africa, as Afrikaners whose ancestors perpetrated apartheid adjust to being a political minority.\n\n\"This is a minority that used to be protected by apartheid laws\" who now don't have the same job security and other economic benefits, said Koorts, who is an Afrikaner. \"It turns into something of existential dread, and that is very, very easily manipulated by the right wing.\"\n\nHere's what to know about the history of the Afrikaners.\n\nWho are Afrikaners?\n\nAfrikaners descend from colonists of mostly Dutch but also German and French origin who landed on the tip of Africa in the 17th century. Many passed through the resupply station established by the Dutch East India Company in present-day Cape Town, an ideal midpoint along the sea routes between Europe and Asia.\n\nSome Afrikaners later moved inland to form large farming colonies as their population grew on the continent. They also became known as Boers, which translates to \"farmers.\"\n\nSponsor Message\n\nDisputes between British colonists and the Boer settlers who spoke Afrikaans led to the Boer War, which occurred at the turn of the century. The British forces won, but Afrikaners remained the majority of South Africa's white population after the war and gained control of South Africa's government in the early 20th century.\n\nIn 1948, the Afrikaner-led government began to implement apartheid, a system of institutionalized racial segregation that benefited whites. Black people and other non-white South Africans were displaced and dispossessed. Apartheid ended in 1994 with the formation of a new, democratic government led by anti-apartheid activist and Nobel Peace Prize winner Nelson Mandela.\n\ntoggle caption Rashid Lombard/AFP via Getty Images\n\nApartheid helped consolidate wealth among several generations of South Africa's white minority, but its fall stripped them of their political power and has shifted race relations in the country, said Daniel Magaziner, a professor of African history at Yale University.\n\n\"Afrikaners — as white people — do quite well since 1994, but they do lose their political privileges, and so there is a rise in a sense of grievance and nostalgia for what has been lost since they lost their political control over the territory,\" he said.\n\nMagaziner said there remains in South Africa a strong cultural association of Afrikaners with farming, even though most Afrikaners now live in the suburbs or urban areas.\n\n\"But this idea that they're being targeted on farms is something that has a very big afterlife and is one of the reasons the Trump administration claims that these are people worthy — uniquely worthy — of being granted refugee status,\" he said.\n\nSome Afrikaners say they're facing discrimination\n\nSome Afrikaners say they are at risk of having their land stripped away or even facing physical violence and death because they are white, a claim that's been widely disputed by other Afrikaners, South African officials and Ramaphosa.\n\nRight-wing South African groups such as AfriForum have attacked a new federal land expropriation law, which replaces another law from the apartheid era. Critics say the new law lets the government take land from private citizens without compensation.\n\ntoggle caption Julia Demaree Nikhinson/AP\n\nUnder the law, the government can only seize land without paying for it in limited circumstances, such as if the land is not in use. The government must also first attempt to strike a deal with the owner. Most commercial farmland in South Africa is still owned by the country's white minority, who make up about 8% of the population.\n\nAfriForum has also claimed there are widespread murders of white Afrikaner farmers, which it says law enforcement is doing too little to combat, though South Africa's government denies this. And the group has slammed politicians who've continued to sing the apartheid-era song, \"Kill the Boer,\" something Ramaphosa said does not represent the policy of the government.\n\nAfriForum CEO Kallie Kriel told Newzroom Afrika that he wanted the South African government to condemn the song and recognize \"that we are seeing tortures that accompany these murders and declare it a priority crime.\"\n\nThe claims have been boosted by some of Trump's allies in the U.S., including Elon Musk, who is from South Africa. In a dramatic Oval Office meeting in May, Trump surprised Ramaphosa with a video montage and news clippings showing what Trump claimed was widespread violence and discrimination against white farmers.\n\n\"You do allow them to take land — when they take the land, they kill the white farmer, and when they kill the white farmer, nothing happens to them,\" Trump said to Ramaphosa, who immediately disputed it.\n\nSponsor Message\n\nThis year the Trump administration began offering refugee status to Afrikaners, even as the administration cut the total number of refugees it would admit to an all-time low.\n\nHow South Africa is responding to claims of discrimination against whites\n\ntoggle caption Chip Somodevilla/Getty Images\n\nRamaphosa and other South African officials say attacks on farming communities are rare. National police data shows that there were six murders on farms in South Africa during the first three months of this year.\n\nMost crime victims in South Africa are Black — not white — officials say. Of the six farm murders from January to March, five of the victims were Black and one was white. South Africa's police minister said earlier this year that farm murders have a history of being \"distorted and reported in an unbalanced way.\"\n\nMany Afrikaners have also disputed the idea that they're being persecuted. A number of Afrikaner journalists, professors and others signed a public petition, saying they rejected the idea that Afrikaners were \"victims of racial persecution in post-apartheid South Africa\" and didn't want to be \"pawns\" for American politicians.\n\nThe group said South Africans of all races were facing a slew of problems. \"To cherry-pick white suffering and elevate it above others is dishonest and harmful,\" the petition reads. \"It feeds extremist ideologies that perpetuate division and have inspired real-world violence, including mass shootings.\"\n\nKoorts, one of the signatories, said the allegations of a \"white genocide\" are not true and that Afrikaners have had to do a lot of work to reckon with the violent and racist history of apartheid.\n\n\"What we now see is our story being taken out of context, being twisted for an American audience to make Americans fearful of multiculturalism, of multiracialism, of making Americans fearful of essentially becoming a white minority,\" she said. \"Don't. Please don't. That is not our story. That is a twisted version of our story.\"",
  "summary": "Trump has repeated debunked claims that Afrikaners are facing a \"white genocide\" in South Africa. Critics say the false statements are causing conflict in a country still recovering from apartheid.",
  "published": "Thu, 20 Nov 2025 05:00:00 -0500",
  "url": "https://www.npr.org/2025/11/20/nx-s1-5606922/afrikaners-trump-south-africa-history-explainer-g20",
  "source": "NPR Topics: World"
}