{
  "title": "Serious Fraud Office arrests two men over suspected £20m crypto fraud",
  "text": "The Serious Fraud Office (SFO) has arrested two men as it launched an investigation into a suspected £20m cryptocurrency fraud.\n\nThe law enforcement agency raided two sites in West Yorkshire and London as it appealed for information about $28m (£21.4m) invested into a cryptocurrency scheme called Basis Markets.\n\nTwo men, one in his 30s and another in his 40s, were arrested on suspicion of multiple fraud and money-laundering offences, the agency said.\n\nBasis Markets, which the SFO described as a “suspected fraudulent scheme” and is not a company, is said to have raised millions of pounds via two public fundraisers in November and December 2021, stating it would use the cash to create a “crypto hedge fund”.\n\nSix months after the fundraisings in June 2022, investors are alleged to have been informed that proposed new US regulations were preventing the project from proceeding as planned. The SFO’s investigation is thought to be focusing on this announcement as well as what became of the investors’ money.\n\nNick Ephgrave, the director of the SFO, said: “With our expanding crypto currency capability and growing expertise in this area, we are determined to pursue anyone who would seek to use cryptocurrency to defraud investors.\n\n“Today’s action is an important step in our investigation, and we’re urging anyone with information to come forward and support our inquiries.”\n\nThe agency said the investigation was the first major cryptocurrency case it had announced.\n\nThe law enforcement body secured additional funds to invest in its crypto capabilities earlier this year. In June, the SFO said it had been granted more than £8m of extra funding over the next three years that would strengthen its “ability to recover criminal assets, including crypto assets, wherever they may be”.\n\nThe Guardian has attempted to contact Basis Markets.",
  "summary": "<p>Law enforcement agency raids two sites in West Yorkshire and London as it appeals for information</p><p>The Serious Fraud Office (SFO) has arrested two men as it launched an investigation into a suspected £20m cryptocurrency fraud.</p><p>The law enforcement agency <a href=\"https://sfo-newsroom.prgloo.com/news/sfo-announces-investigation-into-usd-28-million-cryptocurrency-hedge-fund-scheme\">raided two sites in West Yorkshire and London</a> as it appealed for information about $28m (£21.4m) invested into a cryptocurrency scheme called Basis Markets.</p> <a href=\"https://www.theguardian.com/business/2025/nov/20/serious-office-arrests-two-men-over-suspected-20m-crypto\">Continue reading...</a>",
  "published": "Thu, 20 Nov 2025 18:07:23 GMT",
  "url": "https://www.theguardian.com/business/2025/nov/20/serious-office-arrests-two-men-over-suspected-20m-crypto",
  "source": "The Guardian"
}