{
  "title": "Bradley's take: Can Haney avoid Norman's left hook?",
  "text": "Open Extended Reactions\n\nIn a sport where two fighters' worlds collide, and statistics only hint at what may unfold, the truth is we never truly know until the last bell rings. And this once again will be the case when Brian Norman Jr. and Devin Haney meet for Norman's WBO welterweight title in Riyadh, Saudi Arabia, on Saturday (DAZN PPV, 5 p.m. ET).\n\nTopping the bill is WBC light heavyweight champion David Benavidez facing the always dangerous contender Anthony Yarde, known for his devastating knockout power. But the most anticipated battle of the night is Norman vs. Haney, in which Haney will be chasing a world title in his third weight class. A win would open up the conversation of whether Haney deserves a place in the pound-for-pound rankings. But there's a big question at the heart of this fight: Can Haney handle Norman's punching power, especially his ferocious left hook?\n\nNorman's power is well documented. His last opponent, Jin Sasaki, has gone on record as stating he lost six weeks of memory, according to Issei Nakaya, president of Nakaya Boxing Gym, after Norman brutally knocked him out in Round 5 in June.\n\nWhat's also well documented is Haney's vulnerability to Ryan Garcia's left hook when they fought in April 2024, and was knocked down three times by that punch. This adds a layer of intrigue to Saturday's showdown.\n\nCan Haney outbox and outthink Norman over 12 rounds? Can he put together and execute the perfect fight strategy to neutralize Norman's punching power?\n\nMomentum favors Norman, who is coming into the fight off three wins, all spectacular knockouts, and will be making his third appearance inside the ring this year. Haney has fought only once since taking a much-needed year away following his horrific but brave performance against Garcia. He got up off the canvas three times to go the distance in a fight that was later declared a no contest because Garcia tested positive for a banned substance. Haney returned May 2 but put on a lackluster performance in a unanimous decision win against Jose Ramirez in New York's Times Square.\n\nI view this weekend's matchup as the definition of a pick 'em fight. Norman's blend of speed, power and aggressiveness clashes with Haney's fast hands and footwork, acute timing and tactical savvy.\n\nBoth fighters enter the ring seeking not just victory but also answers. Haney needs to show he still has everything it takes to compete at the elite level. Norman will have the pressure of needing to show the devastating knockout power he showcased in his last three fights will carry over a matchup with a future Hall of Famer in Haney, who at age 27 is in the prime years of his career.\n\nLet's look closely at the matchup and anticipate how the fight could play out.\n\nUnderstanding Norman's style\n\nI believe we still haven't seen the best version of Norman. At just 24 years old, he's still a couple of years away from fully entering his prime.\n\nNorman fights with an aggressive, come-forward style but never at the expense of sound defense. He blends hand speed with knockout power in both hands, and he excels at punching between an opponent's shots. If you're a football fan, imagine an NFL running back exploding through the gap between the guards.\n\nEven before an exchange begins, his boxing stance tells a story. He stands stiff, coiled, calm and upright, radiating strength, danger and raw power. His base, supported by enormous tree-trunk calves, anchors him, allowing him to grip the canvas like a parked truck.\n\nFrom that foundation, he varies his jab with a bit of nuance. Sometimes it's a light probe to gauge distance. Other times, he uses a measuring jab to clog the punching lane. Using another football analogy, it's much like a linebacker crashing gaps to shut down a play. And when Norman fires his hard jab, it's thrown with enough authority to freeze opponents where they stand.\n\nIn close range, Norman uses physical controls at will, pinning his opponent's arms to shut down punches, peeling at the guard to create openings and breaking posture by manipulating the head. Once you control the head, the rest of the body follows. Norman applies these tactics effectively, dictating every exchange in the pocket.\n\nHe uses shoulder bumps and posts (extended lead hand) to knock opponents off balance, steal positional advantages and turn himself into a menace in the pocket. Once inside, he imposes his will, punishing foes to their body while handling them with strength, controlling them with restraints that make every second of engagement a daunting proposition.\n\nNorman is the embodiment of a true boxer-puncher, a pure boxer's nightmare. He's armed with not just experience, skill and power but also an iron will and determination. He has an underdog mentality, thrives on proving the naysayers wrong. He turns skepticism into fuel for domination. When his skill isn't enough, his will acts as a lifeline, keeping his unblemished record intact thus far.\n\nUnderstanding Haney's style\n\nDevin Haney, right, scored a unanimous decision against Jose Ramirez in New York City in May. Photo by Cris Esqueda/Golden Boy/Getty Images\n\nHaney's style is built on problem-solving. If there is a problem in the ring, he has the answer. He's a pure boxer with respectable punching power who outmaneuvers and outpositions opponents with calculated technique and movements. Haney uses angles to gain superior positioning and a sharp, accurate jab to disrupt rhythm and timing.\n\nHe applies subtle footwork to limit his opponents' offensive options. He keeps them off balance by constantly feinting, leaving most out of sync, confused and second-guessing their approach. Then he picks them off, leaving them searching for solutions that he never allows them to find.\n\nHaney does whatever it takes to win. He possesses elite boxing skills, executes a game plan with discipline and has shown the ability to adjust his fight strategy if given a second chance. His footwork is lightning-quick, allowing him to evade, reset and create angles to attack opponents unexpectedly.\n\nAgainst aggressive fighters, he shuts down momentum with tie-ups and well-timed clinches, smothering their attacks before they can build an offensive surge. Haney doesn't let his opponents play. He moves like he is in a dodgeball game, darting, moving, evading and frustrating whomever is across from him.\n\nHaney's most underrated and perhaps most defining quality is his willingness to take risks. Setting his most recent performance aside, he has consistently sought out the toughest challenges available, never shying away from elite competition. (He's fought Vasiliy Lomachenko, George Kambosos twice, Yuriorkis Gamboa and Regis Prograis, all victories.) He operates in a fight-or-flight system, where pressure and uncertainty don't rattle him but instead transform and energize him.\n\nUnder those conditions, his boxing abilities shift into hyper mode, and his preparation reaches full beast mode. One glance at his physique on weigh-in day tells you everything you need to know about the discipline and intensity behind Haney's mindset and training.\n\nHow the fight can play out\n\nWBO welterweight champion Brian Norman Jr., left, has KO power on both hands. Photo by Steve Marcus/Getty Images\n\nStylistically, both the champion, Norman, and the challenger, Haney, have clear paths to victory. I can envision multiple possibilities and outcomes: a disciplined 12-round shutout by Haney, a brutal knockout or decision win by Norman. I've even dreamt of a scenario in which Haney times a right cross after a missed Norman left hook, knocking out the champion. The fight lives in a broad spectrum of potential outcomes, and that's what makes it so compelling.\n\nI expect that this fight will be intense from the opening bell. Norman will likely try to impose himself early, applying pressure to force Haney to use his feet and maintain his distance. It's important to understand that when a fighter is moving laterally, C-stepping around the ring, his base is briefly compromised and he must reestablish his stance before he can punch with either hand.\n\nThe jab is the one area where Norman may feel immediate resistance. Over his career, jab defense hasn't been his greatest strength, as he has often eaten jabs on the bridge of the nose because of a lack of head movement. Haney has built a career on possessing one of the most accurate and effective jabs in the sport. Still, a fast, assertive start from Norman could disrupt Haney's rhythm and reduce the efficiency of that jab before it becomes a real problem. Forcing Haney on the retreat is much needed for control.\n\nApplying pressure is essential for Norman, but how he applies it is absolutely crucial. Haney possesses one of the highest ring IQs in boxing. He defeated Lomachenko, a living legend whose technical skills are etched into the sport's history. Haney thrives on reading patterns, picking up on undisguised approaches, bad technical habits and repetitive sequences that opponents don't conceal well enough. Just watch Haney vs. Kambosos 1 and 2. Haney's pattern recognition and execution of his game plan were exceptional in both fights.\n\nAs Norman closes the distance to land his power shots, he often uses a 2-1 combination (a right cross followed by a jab) while simultaneously going airborne toward his opponent. In those moments, he leaves himself open for a split second. If that entry pattern repeats, Haney has the vision and timing to exploit it, catching Norman on the way in before he can get to his preferred position at mid-range to inside. It can also heighten Haney's punching power, creating a head-on collision on the chin of Norman.\n\nHaney isn't without flaws, which are evident on film. Depending on which version shows up on fight night, his earlier self or his more recent form, some patterns and habits can be exploited by Norman. From Haney's bow-and-arrow jab (right hand pulled back) to his wide left hook, still seen in both forms of Haney, or his tendency to bend consistently to one side (usually the right) to avoid getting hit, these habits leave openings. Even a well-schooled boxer like Haney becomes vulnerable.\n\nNorman's ability to punch while his opponents are throwing punches will be a key factor in this matchup. His left hook off a jab, or stepback, is particularly dangerous, capable of exploiting the opening Haney often leaves when he jabs and slightly drops his right glove below his chin. Similarly, Norman's uppercut or left hook can catch Haney as he dips to his right under pressure, searching for cover. Those subtle tendencies could take away some of Haney's tactical and technical abilities, but only if Norman times his shots perfectly.\n\nThe challenge for Norman is that he hasn't faced a style quite like the one Haney will bring on Saturday.\n\nWho wins?\n\nMost power punchers rely on having their feet set to maximize power. Their mentality is simple: Knock out the opponent. But when you're up against a mobile tactician with fleet feet and deep ring smarts, power alone isn't enough. It only works if you can land it. I know from experience. When I was fighting, I had the right amount of athleticism and could learn any new skills and tactics needed to chokehold just about any style. Norman has already proven he is explosive and has a high level of athleticism. If he can combine that power with efficient movement to cut off the ring and utilize timing, he has a real chance to outmaneuver, outfight and even knock out Haney.",
  "summary": "Timothy Bradley Jr. breaks down the Brian Norman Jr.-Devin Haney title fight, and shares his thoughts on how the fight could play out.",
  "published": "Thu, 20 Nov 2025 08:35:05 EST",
  "url": "https://www.espn.com/boxing/story/_/id/47024034/can-david-haney-avoid-brian-norman-jr-left-hook-their-boxing-match",
  "source": "www.espn.com - TOP"
}