{
  "title": "Markets digest bank earnings after recent turmoil",
  "text": "JPMorgan Chase on Friday reported first-quarter profit and revenue that roundly beat expectations, boosted by a year of rate hikes from the Federal Reserve.\n\nThe New York-based bank posted a profit of $12.6 billion or $4.10 per share. That’s up from $8.3 billion, or $2.63 per share from the same period a year before. Analysts expected earnings of $3.41 per share, according to Refinitiv.\n\nWith $3.67 trillion in assets, JPMorgan Chase is the largest bank in the United States and a bellwether for the US economy.\n\n“The US economy continues to be on generally healthy footings — consumers are still spending and have strong balance sheets, and businesses are in good shape. However, the storm clouds that we have been monitoring for the past year remain on the horizon,” CEO Jamie Dimon said in a press release.\n\nNet interest income rose to $20.8 billion, up 49% from the prior year, driven by the aggressive interest rate campaign the Fed kicked off last year to stabilize prices.\n\nDeposits rose to $2.38 trillion during the first quarter from $2.34 trillion in the quarter ended in December. That comes after the banking tumult last month triggered a rush into big banks from nervous customers. Investors also looked to money market funds as a haven.\n\nA key point of conversation after last month’s turmoil in the banking sector has been whether banks could tighten lending standards, leading customers to spend less as it becomes more difficult to borrow money for large purchases like homes and cars.\n\n“Financial conditions will likely tighten as lenders become more conservative, and we do not know if this will slow consumer spending,” Dimon said, adding that JPMorgan Chase is “confident that we can serve the needs of our customers and clients in all environments.”\n\nShares of JPMorgan Chase climbed 6.1% in pre-market trading. The company’s post-earnings conference call is slated for 8:30 a.m. ET.",
  "summary": "",
  "published": "Fri, 14 Apr 2023 20:00:28 GMT",
  "url": "https://www.cnn.com/business/live-news/stock-market-bank-earnings/index.html",
  "source": "CNN.com - RSS Channel - World"
}