{
  "title": "Deaves given Wales debut as All Blacks make 12 changes",
  "text": "Deaves' inclusion means Tandy has instigated another back-row reshuffle with Aaron Wainwright switching back to number eight to replace hamstring victim Cracknell, who was player-of-the-match in his first Test start against Japan.\n\nAlex Mann reverts to his more familiar blind-side role to allow Deaves to slot in at open-side flanker.\n\nDeaves was called up to the squad after the loss of Ospreys and Wales captain Jac Morgan to a dislocated shoulder suffered in the 52-28 defeat by Argentina.\n\nThe 24-year-old from Pontyclun was a roofer during his academy days and has defied the critics who in the past have called him too small, at a shade under 6ft (182cm) and weighing 15st 1lb (96kg).\n\n\"Harri making his debut is an amazing story,\" said Tandy, himself a former Ospreys open-side flanker.\n\n\"His performances for the Ospreys, both sides of the ball, have been outstanding. I love how he plays the game.\n\n\"He's a smaller rugby player and the way he plays he adds physicality - his speed and aggression are there for everyone to see.\n\n\"It's an amazing opportunity for Harri and we can't wait to see him go on Saturday.\"\n\nDeaves is the only specialist open-side in the squad after Tandy opted to overlook Leicester flanker Tommy Reffell, who would not have been available for the Springboks finale on 29 November which is outside World Rugby's official Test window.\n\nMann impressed in the number seven shirt against Japan, while Wales will continue to monitor Wainwright's fitness after he came off last weekend.\n\nIf the Dragons number eight is ruled out, Taine Plumtree would step up from the bench with uncapped Ospreys back row Morgan Morse in line to be promoted to a replacement role.",
  "summary": "Uncapped Ospreys flanker Harri Deaves will make his first Wales start against New Zealand on Saturday.",
  "published": "Thu, 20 Nov 2025 09:05:48 GMT",
  "url": "https://www.bbc.com/sport/rugby-union/articles/cew4w52kp0xo?at_medium=RSS&at_campaign=rss",
  "source": "BBC Sport"
}