{
  "title": "Judge sides with Meta in antitrust trial, will not spin off WhatsApp and Instagram",
  "text": "Judge sides with Meta in antitrust trial, will not spin off WhatsApp and Instagram\n\ntoggle caption Tony Avelar/AP\n\nA federal judge on Tuesday handed Meta a victory, ruling against the Federal Trade Commission (FTC) in an antitrust suit that claimed the social media giant stifled competition and bolstered a monopoly by buying upstart rivals.\n\nThe FTC sued Meta five years ago alleging anti-competitive behavior in what has amounted to the biggest legal challenge yet to one of the world's most influential social media companies. The case followed an investigation that began during the first Trump administration.\n\nSponsor Message\n\nExperts say it is part of a series of cases brought by the government to try to rein in \"big tech\" on antitrust grounds, targeting Meta, Google , Amazon and Apple .\n\nThe FTC's suit contended that Facebook, which later became Meta, overpaid to acquire Instagram in 2012 and WhatsApp in 2014 as part of a \"buy or bury\" strategy to eliminate competitors and protect what it alleged is a monopoly in social networking.\n\nThe FTC argued that the only way to resolve Meta's alleged monopoly power was for the company to be broken up. In legal filings, government lawyers said a judge should order Meta to spin off Instagram and WhatsApp into separate companies, to give rivals more room to compete and users more choices.\n\nIn a memorandum opinion, U.S. District Judge James Boasberg wrote that the FTC had not demonstrated that Meta holds a monopoly in social media. Notably, he wrote that the world of what was once called \"personal social networking\" has changed — giving rise to new competitors and seeing YouTube become a more dominant force.\n\n\"Believing that the only constant in the world was change, the Greek philosopher Heraclitus posited that no man can ever step into the same river twice. In the online world of social media, the current runs fast, too,\" Boasberg wrote.\n\nSponsor Message\n\n\"The landscape that existed only five years ago when the Federal Trade Commission brought this antitrust suit has changed markedly. While it once might have made sense to partition apps into separate markets of social networking and social media, that wall has since broken down.\"\n\nHe noted that two court opinions on motions to dismiss \"did not even mention the word 'TikTok'. Today, that app holds center stage as Meta's fiercest rival.\"\n\nFTC spokesperson Joe Simonson said in a statement emailed to NPR that the agency was \"deeply disappointed\" by the decision and he questioned Boasberg's impartiality.\n\n\"The deck was always stacked against us with Judge Boasberg,\" he said.\n\nRepublicans have been unhappy with Boasberg, who has presided over deportation-related cases and issued rulings that the Trump administration has opposed. Trump has referred to him as a \"Radical Left Lunatic of a Judge\" and called for his impeachment, which several conservative members of Congress are pursuing.\n\nIn an emailed statement to NPR, Meta's Chief Legal Officer Jennifer Newstead welcomed Boasberg's decision in the antitrust case. \"The Court's decision today recognizes that Meta faces fierce competition. Our products are beneficial for people and businesses and exemplify American innovation and economic growth. We look forward to continuing to partner with the Administration and to invest in America,\" Newstead wrote.\n\nDuring the trial , which ended in May, Meta's lawyers argued that the company faces ample competition and that it bought Instagram and WhatsApp because they were good products. Its attorneys argued that federal authorities were attempting to punish the company for its success, noting that regulators approved both takeovers at the time.\n\nIn court, Meta CEO Mark Zuckerberg was peppered with questions about his motives for pursuing the acquisitions. Asked about Instagram, he told the court he was impressed with Instagram's product and decided it was better to buy the app than invest in building one in-house.\n\nBill Kovacic, a professor at George Washington University's law school and former chairman of the FTC, said the outcome was a decisive victory for Meta. He noted that it comes on the heels of a remedy ruling in the Department of Justice's antitrust case against Google. Although a federal judge ruled that Google held a monopoly in internet search , Kovacic said, some observers saw the punishment as soft after the judge declined to force Google to sell its Chrome browser.\n\nSponsor Message\n\nAntitrust lawsuits may not be helpful ways to put guardrails around big, fast-moving tech companies, Kovacic said. \"Those two data points might suggest to you this is the wrong methodology.\"\n\nHe said there may now be renewed debate about the need for fresh regulations to keep tech companies in line when it comes to competitive behavior as well as things like user safety and security.\n\n\"We see an interesting alliance on the left and the right hand side of the political spectrum in Congress, saying that big tech does present a serious question about control, behavior and oversight,\" he said. \"There seems to be a coalition that's willing to take some measures, although finding common cause about a specific program seems to have been elusive.\"\n\nLegal watchers had previously noted that Zuckerberg and Meta had made efforts during Trump's second term to thaw his notoriously frosty relationship with the president — and speculated that it might prompt Trump to push the FTC to settle the suit.\n\nTrump had sued Meta after his social media accounts were suspended in the wake of the Jan. 6, 2021 attack on the Capitol. This January, Meta paid $25 million to settle that lawsuit. The same month, Meta also ended its fact-checking program , which some conservative critics had alleged was biased and a form of censorship. Meta donated $1 million to the president's inauguration fund.\n\nThe Wall Street Journal reported in April that Zuckerberg's efforts to settle with the FTC were rebuffed.\n\nIt is unclear if the government will appeal. The FTC's Simonson said the commission was \"reviewing all our options.\"",
  "summary": "A federal judge ruled against the Federal Trade Commission's antitrust suit alleging that Meta had stifled competition by buying up its rivals.",
  "published": "Tue, 18 Nov 2025 14:01:30 -0500",
  "url": "https://www.npr.org/2025/11/18/nx-s1-5495626/meta-ftc-instagram-whatsapp-antitrust-ruling",
  "source": "NPR Topics: Business"
}