{
  "title": "Brain training game offers new hope for drug-free pain management",
  "text": "A trial of an interactive game that trains people to alter their brain waves has shown promise as a treatment for nerve pain -- offering hope for a new generation of drug-free treatments.\n\nThe PainWaive technology, developed by UNSW Sydney researchers, teaches users how to regulate abnormal brain activity linked to chronic nerve pain, offering a potential in-home, non-invasive alternative to opioids.\n\nA recent trial of the technology, led by Professor Sylvia Gustin and Dr Negin Hesam-Shariati from UNSW Sydney's NeuroRecovery Research Hub, has delivered promising results, published in the Journal of Pain.\n\nThe study compared hundreds of measures across participants' pain and related issues like pain interference before, during and after four weeks of interactive game play. Their brain activity was tracked via EEG (electroencephalogram) headsets, with the app responding in real time to shifts in brainwave patterns.\n\nThree out of the four participants showed significant reductions in pain, particularly nearing the end of the treatment. Overall, the pain relief achieved by the three was comparable to or greater than that offered by opioids.\n\n\"Restrictions in the study's size, design and duration limit our ability to generalise the findings or rule out placebo effects,\" Dr Hesam-Shariati says.\n\n\"But the results we've seen are exciting and give us confidence to move to the next stage and our larger trial.\"\n\nThe PainWaive project builds on UNSW Professor Sylvia Gustin's seminal research into changes in the brain's thalamus -- a central relay hub in the brain -- associated with nerve (neuropathic) pain.\n\n\"The brainwaves of people with neuropathic pain show a distinct pattern: more slow theta waves, fewer alpha waves, and more fast, high beta waves,\" Prof. Gustin says.\n\n\"We believe these changes interfere with how the thalamus talks to other parts of the brain, especially the sensory motor cortex, which registers pain.\"\n\n\"I wondered, can we develop a treatment that directly targets and normalises these abnormal waves?\"\n\nThe challenge was taken up by an interdisciplinary team at UNSW Science and Neuroscience Research Australia (NeuRA), led by Prof. Gustin and Dr Hesam-Shariati, and resulted in PainWaive.\n\nThe four participants in its first trial received a kit with a headset and a tablet preloaded with the game app, which includes directions for its use. They were also given tips for different mental strategies, like relaxing or focusing on happy memories, to help bring their brain activity into a more \"normal\" state.\n\nThe user data, meanwhile, was uploaded to the research team for remote monitoring.\n\n\"After just a couple of Zoom sessions, participants were able to run the treatment entirely on their own,\" says Dr Hesam-Shariati.\n\n\"Participants felt empowered to manage their pain in their own environment. That's a huge part of what makes this special.\"\n\nInitially, Dr Hesam-Shariati says, the team planned to use existing commercial EEG systems, but they were either too expensive or didn't meet the quality needed to deliver the project. Instead, they developed their own.\n\n\"Everything except the open-source EEG board was built in-house,\" says Dr Hesam-Shariati. \"And soon, even that will be replaced by a custom-designed board.\"\n\nThanks to 3D printing, Prof. Gustin says, the team has cut the cost of each headset to around $300 -- a fraction of the $1,000 to $20,000 price tags of existing systems.\n\nThe headset uses a saline-based wet electrode system to improve signal quality and targets the sensorimotor cortex.\n\n\"We've worked closely with patients to ensure the headset is lightweight, comfortable, and user-friendly,\" says Prof. Gustin.\n\n\"Owning the technology offers us the potential to one day offer PainWaive as a truly affordable, accessible solution for at-home pain management, especially for those with limited access to traditional treatments.\"\n\nThe researchers are now calling for participants to register their interest in two upcoming trials of the neuromodulation technology: the Spinal Pain Trial, investigating its potential to reduce chronic spinal pain, and the StoPain Trial, exploring its use in treating chronic neuropathic pain in people with a spinal cord injury.",
  "summary": "A trial of an interactive game that trains people to alter their brain waves has shown promise as a treatment for nerve pain -- offering hope for a new generation of drug-free treatments.",
  "published": "Mon, 02 Jun 2025 15:53:30 EDT",
  "url": "https://www.sciencedaily.com/releases/2025/06/250602155330.htm",
  "source": "Latest Science News -- ScienceDaily"
}