{
  "title": "'Boycott politics never work': SA Prez reacts to Trump's no-show at G20; US fires sharp response",
  "text": "‘WATCH YOUR TONE!’: Leavitt FUMES After Ramaphosa 'Laughs' At Trump’s Last-minute G20 ‘Scramble’\n\n\n\n\n\nSouth African President Cyril Ramaphosa on Friday said the United States had shown signs of reconsidering its G20 boycott, calling it a “positive sign” and insisting that “boycott politics never work,” even as the White House dismissed his claim as “fake news” and accused him of “running his mouth. ”“In a way, we see this as a positive sign because, as I’ve often said, boycott politics never work. It’s always best to be inside the tent than being outside of the tent,” the President added.Ramaphosa said Pretoria had received a last-minute communication suggesting Washington might participate “in one shape or form or other” at the Johannesburg summit. “We have received notice from the United States, a notice which we are still in discussions with them over, about a change of mind, about participating in one shape or form or other in the summit,” he said. “This comes at the late hour before the summit begins. And so therefore, we do need to engage in those types of discussions to see how practical it is and what it finally really means.”The White House rejected any suggestion of a reversal. A senior official said only the acting ambassador, Marc D Dillard, would attend the ceremonial handover of the G20 presidency. “This is fake news. The chargé d'affaires in Pretoria will attend the handover ceremony as a formality, but the United States is not joining G20 discussions,” the official said.White House Press Secretary Karoline Leavitt reinforced Washington’s position. “The United States is not participating in official talks at the G20 in South Africa,” she said. She added: “I saw the South African president running his mouth a little bit against the United States and the president of the United States earlier today, and that language is not appreciated by the president or his team.” She noted that Dillard would only “receive that send off at the end of the event” and would not “participate in official talks. ”Ramaphosa reiterated that the United States “needs to be here,” saying: “The United States, being the biggest economy in the world, needs to be here. So it's pleasing to hear that there is a change of approach.”The US boycott follows allegations from Washington that South Africa discriminates against white people and Trump’s claims of violence against white Afrikaner farmers, assertions widely rejected in South Africa. Pretoria said Washington also pressured it not to issue a joint G20 declaration, arguing consensus would be impossible without the United States.Ramaphosa pushed back. “We will have a declaration. The talks are going extremely well. I’m confident we are moving towards a declaration, and they are now just dotting the i’s and crossing the t’s,” he said. “We will not be bullied. We will not agree to be bullied.”The US embassy had separately informed Pretoria that South Africa’s G20 agenda “run counter to the US policy views and we cannot support consensus on any documents negotiated under your presidency.”The summit, the first hosted by an African nation, focuses on debt relief for low-income countries, a just energy transition and securing critical minerals. While leaders including Xi Jinping, Vladimir Putin and Javier Milei skipped the event, they sent delegations.Political tensions between the two countries have intensified during Trump’s second term, with high US tariffs on South African goods, Pretoria’s ambassador being expelled and Washington also boycotting the COP30 climate talks in Brazil.Despite the diplomatic friction, US business interests in South Africa remain strong, with more than 600 American companies operating in the country. “The US Chamber of Commerce will use our B20 leadership to foster international collaboration,” chamber head Suzanne Clark said.G20 ambassador Xolisa Mabhongo summed up the stand-off, saying: “The only country that is not in the room is the United States and, of course, it is their choice not to be in the room.”",
  "summary": "South Africa's President Cyril Ramaphosa stated the United States indicated a possible change of mind regarding its G20 summit boycott. The White House swiftly rejected this, calling it fake news and confirming only a formal handover ceremony attendance. Tensions remain high as South Africa hosts the G20 for the first time.",
  "published": "Fri, 21 Nov 2025 10:07:30 +0530",
  "url": "https://timesofindia.indiatimes.com/world/us/boycott-politics-never-work-south-africa-president-reacts-to-trumps-no-show-at-g20-us-fires-sharp-response/articleshow/125476117.cms",
  "source": "Times of India"
}