{
  "title": "Mediterranean diet provides symptom relief for patients with IBS in pilot study",
  "text": "A pilot study from Michigan Medicine researchers found that the Mediterranean diet may provide symptom relief for people with irritable bowel syndrome.\n\nStudy participants were randomized into two groups, one following the Mediterranean diet and the other following the low FODMAP diet, a common restrictive diet for IBS.\n\nIn the Mediterranean diet group, 73% of the patients met the primary endpoint for symptom improvement, versus 81.8% in the low FODMAP group.\n\nIrritable bowel syndrome affects an estimated 4-11% of all people, and a majority of patients prefer dietary interventions to medication.\n\nThe low FODMAP diet leads to symptom improvement in more than half of patients, but is restrictive and hard to follow.\n\nPrevious investigations from Michigan Medicine researchers into more accessible alternative diets led to a proposed \"FODMAP simple,\" which attempted to only restrict the food groups in the FODMAP acronym that are most likely to cause symptoms.\n\n\"Restrictive diets, such as low FODMAP, can be difficult for patients to adopt,\" said Prashant Singh, MBBS, Michigan Medicine gastroenterologist and lead author on the paper.\n\n\"In addition to the issue of being costly and time-consuming, there are concerns about nutrient deficiencies and disordered eating when trying a low FODMAP diet. The Mediterranean diet interested us as an alternative that is not an elimination diet and overcomes several of these limitations related to a low FODMAP diet.\"\n\nThe Mediterranean diet is already popular among physicians for its benefits to cardiovascular, cognitive, and general health. Previous research on the effect of the Mediterranean diet on IBS, however, had yielded conflicting results.\n\nIn this pilot study, two groups of patients were provided with either a Mediterranean diet or the restriction phase of a low FODMAP diet for four weeks.\n\nThe primary endpoint was an FDA-standard 30% reduction in abdominal pain intensity after four weeks.\n\nAll the patients included in the study were diagnosed with either IBS-D (diarrhea) or IBS-M (mixed symptoms of constipation or diarrhea).\n\nThis study was the first randomized controlled trial to compare the Mediterranean diet to another potential diet. (Previous studies had compared the Mediterranean diet to the individuals' typical diets or were not randomized controlled trials.)\n\nWhile the Mediterranean diet did provide symptom relief, the low FODMAP group experienced a greater improvement measured by both abdominal pain intensity and IBS symptom severity score.\n\nResearchers found the results of this pilot study -- which 20 patients completed -- sufficiently encouraging to warrant future, larger controlled trials to investigate the potential of the Mediterranean diet as an effective intervention for patients with IBS.\n\n\"This study adds to a growing body of evidence which suggests that a Mediterranean diet might be a useful addition to the menu of evidence-based dietary interventions for patients with IBS,\" said William Chey, M.D., chief of Gastroenterology at the University of Michigan, president-elect of the American College of Gastroenterology, and senior author on the paper.\n\nThe researchers believe studies comparing long-term efficacy of the Mediterranean diet with long-term outcomes following the reintroduction and personalization phases of low FODMAP are needed.",
  "summary": "In a comparative pilot study, the Mediterranean diet and the low FODMAP diet both provided relief for patients with IBS.",
  "published": "Fri, 30 May 2025 12:41:32 EDT",
  "url": "https://www.sciencedaily.com/releases/2025/05/250530124132.htm",
  "source": "Latest Science News -- ScienceDaily"
}