{
  "title": "Massa can continue part of £64m 'Crashgate' lawsuit",
  "text": "Former Ferrari driver Felipe Massa can continue part of his legal action over the 'Crashgate' scandal at the Singapore Grand Prix in 2008, but has had other elements of his case dismissed by the High Court.\n\nA court ruling said Massa can try to recover damages in regards to the controversy, but rejected his claim for a declaration he should have won the 2008 drivers' title.\n\nThe Brazilian launched legal action against former F1 boss Bernie Ecclestone, Formula 1 and governing body the FIA over an alleged \"conspiracy\" he says denied him the title, which was won by McLaren's Lewis Hamilton.\n\nMassa was leading in Singapore when Nelson Piquet Jr deliberately crashed to create an opportunity for his Renault team-mate Fernando Alonso to win the race.\n\nMassa believes that if F1 chiefs had investigated the incident sooner and the result had been annulled, he would have been crowned world champion. The 44-year-old is seeking compensation in the region of about £64m.\n\nAt a hearing last month the defendants - Ecclestone, F1 and the FIA - attempted to get the case thrown out, saying it was Massa's performance which stopped him winning the title and the matter had been brought too late.\n\nMr Justice Jay handed down his ruling from that hearing on Thursday. He allowed the matter to proceed and said Massa had a \"real prospect of proving at trial\" his case for damages.\n\nHe rejected the defendants' claim the issue had been brought to court too late, as Massa had only discovered facts to help him in his case as recently as 2023 - when Ecclestone gave an interview speaking about the 2008 incident.\n\nHowever, to allow the declaration element of Massa's case to proceed \"comes too close in my view to impinging on the right of the FIA to govern its own affairs\", the judge said.\n\n\"Mr Massa is not entitled to claim declaratory relief for reputational or publicity reasons,\" he added.\n\n\"The present claim cannot of course rewrite the outcome of the 2008 drivers' world championship, but if declaratory relief along the lines sought were granted that is how Mr Massa would present his victory to the world and it is also how it would be perceived by the public.\"\n\nMassa welcomed the ruling, saying in a statement it marked \"a great day for me, for justice, and for everyone who loves Formula 1\" and reasserted his belief the crash \"stole the World Championship from me\".\n\nThe FIA, meanwhile, pointed to elements of Massa's claim being dismissed and said while the matter could proceed, it was \"on significantly narrowed grounds\".",
  "summary": "Felipe Massa can continue part of his legal action over the 'Crashgate' scandal at the 2008 Singapore Grand Prix, but has other elements of his case dismissed by the High Court.",
  "published": "Thu, 20 Nov 2025 16:06:39 GMT",
  "url": "https://www.bbc.com/sport/formula1/articles/c4gpg757j2lo?at_medium=RSS&at_campaign=rss",
  "source": "BBC Sport"
}