{
  "title": "EAM meets President Putin ahead of his visit for India-Russia annual summit",
  "text": "IN MOSCOW for the Shanghai Cooperation Organisation (SCO) Heads of State Council meeting, External Affairs Minister S Jaishankar on Tuesday said the world must display “zero tolerance” towards terrorism, asserting that there can be no justification, no looking away and “no whitewashing”.\n\nWith barely weeks to go for Russian President Vladimir Putin’s visit to India, External Affairs Minister S Jaishankar on Tuesday called on the President during his visit. “Called on President Putin along with other Heads of SCO Delegations this afternoon,” Jaishankar said in a post on X.\n\nThe meeting at Kremlin was also attended by Russian Prime Minister Mikhail Mishustin, Iranian Vice-President Mohammad Reza Aref, Prime Ministers Alexander Turchin of Belarus, Oljas Bektenov of Kazakhstan, Adylbek Kasymaliyev of Kyrgyzstan, Kokhir Rasulzoda of Tajikistan and Abdulla Aripov of Uzbekistan, as well as Pakistani Deputy PM Ishaq Dar and SCO Secretary General Nurlan Yermekbayev.\n\nA day earlier, Jaishankar held extensive talks with his Russian counterpart Sergey Lavrov as the two sides prepared for President Putin’s visit to India for the 23rd India-Russia annual summit. The Russian president is expected to visit India around December 5 to hold talks with Prime Minister Narendra Modi; the dates are yet to be announced by either side.\n\nDuring Putin’s visit, the two sides aim to finalise a number of bilateral agreements, and also announce several new initiatives and projects.\n\nEarlier in the day, while addressing the SCO meet, Jaishankar said the world must display “zero tolerance” towards terrorism in all its forms and manifestations.\n\n“As India has demonstrated, we have the right to defend our people against terrorism, and will exercise it,” the External Affairs Minister said in his address.\n\nStory continues below this ad\n\nHe said India believes that the SCO must “adapt to the changing global landscape, develop an expanded agenda and reform its working methods”. “We will contribute positively and fully to these objectives,” he said.\n\n“We must never forget that the SCO was founded to combat the three evils of terrorism, separatism and extremism. These threats have become even more serious in the years that have passed,” he said, “It is imperative that the world displays zero tolerance towards terrorism in all its forms and manifestations. There can be no justification, no looking away and no whitewashing.”\n\nThe SCO was founded at a summit in Shanghai in 2001 by the presidents of Russia, China, the Kyrgyz Republic, Kazakhstan, Tajikistan and Uzbekistan. India and Pakistan became its permanent members in 2017, while Iran joined the grouping in 2023.\n\nJaishankar also emphasised the prevailing economic situation and stressed the importance of free trade agreements that New Delhi has recently signed with several countries. “We assess the global economic situation to be particularly uncertain and volatile currently. Supply side risks have been aggravated by demand side complexities. There is consequently an urgent requirement to de-risk and diversify. This is best done by as many of us, forging the widest possible economic links,” he said.\n\nStory continues below this ad\n\n“India’s endeavours to conclude free trade agreements with many of us here are relevant,” Jaishankar said, as the theme of the session covered trade, economic, cultural and humanitarian cooperation. Jaishankar also underlined that SCO must keep up with contemporary changes.\n\nOn the sidelines of the SCO, Jaishankar also met Mongolia’s Prime Minister Gombojavyn Zandanshatar and Qatari PM Sheikh Mohammed bin Abdulrahman Al Thani, among others.\n\nIn New Delhi, ahead of Putin’s visit, Nikolai Patrushev, Aide to President Putin and Chairman of the Maritime Board of Russia, called on PM Modi, a day after his meeting with National Security Advisor Ajit Doval.\n\n“We had productive discussions on cooperation in the maritime domain, including new opportunities for collaboration in connectivity, skill development, shipbuilding and blue economy,” PM Modi said in a post on X.",
  "summary": "",
  "published": "Tue, 18 Nov 2025 20:15:22 +0000",
  "url": "https://indianexpress.com/article/india/eam-meets-president-putin-ahead-of-his-visit-for-india-russia-annual-summit-10373295/",
  "source": "India | The Indian Express"
}