{
  "title": "‘Possibly the most prolific sex offender in British history’: the inside story of the Medomsley scandal",
  "text": "When I met Kevin Young in 2012 he was in his early 50s, handsome, charismatic, smart – and utterly broken. The moment he started talking about Medomsley detention centre he was in tears.\n\nYoung was born in Newcastle, in 1959. At two, he was taken into care, and his parents were convicted of wilful neglect. At eight, at a school in Devon, he was sexually abused by the gardener. At 14, at St Camillus, a Catholic residential school in Yorkshire, he was sexually assaulted by the headteacher, James Bernard Littlewood. But none of this compared with his experience at Medomsley, a youth detention centre in north-east England.\n\nHe was sent there in 1977, aged 17, after being convicted of receiving stolen property – his brother had given him a watch, the first he had ever owned. The police asked if he knew where it had come from. No, he said. Could it possibly have been stolen, they asked. He thought about it. Well, yes, possibly. He was sentenced to three months’ detention.\n\nFor many young men, a short sentence became a life sentence\n\nThe morning after he arrived at Medomsley, he was picked out by prison officer and caterer Neville Husband to work in the kitchen. Husband was a skilled predator. First, he checked Young’s files to see if he was likely to be visited by family. Second, he checked to see if he was a “reliable” victim. “A reliable victim is someone who has already been abused to the point where, if they do speak out, who on earth is going to believe them?” Young told me and my late colleague, the former Guardian prison correspondent Eric Allison. “And who on earth is going to believe Kevin Young, the pauper’s son, who has been in and out of care, who’s a knife-wielding thug, a bully?” That is how a number of care home reports described Young, even though he told us he had been a quiet, over-obedient boy. “The truth is, nobody would have believed me.”\n\nYoung was raped repeatedly, tied up and ligatured around the neck. “It was the worst of the worst. I thought I was going to be killed,” he said. “I was told by Husband that you could easily be found hanged at Medomsley, and that six boys had already hanged themselves that year.” It wasn’t true, but how was Young to know? He stayed silent.\n\nView image in fullscreen Kevin Young, who was abused while in the Medomsley detention centre as a young teenager. Photograph: Gary Calton\n\nHusband, who was married with one child, took Young to his own home, just outside the prison gates. “I was blindfolded and made to lie on the stairs. Then three or four others raped me as well. I could see them from the bottom of the blindfold. A rope was put around my neck and turned till I passed out. Husband was an expert at it. He was a big, stocky, powerful man.”\n\nOn 17 June 1977, a day before his 18th birthday, Kevin Young was released and went straight to the nearest police station. “I explained to the officer that I’d just been released from Medomsley, where I’d been subjected to a constant series of assaults by one of the officers and others I couldn’t identify,” he said. “I showed him the marks on my neck where I’d been ligatured the night before. I was told it was a criminal offence to make such allegations against a prison officer because I was on licence. They were basically threatening to take me back to Medomsley, so I scarpered pretty quick.”\n\nWhen Husband retired from the prison service in 1990 he was awarded the imperial service medal, for long and meritorious service. In 1994, he was inducted as a minister by the United Reformed church. In 2003, he was convicted of 10 counts of indecent assault and one count of rape against five teenagers at Medomsley, including Young. Husband was initially sentenced to eight years in prison. In 2005, he was charged with four further offences and his sentence extended to 10 years. But he was released in 2009, having served barely half his time. A year later he died of natural causes.\n\nLast week, a special investigation by the prisons and probation ombudsman (PPO) for England and Wales, Adrian Usher, concluded he was “possibly the most prolific sex offender in British history”.\n\nView image in fullscreen The late Eric Allison, former Guardian prison correspondent, who did groundbreaking reporting on the Medomsley scandal. Photograph: David Levene/The Guardian\n\nAllison and I first wrote about Husband and those he abused in a piece published 13 years ago. The headline was A true horror story: The abuse of teenage boys in a detention centre. But we didn’t know the half of it. Medomsley was run along military lines, with a “short, sharp, shock” approach to punishment. Detainees were often sent there for trivial offences, and physical and sexual abuse continued for three decades, on an industrial scale.\n\nAfter Husband was convicted, there was some coverage in the media – mainly local papers. But the story was soon forgotten. After all, these boys had been sent to a detention centre. It was presumed they deserved a short, sharp shock, if not quite as shocking as it turned out. When we wrote about three of Husband’s victims in 2012, it was the first time they had told their stories to a national newspaper. Each one told us they felt dead inside.\n\nOur story led to an investigation by Durham police known as Operation Seabrook, which lasted a decade, with 2,077 former inmates alleging abuse by Husband and others at Medomsley. Operation Seabrook led to Usher’s investigation, Operation Deerness, which considered how the abuse was allowed to carry on for so long and what opportunities were missed to stop it.\n\nWhen the Deerness report was published last week, all the British media covered it. Husband’s face was plastered across TV channels and newspapers. The findings were horrifying. There have now been 2,852 allegations of physical or sexual abuse at Medomsley. Of the 549 sexual abuse allegations, 388 were made against Husband, 33 were made against Husband’s colleague, “store man” Leslie Johnston, which leaves 128 allegations of sexual abuse against people unnamed.\n\nI had a request to meet a victim in person. He wanted to tell me that Operation Seabrook had saved his life\n\nBoys were not only abused at Medomsley, but taken to a local church, an amateur dramatics society and a farm to be raped by multiple people. Two boys died at Medomsley. A number of former inmates, known in detention centres as “trainees”, went to Durham police straight after their release to allege they had been sexually abused. In most cases, they were told not to make a formal complaint unless they wanted to find themselves back at the detention centre. Occasionally, allegations were handed back to Medomsley to investigate, and the institution always, unsurprisingly, cleared itself.\n\nThe stories in the report are stomach-churning. Usher, a former police officer with decades of experience, was sickened. “I’ve never seen the level of damage that has been done to these, at the time, young men,” he told me. “Some of them have been unable to form human relationships, even friendships, never mind intimate relationships; have been unable to hold down jobs, have become agoraphobic and had a deep, persistent mistrust of authority and the state. For many young men, a short sentence became a life sentence.” The prison, the Ministry of Justice, the police and the Home Office are all held accountable in Usher’s report for failing to stop Husband and his fellow abusers.\n\nYet the victims of Medomsley believe this report is a sop, and that it should not have been commissioned. They say that, however good a job the PPO has done, the report could never provide the answers they might get at a public inquiry, where witnesses can be compelled to give evidence under oath. Only with a public inquiry, they say, would they be able to find out the answers to their myriad questions about why the abuse was allowed to continue for three decades. At best, they believe the report is a small step towards justice. At worst, they believe it is a distraction.\n\nView image in fullscreen Medomsley detention centre in County Durham. Photograph: Mirrorpix/Getty Images\n\nMedomsley opened in 1961 and closed in 1987. It could hold up to 130 detainees. Detention centres were tougher institutions than borstals, which were founded on the principle of rehabilitation rather than punishment. Trainees were supposed to be aged 17 to 21, but the PPO’s report acknowledges it held boys as young as 14. There were 17 allegations of sexual abuse made to Operation Seabrook for the period between 1961 and 1969. Husband began working at Medomsley in 1969, and between that year and 1987 there were 532 allegations.\n\nHusband’s reign of abuse could easily have been stopped. Eight years before Young was detained, Husband was arrested at Portland borstal in Dorset, charged with importing pornography. The material included sadomasochistic images of teenage boys. Husband admitted showing the material to boys in his care, but argued that he was conducting research into homosexuality. The police took no further action. Details of that arrest were written on top of his employment record and followed him throughout his career. But Medomsley nonetheless employed him; he moved there the year of his arrest.\n\nIn 1989, two years after Medomsley closed, Johnston, a close friend of Husband and a member of the same Freemasons lodge, was charged with sexually assaulting a trainee, Mark Park. He admitted to the assault and further admitted to gross indecency. He stated these acts included oral sex and mutual masturbation, but denied any acts of buggery. Park said he had been given to Johnston by Husband, but no action was taken against the latter. Johnston pleaded guilty to two counts of indecent assault. He was fined £250 and received nine months’ imprisonment, suspended for two years. It was another 14 years until Husband was convicted and 16 years until Johnston was imprisoned.\n\nAstonishingly, after Medomsley, Young managed to rebuild his life. He briefly joined the punk group Angelic Upstarts, then ran a number of successful businesses providing security for property. At one point, he told me and Allison, he was worth almost £2m. Then in 1996, 19 years after leaving Medomsley, he bumped into Husband. Young and his girlfriend were chasing a couple of store robbers in the centre of York, where Young now lived, when he skidded into a man of the church near York Minster. “He was there with his full carry-on, his big hat and all his gear. When I banged him in the chest, it knocked the wind out of him, and as I was falling backwards, his spit was coming down on me. I looked up and there he was. And in that split second I was back 20 years ago, with him on top of me.” By then, Husband was a minister. We asked Young how he was sure it was him? He said he could tell by the spit. “I could taste him. He spat all over me and humiliated me. He opened my mouth and spat into it time and time again.”\n\nAfter this, Young had a breakdown. He lost his money, his business, his girlfriend and his home. He started to drink and became addicted to drugs. He moved into a barn in the middle of nowhere, spoke to no one and gave up on life. Two years later, when he was living in a bedsit, the police tracked him down and put a note through his door asking if he would give evidence about the sexual abuse he had experienced at St Camillus. For months, he ignored the message, but eventually agreed to talk to the police. He told them that what had happened at the school was bad, but that Medomsley was far worse.\n\nView image in fullscreen Among the Medomsley staff convicted were (from left) Christopher Onslow, Neville Husband and Alexander Flavell. Composite: Guardian Design; North News; Tom Wilkinson; Owen Humphreys/PA; Mirrorpix; Trinity Mirror/Getty Images\n\nThe police said they had been after Husband for years. He had recently been the subject of complaints about the abuse of boys and girls in his congregation while working as a minister at two churches in Gateshead, but the parents involved had not wanted to pursue the matter. When his office was later raided, sex aids were found in his drawers and images of child abuse on his computer. Husband often filmed his abuse. Young was taken to a safe house in York where he was shown a film on an 8mm projector of a teenage boy with a rubber covering over his head, being choked. It was him.\n\nYoung’s evidence helped secure the conviction of St Camillus headteacher Littlewood (for cruelty and sex offences) and then of Husband in 2003. Although he became a leading campaigner against child sexual abuse, he never recovered. After Husband’s conviction, he and other victims sued for compensation, and the Home Office fought every allegation. At one point, a doctor was brought forward in court to claim Young was genetically predisposed to being abused. Young received £94,000 in 2009 to compensate for his suffering and lost fortune. He told us he had spent £40,000 fighting his case. When we interviewed him in 2012 he was living in a shed at the bottom of a friend’s garden.\n\nHe died of cancer in 2021, aged 62, having been told the one thing he wanted, a public inquiry, wouldn’t happen. Despite the compensation, there had been no public apology to the abuse victims. In 2010, the then justice minister Jack Straw said: “The terms of the agreement did not include an apology.”\n\nRichard Hall was sent to Medomsley just before Christmas 1979, after pleading guilty to being carried in a stolen car. He was another classic Husband victim. His mother was a sex worker and his father a pimp, and he was briefly placed with foster parents in 1963 before moving from one care home to another. At 12, he had been in 15 homes, and frequently physically or sexually abused. Another “reliable” victim. A week after arriving at Medomsley he was tapped on the shoulder by Husband and told: “You are working for me.” The abuse began almost immediately.\n\nOn one occasion, Husband was about to rape him when he was interrupted by the arrival of Hall’s friend, Martin Wasnidge, another young inmate. Hall was convinced Wasnidge was also abused by Husband; he once saw Husband groping him.\n\nWhen Husband was investigated, before his trial in 2003, Wasnidge was questioned by police as a possible victim. He denied being abused. During the trial, Wasnidge hanged himself in prison and Hall learned of his friend’s death as he stepped out of the witness box. The news left him guilt-ridden, because he was the one who had told police that Wasnidge had been abused. “If I hadn’t done that, he’d still be alive,” Hall said. He believed Wasnidge denied it because he was ashamed.\n\nHall began to drink heavily after his release from Medomsley. At one point, he estimates he was drinking 24 cans of beer a day. By 2012, he was down to 12 cans a day, four days a week. He told us he thought about killing himself every day. One of the things he found most devastating was that staff at Medomsley knew about Husband and kept silent. “Some of them are still employed by the state, others are drawing their pensions,” Hall said. “Do they not feel any shame?”\n\nLast week, I texted him to ask how he felt about the report. “It’s a good, fair report, but we still need a public inquiry. I’m just glad the world knows what went on in that hellhole.” I asked if he would like to chat. He said he would rather not dredge it all back up because he was in a bad way.\n\nView image in fullscreen Boys at Medomsley would try to break their own bones to get away. Photograph: Elliot Michael/Mirrorpix\n\nThe sexual abuse was so extreme at Medomsley that it is easy to ignore the physical abuse. But the PPO’s report documents the full horror. Sometimes detainees were assaulted by officers on their arrival at Medomsley and in the presence of police officers, usually for failing to address the officer as “Sir”. Detainees regularly arrived at the local hospital with broken noses, arms and legs. One boy had a shattered skull. Another presented with ruptured kidneys. A nurse became concerned after three detainees were admitted with nephritis, inflammation of the kidney usually caused by infection. She discussed it with a colleague and said all the boys had a “quiet demeanour”. The colleague explained that the kidney damage was not nephritis, but the result of rabbit punches to the kidney, saying it was common knowledge that staff were physically assaulting detainees.\n\nBoys would jump off walls, trying to break their bones so they would get admitted to hospital and away from Medomsley. In the report, one former detainee says: “I saw other inmates break their arms or legs … One would brace his arms against something and get other lads to kick his arm. I also saw lads jump off a bunk on to someone’s leg to smash it. I heard it break. When someone managed to break a bone, they were taken out and not seen again.”\n\nTwo boys died in quick succession at the detention centre in the early 1980s. Eighteen-year-old Ian Shackleton, a diabetic with special educational needs who had been sentenced to three months, died in September 1981. David Caldwell, an asthmatic who couldn’t read or write, died in January 1982. Shackleton’s medication had not been sent with him to the detention centre and he was then prescribed a different type of insulin. Soon after, he fell into a diabetic coma, developed septicaemia, went into cardiac arrest and died. At his inquest, the coroner gave a verdict of misadventure, saying: “You should not blame anyone.”\n\nCaldwell was also 18 and sentenced to three months in Medomsley. On 8 January 1982, he said he had a sore throat and was given antibiotics. Later that day he took part in “organised sport” and was ordered to jog around a games area. Caldwell complained of being cold afterwards. There was snow on the ground. On 10 January, Caldwell took part in PE and was instructed to walk around the perimeter fence. Again, there was snow on the ground. The following day, Caldwell reported to the hospital officer with a bad chest. He was given medication and excused from physical activity. On 12 January, he was admitted to the hospital wing, diagnosed with an acute episode of asthma. That evening, he died. In February 1982, an inquest concluded that his death was a result of natural causes. His family said the death was due to neglect.\n\nLike the other men Allison and I met, Steve’s life had been reduced to Medomsley. He didn’t have the mental space to think of much else. He didn’t want to use his real name because he was ashamed of what had happened to him and thought neighbours on his estate would think less of him if they knew. He still wants to use a pseudonym today for the same reason. In 2012, he lived surrounded by CCTV cameras – seven of them. Today, the cameras have gone, but he’s still paranoid and agoraphobic.\n\nIn 2012, Steve told us a horribly familiar story – a long line of care homes, different degrees of abuse, but nothing compared with Medomsley. He was sent there for stealing a coat from a car. “I know I did wrong, but it was a winter’s night and it was freezing. I didn’t break into the car – the window was open.” He was 16.\n\nHe says Husband seemed different from the other officers – he was funny, friendly, and put them at ease. Then he abused them. And the longer the abuse went on, the worse it got. Steve says the sexual and physical abuse were inseparable. “He put my hand in a hot pidi – a metal pie dish – and pushed my hand down as he fondled me.” Did other officers see any of this? “He had a monopoly in the kitchen. You weren’t allowed to go in there. Officers had to ask him to go in.”\n\nEvery officer knew about it. They joked about it and laughed about it\n\nBut he says the other officers knew what Husband was up to. “Nobody would say it was happening to them, yet it was the talk of the place. You’d get comments off the officers: ‘What have you been up to with Husband?’ ‘You’re one of his boys?’.” At Husband’s trial, one officer said: “Husband used to keep one boy behind in the kitchen at night. We always felt sorry for that boy.”\n\nWho was the governor when Steve was there? “Tim Newell. Any decent governor wouldn’t have allowed Husband to do half the things he allowed.” Such as? “Taking boys out of the gate. It just wouldn’t be done. Newell says he didn’t have a clue about the abuse, that it was the fault of other officers for not telling him.” Does he believe Newell didn’t know about it? “No! Every officer knew about it. They joked about it and laughed about it. And then there’s James Millar Reid, the governor who killed himself. He was the governor just before Newell.”\n\nMillar Reid was governor at Medomsley from 1976 to 1978, the period during which Kevin Young was abused. In 2013, Young told the Mirror: “I’m ­positive he was in the room when I was being [sexually] abused by guards.” At the beginning of September 2000, Reid was visited by detectives from Durham, who were investigating Husband. A few days after the visit, he went missing and his body was found in a wood in Stelling Minnis, near Canterbury. An inquest in February 2001 returned an open verdict. The cause of death was recorded as “unascertainable” as the body was badly decomposed.\n\nLike Hall, Steve started drinking heavily when he was released. One day he was watching the news when a story came on about abuse in a children’s home in Sunderland. He lost it. Everything went flying. He had never discussed the abuse with his wife. When he calmed down, he told her everything. Eventually, he went to the police station to report Husband, and got the answer he always feared. “‘We suggest you go home, put it behind you, because you can imagine the effect it will have on your wife and children should this get out on the estate where you live.’” Steve ignored the advice and took it to a higher police authority. Thirteen years ago, he told us that if there was a public apology, he hoped he might be able to move on.\n\nAfter Allison and I wrote about Medomsley, more victims went to the police. In 2013, Operation Seabrook was launched by Durham police. Seabrook was a major criminal investigation into the historic abuse at the detention centre, headed by Det Supt Paul Goundry. Before the launch, Allison and I went to meet him to find out more about the investigation and tell him what we knew.\n\nSeabrook became the UK’s largest police investigation into institutional abuse. By March 2014, more than 500 victims had come forward and Goundry was convinced he was dealing with something far bigger than the detention centre. “There is growing evidence to suggest there was an organised paedophile ring operating in Medomsley,” he told us. “This will form a major part of our operation and future discussions with the Crown Prosecution Service.” By March 2015, 1,123 men had contacted Operation Seabrook alleging sexual or physical abuse. Goundry told us two former prison officers had been arrested on suspicion of physical and sexual assaults and a further 14 former officers had been questioned.\n\nView image in fullscreen John McCabe as a young man. Photograph: Courtesy of John McCabe\n\nJohn McCabe had been sentenced to nine months in Medomsley for a robbery from a jewellery shop in 1983. He only discovered Husband had been sent to prison when he saw a TV news report in 2009 saying he had been released. McCabe then went to Glasgow police and gave a statement about being raped multiple times, by Husband and others. He was told his statement was consistent with those of many others, and that Husband would be charged.\n\n“At the beginning of 2010,” McCabe says, “a police officer phoned me and said: ‘John, I’ve got bad news, they’re not charging him.’ They said there are two parts to going ahead with a prosecution. One part is the evidence, which is absolutely brilliant and we can bring guys who’ve given similar testimony. The other thing is public interest, and it’s not in the public interest to prosecute him. I couldn’t fucking believe it. How can it not be in the public interest?” McCabe asked, but never got an answer. He felt as if he had been abused all over again. “I was gubbed – hugely depressed – for five months. Couldnae do a thing.” Later in 2010, Husband died.\n\nWhen Operation Seabrook launched, Goundry got in touch with McCabe, who is one of the leading Medomsley campaigners. Goundry told McCabe he needed assistance in investigating the paedophile ring. McCabe agreed to help. Officers from Seabrook took McCabe to a church in Shotley Bridge, near Medomsley. From the outside, it wasn’t familiar. But as soon as he got inside, he knew where he was. Although it had been decorated, he recognised the windows. He had been brought here on dark winter nights. “It was a car crash. The minute I walked in I nearly fainted. I went: ‘Get me out of here, get me fucking out of here. Fuck the investigation.’ It hit me like a brick wall.”\n\nMcCabe was raped by Husband and another man at the church and at the local amateur dramatics society. Allison did some detective work alongside Gavin Engelbrecht, a journalist with the Northern Echo. Allison went to libraries in Durham and searched the local newspapers for cuttings about productions that rehearsed at St Cuthbert’s church hall in Shotley Bridge. Husband was a key member of the group, and directed plays there, sometimes casting Medomsley members of staff. Allison photocopied all the cuttings. “Eric sends me a load of photos,” says McCabe, “and lo and behold, there’s the guy. I got back to Eric straightaway and said: ‘It’s him.’ I was in pieces. I couldn’t believe it.”\n\nThe man was arrested and McCabe identified him. But he was never charged. McCabe tells me that five different victims had identified five different perpetrators from the drama group. The Crown Prosecution Service (CPS) can only go ahead with a prosecution if it believes there is a greater than 50% chance of a conviction. If more than one person had identified an alleged perpetrator, there would be more chance of a jury finding them guilty. But with only the victim’s word against that of an alleged abuser, the CPS didn’t believe the cases would succeed in court. Again, McCabe was outraged. “Why did they need corroboration?” he asks. “Isn’t it enough to charge someone for repeatedly raping one boy?”\n\nView image in fullscreen Det Supt Paul Goundry, who led Operation Seabrook. Photograph: Claire McKie/ncjMedia Ltd\n\nIn August 2015, Goundry wrote to him, saying: “Out of those who have come forward to date, 14 inmates reported abuse at Medomsley to the police shortly after being released. Out of these, five reported in Durham with one officer who was identified but he is now deceased.” Goundry said he believed the paedophile ring “could have come from a number of associations that Husband had – his church activity, drama group, homosexual connections, Medomsley work colleagues, masonic colleagues, potentially a mix of above”.\n\nGoundry went on to tell McCabe about a victim he had recently met: “I had a request to meet a victim in person, which I did on Tuesday. He wanted to tell me in person that Seabrook had saved his life. He had carried the burden all his life and the fact we had listened and believed him meant he was in the best place he had ever been in. I wish you could have been there, that one conversation made it worthwhile.” Goundry was passionate about the case, and clearly regarded McCabe as an important ally. “We still have a long way to go but we are on the home straight and I need you beside me,” he said.\n\nThen in October 2016, with no warning, Goundry quit Operation Seabrook. He wrote to victims saying he had taken up a new position “working with all the relevant statutory agencies, looking at how we support victims of sexual abuse … In order to take up this position, I have had to retire as a police officer.” McCabe was astonished. Goundry had promised to see the investigation through. Today, he remains convinced that what Goundry had discovered was too sensitive. “I managed to find a number for him two years later. I rang him and he rang me back. I said: ‘What the fuck happened to you?’ He said, ‘I was moved on.’”\n\nThe Guardian invited Goundry to contribute to this article, but he did not respond.\n\nIn 2019, the victims received another knockback when the independent inquiry into child sex abuse excluded Medomsley on the basis that most of the victims were over 18. Yet some are believed to have been as young as 14 and 15, and – though there was never any question of consent – the age of homosexual consent throughout the time Medomsley was operational was 21. Victims again called for their own public inquiry, to no avail.\n\nMore than 100 men were arrested in connection with Medomsley. But ultimately the victims felt let down. Only five former officers were convicted and imprisoned for offences including assault, wounding and misconduct in public office. They were jailed for a combined total of 18 years in 2019. One of them was Christopher Onslow, a physical training instructor at Medomsley, who was sentenced to eight and a half years for misconduct in public office and physical abuse. The jury heard how he exploited his authority in a “sadistic and brutal fashion” between 1975 and 1985, including throwing rocks at an inmate on an obstacle course, causing him to fall 20ft and crush three vertebrae; beating a 17-year-old inmate who lost a 200m race because he had lost a £10 bet on him; and attacking a prisoner who tried to report abuse by Husband.\n\nWhen asked to comment on whether Goundry was moved because he was on the verge of uncovering a paedophile ring that would have exposed the police, the church and many establishment figures, a spokesperson for Durham police said: “Thousands of young men were let down by the authorities who should have protected them and continue to live with the trauma left by that abuse. Those victims were, and remain, our primary concern.\n\n“Due to the length of that inquiry, three different senior investigating officers had oversight of Operation Seabrook. After discussions with the Crown Prosecution Service, charges were authorised against nine former prison officers, five of whom were convicted of various offences relating to physical abuse. Had investigators identified further offences to an evidential standard, those cases would also have been put before the courts.”\n\nView image in fullscreen Operation Seabrook’s files. Photograph: Claire McKie/ncjMedia Ltd\n\nDespite more than 100 witnesses alleging they had been sexually abused by men other than Husband and Johnston, only one man, Alexander Flavell, was found guilty of sexual abuse. In 2023, he was convicted of indecent assault and cleared of serious sexual assault in his absence (had the offence in question been committed today it would have been tried as rape). Flavell was deemed unfit to stand trial due to dementia, so he received an absolute discharge.\n\nThe decade-long Operation Seabrook concluded after Flavell’s case. Early last year, Operation Deerness was announced. Usher told me his investigation was about “preventing the victims of tomorrow” and that he hoped it would provide “some level of closure” for the victims.\n\nUsher’s 200-page report concluded that the abuse was allowed to continue because other staff members colluded with their silence, police ignored or bullied detainees who reported abuse, and there was no scrutiny by the establishment, from the Home Office to the Board of Visitors (a group of local volunteers appointed as independent observers to monitor conditions inside the prison). In the report, he points out that there was no way for detainees to report the abuse to an independent body and says there still isn’t for victims of abuse in prison. Finally, he says the victims have never received a formal apology from any of the authorities tasked with ensuring the safety of the detainees while in prison. “The government, the Prison Service, Durham police all need to think about a public apology.”\n\nUsher pays fulsome tribute to the victims. “I hope that the victims see it is their effort, their bravery, their tenacity that has got the full story of what happened at Medomsley out into the public domain,” he tells me. His report seems exhaustive; the abuse documented in devastating detail. There is the victim forced to perform oral sex on Husband as he held a knife to the boy’s throat; the victim who described how Husband “put his hands around my throat and squeezed until I could hardly breathe”; the victim who said he can still feel the weight of Husband’s body as he was being raped.\n\nThe report talks about the boys being taken off site to be abused at Husband’s house, the church, the drama group, a farm. It reveals that at least 47 incidents of sexual abuse were reported to staff, up to and including the governor. Usher refers to “a police officer who was an associate of Husband being a perpetrator of abuse”. The CPS was considering charging the police officer, known as Subject A, when he died in 2018. A medical officer known as “Doctor Death” used to tape an aspirin to the heads of detainees who said they were ill and make them run around the yard. He was not investigated by Operation Seabrook as he died before the investigation began. The report refers to a retired Anglican priest and convicted abuser who is thought to have abused a child at Medomsley, without naming the perpetrator. That reference is to Granville Gibson, who was convicted in 2016, aged 80, of sexual abuse dating back to the 1970s while he was the vicar at St Clare’s Church in County Durham.\n\nPrison officers, the clergy, police, doctors, the Freemasons. The abuse ran right through the establishment. Yet apart from a handful of prison officers, there have been no convictions.\n\nUsher insists, rightly, this was beyond his remit. His job was to find out why the abuse wasn’t stopped. And, to an extent, he has done so. He also insists his investigation did the same job a public inquiry would do. “I don’t think you will get a more comprehensive, detailed account of what happened than the investigation I’ve done. Wherever we found ex-members of staff we wrote to them. Some of them we did not find, and some will have chosen not to give evidence to me. If that small group of staff who did not come and talk to me had been compelled to appear before a public inquiry, they would in all likelihood have said they knew nothing about the abuse. If they’d said that to me it would have made no difference to the conclusions I have drawn. So I don’t believe a public inquiry would get any further than we have got. I think I have uncovered the truth about what happened at Medomsley and have faithfully represented that on behalf of the victims.”\n\nBut the victims aren’t happy. Steve points out that the word paedophile is not mentioned once in the report, let alone “paedophile ring”. He calls the investigation a sop. “It is an investigation without any powers. There should have been some compulsion to give evidence instead of just saying: ‘Oh, come and tell us what you know!’ because they just won’t come. The report basically tells us what we know already. In fact, most of the things in there, we told them. This is just people telling instances of what happened to them. It’s not a public inquiry, where they can order people to come forward, instead of asking. At a public inquiry, witnesses are on oath so if they lie they can get done for perjury.”\n\nView image in fullscreen Jake Richards, a Labour MP and minister for youth justice, in the House of Commons. Photograph: House of Commons\n\nLast week, just after the report was published, the minister for youth justice, Jake Richards, described the abuse as a “monstrous perversion of justice” and said: “To the men who suffered such horrific abuse at Medomsley, I want to say again – I am truly sorry.” He added that the government would establish a youth custody safeguarding panel “to review how we protect children in custody today”. I ask Steve if he feels he can move forward now. “I’m 65, it’s too late for me to move on,” he says. “Saying sorry to us now sounds hollow. It means nothing.”\n\nMcCabe points out that the report doesn’t even name the two surviving governors, Christopher Harder and Tim Newell, the latter a highly regarded liberal thinker in prison circles. “From what I have heard they weren’t even interviewed for the PPO’s report. Well, if Newell had been doing his job when he was governor I would never have met Husband and my life wouldn’t have been destroyed.” The PPO wouldn’t confirm to me whether or not Newell was interviewed.\n\nNewell, the governor of Medomsley from 1979 to 1981, was a friend of Husband’s and attended the drama group with him. In a report he wrote, he said Husband made “an outstanding contribution to the running of the establishment”. When Allison and I investigated Medomsley in 2012, Newell refused to talk to us. In 2014, he issued a statement to the BBC saying: “If I had any suspicions about sexual abuse or abuse of any kind I would have taken action. If staff knew about the abuse taking place I am very concerned they let the abuse continue.”\n\nWhen I contacted Newell a couple of weeks ago through the Quakers publication The Friend, for which he writes, I received a message back within minutes from the Friend saying: “Hi Simon, Gosh, I heard back from Tim faster than expected. He writes: ‘Thank you, I’m reluctant at present to have such contact. Thanks for your consideration.’” Newell has never issued a public apology.\n\nMcCabe says Operation Deerness has done little to satisfy him. In fact, he says there has been something belittling about the whole process. Despite being told he had been sent a copy of the report, it never arrived. “They couldn’t even be bothered to send it by special delivery. They sent it second class. That report contains incredibly personal details, and it may well have been posted through a neighbour’s door.” He points to some of the language used by Usher in the report. “Why does he keep referring to us as young men? We weren’t young men, we were boys. This is no different from any of the other investigations. It’s essentially the police and Ministry of Justice investigating themselves. We have always needed a public inquiry, and we still do. Halfway through the special investigation they put out one line saying anybody who was around the area where Medomsley detention centre was in the 70s and 80s is welcome to come down to the local arts centre for a chat and a cup of tea. That’s the kind of investigation this is.” He says a public inquiry would have allowed victims to ask any question they wanted through lawyers, and those responsible would have been made to answer under cross-examination. “In a public inquiry, there is no way governors could get away with saying: ‘I didn’t know because no officers told me, and therefore they’re to blame’.”\n\nWhen I say that Usher told me he hoped the report could provide “some level of closure”, McCabe laughs bitterly. “My wife died on 17 September 2016, and I’ve still not had time to grieve for her because of Medomsley. I’ve got three counsellors, and they’re just trying to get me to the stage where I can grieve for my wife.” He pauses. “One of my counsellors said to me: ‘What does closure look like to you, John?’ I said: ‘It looks like a coffin closing.’”\n\nInformation and support for anyone affected by rape or sexual abuse issues is available from the following organisations. In the UK, Rape Crisis offers support on 0808 500 2222 in England and Wales, 0808 801 0302 in Scotland, or 0800 0246 991 in Northern Ireland. In the US, Rainn offers support on 800-656-4673. In Australia, support is available at 1800Respect (1800 737 732). Other international helplines can be found at ibiblio.org/rcip/internl.html",
  "summary": "<p>At a youth detention centre in north-east England, the paedophile Neville Husband raped and assaulted countless boys. Why was his reign of terror allowed to go on – and why hasn’t there been a public inquiry?</p><p>When I met Kevin Young in 2012 he was in his early 50s, handsome, charismatic, smart – and utterly broken. The moment he started talking about Medomsley detention centre he was in tears.</p><p>Young was born in Newcastle, in 1959. At two, he was taken into care, and his parents were convicted of wilful neglect. At eight, at a school in Devon, he was sexually abused by the gardener. At 14, at St Camillus, a Catholic residential school in Yorkshire, he was sexually assaulted by the headteacher, James Bernard Littlewood. But none of this compared with his experience at Medomsley, a youth detention centre in north-east England.</p> <a href=\"https://www.theguardian.com/society/2025/nov/20/possibly-the-most-prolific-sex-offender-in-british-history-the-inside-story-of-the-medomsley-scandal\">Continue reading...</a>",
  "published": "Thu, 20 Nov 2025 05:00:14 GMT",
  "url": "https://www.theguardian.com/society/2025/nov/20/possibly-the-most-prolific-sex-offender-in-british-history-the-inside-story-of-the-medomsley-scandal",
  "source": "The Guardian"
}