{
  "title": "Cryptocurrency backed by Farage donor is used for Russian war effort, investigators say",
  "text": "A cryptocurrency backed by one of Nigel Farage’s biggest donors has been used to help Russia fight its war against Ukraine, British investigators say.\n\nThe National Crime Agency has spent four years trying to crack a multibillion-dollar scheme that exchanges cash from drug and gun sales in the UK for crypto, digital tokens that are designed to hide their users’ identities.\n\nThe scheme has enabled “sanctions evasions and the highest levels of organised crime, including providing money-laundering services to the Russian state”, the agency says.\n\nOf the $24m (£18.3m) in crypto that the NCA and its counterparts abroad have so far been able to seize, the “vast majority” was issued by Tether.\n\nA private company headquartered in El Salvador, Tether has grown so popular that it declared profits of $13bn for 2024, one-and-a-half times those of McDonald’s. Tether’s shares are reportedly owned by a small group, among them Christopher Harborne, one of the UK’s biggest political donors. Harborne took a 12% stake around 2016, court papers say, although it is unclear what share of Tether’s profits he has received.\n\nView image in fullscreen Christopher Harborne, who is one of Britain’s biggest political donors, took a 12% stake in Tether around 2016. Photograph: George Cracknell Wright/LNP\n\nIn 2019-20, as the UK was leaving the EU, Harborne gave £10m to Nigel Farage’s Brexit party, since renamed Reform UK. In January, Farage accepted another £28,000 from Harborne to attend Donald Trump’s inauguration as president – the month after the US placed sanctions on the Russian bosses of the laundering networks and publicly warned they were using Tether.\n\nReform UK, the first British political party to accept donations in crypto, did not respond to a request for comment. Harborne’s lawyers said that accusing an investor in Tether of complicity in crimes perpetrated by users of its tokens would be “akin to claiming the US Treasury is an accomplice in money laundering because it prints the US dollar”.\n\nWhile there is no suggestion that Harborne himself is implicated in the money-laundering scheme, some of his fortune appears to have come from a company whose cryptocurrency is in high demand from illicit networks such as the Russian ones unearthed by the NCA’s Operation Destabilise.\n\nUnlike volatile cryptocurrencies such as bitcoin, Tether’s tokens are stablecoins, whose value is pegged to the dollar, making them easier to exchange for real currencies. Buyers of newly minted Tether stablecoins – called USDT – pay one dollar for each. Tether holds this cash to maintain the stablecoin’s peg, and makes money from the interest or investment return on it. About 184bn USDT are in circulation.\n\nA Tether representative said the company “unequivocally condemns the illegal use of stablecoins and is fully committed to combating illicit activity”.\n\nQuick Guide Contact Tom Burgis about this story Show If you have something to share on this subject you can contact Tom using one of the following methods. Email (not secure) If you don't need a high level of security or confidentiality you can email tom.burgis@theguardian.com. Secure Messaging in the Guardian app The Guardian app has a tool to send tips about stories. Messages are end to end encrypted and concealed within the routine activity that every Guardian mobile app performs. This prevents an observer from knowing that you are communicating with us at all, let alone what is being said. If you don't already have the Guardian app, download it (iOS/Android) and go to the menu. Select ‘Secure Messaging’. To send a message to Tom please choose the ‘UK Investigations’ team. SecureDrop and other secure methods If you can safely use the tor network without being observed or monitored you can send messages and documents to the Guardian via our SecureDrop platform. Finally, our guide at theguardian.com/tips lists several ways to contact us securely, and discusses the pros and cons of each. Illustration: Guardian Design / Rich Cousins Was this helpful? Thank you for your feedback.\n\n“Tether tokens are often acquired and circulated through secondary markets and peer-to-peer platforms. These flows are not controlled by Tether but we remain vigilant and ready to act when law enforcement identifies illicit activity,” the spokesperson added.\n\nBut crypto experts say all demand – including illicit demand – benefits the company by driving up the cash reserves from which Tether makes its billions in profit.\n\nHarborne, a former McKinsey consultant, is not an executive at Tether. He also has interests in aviation fuel, military contractors and a wellness centre in Thailand, where he lives, going by British and Thai names. He describes himself as an “intensely private person”.\n\nAs well as helping Farage and his parties, Harborne has given money to the Conservatives and donated £1m to Boris Johnson when he left Downing Street in 2022. The Guardian revealed that after the donation Harborne accompanied Johnson on a visit to Ukraine. Neither has said why.\n\nJohnson did not respond to a request for comment. A Tory spokesperson said: “All donations to the Conservative party are accepted in good faith and only after thorough due diligence to ensure they come from permissible sources. We take our legal and compliance responsibilities extremely seriously.”\n\nNCA investigators say cryptocurrency has “turbocharged” money laundering, with the Russian laundering scheme switching to Tether shortly before 2020.\n\nSal Melki, the NCA’s deputy director of economic crime, said: “A line can be drawn from this money-laundering scheme to support for companies involved in the Russian military-industrial base.”\n\nThe NCA launched Operation Destabilise in 2021 when it rumbled a ransomware gang whose proceeds were being laundered by a Russian socialite. Working with their US, French and Irish counterparts, investigators established that the laundering network, known as Smart, and another, called TGR, were shifting billions of pounds.\n\nThe NCA’s investigators believe the TGR network has “supported companies involved in the Russian military-industrial base”. It has, they say, “facilitated the export of electronic components to Russia”.\n\nWestern countries have imposed sanctions seeking to restrict the Putin regime’s access to computer chips and other hard-to-find components for drones and missiles, yet the weapons continue to rain down on Ukraine. Ukraine’s president, Volodymyr Zelenskyy, said in October that the weapons systems Russia used in a single day of deadly air attacks contained more than 100,000 foreign-made parts, including British microcomputers.\n\nNCA investigators say Russian intelligence agents tried to fund a spy ring of six Bulgarians it was running in the UK via the Smart laundering network. The espionage included hunting an investigative journalist who had helped implicate Russian spies in the poisoning of the opposition politician Alexei Navalny. The Bulgarians were jailed in May after an Old Bailey trial.\n\nThe networks have also helped rich Russians in the west access cash – as much as £100,000 a time – to maintain the lifestyles to which they are accustomed despite sanctions, the investigators say.\n\nThe NCA has little hold over Tether, a spectacularly profitable venture in a largely unregulated industry based in a Central American dictatorship.\n\nMelki said: “We work with any global crypto firm that wants to work with us, in addition to those regulated in the UK, but there’s no free pass for crypto firms. They all have a role to play in limiting their exposure to bad actors.”\n\nThe Tether representative said it had “a proven track record as the industry leader in working with global law enforcement to stop bad actors”.\n\nThe company has frozen or blocked more than $3.4bn in USDT in collaboration with more than 300 agencies in 62 countries, the representative added.",
  "summary": "<p>Tether tokens found to facilitate scheme that enables sanctions evasion and launders money for the Kremlin</p><p>A cryptocurrency backed by one of Nigel Farage’s biggest donors has been used to help Russia fight its war against Ukraine, British investigators say.</p><p>The National Crime Agency has spent four years trying to crack a multibillion-dollar scheme that exchanges cash from drug and gun sales in the UK for crypto, digital tokens that are designed to hide their users’ identities.</p> <a href=\"https://www.theguardian.com/politics/2025/nov/21/cryptocurrency-farage-donor-used-for-russian-war-effort\">Continue reading...</a>",
  "published": "Fri, 21 Nov 2025 05:00:02 GMT",
  "url": "https://www.theguardian.com/politics/2025/nov/21/cryptocurrency-farage-donor-used-for-russian-war-effort",
  "source": "The Guardian"
}