{
  "title": "‘Why don’t you bake?’ A scolding that stung – until I heard it in a new way | Ying Reinhardt",
  "text": "‘Aiyah, why don’t you bake?” my Aunt Julie scolded, her voice shrill with disbelief. “You should learn how to bake for the sake of your child! Your mother was such a good baker!” Her comment stung. I had always adored my mother’s youngest sister. As the only member of my family who also lived in Germany, we had a special bond.\n\nBut here she was, chastising me for failing to be a good mother before I had even given birth. I contemplated the question from her immaculate kitchen, where I stood round, hormonal, in my second trimester of pregnancy and on the precipice of new motherhood. But I didn’t have an answer.\n\nAunt Julie was right. My mother had been an excellent baker. The best, really. The kind who baked after work late into the night just because someone asked for her melt-in-your-mouth pineapple tarts or pandan chiffon cake. She kept her recipes in a thick, blue-lined, leopard-print notebook filled with neat, girlish handwriting and yellowed magazine clippings. My aunts, her sisters and my father’s, used to call her regularly for instructions and she always obliged. My Aunt Joanne waxes lyrical about her butter cake to this day, remembering it in hushed tones of awe.\n\nMy mother passed away when I was 18. Why didn’t I learn from her when she was still alive? The truth was, I didn’t think I could. Baking required discipline – following instructions to the letter. It required a meticulous, attentive, precise personality like my mother’s. Instead, I was restless, rootless, impatient.\n\nIn my 20s, I led a nomadic life, living in rentals with strict rules or on cruise ships, often without kitchens, let alone ovens. I preferred cooking by instinct, guided by scent and spur-of-the-moment whim, not measurements. My style was agak agak – a Malay term for eyeballing it.\n\nI knew all this about myself, and I had always believed that I had nothing to prove. And yet Aunt Julie’s question lingered. I began to wonder: if I didn’t inherit my mother’s love for baking, did that somehow make me less of a daughter? What if my mother had also wished that I’d baked? That feeling of inadequacy, of being less than a perfect daughter, followed me into the first year of motherhood.\n\nMy daughter had just begun to enjoy sweet treats and demanded more of them. So one afternoon, driven mostly by the urge to offer her healthy alternatives and partly to prove to Aunt Julie that I was capable of following instructions, I baked.\n\nI started with vegan blueberry muffins. Safe enough, I thought, because no eggs meant fewer ways to mess up. I wasn’t ready yet to beat anything into stiff peaks, whatever that meant. After a few successful batches and adding some simple foolproof cakes to my repertoire, I attempted peanut cookies for lunar new year – something I remembered my mother making. But the batter looked like peanut butter, far too wet. Did I add too much oil? Did I add too little flour? I looked at the wet lumpy mixture and wanted to throw the bowl away.\n\nThe next year, when lunar new year rolled around again, I decided my daughter and I would bake walnut cookies. Growing up, lunar new year held significant memories for me. It meant days of round-the-clock feasting, angpao-receiving and meeting relatives, near and far. I wanted it to mean something for my daughter too, even if we were far from the land that I used to call home. I was determined to conjure some sense of that place, even if it meant baking yet another failed batch of cookies. By then, my daughter, a rambunctious toddler, had begun joining me in the kitchen from her learning tower. Unable to roll the dough into balls with her tiny palms, she made uneven blobs. We laughed at the mess in front of us.\n\nThe oven warmed the kitchen as snow coated the ground thickly outside. The comforting scent of butter and sugar wafted through the hallways as my daughter licked the batter off her fingers. As I watched her tenderly, I suddenly remembered the joy of standing next to my own mother as she deftly dislodged the flower blossom pineapple tarts from the mould. Her presence was visceral, as though baking with my daughter had brought her back.\n\nThen the timer on the oven chimed and I pulled out the tray. Somewhere, something had gone wrong: the walnut cookies were gigantic – golf ball-sized monsters that stuck together like soft dinner rolls. We laughed. I told my daughter: “Your oma was a very good baker. But not mama. See? This is so ugly.” She smiled kindly back, as if she knew that how a cookie looks is beside the point. “Lecker!” she chimed. And they were. The cookies were hideous but delicious.\n\nI began to realise the truth behind Aunt Julie’s comment. It was not as barbed as it had appeared. She had only wanted me to remember my mother’s legacy. Far from trying to make me feel inferior, she was trying to illustrate to me the magnanimity of my mother’s love. And if it hadn’t been for her comment, I probably would never have pushed myself to pick up a whisk.\n\nBut learning how to bake has been a profound experience. I came to realise I wasn’t just making cookies or cakes. I was learning how to mother. Mothering meant, for me, letting go; it meant that despite all the steps of a recipe that I could follow, I could never truly be in control of the outcome. Making a perfect cookie takes practice and care. Mostly though, as my own mother had, I was trying to recreate the feeling of warmth and homeliness through perseverance. It was never about precision, as I had initially thought, but about showing up for the ones you love, relentlessly, day after day. Baking was her language of love, her legacy, her masterclass. Maybe it will be mine too.\n\nThese days, I am no longer afraid of combining eggs, flour and butter. My peanut cookies now turn out fine. So much so that this time, it was Aunt Julie who asked me for the recipe.",
  "summary": "<p>My aunt was chastising me for not carrying on my mother’s legacy of pineapple tarts and butter cakes. Why had I been so resistant?</p><p>‘Aiyah, why don’t you bake?” my Aunt Julie scolded, her voice shrill with disbelief. “You should learn how to bake for the sake of your child! Your mother was such a good baker!” Her comment stung. I had always adored my mother’s youngest sister. As the only member of my family who also lived in Germany, we had a special bond.</p><p>But here she was, chastising me for failing to be a good mother before I had even given birth. I contemplated the question from her immaculate kitchen, where I stood round, hormonal, in my second trimester of pregnancy and on the precipice of new motherhood. But I didn’t have an answer.</p><p>Ying Reinhardt is Malaysian writer living in Germany</p> <a href=\"https://www.theguardian.com/commentisfree/2025/nov/20/words-that-changed-everything-baking-mother-cakes\">Continue reading...</a>",
  "published": "Thu, 20 Nov 2025 12:07:14 GMT",
  "url": "https://www.theguardian.com/commentisfree/2025/nov/20/words-that-changed-everything-baking-mother-cakes",
  "source": "The Guardian"
}