{
  "title": "He got sued for sharing public YouTube videos; nightmare ended in settlement",
  "text": "Nobody expects to get sued for re-posting a YouTube video on social media by using the “share” button, but librarian Ian Linkletter spent the past five years embroiled in a copyright fight after doing just that.\n\nNow that a settlement has been reached, Linkletter told Ars why he thinks his 2020 tweets sharing public YouTube videos put a target on his back.\n\nLinkletter’s legal nightmare started in 2020 after an education technology company, Proctorio, began monitoring student backlash on Reddit over its AI tool used to remotely scan rooms, identify students, and prevent cheating on exams. On Reddit, students echoed serious concerns raised by researchers, warning of privacy issues, racist and sexist biases, and barriers to students with disabilities.\n\nAt that time, Linkletter was a learning technology specialist at the University of British Columbia. He had been aware of Proctorio as a tool that some professors used, but he ultimately joined UBC students criticizing Proctorio, as, practically overnight, it became a default tool that every teacher relied on during the early stages of the pandemic.\n\nTo Linkletter, the AI tool not only seemed flawed, but it also seemingly made students more anxious about exams. However, he didn’t post any tweets criticizing the tech—until he grew particularly disturbed to see Proctorio’s CEO, Mike Olsen, “showing up in the comments” on Reddit to fire back at one of his university’s loudest student critics. Defending Proctorio, Olsen roused even more backlash by posting the student’s private chat logs publicly to prove the student “lied” about a support interaction, The Guardian reported.\n\n“If you’re gonna lie bro … don’t do it when the company clearly has an entire transcript of your conversation,” Olsen wrote, later apologizing for the now-deleted post.",
  "summary": "Librarian vows to stop invasive ed tech after ending lawsuit with Proctorio.",
  "published": "Wed, 19 Nov 2025 20:56:59 +0000",
  "url": "https://arstechnica.com/tech-policy/2025/11/proctorio-settles-curious-lawsuit-with-librarian-who-shared-public-youtube-videos/",
  "source": "Ars Technica - All content"
}