{
  "title": "He was lured with promise of high salary. Then, a Jharkhand techie landed in cyberfraud net in Myanmar",
  "text": "A 26-year-old mechanical engineer from Dhanbad has allegedly been trafficked to Myanmar and forced into cyberfraud after being lured abroad with the promise of a lucrative job.\n\nThe youth, Mohammad Shahzeb Rahman, left India in late 2024 after being promised a high-paying job in Thailand. Shahbez’s mother, Nishat Afroj, 54, alleged he is being held hostage by a cyberfraud network, which is torturing him and demanding ransom for his release.\n\n“They stole his passport, his phone, his freedom. Now they are threatening to take his life,” she said.\n\nAfroj has filed complaints with the Ministry of External Affairs, Ministry of Home Affairs, the Indian Embassy in Myanmar, the Embassy in Thailand, Jharkhand Police and the central migrant control system. She also approached the national CPGRAMS portal and sent emails to multiple authorities.\n\n“I am begging to the government of India, please rescue my son from Myanmar and bring him back alive. Please do not let the traffickers kill him,” she said.\n\nShikha Lakra, the head of State Migrant Control Room under the Labour Department, told The Indian Express that the Jharkhand government has taken up this case with urgency.\n\nShe said the matter was flagged to the department on November 12, after the Chief Minister’s Office received a petition from Shahzeb’s mother. “Based on the complaint, we verified the details and immediately reached out to the Protector of Emigrants, Ranchi, and the Indian Embassy in Myanmar,” Lakra said.\n\nStory continues below this ad\n\nShe said the Indian Embassy confirmed on November 17 that they have raised the matter with the Myanmar authorities. “Rescue efforts are complicated because Myawaddy (where Shahzeb is allegedly kept captive) is outside the effective administrative control,” she said.\n\n“But the embassy is pursuing the case on priority. We are in constant coordination to secure his safe return.”\n\nThailand to Myanmar\n\nShahzeb completed his polytechnic diploma in mechanical engineering in 2017 and worked small clerical jobs in Jharkhand and Maharashtra to save money for his B.Tech degree, which he earned in 2023. He worked in Bengaluru’s IT sector for some time before returning home, and then set out again in search of employment. His mother said it was during this phase that he came in contact with agents offering data-entry jobs in Thailand.\n\nAfroj told The Indian Express that her son left without informing the family about his exact destination. “He only said that he got a good job abroad. I thought finally our days would change,” she said.\n\nStory continues below this ad\n\nAccording to the mother, Shahzeb communicated intermittently over WhatsApp from his new number but avoided revealing his location. In October this year, she said the calls suddenly turned desperate.\n\n“On October 9, he called me crying. He said, ‘Ammi, they have kept me in Myanmar, they are torturing me. They are asking for money. Please save me’,” she said. She said Shahzeb told her he was being tortured with electric shocks, beaten up, not given food and forced to take part in online fraud operations. His captors allegedly warned him that he would be killed or his organs sold if he resisted.\n\nFearing for his life, Afroj said she transferred Rs 4.6 lakh to a number given by his handlers. “I sent everything I had. I have nothing left now,” she said.\n\nOn October 13, Afroj says she received a Telegram message from Shahzeb with more details. “He wrote that he had been trafficked from Thailand to Myanmar and was being held in Myawaddy town,” Afroj said.\n\nStory continues below this ad\n\nDemand for money\n\nShe said Shahzeb told her that dozens of Indians and other foreign nationals were held captive in the same compound.\n\nOn November 16, Shahzeb contacted Afroj again. “This time he said he had been shifted to another location, reportedly Yatai New City, near the restaurant area, close to his earlier confinement,” she said. “He said they were demanding more money. He was very scared. He said he might not survive,” Afroj told The Indian Express.\n\nAfroj, a widow suffering from a chronic respiratory condition, said she was living on borrowed breath, awaiting a reply from the authorities on her son’s rescue.\n\n“My husband left long ago. Shahzeb is my only child. He took care of me, worked any job he could find, supported my medicines. If something happens to him, I have no one left in this world,” she said.",
  "summary": "",
  "published": "Wed, 19 Nov 2025 00:30:24 +0000",
  "url": "https://indianexpress.com/article/india/he-was-lured-with-promise-of-high-salary-then-a-jharkhand-techie-landed-in-cyberfraud-net-in-myanmar-10373425/",
  "source": "India | The Indian Express"
}