{
  "title": "Why nonalcoholic spirits go from strength to strength",
  "text": "It’s time to start thinking about the C word. You might well already have plans to stock up for house guests who are drinking, but what about those who aren’t? It’s a good opportunity to think about how we might jazz up our non-alcoholic offering for friends and family who are trying to drink less, or not drinking booze at all. Sometimes, your friend will just want a Fanta, but I don’t like being the one to offer it to them. We can do better than that.\n\nThe Guardian’s journalism is independent. We will earn a commission if you buy something through an affiliate link. Learn more.\n\nThere are really excellent non-alcoholic and low-alcohol beers out there, as well as an ever-expanding offering of zero-alcohol wines (or, even, sessionable wines at around 6% ABV). But what of those who like, or used to like, a cocktail? Those who enjoy the heady, medicinal kick of a spirit, but don’t want any of the booze?\n\nSpirit is so easily defined in alcohol terms, but what about when you’re not distilling something alcoholic from the ingredients? As it’s defined in the Oxford English Dictionary (the website; I don’t have one knocking around the house), a spirit is a “strong distilled alcoholic liquor used for drinking”. So, part of how I’m defining a non-alcoholic spirit will be first based on its strength and second those elements that need to be distilled to create it. (Non-alcoholic brand Everleaf notes, however, that extracting from specific ingredients can be most effectively done in different ways, either by distillation or by grinding an ingredient down.) I’d also argue that a spirit can be identified in how you choose to enjoy it: if it can be enjoyed with a mixer, it’s a spirit; and if it can be shaken or mixed into a cocktail or enjoyed on the rocks, it’s definitely a spirit. By all those definitions, I’m talking liqueurs, aperitifs and amaros here.\n\nMother Root, a ginger, chilli and honey mix, is one of my absolute favourite drams to drink in any of those ways: top it up with soda water for an easy highball, or add a squeeze of lime to make a non-alcoholic Moscow mule. The fiery ginger is enough to perk you up in the morning and smack you out of a hangover, and I love it when ginger products actually taste of ginger.\n\nThen there’s the herby citrus Botivo, whose success is testament to the growing popularity of non-alcoholic options. Pretty much every chic hotel bar and up-and-coming wine bar now stocks this smart yellow bottle, as are even some pubs. It’s just the thing to scratch the itch of a botanical spirit lover, and it works particularly well with anything elderflowery.\n\nI’m also very intrigued by a recent discovery from Sylva Labs – aged, non-alcoholic spirits made using British fruit wood and established by Ben Branson, the founder of Seedlip (heard of ’em?). The first glance made me think of just-pressed apple juice, but when I took a swig the palate was smoky and forest floor-y. I couldn’t help but imagine it stirred into a Manhattan-style cocktail in lieu of whisky, perhaps with a squeeze of plum juice.\n\nFour nolo spirits that are worth a punt\n\nMother Root Ginger £28.95 (50cl) Sainsbury’s, 0%. The fiery spice of ginger switchel holds its own when topped with soda.\n\nCaleño Light & Zesty £18.97 (50cl) Master of Malt, 0%. A brand with real range. Try this in any “gin”-based aperitif.\n\nEverleaf Mountain £20 (50cl) The Wine Society, 0%. Founded by a conservation biologist, this liqueur is all rosehip and wild strawberry.\n\nSylva Orchard £40 (50cl) Sylva Labs, <0.5%. Sylva’s third “release”, made to celebrate harvest. Cherry, smoke and rye.",
  "summary": "<p>The perennial question of what to serve those who like the taste of cocktails and spirits, but who don’t drink alcohol, is actually getting easier to answer year on year</p><p>It’s time to start thinking about the C word. You might well already have plans to stock up for house guests who are drinking, but what about those who aren’t? It’s a good opportunity to think about how we might jazz up our non-alcoholic offering for friends and family who are trying to drink less, or not drinking booze at all. Sometimes, your friend <em>will</em> just want a Fanta, but I don’t like being the one to offer it to them. We can do better than that.</p><p>There are really excellent non-alcoholic and low-alcohol beers out there, as well as an ever-expanding offering of zero-alcohol wines (or, even, sessionable wines at around 6% ABV). But what of those who like, or used to like, a cocktail? Those who enjoy the heady, medicinal kick of a spirit, but don’t want any of the booze?</p> <a href=\"https://www.theguardian.com/food/2025/nov/20/why-nonalcoholic-spirits-go-from-strength-to-strength-hannah-crosbie\">Continue reading...</a>",
  "published": "Thu, 20 Nov 2025 13:00:10 GMT",
  "url": "https://www.theguardian.com/food/2025/nov/20/why-nonalcoholic-spirits-go-from-strength-to-strength-hannah-crosbie",
  "source": "The Guardian"
}