{
  "title": "German nurse gets life in jail after murdering 10 to reduce workload",
  "text": "German nurse gets life in jail after murdering 10 to reduce workload\n\n6 November 2025 Share Save Tabby Wilson Share Save\n\nGetty Images\n\nA palliative care nurse in Germany has been sentenced to life in prison after he was convicted of the murder of 10 patients and the attempted murder of 27 others. Prosecutors alleged that the man, who has not been publicly named, injected his mostly elderly patients with painkillers or sedatives in an effort to ease his workload during shifts overnight. The offences were committed between December 2023 and May 2024 in a hospital in Wuerselen, in western Germany. Investigators are reported to be looking into several other suspicious cases during his career.\n\nAccording to media outlet Agence France-Presse (AFP), the unnamed man had been employed at the hospital in Wuerselen since 2020, after completing training as a nursing professional in 2007. Prosecutors told a court in Aachen that he showed \"irritation\" and a lack of empathy to patients who required a higher level of care, and accused him of playing \"master of life and death\". The court was told that he injected patients with large doses of morphine and midazolam, a type of sedative, in an effort to reduce his workload during night shifts. He was arrested in 2024.\n\nWhen issuing the life sentence, the court said that the man's crimes carried a \"particular severity of guilt\" which should bar him from early release after 15 years. He will be able to appeal the verdict. Prosecutors have told AFP that exhumations are taking place to identify further potential victims, which could see the man put on trial again.",
  "summary": "The palliative care nurse was convicted of the murder of 10 patients, and the attempted murder of 27 others.",
  "published": "Thu, 06 Nov 2025 02:37:52 GMT",
  "url": "https://www.bbc.com/news/articles/cz0xgrv7543o?at_medium=RSS&at_campaign=rss",
  "source": "BBC News"
}