{
  "title": "Flames, smoke, sirens: Delegates flee as fire erupts at COP30 Summit in Brazil— Watch",
  "text": "(Video credits: X @BGatesIsaPyscho)\n\n‘THIS IS VIOLENCE’: Global Backlash As Brazil Opens Amazon To Oil Drilling On COP30 Eve\n\n\n\n\n\nA fire broke out at the COP30 climate summit in Belem, Brazil, on Thursday, forcing thousands of delegates to evacuate and halting negotiations at a critical moment in the two-week conference.Ironically, the blaze appears to have been caused by electrical equipment, likely a microwave — showing that even a summit dedicated to climate action doesn’t always follow its own rules.The blaze began around 2.00 pm (1700 GMT) in an exhibition pavilion. Security footage later showed flames racing up an internal fabric shell lining the walls and ceiling, burning a hole through the roof as smoke filled the corridors and people ran for the exits shouting “fire!”Firefighters said the incident was brought under control within six minutes. Nineteen people were treated for smoke inhalation and two for anxiety, according to the Brazilian presidency of the event.Firefighters and ambulances arrived with sirens blaring as smoke rose from the tents and permanent buildings hosting diplomats, journalists, and activists. The affected area was sealed off with a large sheet, and delegates were escorted in one by one to retrieve belongings, including passports needed for evening flights.Plenary sessions will not resume until Friday.It was the third major incident since the summit began last week, following peaceful demonstrations by Indigenous protesters who first stormed the venue and later blockaded the entrance. COP30 hosts Brazil and United Nations Climate Change said in a joint statement that security responded “swiftly” and the blaze was controlled quickly.After a fire department inspection, Brazil declared the site reopened at 8.40 pm.The disruption hit at a delicate stage in the negotiations, with ministers struggling to break a deadlock over fossil fuels, climate finance, and trade measures. Delegates remain divided over Brazil’s proposed “roadmap” to transition away from fossil fuels, as well as concerns about weak emissions-reduction plans and funding for developing nations.Earlier in the day, UN Secretary-General Antonio Guterres warned negotiators that “the world is watching” and urged them to reach an “ambitious compromise.” He also welcomed calls for clarity on the disputed issue of weaning the world off fossil fuels.With less than 24 hours before the summit’s scheduled end, nearly 200 countries are still working to reach consensus. Brazil has described securing a final deal as vital to accelerating global climate action and turning years of promises into meaningful progress.",
  "summary": "A fire at the COP30 climate summit in Belem, Brazil, disrupted crucial negotiations on fossil fuels and climate finance.  The blaze, likely from electrical equipment, forced thousands to evacuate but was quickly controlled.  This incident, the third major disruption, occurred as delegates raced against time to reach a vital global climate action deal, with UN chief urging ambitious compromise.",
  "published": "Fri, 21 Nov 2025 08:35:26 +0530",
  "url": "https://timesofindia.indiatimes.com/world/rest-of-world/flames-smoke-sirens-delegates-flee-as-fire-erupts-at-cop30-summit-in-brazilwatch/articleshow/125475897.cms",
  "source": "Times of India"
}