{
  "title": "After allies’ debacle in Bihar, JMM says Tejashwi should have sought Hemant Soren’s help",
  "text": "Jharkhand Mukti Morcha (JMM) general secretary and spokesperson Supriyo Bhattacharya on Friday said the Mahagathbandhan’s defeat in Bihar could have been avoided if RJD leader Tejashwi Yadav had understood the politics and pain of Dalit-Adivasi communities and had sought support from Jharkhand.\n\n“If Tejashwi ji had come to Ranchi and chanted the mantra ‘Haare ka sahara, Hemant Soren hamara’, just like devotees chant at Khatu Shyam temple in Rajasthan, the results would have been completely different,” said Bhattacharya at the JMM office, after the party won the Ghatshila bypoll by a significant margin.\n\nHe said the Bihar mandate was not a “janadesh (people’s mandate)”, but a “gyanadesh” engineered through “ED, CBI, and the Election Commission”.\n\n“Have you ever seen someone contest 101 seats and get 95 or 96 seats? Have you ever seen this in Lok Sabha even? This is not a mandate, this is a verdict manipulated by power. And in Bihar, the motherland of democracy, this is the murder of democracy — a disgusting killing,” he said, hinting at the BJP and JD(U), which contested 101 seats in Bihar each and won 89 and 85, respectively.\n\nOn the JMM’s win in Ghatshila, Bhattacharya said the verdict was a decisive rejection of the BJP’s politics of division. “Where BJP talks of caste, religion, varna and class to divide society, JMM talks about development,” he said. “We speak of education, healthcare, employment, women’s empowerment and universal social protection. They (BJP) tried to divide Adivasis and the people of Ghatshila have given them a tight slap.”\n\nAbout former CM Champai Soren’s future after switching sides, Bhattacharya said the JMM had always given respect to “Champai da” and it will keep doing so, but he has committed “political suicude” by joining BJP. “Vinaash kaale vipreet buddhi (When destruction approaches, the mind loses direction).”\n\n“If it was an accident, he could have come to JMM’s super speciality hospital for treatment. But he chose to walk into BJP’s morgue room. This is political suicide,” Bhattacharya said.\n\nStory continues below this ad\n\nFollowing the BJP’s defeat in the bypoll, Champai Soren posted on his X handle that in Jharkhand, their fight is against the “changing demography caused by infiltrators, against religious conversions and for protecting the language, culture, traditions and identity of the Adivasi community” and the struggle will continue.\n\nHe wrote that he knew this path was very difficult and they will face many obstacles, but “we will not bow down”. “I clearly believe that elections will keep coming and going, victories and defeats will continue, but our society must survive, our identity must survive, our Adivasiyat must remain, otherwise everything will end,” he said.\n\nChampai said the day they fail to protect the lands of Adivasis and sons of the soil, “who have already become minorities in districts like Pakur and Sahebganj”, and fail to protect the honour of the women living there, that day they will truly lose.\n\nJharkhand BJP president Babulal Marandi, reacting to the Ghatsila bypoll results, said the JMM’s victory was essentially a “victory of sympathy”. He said the failures of the Hemant Soren government were overshadowed by sympathy.\n\nStory continues below this ad\n\nOn the Bihar Assembly election results, Marandi said it was a historic victory for the NDA which the alliance earned because of good governance, development and nationalist ideology.",
  "summary": "",
  "published": "Sat, 15 Nov 2025 16:51:42 +0000",
  "url": "https://indianexpress.com/article/india/after-allies-debacle-in-bihar-jmm-says-tejashwi-should-have-sought-hemant-sorens-help-10368166/",
  "source": "India | The Indian Express"
}