{
  "title": "End of the road for Ghulam Nabi Azad’s party? Two ex-ministers rejoin Congress",
  "text": "In a setback for Ghulam Nabi Azad’s Democratic Progressive Azad Party (DPAP), two former Jammu and Kashmir ministers – Jugal Kishore Sharma and Abdul Majid Wani – along with hundreds of their supporters returned to the Congress on Thursday.\n\nFormer Member of Legislative Council (MLC) Subash Gupta and another prominent DPAP leader Brij Mohan Sharma also rejoined Congress at an event organised to mark the 108th birth anniversary of former Prime Minister Indira Gandhi.\n\nSpeaking on the occasion, Jugal Kishore Sharma said that the Congress is the only party “which believes in secularism and gives its leaders freedom to speak their mind.”\n\n“The other party is seeking votes in the name of religion. Religion is a personal thing, and one should have freedom to follow their own religion. This freedom is there in Congress,” Sharma said.\n\nJugal Kishore Sharma and Abdul Majid Wani, who have a sizable public support in Katra and Doda respectively, had unsuccessfully contested the 2024 assembly elections from Mata Vaishno Devi and Doda Assembly Constituencies.\n\nAll the four leaders along with their supporters had left Congress and joined DPAP in 2022 and were considered close confidants of Azad.\n\nThey were welcomed into the party fold by Congress national general secretary and J&K incharge Syed Naseer Hussain, J&K Pradesh Congress Committee president Tariq Hameed Karra and AICC general secretary GA Mir.\n\nStory continues below this ad\n\nSharma was a minister in the Mufti Mohammad Sayeed-led PDP-Congress government from 2000 to 2005 and in the Azad-led Congress-PDP government from 2005 to 2008. Wani was also inducted as a minister in the Azad-led government.\n\nMost of the senior Congress leaders who had joined DPAP, including former Deputy Chief Minister Tara Chand, have already returned to Congress.\n\nLast year in April, Azad had dissolved all the DPAP units, including state, provincial, zonal, district and block level committees, as well as positions of chief spokesperson and other spokespersons after almost all its prominent faces left the party following its debut in the 2024 assembly elections and returned to the Congress fold.\n\nA Congress veteran, Azad had quit the party in August 2022 calling the organisational election process “farce and a sham”, adding that the situation in the party has reached a point of no return.",
  "summary": "",
  "published": "Thu, 20 Nov 2025 02:39:02 +0000",
  "url": "https://indianexpress.com/article/india/end-of-the-road-for-ghulam-nabi-azads-party-two-ex-ministers-rejoin-congress-10375219/",
  "source": "India | The Indian Express"
}