{
  "title": "Democrats Rip Trump For ‘Abandoning’ Worker Protections From Biden Era",
  "text": "LOADING ERROR LOADING\n\nFederal agencies that took a hard line against coercive work contracts have retreated under President Donald Trump’s new appointees, and Democrats in Congress want to know why.\n\nRep. Summer Lee (Pa.) and Sen. Ed Markey (Mass.), joined by 44 other Democrats, sent letters to several agencies Wednesday demanding to know what they were doing to combat the growth of “stay-or-pay” employment agreements. Such contracts require workers to put in a minimum number of hours before quitting or they’ll have to fork over thousands of dollars to cover alleged training costs.\n\nAdvertisement\n\nAs HuffPost reported in a series of stories, the contracts have put nurses, pilots and even dog groomers deep into debt for resigning before their agreements allowed them to. Many workers choose to stay put in their jobs, forgoing higher pay elsewhere, for fear of getting sued, which is why the clauses are sometimes called “training repayment agreement provisions,” or TRAPs.\n\nFormer President Joe Biden’s appointees said the contracts were abusive and took a number of steps to curb employers’ use of them, including a proposal to outlaw them completely. But Markey and Lee say several agencies — including the Federal Trade Commission, the National Labor Relations Board and the Consumer Financial Protection Bureau — appear to have walked back such enforcement.\n\n“Unfortunately, the Trump Administration has abandoned efforts to protect workers from anticompetitive practices – such as TRAP’s – that suppress worker mobility and drive down wages,” the lawmakers wrote.\n\nAdvertisement\n\nThe FTC under Biden rolled out a historic ban on noncompete agreements that included a prohibition on TRAPs. But that rule got tied up in court until Trump’s FTC declined to defend it, effectively killing the ban.\n\nSimilarly, Biden’s appointees to the NLRB held that the agreements often violated workers’ rights and pursued cases against employers where they believed the law had been broken. But, as Lee and Markey noted, the NLRB has withdrawn that guidance since Trump’s appointees were put into place.\n\nRep. Summer Lee told Trump appointees she was concerned that federal agencies have stopped combating the use of \"TRAP\" agreements. via Associated Press\n\nAdvertisement\n\nAnd while Biden’s Labor Department had likened the agreements to “modern-day indentured servitude,” Trump’s Labor Department has offered “no update” on where its enforcement efforts stand, Lee and Markey said.\n\n“It also appears that your agency quickly settled one of its key TRAPs cases just weeks after you were sworn into your role, yet the terms of this settlement still have not been made public,” the lawmakers wrote to Trump’s labor secretary, Lori Chavez-DeRemer.\n\nIt’s hard to say exactly how many U.S. workers are subject to TRAP agreements, but research suggests they’ve become more prevalent in certain industries. In a survey by the union National Nurses United, nearly 45% of nurses who’d been working for five years or less reported being subject to such a contract, compared to only 9% of nurses who’d been working for more than 20 years.\n\nAdvertisement\n\nIn 2022, a PetSmart dog groomer who quit her job told HuffPost she learned from a collection agency that she owed $5,000 to the big-box chain for quitting before the 24 months specified in her contract. The company said she was on the hook for the purported cost of its grooming academy.\n\nEarlier this year, Colorado’s attorney general sued PetSmart for its past use of the contracts, arguing the company had violated state law. PetSmart had “lured prospective dog groomers with promises of ‘free’ paid training,” the state alleged, “only to trap them into staying with the company, even if they wanted to find a better job somewhere else.”\n\nIn their letters to various Trump appointees, Lee and Markey wrote that “workers deserve to know” whether federal agencies are doing anything to protect them from “these coercive employment practices.”",
  "summary": "Lawmakers are pressing Trump appointees on why they’ve rolled back guardrails against exploitative work contracts.",
  "published": "Thu, 20 Nov 2025 06:00:17 -0500",
  "url": "https://www.huffpost.com/entry/democrats-trump-stay-or-pay-contracts_n_691e3eb0e4b06f2a60cb8be5",
  "source": "Politics"
}