{
  "title": "‘We can no longer predict the seasons’: why Indonesia’s coal mindset has to change",
  "text": "Indonesia vital statistics\n\nGDP per capita per annum : $5,070 (global average $14,210)\n\nTotal annual tonnes CO2 : 812m\n\nCO2 per capita : 2.87 metric tonnes (global average 4.7)\n\nMost recent NDC (carbon plan) : 2025\n\nClimate plans : critically insufficient\n\nPopulation: 283 million\n\nA couple of months ago Bali experienced its worst floods in more than a decade.\n\nThey came at the peak of the dry season. Instead of the empty wells farmers faced last year, this time their crops were washed away; roads turned into brown, swirling rivers; houses collapsed in the torrents; and 17 people were killed.\n\nIndonesia, the world’s fourth-most populous country, faces a paradox. Sometimes described as a sleeping giant, it is one of the world’s most climate-vulnerable nations, but most people do not realise it is also the sixth-largest greenhouse-gas emitter.\n\nIndonesia has experienced rapid economic growth over the past two decades, at an average of 5% a year since 1997. But this progress has been powered by carbon-intensive resources at a steep cost to the environment.\n\nView image in fullscreen People try to clean up their shop after severe flooding in Denpasar, Bali, in September. Photograph: Anadolu/Getty\n\nDeforestation, peatland drainage and the extraction and burning of coal have powered Indonesia’s development model, reshaping landscapes through timber, pulp and mineral excavation and palm-oil booms.\n\nIndonesia produces 55% of the world’s palm oil, a sector that contributes 4.5% of GDP and employs more than 3 million people. More than 90% of Indonesia’s energy comes from fossil fuels; coal dominates, providing 70% of electricity, and the country remains the world’s largest exporter.\n\nEmissions are high: Indonesia released an average of 1.5bn tonnes of CO 2 -equivalent annually in 2018–20, about 3.5% of the global total. Now the challenge is to decouple emissions from economic growth.\n\nFirst must come coal. But although there is a moratorium on new coal plants “on paper”, Putra Adhiguna, the managing director of the Indonesian independent thinktank Energy Shift Institute, said a loophole allowed new “captive” plants (power plants owned by single industrial users) to power nickel smelters and industrial projects. Research shows captive-power capacity in Indonesia has more than doubled over five years, reaching 22.9GW in 2024 – more than 80% of which is from coal-fired plants and largely outside state oversight.\n\nAdhiguna said Indonesia must “dismantle its coal mindset”, which means removing the domestic price cap that keeps coal artificially cheap and blocks renewables from competing. “Indonesia’s renewable growth is really quite abysmal,” he said.\n\nThe drive to become a global supplier of minerals such as nickel, vital for electric vehicles, might bring jobs and investment, but it also leads to deforestation and pollution in Sulawesi and Maluku and is mostly powered by coal.\n\nThen there is the land sector, which accounted for about 40% of Indonesia’s emissions until 2020, particularly from deforestation and peatland fires. Indonesia is home to 10% of the world’s remaining tropical rainforest and the largest area of tropical peatlands of any country – estimated to hold tens of billions of tonnes of carbon.\n\nView image in fullscreen A baby orangutan hangs in a tree in a tropical rainforest in Borneo. Photograph: Panther Media GmbH/Alamy\n\nIn 2015, during a severe El Niño that fuelled huge peatland fires, Indonesia’s carbon output briefly surpassed that of the US. Deforestation rates have now fallen to their lowest in two decades, but environmentalists fear backsliding as the government pursues its huge food-estate programme which has cleared rainforest in Papua and Kalimantan and expands palm-oil biofuels under its B35 (35% palm oil-based biofuel and 65% fossil diesel fuel) and B40 (40% palm oil-based biofuel and 60% fossil diesel fuel) mandates.\n\nSatellite data this year shows new deforestation and fire hotspots in south Sumatra and central Kalimantan. Vast peat swamps – once waterlogged carbon sinks – continue to be drained for plantations, leaving tinder-dry material that burn and smoulder for weeks.\n\nView image in fullscreen Indonesian firefighters try to extinguish a peatland fire in Ogan Ilir, south Sumatra, in August 2021. Photograph: Anadolu Agency/Getty\n\nAnd yet climate change is hitting Indonesians hard. “Bali was a place that rarely experienced flooding,” said Made Krisna Dinata, the executive director of the NGO Walhi Bali. “Now, we can no longer see or even predict when these seasons will come and go.”\n\nIt’s a similar pattern across the archipelago, with increasing numbers of devastating climate-related disasters threatening food security and traditional ways of life. In urban areas, extreme heat is increasingly felt, while coastal regions face sea-level rise, coral bleaching and sinking land.\n\nIndigenous communities face exacerbated struggles, often lacking access to the government’s social and health insurance because their homes are situated in remote or forest areas.\n\nView image in fullscreen Fires burn in a rainforest cleared to plant palm oil trees in Tripa, Aceh province in June 2009. Photograph: Robert Nickelsberg/Getty\n\nHow committed is the country to change? In September, the government released its second nationally determined contribution, targeting a 31.89% emissions cut unconditionally – or 43.2% with foreign support – by 2030, which goes 8-17.5% deeper than before.\n\nThe plan is heavily reliant on land-use change, including restoring 2m hectares (5m acres) of peatlands, rehabilitating 8.3m hectares (20.5m acres) of degraded land and increasing renewables to 19-23% of the power mix. However, to meet those targets, Indonesia says it will need at least US$470bn (£360bn) in investment by 2030.\n\nIndonesian environmentalists have criticised the plan as not ambitious enough, while others argue execution will be the real test.\n\nAdhiguna said Indonesia might say it wanted to join the global shift to clean energy, but “policies and investments continue to lock the country into fossil-fuel dependency for decades to come”.\n\nRenewables account for less than 15% of the energy mix, despite vast potential. The Just Energy Transition Partnership, a US$20bn pledge from wealthy nations to speed the phase-out of coal, has stalled in bureaucracy.\n\n“The key is to reinvest fossil-fuel profits domestically,” Adhiguna said. “Indonesia is making a boatload of money out of fossil fuel. That money needs to be reinvested in the country for greener opportunities.”\n\nHe also said that as China, Indonesia’s biggest coal customer, shifts toward renewables, the country risks being left behind.\n\nFor Indonesia, climate action is inseparable from fairness. The Indonesian government has long argued that countries with large historic emissions should bear greater burdens and that to transition away from coal and ramp up renewables it needs international investment and supportive frameworks.\n\nView image in fullscreen Houses along the banks of Ciliwung River in Jakarta, Indonesia, where people live in poverty. Photograph: Bagus Indahono/EPA\n\nSisilia Nurmala Dewi of 350.org said while that was true, Indonesia also needed to do more at home. “We want to ask for energy transition money, we want to unlock that finance, but at the same time our policies are not signalling that we really want to transition,” she said.\n\nOn forests, Indonesia has been involved in the UN’s Redd+ (reducing emissions from deforestation and forest degradation) programme. Billions were promised through partnerships with Norway and others, including up to US$110m to East Kalimantan. But progress has been uneven, hindered by disputes over land rights and verification.\n\n“The concept is good,” Tiza Mafira, Indonesia’s director at the Climate Policy Initiative, said, “but we need better governance and accountability. Forest protection cannot depend on short-term donor projects – it must be part of a long-term national strategy.”\n\nIndonesia is also expanding its carbon markets and pitching them to investors at Cop30. A voluntary exchange launched in 2023 has begun trading credits from forestry and energy projects, while a national emissions-trading system is being extended to power and industry.\n\nThe road to Cop30\n\nAt Cop30 in Belém, Brazil, to which Indonesia has sent more than 400 delegates, it is positioning itself as a voice for the global south – pushing for climate equity and fair financing. Officials will tout the new NDC as proof of ambition, even as domestic growth depends on coal, nickel and palm oil.\n\nThe focus will be on affirming the 2030 forest and other land use (Folu) net sink target and highlighting its carbon-market potential to attract investors.\n\nView image in fullscreen Hanif Faisol Nurofiq, Indonesia’s minister for the environment, speaks at Cop30 in Belém, Brazil. Photograph: Fernando Llano/AP\n\nAdhiguna said near-term action was critical. The government’s emissions’ peak has already been pushed back to 2035, demanding faster cuts later. He hopes Cop30 will offer “clarity on the realisation plan for the president’s 100GW renewable targets”, alongside firm commitments to phase out coal and preserve rainforests.\n\nIt will also be an opportunity to emphasise Indonesia’s position as the world’s third-largest tropical rainforest country after Brazil and the Congo basin.\n\nFor many in the global south, Cop30 will revive the debate over who pays. Indonesia’s negotiators are expected to push for expanded funding through the green climate fund and reforms to carbon markets to ensure local communities share the benefits.\n\nMafira said loss-and-damage funding and the Baku-to-Belém roadmap, which aims to close the gap between the Cop29 target of $300bn annually and the envisioned $1.3tn in climate finance per year by 2035, were of huge importance. She said: “If that manages to get initiated, I think climate is back on the agenda of every developing country.\n\n“The failure of developed countries to put up the funding required has not been the death of climate action in developing countries, but it has been very effective ammunition for denying climate action, which we can do without.”\n\n",
  "summary": "<p>It’s a climate-vulnerable nation, while also being the world’s sixth-largest greenhouse-gas emitter. Global investment in climate action is vital</p> <a href=\"https://www.theguardian.com/environment/2025/nov/20/indonesia-coal-mindset-climate-crisis-cop30\">Continue reading...</a>",
  "published": "Thu, 20 Nov 2025 13:09:23 GMT",
  "url": "https://www.theguardian.com/environment/2025/nov/20/indonesia-coal-mindset-climate-crisis-cop30",
  "source": "World news | The Guardian"
}