{
  "title": "Secret underwater language of Hawaiian monk seals has 25 new calls",
  "text": "New research led by the UH Hawaiʻi Institute of Marine Biology (HIMB) Marine Mammal Research Program (MMRP) has greatly expanded scientists' understanding of how Hawaiian monk seals (Neomonachus schauinslandi) produce underwater sounds. The study, published in Royal Society Open Science, examined thousands of hours of passive acoustic recordings and uncovered 25 distinct underwater vocalizations. This represents a major jump from the six call types previously documented from seals in human care.\n\nResearchers also found that the seals use these low-frequency calls throughout the day. Similar vocal patterns were detected across the Hawaiian Archipelago, and calling rates increased in areas with larger seal populations. These findings create an essential foundation for interpreting the acoustic environment of this critically endangered and uniquely Hawaiian species.\n\nRevealing a Hidden Acoustic World\n\n\"We discovered that Hawaiian monk seals -- one of the world's most endangered marine mammals -- are far more vocal underwater than previously known,\" shares Kirby Parnell, lead author of the study and a PhD candidate with MMRP. \"By analyzing over 4,500 hours of recordings from across the Hawaiian Archipelago, we identified more than 23,000 vocalizations representing at least 25 distinct call types.\"\n\nThe research team used passive acoustic recorders placed at five important monk seal habitats, spanning sites from Molokaʻi to the remote Northwestern Hawaiian Islands. Their analysis revealed three major breakthroughs:\n\nExpanded Vocal Repertoire: Twenty previously unknown call types were identified.\n\nTwenty previously unknown call types were identified. Novel Communication Strategy: Evidence suggests monk seals can link different calls to create \"combinational calls\" -- a form of communication never before documented in any pinniped species.\n\nEvidence suggests monk seals can link different calls to create \"combinational calls\" -- a form of communication never before documented in any pinniped species. A Distinct Foraging Call: Researchers identified a new elemental call type, the Whine, used during foraging. This is only the second recorded instance of a seal species vocalizing while actively pursuing prey.\n\n\"We were surprised by the sheer diversity and complexity of monk seal vocalizations,\" notes Parnell. \"The discovery of combinational calls, where seals link multiple call types together, suggests a previously unknown level of complexity in pinniped acoustic communication. Finding a new call type -- the Whine -- associated with foraging behavior was also unexpected and suggests that monk seals may use sound not only for mating or socializing, but possibly for foraging purposes as well.\"\n\nConservation Importance in Hawaiian Waters\n\nThe Hawaiian monk seal is the only marine mammal found exclusively in Hawaiʻi and holds significant cultural value. Understanding its acoustic behavior is crucial for conservation efforts, especially as ocean noise continues to increase.\n\n\"This research provides the first comprehensive description of free-ranging Hawaiian monk seal underwater sound production, an important step toward understanding how they use sound for critical life-history events,\" explains Lars Bejder, Director of MMRP, Professor at HIMB, and co-author of the study. \"Because their vocalizations overlap with the same low-frequency range as many human-generated sounds (e.g. vessel noise), this work also helps us evaluate how ocean noise may affect communication, reproduction, and behavior in this endangered species.\"\n\nThese results support the future use of passive acoustic monitoring to track monk seal populations across their broad habitat range and protect the sound environments they rely on. Continued research will connect specific vocalizations to particular behaviors, including foraging, movement, social interactions, and reproduction. Another key goal is the development of automated detection systems that can monitor seal sounds more efficiently and with minimal disturbance, offering a long-term tool for conservation and ecological research.\n\nThe Team Behind the Discovery\n\nThe project brought together graduate students, undergraduate students, and recent alumni from the University of Hawaiʻi at Mānoa, along with collaborators from France and the Pacific Islands Fisheries Science Center's Hawaiian Monk Seal Research Program.\n\n\"Manually annotating over 23,000 calls by hand is no small feat, and I have a team of interns to thank for helping with the analysis!\" shares Parnell. \"This research would also not have been possible without the support of the Hawaiian Monk Seal Research Program, who deployed and retrieved the acoustic recorders in the Papahānaumokuākea National Marine Sanctuary.\"\n\nThe study was supported by NOAA Fisheries through the Cooperative Ecosystem Studies Unit (CESU) award NA19NMF4720181.",
  "summary": "Scientists have revealed that Hawaiian monk seals produce far more underwater vocalizations than previously believed. Their newly discovered 25-call repertoire includes complex combinations and a rare foraging-related call. These findings highlight an intricate acoustic world unfolding beneath the waves. The research opens the door to better protection strategies as human-made ocean noise continues to rise.",
  "published": "Mon, 17 Nov 2025 09:56:44 EST",
  "url": "https://www.sciencedaily.com/releases/2025/11/251117095644.htm",
  "source": "All Top News -- ScienceDaily"
}