{
  "title": "Look at the 'ugly corners' for the best value in Week 13 of the CFB season",
  "text": "Open Extended Reactions\n\nWeek 13 of the college football season is where the board stops caring about team names and starts revealing the value to anyone disciplined (or brave) enough to look at the ugly corners.\n\nLast week was a clean sweep on the card with numbers and outcomes lining up the way they were supposed to.\n\nThis week doesn't come with the shine of ranked matchups or brand-heavy teams, and that's OK. The best edges never show up in the games everyone wants to talk about. Look in the shadows, in the totals and team profiles that the market would rather scroll past. That's where these three plays come from.\n\nOh boy.\n\nPick: Pitt team total UNDER 30.5 (-110)\n\nPitt averages more than 73 plays per game -- one of the highest marks in the country -- yet manages only 5.5 yards per play, which is outside the top 60 nationally. That is the profile of a volume offense. They need reps, rhythm and time to score. When you need all three on the road against a team that controls pace the way Georgia Tech does, your ceiling shrinks.\n\nGeorgia Tech forces opponents into slower fights by running the ball well and winning possession. They are tied fourth in yards per play, and that style prevents Pitt from running its usual script. Take away pace, and a fragile offense shows its limits. Pitt becomes dependent on Mason Heintschel to deliver into tight coverage, and those windows disappear quicker against a defense with real speed.\n\nPitt can move the ball, but asking them to reach 31 points in a game where possessions fall below their season average and efficiency stays neutral creates a narrow scoring path. Everything in this matchup leans toward one side staying under, and for Pitt, that number is 30.5.\n\nPick: Cal team total OVER 24.5 (Even)\n\nCal needs Stanford's defense to keep being Stanford's defense. If that happens, then this matchup hands Cal short fields and red zone looks on a platter.\n\nWhen I handicap a team total, I start with: what does the opposing defense allow by default? The Cardinal have given up 50 red zone trips, third-most in the FBS. That's beyond a bad stretch, that's just failure. Allowing that many looks at touchdown is not an accident. Stanford's defense can't tackle, can't cover and can't get off the field.\n\nOffenses are getting downfield because Stanford sits 121st in coverage. Cal scores when its passing game finds leverage, and against this secondary, leverage is handed out for free. When your corners lose at the line and your linebackers can't carry anything vertical, even a modest offense turns efficient, and efficiency is all you need to get to 27. Cal clears because Stanford hasn't stopped anyone all year.\n\nPick: Nevada team total UNDER 16.5 (-110)\n\nAll of ESPN. All in one place. Watch college football and much more in the newly enhanced ESPN App. Stream the biggest games\n\nThere were two totals staring at me for this game, the Nevada team total under at -110 and the full game under 40.5 but priced at -120. Both look playable on paper, but one is more structurally sound. Expecting Nevada to be a dud has more weight.\n\nNevada has a 37% touchdown rate inside the red zone, third-lowest in the country, ahead of Maryland Terrapins and Massachusetts Minutemen. You can't fake that or scheme around it, it's just who Nevada is. The team can move the ball just enough to get inside the 20 but then it all collapses: protection, accuracy and play design. Against Wyoming's defense, which has allowed just 15 red zone touchdowns all season, that finishing problem gets magnified.\n\nThrow pace into the equation at 60 plays per game, one of the lowest marks in football, and the Wolf Pack will be lucky to see nine possessions. Sounds wild, but you need some sort of efficiency to even hit 17 in a low-possession game and Nevada simply doesn't have it.\n\nWhy not the full game under? That number requires cooperation from Wyoming's offense not finishing drives and that's where the risk is. Wyoming can stumble its way to 24 or maybe even 27, but Nevada not finding 17 is the part of the game I trust more.",
  "summary": "With a lack of top-rated matchups, Pamela Maldonado looks in the shadows to find the best CFB bets.",
  "published": "Thu, 20 Nov 2025 12:51:30 EST",
  "url": "https://www.espn.com/espn/betting/story/_/id/47024780/college-football-week-13-betting-georgia-tech-pitt",
  "source": "www.espn.com - TOP"
}