{
  "title": "Synthetic compound shows promise against multidrug resistance",
  "text": "Antimicrobial resistance directly causes more than 1 million deaths every year and contributes to more than 35 million more, according to the World Health Organization. Staphylococcus aureus and Enterococcus sp., 2 gram-positive pathogens highly likely to develop resistance to known treatments, can cause dangerous hospital-acquired and community-acquired infections.\n\nThis week in Microbiology Spectrum, researchers describe a newly synthesized compound called infuzide that shows activity against antimicrobial resistant strains of S. aureus and Enterococcus in laboratory and mouse tests. In addition, the findings suggest that infuzide kills bacteria in ways that differ from other antimicrobials, which may help keep resistance at bay.\n\nInfuzide emerged from more than a decade of work by interdisciplinary researchers looking for ways to create compounds that could act against pathogens in ways similar to known pharmaceutical compounds. Those include hydrazones, inorganic synthesized compounds that previous studies have shown to demonstrate antibacterial activity, including against resistant strains. The researchers synthesized 17 new compounds that contained hydrazones, and among those infuzide showed activity against gram-positive S. aureus and Enterococcus.\n\n\"We started the project as a collaboration, looking for ways to synthesize compounds and connecting them with compounds that might have biological activities,\" said medicinal chemist Michel Baltas, Ph.D., from the Laboratoire de Chimie de Coordination at the University of Toulouse in France. Baltas co-led the new work, along with Sidharth Chopra, Ph.D., from the CSIR-Central Drug Research Institute in Lucknow, India.\n\nThe researchers found that infuzide specifically attacks bacterial cells. In lab tests, they compared the antimicrobial effects of infuzide against vancomycin, a powerful antibiotic representing the standard of care in treating resistant infections. They found that infuzide more quickly and effectively reduced the size of bacterial colonies than the standard drug. In tests of resistant S. aureus infections on the skin of mice, the compound effectively reduced the bacterial population. The reduction was even higher, the researchers reported, when infuzide was combined with linezolid, a synthetic antibiotic.\n\nInfuzide did not show significant activity against gram-negative pathogens, though Baltas said the group is looking for small changes to infuzide that might expand its antimicrobial activity.\n\nThe researchers synthesized the compounds without the need of solvents, which can be expensive and environmentally hazardous. The simplicity of the chemical reactions, Baltas said, would make it easy to make large quantities to be used in new treatments. \"I am sure the same reactions can scale up.\"\n\nIn addition, the group has been investigating the effects of synthesized compounds on other infectious diseases, including tuberculosis. \"We have many other candidates to make antimicrobial compounds,\" Baltas said.",
  "summary": "Researchers have synthesized a new compound called infuzide that shows activity against resistant strains of pathogens.",
  "published": "Mon, 02 Jun 2025 15:49:10 EDT",
  "url": "https://www.sciencedaily.com/releases/2025/06/250602154910.htm",
  "source": "Latest Science News -- ScienceDaily"
}