{
  "title": "Farrell bristles at 'loaded' Prendergast questions",
  "text": "Ireland head coach Andy Farrell hit back at \"loaded questions\" as he defended fly-half Sam Prendergast before Saturday's Test against world champions South Africa.\n\nPrendergast started last week's 46-19 win over Australia after Jack Crowley wore the number 10 jersey against New Zealand and Japan.\n\nWhile Leinster's Prendergast shone in attack against the Wallabies, the 22-year-old's weakness in the tackle was exposed when Len Ikitau barged past him to score Australia's first try.\n\nAsked if he wanted to see more physicality from Prendergast, Farrell said: \"I understand the question and it's a question that obviously keeps popping up, but I think Sam's ability as a fly-half far outweighs a work-on within his game.\n\n\"I thought he was tremendous last week, his skillset has been fantastic for all to see and I think everyone needs to look through a little bit of a work-on because everyone's got work-ons and will continue to have work-ons throughout.\n\n\"That's up to us as coaches and the rest of the players to keep on working on them.\"\n\nPressed if he had spoken to Prendergast about his technique and body position, Farrell responded: \"I understand your question again, but they're loaded questions, do you know what I mean?\n\n\"Because then it's obvious we have to talk about that, but your question could be asked about any single player throughout.\n\n\"Of course, we constantly talk to individuals about all aspects of their play, so to think that we're just focusing on one aspect of one player is not right.\n\n\"For example, I spoke to our two leaders yesterday about certain aspects of their game. I'm talking about Caelan Doris and Dan Sheehan, world-class players, and they agree with their work-ons, so it's constant throughout for every single member of every single squad in world rugby.\"",
  "summary": "Ireland head coach Andy Farrell hits back at \"loaded questions\" as he defends fly-half Sam Prendergast before Saturday's Test against South Africa.",
  "published": "Thu, 20 Nov 2025 17:56:53 GMT",
  "url": "https://www.bbc.com/sport/rugby-union/articles/cz7p7215l94o?at_medium=RSS&at_campaign=rss",
  "source": "BBC Sport"
}