{
  "title": "New mRNA vaccine is more effective and less costly to develop",
  "text": "A new type of mRNA vaccine is more scalable and adaptable to continuously evolving viruses such as SARS-CoV-2 and H5N1, according to a study by researchers at University of Pittsburgh School of Public Health and the Pennsylvania State University. The study was published today in npj Vaccines.\n\nThough highly effective at inducing an immune response, current mRNA vaccines, such as those used to prevent COVID-19, present two significant challenges: the high amount of mRNA needed to produce them and the constantly evolving nature of the pathogen.\n\n\"The virus changes, moving the goal post, and updating the vaccine takes some time,\" said senior author Suresh Kuchipudi, Ph.D., chair of Infectious Diseases and Microbiology at Pitt Public Health.\n\nTo address these challenges, the researchers created a proof-of-concept COVID-19 vaccine using what's known as a\"trans-amplifying\" mRNA platform. In this approach, the mRNA is separated into two fragments -- the antigen sequence and the replicase sequence -- the latter of which can be produced in advance, saving crucial time in the event a new vaccine must be developed urgently and produced at scale.\n\nAdditionally, the researchers analyzed the spike-protein sequences of all known variants of the SARS-CoV-2 for commonalities, rendering what's known as a \"consensus spike protein\" as the basis for the vaccine's antigen.\n\nIn mice, the vaccine induced a robust immune response against many strains of SARS-CoV-2.\n\n\"This has the potential for more lasting immunity that would not require updating, because the vaccine has the potential to provide broad protection,\" said Kuchipudi. \"Additionally, this format requires an mRNA dose 40 times less than conventional vaccines, so this new approach significantly reduces the overall cost of the vaccine.\"\n\nThe lessons learned from this study could inform more efficient vaccine development for other constantly evolving RNA viruses with pandemic potential, Kuchipudi said. \"We hope to apply the principles of this lower-cost, broad-protection antigen design to pressing challenges like bird flu.\"\n\nOther authors on the study were Abhinay Gontu, Padmaja Jakka, Ph.D., Maurice Byukusenge, D.V.M., Ph.D., D.A.C.V.M., Meera Surendran Nair, Bhushan M. Jayarao, M.V.Sc., Ph.D., M.P.H., Marco Archetti, Ph.D., and Ruth H. Nissly, Ph.D., all of Pennsylvania State University; and Sougat Misra, Ph.D., Shubhada K. Chothe, Ph.D., M.V.Sc., B.V.Sc., Santhamani Ramasamy, Ph.D., D.A.C.V.M., and Lindsey C. LaBella, all of Pitt.\n\nThis research was supported by chair funds from the Huck Institutes of the Life Sciences and Interdisciplinary Innovation Fellowship at the One Health Microbiome Center at Pennsylvania State University.",
  "summary": "A new type of mRNA vaccine is more scalable and adaptable to continuously evolving viruses such as SARS-CoV-2 and H5N1, according to a new study.",
  "published": "Tue, 03 Jun 2025 11:48:25 EDT",
  "url": "https://www.sciencedaily.com/releases/2025/06/250603114825.htm",
  "source": "Latest Science News -- ScienceDaily"
}