{
  "title": "Zelenskyy ready to work on US-backed plan to end Russia-Ukraine war",
  "text": "Zelenskyy confirms that he discussed the US-backed plan with US Army Secretary Daniel Driscoll in Kyiv.\n\nUkrainian President Volodymyr Zelenskyy has said he’s willing to work with the United States on a plan to end Russia’s war on Ukraine, despite pushback from European allies who say that the US-backed plan heavily favours Russia.\n\nZelenskyy’s office on Thursday confirmed that he had received a draft of the plan, and that he would speak with US President Donald Trump in the coming days.\n\nHis office did not comment directly on the contents of the plan, which has not been published, but the Ukrainian leader had “outlined the fundamental principles that matter to our people”.\n\n“In the coming days, the President of Ukraine expects to discuss with President Trump the existing diplomatic opportunities and the key points required to achieve peace,” Zelenskyy’s office said.\n\nSeveral media outlets reported that the 28-point plan involves Ukraine ceding territory and weapons. Citing an unnamed US official with “direct knowledge”, Axios reported the plan would give Russia parts of eastern Ukraine that Moscow does not currently control, in exchange for a US security guarantee for Ukraine and Europe against future Russian aggression.\n\nUS Secretary of State Marco Rubio and US special envoy Steve Witkoff have been quietly working on the plan for a month, receiving input from both Ukrainians and Russians on terms that are acceptable to each side, White House Press Secretary Karoline Leavitt confirmed on Thursday.\n\nShe declined to comment on details of the emerging proposal, but said Trump has been briefed on it and supports it.\n\nAdvertisement\n\n“It is a good plan for both Russia and Ukraine, and we believe it should be acceptable to both sides. And we are working hard to get it done,” Leavitt said.\n\nZelenskyy confirmed later that he discussed the plan with US Army Secretary Daniel Driscoll in Kyiv.\n\n“Our teams – Ukraine and the USA – will work on the points of the plan to end the war,” Zelenskyy wrote on Telegram without commenting directly on the plan. “We are ready for constructive, honest and prompt work.”\n\nRussia appeared to play down any new US initiative.\n\n“Consultations are not currently under way. There are contacts, of course, but there is no process that could be called consultations,” Kremlin spokesman Dmitry Peskov said.\n\nWhile Zelenskyy has signalled he is willing to work with the Trump administration on a ceasefire, Kyiv’s European allies have expressed scepticism.\n\n“Ukrainians want peace – a just peace that respects everyone’s sovereignty, a durable peace that can’t be called into question by future aggression,” French Foreign Minister Jean-Noel Barrot said during a meeting of European Union foreign ministers in Brussels. “But peace cannot be a capitulation.”\n\nEU foreign policy head Kaja Kallas said any peace proposal would need support from Europe and Ukraine to move forward, with Polish Foreign Minister Radoslaw Sikorski saying that Europe – whose security is “at stake” – expects to be consulted on any potential deal.\n\n“I hope it’s not the victim that has restrictions on its ability to defend itself put on, but it’s the aggressor,” he said.\n\nFighting continues despite peace talks\n\nZelenskyy is facing pressure to join the US-backed diplomatic initiative as Ukrainian troops continue to lose ground to Russian forces in the country’s east.\n\nRussian President Vladimir Putin claimed in October that Russian forces had seized almost 5,000 square kilometres (1,930sq miles) of Ukraine this year.\n\nOn September 25, the Institute for the Study of War, a Washington-based think tank, independently assessed the real figure to be closer to 3,434sq km (1,325sq miles).\n\nRussia’s General Staff said Thursday that Moscow’s forces had seized the northeastern Ukrainian city of Kupiansk and controlled large sections of the towns of Pokrovsk and Vovchansk – a claim Ukraine vigorously denied.\n\n“The General Staff of Ukraine’s armed forces hereby announces that Kupiansk is under the control of Ukraine’s defence forces,” the Ukrainian General Staff said in a late evening bulletin.\n\n“Also untrue are statements suggesting that 80 percent of Vovchansk in the Kharkiv region has been captured and 70 percent of the city of Pokrovsk.”\n\nAdvertisement\n\nThis week, a devastating Russian aerial assault on Ternopil in western Ukraine killed at least 26 people and wounded dozens more, Interior Minister Ihor Klymenko confirmed Thursday.\n\nZelenskyy said on Thursday that 22 people were still missing at the site of Wednesday’s attack on Ternopil when Moscow unleashed 476 drones and 48 missiles across Ukraine. The attack damaged energy infrastructure across seven Ukrainian regions, prompting nationwide restrictions on power consumption.\n\n“Every brazen attack against ordinary life indicates that the pressure on Russia [to stop the war] is insufficient,” Zelenskyy said on Telegram.\n\nThe bombardment coincided with Zelenskyy’s visit to Turkiye aimed at reviving peace talks with Russia following his European diplomatic mission.\n\n“We count on the strength of Turkish diplomacy, on [how] it’s understood in Moscow,” Zelenskyy said after his meeting on Wednesday with Turkish President Recep Tayyip Erdogan.",
  "summary": "Zelenskyy confirms that he discussed the US-backed plan with US Army Secretary Daniel Driscoll in Kyiv.",
  "published": "Thu, 20 Nov 2025 22:59:32 +0000",
  "url": "https://www.aljazeera.com/news/2025/11/20/zelenskyy-ready-to-work-on-us-backed-plan-to-end-russia-ukraine-war?traffic_source=rss",
  "source": "Al Jazeera – Breaking News, World News and Video from Al Jazeera"
}