{
  "title": "Woman who drove round bend at 85mph admits killing three men",
  "text": "Woman who drove round bend at 85mph admits killing three men\n\n14 hours ago Share Save Share Save\n\nAlan Simpson Jorja Colville will be sentenced in January\n\nA 21-year-old woman who crashed a car after driving round a bend at more than 85mph has admitted killing her three passengers. Reece Williams, 23, Lewis Soden, 24, and Connor Page, 21, all died after the Ford Focus being driven by Jorja Colville crashed near Falkirk in July last year. The High Court in Edinburgh heard that Colville was also speeding at more than 90mph shortly before the accident outside the village of Dunmore. Colville admitted causing death by dangerous driving and will be sentenced on 8 January at the High Court in Stirling.\n\nHer bail was continued.\n\nPolice Scotland Connor Page, Lewis Soden and Reece Williams were all killed in the crash\n\nJudge Lady Ross told Colville a prison sentence was \"inevitable\" and that there was nothing that could be said to take away \"the desperate pain\" in the lives of the three victims' families. Colville, of Stirling, admitted causing the deaths of the men on 26 July last year by driving dangerously at excessive speed, failing to maintain control of her car, causing it to leave the road and travel onto a verge where it struck a tree. Advocate depute Scott McKenzie told the court that Colville, an early years assistant, had no previous convictions.\n\n'Screaming for help'\n\nThe prosecutor said that on the day of the crash, witness Kirstin Scobbie was driving on Moss Road on the approach to the collision site when she saw Colville's car behind her. She was travelling at about 60 mph, the appropriate speed limit, when the Focus overtook her before pulling back in close to the front of her vehicle. Mr McKenzie said: \"The white Ford Focus pulled away from her at speed.\" Following a series of bends in the road she noticed debris on the roadway and then saw the Focus in bushes. The prosecutor said: \"She noted the vehicle was on its side and had sustained serious damage. \"She stopped her vehicle as she approached the white Ford and saw Jorja Colville covered in blood and screaming for help.\" The court heard that Colville said that there were three people in the car who could not get out. Mr McKenzie said: \"She described that none of them were awake and that she did not know if they were breathing.\"\n\nAnother driver, Dean Norris, saw the Focus approaching him in the opposing lane and said it momentarily left the road surface due to the dip on the road and formed the impression it was travelling at excessive speed. \"He saw the vehicle land back on the road surface before it lost control as it passed him,\" said the prosecutor. Mr Norris turned back to offer help and went to the Focus, but could not find any signs of life from the three men inside the vehicle. When police arrived Colville confirmed she was the driver and said her boyfriend Reece Williams was in the car along with her friends. Mr Williams had sustained blunt-force injuries to his head, chest, abdomen and limbs in the crash. Mr Soden suffered multiple injuries to his head, neck, chest abdomen and pelvis and Mr Page died from multiple blunt-force head and neck injuries. The court heard that data recovered from the car showed its speed increased greatly on the approach to the crash scene, hitting a maximum speed of 92.6mph prior to a bend and continuing through the bend at speeds in excess of 85mph. Collision investigators said the crash occurred because the driver was \"driving at significantly excessive speed for the road layout and approaching hazards of which she was warned of\". The court heard that a section of the road before the crash site has a series of peaks and troughs with a warning sign in place to alert drivers. Defence solicitor advocate Gordon Martin KC told the court that Colville, who suffered a broken shoulder and ribs, has not driven since the incident.\n\n'Kind, generous and hardworking man'",
  "summary": "Connor Page, Lewis Soden and Reece Williams were all killed in the crash outside the village of Dunmore near Falkirk last year.",
  "published": "Thu, 20 Nov 2025 16:16:23 GMT",
  "url": "https://www.bbc.com/news/articles/cd676x8wvwpo?at_medium=RSS&at_campaign=rss",
  "source": "BBC News"
}