{
  "title": "Covid inquiry told top NHS doctor was terrified",
  "text": "Covid inquiry told top NHS doctor was terrified\n\n7 November 2024 Share Save Jim Reed Health reporter Share Save\n\nCovid inquiry Prof Sir Stephen Powis, national medical director at NHS England, was giving evidence to the Covid inquiry in west London.\n\nThe most senior doctor in NHS England has said he was \"personally terrified\" that hospitals could have been overwhelmed in the early stages of the pandemic. Prof Sir Stephen Powis told the Covid inquiry officials had drawn up a draft document advising whose care should be prioritised if the NHS found itself unable to cope with the surge in patients. The 'Covid-19 decision tool' assigned points based on a patient's age, frailty and underlying conditions. A high score meant they might not be admitted to intensive care if services were overwhelmed. The tool was never issued publicly, after it became clear infections might have already reached a peak in March 2020.\n\nSir Stephen, who still serves as national medical director at NHS England, said the senior clinicians who were asked to draw up the plans at short notice \"did a magnificent job\" that \"nobody ever wants to do\". \"But it became absolutely clear to me that this was going to be controversial, [and] that it hadn't had the opportunity to be discussed more widely with patient groups, [or] with the public,\" he added. The draft document advised doctors to score Covid patients based on three criteria, using a frailty scale. It detailed how those with a total score of more than eight points should not be admitted to intensive care if services became overwhelmed. Patients aged 70 to 75 were to be automatically assigned four points, while those aged over 80 would receive six. Extra points would be added for chronic conditions, such as heart disease or diabetes. People who were terminally ill, with a life expectancy of less than six months, would automatically be given nine points.\n\nCovid inquiry Screenshot of the Covid-19 decision tool shown in evidence to the Covid inquiry",
  "summary": "Sir Stephen Powis says points-based tool was drawn up should need to prioritise patients have arisen.",
  "published": "Thu, 07 Nov 2024 17:34:34 GMT",
  "url": "https://www.bbc.com/news/articles/cd0gdzdv53yo?at_medium=RSS&at_campaign=rss",
  "source": "BBC News"
}