{
  "title": "I have hit the barriers trying to get my accident claim settled with Autonet",
  "text": "My van was hit from behind on a motorway by a speeding driver who failed to stop.\n\nIt spun across the carriageway, hitting the barriers on either side, and went up in flames. I thankfully got off with a small head injury. I reported the collision to my insurance company, Autonet, and was told it would be in touch.\n\nSix weeks on and I’ve heard nothing. My tools are still inside my van, which is completely stalling my work as a self-employed tradesman. The compound where it is being stored needs permission from my insurer before allowing me access, but every time I call, I’m passed between a broker, an underwriter and a claims management firm.\n\nThe only communication I have had is from the compound telling me I owe it £25 for every day my van is on its premises. As the bill racks up, so does my stress.\n\nSJ Buckhaven, Fife\n\nYour SOS reached me at the end of June. You had reported the crash to Autonet in mid-May and were loaned a van.\n\nThe intervening months for both of us have been a low-speed car chase over roundabouts and dead ends.\n\nAutonet told me you would not be liable for storage costs and admitted: “We have fallen short with our communication and responsiveness.” That was in early July. It promised to be in touch.\n\nContact when it came was to demand details of the accident, which you had submitted two months earlier, suggesting your claim had not even been started. Autonet said it would discuss compensation to “reflect the impact our service has had” and it reunited you with your tools, which were too damaged to use.\n\nA month later, you were still waiting for an offer for the market value of your van and for promised remuneration for your expenses, including 11 days of lost work because of the lack of tools and transport.\n\nAutonet, despite receipts, offered only half the £6,750 expenses you claimed. When I questioned this, it agreed to pay the rest, but insisted the sum included the promised compensation. Again it agreed it had “fallen short”.\n\nBy now it was August, 16 weeks after your claim. There was still no word about the payout for the van and no response to your frantic messages.\n\nIn September, you were at last contacted – to be told you had to surrender your courtesy van with immediate effect because the claim was taking too long.\n\nI established that you had unwittingly signed a credit hire agreement, which, unlike a courtesy deal, holds you legally liable for the hire costs if the third-party insurer fails to pay out. You say the significance was not explained to you; Autonet told me you should have read the small print.\n\nMinus wheels once more, you had to spend money you couldn’t afford on an inferior replacement vehicle.\n\nUnder pressure from me, the underwriter finally proposed a more acceptable figure of £1,835 for your ruined van, and Autonet once again said it had “fallen short”.\n\nThe relief also fell short. Weeks passed; no money arrived. It seemed that the insurer was only now, more than four months after the accident, seeking to establish third-party liability.\n\nYou were eventually paid on the last day of October after 169 days, 30 emails from me to you and Autonet and countless sleepless nights on your part.\n\nIt might not be over yet. If the third-party insurer refuses to pay for the months you had the hire van, you might be required to assist with any legal action Autonet and its underwriter might take.\n\nWe welcome letters but cannot answer individually. Email us at consumer.champions@theguardian.com or write to Consumer Champions, Money, the Guardian, 90 York Way, London N1 9GU. Please include a daytime phone number. Submission and publication of all letters is subject to our terms and conditions.",
  "summary": "<p>My van was hurtled into motorway barriers by a driver who did not stop and the vehicle is still being held in a compound along with the tools of my trade</p><p><strong>My van was hit from behind on a motorway by a speeding driver who failed to stop.</strong></p><p><strong>It spun across the carriageway, hitting the barriers on either side, and went up in flames. I thankfully got off with a small head injury. I reported the collision to my insurance company, Autonet, and was told </strong><strong>it would be in touch.</strong></p> <a href=\"https://www.theguardian.com/money/2025/nov/17/i-have-hit-the-barriers-trying-to-get-my-accident-claim-settled-with-autonet\">Continue reading...</a>",
  "published": "Mon, 17 Nov 2025 07:00:01 GMT",
  "url": "https://www.theguardian.com/money/2025/nov/17/i-have-hit-the-barriers-trying-to-get-my-accident-claim-settled-with-autonet",
  "source": "The Guardian"
}