{
  "title": "Japan stimulus push: Cabinet approves $135.4 billion package - here's what it includes",
  "text": "File photo: Japan's Prime Minister Sanae Takaichi (Picture credit: ANI)\n\nJapan has moved ahead with a sweeping ¥21.3 trillion ($135 billion) stimulus push, the first major policy step under Prime Minister Sanae Takaichi.Her cabinet signed off on the plan on Friday, with the measures aimed at easing the pressure of rising prices on families and businesses.The approval marks the biggest stimulus since the Covid pandemic and reflects Takaichi’s promise to run an expansionary fiscal agenda, as per Reuters.The core of the package includes ¥17.7 trillion in general account spending, well above last year’s ¥13.9 trillion, along with ¥2.7 trillion in tax cuts.Local reports cited by news agency AFP said the bundle also features energy support for households.he government is expected to rely on higher tax revenues from inflation and a fresh round of bond issuance, which, according to Reuters, could exceed the ¥6.69 trillion issued for last year’s plan.A supplementary budget is due to be approved as early as 28 November, with the aim of getting parliament’s sign-off by year-end.Markets have reacted nervously to the plan’s scale. The yen has dropped to its weakest level in ten months, while long-term government bond yields touched record highs.Finance minister Satsuki Katayama hinted strongly at possible intervention, saying Tokyo would take “appropriate action against disorderly (foreign exchange) moves,” AFP reported.Analysts quoted by AFP warned that a further slide in the currency would deepen the strain on households reliant on imported food, fuel and raw materials.Takaichi has defended her approach, stressing earlier this week that her goal is to pursue a “responsible and proactive fiscal policy” and keep living costs in check.Official data showed core inflation rising to 3% in October, up from 2.9% in September, with rice about 40% costlier than this time last year, according to AFP.The package also comes after the economy shrank 0.4% in the third quarter, marking Japan’s first contraction since early 2024.Alongside economic concerns, Tokyo faces rising diplomatic tensions with Beijing. China summoned Japan’s ambassador after Takaichi suggested Japan could respond militarily if Taiwan were attacked.Media reports said Beijing is preparing to halt Japanese seafood imports, though neither side has confirmed it.Takaichi, who took office last month, has argued that heavy spending is necessary to reduce the burden on households and spur investment in fields like AI, chips and shipbuilding.",
  "summary": "Japan's Prime Minister Sanae Takaichi unveiled a massive ¥21.3 trillion stimulus package, its largest since the pandemic, to combat inflation's impact on citizens and businesses. This significant fiscal move, featuring energy subsidies and tax relief, aims to ease rising living costs.",
  "published": "Fri, 21 Nov 2025 11:07:16 +0530",
  "url": "https://timesofindia.indiatimes.com/business/international-business/japan-stimulus-push-cabinet-approves-135-4-billion-package-heres-what-it-includes/articleshow/125477853.cms",
  "source": "Times of India"
}