{
  "title": "Ovechkin's hat trick puts him 10th on points list",
  "text": "Open Extended Reactions\n\nMONTREAL -- Alex Ovechkin padded his NHL goals record and moved up a couple other big lists in the Washington Capitals' 8-4 romp over the Montreal Canadiens on Thursday night.\n\nOvechkin had his 33rd career hat trick to tie Brett Hull for fourth in NHL history and added an assist as he moved past Joe Sakic into 10th on the points list.\n\nOvechkin has 10 goals in 21 games this season to push his NHL-record to 907. The 40-year-old Russian has 1,643 points, two more than Sakic.\n\n\"I just try to do my job and try to enjoy the moment and enjoy the time,\" Ovechkin said.\n\nOvechkin opened the scoring on a power play a minute into the first period, firing a wrist shot past goalie Sam Montembeault off a faceoff. Ovechkin assisted on Ethen Frank's goal two minutes into the second that gave the Capitals the lead for good at 2-1.\n\nThe Washington star scored twice late in the third period, the first on a rush with 4:57 to go and the second into an empty net from his own zone with 2:04 remaining. He has scored in four straight games and has seven goals in his last six games.\n\n\"After everything he's done we're still amazed at what he can do, and I'm sure he's not close to slowing down,\" Frank said of Ovechkin.\n\nWashington's Alex Ovechkin celebrates after scoring a goal during the third period of the Capitals' 8-4 win over Montreal on Thursday. Vincent Ethier/Icon Sportswire\n\nOvechkin is the second player in NHL history with six goals in a four-game span at age 40 or older, according to ESPN Research.\n\nComing off a 7-4 home victory over Edmonton on Wednesday night, Washington has won three in a row to improve to 11-8-2. It was the Capitals' lone road game in an eight-game span.\n\nMontreal has lost five straight and seven of eight.\n\nInformation from The Associated Press was used in this report.",
  "summary": "Alex Ovechkin had his 33rd career hat trick and added an assist to move into 10th place on the NHL points list, helping the Capitals beat Montreal 8-4 on Thursday night.",
  "published": "Thu, 20 Nov 2025 23:07:46 EST",
  "url": "https://www.espn.com/nhl/story/_/id/47043399/ovechkin-moves-10th-place-points-list-capitals-win",
  "source": "www.espn.com - TOP"
}