{
  "title": "French conservatives are inching towards a pact with Le Pen that could enable a far-right takeover of the country | Paul Taylor",
  "text": "‘Not one vote for the left!” That call from Bruno Retailleau, chair of the mainstream conservative party Les Républicains (LR), helped a candidate allied with Marine Le Pen’s far-right National Rally (RN) to sweep to victory in a byelection run-off against a socialist in southwest France last month after the centre-right candidate was eliminated in the first round.\n\nIt was a clear sign that, despite frequent denials, the much-diminished heirs to Charles de Gaulle’s conservative movement are inching towards a controversial “union of the right” that could put Le Pen or her protege, Jordan Bardella, in the Élysée Palace in 2027.\n\nGone is the taboo on any collaboration with the extreme right propounded by Gaullist president Jacques Chirac when Le Pen’s father, Jean-Marie Le Pen, first reached the run-off in the 2002 presidential election. Gone, too, is the “republican front” spanning from the centre-right through president Emmanuel Macron’s centrists to the radical left France Unbowed (LFI), which stopped the far right from sweeping the board in a snap parliamentary election just a year ago. Under that informal pact, parties of the “republican arc” stood down in favour of the best-placed candidate among them to defeat the RN in the second round.\n\nThat resulted in a three-way deadlocked parliament with weak, revolving-door governments that has cratered public trust in the mainstream parties and boosted the RN’s standing.\n\nEvery week brings new evidence that the firewall between the mainstream centre right and the extreme right is breaking down as Les Républicains struggle for survival against a surge in voter support for the nationalist, xenophobic and Eurosceptic RN. Recent opinion polls show the RN has 35% support or higher, whether their presidential candidate is Le Pen, currently barred from running by a conviction for embezzling EU funds which she is appealing, or Bardella, the 30-year-old party president. None of the potential LR candidates scores even 10%, and backing for centrist contenders is also shrinking.\n\nLR is locked in a power struggle between Retailleau, who was riding high as a hardline interior minister until he brought the government down a few weeks ago, and Laurent Wauquiez, LR’s parliamentary floor leader. Other LR hopefuls, including northern big political player Xavier Bertrand, are also vying for the nomination.\n\nBertrand is one of the rare Gaullists arguing against any deal with the far right. His line has little traction among LR members of parliament scrambling to save their seats, which may require at least a mutual non-aggression pact with Le Pen’s party. A handful of LR deputies, led by former party leader Éric Ciotti, broke away and cut such a deal with Le Pen at the last parliamentary election. Now, pressure for a “union of the right” is mounting – amplified by the rightwing media empires of billionaires Vincent Bolloré and Pierre-Édouard Stérin.\n\nLeaders of Les Républicains are already vying with the far right in shrill rhetoric and proposals to curb immigration and deny benefits to new immigrants. As interior minister until September, Retailleau toughened conditions for immigrants to receive French nationality and campaigned against birthright citizenship. At present, children of immigrants born on French soil automatically become citizens when they turn 13 if they have resided in the country for five years.\n\nMainstream conservatives keep putting out feelers to the far right. Wauquiez recently met Éric Zemmour, a radical anti-Islam crusader to the right of Le Pen, to discuss the idea of holding a presidential primary election open to all contenders from the centre right to the far right. The RN has no interest in such a contest because its own candidate is streets ahead in the polls, so a primary looks unlikely to happen. But raising the idea is a way of building bridges to the right of LR.\n\nThe problem for Les Républicains is that, barring an electoral miracle, a “union of the right” will simply ease the hard right’s path to power. As Jean-Marie Le Pen liked to say, voters prefer the original to the copy. So LR would probably end up as a junior partner, either joining a government dominated by the RN, as its sister party Forza Italia has done in hard-right Giorgia Meloni’s administration in Italy, or propping up an RN administration from outside.\n\nWhile this manoeuvring is going on in Paris, LR is cuddling up to the far right in the European parliament in Brussels, where its group leader, François-Xavier Bellamy, voted for an RN censure motion against European Commission president Ursula von der Leyen over her support for an EU trade deal with South American countries. LR also voted with the hard right against ambitious EU carbon emissions target for 2040 in a sign of converging hostility to climate-friendly policies.\n\nskip past newsletter promotion Sign up to Headlines Europe Free newsletter A digest of the morning's main headlines from the Europe edition emailed direct to you every week day Enter your email address Sign up Privacy Notice: Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on theguardian.com to send you this newsletter. You can complete full registration at any time. For more information about how we use your data see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nThe erosion of the French firewall against the extreme right mirrors the crumbling of barriers in the EU legislature. The centre-right European People’s party, to which LR belongs, is increasingly willing to push through its deregulation agenda with far-right votes when it cannot press the centrist and socialist groups into loosening environmental reporting requirements and liabilities for business. It did so in a 13 November vote on corporate sustainability and supply-chain transparency rules.\n\nFrench conservative leaders insist that they want Le Pen’s voters, not her party’s leaders. But when faced with the choice of losing their remaining town halls or cutting deals with the RN in municipal elections next March, there is little doubt that LR will go for local agreements, even if that means the election of more RN mayors and councillors.\n\nIf Les Républicains become the enablers of a hard-right takeover of France, which rolls back citizenship and welfare rights and puts Paris on a collision course with the EU, this is likely to break the party and spell the end of the Gaullist legacy in French politics – as well as discrediting the party morally.\n\nPaul Taylor is a senior visiting fellow at the European Policy Centre\n\n\n\n\n\n",
  "summary": "<p>In trying to woo hard-right voters, Les Républicains risk destroying France’s Gaullist legacy and putting Paris on a collision course with the EU</p><p>‘Not one vote for the left!” That call from Bruno Retailleau, chair of the mainstream conservative party Les Républicains (LR), helped a candidate allied with Marine Le Pen’s far-right National Rally (RN) to sweep to victory in a <a href=\"https://www.lefigaro.fr/politique/tarn-et-garonne-le-candidat-soutenu-par-le-rn-remporte-l-election-legislative-partielle-20251012\">byelection run-off against a socialist</a> in southwest France last month after the centre-right candidate was eliminated in the first round.</p><p>It was a clear sign that, despite frequent denials, the much-diminished heirs to Charles de Gaulle’s conservative movement are inching towards a controversial “union of the right” that could put Le Pen or her protege, Jordan Bardella, in the Élysée Palace in 2027.</p><p>Paul Taylor is a senior visiting fellow at the European Policy Centre</p> <a href=\"https://www.theguardian.com/commentisfree/2025/nov/20/french-conservatives-inching-pact-le-pen-could-enable-far-right-takeover-country\">Continue reading...</a>",
  "published": "Thu, 20 Nov 2025 05:00:15 GMT",
  "url": "https://www.theguardian.com/commentisfree/2025/nov/20/french-conservatives-inching-pact-le-pen-could-enable-far-right-takeover-country",
  "source": "The Guardian"
}