{
  "title": "Trump announces new offshore drilling projects despite bipartisan pushback",
  "text": "The plan would include six new offshore sales between 2027 and 2030.\n\nThe administration of United States President Donald Trump has announced new oil drilling off the California and Florida coasts for the first time in decades, advancing a project that critics say could harm coastal communities and ecosystems, as Trump seeks to expand US oil production.\n\nThe White House announced the news on Thursday.\n\nThe oil industry has been seeking access to new offshore areas, including Southern California and off the coast of Florida, as a way to boost US energy security and jobs.\n\nWhat’s in the plan?\n\nThe administration’s plan proposes six offshore lease sales through 2030 in areas along the California coast.\n\nIt also calls for new drilling off the coast of Florida in areas at least 160km (100 miles) from that state’s shore. The area targeted for leasing is adjacent to an area in the Central Gulf of Mexico that already contains thousands of wells and hundreds of drilling platforms.\n\nThe five-year plan also would compel more than 20 lease sales off the coast of Alaska, including a newly designated area known as the High Arctic, more than 320km (200 miles) offshore in the Arctic Ocean.\n\nInterior Secretary Doug Burgum said in announcing the sales that it would take years for the oil from those parcels to get to market.\n\n“By moving forward with the development of a robust, forward-thinking leasing plan, we are ensuring that America’s offshore industry stays strong, our workers stay employed, and our nation remains energy dominant for decades to come,” Burgum said in a statement.\n\nAdvertisement\n\nThe American Petroleum Institute said in response that the announced plan was a “historic step” towards unleashing vast offshore resources. Industry groups have pointed to California’s history as an oil-producing state and say it already has infrastructure to support more production.\n\nPolitical pushback\n\nLeaders in both California and Florida have pushed back on the deal.\n\nLast week, Florida Republican Senator Ashley Moody and Rick Scott co-sponsored a bill to maintain a moratorium on offshore drilling in the state that Trump signed in his first term.\n\n“As Floridians, we know how vital our beautiful beaches and coastal waters are to our state’s economy, environment and way of life,” Scott said in a statement. “I will always work to keep Florida’s shores pristine and protect our natural treasures for generations to come.”\n\nA spokesman for California Governor Gavin Newsom said Trump officials had not formally shared the plan, but said “expensive and riskier offshore drilling would put our communities at risk and undermine the economic stability of our coastal economies”.\n\nCalifornia has been a leader in restricting offshore oil drilling since the infamous 1969 Santa Barbara spill that helped launch the modern environmental movement. While there have been no new federal leases offered since the mid-1980s, drilling from existing platforms continues.\n\nNewsom expressed support for greater offshore controls after a 2021 spill off Huntington Beach and has backed a congressional effort to ban new offshore drilling on the West Coast.\n\nA Texas-based company, with support from the Trump administration, is seeking to restart production in waters off Santa Barbara damaged by a 2015 oil spill. The administration has hailed the plan by Houston-based Sable Offshore Corp as the kind of project Trump wants to increase US energy production as the federal government removes regulatory barriers.\n\nThe announcement comes as Governor Newsom attended the COP30 climate conference in Brazil.\n\n“He [Trump] intentionally aligned that to the opening of COP,” Newsom said.\n\nEven before it was released, the offshore drilling plan met strong opposition from Newsom, a Democrat who is eyeing a 2028 presidential run and has emerged as a leading Trump critic.\n\nNewsom pronounced the idea “dead on arrival” in a social media post. The proposal is also likely to draw bipartisan opposition in Florida. Tourism and access to clean beaches are key parts of the economy in both states.\n\nDemocratic lawmakers, including California Senator Alex Padilla and Representative Jared Huffman, the top Democrat on the House Natural Resources Committee, warned that opening vast coastlines to new offshore drilling would hurt coastal economies, jeopardise national security, ravage coastal ecosystems, and put the health and safety of millions of people at risk.\n\nAdvertisement\n\n“With this draft plan, Donald Trump and his Administration are trying to destroy one of the most valuable, most protected coastlines in the world and hand it over to the fossil fuel industry,” Padilla and Huffman said in a joint statement.\n\nThe federal government has not allowed drilling in federal waters in the eastern Gulf of Mexico, which includes offshore Florida and part of offshore Alabama, since 1995, because of concerns about oil spills. California has some offshore oil rigs, but there has been no new leasing in federal waters since the mid-1980s.\n\nSince taking office for a second time in January, Trump has systematically reversed former President Joe Biden’s focus on slowing climate change to pursue what the Republican calls US “energy dominance” in the global market.\n\nTrump, who recently called climate change “the greatest con job ever perpetrated on the world,” created a National Energy Dominance Council and directed it to move quickly to drive up already record-high US energy production, particularly fossil fuels such as oil, coal and natural gas.\n\nMeanwhile, Trump’s administration has blocked renewable energy sources such as offshore wind and cancelled billions of dollars in grants that supported hundreds of clean energy projects across the country.",
  "summary": "The plan would include six new offshore sales between 2027 and 2030.",
  "published": "Thu, 20 Nov 2025 22:52:35 +0000",
  "url": "https://www.aljazeera.com/economy/2025/11/20/trump-announces-new-offshore-drilling-projects-despite-bipartisan-pushback?traffic_source=rss",
  "source": "Al Jazeera – Breaking News, World News and Video from Al Jazeera"
}