{
  "title": "Justice Department Is Examining The Handling Of Its Adam Schiff Mortgage Fraud Probe",
  "text": "LOADING ERROR LOADING\n\nWASHINGTON (AP) — The Justice Department is examining the handling of the mortgage fraud investigation into Sen. Adam Schiff, including the potential involvement of people who claimed to be acting at the behest or direction of two Trump administration officials who have been pushing the probe of the California Democrat, according to a document reviewed by The Associated Press.\n\nFederal authorities involved in the Schiff investigation in Maryland interviewed a Republican congressional candidate on Thursday who has promoted the mortgage fraud allegations against the lawmaker and quizzed her about any communications she may have had with Justice Department official Ed Martin and Federal Housing Finance Agency Director Bill Pulte. The interview came after the woman received a subpoena seeking information about communications she may have had with people claiming to be working at the direction of Pulte and Martin.\n\nAdvertisement\n\nChristine Bish, a real estate agent who is running for a congressional seat in California, told the AP that she was prepared to speak to investigators about her own yearslong effort to draw attention to Schiff’s mortgages. But authorities instead were focused on potential interactions she has had with Pulte and Martin, Bish said.\n\n“I expected to be asked questions, a lot of questions, about, ’How did you come about investigating Adam Schiff and what were your findings?” Bish said. “What they wanted to know was if I was in communication with Ed Martin or Director Pulte — and I was not.”\n\nBish said she kept trying to return to the Schiff allegations, but that the officials “are trying to, in my opinion, investigate the investigators.”\n\nAdvertisement\n\nSen. Adam Schiff and Attorney General Pam Bondi. AP\n\nThe revelation that authorities are turning their attention to the handling of the Schiff investigation is likely to bring fresh scrutiny to the already criticized efforts by Pulte and Martin to investigate Trump political foes for mortgage fraud.\n\nThe revelation that authorities are turning their attention to the handling of the Schiff investigation is likely to bring fresh scrutiny to the already criticized efforts by Pulte and Martin to investigate Trump political foes for mortgage fraud.\n\nAdvertisement\n\nIn recent months, Bish had been contacted by multiple times by Robert Bowes, who worked in the first Trump administration and purported to work for Pulte, according to a person familiar with the conversations who spoke on the condition of anonymity due to concern about retribution.\n\nBowes, who is listed on the subpoena, asked Bish to investigate the mortgages of multiple people, the person said. On one occasion, Bowes asked Bish to serve as a source to a national news outlet he claimed was working on a negative story about mortgages held by Deputy Attorney General Todd Blanche, the person said.\n\nBowes did not respond to a request for comment Thursday\n\nPulte did not immediately respond to a message seeking comment. A message seeking comment was also left with a spokesperson for Martin. The Justice Department declined to comment.\n\nAdvertisement\n\nIn August, the department named Martin as a special prosecutor to help conduct investigations into Schiff and New York Attorney General Letitia James. Prosecutors have separately issued subpoenas as part of a mortgage fraud investigation into Lisa Cook, the Federal Reserve governor whom Trump has sought to fire.\n\nLawyers for all three have denied the allegations.\n\nThe investigation into Schiff is being conducted by prosecutors in Maryland, though the status of the inquiry is unclear. The investigation into James resulted in criminal charges last month in Virginia. She has pleaded not guilty and, in a filing this week, her lawyers decried what they said was “outrageous” government conduct that resulted in her indictment.\n\nBish told the AP that she previously submitted her work on Schiff to congressional ethics officials, but that nothing came of it. After Pulte put out a call for mortgage fraud tips, she resubmitted her research to the agency he leads as well as the FBI. Pulte called her and left a voicemail asking for more information, she said, but Bish said she has never had a conversation with him.\n\nAdvertisement",
  "summary": "The department is said to be scrutinizing the potential involvement of people who claimed to be acting at the behest or direction of two Trump administration officials.",
  "published": "Thu, 20 Nov 2025 15:36:35 -0500",
  "url": "https://www.huffpost.com/entry/justice-department-adam-schiff_n_691f7a81e4b047290e295677",
  "source": "Politics"
}