{
  "title": "Preventing chronic inflammation from turning into cancer",
  "text": "Chronic inflammatory bowel disease is challenging to treat and carries a risk of complications, including the development of bowel cancer. Young people are particularly affected: when genetic predisposition and certain factors coincide, diseases such as ulcerative colitis or Crohn's disease usually manifest between the ages of 15 and 29 -- a critical period for education and early career development. Prompt diagnosis and treatment are crucial. Researchers at Charité -- Universitätsmedizin Berlin have now discovered a therapeutic target that significantly contributes to halting the ongoing inflammatory processes. Their findings are published in the current issue of the journal Nature Immunology.\n\nSometimes gradually, sometimes in flare-ups -- accompanied by severe abdominal cramps, diarrhea, weight loss, fatigue and a high level of emotional stress -- this is how the two most common chronic inflammatory bowel diseases, Crohn's disease and ulcerative colitis, often begin. While ulcerative colitis only affects the inner lining of the large intestine, Crohn's disease can involve the entire thickness of the intestinal wall, most commonly in the small intestine, but sometimes also the stomach and esophagus. Ongoing inflammation can cause lasting tissue damage and increase the risk of cancer. While traditional treatments aim to suppress the immune system as a whole, newer therapies are more targeted: they interrupt the inflammatory process by blocking specific messenger substances that drive inflammation in the body.\n\nThe exact causes of severe systemic diseases are still not fully understood to this day. In addition to genetic factors, environmental influences are also believed to play an important role in their development. Prof. Ahmed Hegazy has been studying inflammatory processes in the gut and the immune system's defense mechanisms at Charité's Department of Gastroenterology, Infectiology and Rheumatology for several years. Together with his team, he has now succeeded in identifying the interaction between two messenger substances of the immune system as the driving force behind chronic intestinal inflammation: Interleukin-22, a protein that supports the cells lining the inside of the gut and helps maintain the protective barrier, and oncostatin M, a signaling molecule that plays a significant role in tissue repair and cell differentiation.\n\nUncontrolled chain reaction\n\n\"At the clinic, we mainly see young patients who just beginning their professional lives. So far, we have only been able to slow down the progression of the disease and alleviate symptoms. But not all patients respond well to existing treatments, so new therapeutic approaches are urgently needed,\" says Ahmed Hegazy. In previous work, the research team closely examined the effects of oncostatin M, an inflammation-promoting messenger molecule. This protein, produced by certain immune cells, activates other inflammatory factors -- setting off a chain reaction that triggers an excessive immune response. \"It was especially interesting for us to see that patients with high levels of oncostatin M do not respond to several common therapies,\" Ahmed Hegazy explains. \"This means that Oncostatin M levels could help predict treatment failure and may serve as a biomarker for more severe disease. That's exactly where we focused our efforts: we wanted to understand this signaling pathway better and find ways to block it with targeted treatments.\"\n\nThe research team spent five years uncovering how the immune messenger oncostatin M triggers inflammatory responses. They began by using animal models, and later studies tissue samples from patients, to examine the different stages of chronic intestinal diseases, State-of-the-art single-cell sequencing showed that -- compared to healthy tissue -- a much larger number of unexpected cell types in the inflamed gut have binding sites (receptors) for oncostatin M. At the same time, additional immune cells start producing the inflammatory protein. Interestingly, interleukin-22, which normally protects tissue, also makes the gut lining more sensitive to oncostatin M by increasing the number of its receptors. \"These two immune messengers work together and amplify the inflammation, drawing more immune cells into the intestine, like a fire that keeps getting more fuel and spreads,\" as Ahmed Hegazy relates. \"In our models, we specifically blocked the binding sites for oncostatin M and saw a clear reduction in both chronic inflammation and the associated of cancer.\"\n\nTargeted therapy for high-risk patients in sight\n\nThe researchers found a particularly high number of receptors for the messenger molecule oncostatin M around the tumors in tissue samples from patients with colorectal cancer caused by chronic intestinal inflammation -- but not in the surrounding healthy tissue. This observation suggests that this signaling pathway may help promote cancer development. However, chronic inflammation does not always lead to bowel cancer, and not every patient is affected in the same way. \"Chronic inflammatory bowel diseases are highly complex and differ from person to person. That's exactly what makes them so difficult to treat and predict treatment,\" says Prof. Britta Siegmund, Director of the Clinic for Gastroenterology, Infectiology and Rheumatology. \"Thanks to the role of oncostatin M and its amplifying interaction with interleukin-22, which we have now identified, we have a clearer understanding of what drives chronic inflammation in some patients. This opens up the door to developing and testing a new therapeutic approach.\"\n\nThe team's experimental findings may soon translate into a real-world therapy: by specifically disrupting the harmful interaction between the immune messengers interleukin-22 and oncostatin M. \"Our results provide a strong scientific basis for developing targeted treatments against this inflammation-promoting mechanism in chronic inflammatory bowel disease -- particularly in patients with more severe forms of the illness,\" explains Ahmed Hegazy. A clinical trial is already underway to test an antibody that blocks the receptors for Oncostatin M.",
  "summary": "Chronic inflammatory bowel disease is challenging to treat and carries a risk of complications, including the development of bowel cancer. Young people are particularly affected: when genetic predisposition and certain factors coincide, diseases such as ulcerative colitis or Crohn's disease usually manifest between the ages of 15 and 29 -- a critical period for education and early career development. Prompt diagnosis and treatment are crucial. Researchers have now discovered a therapeutic target that significantly contributes to halting the ongoing inflammatory processes.",
  "published": "Mon, 02 Jun 2025 15:58:06 EDT",
  "url": "https://www.sciencedaily.com/releases/2025/06/250602155806.htm",
  "source": "Latest Science News -- ScienceDaily"
}