{
  "title": "Clinical research on psychedelics gets a boost from new study",
  "text": "As psychedelics gain traction as potential treatments for mental health disorders, an international study led by researchers at McGill University, Imperial College London, and the University of Exeter stands to improve the rigour and reliability of clinical research.\n\nUp to now, psychedelic clinical trials have had what has been widely acknowledged as a critical flaw: the failure to properly account for how a person's mindset and surroundings influence the effects of psychedelics such as MDMA and psilocybin. This gap has led to inconsistent study results, making regulatory approval more difficult.\n\nTo address this, the researchers conducted a Delphi consensus study, bringing together 89 experts from 17 countries for a multi-round debate. The result is the Reporting of Setting in Psychedelic Clinical Trials (ReSPCT) guidelines, published in Nature Medicine, a 30-item checklist, representing the first global agreement on which psychosocial factors have the greatest impact on a psychedelic experience.\n\n\"For decades, we've known that psychedelics don't work in isolation. The person's mindset, the therapy room, even the music playing all influence outcomes,\" said co-lead author Chloé Pronovost-Morgan, a researcher at McGill University and Imperial College London. \"Two trials using the same psychedelic drug, at the same dose, can produce completely different results depending on the environment.\"\n\nThis approach challenges the way psychoactive drugs are typically studied, where scientists try to control or eliminate outside variables to isolate a drug's effects. These guidelines recognize that context is crucial and should be studied directly.\n\nWhy guidelines matter\n\nBy offering a standard framework for evaluating and reporting these variables, the guidelines aim to make trial outcomes more consistent and comparable across studies.\n\nLeor Roseman from the University of Exeter is co-senior author and said: \"Having clear guidelines for contextual considerations is essential to understand the effects of psychedelics and how they work differently from other psychiatric medications. Our guidelines will also help in replicating results and understanding the true therapeutic potential of psychedelics.\"\n\nThe lack of standards has had consequences beyond the research lab, Pronovost-Morgan explained. The U.S. Food and Drug Administration recently rejected MDMA-assisted therapy for post-traumatic stress disorder, citing inconsistent reporting across trials as a key reason for the decision.\n\n\"There is immense public interest in psychedelic therapies, particularly for individuals suffering from debilitating mental health conditions like PTSD, depression and anxiety, which have not responded to existing treatments,\" said co-senior author Kyle Greenway, Assistant Professor in McGill's Division of Social and Transcultural Psychiatry and a researcher at the Lady Davis Institute for Medical Research.\n\n\"Our guidelines offer a new gold standard for psychedelic research, helping bring these treatments to those who need them most.\"\n\nThe research team is organizing a three-day workshop in October, funded by McGill's Healthy Brains, Healthy Lives initiative, where leading experts in psychedelics and neuroscience will discuss how the guidelines can be integrated into research and clinical practice.",
  "summary": "As psychedelics gain traction as potential treatments for mental health disorders, an international study stands to improve the rigor and reliability of clinical research.",
  "published": "Tue, 03 Jun 2025 11:48:16 EDT",
  "url": "https://www.sciencedaily.com/releases/2025/06/250603114816.htm",
  "source": "Latest Science News -- ScienceDaily"
}