{
  "title": "Eagles' Brown scoffs at question on level of play",
  "text": "Stephen A. Smith reacts to reports that some Eagles players have grown frustrated with Jalen Hurts' approach this season. (1:08)\n\nStephen A.: It's not the media talking about Jalen Hurts, it's the Eagles' locker room (1:08)\n\nOpen Extended Reactions\n\nPHILADELPHIA -- Eagles receiver A.J. Brown offered a quick retort when asked about speculation he isn't the same player he once was.\n\n\"I guess Saquon [Barkley] ain't the same player either, then,\" Brown said at his locker Thursday.\n\nIt's been slow going for the star-laden Eagles offense. Philadelphia ranks 25th in total yards (300.1 per game), 28th in passing yards (184.9) and 29th in third-down conversion rate (33.87%). The Eagles are averaging 115 rushing yards per game (17th in NFL), compared with 179 in 2024 (second).\n\nPhiladelphia does have the best red zone offense (75% conversion rate) in the NFL as well as a league-low four giveaways. That, paired with a defense that has played lights-out as of late, has been enough to keep Philly atop the NFC at 8-2.\n\nThere has been a drop-off in individual production, though, including for Brown, who has 38 catches for 457 yards and three touchdowns in nine games. He is on pace for 812 yards, which would be a career low.\n\nBrown was asked if he pays attention to what other receivers around the league such as CeeDee Lamb are doing, and he smiled and said no because \"it gets me upset.\"\n\n\"There's a time and place for it, but right now, I'm just trying to stay focused,\" he said.\n\nBarkley, to Brown's point, is not having a superb statistical year either by his standards. He is on pace for 1,125 yards after rushing for 2,005 yards last season.\n\nBrown has shown his frustration at various points this season both through social media platforms and at times during his interviews with reporters. The messaging has consistently been that he wants to contribute in the name of team success.\n\nReports have surfaced of late about some frustration from coaches and players directed toward quarterback Jalen Hurts. Brown deflected a question about that Thursday, saying, \"Ask me about Dallas. Thank you.\"\n\nBrown said he believes the offense is close to clicking and that it's about cleaning up mistakes and finishing drives.\n\nWhen a reporter noted the Eagles will be facing a desperate Cowboys team, as Dallas comes in with a 4-5-1 record, he responded, \"We're desperate, too. We're trying to get it going.\"",
  "summary": "Eagles receiver A.J. Brown offered a quick retort when asked about speculation he isn't the same player he once was.",
  "published": "Thu, 20 Nov 2025 23:07:46 EST",
  "url": "https://www.espn.com/nfl/story/_/id/47040584/eagles-aj-brown-scoffs-question-same-player-was",
  "source": "www.espn.com - TOP"
}