{
  "title": "Those killed when blast ripped through Nowgam police station: Cops, lab assistant, naib tehsildar, photographer, tailor",
  "text": "Mohammad Amin Mir last spoke to his younger brother on the phone Friday night. “I am busy,” he said. “I will finish work soon and return home.”\n\nMir, a head constable at the Forensic Science Laboratory (FSL) posted at the District Police Lines, Srinagar, was part of the team that went to the Nowgam police station to collect samples from the explosive-making materials that went off late Friday night.\n\nBarely 35 minutes after the brief phone conversation, a powerful blast ripped through the police station, killing nine people, including 45-year-old Mir. A resident of Housing Colony in Bemina, he is survived by his wife and two children. The others who died in the blast include:\n\nA backhoe loader being brought to clear the debris after an accidental explosion ripped through Nowgam police station on late Friday night, in Srinagar, Saturday, Nov. 15, 2025. (PTI Photo) A backhoe loader being brought to clear the debris after an accidental explosion ripped through Nowgam police station on late Friday night, in Srinagar, Saturday, Nov. 15, 2025. (PTI Photo)\n\nPeerzada Asrar-ul-Haq\n\nHaq, an inspector with the Special Investigation Agency (SIA), was accompanying the forensic team. The 38-year-old was recruited in 2010 as a sub-inspector. When the SIA was formed in 2021, Haq was shifted to the agency. A resident of Shahwali village in Kupwara, Haq wanted to be a civil service officer. His colleagues said he had missed the Jammu and Kashmir Administrative Service twice by a slim margin. He is survived by his parents, wife and three children.\n\nMuzaffar Ahmad Khan\n\nKhan worked as a Naib Tehsildar for Nowgam. On Friday, he was part of the magisterial team under whose watch the forensic team was collecting the explosive samples. A resident of Soibugh village in Budgam, he is survived by his parents, wife and two children – a six-year-old son and a nine-month-old daughter.\n\nSecurity personnel pay tribute to the victims who were killed in an accidental explosion which ripped through Nowgam police station late Friday night, in Srinagar, Saturday, Nov. 15, 2025. (PTI Photo) Security personnel pay tribute to the victims who were killed in an accidental explosion which ripped through Nowgam police station late Friday night, in Srinagar, Saturday, Nov. 15, 2025. (PTI Photo)\n\nJavid Mansoor Rather\n\nA resident of Hariparigam village of south Kashmir’s Tral, Rather was a photographer with the J&K Police’s Crime Branch. The 42-year-old, who was appointed as a cameraman in 2017, was recording the process on Friday night. While his father is a retired policeman, his brother works as a contractor. He is survived by his wife and three-year-old daughter. “The news spread before dawn, there was chaos in the village,” said Khalid Amin, the village head. “He was a noble soul.”\n\nArshad Ahmad Shah\n\nA resident of Chancer village of Kulgam in south Kashmir, Shah was the son of a retired police officer. He too worked as a photographer in the Crime Branch and was documenting the sample collection process on Friday. He is survived by his parents, wife, a seven-year-old son and an infant daughter. “I don’t have the words to describe it, only tears,” said Shah’s uncle. “He was the flower of our family, our hope. We came to know about the explosion at midnight and we came to know about his death early morning. We want the government to investigate how it happened.”\n\nStory continues below this ad\n\nSrinagar, Nov 15 (ANI): Funeral prayer for Mohammad Shafi Parry, the tailor from Nowgam killed, in a blast in Nowgam Police Station premises, in Srinagar on Saturday. (ANI Photo) Srinagar, Nov 15 (ANI): Funeral prayer for Mohammad Shafi Parry, the tailor from Nowgam killed, in a blast in Nowgam Police Station premises, in Srinagar on Saturday. (ANI Photo)\n\nMohammad Shafi Parray\n\nFor many decades, Showkat Ahmad Parray ran a tailor shop at Nowgam. On Friday, he was at his home at Shankerpora near Nowgam when police took him along to stitch bags to store the seized material. Parray was killed in the explosion. The 52-year-old is survived by his wife, two sons aged 22 and 27, and a daughter aged 24.\n\nSuhail Ahmad Rather\n\nRather worked as a chowkidar in the revenue department. A resident of Natipora, less than two kilometres from Nowgam, he was at the police station as an independent witness when the explosion occurred. He also ran a Common Services Centre (CSC) in his neighbourhood. He is survived by his parents.\n\nAjaz Ahmad Mir\n\nMir worked as a Senior Grade Constable at the FSL and was posted in the District Police Lines in Srinagar. He is a resident of Ghazaliabad, Zainakote.\n\nShowkat Ahmad\n\nAhmad worked as a lab assistant at the FSL’s head office in Srinagar. He is a resident of S K Colony in Qamarwari, Srinagar. He was the technical person collecting samples of explosives for the FSL.",
  "summary": "",
  "published": "Sat, 15 Nov 2025 16:12:40 +0000",
  "url": "https://indianexpress.com/article/india/those-killed-blast-nowgam-police-station-cops-lab-assistant-naib-10368106/",
  "source": "India | The Indian Express"
}