{
  "title": "Lakers fire Buss brothers from scouting roles",
  "text": "Shams Charania joins \"NBA Today\" to detail the Lakers' front office shakeup, including the firing of executives Joey and Jesse Buss. (1:11)\n\nOpen Extended Reactions\n\nThe Los Angeles Lakers are reorganizing their basketball operations department and have fired executives Joey and Jesse Buss from their respective front office positions, effective immediately, the brothers told ESPN's Shams Charania on Thursday.\n\nThe Lakers also dismissed much of their scouting department beyond the Buss brothers, including Sean Buss, Aaron Jackson, Moses Zapata and Can Pelister, sources told ESPN's Dave McMenamin. Sean Buss shares the same mother as Joey and Jesse.\n\nWhen reached for comment, a Lakers spokesperson confirmed the team had moved on from Joey and Jesse Buss and had no further statement beyond that.\n\nJoey and Jesse Buss have had key Lakers scouting roles for the past decade, helping find players such as Austin Reaves, Alex Caruso, Kyle Kuzma, Jordan Clarkson, Larry Nance Jr. and Max Christie.\n\nJoey Buss' specific role was alternate governor and vice president of research and development; Jesse Buss was the Lakers' assistant general manager.\n\n\"We are extremely honored to have been part of this organization for the last 20 seasons,\" Joey and Jesse Buss told ESPN in a statement. \"Thank you to Laker Nation for embracing our family every step of the way. We wish things could be different with the way our time ended with the team. At times like this, we wish we could ask our Dad what he would think about it all.\"\n\nTheir older sister, Jeanie Buss, will continue to serve as the Lakers' primary team governor for the foreseeable future.\n\n\"Dr. Buss' idea was for Joey and I to run basketball operations one day,\" Jesse Buss told ESPN, referring to their father, Jerry Buss. \"But Jeanie has effectively kept herself in place with her siblings fired.\"\n\nJoey, 41, and Jesse, 37, are younger siblings of Jeanie (64). She also had a public falling-out with her older brothers, Johnny (69) and Jim (66), in 2017 after she removed Jim as president of the Lakers' basketball operations and replaced him with Magic Johnson.\n\nA week after that removal, Johnny and Jim called for an emergency meeting of the Lakers' shareholders to elect a new board of directors, prompting Jeanie's lawyers to file a temporary restraining order against the elder brothers in Los Angeles Superior Court.\n\nJoey and Jesse Buss will maintain their minority ownership shares of the Lakers. They announced in September that they are launching Buss Sports Capital, an investment firm aimed at identifying acquisitions and partnerships across the global sports landscape.\n\nThe two brothers have honed their careers with the Lakers, focusing on talent acquisition and development, with Joey serving as the team president and CEO of the South Bay Lakers -- the Lakers' G League affiliate -- and Jesse involved in the draft process year-round as the Lakers' director of scouting.\n\nJerry Buss, who died in 2013, purchased the Lakers from Jack Kent Cooke in 1979 in a $67.5 million transaction that also included the Los Angeles Kings and the Forum. The Buss family sold majority ownership of the Lakers to Mark Walter in June.\n\nThat sale, at a $10 billion valuation, was approved by the NBA board of governors last month.",
  "summary": "The Lakers are reorganizing their basketball operations department and have terminated brothers Joey and Jesse Buss from their respective front office positions.",
  "published": "Thu, 20 Nov 2025 23:07:46 EST",
  "url": "https://www.espn.com/nba/story/_/id/47038460/lakers-fire-joey-buss-jesse-buss-front-office-positions",
  "source": "www.espn.com - TOP"
}