{
  "title": "Science finally solves a 700-year-old royal murder",
  "text": "An international team led by Hungarian scholars has successfully confirmed that skeletal remains discovered in Budapest belong to Duke Béla, the Ban of Macsó, who descended from both the Árpád and Rurik dynasties. This finding resolves a long-standing archaeological mystery that has lingered for more than a century.\n\nThe project was organized by Tamás Hajdu (Department of Anthropology, Faculty of Sciences, Eötvös Loránd University (ELTE TTK)), with genetic analyses conducted by Anna Szécsényi-Nagy and Noémi Borbély of the Institute of Archaeogenomics, ELTE RCH. Their work demonstrates how historical accounts can be validated and violent deaths reconstructed in remarkable detail when the humanities and natural sciences collaborate. The study has been published in Forensic Science International: Genetics.\n\nEarly Discoveries on Margaret Island\n\nThe story began in 1915, when archaeologists excavating the Dominican monastery on Margaret Island (Budapest) uncovered the bones of a young man in the sacristy. Based on the burial context, period sources, and the evidence of trauma on the skeleton, researchers at the time suggested that the remains belonged to Béla Duke of Macsó, a member of the House of Árpád. Béla of Macsó (born after 1243 -- died: November 1272) was the grandson of King Béla IV on his mother's side, while his father's lineage traced back to the Rurik dynasty of northern, Scandinavian origin, which produced numerous Grand Dukes of Kiev from the 9th century onward. According to 13th-century Austrian chronicles, Duke Béla was assassinated in November 1272 by Ban Henrik \"Kőszegi\" of the Héder family and his associates. Contemporary stories describe how his mutilated body was collected by Margit (his sister) and Erzsébet (his niece) and buried at the Dominican monastery.\n\nLost Bones and a 20th-Century Disappearance\n\nAfter the excavation, the remains were sent to Lajos Bartucz at the Institute of Anthropology of the Budapest University (now: Department of Anthropology, ELTE TTK) for bioanthropological study. Bartucz documented 23 sword cuts across the skeleton, along with multiple fatal skull injuries. He concluded that the duke had been attacked by several individuals simultaneously and had even been struck while lying on the ground. Bartucz mentioned the bones publicly in 1936 and published a photograph of the skull in 1938. After that, all references to the remains disappeared, and many experts believed they had been lost during the Second World War. Unexpectedly, in 2018 the postcranial bones were rediscovered in a wooden box stored among tens of thousands of specimens in the Anthropology Collection of the Hungarian Museum of Natural History, while the skull continued to be curated in the Aurél Török Collection at ELTE.\n\nReopening the Case With Modern Science\n\nIn 2018, a new international research consortium was formed under the leadership of Tamás Hajdu (Department of Biological Anthropology, ELTE TTK). The group included anthropologists, geneticists, an archaeologist, an archaeobotanist, stable isotope specialists, radiocarbon experts, and dentists. Their objective was to verify the identity of the remains using modern forensic and bioarchaeological methods and to reconstruct as fully as possible the life and death of the duke.\n\nThe find holds exceptional historical value. Besides King Béla III, Béla of Macsó is the only confirmed member of the House of Árpád whose nearly complete skeleton is still preserved. This provides rare insight into both the genetic heritage of the Árpád dynasty and the Rurik line. Researchers from Vienna, Bologna, Helsinki, Harvard University, and multiple Hungarian institutions participated in the project.\n\nBiological Profile and Diet Insights\n\nAnthropological analysis showed that the man buried beneath the monastery floor on Margaret Island was in his early twenties. Radiocarbon dating was performed by two laboratories to ensure accuracy after early 14C measurements suggested a date slightly earlier than expected (second half of the 13th century). Additional tests by the Nuclear Research Institute (Debrecen) revealed that the unexpectedly early date was caused by dietary habits. The individual had consumed high amounts of animal protein, including fish and possibly shellfish that fed on ancient carbon sources, creating a known \"reservoir\" effect in the bones.\n\nThe team also examined dental calculus to further reconstruct his diet. More than a thousand microfossils were recovered from the tartar. Starch grains from wheat and barley, along with clear signs of milling, cooking, and baking, indicated that his meals included cooked wheat semolina and baked wheat bread.\n\nStrontium isotope analysis, which helps determine where a person lived during different stages of life, showed that the individual did not grow up in the same place where he was buried. His early childhood isotope signatures match those found in the region of Vukovar and Syrmia (now part of Croatia and Serbia; earlier this region was a part of the Macso Banat of the Medieval Kingdom of Hungary), as well as other parts of the Carpathian Basin. Later in childhood he moved to a different area, possibly near modern Budapest.\n\nGenetic Evidence Links the Skeleton to Royal Lineages\n\nThe final confirmation of identity was carried out at the Institute of Archaeogenomics of ELTE RCH by Anna Szécsényi-Nagy and Noémi Borbély. Multiple lines of genetic evidence supported the genealogical connections described in historical documents. The results show that Béla of Macsó was the great-grandson (fourth-degree descendant) of King Béla III, and his genetic distance to Saint Ladislaus fits this expected lineage pattern.\n\nGenome-wide analysis revealed that the duke had a strong Scandinavian genetic component (almost half), significant Eastern Mediterranean ancestry, and a smaller early medieval Central European component. The Scandinavian contribution supports his descent from the Rurik dynasty, while the Eastern Mediterranean component may correspond to his maternal grandmother, Maria Laskarina, a member of the Byzantine imperial family and wife of Béla IV. Y-chromosome results also confirm the historically documented Rurik paternal line. A 2023 Russian archaeogenomic study showed that a 13th-century Rurikid (Dmitry Alexandrovich) belonged to the same paternal lineage, which can be traced back to Yaroslav I (Yaroslav Vladimirovich, also known as Yaroslav the Wise). Genetic data from present-day Rurikid descendants further reinforces this connection.\n\nReconstructing a Coordinated and Brutal Assassination\n\nTo understand how Béla died and to compare the evidence with medieval accounts, the team conducted a detailed forensic anthropological investigation. The analysis documented 26 perimortem injuries, including nine to the skull and 17 to the rest of the body, all inflicted during a single violent attack. The pattern of wounds suggests that three assailants took part: one confronted him from the front while the others struck from the left and right.\n\nThe wounds show that Béla recognized the attack and tried to defend himself. Two types of weapons were likely used, probably a sabre and a longsword. The depth and clarity of the cuts indicate that he wore no armor when he was killed. The reconstructed sequence of violence begins with strikes to the head and upper body, followed by severe defensive injuries as he attempted to block further blows. He was ultimately incapacitated by strikes from the side, and once he fell to the ground, the attackers delivered fatal blows to his head and face. The number and intensity of these injuries point to strong emotional motivation (e.g. sudden anger, hatred), while the coordinated nature of the attack suggests planning. Although Duke Béla's assassination in November 1272 appears to have been partly or wholly premeditated, the manner of the killing indicates that it was not carried out calmly.\n\nResearchers and institutions participating in the research project:",
  "summary": "Genetic, isotopic, and forensic evidence has conclusively identified the remains of Duke Béla of Macsó and uncovered remarkable details about his life, ancestry, and violent death. The study reveals a young nobleman with Scandinavian-Rurik roots who was killed in a coordinated, emotionally charged attack in 1272.",
  "published": "Fri, 14 Nov 2025 10:05:03 EST",
  "url": "https://www.sciencedaily.com/releases/2025/11/251114041217.htm",
  "source": "All Top News -- ScienceDaily"
}