{
  "title": "Trump administration seeks to roll back protections for imperiled species and habitat",
  "text": "Trump administration seeks to roll back protections for imperiled species and habitat\n\ntoggle caption Erin Hooley/AP\n\nBILLINGS, Mont. — President Trump's administration moved Wednesday to roll back protections for imperiled species and the places they live, reviving a suite of changes to Endangered Species Act regulations from the Republican's first term that were blocked under former Democratic President Joe Biden.\n\nThe proposed changes include the elimination of the U.S. Fish and Wildlife Service's \"blanket rule\" that automatically protects animals and plants when they are classified as threatened. Government agencies instead would have to craft species-specific rules for protections, a potentially lengthy process.\n\nSponsor Message\n\nThe administration's announcement answers longstanding calls for revisions to the Endangered Species Act from Republicans in Congress and industries including oil and gas, mining and agriculture. Critics argue the landmark 1973 environmental law has been wielded too broadly, to the detriment of economic growth.\n\nBut environmentalists warned the changes could cause yearslong delays in efforts to save species such as the monarch butterfly, Florida manatee, California spotted owl and North American wolverine.\n\n\"We would have to wait until these poor animals are almost extinct before we can start protecting them. That's absurd and heartbreaking,\" said Stephanie Kurose with the Center for Biological Diversity.\n\nScientists and government agencies say extinctions are accelerating globally because of habitat loss and other pressures.\n\nTrump has made oil and gas production a centerpiece of his presidency and sought to strip away environmental regulations that impede development. Other pending proposals from the administration would revise the definition of \"harm\" under the Endangered Species Act and potentially bypass species protections for logging projects in national forests and on public lands.\n\nInterior Secretary Doug Burgum said in a statement that the administration was restoring the Endangered Species Act to its original intent while respecting \"the livelihoods of Americans who depend on our land and resources.\"\n\nSponsor Message\n\n\"These revisions end years of legal confusion and regulatory overreach, delivering certainty to states, tribes, landowners and businesses while ensuring conservation efforts remain grounded in sound science and common sense,\" Burgum said in a statement.\n\nAnother proposed change tasks officials with analyzing economic impacts when deciding whether habitat is critical to a species' survival.\n\nCase of lizard shows potential outcome of proposals\n\nThe case of the Yarrow's spiny lizard in the Southwest exemplifies the potential consequences of the proposals. Rapidly warming temperatures have ravaged a population of the lizard in Arizona's Mule Mountains, pushing the reptiles further up the mountainsides toward the highest peaks and possibly toward extinction.\n\nA petition filed Wednesday seeks protections for the lizard and the designation of critical habitat. Advocates say analyzing the economic impacts could delay protections. Designating critical habitat could be another hurdle because the primary threat to this population of spiny lizard is climate change.\n\n\"We think that the species should be listed as endangered. In fact, we are somewhat shocked that it is not already extinct,\" said John Wiens, a professor of ecology and evolutionary biology at the University of Arizona, who co-authored the petition.\n\nThe Interior Department was sued over the blanket protection rule in March, by the Property and Environment Research Center (PERC) and Rocky Mountain Elk Foundation. The two groups argued the rule was illegal and discouraged states and landowners from assisting in species recovery efforts.\n\ntoggle caption Rebecca Blackwell/AP\n\nSpecies designated as \"threatened\" under the rule automatically qualify for the same protections as those with the more severe designation of \"endangered.\"\n\nPERC Vice President Jonathan Wood said Wednesday's proposal was a \"necessary course correction.\"\n\n\"This reform acknowledges the blanket rule's unlawfulness and puts recovery back at the heart of the Endangered Species Act,\" Wood said.\n\nProposals would undermine protections, critic says\n\nKristen Boyles with the environmental law firm Earthjustice said the changes undermine protections even more than in Trump's first term. That includes allowing the Fish and Wildlife Service and National Marine Fisheries Service to not count negative effects on species if those impacts are not regulated by the agencies themselves, Boyles said.\n\n\"The Services are required to prevent harmful consequences to species, not ignore them,\" she said.\n\nTrump officials during his first term also rolled back protections for individual species including the northern spotted owl and gray wolf.\n\nThe spotted owl decision was reversed in 2021 after officials said Trump's political appointees used faulty science to justify opening millions of acres of West Coast forest to potential logging. Protections for wolves across most of the U.S. were restored by a federal court in 2022.\n\nSponsor Message\n\nThe Endangered Species Act protects more than 1,600 species in the United States and its territories. It is credited with helping save the bald eagle, California condor and scores more animals and plants from extinction since Republican President Richard Nixon signed it into law.",
  "summary": "The Interior Department proposed reviving a suite of changes to Endangered Species Act regulations first made during the Republican's first term. Those changes were reversed under former President Biden.",
  "published": "Wed, 19 Nov 2025 18:46:37 -0500",
  "url": "https://www.npr.org/2025/11/19/g-s1-98459/trump-administration-endangered-species-act-blanket-rule",
  "source": "NPR Topics: Business"
}