{
  "title": "Gautam Gambhir under fire: 'Were we wasting time with Karun Nair or Sai Sudharsan?'",
  "text": "Kolkata: India's Sai Sudharsan with head coach Gautam Gambhir (PTI Photo/Swapan Mahapatra)\n\nWhy coach Gautam Gambhir can't continue with his IPL ways in Test cricket\n\nIndia’s evolving approach to their batting order has once again raised eyebrows, with head coach Gautam Gambhir and the team management making another unexpected shuffle during the first Test against South Africa at Eden Gardens. In a move that surprised many, India fielded four frontline spinners and sent Washington Sundar in at number 3, a slot previously occupied by Sai Sudharsan in the West Indies series earlier this year. Before that, both Sudharsan and Karun Nair had been used at the same position during the tour of England.Former India batter Aakash Chopra voiced his concerns over the continuous reshuffling and questioned whether the team was lacking clarity in its long-term plans.“Washington Sundar has presented himself as a phenomenal option who can bat at the top of the order, and of course is a more than handy bowler. The bigger question that Gautam and the team management need to answer is are we going to keep changing goalposts after every series?” Chopra said during a JioStar media day interaction.Sudharsan, who made scores of 7, 87 and 39 against the West Indies, found himself out of the XI for the opening Test against South Africa. Sundar replaced him at number 3 and made 29 and 31 in the match.“You’re well within your rights to go with Washington, but if Washi is your long term choice, then were we just wasting time with Sai Sudharsan or even Karun Nair to bat at 3?” Chopra asked.He stressed that India’s top order must prioritise pure batting attributes above all else.“You would first want to prioritise the batting capabilities, not only the skill but also the temperament and the patience and the ability to bat time. That is why you look for the purest specialists who have only one job to do. Your top 4 or 5 are there just to bat and nothing else.”Chopra added that if Sundar is indeed being groomed primarily as a batter, the last several months of experimentation may have served little purpose.“If you choose Washington Sundar as a batter, fair enough, but it just feels like the last six or seven months were futile and you didn't really gain anything from it,” he said.He also questioned the messaging to Sudharsan, who performed reasonably well but still lost his place.“What message do you give to Sai Sudharsan that we gave you a chance, you scored the runs, but we had a change of heart. Transition gives you the chance to experiment, but what makes it easier is clarity and consistency,” Chopra concluded.",
  "summary": "India's frequent batting order changes, particularly at number 3, have drawn criticism. Former batter Aakash Chopra questions the team's long-term vision, citing Washington Sundar's promotion over Sai Sudharsan and Karun Nair. Chopra emphasizes prioritizing pure batting skills for the top order, suggesting recent experiments have been futile without clear strategy and consistency.",
  "published": "Fri, 21 Nov 2025 08:39:44 +0530",
  "url": "https://timesofindia.indiatimes.com/sports/cricket/india-vs-south-africa/gautam-gambhir-under-fire-were-we-wasting-time-with-karun-nair-or-sai-sudharsan-ex-india-cricketer-questions/articleshow/125475956.cms",
  "source": "Times of India"
}