{
  "title": "Trump Has Midnight Meltdown Over 'No Talent' TV Host: 'Get The Bum Off The Air!!!'",
  "text": "LOADING ERROR LOADING\n\nPresident Donald Trump was apparently up late on Wednesday ― and he didn’t like what he saw on television as he fired off a middle-of-the-night message aimed at TV host and longtime nemesis Jimmy Kimmel.\n\n“Why does ABC Fake News keep Jimmy Kimmel, a man with NO TALENT and VERY POOR TELEVISION RATINGS, on the air?” Trump wrote on Truth Social at 12:49 a.m. Thursday morning. “Why do the TV Syndicates put up with it? Also, totally biased coverage. Get the bum off the air!!!”\n\nAdvertisement\n\nTrump’s message came after Kimmel devoted 10 minutes of his Wednesday night monologue on “Jimmy Kimmel Live!” to hitting at many of the president’s sore spots at once: his wealth, his family, loyalty, and his connections to late convicted sex offender Jeffrey Epstein, who was once a close friend.\n\nTrump, who promised during the 2024 campaign to release the Epstein files, instead spent most of the year trying to block them. When it became clear that Congress was going to pass a bill calling for the release anyway, he claimed he supported it ― even though he could have released the files on his own, at any time, without Congress.\n\nTrump was a guest on \"Jimmy Kimmel Live\" three times before their current feud, including in December 2015. Randy Holmes via Getty Images\n\nAdvertisement\n\nThe bill passed in a landslide and headed for Trump’s desk.\n\n“Now, usually when Trump gets a bill, he declares bankruptcy and doesn’t pay it,” Kimmel cracked.\n\nThis one, Trump signed.\n\n“Trump hasn’t been this nervous about signing something since Don Jr.’s birth certificate,” Kimmel said.\n\nKimmel also pointed out that many of Trump’s biggest allies defied him on this one.\n\n“But this has also been a blow to Trump because some of his most loyal foot-lickers betrayed him,” Kimmel said.\n\nThe monologue also ended with an animated penny, bitter about production of the coin ending, saying “fuck Donald Trump.”\n\nAdvertisement\n\nIt’s not clear how much of that, if anything, Trump caught. But something about Kimmel triggered him enough that he had to write about it to the world at nearly 1 a.m.\n\nIt’s the second time in a week Trump has gone after a late night TV host, as he also attacked “Late Night” host Seth Meyers over the weekend.\n\n“Meyers has no talent, and NBC should fire him, IMMEDIATELY!” Trump raged on Truth Social.\n\nTrump has a long history of going after late night hosts for making fun of him, with Kimmel as one of his most frequent targets. He reportedly tried to have Kimmel censored during his first term, attacked him often by name during the 2024 campaign, and in September celebrated when Kimmel was briefly suspended by ABC for comments he made about the alleged killer of conservative activist Charlie Kirk.\n\nAdvertisement\n\nHe was livid when Kimmel returned to TV less than a week later and threatened legal action against ABC.\n\nTrump’s recent attack on Kimmel was one of three messages the president posted after midnight.\n\nHe also bragged that he had one of the 10 best opening months for a president in history “according to most,” and in another post praised soccer star Cristiano Ronaldo, who visited him in the White House earlier in the day, as “smart” and “cool.”",
  "summary": "The president railed against Jimmy Kimmel in a middle-of-the-night post on social media.",
  "published": "Thu, 20 Nov 2025 02:56:50 -0500",
  "url": "https://www.huffpost.com/entry/donald-trump-jimmy-kimmel-attack_n_691eb3f8e4b0d33fcd9886ec",
  "source": "Politics"
}