{
  "title": "Man Utd, Liverpool & Newcastle eye Anderson - Friday's gossip",
  "text": "Manchester United in transfer battle with Liverpool and Newcastle for Elliot Anderson, Arsenal explore deal for Scott McTominay, while Crystal Palace reignite interest in Ousmane Diomande\n\nManchester United are eyeing Elliot Anderson, 23, as a possible replacement for Brazil international Casemiro, 33, but face competition from Liverpool and Newcastle for the £100m-rated England and Nottingham Forest midfielder. (Times - subscription required, external)\n\nArsenal are exploring a shock move for Napoli and Scotland midfielder Scott McTominay, 28, with Tottenham, Everton and Manchester United also interested. (Teamtalk), external\n\nCrystal Palace are set to reignite their interest in Sporting defender Ousmane Diomande in January, having shortlisted the Ivory Coast international last summer as a replacement for Marc Guehi, when the England defender, 25, was expected to join Liverpool. (A Bola - in Portuguese, external)\n\nLiverpool, Tottenham, Manchester United, Manchester City and Arsenal all retain an interest in Bournemouth and Ghana winger Antoine Semenyo, 25. (Talksport), external\n\nSunderland have not ruled out a January move for Lazio and France midfielder Matteo Guendouzi, 26, who could be available for £22m to £26m (Northern Echo), external\n\nArsenal are close to agreeing a new long-term deal with Bukayo Saka, with the 24-year-old England winger's current contract set to expire in 2027. (Sky Sports, external)\n\nTottenham's search for a prolific goalscorer has focused on Porto and Spain forward Samu Aghehowa, 21. (Teamtalk), external\n\nHowever, Chelsea and Manchester United could provide competition for former Atletico Madrid forward Samu. (Caught Offside) , external\n\nCrystal Palace defender Chadi Riad could eye a loan move in the January window as the 22-year-old Morocco international tries to rebuild match fitness after two major injuries. (Sky Sports, external)\n\nWolves have identified Manchester City's 23-year-old English goalkeeper James Trafford as a prime January target. (Teamtalk), external\n\nBut Manchester City could offer Trafford to Newcastle in a player-plus-cash deal to secure the services of 23-year-old England full-back Tino Livramento. (Teamtalk, external)\n\nEnglish attacking midfielder Harvey Elliott, who is currently on loan at Aston Villa, is the subject of interest from Bundesliga and Serie A clubs, with parent club Liverpool willing to sell the 22-year-old at a reduced price. (Football Insider, external)\n\nInter Milan are interested in signing Argentina goalkeeper Emiliano Martinez, with Aston Villa ready to listen to offers for the 33-year-old. (Football Insider, external)\n\nCrystal Palace have held talks with striker Jean-Philippe Mateta over a new deal as the club are aware of growing transfer interest in the 28-year-old France striker. (Sky Sports, external)\n\nLiverpool are fighting to keep England youth winger Joshua Abe, with Arsenal and Chelsea both pursuing the 15-year-old. (Mail - subscription required), external",
  "summary": "Manchester United in race with Liverpool and Newcastle for Elliot Anderson, Arsenal explore deal for Scott McTominay, Crystal Palace reignite interest in Ousmane Diomande, plus more.",
  "published": "Thu, 20 Nov 2025 22:01:52 GMT",
  "url": "https://www.bbc.com/sport/football/articles/c0mxmjln73no?at_medium=RSS&at_campaign=rss",
  "source": "BBC Sport"
}