{
  "title": "BMA rejects fresh offer to end doctor strikes",
  "text": "BMA rejects fresh offer to end doctor strikes\n\n5 November 2025 Share Save Nick Triggle Health correspondent Share Save\n\nPress Association\n\nThe British Medical Association has rejected a fresh offer from the government to end the long-running dispute with resident doctors in England. Health Secretary Wes Streeting had proposed covering the cost of exam fees and expanding training places more quickly than planned and wrote to the union on Wednesday giving it until the end of Thursday to accept the package. But the BMA said the offer did not go far enough - and the government needed to increase pay. It comes ahead of a five-day strike by resident doctors, the name now for junior doctors, which gets under way on 14 November. It will be the 13th walkout since March 2023.\n\nThe fresh offer made by Streeting in the letter to the BMA on Wednesday afternoon followed a meeting with the union's leaders on Tuesday. There were a range of measures, including covering the cost of mandatory exams, which can run to thousands of pounds over the course of doctor training, and membership fees to royal colleges. The health secretary had also promised to expand the number of training places more quickly than initially planned. But the BMA told the BBC on Wednesday night that it had rejected the offer. The 10-year NHS plan published in early summer pledged an extra 1,000 training places by 2028, but this will now be increased to 2,000 with the 1,000 boost happening next year. These are speciality training places that doctors move into after the first two years of training. This year there were more than 30,000 applicants for 10,000 jobs at this stage, although some will have been doctors from abroad.\n\nSignificant disruption",
  "summary": "An offer was made to avert the resident doctors' strike but the union said it did not go far enough.",
  "published": "Wed, 05 Nov 2025 19:21:00 GMT",
  "url": "https://www.bbc.com/news/articles/cdrze1rzejlo?at_medium=RSS&at_campaign=rss",
  "source": "BBC News"
}