{
  "title": "The cabinet of CM Nitish, round 10: Much old, some new, and a fine balancing act",
  "text": "Nitish Kumar was sworn in as Bihar chief minister for a record tenth time, alongside 26 ministers in a cabinet where the maximum strength can be 36. The grand swearing-in took place at Patna’s historic Gandhi Maidan in the presence of Prime Minister Narendra Modi, Union Home Minister Amit Shah, BJP national president J P Nadda and chief ministers of 11 NDA-ruled states, including Uttar Pradesh’s Yogi Adityanath and Andhra Pradesh’s N Chandrababu Naidu.\n\nModi capped the swearing-in by bowing to the audience thrice and waving his gamchha. The victory, with NDA’s 202 seats, marks Nitish’s second-best show – after the 206 seats during the 2010 polls.\n\nAdvertisement\n\nSenior BJP leaders Samrat Choudhary and Vijay Kumar Sinha retained their position as deputy CMs. The JD(U) retained its veterans Bijendra Prasad Yadav, Vijay Kumar Choudhary and Shravan Kumar in the cabinet, as did the BJP – Mangal Pandey, Pramod Kumar and Nitin Nabin. BJP state president Dilip Jaiswal also returned as a minister.\n\nThe new cabinet has three women ministers – JD(U)’s Dhamdaha MLA Lesi Singh, and BJP’s Aurai MLA Rama Nishad and Jamui MLA Shreyasi Singh. While Lesi Singh was already a minister, picking Rama Nishad, the daughter-in-law of the late Captain Jaynarayan Nishad, a former union minister, is in line with the BJP’s outreach to the EBC Mallah community. Shreyasi Singh, an acclaimed shooter and the daughter of the late Union minister Digvijay Singh, is a second-time MLA from Jamui.\n\nAnother highlight of the new cabinet is RLM chief Upendra Kushwaha picking his son Deepak Prakash as a minister from his party. Deepak is not a legislator and could be given an MLC position within six months. Kushwaha’s wife, Snehlata, is among the four RLM legislators who won the election.\n\nAdvertisement\n\nHAM (S) again went with Santosh Kumar Suman – son of Union minister Jitan Ram Manjhi – as minister. LJP(R), which got two cabinet berths, went with Sanjay Kumar Singh and Sanjay Kumar. Singh wrested the traditional Mahua seat from Vaishali from the RJD by defeating its nominee Mukesh Kumar Roshan. RJD chief Lalu Prasad’s son Tej Pratap Yadav came in third in the seat.\n\nAnother highlight was the return of veteran BJP leader Ram Kripal Yadav to political relevance. Though he had served as Union minister, he had been lying low since the 2014 Lok Sabha defeat to Misa Bharati from Pataliputra. In the recent Assembly polls, he defeated RJD strongman Ritlal Yadav from Danapur.\n\nNitish Kumar’s cabinet also indicated the push for social balance. Of the 27-member cabinet, including the CM, eight are from the upper caste, five are Dalits, and 14 are OBCs and EBCs. Notable new faces in the cabinet are Shreyasi Singh, Deepak Prakash, Rama Nishad, Ram Kripal Yadav and Sanjay Singh Tiger, the Surraj MLA. Key omissions are Nitish Mishra, Jiwesh Mishra and Sanjay Saraogi.",
  "summary": "",
  "published": "Thu, 20 Nov 2025 09:01:00 +0000",
  "url": "https://indianexpress.com/article/india/cabinet-cm-nitish-round-10-much-old-new-fine-balancing-act-10376147/",
  "source": "India | The Indian Express"
}