{
  "title": "How do the pros get someone to leave a cult? Manipulate them into thinking it was their idea",
  "text": "When the phone rings at Patrick Ryan and Joseph Kelly’s home in Philadelphia, chances are the caller is desperate. One couple rang because their son was about to abandon his medical practice to follow a new-age guru in Spain. Another call came from a husband whose wife was emptying their life savings for a self-proclaimed prophet in Australia. Yet another family phoned about their niece, who was in a relationship with a man stealing from her, maybe drugging her, probably sexually assaulting her.\n\nThese families had tried everything else. When nothing worked, they heard there were two men in Philadelphia who might still be able to bring their loved one home.\n\nWhat Ryan and Kelly do is unusual: they help people leave cults. Over the past 40 years, they have handled hundreds of cases – some simple and local, others stretching across borders and decades. They have been hired by families of both modest and considerable means. They say they have even been hired by government agencies, and that some cults they have investigated have left them genuinely afraid for their lives.\n\nThe goal is to untangle the family dynamics that might have made someone vulnerable to a cult in the first place\n\nAlthough many people are involved in cultic studies and education, fewer than 10 people in the US do anything like what Ryan and Kelly do. And among those, only Kelly and Ryan practice their strange and unique method: embedding themselves in families’ lives, pulling on threads like marionettists, sometimes for years.\n\nTheir method goes something like this. A family reaches out about their daughter, husband, nephew or grandchild. Ryan and Kelly conduct an assessment that can take anywhere from a day to a week (they would not say exactly). They charge $2,500 for the assessment, then $250 an hour after that, interviewing the family until they understand the dynamics well enough to devise a strategy. Then, over months or sometimes years, they work to create the conditions in which a person might begin to question the beliefs their life has been built on.\n\nNormally, Kelly and Ryan work by strengthening the existing relationships in a person’s life. It can be a long game. They will educate the family about the cultic group, and give advice about what to say (or not to say). They will bring in experts: psychiatrists, lawyers, priests that can provide perspective and counsel. The goal is to untangle the family dynamics that might have made someone vulnerable to a cult in the first place.\n\nVery occasionally, they meet face to face with the person involved in a cult. But these encounters look nothing like a drug intervention, with friends gathered in a circle and the reason for the meeting laid bare. Instead, Ryan and Kelly will act covertly. In one case, a son (the cult member) came home for a few days. His parents told him that Ryan and Kelly were friends of theirs, “family mediators” who happened to be “in town for a few days, to meet with some colleagues” – both technically true. The pair made sure to “forget” a book at the family home, and return the next day to collect it, as they began to build rapport.\n\nI met Kelly and Ryan at their place in south Philadelphia, a three-story house they share with a big dog named Kenny and a bright green parrot named Greta.\n\nGreta was a consolation prize Ryan bought for himself after a failed intervention, the second he ever attempted. It was the 1980s and his client, a woman who had recently finished her master’s at a prestigious university, had been drawn into a scam job. It was essentially a pyramid scheme built around a health regimen. Before you could sell it, you had to try it, so you knew what you were selling.\n\nThe regimen? Multiple enemas a day. “It escalated to 40 to 60 enemas a day,” Ryan said. “And when you do that many enemas, it upsets the electrolyte balance in your body and you begin hallucinating.”\n\nHe spent three days trying to reason with her, but she would not budge. Ryan asked himself: what value do I have if I can’t even talk someone out of an enema cult? Frustrated, he went for a walk, saw a bird in a pet shop window who said: “Hello, hello.” He put her in his coat, fashioned a small cage, took her on an airplane and brought her home.\n\nView image in fullscreen Joseph Kelly with their pet parrot, Greta. She was a consolation prize Ryan bought for himself after a failed intervention. Photograph: Nic Neves\n\nTheir approach has changed a lot since those early interventions.\n\nFirst, they are careful with language. They don’t love the word cult. They say it’s a cudgel: too blunt an instrument to get at the heart of the problem. Also, even if a client leaves a group and returns home, Ryan and Kelly wouldn’t say they “got them out”. They describe themselves as mediators who build bridges through which families can reach their loved ones. Sometimes, the person crosses that bridge. Sometimes, the outcome is more complicated.\n\nSecond, they have worked hard to distance themselves from “deprogramming” – the practice most people associate with cult interventions. In the 1970s and 80s, deprogramming could involve kidnappings, involuntary confinement and even violence. In one case Kelly mentioned, a cult member was held at gunpoint. It was controversial, and its effectiveness was questionable. “That,” Ryan said more than once, “is not what we do.”\n\nNowadays, they focus more on helping someone reach their own informed conclusion about the group they are part of, trying to soften the obstacles that might cloud their judgment.\n\nFor instance: one of the tricky parts, they explained, is communicating with a person who has been given tools to block out other people’s perspectives. This set of tools or ideas is what Ryan and Kelly call a group’s “gatekeeper”.\n\nRyan gave me an example. One client came from an extremely rigid, orthodox Catholic family. The family had a plan for life: retire early, save well, put the kids through college. But against these goals, the wife had joined an eastern religious group and was donating thousands of dollars to it. She had quit her job, and the marriage was collapsing.\n\nThe gatekeeper, Ryan and Kelly decided, was that the woman perceived her spouse “as dogmatic, fundamentalist – but not spiritual”. They needed to change her mind about her husband.\n\nSo Ryan called an old friend of Kelly’s, a Jesuit priest who lived in a parish near the family’s home. Ryan asked the priest to meet the husband. The two men became friends and agreed to meet regularly – all according to Ryan and Kelly’s plan. Every so often, the husband would text his wife: “I’m coming home late tonight, meeting my priest friend.”\n\n“She’s like, ‘What priest friend?’” Ryan said.\n\nAfter a few months, the wife became curious enough to want to meet her husband’s new friend. The priest, who was genuinely thrilled, nearly veered off plan by offering to speak with her directly. He believed she was ready to hear his views on spirituality. But Ryan stopped him: “I told him, look, they hired us to be strategists. I have a strategy for this.”\n\nRyan mapped out the parish and planned a tour. He made sure the route passed through the library specifically, the section with many eastern religious books. “You’re gonna go through there,” Ryan told the priest.\n\nOn a Friday, the husband brought his wife along to visit. The priest greeted them warmly and showed her the grounds. They walked through the library. She saw the books.\n\nSoon, the priest was coming over for barbecues. They all became friends. And she began openly talking with her husband about the group she was involved in: the good and the bad. They had passed the group’s gatekeeper. But the work was not finished.\n\nAll groups have a rhythm, like a pulse across the calendar year. We have holidays, and we have tax season. There are highs and lows. If you want to talk to someone about how dangerous their group is, you probably do not want to do it right after they have taken ayahuasca or gone on retreat. But the lows come just as reliably.\n\nWhen the wife finally started to complain about the group, the husband called Ryan: “She’s going to leave!” But Ryan told him firmly: “No, she’s not. Don’t push it.”\n\nBy the third cycle, the third low point, when she was sleep deprived, working long hours and truly miserable, Ryan gave the husband a single line. “Just say to her this: ‘You gave it a good shot.’ And nothing more.”\n\n“She said: ‘Yeah, I have. Will you help me get my stuff?’ And he said: ‘OK.’”\n\nThe whole time, the wife knew her husband had consulted Ryan and Kelly, though she did not know they had orchestrated his friendship with the priest. During the five years they worked on the case, she assumed they were anti-religious bad actors. A few months after she left the group, she met Ryan and Kelly for the first time.\n\nIn Ryan’s telling, she loved chatting with Kelly and himself because they so clearly understood what she appreciated about the group. But they also saw that she was being made to sleep only a few hours a night, drink toilet water, and work hundreds of hours recruiting members for a guru accused of sexual misconduct and labor law violations.\n\nRyan and Kelly started doing this work because when they were younger, they themselves had been in what would be described as cults. They were Transcendental Meditation (TM) instructors in the 70s and 80s. After about a decade with TM, they felt disturbed by their relationship to the organization, and they sued – Kelly in 1986, and Ryan in 1989 – for negligence and fraud. Kelly joined a suit as a Doe along with six others, claiming the organization had “fraudulently promised that the practice … would confer certain personal and societal benefits”, which never materialized. Ryan says that during the course of his TM training he was constantly surveilled and led to believe that he would be able to levitate and save humanity.\n\nYou can’t just interfere with someone’s life because you don’t like what they’re doing Patrick Ryan\n\nThe case Kelly joined, which dragged on for several years, included expert testimony from clinical psychologist Margaret Singer, a brainwashing specialist who had previously assessed Charles Manson. Neither case won, but their lawsuits eventually settled, and through the course of the litigation, Ryan and Kelly left the organization. (TM did not respond to a request for comment; however, Bob Roth, CEO of the TM-associated David Lynch Foundation, did let me know the American Heart Association recently named Transcendental Meditation an official stress reducer for treating high blood pressure.)\n\nKelly joined another group after leaving TM. He followed his new guru for five more years. Meanwhile, Ryan told me he got busy investigating and trying to expose cults, including the group Kelly had joined. In those early days, Ryan considered himself a sort of “cult fighter”, with a much more black and white view of what cults were and what it meant to be a part of one. They finally started working together when Kelly had a falling out with his second group, whose guru was eventually convicted for child sexual abuse.\n\nView image in fullscreen Ryan holds William S Kroger’s 1976 book called Hypnosis and Behavior Modification: Imagery Conditioning. Photograph: Nic Neves\n\nThey have had a close relationship ever since, working and living together with their dog and bird in a big house they told me was once used as a base of operations by the Philly mafia, which seems oddly fitting. They mostly prefer to keep details about their personal lives off-record. Often, the families they work with need to hear very hard things, and being a sort of blank slate makes it easier for them to be whoever their clients need them to be.\n\nThroughout reporting this piece, privacy was an issue. Ryan and Kelly told me many more details about their cases off the record. All these cases are anonymized, with some crucial details changed, to protect the identities of their clients and their families. Furthermore, Kelly and Ryan urge their clients not to speak with the media. The firmest “no” I ever got was when I asked Ryan if I could speak to a former client. The second was when I asked if they could show me emails or letters to prove they had worked with government agencies. This made it difficult to verify all the details of their stories, though I found the situations they described were consistent with other accounts of ex-members from cults they say their clients were a part of. When cases did make it to court, the details Ryan and Kelly provided me matched the legal testimony I found.\n\nBut without being able to speak to their former clients, some of the stories told here remain just that: stories in the telling of Ryan and Kelly. I was, however, able to speak with many of their collaborators, who confirmed that they had seen Ryan and Kelly’s method work close up. One of the people I spoke with, Dr Janja Lalich, is a professor emerita of sociology at California University State, Chico and author of multiple books on cults including Bounded Choice: True Believers and Charismatic Cults. Lalich lectures and consults on cultic studies, and regularly testifies as a cult expert in court cases internationally. She started studying them because she, too, joined and left a cult when she was younger. It was a radical Marxist-Leninist cult that eventually “imploded”; a process she details in her book. The members collectively overthrew the leadership and all left at the same time, she explained, “which was great”.\n\nLalich worked on a couple of cases with Kelly and Ryan in the 90s, when they were starting out. She did not like the work. She found it stressful and difficult, and felt some reservations about the way the process interfered with people’s lives. But the three of them have remained close over the years and still collaborate in the broader cult-awareness space, attending conferences and teaching workshops. She confirmed for me a lot of the claims Kelly and Ryan made about the cults they have dealt with, including the idea that most people who join cultic groups leave on their own.\n\nYou have to find 50 things [about the cult] that you could agree with the person on Patrick Ryan\n\nRyan concedes that their work can look a lot like meddling in someone’s life. But he is also firm in that they are not “hired hitmen”. They work with psychologists, psychiatrists and social workers to provide oversight, several of whom I spoke with for this piece. “You can’t just interfere with someone’s life because you don’t like what they’re doing,” Ryan told me. When Kelly and Ryan take on a case, it’s because there is some dynamic in the family system that they think their expertise can help untangle. In every case, the group in question is offering something to the person involved that the family might not be able to understand or appreciate. But to Ryan and Kelly, this appreciation is exactly the point.\n\nOne of their cases in the 90s involved a cult leader who was systematically sexually assaulting the group’s members. “I can’t get into all the details,” Ryan said. “He was horrible, a horrible man.” Ryan and Kelly had been flying regularly to Australia to work on the case. The client’s niece, a girl in the group, was beginning to fall out with the cult. The leader had been arrested and was on trial for crimes related to the cult’s activities.\n\nIn their process, Ryan and Kelly require what they call 50 things: “You have to find 50 things that you could agree with the person on.” Ryan gestured to a painting on the wall in their living room. It was a strange, surrealist-looking canvas with a big Tesla coil in the center and lightning shooting out at some pigeons. Ryan said, “If you look at this piece of art and say, ‘That’s really ugly,’ then we’re going to start off … not on the right page, right?”\n\nBut if I could appreciate what he found appealing, then, he said: “I think you have the right to criticize it.” The number may seem arbitrary, but their goal is to find 50 things a family can appreciate about a cult before discussing what they do not agree with.\n\nI put this number to Lalich and she said the notion of having to find 50 things seemed a bit extreme. “ I certainly could never find 50 things about my cult that I thought were good.” The spirit of it seemed right to her though, at least: that the family needs to tone down their rhetoric, or they will just push the cult-involved member away.\n\nView image in fullscreen Ryan sits in front of a painting of a Tesla coil and pigeons in his living room. Photograph: Nic Neves\n\nIn Kelly and Ryan’s case, the girl’s uncle, their client, had a very difficult time finding anything positive about the group or the leader who had allegedly raped his niece. When the trial came, the uncle wanted to testify against the leader, and Ryan and Kelly told him not to. “We said, if you testify, your niece … will cut you off.”\n\nThe uncle went to court anyway. Just as Ryan had predicted, the niece fell off the map entirely. She was scared they would kidnap her – try to deprogram or threaten her. Ryan and Kelly pulled some strings to find out that she had done some traveling, but otherwise, for “20 years”, Ryan said, “they didn’t know if she was alive or dead.”\n\nOn Ryan and Kelly’s counsel, the family made a social media account in the 2010s to post information about the family: weddings, births, etc. After nearly 30 years, the girl, now in middle age, finally reached out. The family had posted about how the grandfather was getting old, and she called to say she wanted to see him before he died.\n\nMuch has been written about the psychology of cults, the archetypes of cult leaders and the way they can create tragic, abusive conditions for their members. In just the past few years there have been Christian sects convicted of manslaughter of children, doomsday groups killing police officers, and starvation cults with bodies piled in mass graves. While Lalich says that to her, it is pretty clear what is or is not a cult, she also concedes that groups exist on a broad continuum ranging from extremely dangerous to “more or less” benign. She does not think that there is such a thing as a “harmless” cult – since all these groups exert some measure of coercion and manipulation. But for Ryan and Kelly, defining precisely what is or is not a cult is actually counterproductive, since so much of what they do is appeal to the person inside the cult who they are trying to reason with.\n\nThere is a hole a group fills: alienation from community, family, sexuality\n\nSo, rather than labeling a group as a cult, Ryan and Kelly focus on “cultic relationships” that exist between a member and an organization. “Ten million people have learned Transcendental Meditation,” Ryan clarified. “Ten million people are not in a cult.” His voice rose and he shrugged. “I mean, they’ve been lied to. As a teacher, we lied to them. We told them things that were just absolutely not true.”\n\n“Bonkers,” Kelly added from his rocking chair.\n\n“Bonkers,” Ryan confirmed.\n\nOver the course of their careers Ryan and Kelly have found that in order to mediate people’s relationships with these groups, they have to gain a better understanding of how they are drawn in to begin with. How is it that a cult leader can make a person seriously believe that they can levitate, or that drinking toilet water is acceptable? They have to understand how exactly a group manages to shake people’s fundamental assumptions about reality.\n\nFor example, Kelly described a case in which a leader would command people to have sex with one another: “‘You, woman, sleep with that woman.’ ‘You, sleep with that man.’” Even if participants were straight, the leader would ask them: “What is your limitation?” This is an archetype of cult leader that Kelly calls a “crazy adept”: “the disruptor, who comes in and destroys the norms in order to build up a better, purer reality.”\n\nOne of their close collaborators, Ashlen Hilliard, told me about a harrowing case whose details she preferred to keep tightly under wraps. She said they were referred to the case by a US government agency investigating the group, and it had proved extremely dangerous. If they were publicly known to be helping members leave, the group could retaliate. “I care about this,” Ryan said of this interview, “but I care more about not dying.”\n\nView image in fullscreen Ryan: ‘The only way [some questions] can be answered, in my mind, is by a feeling. And, that feeling is so easily manipulated.’ Photograph: Nic Neves\n\nHilliard explained that in this group, words like “victim” were twisted out of shape. “Instead of assigning a negative meaning to a word like ‘victim’, they say: this is a word that indicates a badge of honor.” Then, when a member was subject to sexual violence or other abuse by the group, being a “victim” was reframed as something positive. Often, people in these groups have experienced past trauma, and this destabilization of the concept of victimhood can feel freeing – at least initially.\n\nWhat Kelly and Ryan mean when they say these groups are “offering something” to people, it is exactly that. There is a hole a group fills: alienation from community, family, sexuality; pressure to follow a certain life plan, addiction, unrealized spirituality, economic catastrophe – all reasons to join a group. We all have deep pains that make us hope that maybe, if the world were different, we wouldn’t feel the way we do.\n\nPart of why their work is so necessarily confidential is that there is always the possibility a person will go back to their group. These are people trying to make sense of a reality whose fundamental rules have been turned on its head. When is anyone ever “done” making sense of things, anyway?\n\nKelly still thinks about a moment with the guru he followed after leaving Transcendental Meditation, back in 1985. He had been meditating at the feet of the guru, Prakashanand Saraswati (who they called Swami-ji, or “guru”), for several days. When he looked up, he saw the Swami surrounded by “a golden light.” He was not seeing an illusion. It was a real experience, built on ideas and promises laid out by the guru: a supreme, divine, transcendent love. “The wave merging into the ocean,” Kelly said.\n\nAfter that experience, Kelly felt Swami-ji could do no wrong. For the next three years, even when he saw the women visiting Swami-ji’s bedroom, the demands for thousands of dollars, the outbursts of rage; it all felt insignificant, or easily dismissed.\n\nFor that reason, Kelly and Ryan are not looking to convince people of any particular version of reality or truth. They do not seem to be interested in truth at all, really. When you use your experience to test whether or not something is true (the holiness of a guru, the righteousness of a cause) then, Ryan told me: “The person who gives you that experience will own you.” Their work is to usher people into a state of skepticism about the conclusion they have drawn from their experiences; beginning to open them up to the idea that individual experience is not the same as truth or reality.\n\nThis lighter touch approach is controversial. While interviewing people in the broader cult-awareness network, I found that Ryan and Kelly had drawn some criticism for affiliating with a certain group of academics that some people in their sphere disparage as “cult apologists”. This group belongs to a branch of cultic study that, like Ryan and Kelly, avoid the term “cult”, preferring the term “New Religious Movement”. Kelly and Ryan have consulted these academics over the years and have kept some as trusted contacts. Lalich and others say these apologists undermine survivors’ efforts to hold cults accountable for their abuses, by brushing over the harms such as child neglect and sexual abuse committed by groups like the Children of God (The Family International) or the Unification Church, even testifying in court on a cult’s behalf. It’s a bitter, complicated split in the field of cultic study, but these academics say, among other things, that they are speaking out for freedom of religion. When Ryan and Kelly mentioned these apologists, they said they understood Lalich’s criticism, but that there was a way in which they could see things “through their lens”.\n\nRyan and Kelly are not cult apologists, but in order to do their work they have had to keep an open mind. They neither fully endorse cults’ rights to exist, nor consider groups as bad per se. They arrive from as ideologically empty a place as they can, a skeptical place that is neither here, nor there. Doing work like this, the big question of epistemology, of what we can know and what to believe, become everyday practical quandaries.\n\n“I just know what is not real,” Ryan told me once. Take even the broadest existential question: what are we doing here?\n\n“The only way that can be answered, in my mind, is by a feeling,” he said. “And, that feeling is so easily manipulated.”\n\nYou have to be a certain kind of person to do this work. Though Lalich does not do interventions any more, she is glad there are people who do it in the “legitimate way”. When I asked her who she thought did it in the “legitimate way”, she only named four people. Of them, only three, including Ryan and Kelly, were still actively taking cases.",
  "summary": "<p>Two of the world’s leading cult interventionists live (with their parrot) in Philadelphia. They explain the art of coaxing people out of the most pernicious groups in the world</p><p>When the phone rings at Patrick Ryan and Joseph Kelly’s home in Philadelphia, chances are the caller is desperate. One couple rang because their son was about to abandon his medical practice to follow a new-age guru in Spain. Another call came from a husband whose wife was emptying their life savings for a self-proclaimed prophet in Australia. Yet another family phoned about their niece, who was in a relationship with a man stealing from her, maybe drugging her, probably sexually assaulting her.</p><p>These families had tried everything else. When nothing worked, they heard there were two men in Philadelphia who might still be able to bring their loved one home.</p> <a href=\"https://www.theguardian.com/science/2025/nov/19/how-to-leave-a-cult-experts-intervention\">Continue reading...</a>",
  "published": "Wed, 19 Nov 2025 11:00:34 GMT",
  "url": "https://www.theguardian.com/science/2025/nov/19/how-to-leave-a-cult-experts-intervention",
  "source": "The Guardian"
}