{
  "title": "Melanoma rates are spiking fast in these 15 Pennsylvania counties",
  "text": "Counties in Pennsylvania that contain or sit close to cultivated cropland show notably higher melanoma rates than other parts of the state, according to new research led by scientists at Penn State.\n\nResearchers at the Penn State Cancer Institute reviewed cancer registry data collected from 2017 through 2021 and discovered that adults over age 50 living in a 15-county area of South Central Pennsylvania were 57% more likely to be diagnosed with melanoma, the deadliest form of skin cancer, compared to residents elsewhere in the state. The team reported these results on Nov. 14 in the journal JCO Clinical Cancer Informatics.\n\nCharlene Lam, associate professor of dermatology at Penn State Health and co-author of the study, noted that the elevated cases appear in both rural and urban counties. She explained that the higher risk is not limited to isolated locations or people who spend much of their time outdoors.\n\nAgricultural Environments Linked to Elevated Risk\n\n\"Melanoma is often associated with beaches and sunbathing, but our findings suggest that agricultural environments may also play a role,\" she said. \"And this isn't just about farmers. Entire communities living near agriculture, people who never set foot in a field, may still be at risk.\"\n\nThe usual suspect -- sunlight -- was included in the analysis. Yet even after adjusting for ultraviolet radiation levels in Pennsylvania and considering socioeconomic factors, two consistent associations emerged. Counties with more cultivated acreage and counties with greater herbicide use displayed significantly higher melanoma rates.\n\nHerbicides, Biological Effects, and Melanoma Patterns\n\n\"Pesticides and herbicides are designed to alter biological systems,\" said Eugene Lengerich, emeritus professor of public health sciences at Penn State and senior author on the paper. \"Some of those same mechanisms, like increasing photosensitivity or causing oxidative stress, could theoretically contribute to melanoma development.\"\n\nAccording to the analysis, a 10% increase in cultivated land was linked to a 14% rise in melanoma cases across the region. Herbicide exposure showed a similar pattern: a 9% increase in herbicide-treated land corresponded to a 13% increase in melanoma incidence.\n\nLam emphasized that exposure is not restricted to those handling agricultural chemicals. She explained that these substances can drift on air currents, settle in household dust and enter water sources.\n\nChemical Drift and Community-Wide Exposure\n\n\"Our findings suggest that melanoma risk could extend beyond occupational settings to entire communities,\" she said. \"This is relevant for people living near farmland. You don't have to be a farmer to face environmental exposure.\"\n\nThe study also referenced earlier research showing links between pesticide and herbicide exposure and melanoma, citing evidence that these chemicals can heighten sensitivity to sunlight, interfere with immune responses and damage DNA in non-human animals and plants.\n\nStudy Shows Associations, Not Proof of Cause\n\nBenjamin Marks, first author on the paper and a medical and public health student at the Penn State College of Medicine, cautioned that while higher melanoma rates appear in areas with more cropland and herbicide use, the findings do not prove that chemicals used on crops such as corn, soybeans and grains directly cause cancer. Instead, he said the patterns point to a connection that deserves further study.\n\nHe added that research of this kind is useful for spotting broad trends, even though it cannot identify individual risk.\n\n\"Think of this as a signal, not a verdict,\" Marks said. \"The data suggest that areas with more cultivated land and herbicide use tend to have higher melanoma rates, but many other factors could be at play like genetics, behavior or access to health care. Understanding these patterns helps us protect not just farmers, but entire communities living near farmland.\"\n\nImplications Beyond Pennsylvania\n\nLam said she hopes to better understand how agricultural practices relate to public health, especially since similar trends have been identified in farming regions of Utah, Poland and Italy. She encouraged anyone concerned about risk to perform routine skin checks and use sun-protective clothing and sunscreen. As part of the next phase of research, she is leading studies in rural communities within the affected area to learn more about farming practices and potential exposure pathways.\n\n\"Cancer prevention can't happen in isolation,\" Lengerich said. \"This study demonstrates the importance of a 'One Health' approach, an understanding that human health is deeply connected to our environment and agricultural systems. If herbicides and farming practices are contributing to melanoma risk, then solutions must involve not just doctors, but farmers, environmental scientists, policymakers and communities working together.\"\n\nOther co-authors include Jiangang Liao, professor of public health sciences at Penn State College of Medicine, and Camille Moeckel, a fourth-year medical student and research associate at Penn State College of Medicine.\n\nThis work was supported by the MPH Capstone Program and the Medical Student Research Project at the Penn State College of Medicine, along with the University's Algin B. Garrett Professorship.",
  "summary": "Penn State scientists identified a striking rise in melanoma across several Pennsylvania counties dominated by cropland and herbicide use. The elevated risk persisted even after factoring in sunlight, suggesting an environmental influence beyond the usual expectations. Researchers warn that drifting chemicals may expose nearby residents, not just farm workers.",
  "published": "Sun, 16 Nov 2025 12:16:29 EST",
  "url": "https://www.sciencedaily.com/releases/2025/11/251116105732.htm",
  "source": "All Top News -- ScienceDaily"
}