{
  "title": "Labour’s asylum plans strike at the heart of Britain’s commitment to fairness and justice | Letters",
  "text": "The government’s asylum proposals, rendering subsistence support discretionary and compelling refugees to return once their countries are deemed “safe”, represent a profound departure from both legal obligations and moral responsibility. These are not minor administrative adjustments; they are structural erosions of rights that strike at the heart of Britain’s commitment to fairness and justice.\n\nThe United Kingdom remains bound by the 1951 refugee convention and the Human Rights Act 1998. These instruments enshrine non‑discretionary duties, including the provision of subsistence and protection against refoulement. To reframe such duties as optional is to mischaracterise international law and invite judicial challenge. More importantly, it undermines the principle that rights are universal and inalienable, not favours dispensed at political whim.\n\nThe notion of “safety” determined by ministerial decree ignores the lived realities of persecution, trauma and instability. Refugees who have built lives, families and communities in Britain should not be subjected to forced return based on shifting geopolitical assessments. Protection must be durable, not conditional, and rights must be upheld consistently, not traded for expediency.\n\nLabour appears to prioritise electoral calculation over principled defence of universality. Solidarity has been reduced to a dance of Reform UK’s tune. This is not leadership, it is mimicry – a concession that undermines Labour’s founding ethos.\n\nThe consequences are grave. Rights presented as discretionary cease to be rights, they become privileges dispensed at political whim. Refugee protection reduced to a temporary lease corrodes both the rule of law and the moral fabric of society. Human rights are not bargaining tools – they are the foundation of justice and must be upheld without compromise.\n\nDanny McCloskey\n\nLondon\n\nI despair when I read the rhetoric about asylum and refugee status. The charity Refugees Welcome, Cheshire East held an event in a local Methodist church on 15 November to mark 10 years of our existence. The church was packed with more than 150 happy people, including Syrians, Afghans, Ukrainians and Chagossians, whom we have supported over the last 10 years since our inception. There were speeches of thanks from all the refugee groups, punctuated with musical treats from each group. There was a very special moment when some of the Ukrainian children joined the Afghan dance. Following the more formal part of the afternoon, we met for biscuits and cakes baked by the refugees. We were honoured to be joined by local MPs, mayors and other dignitaries.\n\nThe people we support have come to Cheshire East out of utter desperation. Becoming a refugee is not a lifestyle choice. Our refugees find jobs as soon as they can. They are generally vastly overskilled for their jobs, but they are ready to pay taxes. They do not want to live on benefits.\n\nThe refugees we support have now made a life in the UK. Their children are being educated here and often speak with a local accent. They feel safe here and there is nothing for them to return to in the countries they were forced to leave.\n\nI hope the government does not feel impelled to out-Reform Reform UK with cruel policies unless it fully understands the situation.\n\nNicky Campbell\n\nChair of trustees, Refugees Welcome, Cheshire East\n\nStella Creasy is undoubtedly correct in assuming that asylum seekers don’t read the latest UK policy guidance before setting off to find refuge (ICE-style raids on Britain’s streets: that’s all Labour’s brutal asylum reforms will achieve, 17 November). We therefore have to assume that the majority of asylum seekers that reach these shores are highly motivated, skilful, resilient and relatively resourceful. That’s the thinking University of Birmingham had when we set up the USE-IT programme in 2016: a partnership led by Birmingham city council with a range of stakeholders including the university.\n\nOur “asset-based” approach to regeneration viewed asylum seekers as precisely that: a valuable asset. We aimed to find locally at least 60 asylum seekers or refugees with skills that could be employed in the newly built Midland Metropolitan hospital. The team found more than 200 people and matched them into healthcare roles across West Birmingham and Sandwell. The skills of asylum seekers included GPs, nurses, pharmacists and even highly trained medical and surgical consultants. The so-called asylum or immigration crisis needs to be turned on its head. To dampen the dangerous political rhetoric on offer from Labour, we need to recognise the social and economic capital many asylum seekers bring to the UK and maximise such valuable assets.\n\nDr Peter Lee\n\nFormer associate professor of collaborative planning, University of Birmingham\n\nYour leader (17 November) rightly highlights the enormous bureaucratic costs involved in the proposed 30-month reviews of the eligibility of refugees given permission to stay in the UK. With around 100,000 asylum claims annually, the system would soon need to conduct around 70,000 reviews each year. Home Office staff are already overstretched in processing existing initial claims for asylum. The new money required would have to come from within the settlement for the department agreed in the recent public spending review. One has to ask then what other Home Office budgets would be raided for that purpose.\n\nIt is suggested that some of the costs might be defrayed by the Home Office instituting a one-off scheme to give permission to asylum seekers from Sudan, Eritrea, Iran, Afghanistan and Syria to stay for a limited period, which, if contractual arrangements allow, would mean there was no longer a need for them to be housed in hotels at public expense. But where would they be housed instead, and who would pay for that housing?\n\nMichael Brown\n\nChichester",
  "summary": "<p>Readers respond to news articles and analysis on Shabana Mahmood’s proposals to change the asylum system</p><p>The government’s <a href=\"https://www.theguardian.com/uk-news/2025/nov/16/what-changes-to-the-uk-asylum-system-are-being-mooted-by-shabana-mahmood-labour\">asylum proposals</a>, rendering subsistence support discretionary and compelling refugees to return once their countries are deemed “safe”, represent a profound departure from both legal obligations and moral responsibility. These are not minor administrative adjustments; they are structural erosions of rights that strike at the heart of Britain’s commitment to fairness and justice.</p><p>The United Kingdom remains bound by the 1951 refugee convention and the Human Rights Act 1998. These instruments enshrine non‑discretionary duties, including the provision of subsistence and protection against refoulement. To reframe such duties as optional is to mischaracterise international law and invite judicial challenge. More importantly, it undermines the principle that rights are universal and inalienable, not favours dispensed at political whim.</p> <a href=\"https://www.theguardian.com/uk-news/2025/nov/20/labours-asylum-plans-strike-at-the-heart-of-britains-commitment-to-fairness-and-justice\">Continue reading...</a>",
  "published": "Thu, 20 Nov 2025 17:45:52 GMT",
  "url": "https://www.theguardian.com/uk-news/2025/nov/20/labours-asylum-plans-strike-at-the-heart-of-britains-commitment-to-fairness-and-justice",
  "source": "The Guardian"
}