{
  "title": "Use smart tech, turn heat down, service boilers: how to save money on energy bills",
  "text": "Use smart tech\n\n“When it comes to staying warm and saving energy, small changes can make a big difference,” says Sarah Pennells, a consumer finance specialist at the investment company Royal London.\n\nFirst, use a timer if your boiler or thermostat has one.\n\nFor more control, you could switch to a smart thermostat, which will connect your heating system to the internet. This will let you control your thermostat remotely, usually through a mobile app, meaning you can turn your heating off or down if you have had an unexpected change of plan. A smart thermostat effectively adds a timer to a boilerYou can then use the app to schedule heating and hot water.\n\nSmart thermostats vary and can offer different features, including multi-room control, hot water control, and “geofencing” to track when you leave and enter your home. They typically cost between £60 and £250, depending on the make and model.\n\nView image in fullscreen Switching to a smart thermostat\n\nallows you to control your thermostat remotely, usually through a mobile app. Photograph: StefaNikolic/Getty Images\n\nSome can be fitted without help, such as the Bosch Room Thermostat II (£69,99 on Amazon); others, such as the Hive Thermostat V4 (£155 on B&Q) require professional fitting. This can normally be booked through the retailer, but may incur an additional cost.\n\nSome energy suppliers offer deals on smart thermostats made by companies they have partnerships with, such as Octopus Energy’s partnership with tado°, which gives customers up to 50% off tado° products. A Wireless Smart Thermostat X Starter Kit is £112, down from £159.99.\n\nReduce temperatures\n\nTurning down your thermostat from 22C to 21C can save a typical household £90 a year in Great Britain, according to the Energy Saving Trust. For most people, a comfortable temperature falls somewhere between 18C and 21C.\n\nAccording to Citizens Advice, every degree you turn your thermostat down can save you about 10% on your energy bill, but it warns that if you are elderly or have a health condition you should not set it below 21C.\n\nView image in fullscreen For most people, a comfortable temperature in the home is between 18C and 21C. Photograph: Ridofranz/Getty Images\n\nIt also advises that having the heating on all the time at a low temperature will cost more than having it on at a slightly higher temperature but for a shorter interval.\n\nSetting the heating to go off 30 minutes before you leave the house or go to sleep will also reduce your bill.\n\nLower the flow\n\nIf you have a combi boiler, you can lower its flow temperature – that is, the temperature of the water flowing out and to the radiators.\n\nIf you have a system boiler or a hot water cylinder, EDF Energy advises you don’t do this on your own but get advice from an engineer.\n\nOn many boilers the flow temperature is set too high by default, at about 75-80C. Reducing it to about 60C can cut your gas bill without making much difference to how warm you feel.\n\n“This is especially effective in homes with well-sized radiators and good insulation … and doesn’t noticeably affect comfort,” Pennells says.\n\nThe charity Nesta has an interactive online tool that gives detailed instructions on how to change the setting on your boiler. The charity recommends you take a picture of the boiler controls and settings before proceeding so that you have a record of your initial settings.\n\nTurn down radiators\n\nIf you have thermostatic radiator valves (TRVs), the dial that controls how much hot water enters the radiator it is attached to, you will be able to adjust the temperature separately in each room. TRVs usually have a scale from 0 to 6, where 0 is off and 6 is fully open.\n\nWe’ve found that people have changed their behaviours and started to warm the person rather than the house Sophie Burr of National Energy Action\n\nThe Energy Saving Trust recommends putting it on the lowest setting that keeps the room at a comfortable temperature, which could be 3 or 4 for rooms you use the most and 2 or 3 for others. It says adding TRVs to a system that already has a programmer and thermostat can save a household £35 a year.\n\nWhile it may be tempting to turn off your heating in the name of saving cash, experts say this can lead to mould and damp – and this could be more costly and dangerous to deal with in the long term.\n\n“During the energy crisis, we’ve found that people have changed their behaviours and started to warm the person rather than the house,” says Sophie Burr, the project development coordinator at National Energy Action. “Our research has shown that it is more cost-effective to heat the whole space while turning the radiators down to number 2 in rooms you are not using, allowing some heat in those rooms and preventing the growth of mould spores, which can have serious health impacts such as worsening respiratory conditions.”\n\nGet reflectors\n\nThe British Gas Energy Trust advises that you use foil behind radiators to reflect heat back into the room. Radiator reflectors allow that heat to be dispersed into the room rather than just get absorbed by an external wall, as 35% of the heat in a room is lost through the walls. Reflectors are particularly beneficial on uninsulated external walls.\n\nAlthough an initial additional cost, they are fairly cheap to buy, easy to install and should last. They can be bought in rolls, and then cut to fit any radiator. They are easy to apply using a provided adhesive or double-sided tape – just make sure the radiators are off and cool first. Screwfix sells a 1.88 sq metre roll for £7.51, B&Q has a 5 sq metre roll for £14.97 and Amazon sells a 15 sq metre one for £27.99.\n\nBleed your radiators every few months so they run efficiently. To do this, make sure your radiators are off and cool. Insert a key (£3.50 for a two-pack from B&Q) or a flat-head screwdriver into the bleed valve on the radiator, usually at the top corner, and turn it anti-clockwise. You should hear a hissing sound as the air escapes but wait for the hissing to stop and a steady stream of water to appear (which you can catch with a cloth) before turning the valve clockwise to close it again.\n\nView image in fullscreen A boiler service will improve its efficiency. Photograph: Joe Giddens/PA\n\nAvoid covering your radiators with furniture or curtains – especially under windows. This will help the heat spread wider.\n\nKeep your boiler serviced\n\nA boiler service will improve its efficiency and extend its lifespan by catching and fixing minor problems. Octopus Energy says an unserviced boiler can use up to 10% more energy than one that is annually checked out. “If a boiler is not serviced regularly, it can have a significant impact on fuel efficiency and health,” Burr says.\n\nAccording to Which?, a standard boiler service costs between £70 and £110.\n\nSome energy companies offer a service as part of their annual cover plans – British Gas, for example, has one in its HomeCare policy, which starts at £19 a month. However, a boiler care plan isn’t for everyone. Which? says that while a cover plan can give peace of mind, sometimes the monthly payments add up to more than paying for an annual service and repairs when needed. It recommends weighing up if you have enough savings to pay for an annual service outright every time.\n\nIf you live in rented housing, it is your landlord’s responsibility to ensure that the boiler is serviced and certified yearly. “Annual boiler servicing for all homes in the rental sector is a requirement by law,” Burr says. “For properties with gas boilers, this must be carried out by a Gas Safe engineer, and for oil boilers, by an Oftec-certified engineer. Annual boiler servicing will ensure that the appliance is working efficiently and is not leaking carbon monoxide into your home.”",
  "summary": "<p>From turning down thermostats to make savings to installing reflectors to push warmth back into your home</p><p>“When it comes to staying warm and saving energy, small changes can make a big difference,” says Sarah Pennells, a consumer finance specialist at the investment company Royal London.</p> <a href=\"https://www.theguardian.com/money/2025/nov/19/smart-tech-heat-service-boilers-save-energy-bills\">Continue reading...</a>",
  "published": "Wed, 19 Nov 2025 07:00:09 GMT",
  "url": "https://www.theguardian.com/money/2025/nov/19/smart-tech-heat-service-boilers-save-energy-bills",
  "source": "The Guardian"
}