{
  "title": "‘Particularly special summit’: PM Modi as he embarks on 3-day visit to South Africa to attend G20 Summit",
  "text": "Prime Minister Narendra Modi Friday embarked on a three-day visit to South Africa to attend the 20th G20 Leaders’ Summit in Johannesburg, on the invitation of the President Cyril Ramaphosa.\n\nCalling it a “particularly special summit,” the PM, in his departure statement, said that it would be the first G20 Summit being held in Africa.\n\nThe African Union had become a member of the G20 during India’s presidency of the Summit held in New Delhi in 2023. This will be the fourth consecutive G20 Summit being held in the Global South.\n\nVIDEO | Delhi: Prime Minister Narendra Modi (@narendramodi) leaves for a three-day visit to South Africa to attend the first G20 summit being held in Africa. (Source: Third Party) pic.twitter.com/wwnrBsIYpQ — Press Trust of India (@PTI_News) November 21, 2025\n\nPM Modi will present India’s perspective at the forum in line with its “vision of ‘Vasudhaiva Kutumbakam’ and ‘One earth, One Family and One future.’ I look forward to my interactions with leaders of the partner countries, and participation in the 6th IBSA Summit scheduled on the sidelines of the Summit,” according to the statement.\n\n“The Summit will be an opportunity to discuss key global issues. The theme of this year’s G20 has been ‘Solidarity, Equality and Sustainability’, by which South Africa has carried forward the outcomes from the previous Summits held in New Delhi, India and Rio de Janeiro, Brazil,” the statement read.\n\n“During the visit, I also look forward to my interaction with the Indian diaspora in South Africa, which is one of the largest outside India,” PM Modi stated.\n\nAnnouncing his visit over a post on X, Modi wrote: “Various global issues will be discussed there. Will be meeting various world leaders during the Summit.”\n\nOn the margins of the Summit, the PM is expected to hold bilateral meetings with some leaders, including, Japan’s new PM Sanae Takaichi, besides participating in the India-Brazil-South Africa (IBSA) Leaders’ Meeting.",
  "summary": "",
  "published": "Fri, 21 Nov 2025 03:59:45 +0000",
  "url": "https://indianexpress.com/article/india/pm-modi-south-africa-johannesburg-g20-summit-10377557/",
  "source": "India | The Indian Express"
}