{
  "title": "Two Indian-origin Canadians charged in US led cartel crackdown",
  "text": "Operation Giant Slalom\n\n\n\n\n\nA sweeping US led crackdown on an international drug trafficking network has resulted in the arrests of 10 people, including two Indian-origin Canadians, after investigators linked the group to a brutal witness killing in Colombia earlier this year.According to a press release by the Justice Department, The case centres on Ryan James Wedding, a former Olympic snowboarder accused of running one of the most violent narcotics organisations connected to the Sinaloa Cartel.The arrests follow the unsealing of a nine-count federal indictment that involves a wide criminal network stretching across Canada, the United States, Mexico, Colombia and the Dominican Republic.Wedding has been living in Mexico and is accused of directing murders, laundering drug proceeds and even ordering the killing of a witness in a separate federal narcotics case. He was added to the FBI’s Ten Most Wanted Fugitives List earlier this year, and the reward for information leading to his arrest has now risen to 15 million dollars.Among those taken into custody were Deepak Balwant Paradkar, a 62-year-old Canadian criminal barrister of Indian origin, and Gursewak Singh Bal, 31-year-old from Mississauga.Paradkar is accused of advising Wedding to kill a federal witness in order to avoid being extradited to the United States. Prosecutors say he also helped Wedding obtain court documents and access to associates who were under arrest or investigation, along with bribery according to US Department of Treasury. Bal is alleged to have co-operated a website called The Dirty News, which authorities say was used to publish information to help locate the victim.The US Justice Department said the latest arrests are part of the second phase of Operation Giant Slalom, a multinational effort involving American, Canadian and Colombian police forces. The group is accused of organising the murder of a cooperating witness who was shot dead in a Medellín restaurant on January 31. Court documents state that Wedding placed a bounty on the victim and arranged for associates to find and kill him.Attorney General Pam Bondi said authorities were determined to bring Wedding to justice. She said, “Whether you’re a kingpin or a dealer on the street, anyone who sells drugs to our kids will be arrested and prosecuted. Ryan Wedding controls one of the most prolific and violent drug trafficking organizations in this world and works closely with the Sinaloa Cartel. We will not rest until his name is taken off the FBI’s Top 10 Most Wanted List, and his narco-trafficking organization lies dismantled. ”FBI Director Kash Patel said Wedding’s organisation moved “tons of cocaine each year” into the United States. Treasury officials added that they were now targeting the cartel financially. “Our goal is simple: make it difficult for criminals like this to profit from poisoning our communities,” said Treasury Under Secretary John Hurley.Wedding remains at large, along with three other suspects believed to be hiding in Mexico, Canada and the Dominican Republic. US officials say the defendants charged in connection with the killing face a possible life sentence if convicted.The operation forms part of a wider federal initiative against transnational crime networks, including Operation Take Back America and the Homeland Security Task Force, which aim to dismantle drug cartels, foreign gangs and smuggling rings operating across borders.",
  "summary": "",
  "published": "Thu, 20 Nov 2025 21:31:33 +0530",
  "url": "https://timesofindia.indiatimes.com/world/rest-of-world/two-indian-origin-canadians-charged-in-us-led-cartel-crackdown-alleged-to-have-helped-fugitive-druglord-in-murder-bribery/articleshow/125466394.cms",
  "source": "Times of India"
}