{
  "title": "Tell us: have you spotted or heard about escaped wallabies in your area?",
  "text": "Sightings of escaped wallabies in Britain are increasing, and don’t appear to be limited to a particular region.\n\nThe most recent verified data indicates clusters in the Chiltern Hills, Cornwall and Wiltshire. There have also been reports from Cumbria, Yorkshire, Northumberland, Lancashire, north Wales, Kent, Suffolk, Cambridgeshire, Norfolk, the Thames Valley, the Isle of Wight and the Isle of Man.\n\nHave you spotted or heard about wallabies in your area? Please provide details if possible - where, when, how many, how frequent, and what they were doing.\n\nShare your experience You can tell us about your wallaby sightings below. Please share your story if you are 18 or over, anonymously if you wish. For more information please see our terms of service and privacy policy Tell us here Your responses, which can be anonymous, are secure as the form is encrypted and only the Guardian has access to your contributions. We will only use the data you provide us for the purpose of the feature and we will delete any personal data when we no longer require it for this purpose. For alternative ways to get in touch securely please see our tips guide Name Where do you live? Tell us a bit about yourself (e.g. age, background, what you do) Optional Tell us about your wallaby sighting(s), or what you've heard about them in your area Please include as much detail as possible. You can upload a photo here Optional Please note, the maximum file size is 5.7 MB . Choose file You can upload another photo here Optional Please note, the maximum file size is 5.7 MB . Choose file You can upload another photo here Optional Please note, the maximum file size is 5.7 MB . Choose file Can we publish your response? Yes, entirely Yes, but contact me first Yes, but please keep me anonymous No, this is information only Phone number Your contact details are helpful so we can contact you for more information. They will only be seen by the Guardian. Email address Your contact details are helpful so we can contact you for more information. They will only be seen by the Guardian. You can add more information here Optional If you include other people's names please ask them first. Would you be interested in speaking to our audio and/or video teams? Audio only Video only Audio and video No, I'm not interested By submitting your response, you are agreeing to share your details with us for this feature. Submit\n\nIf you’re having trouble using the form click here. Read terms of service here and privacy policy here.",
  "summary": "<p>Escaped wallabies in Britain appears to be a widespread phenomenon. We would like to hear about any sightings</p><p>Sightings of escaped wallabies in Britain <a href=\"https://www.thetimes.com/uk/science/article/wallaby-sightings-uk-l90qfclxc\">are increasing</a>, and don’t appear to be limited to a particular region.</p><p>The most recent verified data indicates clusters in the Chiltern Hills, Cornwall and Wiltshire. There have also been reports from Cumbria, Yorkshire, Northumberland, Lancashire, north Wales, Kent, Suffolk, Cambridgeshire, Norfolk, the Thames Valley, the Isle of Wight and the Isle of Man.</p> <a href=\"https://www.theguardian.com/world/2025/nov/20/tell-us-have-you-spotted-or-heard-about-escaped-wallabies-in-your-area\">Continue reading...</a>",
  "published": "Thu, 20 Nov 2025 11:34:16 GMT",
  "url": "https://www.theguardian.com/world/2025/nov/20/tell-us-have-you-spotted-or-heard-about-escaped-wallabies-in-your-area",
  "source": "The Guardian"
}