{
  "title": "ED names Robert Vadra as accused in case against UK-based arms consultant",
  "text": "The Enforcement Directorate has filed a supplementary prosecution complaint naming Robert Vadra, husband of Congress MP Priyanka Gandhi Vadra and son-in-law of Sonia Gandhi, as an accused in an alleged black money case linked to UK-based arms consultant Sanjay Bhandari.\n\nThe prosecution complaint, which is akin to a chargesheet, was filed before a special court in the Rouse Avenue court complex on November 15 and will be heard on December 6.\n\nBhandari fled to London after a search by the Income Tax department in 2016. A year later, the ED had filed a criminal case against him under the anti-black money law of 2015. The agency had also been probing Bhandari’s links with Vadra.\n\nThe ED complaint against Vadra was filed three months after it named him in a prosecution complaint linked to its money laundering investigation into a 2008 land deal involving a 3.53-acre plot in Shikohpur village in Gurgaon’s Sector 83.\n\nALSO READ | ED chargesheet against Vadra, and the deep political connections of Onkareshwar Properties\n\nIt is learnt that the ED investigation found that Vadra had a role in assisting Bhandari and using the property at 12, Bryanston Square, London which, the agency claimed, was the proceeds of crime.\n\nVadra had denied owning any London property directly or indirectly.\n\nIn July this year, a Delhi court declared Bhandari a fugitive economic offender, paving the way for the ED to seize his assets. According to the ED, undisclosed foreign income or assets of Bhandari were worth Rs 655 crore and the total tax evaded by him, including penalty and interest, was Rs 196 crore.\n\nStory continues below this ad\n\n“The evidence gathered by ED indicates that the property acquired by Bhandari was beneficially used by Vadra… for his personal use,” sources said.\n\nThe ED probe found that Vadra furnished the property at 12, Bryanston Square which was purchased by Bhandari for GBP 1.9 million.",
  "summary": "",
  "published": "Thu, 20 Nov 2025 22:50:18 +0000",
  "url": "https://indianexpress.com/article/india/ed-names-robert-vadra-as-accused-in-case-against-uk-based-arms-consultant-10377270/",
  "source": "India | The Indian Express"
}