{
  "title": "Seva central value of Indian civilisation, says Modi in Andhra Pradesh",
  "text": "Prime Minister Narendra Modi on Wednesday attended the birth centenary celebrations of Sri Sathya Sai Baba in Puttaparthi, Andhra Pradesh.\n\nAlthough Baba is no longer present in physical form, Modi said his teachings, his love, and his spirit of service continue to guide crores across the world.\n\nUnderlining that Baba’s life was a living embodiment of the ideal of “Vasudhaiva Kutumbakam”, the Prime Minister said, “Therefore, this birth centenary year has become a grand festival of universal love, peace, and service.”\n\nHe said that it is the government’s good fortune to have released a ₹100 commemorative coin and postage stamp on this occasion, both reflecting Baba’s legacy of service.\n\n“The central value of Indian civilisation is seva, or service”, said the Prime Minister, highlighting that all of India’s diverse spiritual and philosophical traditions ultimately lead to this one ideal.\n\nThe Prime Minister emphasised that Baba placed seva at the very heart of human life. He said that Baba’s institutions in education, healthcare, rural development, and several other areas stand as living proof of this philosophy.\n\nHighlighting that Baba’s message has never been confined to books, discourses, or the boundaries of an ashram, Modi remarked that the impact of his teachings is visible among the people.\n\nStory continues below this ad\n\nModi recalled that after the Gujarat earthquake, Baba’s Seva Dal stood at the forefront of relief efforts.\n\nAndhra Pradesh Chief Minister N Chandrababu Naidu and Union Ministers K Rammohan Naidu, G Kishan Reddy and Bhupathi Raju Srinivasa Verma were among those present at the event. (Image: X/narendramodi) Andhra Pradesh Chief Minister N Chandrababu Naidu and Union Ministers K Rammohan Naidu, G Kishan Reddy and Bhupathi Raju Srinivasa Verma were among those present at the event. (Image: X/narendramodi)\n\nUnderlining that the nation is moving forward with the spirit of “Kartavya Kaal” towards a developed India, and achieving this goal requires active citizen participation, Modi emphasised that the Baba’s birth centenary year is a source of inspiration in this journey. He urged everyone to strengthen the mantra of “Vocal for Local” during this year, noting that promoting the local economy is essential for building a developed India.\n\nAndhra Pradesh Chief Minister N Chandrababu Naidu and Union Ministers K Rammohan Naidu, G Kishan Reddy and Bhupathi Raju Srinivasa Verma were among those present at the event.",
  "summary": "",
  "published": "Wed, 19 Nov 2025 21:57:10 +0000",
  "url": "https://indianexpress.com/article/india/seva-central-value-of-indian-civilisation-says-modi-in-andhra-pradesh-10375262/",
  "source": "India | The Indian Express"
}