{
  "title": "‘Resources at breaking point’: Kerala HC caps Sabarimala pilgrims number at 75,000 a day",
  "text": "OBSERVING THAT “all available resources at Sabarimala have reached breaking point, and neither police nor the Devaswom Board is able to contain the inflow effectively”, Kerala High Court on Wednesday capped the number of pilgrims per day at 75,000.\n\nThe division bench of Justices Raja Vijayaraghavan and K V Jayakumar, in suo motu proceedings initiated on crowd management at Sabarimala, said that when pilgrim inflow exceeded one lakh, the density in parts of the temple crossed into the red zone (high risk crush zone), posing an unacceptable risk to public safety.\n\nWhen this year’s annual pilgrim season began on November 16, the state police had fixed that 70,000 devotees could be allowed a day through virtual queue booking and another 20,000 through spot booking. However, in the past two days, the temple witnessed a flow of devotees around one lakh, ringing alarm bells in the temple. The court’s directive to cap the virtual queue booking at 70,000 and spot booking at 5,000 will remain in effect until November 24.\n\nTaking strong exception to the lack of long-term preparedness and availability of basic amenities for pilgrims, the court said the Travancore Devaswom Board shall constitute a Sabarimala Infrastructure and Crowd Management Expert Committee, comprising specialists from various areas. It will prepare a scientific master plan for each season, after determining the carrying capacity of all nodes and to improve facilities. The establishment and utilisation of the committee is critical to move away from the current reactive, repetitive, and fragmented mode of functioning, said the court.\n\nNewly appointed TDB president K Jayakumar, a retired IAS officer, on Wednesday said the board was apologetic towards those who could not get darshan. “The new board assumed office days before the pilgrim season. Preparations for the pilgrim season should have started at least six months before. When one lakh devotees were waiting there were only 360 volunteers to distribute water,’’ he said.\n\nMeanwhile, the Opposition Congress and BJP targeted the CPI(M) government for the crisis in crowd management and the failure to ensure basic facilities at the temple.\n\nLashing out at the government, Opposition Leader V D Satheesan said, “Those who have looted the gold of Lord Ayyappa, have also spoiled the pilgrim season. There is a lack of coordination among various departments. The mismanagement of the pilgrim season is unheard in the history of the temple. Devotees are struggling to get basic facilities and drinking water. If the government does not set things right at Sabarimala, UDF will send a delegation,’’ he said.\n\nStory continues below this ad\n\nBJP national executive member P K Krishnadas said Sabarimala is witnessing serious violation of human rights. “The BJP has initiated steps to ensure the intervention of the Union Government at the temple. This time, CPI(M) government concern was only at smuggling out gold from the temple. The government is taking revenge upon the devotees after the gold theft was exposed,’’ he said.",
  "summary": "",
  "published": "Thu, 20 Nov 2025 02:35:36 +0000",
  "url": "https://indianexpress.com/article/india/resources-at-breaking-point-kerala-hc-caps-sabarimala-pilgrims-number-at-75000-a-day-10375201/",
  "source": "India | The Indian Express"
}