{
  "title": "Is this the end of Maoists? Telangana DGP offers perspective on what Madvi Hidma’s killing means",
  "text": "The death of Madvi Hidma (51), the most wanted leader left within the Naxal ranks and the man responsible for some of the bloodiest attacks on security forces, in Andhra Pradesh on Tuesday, is a deadly final blow to the Maoists”, Telangana Director General of Police B Shivadhar Reddy believes.\n\nSpeaking to The Indian Express, Reddy said, “The Maoist movement can be considered over now because he was the last recognised leader. Hidma may not be known in other parts of the country, but he had Chhattisgarh, especially Bastar, under his control, and his death means the end of Maoists in the state. There are no other leaders worthy of mention, and cadres are jumping ship. We can say that Hidma’s death finally ends the Maoists in India.”\n\nReddy, who headed the Special Intelligence Branch (SIB) in undivided Andhra Pradesh, worked along with other officers to infiltrate the Maoist movement in his state and decimated it, forcing top leaders to flee to Odisha, Chhattisgarh or Jharkhand.\n\nReddy was Deputy Inspector General of SIB in 2011 when the lowest number of deaths and offences related to left-wing violence were registered after 30 years of fighting the insurgency – just seven civilian deaths and no police casualties. A total of 41 left-wing violence cases were registered that year, the lowest since 1980 when left-wing violence started to drastically rise in the state.\n\nSince 2011, the Maoist movement has gradually faded in Andhra Pradesh and Telangana. “Maoists are already finished in Telangana and Andhra Pradesh. They are done in Odisha and other states, and now that Hidma is dead, Chhattisgarh is also rid of it. The ideology has completely failed,” the DGP said.\n\n“Some lower-rung leaders and cadres are sneaking into Andhra Pradesh or Telangana. They cannot survive in villages, towns or cities because they are only accustomed to living the jungle life… They will be easily identified and caught. The Andhra Pradesh police is rounding up all lower-rung leaders and cadres. This is the end of the Maoist movement as we know it,” he said.\n\nCrippling blows\n\nStory continues below this ad\n\nOn Wednesday morning, Andhra Pradesh SIB chief and IGP P H Ramkrishna said that various agencies headed by the Organisation for Counter Terrorist Operations or Octopus conducted a massive crackdown on Maoists hiding in the state after fleeing from Chhattisgarh. “In one of the most comprehensive and intelligence-driven anti-Maoist crackdowns in recent years, the Andhra Pradesh police have arrested 50 CPI (Maoist) operatives across Krishna, Eluru, NTR Vijayawada, Kakinada and Dr B R Ambedkar Konaseema districts, delivering a major blow to the organisation’s South Bastar and Dandakaranya networks. The detained individuals include senior Maoist leaders, logistics experts, communication operatives, armed platoon members and party members, many of whom were closely associated with Madvi Hidma,” he said.\n\nThis intelligence-led, multi-agency operation – described by officials as “pinpoint, silent and coordinated” – was planned and executed through a joint effort of the State Intelligence Department, the Commissioner of Police, Vijayawada, and the District SPs of Krishna, Eluru, Kakinada and Konaseema.\n\nThe arrested Maoist had fled from Chhattisgarh and, after crossing into Andhra Pradesh, they sought temporary shelter in urban areas to regroup, rebuild their command structures and devise their next operational strategies – a plan disrupted by the coordinated action of AP police, as per Additional DGP (Intelligence) Mahesh Kumar Laddha.\n\nThe operation also resulted in the apprehension of a high-value cluster of Divisional Committee Members (DVCMs) – the most crucial operational tier in the CPI (Maoist) hierarchy responsible for directing armed actions, recruitment, logistics, supply chains, IED deployment and cross-border cadre movement.\n\nThose arrested include:\n\nStory continues below this ad\n\nSodi Lakma alias Bhima, DVCM of the Jagargonda Area Committee, a key commander involved in coordinating armed squads across the Sukma–Jagargonda axis.\n\nGangi Lakshmi alias Maade, DVCM attached to Kerlapal AC under the Dharba Division, known for handling transit routes and support nodes.\n\nSode Manila, DVCM functioning as in-charge of Pamed AC, SBT DVC (South Bastar Divisional Committee) and the Dandakaranya Special Zonal Committee (DKSZC), one of the most strategically important roles in the entire South Bastar theatre.\n\nMadakam Madan alias Madhanna alias Jaggu alias Lakhma, a senior DVCM overseeing the Jagargonda AC, SBT DVC and DKSZC, effectively controlling the operational heartline from Jagargonda to Kistaram.\n\nMadavi Handha, DVCM from the Communication & CyPC Team of the SBT DVC, responsible for secure messaging, information flow and technical coordination within the battalion framework.\n\nCollectively, this group of DVCMs represents the core of the Maoist divisional command apparatus, and their simultaneous arrest cripples multiple Area Committees, disrupts inter-district linkages, and delivers one of the most devastating organisational setbacks to CPI (Maoist) in the Dandakaranya region in recent years, officials said.",
  "summary": "",
  "published": "Wed, 19 Nov 2025 10:34:47 +0000",
  "url": "https://indianexpress.com/article/india/end-maoists-telangana-dgp-offers-perspective-madvi-hidma-killing-means-10374322/",
  "source": "India | The Indian Express"
}