{
  "title": "Las Vegas Grand Prix: What to know ahead of the F1 weekend",
  "text": "Open Extended Reactions\n\nLas Vegas first hosted a grand prix in 1981 for two years. Jakub Porzycki/NurPhoto via Getty Images\n\nLAS VEGAS.\n\nIt's the third grand prix in the Mojave Desert in this format, and last year's race saw Max Verstappen celebrate his fourth F1 world title.\n\nThe title race is closer this year, with Verstappen and Oscar Piastri looking to prevent leader Lando Norris winning his first F1 world championship.\n\nHere's what's to come this weekend...\n\nWeather forecast - cooler temps\n\nThe time zone shift means locally, the race weekend starts a day earlier than usual, with practice on Thursday night and the race on Saturday night (local time).\n\nCooler temperatures are forecast, with daytime highs of 14°C (58°F) on Thursday and Friday -- rising to 18°C (64°F) on Saturday -- and nighttime temperatures dropping to about 12°C (53°F).\n\nThursday and Friday evening could also see some light rain in the desert, as Saturday looks set to be dry.\n\nJump to: Circuit history & stats | How to watch | Championship standings\n\nLando Norris is 24 points ahead of his McLaren teammate Oscar Piastri with three races to go. Kym Illman/Getty Images\n\nThis week's must-read\n\nF1 TITLE: Where can the title be decided? Qatar or Abu Dhabi... Everything you need to know about the drivers' championship and who can win it.\n\nLISTEN TO 'UNLAPPED' Nate Saunders and Laurence Edmondson geek out about Formula 1 and the personalities behind it on \"Unlapped,\" ESPN's weekly F1 podcast. Listen to 'Unlapped'\n\nHAKKINEN JOINS MCLAREN.: Ella Hakkinen, the daughter of two-time Formula 1 world champion Mika, has been added to McLaren's driver development programme as the team ramps up its commitment to female talent.\n\nF1 ACADEMY: F1 teams have signed a new deal committing to F1 Academy, with Cadillac to join from 2027.\n\nARCHIVES: Looking back at the closest F1 titles, which ones were the closest battles?\n\nAUDI, 2026: Audi revealed its F1 design concept for its debut in 2026.\n\nUNLAPPED: For more analysis, listen to the latest episode of ESPN's F1 podcast Unlapped with F1 writers Nate Saunders and Laurence Edmondson.\n\nHow the championship looks\n\nLando Norris leads by 24 points ahead of his teammate, Oscar Pistri.\n\nMax Verstappen trails by 49 points behind Norris, and 25 points behind Piastri.\n\nAs for a breakdown of podiums and wins, this is how it looks for the top three:\n\nNorris (390 pts) - 17 podiums, 7 wins Piastri (366 pts) - 14 podiums, 7 wins Verstappen (341 pts) - 12 podiums, 5 wins.\n\n- How many points for a race win? How the points system works\n\n- Permutations: Where can the title be decided?\n\nThe Las Vegas circuit takes in the city's famous landmarks, like the Strip, the Sphere and passes well-known hotels and casinos. Sam Bloxham/LAT Images\n\nCircuit stats and history\n\nLas Vegas first held a Formula 1 grand prix in 1981 for two years before withdrawing. It was known as the Caesars Palace Grand Prix and it ran around the huge car park of the casino hotel.\n\nThe race wasn't a success and the idea was shelved until recent years when F1's new owners, Liberty Media, picked up the idea to build upon F1's exposure in the U.S.\n\nThe race returned to the F1 calendar in 2023 and cost around $500 million. The street circuit is one of few night races on the calendar, and includes the city's famous Strip and different landmarks around the city, such as the Bellagio and the Sphere.\n\nCircuit: Las Vegas Strip Circuit; Las Vegas, Nevada\n\nFirst F1 race: 2023\n\nLap record: 1:34.876, Norris (2024)\n\nLaps: 50 laps of 6.2km\n\nPrevious winners: Verstappen (2023), George Russell (2024)\n\nPrevious pole sitters: Charles Leclerc (2023), Russell (2024)\n\nWhat makes it special: F1's newest and flashiest street race, featuring one of the most famous backdrops in the world. American sporting pizazz meets motor racing. This is not just about the spectacle, the Vegas circuit is also great for racing, an unexpected bonus for the event now considered to be the jewel in F1's crown.\n\nWhat the drivers say about it: \"It's Vegas, baby. This one's all about the spectacle.\" -- Logan Sargeant\n\nMax Verstappen won his fourth world title at the Las Vegas Grand Prix. Mark Thompson/Getty Images\n\nWhat happened last year?\n\nMax Verstappen won his fourth world title as George Russell led a one-two with Lewis Hamilton for Mercedes. Verstappen only had to finish ahead of Lando Norris to clinch the drivers' championship. He finished fifth, one place ahead of Norris who took the extra point for fastest lap.\n\nHamilton finished 7.5 seconds behind Russell after charging from 10th on the grid, while Carlos Sainz finished third.\n\nHow to watch the GP\n\nFor fans in the U.S. only, watch live on ESPN and ESPN+ -- view the schedule.\n\nIn the UK, live broadcast coverage is on Sky Sports F1 and BBC Radio 5 Live, with highlights on Channel 4.\n\nFor news, analysis and updates, follow the coverage with ESPN's F1 team Nate Saunders and Laurence Edmondson in Las Vegas and on social media.\n\nSession times below in GMT (Greenwich Mean Time). Local time is (PST) Pacific Standard Time (GMT-8 hours).\n\nFriday\n\nFree practice one: 00:30-01:30 GMT\n\nFree practice two: 04:00-05:00 GMT\n\nSaturday\n\nFree practice three: 00:30-01:30 GMT\n\nQualifying: 04:00-05:00 GMT\n\nSunday\n\nRace starts: 04:00 GMT (live text commentary build-up from 03:30 GMT on ESPN.co.uk/F1).\n\n- Standings | Calendar | Teams\n\n- 2025 F1 circuits: Their history, stats and why they're special\n\n- Key facts on drivers, teams, venues, more\n\n- Reasons to root for each F1 driver, questions for every team\n\n- Meet the rookies: What to expect from F1's Class of 2025",
  "summary": "With three races remaining of the 2025 season, Formula 1 heads to Las Vegas for the third edition of the glitzy grand prix. Find out all the timings, stats and information for the weekend.",
  "published": "Thu, 20 Nov 2025 22:54:43 EST",
  "url": "https://www.espn.com/f1/story/_/id/47021555/las-vegas-grand-prix-f1-s-how-watch-stats-facts",
  "source": "www.espn.com - TOP"
}