{
  "title": "South India Weather, Politics LIVE updates: ED raids former MLA’s home; Ex-TDB chief arrested in Sabarimala gold theft case",
  "text": "IMD predicts moderate rain in Tamil Nadu\n\nTamil Nadu, Kerala Weather: While a severe cold wave is sweeping west, central & adjoining east India, the southern part of India is being lashed by rain with heavy rain alerts issued in 10 Tamil Nadu districts on Friday, November 21. parts of Kerala are also likely to receive heavy rainfall today. Thunderstorm and lightning is likely over coastal Andhra Pradesh and Yanam and heavy rainfall, induced by a depression over the Bay of Bengal, is likely next week.\n\nSabarimala gold theft case: Former president of the Travancore Devaswom Board (TDB) A Padmakumar was arrested on November 20 in the Sabarimala gold theft case. The arrest of leader of the ruling CPI(M) could be a major blow to the party, which is contesting the local body polls next month.\n\nStory continues below this ad Enforcement Directorate raids against former MLA: The ED is conducting raids at the residence of former MLA PV Anvar and others over alleged fraud after taking a loan of Rs 12 crore from Kerala Financial Corporation. The case is related to allegations of loans allegedly sanctioned illegally by the Kerala Financial Corporation in 2015. The alleged fraud led to a loss of Rs 22.31 crore. Live Updates Nov 21, 2025 11:43 AM IST President Droupadi Murmu visits Sri Venkateswara Swamy Temple Tirumala, Andhra Pradesh: President Drapadi Murmu visits Sri Venkateswara Swamy Temple in Andhra Pradesh's Tirumala Nov 21, 2025 11:39 AM IST ED raids against ex-MLA Anvar, others KOCHI: (Nov 21) The Enforcement Directorate on Friday raided the premises of former MLA P V Anvar and some others in Kerala as part of an alleged loan 'fraud' linked money laundering investigation, official sources said. The case pertains to alleged fraudulent loans sanctioned by the Kerala Financial Corporation in 2015 leading to a loss of Rs 22.31 crore. The ED is examining disproportionate assets, suspected benami holdings, diversion of funds into real-estate projects, and other unaccounted investments to trace the laundering trail, the sources said.",
  "summary": "",
  "published": "Fri, 21 Nov 2025 05:53:58 +0000",
  "url": "https://indianexpress.com/article/india/south-india-news-live-updates-imd-rain-tamil-nadu-kerala-karnataka-andhra-sabarimala-gold-theft-10377724/",
  "source": "India | The Indian Express"
}