{
  "title": "Darnold: Seattle's NFL-high 20 TO's 'unacceptable'",
  "text": "Open Extended Reactions\n\nRENTON, Wash. -- Sam Darnold's four-interception performance last Sunday marked his worst game of what has otherwise been a strong debut season with the Seattle Seahawks. But it also continued an unwanted trend for the Seahawks and their Pro Bowl quarterback.\n\nDespite ranking sixth in scoring at 26.6 points per game, Seattle's offense has turned the ball over 12 times over the past four weeks. As a team, the Seahawks lead the NFL with 20 giveaways.\n\n\"It's unacceptable,\" Darnold said Thursday of their recent turnover spate. \"We understand as an offense, we have to be better, I have to be better, protecting the football. We're doing everything that we can in practice and when the game comes to try to take care of the football a little bit better.\"\n\nOne of the Seahawks' 20 turnovers actually came on defense, when safety Coby Bryant fumbled the ball back to the Arizona Cardinals while returning an interception. Fourteen of the other 19 have been attributed to Darnold, who has thrown 10 interceptions to 17 touchdown passes and lost four fumbles.\n\nA few of the turnovers on Darnold's ledger weren't entirely his fault, including one interception that deflected off a teammate's helmet amid a collapsing pocket and a fumble that came on a botched snap from a backup center. But there was nothing fluky about the four picks he threw in the Seahawks' 21-19 loss to the Los Angeles Rams on Sunday.\n\nAsked what he noticed after rewatching that performance, Darnold said he needed to do a better job of recognizing the Rams' shell coverage and moving on in his progressions as opposed to locking onto one or two receivers. He credited Los Angeles for disguising certain defensive looks.\n\n\"Just having a better understanding when the ball's snapped [of] what the coverage is and when a guy is going to come open and when he's not,\" Darnold said. \"When I say 'get stuck on a progression,' I mean just seeing one side of the field and feeling like there's a chance that someone's going to get open over there rather than just moving on and clicking through my progression as I normally do.\"\n\nIt was the third four-interception game in Darnold's eight-year career, and his first since 2019 with the New York Jets. After Seattle's loss to the Rams, wide receiver Cooper Kupp credited Darnold for remaining steady despite the interceptions and leading a late drive that gave the Seahawks a chance at a winning field goal from 61 yards.\n\nFourteen of the Seahawks' NFL-worst 20 turnovers have been attributed to Sam Darnold, including 10 interceptions and four fumbles. Jayne Kamin-Oncea-Imagn Images\n\n\"Things are going to happen throughout the course of a game,\" Darnold said. \"Obviously, you'd love for those things not to happen, negative plays, but that's football sometimes. For me, I just have to have a mentality of moving onto the next play because there's nothing I can do once I throw an interception or fumble ... so it's about moving on as fast as I can, understanding why I messed up ... and just being able to move on. I felt like I did a pretty good job of that in L.A. It obviously didn't go the way I wanted it to and the mistakes kept happening, but I felt like when I did make mistakes, I was able to just move on the way I normally do.\"\n\nDarnold ranks fourth in Total QBR at 71.2. He entered Week 11 as the NFL's leader in that metric at 77.8. That served as context for linebacker Ernest Jones IV ardently defending Darnold on Sunday, saying, \"Sam's been balling,\" and that he shouldn't be defined by one performance because \"he's had us in every f---ing game.\"\n\n\"We've got his back,\" Jones said, \"and if you've got anything to say, quite frankly, f--- you.\"\n\nCoach Mike Macdonald said a day later that Jones spoke for the entire team. Darnold said Thursday that he appreciated the support.\n\n\"When things don't necessarily go the way that I've wanted them to, especially on game day, the reason that it sucks for me is I feel like I'm letting those guys down,\" he said, \"and I feel like a lot of guys in the locker room feel the same way. That energy and the things that he said, it meant a lot to me for a guy to have my back like that. But I know the guys are just going to fight no matter what the case is, and so I'm going to do everything that I can to put by best foot forward and go execute at a high level.\"",
  "summary": "Seahawks quarterback Sam Darnold says he understands he and the team have to be better protecting the ball after a four-week stretch in which they've committed 12 turnovers, bringing their NFL-worst total to 20.",
  "published": "Thu, 20 Nov 2025 23:07:46 EST",
  "url": "https://www.espn.com/nfl/story/_/id/47041061/darnold-says-seahawks-nfl-worst-20-turnovers-unacceptable",
  "source": "www.espn.com - TOP"
}