{
  "title": "A new cafe in Bastar will bring ex-Maoists and victims of Naxal violence together",
  "text": "At Jagdalpur city in Chhattisgarh’s Bastar district, a new cafe is set to be launched on Monday that authorities believe will be a beacon of hope in a region that has long been mired in conflict.\n\nThe cafe is no ordinary one. Named “Pandum Cafe”, it will employ people from families that have suffered from Maoist violence, as well as former Maoists who have surrendered. It is an initiative of the government’s Surrender and Rehabilitation Policy.\n\nThe Bastar region has been the epicentre of Left Wing Extremism in Chhattisgarh for decades. However, over the last two years, the Maoist movement has suffered severe setbacks, with over 450 cadres gunned down in intensified security operations and the surrender of hundreds, including top leaders. The last two years have also seen over 100 civilians killed in Maoist violence.\n\nThe cafe is no ordinary one. Named “Pandum Cafe”, it will employ people from families that have suffered from Maoist violence, as well as former Maoists who have surrendered. The cafe is no ordinary one. Named “Pandum Cafe”, it will employ people from families that have suffered from Maoist violence, as well as former Maoists who have surrendered.\n\nIn this context, the cafe is not merely a means of livelihood, said Inspector General of Police, Bastar Range, Sundarraj P. “The objective of this cafe is not merely livelihood generation, but also to demonstrate that transformation is possible when opportunities and guidance are provided — showing that hands once engaged in conflict can now contribute to community building,” he said.\n\nAccording to officials, the employees of the cafe — surrendered Maoists and victims of Maoist violence — have been trained in hospitality services, café management, customer handling, hygiene standards, food safety, and entrepreneurship skills.\n\nThe cafe is no ordinary one. Named “Pandum Cafe”, it will employ people from families that have suffered from Maoist violence, as well as former Maoists who have surrendered. The cafe is no ordinary one. Named “Pandum Cafe”, it will employ people from families that have suffered from Maoist violence, as well as former Maoists who have surrendered.\n\n“The inauguration of Pandum Cafe will mark a new chapter of hope and rehabilitation in Bastar,” said IG Sundarraj.\n\nUnder the government’s Surrender and Rehabilitation Policy, officials said the initiative is part of efforts to provide dignified and sustainable livelihoods to surrendered Maoist cadres who have chosen to rejoin mainstream society. Victims of Maoist violence will also be active partners in the cafe, contributing towards the rehabilitation and reintegration of surrendered Maoists into the social mainstream, officials said.",
  "summary": "",
  "published": "Mon, 17 Nov 2025 01:30:41 +0000",
  "url": "https://indianexpress.com/article/india/new-cafe-in-bastar-brings-ex-maoists-their-victims-together-in-latest-rehabilitation-effort-10369618/",
  "source": "India | The Indian Express"
}