{
  "title": "Flipkart, Zomato, Blinkit among 26 leading e-commerce platforms to declare confirming compliance with dark patterns norms",
  "text": "The Union Ministry of Consumer Affairs, Food and Public Distribution said Thursday that 26 leading e-commerce platforms have voluntarily submitted self-declaration letters confirming compliance with the Guidelines for Prevention and Regulation of Dark Patterns, 2023.\n\nAmong the 26 e-commerce platforms that have voluntarily submitted self-declarations are Flipkart, Meesho, Reliance Digital, JioMart, Hemleys, Zomato, Blinkit, and Ajio.\n\nIn a statement, the Ministry said, “This development marks a significant milestone in India’s efforts to curb deceptive online design practices that mislead or manipulate consumers.”\n\nStory continues below this ad\n\n“These platforms have conducted internal self-audits or third-party audits to identify, assess and eliminate any presence of dark patterns. All 26 companies have declared that their platforms are free from dark patterns and do not deploy any manipulative user interface designs,” the ministry said.\n\n“The proactive industry-wide compliance demonstrates a strong commitment towards consumer transparency, fair trade practices, and ethical digital ecosystems. This voluntary alignment underscores the fact that consumer protection and business growth can go hand-in-hand, strengthening brand trust and long-term credibility,” it said.\n\nOn November 30, 2023, the government released Guidelines for Prevention and Regulation of Dark Patterns. The guidelines define dark patterns as “any practices or deceptive design pattern using user interface or user experience interactions on any platform that is designed to mislead or trick users to do something they originally did not intend or want to do, by subverting or impairing the consumer autonomy, decision making or choice, amounting to misleading advertisement or unfair trade practice or violation of consumer rights.”\n\nThe guidelines identify and prohibit 13 dark patterns: false urgency, basket sneaking, confirm shaming, forced action, subscription trap, interface interference, bait and switch, drip pricing, disguised advertisements, nagging, trick wording, SaaS billing, and rogue malware.\n\nStory continues below this ad\n\nThe Central Consumer Protection Authority (CCPA), the country’s top consumer watchdog, has appreciated these declarations, terming them exemplary and encouraging other companies to adopt similar self-regulation.\n\n“The CCPA strongly urges all other e-commerce platforms, marketplace entities, service providers, and app developers to follow the example set by these companies. Every business operating in India’s digital space must recognise that manipulative practices are short-sighted strategies that harm both consumers and businesses in the long run,” the ministry said in its statement.\n\n“Through the National Consumer Helpline (NCH), social media campaigns, informative videos, and outreach programmes, consumers have been educated about identifying dark patterns and reporting them. Such complaints are being systematically addressed, and enforcement action is being contemplated wherever necessary. The CCPA has reaffirmed that it is maintaining a close watch on potential violations and will not hesitate to act against errant platforms,” it said.",
  "summary": "",
  "published": "Thu, 20 Nov 2025 08:31:45 +0000",
  "url": "https://indianexpress.com/article/india/flipkart-zomato-blinkit-leading-e-commerce-platforms-declare-compliance-dark-patterns-norms-10376015/",
  "source": "India | The Indian Express"
}