{
  "title": "Kerala BLO dies by suicide, unions announce SIR work boycott today",
  "text": "A booth level officer (BLO) deployed by the Election Commission of India for the ongoing Special Intensive Revision (SIR) of electoral rolls in Kerala died by suicide Sunday. Later, a body of state government employees and two other organisations said BLOs would abstain from work on Monday.\n\nThe family of 44-year-old Aneesh George from Kannur claimed that he was facing pressure in his efforts to complete his duties in the SIR process within the stipulated time.\n\nGeorge, who worked as an office assistant at a government-aided upper primary school in Kannur district, was found dead at his house on Sunday.\n\nKerala Chief Electoral Officer Dr Rathan U Kelkar said, “We are awaiting a report from the District Collector, Kannur, in this regard. We will react after getting the report from the Collector.”\n\nGeorge was assigned the 18th booth under Payyannur Assembly constituency. His family friend and neighbour, Thamban, said George had been under strain regarding completing the SIR process.\n\n“He had shared his concerns with others. Aneesh was not familiar with the booth that was assigned to him. Hence, he had been facing difficulties in distributing enumeration forms to voters,” Thamban said.\n\nAnother of his friends, Shiju, also told the media that booth level agents (BLAs) of political parties did not accompany the BLO. “He had sought the help of BLAs of Congress and CPI(M). When the CPI(M) BLA failed to turn up, he was instructed not to go with the Congress BLA. He was tense as he could not complete the distribution of the enumeration forms on time,” he said.\n\nStory continues below this ad\n\nHowever, T Manoharan, Assistant Electoral Registration Officer of Payyanur constituency, said George had to distribute forms to 1,065 voters and as of Saturday, he had distributed 878 forms. This meant that only a small portion of the task remained. “I cannot comment on whether he was under pressure or not. His suicide has been reported to the higher-ups,” said the officer.\n\nLater on Sunday, the Action Council of State Government Employees and Teachers, the Joint Committee of Teacher Service Organisations, and the Kerala NGO Association announced that BLOs would abstain from work on Monday. Joint protest marches to the office of the Kerala Chief Electoral Officer and to collectorates in all districts are also planned.\n\nThe organisations alleged that BLOs are under severe pressure due to the SIR process and duties related to the upcoming local body elections, which will be held on December 9 and 11. They said that although political parties and service organisations had demanded that the SIR be postponed, the Election Commission refused. “Instead, it imposed an unrealistic workload with high targets in a very short period. This pressure is pushing BLOs toward suicide,” they said in a statement.\n\nBoth the CPI(M) and Congress have come out against the ECI over the death of the BLO. CPI(M) Kannur district secretary M V Jayarajan said the incident was unfortunate and that BLOs are facing tremendous pressure. “We had asked the Election Commission to postpone the SIR till the elections to the local bodies are over. However, the ECI took a unilateral decision,” he said.\n\nStory continues below this ad\n\nCongress’s Kannur district president Martin George sought a detailed probe into the incident. “We have also sought the postponement of SIR. BLOs have to be helped by the booth level agents of political parties. Since local body elections are slated for next month, local-level political leaders are fully engaged with campaigning. We have learned that the BLO had faced a threat from CPI(M). Let there be a probe into the incident. BLOs are facing immense pressure,” he said.\n\nAs per ECI data, enumeration forms have reached 93% of voters. The distribution of the forms began on November 4, and the BLOs have been told to complete the process by December 4. The ECI and the State Election Commission, which is conducting the local body elections, have reached a consensus to ensure that BLOs involved in the SIR are exempted from duties related to local body polls.\n\nWith PTI inputs",
  "summary": "",
  "published": "Sun, 16 Nov 2025 12:20:37 +0000",
  "url": "https://indianexpress.com/article/india/blo-dies-suicide-kerala-family-blames-sir-pressure-10369318/",
  "source": "India | The Indian Express"
}