{
  "title": "Blocking one enzyme may break the link between alcohol and liver disease",
  "text": "Scientists have identified an unexpected link between the way the body processes sugar and the development of alcohol addiction. This connection also points to a promising therapeutic target for treating alcohol-associated liver disease (ALD) and alcohol use disorder (AUD).\n\nA study published in Nature Metabolism by researchers at the University of Colorado Anschutz reports that alcohol activates a metabolic pathway that causes the body to produce fructose internally. Fructose is the same sugar found in many sweetened foods and drinks. This internal production relies on an enzyme called ketohexokinase (KHK), which appears to strengthen alcohol-seeking behavior while also contributing to liver damage.\n\nBlocking KHK Reduces Drinking and Liver Injury\n\nExperiments in mice showed that animals lacking KHK had a noticeably lower interest in alcohol. They consumed less in voluntary drinking tests, performed differently in reward-based experiments, and showed reduced activity in brain regions associated with addictive behavior.\n\nThe study also found that liver injury caused by alcohol did not develop when KHK was disrupted through genetic methods or medication. These mice had less fat buildup, less inflammation, and less scarring in their livers. The findings suggest that limiting fructose metabolism could slow or even prevent the progression of alcohol-related liver disease.\n\nBreaking the Cycle Between Sugar and Alcohol\n\n\"Our findings show that alcohol doesn't just damage the liver directly, it hijacks the body's sugar metabolism in a way that enhances drinking behavior and worsens liver injury,\" said Miguel A. Lanaspa, DVM, PhD, associate research professor at CU Anschutz and senior author. \"By targeting fructose metabolism, we may be able to break this cycle and develop new treatments for both alcohol addiction and liver disease.\"\n\nBecause alcohol-associated liver disease and metabolic dysfunction-associated steatotic liver disease (MASLD) rely on similar fructose-driven processes, the researchers suggest that treatments aimed at blocking fructose metabolism could help people with liver disease related to either alcohol or diet.\n\nA Shared Metabolic Pathway for Liver Damage\n\n\"This discovery highlights an unexpected intersection between sugar and alcohol metabolism,\" said Richard Johnson, MD, professor at CU Anschutz and study co-author. \"It opens exciting possibilities for developing treatments that target a common pathway underlying both metabolic and alcohol-related liver diseases.\"\n\nThe results offer a promising new direction for tackling alcohol addiction and liver disease, two conditions with limited effective treatment options.",
  "summary": "Scientists discovered that alcohol activates a sugar-producing pathway in the body, creating fructose that may reinforce addictive drinking. The enzyme responsible, KHK, appears to drive both alcohol cravings and liver injury. When this enzyme was blocked in mice, their drinking decreased and their livers showed far less damage.",
  "published": "Tue, 18 Nov 2025 03:43:32 EST",
  "url": "https://www.sciencedaily.com/releases/2025/11/251118033447.htm",
  "source": "All Top News -- ScienceDaily"
}