{
  "title": "Zelensky ready for 'honest work' with US to end Ukraine war",
  "text": "Zelensky ready for 'honest work' with US to end Ukraine war\n\n20 minutes ago Share Save Laura Gozzi and James Chater Share Save\n\nGetty Images Zelensky's office said the US believed the draft plan could \"help reinvigorate diplomacy\"\n\nUkrainian President Volodymyr Zelensky says he is ready for \"honest work\" with the US after receiving a draft peace plan to end the war with Russia. Several US media outlets report that under the plan, Kyiv would give up areas of the Donbas in eastern Ukraine that it still controls, cut the size of its army, and pledge not to join Nato. It was unclear how involved Ukraine has been in drafting the plan, but White House Press Secretary Karoline Leavitt said the US had engaged \"equally with both sides\". In a separate statement, Zelensky's office said that Ukraine had \"agreed to work on the plan's provisions in a way that would bring about a just end to the war\".\n\nAccording to a draft of the plan, which has been published in full by the Financial Times and Axios, Ukraine's military will be limited to 600,000 personnel, but European fighter jets will be stationed in Poland. It states that Kyiv will receive \"reliable security guarantees\", although further details are not given. The draft also says Russia will be \"reintegrated into the global economy\", through the lifting of sanctions and by inviting Russia to rejoin the G7 - a forum of the world's most powerful countries - making it the G8 again. If confirmed in full, the demands in the plan would appear to favour Moscow's interests. Zelensky said he expected to speak with US President Donald Trump in the coming days about the proposals, which also include plans for Ukraine to forgo many of its weapons. But in a press briefing at the White House, Leavitt rejected suggestions that the plan demanded major concessions from Ukraine, and said the US president \"supports\" it. US special envoy Steve Witkoff and US Secretary of State Marco Rubio had been working on a proposal quietly for about a month, and had engaged both sides \"to understand what these countries would commit to in order to see a lasting and durable peace\", Leavitt said. \"It's a good plan for both Russia and Ukraine,\" she added, without providing further details. \"We believe that it should be acceptable to both sides. And we're working very hard to get it done.\" An unnamed senior US official told CBS News that the plan \"was drawn up immediately following discussions with one of the most senior members of President Zelensky's administration, Rustem Umerov, who agreed to the majority of the plan, after making several modifications, and presented it to President Zelensky\".",
  "summary": "Kyiv says it is willing to engage with a US-backed draft peace plan aimed at ending the war with Russia.",
  "published": "Fri, 21 Nov 2025 05:55:51 GMT",
  "url": "https://www.bbc.com/news/articles/cly1ypqlle0o?at_medium=RSS&at_campaign=rss",
  "source": "BBC News"
}