{
  "title": "Dancing brainwaves: How sound reshapes your brain networks in real time",
  "text": "What happens inside your brain when you hear a steady rhythm or musical tone? According to a new study from Aarhus University and the University of Oxford, your brain doesn't just hear it -- it reorganizes itself in real time.\n\nEvery beep, tone and new sound you hear travels from the ear to registering in your brain. But what actually happens in your brain when you listen to a continuous stream of sounds? A new study from Aarhus University and University of Oxford published in Advanced Science reveals that the brain doesn't simply register sound: it dynamically reshapes its organization in real time, orchestrating a complex interplay of brainwaves in multiple networks.\n\nThe research, led by Dr. Mattia Rosso and Associate Professor Leonardo Bonetti at the Center for Music in the Brain, Aarhus University, in collaboration with the University of Oxford, introduces a novel neuroimaging method called FREQ-NESS -- Frequency-resolved Network Estimation via Source Separation. Using advanced algorithms, this method disentangles overlapping brain networks based on their dominant frequency. Once a network is identified by its unique frequency, the method can then trace how it propagates in space across the brain.\n\n\"We're used to thinking of brainwaves like fixed stations -- alpha, beta, gamma -- and of brain anatomy as a set of distinct regions,\" says Dr. Rosso. \"But what we see with FREQ-NESS is much richer. It is long known that brain activity is organized through activity in different frequencies, tuned both internally and to the environment. Starting from this fundamental principle, we've designed a method that finds how each frequency is expressed across the brain.\"\n\nOpens the door to precise brain mapping\n\nThe development of FREQ-NESS represents a major advance in how scientists can investigate the brain's large-scale dynamics. Unlike traditional methods that rely on predefined frequency bands or regions of interest, the data-driven approach maps the whole brain's internal organization with high spectral and spatial precision. And that opens new possibilities for basic neuroscience, brain-computer interfaces, and clinical diagnostics.\n\nThis study adds to a growing body of research exploring how the brain's rhythmic structure shapes everything from music cognition to general perception and attention, and altered states of consciousness.\n\n\"The brain doesn't just react: it reconfigures. And now we can see it,\" says Professor Leonardo Bonetti, co-author and neuroscientist at Center for Music in the Brain, Aarhus University, and at the Centre for Eudaimonia and Human Flourishing, University of Oxford. \"This could change how we study brain responses to music and beyond, including consciousness, mind-wandering, and broader interactions with the external world.\"\n\nA large-scale research program is now underway to build on this methodology, supported by an international network of neuroscientists. Due to the high reliability across experimental conditions and across datasets -- FREQ-NESS might also pave the way for individualized brain mapping, explains Professor Leonardo Bonetti.",
  "summary": "What happens inside your brain when you hear a steady rhythm or musical tone? According to a new study, your brain doesn't just hear it -- it reorganizes itself in real time.",
  "published": "Mon, 02 Jun 2025 15:50:01 EDT",
  "url": "https://www.sciencedaily.com/releases/2025/06/250602155001.htm",
  "source": "Latest Science News -- ScienceDaily"
}