{
  "title": "Curaçao to Cape Verde: Small nations make big World Cup history",
  "text": "Curaçao to Cape Verde: Small nations make big World Cup history\n\ntoggle caption Angel Batta/AFP via Getty images\n\nBOGOTA, Colombia — Few stories capture the magic of next year's FIFA World Cup quite like Curaçao—a small Caribbean nation that has defied history, geography, and every expectation to reach the biggest stage in global soccer.\n\nWith 42 of the 48 spots to compete in the 2026 World Cup now filled, the tournament is already shaping up to be a historic one, with several other underdog nations defying the odds to play at the event jointly hosted by the United States, Mexico, and Canada next summer.\n\nWhile several major European, Africa and Asian soccer teams failed to qualify, including Nigeria, China, India, Greece, Serbia, and Hungary, multiple small nations have made global headlines by securing their place in next summer's competition, some for the first time.\n\nSponsor Message\n\nFrom Curaçao to Cape Verde, here is a look at some of the minnows who have earned a spot in the 2026 World Cup\n\nCuraçao\n\nUntil now, the tiny Caribbean nation of Curaçao was better known for its turquoise-blue liqueur and sun-soaked beaches than for its soccer feats. But after drawing 0–0 with Jamaica on Tuesday, the former Dutch colony set a historic record by becoming the least populous country ever to reach the FIFA World Cup.\n\nHome to roughly 150,000 people and located in the southern Caribbean just off the coast of Venezuela— it has surpassed Iceland as the smallest country to compete in the world's most prestigious soccer tournament.\n\nAs a point of comparison, the World Cup final next summer will be played at the MetLife stadium in New Jersey , which has a capacity of 82,500 – more than half of Curaçao's population.\n\nTo overcome the limitations of having a small population, Curaçao, a Dutch Caribbean nation, has mostly recruited players born in the Netherlands for its World Cup squad. The country became an autonomous territory within the Kingdom of the Netherlands in 2010 following the dissolution of the Netherlands Antilles.\n\n\"Curaçao, like quite a few examples of smaller nations, have been good at tapping into the diaspora, ringing anyone who might have a distant relative connected to their country,\" explained Carl Worswick, an independent sports journalist and soccer specialist.\n\nSponsor Message\n\nHaiti\n\nAnother underdog to reach the international tournament is Haiti, which has qualified for the first time since 1974, despite a raft of obstacles at home; the Caribbean nation is facing an acute security and humanitarian crisis which has impacted every sector of society, including football players.\n\n\"They've been living the crisis in full scale… They haven't been able to train or play in Haiti for years because of the gang violence,\" said Harold Isaac, a Haitian journalist based in Port-au-Prince.\n\nHaiti's coach since 2024, Frenchman Sebastien Migne, has never been to the country, where gangs control 90% of the capital city Port-au-Prince.\n\nGiven the turmoil that many Haitians live with, the World Cup qualification has been a glimmer of hope, according to Isaac: \"This really came as a kind of unimaginable boon, morally, for the country.\"\n\ntoggle caption Clarens Siffroy/AFP via Getty Images\n\nCape Verde\n\nCape Verde, a small Atlantic archipelago off the coast of West Africa, qualified for the World Cup for the first time last month when it beat the southern African nation of Eswatini 3-0. Before Curaçao qualified, Cape Verde had been the second-least populous country to reach the World Cup, with a population of roughly 600,000.\n\nThe former Portuguese colony has also recruited from its diaspora, with its team notably featuring Center-back Roberto Lopes, who was born in Ireland to an Irish mother and Cape Verdean father.\n\nPanama\n\nAnother small nation, Panama, will be making a return to the World Cup after its 2018 debut at the tournament.\n\nThe Central American nation of four and a half million people beat El Salvador Tuesday to earn its place in the competition. In 2018, Panama finished at the bottom of its group with zero points and will now have a chance at redemption.\n\nA key reason that several small nations in the Americas have qualified for the tournament is because Canada, Mexico and the U.S. are hosting it. As hosts, these countries automatically qualify, leaving more room for other nations in the ﻿﻿﻿Confederation of North, Central America and Caribbean Association Football to win a spot.\n\ntoggle caption Collin Reid/AP\n\nWhat's next for the minnows?\n\nWhile social media is flooded with videos of street parties and parades as countries celebrate their qualifications, the road to the World Cup is still long.\n\nSponsor Message\n\n\"I think everyone assumes that, brilliant, this can only be a good thing… but there is a lesson to be learned, it's not always positive,\" said soccer expert Worswick.\n\nHe stressed the importance of national Football Associations investing funds into their players and teams, citing high-profile scandals that have marred some countries' World Cup debuts. Worswick explained that while qualifying for the World Cup puts a country on the map, it often also brings complicated issues surrounding team finances, preparation, and pressure at home.\n\nBut for countries like Haiti, just qualifying may be enough: \"The people are suffering and they've been suffering for years,\" says Isaac, \"and they're just asking for hope, and this is what the team brought them.\"\n\n",
  "summary": "From tiny Curaçao, to troubled Haiti's remarkable comeback, discover how some of the smallest nations in the world are defying the odds to qualify for the 2026 FIFA World Cup.",
  "published": "Wed, 19 Nov 2025 15:54:16 -0500",
  "url": "https://www.npr.org/2025/11/19/nx-s1-5614157/curacao-to-cape-verde-small-nations-make-big-world-cup-history",
  "source": "NPR Topics: World"
}