{
  "title": "How a small Chicago nonprofit is resisting Trump's war on DEI",
  "text": "How a small Chicago nonprofit is resisting Trump's war on DEI\n\ntoggle caption Andrea Hsu/NPR\n\nCHICAGO — On a warm fall day, thousands of female construction workers joined a mile-long parade, joyously celebrating gains they've made in an industry still dominated by men.\n\nIt was the marquee event of the annual Tradeswomen Build Nations conference. The women marched, sang and rang cowbells, proudly sporting their union t-shirts and carrying banners announcing their trades: plumbing, pipefitting, roofing, drywall finishing and many more.\n\nLeading the parade in fluorescent vests and hardhats was a drumline made up of a dozen or so staff from the nonprofit Chicago Women in Trades.\n\n\"This is amazing to see what it has grown into,\" says Lauren Sugerman, who worked as an elevator constructor in the 1980s before spending the bulk of her career at Chicago Women in Trades. \"To see the sisterhood that has been built is so empowering.\"\n\nSponsor Message\n\nBut behind the celebration are grave concerns that the organization, which has been breaking down barriers for women in the construction industry since Ronald Reagan was president, could be brought down by President Trump.\n\nAs Trump wages a war against diversity, equity and inclusion or DEI, Chicago Women in Trades is fighting back in court, both for its own preservation and for the movement.\n\nTrump's all-out effort to end DEI\n\nHours after Trump took office, he signed a pair of executive orders cracking down on what he said was widespread and illegal use of \"dangerous, demeaning, and immoral race- and sex-based preferences.\"\n\nHis orders called on government agencies to cease DEI-related work and directed government contractors and grantees to end their programs promoting it. Trump also rescinded a 1965 executive order, signed by former President Lyndon B. Johnson, that required federal contractors and subcontractors to take proactive steps to ensure they weren't violating federal anti-discrimination laws.\n\nTrump promised a renewed emphasis on merit, replacing what he called a \"pernicious identity-based spoils system.\"\n\nHere's why that's a problem for Chicago Women in Trades: The organization was founded in 1981 in response to Johnson's executive order and a subsequent Labor Department requirement — also now gone — that federal contractors make good faith efforts to get women onto construction sites. Its stated mission is to promote diversity, equity and inclusion, including by recruiting women and helping them qualify and compete for high-wage union construction jobs.\n\nSome 70% of its participants are Black and Latina. As of January, roughly 40% of its annual budget came from U.S. Labor Department grants.\n\nSponsor Message\n\nWhat is illegal DEI? Lots of threats but no clarity\n\nWhile the loss of federal grants would be devastating, perhaps even more damaging to Chicago Women in Trades is the certification provision tucked inside one of Trump's executive orders.\n\nGoing forward, federal contractors and grantees must certify that they are not operating programs \"promoting DEI that violate any applicable Federal anti-discrimination laws.\" Anyone found to have knowingly reported false information could face steep civil and criminal penalties, according to the executive order.\n\ntoggle caption Chicago Women in Trades\n\n\"There's a lot of threats out there but no clarity on what is illegal DEI,\" says Chicago Women in Trades Executive Director Jayne Vellinga. \"It is unclear how the industry or anyone is going to respond to it.\"\n\nIt's a conundrum that puts the nonprofit in a precarious position. Chicago Women in Trades works closely with labor unions and contractors to ensure the women they recruit and train can get into apprenticeship programs to grow their careers. Would unions and contractors now sever those relationships if forced to certify that they're not engaging in illegal DEI? Without those established systems, Vellinga fears hard-won gains for women could be lost.\n\n\"We have an administration that is trying to turn back the clock on progress it has taken decades to achieve,\" says Vellinga.\n\nIn a statement to NPR, White House spokesman Kush Desai pushed back.\n\n\"Instead of DEI boondoggles that accomplish nothing, the Trump administration is laying the groundwork for Americans of all backgrounds to help build our next Golden Age,\" Desai wrote, pointing to another executive order Trump signed that aims to boost the country's skilled trades workforce. Trump has pledged to support 1 million new registered apprenticeships per year and says a plan for doing so is forthcoming.\n\nWomen-focused programs have changed lives\n\nTalk to female construction workers around Chicago and you get a sense for how Chicago Women in Trades has long worked to achieve those same goals.\n\ntoggle caption Andrea Hsu/NPR\n\nSecond-year plumbing apprentices Kaitlyn Truty, Charlie Willoughby and Juliet Silvestre credit the nonprofit with getting them into their careers.\n\n\"I 100% believe so,\" says Truty.\n\nAll three women came through the organization's free, 10-week training program, where they got an introduction to the gamut of construction trades and learned basic skills such as tool handling and blueprint reading.\n\nSponsor Message\n\n\"We had to work out as well,\" says Willoughby, recalling the morning gym sessions. As part of an assessment to enter the plumbers union, they had to lift an 80-pound box onto a shelf over their heads. Chicago Women in Trades brought in plumbers to teach them how to do it.\n\n\"It was so intimidating,\" says Truty. \"I couldn't do more than two pushups walking in, and I walked out … being able to do 50-plus pushups in one go, and I lifted that box.\"\n\nThe apprentices say having a community of women around them helped them believe that they were up to the task and prepared them for the challenges they would face as females in the industry. Even now, they say they are often the only woman on a job site.\n\n\"The people in your family don't understand what you're going through, but another tradeswoman can relate to you,\" says Silvestre. \"They understand me.\"\n\nThe carpenters union ends \"Sisters in the Brotherhood\"\n\nAlready, one building trades union has taken steps to avoid running afoul of Trump's executive orders. Earlier this year, the United Brotherhood of Carpenters, representing more than a half million workers in North America, disbanded its Sisters in the Brotherhood program.\n\nFor more than a quarter century, the program gave women carpenters a space to build networks and share ideas for how to overcome barriers. In a memo, Douglas McCarron, the union's general president, wrote that current policies targeting identity-based initiatives put the program at legal risk. It's been replaced with an engagement program, open to all members.\n\ntoggle caption Chicago Women in Trades\n\n\"It's very ironic that you can have a 'Brotherhood of Carpenters' which references brothers, but you can't have – because of DEI – a 'Sisters in the Brotherhood,'\" says Kina McAfee, a retired union carpenter who is now on staff at Chicago Women in Trades. \"I don't understand it. And it will impact our ability to get women into the trades in the future.\"\n\nSponsor Message\n\nThe union did not respond to NPR's questions about the change.\n\nAwaiting a major ruling\n\nAlready, Chicago Women in Trades' lawsuit challenging Trump's anti-DEI executive orders has brought the nonprofit some protection.\n\nIn April, U.S. District Judge Matthew Kennelly in the Northern District of Illinois preemptively blocked the termination of one of the nonprofit's federal grants.\n\nKennelly also blocked the certification provision in Trump's executive order for Labor Department contractors and grantees nationwide, after finding that Chicago Women in Trades was likely to prove it would suffer irreparable harm should the provision stand.\n\nThe Trump administration has appealed that part of Kennelly's decision to the 7th Circuit Court of Appeals. In court briefs, the administration has argued that the provision merely requires grantees to verify that they won't violate existing federal anti-discrimination laws.\n\nThe court is expected to hold a hearing on the matter, though a date has not been set.\n\nAs Vellinga awaits a ruling, she says it's hard to imagine what the future will look like.\n\n\"We feel like we're in limbo,\" she says.\n\nParticularly vexing to Vellinga is that Chicago Women in Trades is fighting this battle at a time when women still make up less than 5% of the skilled trades workforce nationwide.\n\n\"You cannot look at the workforce of the construction trades and say, 'Oh, they've taken DEI too far,'\" she says with a rueful laugh. \"You look at the workforce of the construction trades and you see we have a long way to go.\"\n\n",
  "summary": "Since 1981, Chicago Women in Trades has worked to promote equity by getting more women into the construction trades. Now the nonprofit faces a different challenge: Trump's efforts to erase DEI.",
  "published": "Wed, 19 Nov 2025 05:00:00 -0500",
  "url": "https://www.npr.org/2025/11/19/nx-s1-5611496/trump-dei-women-construction-jobs",
  "source": "NPR Topics: Business"
}