{
  "title": "The Once and Future Riot by Joe Sacco review – a masterclass in visual reportage",
  "text": "Joe Sacco is one of a very small number of graphic novelists who have smashed through into the mainstream. His masterwork is Palestine, a collected volume of single-issue comic books he created in the 1990s, documenting the violence in Gaza. His technique is to embed as a journalist in a war zone and interview people on the street, telling their stories with pictures. Lessons on global politics emerge from ultra-local conflict and depictions of day-to-day life.\n\nPalestine propelled Sacco to fame, drawing comparisons with Maus, Art Spiegelman’s two-volume saga about Polish Jews during the Holocaust with Nazis portrayed as cats, and Jews as mice. These works are sold prominently in bookshops, not in musty basements packed with racks of polyethylene-sheathed superhero comics. Alongside a couple of others, Maus and Palestine signalled that graphic novels, as they became known, could be serious works of fiction, nonfiction and journalism. Palestine itself is as depressingly relevant today as it was in the 1990s. In December 2023, it was reprinted for the first time in a decade, after selling out following the 7 October attacks.\n\nThe historical backdrop to Sacco’s work is colonialism. Just as Palestine charts the long-term ramifications of the Balfour declaration, this new book explores the legacy of the disastrous and inherently violent act of Indian partition in 1947. It’s a history told through the lens of a seemingly small-scale, parochial conflict in a very rural part of Uttar Pradesh, northern India, more than six decades after the British imposed a chaotic division of the country along very poorly devised religious lines. Lord Mountbatten, the last viceroy of British India, lacking any humility or foresight, declared: “I shall give you complete assurance. I shall see to it that there is no bloodshed and riot.”\n\nSacco’s focus is the Muzaffarnagar riots of 2013, but he spends time documenting the history of the region and the tensions that foreshadowed them. Their exact cause is disputed: a Jat Hindu woman was “eve-teased” – a grim euphemism for public sexual harassment – by a Muslim man, who was then killed by her brothers, who were subsequently killed themselves. Or was it a traffic incident that spiralled into sectarian scrapping, escalating into murder by rampaging gangs?\n\nIf the trigger remains a mystery, the outcome is well documented: clashes between two communities, dozens killed, hundreds injured and tens of thousands displaced. At every juncture, politicians and religious leaders fail to maintain peace and control.\n\nView image in fullscreen A page from The Once and Future Riot. Photograph: The Once and Future Riot by Joe Sacco (Jonathan Cape, £20).\n\nAnd so this becomes a story of the uneasy relationship between democracy and sectarian politics, and the brutality that constantly lurks in the shadows. It charts how rumour and misinformation fuel chaos – a video on Facebook purporting to show a local Jat boy being lynched was pivotal in igniting feverish violence, though it turned out to be years old and from Afghanistan.\n\nThe riots lasted a few days, with the army eventually brought in to quell the violence. Sacco chronicles its aftermath in camps the dispossessed – both Jat and Muslim, but mostly Muslim – were forced into, and the attempts at reparations, which were inept and possibly corrupt.\n\nThe “future riot” of the title invokes the idea that violence is a perennial feature of democratic processes in India. Prime minister Modi’s rise was at least partly fuelled by riots in Gujarat in 2002, after a train containing Hindu pilgrims was set on fire and Muslims were blamed. Anti-Muslim prejudice following the Muzaffarnagar riots themselves benefited Modi’s Hindu nationalist BJP. A decade later, the atmosphere in Uttar Pradesh, and the wider country, remains volatile. In the concluding pages, Sacco turns to a question of global significance: does a democracy that foments violence risk being overwhelmed by it?\n\nThere’s wit and realism in the panels and art. It’s dynamic and clear, and the people seem less like caricatures than in Palestine. Vox pops punctuate the narrative, a reminder of the subjective experience of people on the street, in the midst of the action. There is, however, a strange phenomenon I’ve not seen before in 40 years of reading comics. The skin tone of all of the protagonists is dark, and the shading is done not by cross-hatching, but by parallel horizontal lines. Once I noticed it, it became distracting, like TV interference on every character’s face, and I couldn’t unsee it. This may seem like a pathetically trivial point, but comics are a visual medium, and you have to get on with the art. Get over it, I told myself, because the story is important and compelling, but it niggles.\n\nAbove all, Joe Sacco is a journalist, and this is journalism. The format, of which he is almost the only exponent, has a subjectivity absent from traditional approaches. The memories of the protagonists are sometimes contradictory, but Sacco includes them nonetheless. The graphic novel – a wholly unsatisfactory descriptor – can contain all the complexity of a tumultuous politics. In an era when long-form journalism is under pressure, and political analysis filleted to morsels, Sacco’s work is a lifeline.",
  "summary": "<p>The author of Palestine turns his attention to the legacies of Indian partition in this brilliant portrait of the 2013 Muzaffarnagar riots</p><p>Joe Sacco is one of a very small number of graphic novelists who have smashed through into the mainstream. His masterwork is <a href=\"https://www.theguardian.com/books/2023/dec/10/joe-sacco-palestine-graphic-novel-gaza-print-new-readers\">Palestine</a>, a collected volume of single-issue comic books he created in the 1990s, documenting the violence in Gaza. His technique is to embed as a journalist in a war zone and interview people on the street, telling their stories with pictures. Lessons on global politics emerge from ultra-local conflict and depictions of day-to-day life.</p><p>Palestine propelled <a href=\"https://www.theguardian.com/books/joe-sacco\">Sacco</a> to fame, drawing comparisons with Maus, <a href=\"https://www.theguardian.com/books/2022/feb/05/art-spiegelman-maus-book-ban-interview-life-career\">Art Spiegelman’s</a> two-volume saga about Polish Jews during the Holocaust with Nazis portrayed as cats, and Jews as mice. These works are sold prominently in bookshops, not in musty basements packed with racks of polyethylene-sheathed superhero comics. Alongside a couple of others, Maus and Palestine signalled that graphic novels, as they became known, could be serious works of fiction, nonfiction and journalism. Palestine itself is as depressingly relevant today as it was in the 1990s. In&nbsp;December 2023, it was reprinted for the first time in a decade, after selling out following the 7 October attacks.</p> <a href=\"https://www.theguardian.com/books/2025/nov/19/the-once-and-future-riot-by-joe-sacco-review-a-masterclass-in-visual-reportage\">Continue reading...</a>",
  "published": "Wed, 19 Nov 2025 07:00:09 GMT",
  "url": "https://www.theguardian.com/books/2025/nov/19/the-once-and-future-riot-by-joe-sacco-review-a-masterclass-in-visual-reportage",
  "source": "The Guardian"
}