{
  "title": "A surprising CBD advance calms pain without side effects",
  "text": "Many people use CBD-infused oils and lotions believing they offer an easy and relatively low-risk way to ease discomfort. However, scientists still have a limited understanding of how CBD actually interacts with the nervous system.\n\nThe popularity of cannabis-based products has risen sharply over the past ten years. One major reason is the 2018 federal decision to remove hemp from the Controlled Substances Act, which allowed hemp-derived CBD to be legally sold and widely distributed. As a result, CBD is now commonly available in oils, creams, and cosmetic items. It is widely accepted that CBD does not cause a 'high', but its effects within the human brain and body remain poorly understood. At this time, the Food and Drug Administration only approves CBD as an additional treatment for certain types of epilepsy, and it advises against its use during pregnancy.\n\n\"We need to understand more about this compound, what mechanisms it interacts with in the brain, its impact on the body, and whether it is a potentially safer solution for treating the chronic pain epidemic,\" said Kuan Hong Wang, PhD, professor of Neuroscience and member of the Del Monte Institute for Neuroscience at the University of Rochester. Working with researchers at Harvard Medical School and Boston Children's Hospital, Wang's lab recently showed in mice that they could deliver CBD directly to the brain to relieve neuropathic pain without producing harmful side effects. These results were published in Cell Chemical Biology.\n\nA New Way to Deliver CBD to the Brain\n\nThe main obstacle for researchers was the blood-brain barrier, a protective system that shields the brain from harmful substances. While essential for brain health, this barrier significantly limits how much CBD can enter the brain, especially because CBD does not dissolve well in water. As a result, very little of the CBD taken in its usual oil form reaches the brain.\n\nTo address this challenge, staff scientist Jingyu Feng, PhD, the study's first author, helped create a specialized delivery method called inclusion-complex-enhanced nano-micelle formulation, or CBD-IN. This approach encloses CBD molecules within water-soluble nano-micelles, which are considered safe for use in foods and medicines.\n\nTests in mice showed that CBD-IN triggered pain relief within half an hour. Importantly, the mice did not experience the common side effects often linked to conventional pain medications, such as problems with balance, movement, or memory. \"The pain relief also lasted through repeated use,\" said Feng. \"We did not see its effect wear off over time.\"\n\nHow CBD-IN Affects the Nervous System\n\nWith the help of imaging tools and genetic mapping, the researchers found that CBD-IN reduces excessive nerve activity in areas of the brain and spinal cord involved in processing touch and pain. This effect only appeared in regions experiencing abnormal activation, such as after a nerve injury. Healthy neurons were unaffected.\n\nAnother unexpected result was that CBD-IN did not rely on the well-known cannabinoid receptors (CB1 and CB2) typically involved when THC or other cannabis compounds act in the body. \"Instead, CBD-IN seems to influence broader electrical and calcium signaling in nerve cells, offering a new way to control nerve hyperactivity without triggering the 'high' or dependency risks associated with traditional cannabinoids or opioids,\" Feng said.\n\nPotential for Treating Chronic Pain and Other Brain Disorders\n\n\"The broader implication of this research is that nanotechnology can make natural compounds like CBD more effective and precise,\" said Wang, co-senior author of the study. \"By enhancing brain delivery and targeting only disease-related neural overactivity, this strategy could open new doors for treating chronic pain and possibly other neurological disorders, such as epilepsy or neurodegenerative diseases, where abnormal nerve activity plays a central role.\"\n\nThis work was carried out through a collaboration involving the University of Rochester, Harvard Medical School, and Boston Children's Hospital. Additional contributors include Jessica Page, PhD, and Leeyup Chung, PhD, both co-first authors, and Zhigang He, PhD, co-senior author, from Harvard Medical School. Funding was provided by the National Institutes of Health and the Del Monte Institute for Neuroscience.",
  "summary": "Researchers developed a new nano-micelle formulation, CBD-IN, that finally gets CBD into the brain effectively. In mice, it relieved neuropathic pain quickly and didn’t cause the usual movement or memory side effects. Surprisingly, the pain relief didn’t use typical cannabinoid receptors, instead calming abnormal nerve activity more directly. The findings hint at new avenues for treating chronic pain and neurological diseases.",
  "published": "Tue, 18 Nov 2025 00:26:39 EST",
  "url": "https://www.sciencedaily.com/releases/2025/11/251117095652.htm",
  "source": "All Top News -- ScienceDaily"
}