{
  "title": "A crisis deepens as African penguins compete with fishing fleets for food",
  "text": "A new study led by the University of St Andrews reports that Critically Endangered African penguins (Spheniscus demersus) are far more likely to forage in the same waters as commercial fishing vessels during years when fish are scarce. This increased overlap heightens competition for food and intensifies pressure on a species already facing severe decline.\n\nPublished on November 17 in the Journal of Applied Ecology, the research presents a new metric called \"overlap intensity\" that evaluates not only where penguins and fishing vessels share space, but how many penguins are influenced by this interaction.\n\nPopulation Declines and Fishing Pressure\n\nAfrican penguin numbers have dropped by nearly 80% over the past thirty years. One major factor in this decline is competition with local fisheries that catch sardines and anchovies, which are essential prey for the birds.\n\nThese fisheries rely on purse-seine nets, a method that captures schooling fish by encircling them with a large wall of netting.\n\nLead author Dr. Jacqueline Glencross of the Scottish Oceans Institute at the University of St Andrews explained the motivation behind the work. \"We wanted a better way to assess how many penguins are potentially impacted when fisheries operate nearby -- not just where the overlap occurs,\" she said.\n\nTracking Data Shows Sharp Increases in Overlap\n\nThe research team used tracking information from penguins on Robben and Dassen Island. Collaborators included scientists from the University of Exeter, the South African Department of Forestry, Fisheries and the Environment, and BirdLife South Africa. Their analysis showed a dramatic rise in overlap during years when fish were less abundant. In 2016, a year marked by low fish biomass, about 20% of penguins were feeding in the same regions as active fishing vessels. In years with stronger fish stocks, this figure dropped to around 4%.\n\nThese results indicate that competition between penguins and fisheries becomes more intense when prey is limited. Such conditions are especially risky during chick-rearing, when adults must find food quickly and efficiently to support their young.\n\nNew Tool for Conservation and Fishery Management\n\nBy measuring overlap intensity across the population, the researchers have created a tool that can help assess ecological risks and guide ecosystem-based fishery management. The findings also support the development of dynamic marine protected areas that can adapt to real-time shifts in predator and prey behavior.\n\nLegal Battles and Updated Fishing Closures\n\nThe African penguin recently became the focus of a significant South African court case that questioned the lack of meaningful fishing restrictions near breeding sites.\n\nEarlier this year, conservation organizations and representatives from the fishing industry reached a high court agreement acknowledging the need for fishery closures around penguin colonies. Following this decision, the South African government reinstated more biologically meaningful no-fishing zones near Robben Island, one of the primary colonies examined in the study.\n\nDr. Glencross added that the research helps clarify the importance of these measures. \"This research highlights why those closures are necessary. Previously unprotected areas with high overlap intensity are where the penguins were most at risk.\"",
  "summary": "During years of scarce fish, African penguins crowd into the same areas as commercial fishing vessels, heightening competition for dwindling prey. A new metric called “overlap intensity” shows how many penguins are affected and is already shaping improved conservation policies.",
  "published": "Mon, 17 Nov 2025 09:56:42 EST",
  "url": "https://www.sciencedaily.com/releases/2025/11/251117095642.htm",
  "source": "All Top News -- ScienceDaily"
}