{
  "title": "Wax Princess Diana In ‘Revenge Dress’ Is Unveiled In Paris Decades After Her Death In The City",
  "text": "LOADING ERROR LOADING\n\nPARIS (AP) — Princess Diana returned to Paris in wax Thursday as one of Europe’s oldest wax museums unveiled a new figure of the British royal in the so-called “revenge dress,” decades after her tragic death in the city.\n\nThe statue was ordered in Paris after the director of the Grevin Museum visited London and came away underwhelmed by the Diana likeness at Madame Tussauds, prompting him to commission his own version, museum officials said.\n\nAdvertisement\n\nGrevin’s life-size — and very convincing — figure of the late Princess of Wales is dressed in a replica of the black, off-the-shoulder, figure-hugging cocktail dress Diana wore to a Serpentine Gallery event in London in 1994.\n\nIt was the same night that King Charles III — at the time Prince Charles — acknowledged on television that he had been unfaithful with Camilla Parker Bowles, now Queen Camilla.\n\nFor Paris, the tribute carried extra weight: Diana — “Lady Di” to the French, who still use the nickname affectionately even though she spent most of her public life as a princess — died after a car crash in a tunnel by the Seine in 1997, a death that helped immortalize her in the Parisian imagination, where she still remains present in the flowers and handwritten notes left at informal memorials.\n\nAdvertisement\n\nSome observers noted wryly how the museum's newest royal guest was positioned far from wax likenesses of her famous ex-husband and mother-in-law. via Associated Press\n\nMuseum officials noted that the unveiling came on the 30th anniversary of an explosive interview that Diana gave to BBC “Panorama,” which observers say dented the standing of the monarchy and the Queen.\n\nSome observers noted wryly how the museum’s newest royal guest was positioned far from wax likenesses of her famous ex-husband and mother-in-law.\n\nAdvertisement\n\nHigh heels, a pearl choker at her neck and a small handbag clasped in both hands completed the sculpture. Tabloids later dubbed the outfit the “revenge dress,” and the museum leaned into that symbolism.\n\nFrench novelist Christine Orban, who wrote “Mademoiselle Spencer,” a novel imagined from Diana’s point of view, said the figure was overdue.\n\nShe called the black dress a turning point in Diana’s story.\n\n“The dress is very significant of her liberation because in the royal family, black is only worn for funerals, and then such a sexy dress for a Princess of Wales, well, that’s not common either,” she said. “So she decides to wear her high heels and Louboutins. And to go to the Serpentine Gallery to make an impression, to get photographed.”\n\nAdvertisement\n\nGrevin, founded in the 19th century, has long packed its ornate halls with political leaders, artists, pop-culture figures — and, yes, British royals. Diana is the latest in a steady stream of star wattage additions the museum uses to refresh the collection and boost visitors at the site that has attracted some 700,000 annual visitors in recent years.\n\nNews of the unveiling filtered through Paris, even before most people had a chance to visit.\n\n“It brought back that night in the tunnel, even though I was a kid then,” said Julien Martin, 38. “Paris never completely let go of Diana, so it made sense that a big wax museum finally did this.”\n\n“I wasn’t even alive but for my generation, she seems like the first modern princess — glamorous, but also vulnerable,” said 24-year-old student Lina Ben Amar. “If tourists come to see celebrities in wax, she is one of the first they will look for.”\n\nAdvertisement",
  "summary": "People are going to have thoughts.",
  "published": "Thu, 20 Nov 2025 12:26:11 -0500",
  "url": "https://www.huffpost.com/entry/princess-diana-wax-paris_n_691f4aa8e4b047290e291c26",
  "source": "World News"
}