{
  "title": "Amazon selling a tasteless Christmas baby outfit is Claus for concern",
  "text": "I found a baby outfit (sizes from newborn to five years) on Amazon bearing the phrase “Santa’s favourite ho”.\n\nThis isn’t just a tasteless mistake – it’s a failure of corporate responsibility and consumer protection. A corporation this large should have systems that prevent sexualised or exploitative language being associated with items for children.\n\nKG London\n\n“A comfortable addition to your child’s wardrobe,” read the blurb in the listing on the UK and US websites.\n\nAmazon won’t tell me how many parents have leapt at the chance to identify their infant with the sexualised slur, but it did immediately remove the listing on both sides of the Atlantic for “violating our content guidelines”.\n\nView image in fullscreen Amazon screengrab. Photograph: Amazon\n\nSurely it has devised algorithms to filter out offensive products? And so it has, it claims. “If we discover a product was undetected by our controls, we remove the product immediately and refine our controls,” a spokesperson said.\n\nWe welcome letters but cannot answer individually. Email us at consumer.champions@theguardian.com or write to Consumer Champions, Money, the Guardian, 90 York Way, London N1 9GU. Please include a daytime phone number. Submission and publication of all letters is subject to our terms and conditions.",
  "summary": "<p>The offensive listing seemed more than a mistake – it was a failure of corporate responsibility, says reader</p><p><strong>I found a baby outfit (sizes from newborn to </strong><strong>five years) on Amazon bearing the phrase</strong><strong> “Santa’s favourite ho”.</strong></p><p><strong>This isn’t just a tasteless mistake – it’s a failure of corporate responsibility and consumer protection. A corporation this large should have systems that prevent sexuali</strong><strong>sed or exploitative language being associated with items for children.</strong></p> <a href=\"https://www.theguardian.com/money/2025/nov/18/amazon-christmas-baby-outfit-offensive-listing\">Continue reading...</a>",
  "published": "Tue, 18 Nov 2025 07:00:26 GMT",
  "url": "https://www.theguardian.com/money/2025/nov/18/amazon-christmas-baby-outfit-offensive-listing",
  "source": "The Guardian"
}