{
  "title": "What pet cemeteries reveal about being human",
  "text": "Editor’s Note: Eric Tourigny is a lecturer in historical archaeology at Newcastle University, UK. His research interprets osteological and material culture remains alongside historic texts to examine changing human-animal relationships in Europe and North America over the past 500 years. The views expressed in this commentary are his own. Read more opinion on CNN.\n\nCNN —\n\nWhy do we bury our departed loved ones in a cemetery? A primary purpose is to provide survivors with an opportunity to grieve and gain a sense of closure. The cemetery is a place for the living as much as it is a place for the dead.\n\nBut what about when the dearly departed are not human – but our pets?\n\nEric Tourigny Eric Tourigny\n\nThe Spanish city of Barcelona recently announced that it will be investing in the establishment of the country’s first public pet cemetery. Set to open next year, it will offer both burials and cremations – with an estimated 7,000 carried out each year.\n\nFor me, as someone who has spent years researching the development of pet cemeteries elsewhere in the world, this news came as a shock. Barcelona is a densely populated city with limited privately owned land – one where 50% of families own a pet.\n\nHow did a city that is home to 180,000 dogs not already have a public pet cemetery? Until now, the service was only provided by the private sector, according to Barcelona’s Councilor for Climate Emergency and Ecological Transition, Eloi Badia. He added that the municipal-funded initiative was sparked by “constant public demand.”\n\nAfter all, public pet cemeteries have been around in Europe and the Americas since the late 19th century. Britain’s first public pet cemetery appeared in London’s Hyde Park in 1881. New York’s Hartsdale pet cemetery was founded in 1896, followed a few years later by Paris’ ornate Cimetière des Chiens in 1899.\n\nA grave discovery\n\nI became interested in the history of modern pet burial practices while investigating the archaeological record of a centuries-old house in Toronto. I came across a (very) large dog buried in the back garden which, according to the historical record, was occupied between 1840 and 1870.\n\nThis dog survived to an elderly age but, sadly, suffered from degenerative joint disease and severe infections during his last months. His ailments progressed to such a state that suggest he received some level of care in his final weeks. He then was buried in a personal plot behind the family home.\n\nThis elderly dog led me to think about the different ways people interact with the bodies of their pets after death. Could this behavior be reflective of the relationships they held with their animals in life? In this instance, why take the time to carefully bury a dog in its own space when other, arguably easier options existed?\n\n\"Darling Sammie,\" reads one of the animal gravestones dating back to the 1890s in Hyde Park Pet Cemetery, London. Photo taken by Eric Tourigny with permission from The Royal Parks. Eric Tourigny\n\nThis, after all, was an era when people often disposed of their dead pets in the river, or might have sold their bodies for meat and skin.\n\nGood hygiene is an obvious reason to choose a burial – no one wants decomposing animal bodies in the street or their garden – but that wouldn’t immediately warrant a personalized, dedicated burial and gravestone.\n\nThe most straight forward option would be to dispose of a deceased animal with the household waste. But such treatment would evidently feel less ceremonious and would not offer appropriate emotional closure to what was likely an important relationship.\n\nA member of the family\n\nLike the burial of people, the burial of pets is an intimate cultural practice, one that changes over time and is reflective of the changing relationships that a society has with its cherished creatures.\n\nMy study of historic gravestones and epitaphs in Britain from the Victorian period to today shows this changing human-animal relationship. In the 19th century, gravestones were often dedicated to a “loving friend” or “devoted companion,” suggesting pets were mostly considered important friends.\n\nBy the early 20th century, pets had become members of the family – evidenced by the appearance of family surnames on the gravestones, and loving epitaphs written by “Mummy and Daddy.”\n\nBy the early 20th century, pets had become members of the family – evidenced by the appearance of family surnames on the gravestones, and loving epitaphs written by “Mummy and Daddy.” Eric Tourigny\n\nSociety’s changing attitude towards the role of animals in the afterlife can also be found. Fast-forward a few decades later, and gravestones were more likely to reference a reunion then earlier ones. For example, the owners of Denny, the “brave little cat” buried in an east London cemetery in 1952, wrote on his epitaph “God bless until we meet again.”\n\nI wonder what the epitaphs in Barcelona’s new cemetery will reveal about modern Catalan relationships with animals.\n\nOver time, our ways of treating our animal dead appear to reflect an even closer relationship in life. Once strictly forbidden by law, the last decade saw many jurisdictions, like the state of New York, allowing the co-burial of cremated animals and people, which will undoubtedly lead to changing funerary and commemoration practices for both humans and animals.\n\nModern mourning\n\nFor me, the most remarkable similarity between modern and historic pet cemeteries is the striking evidence for the heartbreak and taboos around grieving for animals.\n\nThe connection that someone has with their pet can be just as strong and just as significant as their relationships with other humans. Yet today, as in over 100 years ago, individuals continue to struggle to find the appropriate outlet to express their pain, hiding heartache for fear of the social repercussions that might come with public acknowledgment of the existence of such a bond.\n\nThe RSPCA reassures the public on its website that they should not feel shame for their grief. In the UK, charities like the Blue Cross and Rainbow Bridge Pet Loss Grief Center offer counseling to bereaved humans.\n\nClose relationships between people and animals have existed for millennia, but in western European cultures, there were few acceptable ways to mourn that relationship. As society becomes more accepting of the importance of human-animal relationships to our collective wellbeing, it is not surprising to see us follow rituals resembling those we use to mourn the loss of our closest human relationships.\n\nAt an estimated cost of €200 ($217) per service at the new Barcelona cemetery, it is important to acknowledge that this opportunity to grieve will not be financially available to everyone in the city.\n\nFollow CNN Opinion Join us on Twitter and Facebook\n\nThis will not be a space for all of the city’s pets. Pet owners may opt to keep cremated remains within their home or spread out ashes in a meaningful location instead. Online forums and digital pet cemeteries also provide other opportunities to commemorate the relationship and express grief.\n\nWhether one chooses a pet cemetery or not, there are many acceptable ways to express your grief – and to remember your relationship with the important animals in your life.",
  "summary": "Why do we bury our departed loved ones in a cemetery? A primary purpose is to provide survivors with an opportunity to grieve and gain a sense of closure. The cemetery is a place for the living as much as it is a place for the dead.",
  "published": "Mon, 03 Apr 2023 15:03:47 GMT",
  "url": "https://www.cnn.com/2023/04/03/opinions/pet-cemeteries-burying-animals-history-tourigny/index.html",
  "source": "CNN.com - RSS Channel - App International Edition"
}