{
  "title": "MLA behind bars, AIUDF says will field him from jail in Assam polls",
  "text": "Jailed MLA Aminul Islam will contest next year’s legislative assembly elections from behind bars if he is not released by then, AIUDF chief Badruddin Ajmal declared on Wednesday.\n\nFollowing the Pahalgam terror attack in April this year, Islam, who has been the MLA representing Assam’s Dhing constituency since 2011, had been arrested on April 24 for statements in a political rally suggesting that the attack was a “conspiracy” by the central BJP government. Section 152 of the BNS, invoked against him, pertains to “acts endangering sovereignty, unity and integrity of India”, which is similar to “sedition” under the IPC.\n\nHe was the first of at least 97 people from across the state who have been arrested for social media posts in a campaign to “to detain Pakistan supporters” run by the Assam government after the Pahalgam terror attack.\n\nThree weeks later, he received bail in the case from a Nagaon court on May 14. However, the very same day, he was detained under the NSA, and continues to be incarcerated.\n\nAt the time, his party, the AIUDF, a regional party from Assam which has its primary support base among the state’s Bengali-origin Muslim community, had refrained from lending support to him.\n\nHowever, speaking to reporters on Wednesday, AIUDF Ajmal stated he has not committed an offence that merits the NIA and that the party will field him as a candidate even if he continues to be behind bars.\n\n“Aminul Islam has been in jail for the last eight months. He has been kept in jail with NSA charges as part of a conspiracy. He has done no such offence which merits the NSA. The offence he had been arrested for, he got bail within weeks. After that, he was jailed under the NSA. There is political motivation behind this,” he said.\n\nStory continues below this ad\n\nHe added that the party will continue to seek legal recourse.\n\n“If even after that the government does not let him go… Congress is the one which wants this man in jail. Their candidate who wants to contest from this seat wants him to remain in jail. In past elections, we have seen jailed candidates winning. If we are bound to, Aminul will contest the elections from jail,” he said.\n\nThe AIUDF, which has 15 members in the 126-member assembly and is the third-largest party, has been excluded from Congress-led efforts to forge a regional alliance for next year’s elections. In light of this, Ajmal has expressed interest in exploring a front with the AIMIM, which does not have a presence in Assam. On Wednesday, he said that he will meet AIMIM leaders next month to discuss this. However, on Tuesday, the AIMIM had issued a statement saying, “Neither has AIMIM decided to start operations in Assam, nor enter into alliance with any party in the state.”",
  "summary": "",
  "published": "Thu, 20 Nov 2025 02:41:24 +0000",
  "url": "https://indianexpress.com/article/india/mla-behind-bars-aiudf-says-will-field-him-from-jail-in-assam-polls-10375224/",
  "source": "India | The Indian Express"
}