{
  "title": "Ketamine helped me escape my negative thoughts - then it nearly killed me",
  "text": "Ketamine helped me escape my negative thoughts - then it nearly killed me\n\n4 July 2025 Share Save Ruth Clegg Health and wellbeing reporter, BBC News Share Save\n\nAbbie Abbie first began using ketamine when she was 16\n\nAbbie was 16 years old when she started using ketamine. It was the first time she had felt in control. The negative thoughts that had swamped her mind since a young age began to dissipate. Twelve years later and fresh out of rehab she's still battling with the addiction that almost took her life. She wants to speak out to explain why ketamine has become such a popular drug - especially among young people with mental health problems - and to talk about the damage it can do long term. Abbie's warning comes as the first NHS clinic in the UK - dedicated to helping children struggling with ketamine use - opens on Merseyside, with patients as young as 12 needing help.\n\nKetamine is unlike many other street drugs due to the way it interacts with the brain. Small amounts of the Class B drug can give a sense of euphoria and excitement, while large amounts can lead to a state known as the \"K-hole,\" where users feel detached from reality - an out-of-body-type experience. The number of under 16s reporting a problem with the drug has nearly doubled over the past two years, overtaking cocaine in popularity with children and young people. Nearly half those (49%) who started treatment for drug misuse in 2023-24 said they had a mental health problem, with more than a quarter not receiving any treatment for the latter.\n\nDetails of help and support with addiction are available in the UK at BBC Action Line\n\nExperts are warning that some young people are taking dangerous amounts of ketamine not only due to its low price and ease of availability, but also because of the dissociative feelings it brings. \"What we are seeing is a perfect storm,\" David Gill, the founder of Risk and Resilience, a company which trains front-line workers on emerging drug trends. \"We have more young people struggling with depression, trauma, anxiety, a lack of services - and we have a very cheap street drug that helps them disconnect.\" Abbie's first line of ketamine did exactly that. She says it \"felt like such a powerful place to be\". \"My thoughts no longer had a negative effect on me - life was passing me by, but I didn't have to engage with it.\" Abbie's childhood had been hard. Struggling with mental health problems and undiagnosed ADHD, she had left school at 14 and found herself in a whirlwind of drink, drugs and unhealthy relationships.\n\nAbbie Abbie's weight dropped during the course of her addiction\n\nAlthough addiction cast a long shadow throughout her 20s, Abbie managed to secure a place at university, staying clean throughout, and obtained a healthcare degree. She is smart, articulate and wants to do well, but after two abusive and controlling relationships ketamine became the only means she had to block out the trauma. Yet when she went to her GP to seek help she was prescribed sleeping tablets and told to \"come off the ket\". \"The withdrawals were so bad I would be shaking and vomiting,\" she says, \"it wasn't that easy to just come off it.\" Then a deeper level of addiction took hold.\n\n\"I always prided myself in the early stages of addiction of keeping my morals and my values and not lying to people,\" Abbie says, \"but I couldn't stop the drugs and I found myself hiding my use to my friends.\" Things escalated. Eventually Abbie was taking ketamine every day - incessantly. The only time she would take a shower, she says, would be when she went out to meet her dealer on the street. The physical effects of overuse began to kick in - horrific abdominal pains, known as K-cramps, would leave her screaming in agony. She would place boiling hot water bottles on her abdomen - burning her skin. And then she would take even more ketamine to numb the pain.\n\nWhat is ketamine?\n\nOften referred to as ket, Special K or just K, ketamine is a powerful horse tranquilliser and anaesthetic. It is a licensed drug and can be prescribed medically\n\nWhen misused, it can cause serious and sometimes permanent damage to the bladder\n\nIt is currently a Class B drug under the Misuse of Drugs Act 1971\n\nThe penalty for possession is up to five years in prison, an unlimited fine - or both\n\nAbbie documents her recovery on TikTok and gives support to other young people\n\nThis cycle of drug abuse is something public health consultant Professor Rachel Isba also sees in her new clinic for under 16s experiencing the physical side effects of ketamine use. Chronic use of the drug can cause ketamine-induced uropathy, a relatively new condition, which affects the bladder, kidneys and liver. The bladder lining becomes so inflamed it can result in permanent damage and it has to be removed. Prof Isba says the first signs of ketamine bladder are severe abdominal pains, urinating blood and jelly from the damaged bladder lining. \"Patients referred to the clinic will receive a holistic approach,\" she says, \"care from the specialist urology team to treat the physical effects of the drug, and then they will be supported - and referred if necessary - to community services who can help with the often complex reasons behind their drug use.\"\n\n'Completely helpless'\n\nMaisie Maisie started taking ketamine at festivals - but her use spiralled out of control\n\nSarah Norman, from St Helens, says she felt like a \"silent watcher\" as her daughter began to \"fade in front\" of her eyes. Last September she discovered that Maisie, 25, was addicted to ketamine, which had caused potentially irreversible damage to her kidneys. \"We are just an average family,\" Sarah says. \"I never thought Maisie would have ended up addicted to any drugs - she doesn't even drink alcohol.\" Maisie had kept it quiet - ashamed of the stigma attached to her ketamine use. But what had started as a party drug she'd take at festivals had become a substance she couldn't function without. In the end her partner moved out with their three-year-old son. \"I had nothing left to live for,\" Maisie says. \"It got to the point I was doing bump after bump [snorting small amounts of it]. \"For a short time I would be knocked out of reality - then I would take more.\"\n\nSarah Norman Sarah documents her daughter's addiction and offers advice to other parents online\n\nEventually, Maisie's mum and sister carried her into hospital - she weighed just five stone (32kg). \"The doctors said her body was failing her,\" Sarah says. \"We thought we might lose her.\" As a parent, she says, she felt completely helpless. \"It's hell on earth, there is nothing you can do. You ask yourself what you should have done.\" Maisie's kidneys were fitted with nephrostomy tubes, which drain the urine out into two bags - which she now carries around with her. Yet even this major operation didn't end Maisie's addiction. But finally, after fighting for a place in rehab she has now been clean for five months. Sarah posts about her daughter's drug journey on Tik Tok where many parents reach out to her for help and advice with their own children. \"This drug is just horrific, so many other young people are struggling with it,\" Sarah says. \"I am so proud of Maisie though, she's going to Narcotics Anonymous meetings every night. \"The pain she must have been through - and still goes through - I'm not sure if I'd have been as resilient and strong as she is.\"\n\nMaisie Maisie's kidneys were badly damaged and she needed two tubes fitted to drain the urine",
  "summary": "Young people are taking dangerous amounts of ket because it's cheap, easily available and helps them \"disconnect\", experts say.",
  "published": "Fri, 04 Jul 2025 23:08:50 GMT",
  "url": "https://www.bbc.com/news/articles/c70r1xdyy59o?at_medium=RSS&at_campaign=rss",
  "source": "BBC News"
}