{
  "title": "Who is Kellie Sloane, the new NSW Liberal leader – and can this first-term former journalist save the party?",
  "text": "After months of speculation about her leadership ambitions, and the drawn-out demise of Mark Speakman, Kellie Sloane’s message after being elected unopposed to lead the New South Wales Liberal party was succinct.\n\n“What a day!” she said on Friday morning, before thanking her colleagues and saying she was “ready to work for NSW”. Then she walked down the corridor into the opposition leader’s office.\n\nIt was the type of media management you would expect from a former journalist. The previous night, when Speakman resigned and endorsed Sloane, a staffer visited reporters in parliament to deliver a simple, three-line statement from the member for Vaucluse, thanking Speakman for his leadership and support.\n\nSpeakman on Thursday evening acknowledged that the party’s survival was under threat and he said 52-year-old Sloane – “a great communicator” – would “clear the air”.\n\n“She is someone with an enormous, enormous leadership potential.”\n\nThe former television journalist, elected unopposed on Friday morning, has a reputation for being a good performer – and the government has taken notice.\n\nThe Sydney Morning Herald analysed parliamentary speeches by the premier, Chris Minns, since March 2023 and found “the member for Vaucluse” was among his most common phrases, uttered more frequently than “public transport”. In 18 different speeches, 44 times, Minns took aim: anticipating future battles at the dispatch box and on the campaign trail.\n\nNow Sloane is leader, Minns has one clear line of attack: her relative inexperience in politics.\n\nSpeakman himself, during Thursday’s last-ditch attempt to head off the challenge, pointedly referred to her as a terrific “first-term” MP.\n\nBut in a job where cut-through communication skills are career-defining, Sloane’s CV points to her potential.\n\nIt was the South Australian transplant’s on-air ability that brought her to NSW. She grew up and went to a public school in the Barossa Valley, studied for an arts degree at the University of South Australia and began her career as an ABC cadet in Adelaide. In 1997, she moved to work as a reporter at Nine in Sydney.\n\nShe worked there for 13 years, including a stint as a presenter of the Today program, moving to the late-night news program Nightline in 2009. She left Nine after the show was axed in 2010.\n\nSign up: AU Breaking News email\n\nAfter leaving journalism, Sloane worked as a chief executive of educational non-profits before running for Liberal preselection in Willoughby after Gladys Berejiklian, the Coalition’s first female Liberal premier and second female leader, resigned in 2021.\n\nShe garnered the attention of high-profile Liberals, including the former premier Mike Baird and the former federal treasurer Joe Hockey, though Berejiklian backed the former Willoughby mayor Gail Giles-Gidney.\n\nIn a surprise result, moderates Giles-Gidney and Sloane came second and third to a former Tony Abbott staffer, Tim James, who was elected in the 2022 byelection.\n\nJames is a member of the party’s right faction, aligned with the shadow attorney general Alister Henskens’ rival leadership bid this week.\n\nBut Sloane’s high-profile endorsements speak to her own Liberal connections. Her husband, Adam Connolly, a former News Corp journalist, was an adviser to John Howard.\n\nView image in fullscreen The NSW opposition leader, Kellie Sloane (R), and the deputy leader, Natalie Ward, speak to media on Friday. Photograph: Bianca De Marchi/AAP\n\nHe now runs Apollo Communications, a corporate communications company which offers a “direct link to journalists and opinion leaders”.\n\nThe company is not present on either the NSW or federal registers of lobbyists but Sloane may need to make clear any potential conflicts of interest to avoid the lobbying scandals that have dogged many NSW politicians.\n\nSloane ran for preselection in the eastern suburbs seat of Vaucluse in 2022 with the backing of more Liberal heavyweights – the federal senator and former Wentworth MP Dave Sharma and the local powerbroker Sally Betts. She won.\n\nShe took the seat in 2023 by a comfortable margin, moving straight to the opposition frontbench as shadow environment minister, and then to health when Matt Kean resigned in mid-2024.\n\nAs opposition health spokesperson, she has walked the line between holding the government to account and acknowledging the Coalition’s role in setting up the disastrous private-public partnership at Northern Beaches hospital, which happened long before she was elected.\n\nIn parliament, she has been tough on the government’s response to the rise in illicit tobacco, introducing legislation which Labor’s own laws later mirrored. During question time, Sloane often has an eye on the press gallery, observing how journalists are responding to the debate.\n\nskip past newsletter promotion Sign up to Breaking News Australia Free newsletter Get the most important news as it breaks Enter your email address Sign up Privacy Notice: Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on theguardian.com to send you this newsletter. You can complete full registration at any time. For more information about how we use your data see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nAs he resigned on Thursday, Speakman said he had dragged the Liberal party “kicking and screaming to an aggressively pro-housing policy” and called on his successor to maintain the commitment.\n\nSloane, whose electorate includes areas affected by the government’s decision to build a train station and up to 10,000 homes at Woollahra, said in 2022 she didn’t want residents to be “punished” with more housing.\n\nBut she has handled the government’s rezoning of the area discreetly, saying she is not opposed to development “in principle” while casting doubt on the government’s numbers.\n\nSloane’s opposition-leader-in-waiting qualities were evident after this month’s neo-Nazi rally. Sloane, who took to social media to condemn the event, received a barrage of hateful messages on X, including alleged death threats, which she reported to police.\n\nAt a press conference convened by Speakman, it was the shadow health minister, not the former opposition leader, to whom journalists directed questions.\n\n“I will not be bullied out of saying what I think, and I will stand up for people in my community and for the broader community of Sydney who don’t like hate,” she said at the time, echoing comments made in countless media appearances that day.\n\nAt a press conference on Friday morning, the mother of three teenage boys said families and young people would be “at the heart of everything [the Liberals] do”. She said this meant action on cost of living and energy prices, but said it was too early to detail what this would look like at a policy level.\n\nShe said she was “pro-housing”, including in her own electorate, and echoed Speakman’s repeated calls for new metro lines.\n\nStanding alongside deputy leader Natalie Ward, Sloane said she hoped the “female-female leadership team” would inspire more women to enter politics. She said she didn’t think the party needed gender quotas “at the moment” but was open to discussions.\n\nSloane rejected the idea she had been put on a “glass cliff” – where women are appointed during crisis, saying “I wasn’t pushed, I put my hand up”, although she acknowledged dysfunction in Canberra was hurting the NSW party. She said she believed in Sussan Ley as federal opposition leader, but noted the NSW Liberals remained committed to net zero.\n\nLike the new Victorian Liberal leader, Jess Wilson, she will need to isolate the state Coalition from the federal follies and struggles engulfing Ley. Fractures over net zero emissions loom with the NSW Nationals, now led by Gurmesh Singh, which could be disastrous for metropolitan Liberal-held seats.\n\nThe Coalition is sitting at a dire 28%, according to the latest Resolve poll. If that doesn’t improve, it would lead to a thumping Labor majority at the March 2027 election.\n\nAsked whom he feared going up against most in 2027, the premier this week didn’t mention the member for Vaucluse but said he had a “healthy fear of all of them”.\n\n“The Liberal party is formidable,” Minns said. “Over the last 20 years, they’ve won more elections than they’ve lost. Other than 2011, pretty much every election in NSW has been close.\n\n“This one will be close too, and the last thing I want voters to think is that we’re counting our chickens.”",
  "summary": "<p>Former television reporter and presenter, now the member for Vaucluse, praised for her ‘enormous potential’</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/2025/nov/21/kellie-sloane-nsw-liberal-leader-vaucluse-mp\">Kellie Sloane elected NSW Liberal leader unopposed, replacing Mark Speakman</a></p></li><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/nov/21/australia-news-live-mark-dreyfus-republic-anthony-albanese-g20-south-africa-eu-trade-deal-nt-cyclone-darwin-airlines-powerbank-ban-nsw-politics-leadership-kellie-sloane-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>After months of speculation about her leadership ambitions, and the drawn-out demise of Mark Speakman, Kellie Sloane’s message after being elected <a href=\"https://www.theguardian.com/australia-news/2025/nov/21/kellie-sloane-nsw-liberal-leader-vaucluse-mp\">unopposed to lead the New South Wales Liberal party</a> was succinct.</p><p>“What a day!” she said on Friday morning, before thanking her colleagues and saying she was “ready to work for NSW”. Then she walked down the corridor into the opposition leader’s office.</p> <a href=\"https://www.theguardian.com/australia-news/2025/nov/21/who-is-kellie-sloane-new-nsw-liberal-leader-profile\">Continue reading...</a>",
  "published": "Fri, 21 Nov 2025 03:19:12 GMT",
  "url": "https://www.theguardian.com/australia-news/2025/nov/21/who-is-kellie-sloane-new-nsw-liberal-leader-profile",
  "source": "World news | The Guardian"
}