{
  "title": "Quantum computers just simulated physics too complex for supercomputers",
  "text": "Scientists study matter under extreme conditions to uncover some of nature's most fundamental behaviors. The Standard Model of particle physics contains the equations needed to describe these phenomena, but in many real situations such as fast-changing environments or extremely dense matter, those equations become too complex for even the most advanced classical supercomputers to handle.\n\nQuantum computing offers a promising alternative because, in principle, it can represent and simulate these systems far more efficiently. A major challenge, however, is finding reliable methods to set up the initial quantum state that a simulation needs. In this work, researchers achieved a first: they created scalable quantum circuits capable of preparing the starting state of a particle collision similar to those produced in particle accelerators. Their test focuses on the strong interactions described by the Standard Model.\n\nThe team began by determining the required circuits for small systems using classical computers. Once those designs were known, they applied the circuits' scalable structure to build much larger simulations directly on a quantum computer. Using IBM's quantum hardware, they successfully simulated key features of nuclear physics on more than 100 qubits.\n\nScalable Quantum Methods for High-Density Physics\n\nThese scalable quantum algorithms open the door to simulations that were previously out of reach. The approach can be used to model the vacuum state before a particle collision, physical systems with extremely high densities, and beams of hadrons. Researchers anticipate that future quantum simulations built on these circuits will exceed what classical computing can accomplish.\n\nSuch simulations could shed light on major open questions in physics, including the imbalance of matter and antimatter, the creation of heavy elements inside supernovae, and the behavior of matter at ultra-high densities. The same techniques may also help model other difficult systems, including exotic materials with unusual quantum properties.\n\nNuclear physicists used IBM's quantum computers to perform the largest digital quantum simulation ever completed. Their success stemmed in part from identifying patterns in physical systems, including symmetries and differences in length scales, which helped them design scalable circuits that prepare states with localized correlations. They demonstrated the effectiveness of this algorithm by preparing the vacuum state and hadrons within a one-dimensional version of quantum electrodynamics.\n\nAdvancing from Small Models to Large-Scale Quantum Systems\n\nThe team validated their circuit components by first testing them on small systems with classical computing tools, confirming that the resulting states could be systematically improved. They then expanded the circuits to handle more than 100 qubits and ran them on IBM's quantum devices. Using the data from these simulations, scientists extracted properties of the vacuum with percent-level accuracy.\n\nThey also used the circuits to generate pulses of hadrons, then simulated how those pulses evolved over time to track their propagation. These advances point toward a future in which quantum computers can carry out full dynamical simulations of matter under extreme conditions that lie well beyond the reach of classical machines.\n\nThis research received support from the Department of Energy (DOE) Office of Science, Office of Nuclear Physics, InQubator for Quantum Simulation (IQuS) through the Quantum Horizons: QIS Research and Innovation for Nuclear Science Initiative, and the Quantum Science Center (QSC), a DOE and University of Washington National Quantum Information Science Research Center. Additional computing resources were provided by the Oak Ridge Leadership Computing Facility, a DOE Office of Science User Facility, and by the Hyak supercomputer system at the University of Washington. The team also acknowledges the use of IBM Quantum services for this project.",
  "summary": "Researchers created scalable quantum circuits capable of simulating fundamental nuclear physics on more than 100 qubits. These circuits efficiently prepare complex initial states that classical computers cannot handle. The achievement demonstrates a new path toward simulating particle collisions and extreme forms of matter. It may ultimately illuminate long-standing cosmic mysteries.",
  "published": "Wed, 19 Nov 2025 12:32:19 EST",
  "url": "https://www.sciencedaily.com/releases/2025/11/251118220104.htm",
  "source": "All Top News -- ScienceDaily"
}