{
  "title": "Pakistan’s economic forecast: GDP could grow 5%-6.5%; IMF flags corruption risks",
  "text": "The International Monetary Fund (IMF) highlighted persistent corruption challenges in Pakistan, warning that systemic weaknesses across state institutions could limit economic growth unless urgent reforms are undertaken, Dawn reported.The IMF’s Governance and Corruption Diagnostic Assessment (GCDA) is a prerequisite for its executive board to approve a $1.2 billion disbursement, expected next month.The report, as cited by Dawn, estimates that Pakistan could see GDP growth rise by 5 to 6.5% over five years if a comprehensive governance reform package is implemented within three to six months. Among the recommendations is an end to preferential treatment for influential public sector entities in government contracts, alongside greater transparency in the operations of the Special Investment Facilitation Council (SIFC).“A unifying theme is the emphasis on increasing transparency and accountability in policy formulation, implementation and monitoring,” the IMF assessment said. It added that reforms should also improve access to information and strengthen the ability of state and non-state actors to participate effectively in governance and economic decision-making.The report stresses that both the IMF and the Pakistani government agree reducing corruption vulnerabilities is essential for sustainable reform.Anti-corruption measures are most effective when combined with broader governance-strengthening initiatives, the GCDA notes.Dawn reported that indicators show weak control of corruption over time, affecting public spending, revenue collection, and confidence in the legal system. The GCDA highlights systemic governance gaps across several functions of the state, including budgeting, fiscal reporting, capital spending, procurement, and oversight of state-owned enterprises.The assessment also points to a complex and opaque tax system managed by authorities with limited capacity and oversight, undermining overall performance. Pakistan’s judicial sector, it says, is inefficient and constrained by outdated laws, preventing reliable enforcement of contracts and protection of property rights, while organisational complexity and concerns about personnel integrity further weaken the system.Regarding procurement, the IMF demands the removal of preferences for state-owned enterprises in all public contracts, the elimination of direct contracting provisions, and mandatory adoption of e-governance procurement across all state transactions within 12 months. The first annual SIFC report must be published immediately, detailing all facilitated investments, concessions granted, and the rationale behind them.The GCDA highlights the need for the SIFC to develop explicit protocols and strengthen transparency measures due to its broad authority. It also questions the circumstances of its creation, noting that while the SIFC was set up to accelerate investment and privatisation, the Board of Investment continues to operate alongside it.The IMF report connects corruption vulnerabilities directly to fiscal performance. Pakistan’s declining tax-to-GDP ratio, it says, results from the complex tax system, frequent rule changes, and low public trust. Government discretionary spending remains substantial, with major gaps between approved budgets and actual expenditures, and limited parliamentary oversight.Dawn reports that discretionary allocations often favour districts represented by government officials or senior bureaucrats, reflecting a system vulnerable to political influence and resulting in low returns on public investment.",
  "summary": "Pakistan faces significant corruption challenges, warns the IMF, impacting economic growth. Urgent reforms are needed, including ending preferential treatment for state entities and boosting SIFC transparency. The IMF's assessment, crucial for a $1.2 billion loan, emphasizes increased transparency and accountability across state functions to unlock Pakistan's economic potential.",
  "published": "Fri, 21 Nov 2025 10:00:00 +0530",
  "url": "https://timesofindia.indiatimes.com/business/international-business/pakistans-economic-forecast-gdp-could-grow-5-6-5-imf-flags-corruption-risks/articleshow/125468758.cms",
  "source": "Times of India"
}