{
  "title": "Dem Senator Has Blunt Response To Concerns Party Members Might Be In Epstein Files",
  "text": "LOADING ERROR LOADING\n\nSen. Chris Murphy (D-Conn.) had a blunt response about the pending release of the Jeffrey Epstein files, and he doesn’t seem concerned about any fallout for the Democratic Party.\n\nAfter President Donald Trump posted on Truth Social that he had signed off on the bill that will allow all the Epstein documents to be released, CNN’s John Berman asked Murphy on Thursday his thoughts.\n\nAdvertisement\n\nBerman specifically wanted to know if Murphy was worried the documents might reveal the names of even more Democrats beyond former President Bill Clinton and former Harvard professor and Treasury Secretary Larry Summers.\n\n“What if there are more names connected to the Democratic Party that come out as a result of this?” Berman asked Murphy.\n\nMurphy had a blunt two-word response: “So what!”\n\nThe senator then conceded, saying, “I’m sure that there are Democrats in those files. There are Republicans in those files. There are, you know, Wall Street executives who have no political affiliation. What we want is to understand who was involved in this.”\n\nAdvertisement\n\nTrump’s slow-roll of the files’ release is not because he’s “selfless,” or trying to “[protect] his friends,” Murphy said, before adding, “it stands to reason that [Trump] he’s very much connected to this scandal,” but admitted “we may or may not know the extent of that, because it could be that the president is going to try to find a way to redact any information connected to him from those files.”\n\nMurphy then reiterated that to him, “it just doesn’t matter the political affiliation. The law is the law. They need to release the files.”\n\nYou can see Murphy’s comments in the clip below.\n\nCNN: What if there are more names connected to the Democratic Party that come out in the files?\n\n\n\nCHRIS MURPHY: So what? pic.twitter.com/JSpKemLgUx — Aaron Rupar (@atrupar) November 20, 2025\n\nAdvertisement\n\nTrump signed the Epstein bill after many attempts to slow-roll their release since July, when he was reportedly told by U.S. Attorney General Pam Bondi that he was mentioned extensively in the files.\n\nLast week, after the release of many files that showcased just how deep Trump’s friendship with the disgraced financier and sex trafficker, Trump, demanded the Justice Department and FBI investigate Epstein’s ties to powerful people ― but just the ones with Democratic ties, like Clinton, his former wedding guest.",
  "summary": "Connecticut’s Chris Murphy needed just two words to get his point across.",
  "published": "Thu, 20 Nov 2025 14:41:43 -0500",
  "url": "https://www.huffpost.com/entry/chris-murphy-epstein-files-concerns_n_691f4f7ae4b0448495235815",
  "source": "Politics"
}