{
  "title": "Labour MPs urge Reeves to drop private finance plans for NHS buildings",
  "text": "Rachel Reeves has been urged by 40 Labour MPs to drop plans to fund NHS buildings with private finance initiatives (PFI) that would saddle the health service with debt.\n\nThe Labour MPs, including Cat Eccles, Clive Lewis and Rebecca Long-Bailey, pressed the chancellor to commit to investment in the NHS without the use of private capital and warned that a return to the New Labour era of private funding for public projects would be damaging for trust in the government.\n\n“We are asking you to learn from the mistakes of the past. We must reject the notion that private finance can be used to build public services in a way that can be to the long-term benefit of the public,” they said in their letter. “We ask you to please drop any plans for new private finance in the NHS from the autumn budget and any future policy.”\n\nWhile it was originally conceived under the Conservatives, Tony Blair’s Labour government made significant use of PFI, a form of public-private partnerships used to build schools, hospitals and other public infrastructure, without adding to the national debt.\n\nIn their joint letter, the dozens of Labour MPs said using private partnerships was more expensive than publicly funded projects and had contributed to crippling debts in the NHS since 1997, with 80 trusts still paying back a combined £44bn while services are suffering.\n\n“As I am sure you are aware, using private finance to build new healthcare facilities does not bring in new money to the NHS – it is simply an expensive way of borrowing money which future generations of taxpayers will be required to pay back,” the MPs said.\n\n“Nor is it likely that using private finance will allow you to stay within your current rules on investment and borrowing, even if it is classed as off the public sector’s balance sheet.\n\n“The Office for Budget Responsibility indicated in 2017 that using ‘off-balance-sheet’ financing for public infrastructure to dodge borrowing rules amounts to a ‘fiscal illusion’ and that it should only be used if there is a clear value for money justification.\n\n“However, as the National Audit Office found in 2017 there is no evidence that these schemes are value for money, with PFI hospitals being 70% more expensive than the publicly financed option.”\n\nThe UK infrastructure strategy and the 10-year plan for health mention exploring the use of private capital for funding the building of NHS facilities, including neighbourhood health centres (NHCs).\n\nThe MPs pointed to analysis that suggests the use of private finance for small-scale projects represented even worse value for taxpayers than its use for bigger projects. NHCs are likely to be closer in character to those small-scale projects than to the big hospitals.\n\nMore than 50 academics, including the Labour peer and accountancy expert Prem Sikka, have already written to the chancellor asking her to “abandon this dangerous and damaging proposal and fund public services through direct taxation or borrowing”.\n\nThe Labour party’s manifesto at the general election stated that the NHS with Labour “will always be publicly owned and publicly funded”.\n\nWes Streeting, the health secretary, has already sought to reassure MPs that any new use of private finance in the NHS would be limited and targeted, and would aim to avoid the mistakes of PFI.\n\nA government spokesperson said: “This government is determined to shift health out of hospitals and into the community as set out in the 10-year-health plan.\n\n“As set out in our 10-year infrastructure strategy, we are exploring the feasibility of using new public private partnership (PPP) models for taxpayer-funded projects in very limited circumstances where they could represent value for money, such as in certain types of primary and community health infrastructure or for decarbonising the wider public estate.\n\n“The design and development of any future PPP models will build on lessons learned from past and current models.”",
  "summary": "<p>Chancellor told PFI-style schemes familiar from New Labour era are ‘fiscal illusion’ offering no value for money</p><p>Rachel Reeves has been urged by 40 Labour MPs to drop plans to fund NHS buildings with private finance initiatives (PFI) that would saddle the health service with debt.</p><p>The Labour MPs, including Cat Eccles, Clive Lewis and Rebecca Long-Bailey, pressed the chancellor to commit to investment in the NHS without the use of private capital and warned that a return to the New Labour era of private funding for public projects would be damaging for trust in the government.</p> <a href=\"https://www.theguardian.com/politics/2025/nov/21/labour-mps-urge-reeves-to-drop-private-finance-plans-for-nhs-buildings-pfi\">Continue reading...</a>",
  "published": "Fri, 21 Nov 2025 06:00:03 GMT",
  "url": "https://www.theguardian.com/politics/2025/nov/21/labour-mps-urge-reeves-to-drop-private-finance-plans-for-nhs-buildings-pfi",
  "source": "The Guardian"
}