{
  "title": "'You don't want to have the same drip': How a Houston Christian receiver became a shoe artist to the stars",
  "text": "Open Extended Reactions\n\nShoe artist and Houston Christian redshirt freshman receiver Deacon Stanfield, right, poses with Detroit Lions pass rusher Aidan Hutchinson holding one of his creations. Courtesy of Deacon Stanfield\n\nAfter Texas A&M's season-opening win over UTSA in August, Deacon Stanfield made his way down to a tunnel at Kyle Field. KC Concepcion met him there.\n\nThe Aggies' new star receiver was looking to do a handoff. He passed two pairs of his team-issued Adidas cleats to Stanfield. In exchange, the artist promised he would hook him up with more of his finest work.\n\nCustom cleats are a burgeoning business in the era of name, image and likeness, as college football players invest their own money into upgrading their in-game attire. When Concepcion and his Aggie teammates Rueben Owens II, Terry Bussey and Will Lee III are looking for something unique during their 10-0 start, they hit up their shoe guy in Houston.\n\n\"That's the whole thing: You don't want to look like everyone else, right?\" Stanfield said. \"You don't want to have the same drip as the guy next to you.\"\n\nStanfield has worked with Travis Hunter, Ryan Williams and Jeremiah Smith. He's painted cleats worn by pros such as Travis Etienne Jr., Emeka Egbuka and Carlos Correa. He's even painted custom Nikes for Caitlin Clark. He's been customizing shoes for six years -- and he just turned 20. What started as a high school hobby has evolved into a successful side hustle. When he's not spray-painting kicks, he's playing wide receiver and taking classes at Houston Christian. His teammates at HCU call him \"The Cobbler.\" Stanfield tries to slow down orders in the fall to focus on being an FCS student-athlete, but he'll make exceptions when high-profile athletes pop up in his Instagram DMs.\n\nHe started this passion in 2019. His art teacher in junior high assigned the class to paint something on an unconventional canvas, so Stanfield tried a pair of shoes. As he watched more tutorial videos on YouTube about the customizing process, he wanted to keep learning and saved up to buy an airbrush and compressor.\n\n\"A lot of it was self-taught,\" Stanfield said. \"I just started, and I ruined so many shoes in the process, just messing with my own shoes.\"\n\nHis father, Dusty, works in athlete marketing and helped get this hobby kick started with his connections. Deacon painted custom creations for NFL players Trayveon Williams and Case Keenum in 2020, but his first pair that garnered attention were \"Duck Hunt\"-themed Nike cleats for Hunter Renfrow, a pixelated tribute to the classic NES video game.\n\n\"Duck Hunt\"-themed Nike cleats for NFL receiver Hunter Renfrow. Courtesy of Deacon Stanfield\n\n\"I think with phones and devices taking up so much of their free time, it seems like kids these days are kind of delayed in finding their passion and finding what they really want to do,\" Dusty Stanfield said. \"So for him to figure that out, it's something as a parent that's very fulfilling to see.\"\n\nDeacon got opportunities to customize cleats for Etienne and several NFL players as part of the league's \"My Cause My Cleats\" campaign. He has also partnered with Panini, which has flown him in for Super Bowl week each of the past three years to create custom cleats for pro athletes at their hospitality suite. Every shoe helps as Stanfield tries to grow his brand and business.\n\nHe put on a brave face in a surreal setting for a teen, joking that his \"whole body was shaking\" as he handed custom Nike sneakers to Eli Manning before this year's Super Bowl in New Orleans. But nothing compared to the nerves of prepping a pair of Nike Blazer Mid '77 for Clark to commemorate her Rookie of the Year season with the Indiana Fever.\n\n\"She is literally the definition of aura,\" Stanfield said. \"When she walked in, it felt like the entire room stopped talking and looked at her. When she opened them, she looked over at me and was like, 'These are so cool. Did you make these?' It was definitely one of the coolest experiences of my life.\"\n\nStanfield with Caitlin Clark and her Rookie of the Year sneakers. Courtesy of Deacon Stanfield\n\nThis is an enterprise that wouldn't have been possible before the NIL era arrived and modernized college athletics in 2021. It's run by an active college athlete and supported by athletes who finally have disposable income to spend. Stanfield's timing couldn't have been better. And this fall, the Aggies are keeping him busy.\n\nStanfield did custom sets of maroon, black and white cleats for Bussey and former A&M quarterback Conner Weigman last year and was quickly deluged with more orders. He came up with black Louis Vuitton-themed cleats for linebacker Taurean York and green camouflage cleats for Weigman.\n\nNow he's producing new shoes for Concepcion, the SEC's third-leading receiver, every game this season. First it was black cleats with Chrome Hearts brand crosses and then gray Louis Vuitton cleats for the road win at Notre Dame. Stanfield got especially creative for the Aggies' throwback uniform against Florida, painting an A-10 'Warthog' shark mouth on gold cleats for Concepcion.\n\nKC Concepcion's A-10 'Warthog' shark mouth on gold cleats. Courtesy of Deacon Stanfield\n\nIt's not easy to run an airbrush-heavy business out of his Houston Christian dorm room, so Stanfield makes the 30-minute drive home to Fulshear, Texas, on Thursdays, his day off from football, to get his custom orders done out of his garage workspace.\n\nLast Thursday, he put in another marathon session in his workshop customizing four pairs of cleats over 11 hours. Concepcion, Owens, Bussey and Lee got them back just in time to wear them for the No. 3 Aggies' comeback win over South Carolina.\n\n\"I think it's super cool that Coach [Mike] Elko is relaxed about that,\" Stanfield said. \"Some coaches won't let their players wear anything other than black or white.\"\n\nHCU coaches have been no less supportive of Stanfield's entrepreneurship ever since he joined the program last year. The 6-foot, 160-pound scholarship receiver is on the Huskies' two-deep and travel squad this season and has played six games as a redshirt freshman.\n\nHe's learned how to design mock-ups on his tablet or phone because the prep phase for customizing a shoe can be lengthy.\n\nStanfield starts by sanding down the shoe's exterior and wiping it with acetone to strip the original factory finish, taping the soles and areas he won't paint. Typically, he says, this can take up to two hours -- if you're doing it right.\n\nOnce he's working with a clean canvas, it's time to airbrush several layers of acrylic leather paint while often incorporating stencils. Stanfield has been doing this long enough that he can mix paint and make Aggie maroon by eyeballing it. After he's done hand-painting and carefully detailing, the shoes get sprayed with a protective matte finish.\n\nStanfield can scroll through his camera roll and point to hundreds of cleats and shoes he's customized, but nothing has gone viral such as the pair he customized for Alabama's Ryan Williams last season. Williams ordered a custom pair from him during his senior year of high school and asked for another with his \"Hollywood\" nickname painted across Nikes last season. After Williams' breakout performance to beat Georgia, Stanfield did one more for him. Williams gave him creative license to paint whatever he liked.\n\nStanfield hand-painted a portrait of Williams with red braids over black Nikes. He even recreated the \"SC Top 10\" chain with gold and silver rhinestones. The pair took him at least 10 hours over several days to produce as he carefully painted the portrait, placed the stones and perfected the details.\n\nStanfield shared the shoes on his Instagram account, and Williams reposted them after Stanfield had gone to bed. Stanfield's jaw dropped the next day when SportsCenter's Instagram account shared his work with the world, in a post that got more than 113,000 likes.\n\nStanfield typically charges between $100 and $350 for these custom jobs depending on the difficulty.\n\nSome players ship him their team-issued shoes. Others ask him to find a particular pair and add it to the bill. He's not charging as much as many of the more established creators in this niche industry, mostly because he wants to stay affordable for high school and college athletes.\n\nKeisean Henderson, ESPN's No. 1 ranked quarterback recruit in the 2026 class, has ordered plenty from Stanfield, including a pair this offseason with his favorite Davy Crockett racoon-skin cap painted on the sides. The Houston commit collaborated with him again this summer on a black Louis Vuitton-style pair covered in UH emojis.\n\nKeisean Henderson's custon cleats. Courtesy of Deacon Stanfield\n\n\"He is one of one,\" Henderson told ESPN. \"He can take a thought from your mind and make it reality.\"\n\nThis is how Stanfield is trying to get his foot in the door in a competitive business by connecting with the next big stars before they blow up. Stanfield did three pairs of custom cleats for Ohio State superstar Jeremiah Smith during his 7-on-7 days with South Florida Express. He would love to work with Smith again, but the Buckeyes don't wear custom cleats during games.\n\nSome connections endure for years and some pop up in an instant with an unexpected DM. Last summer, he was scrolling through his message requests on Instagram and spotted one from Leanna De La Fuente. She was inquiring about pricing and was looking to surprise her fiancé. When he clicked on her profile and realized she was referring to Hunter, he was astonished and immediately replied.\n\nStanfield shipped custom black cleats that featured Hunter's Instagram handle. De La Fuente sent him a thank you video from the two-way star, who promised he would wear them for a game. The artist waited all season, wondering when Colorado's Heisman Trophy winner might break them out. Hunter saved the pair for his finale with the Buffaloes in the Alamo Bowl against BYU.\n\nCollege players who can afford customs are typically wearing them for only one game to complement a specific uniform combination, while high schoolers tend to wear them all season. Henderson, the No. 4 recruit in this year's SC Next 300, said he currently has four pairs of customs from Stanfield with more to come.\n\n\"You can stand out and express yourself without saying words,\" Henderson said. \"The game of football is made for you to stay in uniform. When I see the opportunity to make it my own, I try my best to showcase how I feel from my cleats.\"\n\nHouston Christian receiver Deacon Stanfield is making a name for himself off the field. Courtesy Deacon Stanfield\n\nBack at Houston Christian, Stanfield tries his best to juggle all his responsibilities. He wore his own work, a pair of orange Louis Vuitton cleats, throughout spring and fall practice with the Huskies. Bachtel credits offensive coordinator Mike Nesbitt for starting \"The Cobbler\" nickname in the spring, and it stuck with teammates. He's done color swap customs for a few of them, but they know he's already plenty busy at this time of year. The head coach would like a pair someday, too.\n\n\"I told him, 'Look, I'm not as flashy as you. I don't need all the Louis Vuitton and all that,'\" Bachtel joked. \"Just give me something we can wear in recruiting and maybe on the sidelines.\"\n\nAs much as he would like to someday go full time in shoe customizing, Stanfield says he's loving his experience in college football and not looking to fast-forward past it. Everybody tells him he'll miss it when it's over, so he's trying to enjoy it. He'll be back open for business in the offseason and eager to see what creative requests come next.\n\n\"I've never really thought of it as time-consuming,\" Stanfield said, \"because it's a job that doesn't feel like a job.\"",
  "summary": "Why Travis Hunter, Jeremiah Smith and Caitlin Clark have custom shoes from this Houston Christian freshman.",
  "published": "Thu, 20 Nov 2025 12:32:47 EST",
  "url": "https://www.espn.com/college-football/story/_/id/47025015/college-football-shoe-artist-stars-travis-hunter-jeremiah-smith-caitlin-clark",
  "source": "www.espn.com - TOP"
}