{
  "title": "Australia news LIVE: AFP address media after arrests over threats to federal politicians; Northern Territory braces for Tropical Cyclone Fina",
  "text": "Energy companies are demanding the Albanese government wait at least a year before forcing them to offer customers three free hours of power a day, warning the proposed rules threaten to destabilise the market and drive prices too high at other times.\n\nClimate and Energy Minister Chris Bowen this month unveiled the government’s so-called Solar Sharer scheme, a policy that will require retailers to offer free electricity to households in the middle of each day, when sunshine typically floods the grid with more power than it needs and causes wholesale prices to crater.\n\nLoading\n\nRetailers indicated they supported the intent of the reform: encouraging more people to use power when cheap renewable energy is most abundant could ease demand surges after sunset and smooth out volatile price swings.\n\nHowever, in a submission to the government on Friday, the industry argues the scheme needs more work and cannot be supported its current form.\n\n“The policy, in its present form, is not cost-reflective, introduces systemic risk and may lead to negative outcomes for the very consumers it is intended to help,” said the Australian Energy Council, which represents the nation’s top power generators and retailers.\n\nThe key problem, the submission said, was that the scheme mandated retailers offer $0 a kilowatt hour for a three-hour window without reforming other underlying costs that they must pass on. These include network tariffs for the use of power line infrastructure, which account for about one-third of a typical bill, and the cost of environmental certificates to demonstrate the use of renewable energy.\n\n“This regulatory asymmetry creates a guaranteed revenue shortfall on every unit of energy consumed during the period,” the energy council said.\n\nThe government’s new Solar Sharer plan will be opt-in, and initially available to residents in NSW, South Australia and south-east Queensland, where the Australian Energy Regulator sets safety-net conditions for people who do not take up special deals.\n\nHowever, unless other costs are also reformed, retailers said they would need to charge higher fixed rates and charges for afternoons and evenings to recoup their losses.\n\nThis could create a risk that customers who opt into the Solar Sharer plan, but end up unable to shift enough of their electricity usage into the free daylight hours, such as people who work during the day, could find themselves paying higher bills.\n\nThe energy council is calling for at least a 12-month extension to give the industry and government more time to develop parallel reforms and undertake the billing and technology system overhauls the scheme will require.\n\nBowen has assured retailers the government will “talk issues through” with companies, but vowed that consumers would be put first.",
  "summary": "Follow along as we bring you the latest live news updates from Australia and beyond.",
  "published": "Fri, 21 Nov 2025 17:33:12 +1100",
  "url": "https://www.smh.com.au/national/australia-news-live-pm-arrives-in-south-africa-for-g20-summit-nsw-liberals-meet-to-decide-new-leader-after-speakman-resigns-fatigue-cracks-found-in-cargo-plane-that-crashed-and-killed-14-20251121-p5nhao.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
  "source": "Sydney Morning Herald - Latest News"
}