{
  "title": "Nigerian separatist leader sentenced to life for terrorism",
  "text": "Nigerian separatist leader sentenced to life for terrorism\n\n13 hours ago Share Save Mansur Abubakar Abuja Share Save\n\nReuters Kanu was not in court when the verdict was delivered, after being removed for unruly behaviour\n\nA court in Nigeria has found separatist leader Nnamdi Kanu guilty of terrorism and other charges following a decade-long legal case full of drama. He has been given four life sentences, along with other terms, to be served concurrently. The prosecution had called for the death penalty but Judge James Omotosho said that executions were now \"frowned upon\". In his ruling he said he was satisfied that Kanu had made a series of broadcasts to incite violence and killings, as part of his campaign for a separate state in south-east Nigeria, known as Biafra. Kanu was convicted on all seven charges he faced. As well as terrorism, they included treason and involvement with an outlawed movement.\n\nKanu always denied the charges and challenged the court's jurisdiction. At the start of the trial he sacked his lawyers but refused to defend himself. He was not in court when the verdict was delivered, after being removed for unruly behaviour. Security around the courthouse in the capital, Abuja, was tightened ahead of the verdict in case of protests by Kanu's supporters. Once a relatively obscure figure, he came to national prominence in 2009 when he started Radio Biafra, a station that called for an independent state for the Igbo people, broadcast to Nigeria from London. Though he grew up in south-eastern Nigeria, where he attended the University of Nsukka, Kanu moved to the UK before graduating, and acquired British nationality. In 2014, he set up the Indigenous People Of Biafra (Ipob), a movement demanding independence. Ipob was banned as a terrorist organisation in 2017. Its armed wing - the Eastern Security Network - has been accused of killings and other acts of violence in recent years.\n\nDelivering his judgement, Justice Omotosho said: \"Mr Kanu knew what he was doing, he was bent on carrying out these threats without consideration to his own people. \"From the incontroverted evidence, it is clear that the defendant carried out preparatory act of terrorism. \"He had the duty to explain himself but failed to do so.\" Kanu is a popular figure in his movement's heartland in south-eastern Nigeria, but reaction to the verdict there has so far been muted. In court ahead of the ruling, Kanu insisted that proceedings could not continue because he had not yet filed his final written address, accusing the judge of bias and not understanding the law. The judgement was delivered after Kanu had been forcibly removed from the courtroom for unruly behaviour.\n\nGetty Images Nnamdi Kanu has a global network of supporters - this group had gathered in London earlier this month to demand his freedom\n\nHe was first arrested in October 2015 but he jumped bail in 2017 and left the country after a military raid on his home. The court later revoked his bail in March 2019. Two years later, the government announced that he had been re-arrested. His lawyers say he was detained in Kenya and forcibly returned to Nigeria. Kenya has not commented. In 2022, an appeal court ordered that the charges against him be dropped, saying he had been illegally arrested abroad, but this ruling was overturned by the Supreme Court the following year. The calls for Biafran independence date back many years. In 1967 Igbo leaders declared a Biafran state, but after a brutal civil war, which led to the deaths of up to a million people, the secessionist rebellion was defeated. Many Igbo people continue to feel that they are marginalised by the Nigerian state however, it is not clear how many are in favour of independence. Additional reporting from BBC Igbo's Ebere Ekeopara in Enugu\n\nGetty Images/BBC",
  "summary": "Nnamdi Kanu is found guilty of inciting violence as part of his campaign for a separate state in south-east Nigeria.",
  "published": "Thu, 20 Nov 2025 16:27:01 GMT",
  "url": "https://www.bbc.com/news/articles/cj3z38e6v45o?at_medium=RSS&at_campaign=rss",
  "source": "BBC News"
}