{
  "title": "The US Will Prioritize Visa Processing for Fans With World Cup Tickets",
  "text": "Gianni Infantino, the president of FIFA, visited the White House this week to announce with an initiative with Donald Trump that would give priority to World Cup ticket holders next year to process a US visa. This initiative is called “FIFA Pass.”\n\n“FIFA Pass is a prioritized appointment scheduling system,” Infantino said from the Oval Office. “So if you have a ticket for the World Cup, you can have a prioritized appointment to get your visa. Because, you said it the first time we met, Mr. President, America welcomes the world.”\n\nDespite the heavy travel restrictions that the US government has imposed during Trump's second term, the FIFA chief estimated that between 5 and 10 million people from around the world are expected to arrive in the country. “With this FIFA Pass we can make sure that those who buy a ticket that are legitimate soccer fans, they can come attend the World Cup in the best condition, starting from getting their visa.”\n\n\"We're going to do the same vetting as anybody else would get,\" said US secretary of state Marco Rubio, who was also present at the press conference. \"The only difference here is that we're moving them up in the queue.\"\n\nIn other words, having a ticket to go to the World Cup does not actually guarantee you a visa, nor does it reduce the fee to be paid. It simply reduces the waiting time for your interview with the consular officer. Rubio estimated that FIFA Pass holders could expect to wait six to eight weeks for that interview to take place.\n\nHow Does the FIFA Pass Work?\n\nTo access this privilege, you must first purchase a ticket through official channels to attend some of the 2026 World Cup matches that will be played in the United States. Then, the user must enter a FIFA portal, which will indicate the steps to follow in order to proceed with the visa application.\n\nTo expedite these procedures in the face of the anticipated increased demand for tourist visas, Rubio noted that the State Department has dispatched more than 400 additional consular officers around the world, and said that it is possible to obtain an appointment within 60 days at 80 percent of consulates and embassies.\n\nMinutes later, at the same press conference, Trump indicated that he was prepared to launch attacks against Mexico and Colombia to curb drug trafficking, and that the option of deploying troops on Venezuelan territory was not yet ruled out.\n\nThis story originally appeared in WIRED en Español and has been translated from Spanish.",
  "summary": "In the face of heavy travel restrictions imposed by the Trump administration, the United States announced that soccer fans going to the World Cup will enjoy a certain priority for processing tourist visa.",
  "published": "Wed, 19 Nov 2025 14:49:33 +0000",
  "url": "https://www.wired.com/story/the-us-will-prioritize-visa-processing-for-fans-with-world-cup-tickets/",
  "source": "WIRED"
}