{
  "title": "The infidelity saga of RFK Jr, Nuzzi and her ex is unspooling: ‘It’s like they’ve opened all their trench coats’",
  "text": "This week, Olivia Nuzzi – the US star political reporter known for her cozy access to top Republican figures – dropped an excerpt of her memoir, American Canto. In it, she detailed what she describes as an emotional affair with Robert F Kennedy Jr, who she calls “the politician”.\n\nNot to be outdone, Nuzzi’s ex-fiance and former Politico correspondent Ryan Lizza self-published an essay dishing on the day he found out Nuzzi was cheating on him, he claims – not with RFK Jr, as one might have expected, but with another former presidential candidate, Mark Sanford.\n\nThe mudslinging between two of the more polarizing personalities in a profession filled with egos delighted a media class that revels in navel-gazing, schadenfreude and generally messy behavior. Over the course of four days it had a lot of material to work with.\n\nFirst came a glamorous profile of Nuzzi in the New York Times Style section on Friday, in which she mugged for the camera while driving a convertible down the Pacific Coast Highway, and was described by the writer Jacob Bernstein as “a Lana Del Rey song come to life” and the “modern iteration of a Hitchcock blonde”. The profile provided some details of her “digital affair” with RFK, according to Nuzzi: how the now US health secretary told her he would take a bullet for her, how they never slept together, how she advised him on campaign issues (most notably the dead bear carcass story).\n\nThen, on Monday, Nuzzi’s memoir excerpts were published in Vanity Fair, the glossy that appointed her west coast editor in September. She wrote about feeling anxious about Kennedy’s reported brain worm, and said the scion soothed her after a doctor who saw his brain scans told him he was fine: “Baby, don’t worry.” She mused: “I did not have to worry about the worm that was not a worm in his brain.”\n\nThe latest entry into this unfurling drama came when Lizza published a “Part 1” of his side of the story on Monday night, using the metaphor of invasive bamboo growing behind the couple’s townhouse in Georgetown to describe Nuzzi’s secrecy in concealing an alleged affair with Sanford. Sanford, a former South Carolina governor and US representative who had weathered his own cheating scandal years prior, was profiled by Nuzzi for New York magazine during his short-lived 2020 election challenge to Trump. According to Lizza, Nuzzi became “infatuated” with the candidate after interviewing him.\n\nLizza placed this piece of information as a cliffhanger; presumably we must tune into an impending “Part 2” to read Lizza’s recounting of Nuzzi’s affair with RFK Jr.\n\nJournalism has a trust problem, and the fact that all this dirty laundry is getting aired is not going to help that Patrick R Johnson\n\nKennedy is married to actor Cheryl Hines, who has her own memoir out this month. He has denied Nuzzi’s claims of a sexual or romantic relationship, saying they only met once for an interview. He has not commented on the memoir excerpts. Nuzzi, Lizza, Kennedy and Sanford did not respond to requests for comment.\n\nAll of this makes for grade-A gossip. But while Nuzzi and Lizza are not household names outside the Beltway and New York media circles, their story has wider ramifications. Trust in the US press is at an all-time low; a recent Gallup poll found that just 28% of respondents expressed a “great deal” or “fair amount” of trust in newspapers, television and radio to report the news fairly and accurately. (That’s down from 31% in 2024 and 40% five years ago.)\n\n“Journalism has a trust problem, and the fact that all this dirty laundry is getting aired is not going to help that,” said Patrick R Johnson, an assistant professor of journalism at Marquette University. “Because two people with significant followings are behaving in this way, other people, everyday individuals, are going to make assumptions that more journalists are behaving this way, even though they aren’t. And that’s news literacy 101: people are making assumptions based on what they can see, whether or not that is what is happening.”\n\nThe image of a female journalist sleeping with her source titillates Hollywood (see: House of Cards or Clint Eastwood’s Richard Jewell, which portrayed a real-life but since deceased journalist bedding an FBI agent for tips, much to the anger of the journalist’s family and colleagues), the trope is mostly the stuff of fiction. It is also a major ethical violation, for obvious reasons – it creates a conflict of interest and a too-close relationship between reporter and source. As Moira Donegan wrote for the Guardian last year, revelations like the one about Nuzzi and RFK Jr only make it “harder” for the reporter’s peers to do their jobs and “cast all female professionals under the suspicion of corruptibility and unseriousness”. (The trope apparently once bothered Nuzzi herself; in 2015, she tweeted: “Why does Hollywood think female reporters sleep with sources?”)\n\nNuzzi, who is 32, burst on to the New York Twitterati scene as an intern in Anthony Weiner’s 2013 mayoral campaign and published an account of her experience in the New York Daily News. She parlayed this into a staff position at the Daily Beast while she was still a Fordham University undergraduate.\n\nNuzzi covered Trump’s political rise and went on to serve as New York magazine’s first Washington DC correspondent, filing gossipy profiles of people like Donald Trump, Stormy Daniels and Michael Cohen that often co-starred herself. Ahead of the 2024 election, she wrote about Joe Biden’s cognitive state, and profiled RFK Jr when he was but a long-shot independent candidate.\n\nNuzzi left New York magazine when their entanglement, which violated the publication’s standards around conflicts of interest and disclosures, was revealed shortly before the election. She wrote in a statement that the relationship “should have been disclosed to prevent the appearance of a conflict”, and apologized to her colleagues. She and Lizza broke up.\n\nLizza, who is 51, has his own baggage: in 2017, he was fired from the New Yorker after a sexual misconduct allegation emerged in the early days of the #MeToo movement. He denied the claims and went on to write for Esquire and Politico. The couple were supposed to publish a book on the 2020 election together that never materialized.\n\nIn the wake of their breakup, Nuzzi filed for a protective order against Lizza, claiming blackmail and harassment. Lizza denied her allegations, and Nuzzi withdrew her request for protection last November.\n\nIn his essay, Lizza painted himself as a casualty of a mercurial ex’s “betrayal”. “It’s almost as if he’s hurt that he was the victim of her decisions” regarding RFK Jr and Sanford, said Johnson, the journalism professor. “It’s as if he’s on this weird tour to fix his image from before.”\n\nIt certainly fuels the disdain that so many Americans have for journalists not being objective, not being neutral Mark Feldstein\n\nMark Feldstein spent 20 years as an on-air investigative correspondent at CNN, ABC News and other local affiliates. He is now the chair of broadcast journalism at the University of Maryland. He described the Nuzzi-Lizza story as “self-immolation on both their parts”.\n\n“This takes journalism self-branding to a crazy and extreme extent,” Feldstein said. “It certainly fuels the disdain that so many Americans have for journalists not being objective, not being neutral. This confirms the stereotype of journalists as self-promoting vultures wallowing in the gutter.”\n\nFeldstein recalled Geraldo Rivera’s 1991 memoir, Exposing Myself, which chronicled the journalist’s sexual exploits and was written off as unprofessional. “It was met with universal horror at the time among journalists, because it was such an outlandish, self-promoting, degrading publicity stunt,” Feldstein said.\n\nHowever, in the era of the attention economy, Nuzzi and Lizza’s tell-alls are all but expected. As Feldstein puts it: “It’s like they’ve opened their trench coats and exposed to all of us what they’re hiding underneath. It’s not a pretty sight.”",
  "summary": "<p>The rollout of reporter Olivia Nuzzi’s memoir has led to Ryan Lizza airing out her alleged affairs – and is fueling a dangerous stereotype about journalists</p><p>This week, Olivia Nuzzi – the US star political reporter known for her cozy access to top Republican figures – dropped an excerpt of her memoir, American Canto. In it, she detailed what she describes as an emotional affair with Robert F Kennedy Jr, who she calls “the politician”.</p><p>Not to be outdone, Nuzzi’s ex-fiance and former Politico correspondent Ryan Lizza self-published an essay dishing on the day he found out Nuzzi was cheating on him, he claims – not with RFK Jr, as one might have expected, but with <em>another </em>former presidential candidate, Mark Sanford.</p> <a href=\"https://www.theguardian.com/media/2025/nov/19/rfk-jr-olivia-nuzzi-ryan-lizza\">Continue reading...</a>",
  "published": "Wed, 19 Nov 2025 19:00:21 GMT",
  "url": "https://www.theguardian.com/media/2025/nov/19/rfk-jr-olivia-nuzzi-ryan-lizza",
  "source": "The Guardian"
}