{
  "title": "Ousted Bangladesh PM Sheikh Hasina sentenced to death for crimes against humanity",
  "text": "Bangladesh’s deposed prime minister Sheikh Hasina has been sentenced to death in absentia by a court in Dhaka for crimes against humanity over a deadly crackdown on a student-led uprising last year.\n\nA three-judge bench of the country’s international crimes tribunal convicted Hasina of crimes including incitement, orders to kill and inaction to prevent atrocities as she oversaw a crackdown on anti-government protesters last year.\n\nReading the verdict to the court, Justice Golam Mortuza Mozumder said the “accused prime minister committed crimes against humanity by her order to use drones, helicopters and lethal weapons” against civilians.\n\n3:13 Why has former Bangladesh PM Sheikh Hasina been sentenced to death? – video explainer\n\nHasina had pleaded not guilty to the charges and alleged the tribunal was a “politically motivated charade”.\n\nThe UN human rights office described the sentencing as “an important moment for victims” but said Hasina should not have been sentenced to death.\n\n“We have been calling for perpetrators – including individuals in positions of command and leadership – to be held accountable in accordance with international standards,” said a UN spokesperson, Ravina Shamdasani, adding: “We … regret the imposition of the death penalty, which we oppose in all circumstances.”\n\nThe months-long tribunal tried and sentenced Hasina in absentia. Since she fled the country in August last year, Hasina has been living in exile – and under protection – in neighbouring India, and the Indian government has ignored requests for her extradition to face trial.\n\nFamily members of killed protesters broke down in tears in the courtroom as judges handed death sentences to Hasina and the former home minister Asaduzzaman Khan, her co-accused in the trial.\n\nHasina’s absence from the defendant’s box was stark. In a statement released after the ruling, Hasina said she had not been given a “fair chance” to defend herself in court and claimed she had only acted in “good faith” to bring disorder under control.\n\nView image in fullscreen People wave Bangladesh’s national flag as they celebrate the court’s verdict in Dhaka. Photograph: Munir Uz Zaman/AFP/Getty Images\n\nShe said the verdict had been “made by a rigged tribunal established and presided over by an unelected government with no democratic mandate”.\n\nDhaka was on edge in the run-up to the decision, with security tightened across the capital and police, army and paramilitaries cordoning off the tribunal area. In the days before the verdict there was a sharp rise in political violence, including dozens of crude bombs set off across the city. Dhaka police issued a “shoot-on-sight” order for anyone caught launching explosives or setting fire to vehicles.\n\nOn Monday morning a crude bomb was hurled on to a road close to the court, setting off panic and prompting police to blockade the roads.\n\nThe protest that toppled Hasina began as a student movement and escalated into a nationwide uprising, now referred to as the “July revolution”, against Hasina’s authoritarian rule.\n\nHer 15 years in power were seen as a reign of terror by many in Bangladesh, marred by allegations of corruption, torture and enforced disappearances, which were documented by human rights organisations and the UN.\n\nIn response to the unrest, Hasina oversaw a ruthless, state-led crackdown, with documented use of live ammunition against civilians by police and security forces. The UN human rights office estimates up to 1,400 people were killed during the uprising, the worst political violence in Bangladesh since its 1971 independence war.\n\nThe prosecution of Hasina has been a core promise made by the interim government led by the Nobel laureate Muhammad Yunus, who was appointed to lead the country by protest leaders last year. The government appointed Mohammad Tajul Islam as chief prosecutor to build a case that would be heard by the international crimes tribunal in Dhaka.\n\nHasina was tried alongside her former police chief Chowdhury Abdullah al-Mamun. Mamun had pleaded guilty and turned state witness against Hasina in July. In the verdict, judges said the crimes committed by Mamun carried “capital punishment” but that he would be shown leniency for his cooperation.\n\nView image in fullscreen Bangladeshi soldiers stand guard outside the supreme court in Dhaka. Photograph: Rajib Dhar/AP\n\nIn a push for transparency, much of the tribunal proceedings were broadcast live. One of the key incidents highlighted by prosecutors was the killing of Abu Sayeed, a university student, who died after police fired at close range and whose killing – captured on camera – became a rallying cry for the uprising.\n\nThe prosecution described Hasina as “the mastermind, conductor and superior commander” of the July and August atrocities. The case cited audio recordings of calls made by Hasina to directly link instructions from the prime minister’s office to the deadly street operations.\n\nThe use of the international crimes tribunal to try Hasina had been met with some criticism by human rights groups. The court had been established by Hasina herself and her opponents have accused her of using it to pursue politically motivated cases while she was in power. Human Rights Watch said that despite some changes, it still fell short of fair-trial standards and safeguards while retaining the right to pass down the death penalty.\n\nThe Yunus government had rejected the criticism, saying the tribunal “functioned transparently, allowing observers and publishing regular documentation”.\n\nView image in fullscreen Student protests in Dhaka on 4 August 2024 Photograph: Monirul Alam/EPA\n\nFor families of those killed in the uprising, the verdict against Hasina brought some relief and catharsis. Golam Rahman, 55, lost his son Golam Nafis after he was shot on 4 August at the height of the unrest.\n\nRahman said the death sentence for Hasina was “the only acceptable verdict for what was done to my child. We buried a boy, not an enemy of the state. Nothing will bring him back, but the truth has to be said in court.”\n\nNafis’s last known photograph – of him lying in a three-wheeled pedal rickshaw as the puller tried to get him to the hospital – has circulated widely online and been stencilled as graffiti across Dhaka.\n\n“We, the families of martyrs in the uprising, want to see her hanged as an example to future rulers,” Rahman said. “Let no government think it can turn its guns on children and walk away.”\n\nBangladesh’s first election since the fall of Hasina is due to take place in early February. Her Awami League party has been banned from taking part. Though most of its leaders are in jail or in hiding abroad, the party has vowed to cause mass unrest in response.\n\nHasina’s son Sajeeb Wazed told Reuters that though his mother would remain “safe” in Delhi after the verdict, Hasina would not sit back quietly. “She’s upset, angry, outraged,” he said. “And we are all determined to fight back by whatever means necessary.”",
  "summary": "<p>Hasina sentenced in absentia by court in Dhaka over deadly crackdown on student-led uprising last year</p><p>Bangladesh’s deposed prime minister Sheikh Hasina has been sentenced to death in absentia by a court in Dhaka for crimes against humanity over a deadly crackdown on a student-led uprising last year.</p><p>A three-judge bench of the country’s international crimes tribunal convicted Hasina of crimes including incitement, orders to kill and inaction to prevent atrocities as she oversaw a <a href=\"https://www.theguardian.com/world/article/2024/aug/04/bangladesh-anti-government-protests-dhaka-sheikh-hasina\">crackdown on anti-government protesters</a> last year.</p> <a href=\"https://www.theguardian.com/world/2025/nov/17/ousted-bangladesh-pm-sheikh-hasina-found-guilty-of-crimes-against-humanity\">Continue reading...</a>",
  "published": "Mon, 17 Nov 2025 15:42:25 GMT",
  "url": "https://www.theguardian.com/world/2025/nov/17/ousted-bangladesh-pm-sheikh-hasina-found-guilty-of-crimes-against-humanity",
  "source": "World news | The Guardian"
}