{
  "title": "At least 41 dead as heavy rain, flooding and landslides hit central Vietnam",
  "text": "Forecasters warn more flooding, landslides expected as tens of thousands of people are evacuated from their homes.\n\nAuthorities in Vietnam say at least 41 people have been killed in a barrage of torrential rain, flooding and landslides, as rescue crews worked to save stranded people from the rooftops of submerged homes.\n\nRainfall exceeded 150cm (60 inches) over the past three days in several parts of central Vietnam, a region home to a key coffee production belt and the country’s most popular beaches.\n\nAt least 41 people have been killed across six provinces since Sunday, while the search was continuing for nine others, the environment ministry said on Thursday.\n\nMore than 52,000 houses were flooded, and nearly 62,000 people were evacuated from their homes, while several major roads remained blocked due to landslides, and one million customers were left without electricity.\n\nA suspension bridge on the Da Nhim River in Lam Dong province was swept away on Thursday morning, the VietnamNet newspaper reported.\n\nPhotos taken by the AFP news agency also showed hundreds of cars underwater as flooding inundated entire city blocks in Nha Trang, a popular tourist spot on the coast.\n\nLocal business owner Bui Quoc Vinh said his ground-floor restaurants and shops were under about a metre (3.2 feet) of water in the city.\n\n“I am worried about our furniture in my restaurants and shops, but of course I cannot do anything now,” he told AFP.\n\n“I don’t think the water is going to recede soon, as the rain has not stopped.”\n\nThe national weather forecast agency has warned of more flooding and landslides on Friday, with heavy rain set to continue in the region.\n\nAdvertisement\n\nDeputy Prime Minister Ho Quoc Dung told the leaders of three flood-affected provinces – Khanh Hoa, Dak Lak and Gia Lai – to mobilise the army, police and other security forces to “promptly relocate and evacuate people” to safe areas, according to a government statement.\n\nMeanwhile, state media reported that rescuers using boats in Gia Lai and Dak Lak pried open windows and broke through roofs to assist residents stranded by high water on Wednesday.\n\nPhotographs shared in state media reports showed residents, including children, sitting on the roofs of flooded houses and calling for help via social media platforms.\n\n“Any group out there please help! We’ve been sitting on the roof since 10pm last night, including kids and adults,” a resident of Khanh Hoa province posted on a local Facebook page.\n\nNatural disasters have left 279 people dead or missing in Vietnam and caused more than $2bn in damage between January and October, according to the national statistics office.\n\nThe Southeast Asian nation is prone to heavy rain between June and September, but experts say the climate crisis has made extreme weather events more frequent and destructive.",
  "summary": "Forecasters warn more flooding, landslides expected as tens of thousands of people are evacuated from their homes.",
  "published": "Thu, 20 Nov 2025 18:43:11 +0000",
  "url": "https://www.aljazeera.com/news/2025/11/20/at-least-41-dead-as-heavy-rain-flooding-and-landslides-hit-central-vietnam?traffic_source=rss",
  "source": "Al Jazeera – Breaking News, World News and Video from Al Jazeera"
}