{
  "title": "Trump calls Democrats' message to troops seditious behaviour, punishable by death",
  "text": "Trump calls Democrats' message to troops seditious behaviour, punishable by death\n\n5 hours ago Share Save Ana Faguy Share Save\n\nGetty Images\n\nPresident Donald Trump accused six Democratic lawmakers of \"seditious behaviour, punishable by death\", after they released a video urging US service members to refuse unlawful commands. \"This is really bad, and Dangerous to our Country. Their words cannot be allowed to stand. SEDITIOUS BEHAVIOR FROM TRAITORS!!! LOCK THEM UP???,\" Trump wrote on social media. The six lawmakers, all of whom have served in the military or intelligence community, called Trump's remarks dangerous and said they amounted to threats against elected officials. \"No threat, intimidation, or call for violence will deter us from that sacred obligation,\" they said in a joint statement.\n\nThe video by Democrats, which was shared by Michigan Senator Elissa Slotkin, features Arizona Senator Mark Kelly and Representatives Chris DeLuzio of Pennsylvania, Maggie Goodlander of New Hampshire, Chrissy Houlahan of Pennsylvania and Jason Crow of Colorado. Sen Kelly, who served in the Navy and is a former astronaut, says: \"Our laws are clear. You can refuse illegal orders.\" \"No one has to carry out orders that violate the law or our constitution,\" the lawmakers say in the video. \"This administration is pitting our uniformed military and intelligence community professionals against American citizens,\" it says. \"Like us, you all swore an oath to protect and defend this Constitution. Right now, the threats coming to our Constitution aren't just coming from abroad but from right here at home.\" The response from Trump on Thursday morning came in a series of posts on Truth Social. \"It's called SEDITIOUS BEHAVIOR AT THE HIGHEST LEVEL. Each one of these traitors to our Country should be ARRESTED AND PUT ON TRIAL. Their words cannot be allowed to stand — We won't have a Country anymore!!! An example MUST BE SET,\" he wrote in one post on Thursday. He went on to say: \"This is really bad, and Dangerous to our Country. Their words cannot be allowed to stand. SEDITIOUS BEHAVIOR FROM TRAITORS!!! LOCK THEM UP???\" In a third post, he wrote: \"SEDITIOUS BEHAVIOR, punishable by DEATH!\" Trump also reposted a TruthSocial post that read \"HANG THEM GEORGE WASHINGTON WOULD !!\" At a press briefing on Thursday, White House press secretary Karoline Leavitt rejected suggestions that Trump was calling for the execution of members of Congress. \"Many in this room want to talk about the president's response, but not what brought the president to responding in this way,\" she said, accusing the lawmakers of encouraging military personnel to defy \"lawful orders\".\n\nHeightened concern over US political rhetoric",
  "summary": "Trump's comments came after a group of Democrats urged US service members to refuse unlawful commands.",
  "published": "Fri, 21 Nov 2025 01:19:09 GMT",
  "url": "https://www.bbc.com/news/articles/cx2p2dz9zk2o?at_medium=RSS&at_campaign=rss",
  "source": "BBC News"
}