{
  "title": "West Bengal: Strong tremors jolt Kolkata; no damage reported yet",
  "text": "Strong earthquake tremors felt in Kolkata\n\nKOLKATA: An earthquake of magnitude 5.7 struck near Dhaka capital of Bangladesh on Friday. The tremors were reported in Kolkata and several parts of Northeast India, according to the US Geological Survey (USGS).The quake struck 13 km south-southwest of Narsingdi in the Bangladesh at 10.08am, and at a depth of 10 km, it said. Several people in Kolkata and other districts were seen coming out on the streets as a precautionary measure.Residents in Kolkata reported brief tremors around 10:10 am, describing them as lasting only a few seconds. Within minutes, videos of the moment began circulating widely on social media.Similar mild tremors were also felt in Guwahati, Agartala and Shillong, according to early reports.There was no immediate report of any injury or damage.In October, Bangladesh experienced a magnitude 3.4 earthquake, according to the National Centre for Seismology (NCS).Shallow quakes like this produce stronger shaking as seismic waves travel a shorter distance to the surface. Globally, earthquakes occur roughly every 30 seconds, though most are too minor to be noticed.Bangladesh sits at the junction of three tectonic plates—the Indian, Eurasian, and Burma plates.The Indian plate moves northeast at about 6 cm per year, while the Eurasian plate shifts north at roughly 2 cm annually.The country is crisscrossed by several major fault lines, including the Bogura, Tripura, Dauki, and Assam faults, as well as the Shillong Plateau, placing it within 13 earthquake-prone zones.High-risk areas include Chattogram, the Chattogram Hill Tracts, and Jaintiapur in Sylhet.Dhaka, with a population density exceeding 30,000 people per square kilometre, is among the world’s densest cities and ranks as one of the 20 most earthquake-vulnerable cities globally, according to The Daily Star.",
  "summary": "A magnitude 5.7 earthquake struck near Dhaka, Bangladesh, on Friday, with tremors felt across Kolkata and Northeast India. Residents in Kolkata reported brief shaking around 10:10 am, with many coming out onto the streets as a precaution. Similar mild tremors were also reported in Guwahati, Agartala, and Shillong, with no immediate reports of injuries or damage.",
  "published": "Fri, 21 Nov 2025 10:25:25 +0530",
  "url": "https://timesofindia.indiatimes.com/city/kolkata/strong-tremors-felt-in-kolkata/articleshow/125477566.cms",
  "source": "Times of India"
}