{
  "title": "Unelected Lords are blocking assisted dying – this is a democratic outrage | Simon Jenkins",
  "text": "If ever a British institution needed assistance in dying, it is the House of Lords. Its handling of the assisted dying bill on Friday of last week, continuing this week, is all but unconstitutional. A bill passed by the House of Commons after years of public debate is being blocked by a small group of peers under the pretence of scrutiny. Their purpose is to kill the bill by filibuster and impose their religious or moral views on the free will of others. They want to deny Britons a freedom now common in many liberal nations across the western world.\n\nWhen the bill came to the Lords, just seven peers were responsible for 617 of 1,034 amendments now attached to it. They included a requirement that no one should be helped to die if they have been abroad in the previous year, or unless five doctors have assessed the application, or if a doctor has discussed dying with the patient (a so-called gag clause). Many amendments flatly contradict ones considered and rejected by the Commons. They pay no deference to the support for the bill of what is now a clear majority of public opinion. The intention is not to scrutinise the bill, but to kill it by exceeding the four days allotted to it. Since it is a private member’s bill, the government has declined to help. It should now adopt it and force it through.\n\nMeanwhile, the issue remains high profile. A woman was questioned by the police and investigated for 10 months, before the CPS declined to prosecute her, all for accompanying her husband, terminally ill and in agony, to the Dignitas centre in more civilised Switzerland. For her dedication and compassion, the British state – aided by a group of peers – treats her like a suspected criminal. As for doctors who, for decades, have privately helped people through this most painful of family crises, they tell me they dare not do so, for fear also of police intervention in what some peers regard as conspiracy to murder.\n\nThis should take us back to the conservative elements in the Lords that attempted to oppose reforming governments of the 1830s and the 1910s. As for social reform, a Labour government under Harold Wilson in the 1960s found the courage and time to partly decriminalise homosexuality in England and Wales, permit abortion, reform the divorce laws and end state censorship of the theatre, most of it driven by Roy Jenkins in his brief two years at the Home Office. Today’s Labour party seems far removed from that era of what was dubbed “civilising Britain”.\n\nThe House of Lords is the only governing assembly outside the Muslim world in which clergy can sit ex officio. It must be one of the few in which membership can be bought and is therefore blatantly corrupt. It defends its existence on the grounds that a few of its number are bright and, as Peter Hennessy puts it, “good chaps”. This is undeniable, but hardly the point. The Lords’ composition is indefensible and its powers anti-democratic.\n\nSecond chambers are a good idea. If suitably composed, they can contribute to public debate, advise on legislation and serve on parliamentary committees and consultative bodies. They should not be able, as in this case, to overturn clear decisions reached by a democratic chamber. Least of all should they be free to impose their own moral views on the lives of British citizens.\n\nOf course safeguards must be in place to avoid abuse under any programme of reform. In the case of assisted dying, they can be studied in any of the countries that have already gone down this route to some extent. This includes such European states as Germany, Spain and the Netherlands as well as Canada, most of Australia and New Zealand and several US states. In none of them is suspicious or enforced suicide a serious issue, nothing calling for the often absurd “safeguards” raised in the House of Lords. State regulation should be to dignify and respect the freedom of individual choice, not deny it. The decision to end your own life must be the most personal and intimate of acts, shared above all with your loved ones. For peers to seek to make it a legislative and bureaucratic bunfight is obscene.\n\nIn an alarming number of areas of social reform – justice, prisons, narcotics – Britain now trails the liberal consensus among western nations. The government should not funk the issue or leave it to private members. The same applies in the case of political institutions. It took Westminster until 1999 to initiate an end to the hereditary right to sit in its parliament, a right still awaiting its termination. Meanwhile, the upper house remains in essence a retirement home for senior politicians and party donors. As such, it has predictably rendered itself immune to change by generations of ageing public figures. Its membership has soared to more than 820.\n\nIn 2016, the House of Lords’ constitution unit boldly declared the house would reform itself, starting with reducing its size. In the subsequent decade, it did nothing. This comedy is surely over. If Britain needs a second chamber of parliament – and I think it does – an outside commission should be formed and report at once. Meanwhile, the government should legislate to permit assisted dying.\n\nskip past newsletter promotion Sign up to Matters of Opinion Free weekly newsletter Guardian columnists and writers on what they’ve been debating, thinking about, reading, and more Enter your email address Sign up Privacy Notice: Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on theguardian.com to send you this newsletter. You can complete full registration at any time. For more information about how we use your data see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion",
  "summary": "<p>Second chambers are a good idea, but they should not be able to overturn clear decisions reached by an elected body</p><p>If ever a British institution needed assistance in dying, it is the House of Lords. Its handling of the assisted dying bill on Friday of last week, continuing this week, is all but unconstitutional. A bill passed by the House of Commons after years of public debate is being <a href=\"https://www.theguardian.com/society/2025/nov/13/peers-will-mount-fresh-offensive-to-halt-assisted-dying-bill\">blocked by a small group of peers</a> under the pretence of scrutiny. Their purpose is to kill the bill by filibuster and impose their religious or moral views on the free will of others. They want to deny Britons a freedom now common in many liberal nations across the western world.</p><p>When the bill came to the Lords, just seven peers were responsible for 617 of 1,034 amendments now attached to it. They included a requirement that no one should be helped to die if they have been abroad in the previous year, or unless five doctors have assessed the application, or if a doctor has discussed dying with the patient (a so-called gag clause). Many amendments flatly contradict ones considered and rejected by the Commons. They pay no deference to the <a href=\"https://www.kcl.ac.uk/news/assisted-dying-two-thirds-of-public-back-legalisation-within-this-parliament-study-finds\">support for the bill</a> of what is now a clear majority of public opinion. The intention is not to scrutinise the bill, but to kill it by exceeding the four days allotted to it. Since it is a private member’s bill, the government has declined to help. It should now adopt it and force it through.</p><p>Simon Jenkins is a Guardian columnist</p> <a href=\"https://www.theguardian.com/commentisfree/2025/nov/20/unelected-lords-blocking-assisted-dying-democratic-outrage\">Continue reading...</a>",
  "published": "Thu, 20 Nov 2025 16:04:22 GMT",
  "url": "https://www.theguardian.com/commentisfree/2025/nov/20/unelected-lords-blocking-assisted-dying-democratic-outrage",
  "source": "The Guardian"
}