{
  "title": "After Congress’s Bihar loss, a message from ally Stalin: Clarity, welfare, and groundwork win elections",
  "text": "Tamil Nadu Chief Minister M K Stalin’s statement on Sunday, issued hours after the INDIA bloc’s drubbing in Bihar Assembly polls, read like a subtle message to the Congress leadership: political clarity, coalition discipline and welfare-driven credibility, not centralised slogans, decide elections.\n\nCongratulating JD(U) president and NDA CM face Nitish Kumar on his “decisive victory” and wishing him well in meeting the expectations of Bihar’s people, Stalin also lauded RJD leader Tejashwi Yadav for his “tireless campaign”.\n\nReflecting further, the DMK chief said, “Election outcomes reflect welfare delivery, social and ideological coalitions, clear political messaging and dedicated management until the last vote is polled,” he wrote, words that many in the Opposition read as a carefully worded reminder to the Congress of what went wrong.\n\nThe Congress won just six of the 61 seats it contested, a historic low for the party in the state. For the INDIA bloc, of which Stalin is a senior architect, the Bihar verdict underscored a deep organisational and communication gap that could haunt its 2026 electoral calendar unless addressed swiftly.\n\nStalin’s remarks carried a second, sharper edge: a direct attack on the Election Commission. “The result of this election does not whitewash the misdeeds and reckless actions of the EC,” he said, arguing that the institution’s reputation “is at its lowest point” and calling for “a stronger and more impartial Election Commission, whose conduct of polls should inspire confidence even among those who do not win”.\n\nFor observers in Chennai and Delhi alike, Stalin’s post is both pragmatic and strategic. It signals that regional allies expect introspection within the Congress on messaging and ground management, while also keeping the narrative alive that India’s democratic institutions are under strain. His emphasis on “welfare delivery” mirrors the DMK’s own political grammar in Tamil Nadu, where social justice and state-led welfare remain core to its electoral strength.\n\nIn framing Bihar’s loss as “a lesson for everyone”, his tone is conciliatory, and the subtext is unmistakable: victories belong to those who stay rooted, communicate clearly, and organise relentlessly.",
  "summary": "",
  "published": "Sat, 15 Nov 2025 14:31:31 +0000",
  "url": "https://indianexpress.com/article/india/congresss-bihar-loss-mk-stalin-clarity-welfare-groundwork-win-elections-10367992/",
  "source": "India | The Indian Express"
}