{
  "title": "'I made mistakes on TV, he made his on a field' - Panesar responds to Smith",
  "text": "But referring again to the ball-tampering scandal against South Africa in 2018 that led to Smith's sacking as Australian captain, Panesar told Radio 5 Live: \"I've had some great moments for England and I've had shockers, and he's had some great moments for Australia and he's obviously had a very big shocker in South Africa.\n\n\"We've both made mistakes. I made mine on a quiz show, he made his on a cricket field.\"\n\nThe spat followed comments to a gambling website from the 43-year-old last week on how England should make Smith feel \"guilty\" about his part in the 'Sandpapergate' incident, where Australia's \"leadership group\" had a plan, carried out by Cameron Bancroft, to tamper with the ball to \"get an advantage\".\n\nSmith, 36, has often been taunted by fans over the scandal.\n\nAnd he brought up Panesar's Mastermind episode, calling it \"pretty comical\", when responding to the ex-bowler's views.\n\n\"Anyone who believes that Athens is in Germany, Oliver Twist is a season of the year, and America is a city, it doesn't really bother me those comments,\" Smith said in his pre-match news conference.\n\nWith Pat Cummins out with a back injury, Smith will lead Australia in the first Test, which begins at Perth Stadium on Friday.\n\nAnd Panesar, who played 50 Tests between 2006 and 2013, added: \"What makes it more sort of pleasing is that the night before the Test match, he's watching my Mastermind clips, memorising the questions and the answers.\n\n\"And it kind of feels like England are already in his head and I can rattle the Aussies from sitting on my sofa.\"",
  "summary": "Former England spinner Monty Panesar responds to Steve Smith's recent swipe by saying he made his mistakes \"on a quiz show\", while the stand-in Australia captain \"made his on a cricket field\".",
  "published": "Thu, 20 Nov 2025 16:20:24 GMT",
  "url": "https://www.bbc.com/sport/cricket/articles/cx2p29l8ddxo?at_medium=RSS&at_campaign=rss",
  "source": "BBC Sport"
}