{
  "title": "Video of school students doing manual labour lands headmaster in trouble in Jharkhand",
  "text": "Jharkhand’s Sahibganj district authorities have sought a report after getting complaints that a headmaster of a government school had made students do manual labour, allegedly forcing them to carry bricks and sand, sweep classrooms, and clean drains during school hours.\n\nThe incident came to light after a video of the students doing these tasks surfaced on social media.\n\nDilip Kumar, the in-charge headmaster of PM Shri Government Middle School at Rajmahal in Sahibganj, said he was hurt by the allegations and rejected claims that he forced students to do physical labour. He claimed the students were helping move some bricks as part of preparations for a school event.\n\nSchool Management Committee (SMC) president Sintu Yadav submitted a complaint against the headmaster to the Sahibganj Deputy Commissioner on Friday. The complaint, which had the signatures of parents as well as committee members, alleged that despite the presence of cleaning staff, the headmaster forced children to do physical labour — from carrying construction material and assisting masons to cleaning the school premises.\n\n“This was not a one-day incident,” Yadav told The Indian Express. “Sometimes they made the children work after two days, sometimes after five. When I confronted the headmaster, he said, ‘If the child doesn’t study, what else will he do? Let him do some small work.’”\n\nYadav alleged that this was a regular practice that had been normalised. “If a child begins to think school is a place for labour, one day, he will leave and think that at least outside, he will get paid,” he said.\n\nSuraj Mandal, a parent whose two children study at the school, said he had been raising this issue for months. “We complained many times, but nothing was done. Now that the video has gone viral, everyone can see what is happening,” he said.\n\nStory continues below this ad\n\nThe complaint letter also raised allegations of corruption in the midday meal scheme. Parents and guardians alleged that children are not provided the mandated quantity or quality of food. Eggs that are supposed to be served twice a week are given only once, and in some weeks, the meal is not cooked at all, it was alleged.\n\nSMC members also accused the headmaster of working in collusion with the same meal coordinator for 15 years, allegedly mismanaging funds and siphoning off government resources.\n\nRejecting the allegations against him, headmaster Dilip Kumar, who has been with the school for 13 years, said, “The children seen in the video are only helping move bricks left behind by a contractor as part of some school event preparations… It was not forced labour. These are all false allegations against me. They want to defame me.”\n\nSahibganj Deputy Commissioner Hemant Sati said he has sought a report from the District Education Officer regarding the viral video showing students of a middle school allegedly being made to work. “The matter is being inquired into, and the report is expected within a few days,” he said.",
  "summary": "",
  "published": "Tue, 18 Nov 2025 00:49:30 +0000",
  "url": "https://indianexpress.com/article/india/video-of-school-students-doing-manual-labour-lands-headmaster-in-trouble-in-jharkhand-10371503/",
  "source": "India | The Indian Express"
}