{
  "title": "How a baseball behemoth plans to get better? 3 questions as Dodgers eye three-peat",
  "text": "Open Extended Reactions\n\nLOS ANGELES -- The Dodgers greeted their fans at the tail end of their championship parade on Nov. 3, and virtually every player who grabbed the microphone atop a makeshift stage at Dodger Stadium expressed the same goal:\n\nThree-peat.\n\nOnly two franchises, the Oakland Athletics of the early 1970s and the New York Yankees of the late 1990s, have won three consecutive World Series titles since Major League Baseball introduced divisional play in 1969. And yet the current Dodgers are unabashed in their desire to do the same.\n\n\"It's not whether or not [or] how we're going to do it,\" Dodgers president of baseball operations Andrew Friedman said, \"it's just that we're going to be extremely driven and do everything we can to put ourselves in the best position to do it again.\"\n\nWhat that looks like, exactly, is a source of intrigue throughout the sport.\n\nPassan's MLB offseason preview From the big-name signings to the could-be trades, Jeff Passan breaks down the winter to come.\n\nPassan's offseason preview »\n\nThe Dodgers have spent the past two offseasons throwing around money at jaw-dropping levels. In signings and extensions, they added five nine-figure contracts to their payroll, which, for competitive-balance-tax purposes, stood at roughly $415 million in 2025. The industry seemed to bend to their will because of it. Now the Dodgers operate as a sort of boogeyman. Agents attach them to their clients in an attempt to drive up prices, rival executives worry they'll swoop in on trade targets they're eyeing.\n\nThe Dodgers, though, continue to fight an internal battle, one voiced by general manager Brandon Gomes at last week's general managers meetings in Las Vegas.\n\n\"How do you win this year,\" he asked rhetorically, \"without falling off that cliff?\"\n\nFriedman, Gomes and the rest of the Dodgers' decision-makers are constantly trying to balance winning now with winning later, an inexact science that periodically strays them from the middle. Over these past two winters, the Dodgers leaned heavily into the present. Now they hope to find more of a balance, said multiple sources familiar with their thinking, though to what degree remains to be seen.\n\nOn one side, the Dodgers are cognizant of how much depth they have coming back and how much older their roster has become. On the other, they're determined to maximize what Friedman has deemed this franchise's \"golden era,\" mindful of how a third straight title can cement that legacy.\n\n\"I think definitionally, it's a dynasty,\" Friedman said after watching his team claim a third championship in six years. \"But that to me, in a lot of ways, kind of caps it if you say, 'OK, this is what it is.' For me, it's still evolving and growing, and we want to add to it and we want to continue it and do everything we can to put it at a level where people after us have a hard time reaching.\"\n\nHow they do that will depend on how they answer three key questions.\n\nHow do they fix their bullpen?\n\nWith everything on the line in Game 7 of the World Series, Dodgers manager Dave Roberts deployed six starting pitchers, including his entire postseason rotation (Shohei Ohtani, Tyler Glasnow, Blake Snell and Yoshinobu Yamamoto) and two young starters who had become relievers out of necessity (Emmet Sheehan and Justin Wrobleski).\n\nIt said everything about how hard the Dodgers' bullpen fell in 2025, and yet it runs in stark contrast to the front office's staunch belief at this moment, according to sources -- that their bullpen depth should inspire confidence in 2026.\n\nThere's some truth to that. If everyone is healthy, seven of the Dodgers' eight bullpen spots are already accounted for: Tanner Scott, Blake Treinen, Alex Vesia, Evan Phillips, Brock Stewart, Brusdar Graterol and Anthony Banda. Then there are as many as eight optionable relievers on the 40-man roster, all of whom are promising in their own right: Edgardo Henriquez, Ben Casparius, Will Klein, Jack Dreyer, Paul Gervase, Bobby Miller, Kyle Hurt and Wrobleski, assuming the latter three remain in the bullpen.\n\nKeep up with the 2025-26 MLB offseason We've got you covered on all the major hot stove signings and trades.\n\nTracker » | Free agency, trade grades »\n\nThis certainly does not mean the Dodgers are set here. Their bullpen is coming off a season in which it posted a 4.27 ERA, 21st in the majors. And there are a litany of questions surrounding their returning arms, whether it's coming back from injury (Graterol and Phillips), advanced age (Treinen and Stewart), control issues (Henriquez, Klein, Hurt and Gervase) or stark memories of a disastrous 2025 (Scott). But if there is one thing to take away from all that, it's this:\n\nThe Dodgers will carry a high bar when it comes to their pursuit of bullpen help.\n\nA solidified closer, or at least one leverage arm capable of handling the ninth inning on a championship team, will be what they spend the most time on in the coming weeks. And though the trade option remains their ideal path, free agency is primed with standout closers. The headliner is Edwin Diaz, though the thought of a long-term deal and the presence of a qualifying offer might scare away the Dodgers. More likely is someone such as Devin Williams, who they've already expressed interest in, according to sources. And a tier below are a host of others who, like Williams, can be had for the type of short-term deal the Dodgers prefer, including Brad Keller, Pete Fairbanks, Emilio Pagan, Kyle Finnegan, Luke Weaver, Raisel Iglesias and Robert Suarez.\n\nHow badly do they need another bat?\n\nYou know what else the Dodgers didn't do all that well this past season? Hit. For a decent chunk of it, at least. Over a 33-game stretch from early July to mid-August, they batted .235 and averaged the sixth-fewest runs in the majors. Over their past three playoff rounds, they slashed a combined .213/.303/.364. If this sounds a bit harsh, well, it might be: 33 games represents only about 20% of the regular season, and hitting in the playoffs has proved to be quite difficult for any team. Keep this group intact, and on paper, it would represent arguably the best lineup in the sport.\n\nBut last season's lulls help to underscore another important point about the Dodgers' offseason: They can stand to add another bat, and chances are they will.\n\nThe easiest path is to add an outfielder, and this year's free agent options just so happen to be headlined by two of them in Kyle Tucker and Cody Bellinger. The Dodgers aren't expected to be one of the more aggressive suitors for Tucker, sources have indicated, but they'll remain on the periphery if his market collapses and a short-term, high-dollar deal becomes appealing to his representatives at Excel. They've also expressed interest in a reunion with Bellinger, according to sources, though it remains to be seen whether they'd be motivated enough to win a potential bidding war with the Yankees.\n\nESPN's Kiley McDaniel projects an 11-year, $418 million contract for Tucker, who turns 29 in January, and a much more modest six-year, $165 million contract for Bellinger, who will be 31 in July.\n\nThe cost for a Bellinger deal makes more sense, but so does his ability to play center field. The Dodgers are a far better defensive team if they can slide Andy Pages to right and shift Teoscar Hernández to left. Doing so would require an everyday center fielder, and perhaps it would be unfair to ask Tommy Edman to take that on in the wake of offseason ankle surgery. Bellinger -- a fourth-round pick by the Dodgers in 2013, a Rookie of the Year in 2017, an MVP in 2019 and a champion in 2020 before being non-tendered only two years later -- would fit the bill, and perhaps even slide to first base after Freddie Freeman's contract expires.\n\nBut the Dodgers can also sign someone such as Harrison Bader, whom they targeted at midseason, for less money, or, given the dearth of free agent outfielders beyond him, pivot to a trade option. Two players who might fit are Cleveland Guardians outfielder Steven Kwan and St. Louis Cardinals utility man Brendan Donovan, both of whom have a knack for putting together good at-bats and making contact. Some high-ranking members of the organization believe there is a need for more of that in their lineup, given the swing and miss of guys like Pages and Hernández. Addressing that could help limit the lulls.\n\nDo they need to get younger?\n\nMookie Betts gathered his teammates for a post-parade podcast recently, and at one point the 18-inning World Series game came up. Betts argued that the second half of it was boring, to which Clayton Kershaw playfully responded that, for everyone's sake, the offense should have ended it early.\n\n\"Our team's so old,\" Kershaw said. \"We were tired the next two [games].\"\n\nWhat Kershaw said off the cuff was something felt by many who watched the Dodgers, both inside and outside the organization. Playing the equivalent of two full games in Game 3 of the World Series seemed to drain them more than it did their opponents, as evidenced by lethargic performances in Games 4 and 5, during which the Dodgers totaled three runs and suffered back-to-back losses.\n\nThe average age of the Dodgers' position players was 30.7 this past season, making them the oldest group in the majors (slightly ahead of the Philadelphia Phillies at 30.3). Seven of their starting position players are now heading into their age-31 season or older, and all but one of them -- Max Muncy, whose 2026 option was picked up earlier this month -- are signed for multiple years.\n\nFriedman's longtime quest to balance the present with the future faces a difficult test with this current construction. Freeman, Betts, Ohtani and Will Smith will continue to be cornerstone players for years, but the Dodgers will spend some time this offseason wondering how they can plug in more youth around them.\n\nThey can do it the more conventional way, by slowly transitioning some of their upper-level prospects into everyday players (infielder Alex Freeland, outfielder Ryan Ward and catcher Dalton Rushing, who will return as Smith's backup but could get time at first base and in left field in 2026). Or they can make impact moves via trade.\n\nThe Dodgers have a glut of highly regarded outfield prospects at the moment, namely Josue De Paula, Eduardo Quintero, Zhyir Hope and Mike Sirota. The Dodgers' preference is to pluck from that group to address needs through a trade, according to sources. And though they can use them to access the closer they desire, they can also add young, controllable position players, ideally at second base, shortstop or center field. And if they need to dip into their starting pitching, River Ryan and Gavin Stone are returning from injury and don't have a spot in a six-man rotation given the presence of Yamamoto, Snell, Glasnow, Ohtani, Sheehan and Roki Sasaki.\n\nRyan and Stone, though, have options. The Dodgers, coming off setting franchise records by deploying 40 pitchers in back-to-back seasons, can simply stash them in the minors and wait until they're inevitably needed.\n\nOnce again, they can do everything and nothing.",
  "summary": "L.A.'s blueprint to bolster a two-time defending champion will be among MLB's biggest stories this winter.",
  "published": "Thu, 20 Nov 2025 19:29:26 EST",
  "url": "https://www.espn.com/mlb/story/_/id/47010507/mlb-2025-offseason-los-angeles-dodgers-hot-stove-three-questions",
  "source": "www.espn.com - TOP"
}