{
  "title": "Indian Test team: 'Not even allowed to fail' - Ex-cricketer questions Sarfaraz Khan's omission",
  "text": "Sarfaraz Khan\n\nNEW DELHI: Sarfaraz Khan ’s continued absence from the Indian Test team has led to questions from several former players. The Mumbai batter has not played a Test since November 2024.Meanwhile, former India cricketer Aakash Chopra said Sarfaraz has been affected by a perception issue. Sarfaraz has played six Tests so far, scoring 371 runs at an average of 37.10, with three fifties and one century. His highest score in Tests is 150.\"I think there is a clarity issue in the case of Sarfaraz. I think it is a case of perception and understanding. I am trying to think—they might have a perception that he may not do as well in swinging conditions or play fast bowling well. Maybe he is not our guy in SENA countries. So he did not get the chance. But even to make that perception, I have to allow him to fail. He is not even being allowed to fail. And now there is no place in the team as well,\" Chopra said on Shubhankar Mishra's YouTube channel.Chopra added, \"I think Sarfaraz should play, or else it would be unfair.\"Sarfaraz has also has had a difficult Ranji Trophy season so far, scoring 178 runs in five matches with one fifty.The right-hander batter’s returns are indeed low for the lofty standards he has set in the Ranji Trophy in the seasons preceding his India Test call-up. He made 556 runs in 2022-23 season in six matches at 92.66, piled up as many as 982 runs in 2021-22 at 122.75 in six matches, and before that, Sarfaraz smacked 928 runs in the 2019-20 season in six matches at 154.66.",
  "summary": "Meanwhile, former India cricketer Aakash Chopra said Sarfaraz has been affected by a perception issue. Sarfaraz has played six Tests so far, scoring 371 runs at an average of 37.10, with three fifties and one century. ​His highest score in Tests is 150.",
  "published": "Fri, 21 Nov 2025 05:30:00 +0530",
  "url": "https://timesofindia.indiatimes.com/sports/cricket/news/not-even-allowed-to-fail-former-cricketer-questions-sarfaraz-khans-omission-from-indian-test-team/articleshow/125468978.cms",
  "source": "Times of India"
}