{
  "title": "Bhutan PM on leading the first carbon-negative nation: ‘The wellbeing of our people is at the centre of our agenda’",
  "text": "The wealthy western countries most responsible for the climate crisis would improve the health and happiness of their citizens by prioritising environmental conservation and sustainable economic growth, according to the prime minister of Bhutan, the world’s first carbon-negative nation.\n\nBhutan, a Buddhist democratic monarchy and biodiversity hotspot situated high in the eastern Himalayas, is among the world’s most ambitious climate leaders thanks to its people’s connection with nature and a strong political focus on improving gross national happiness rather than just GDP, Tshering Tobgay told the Guardian.\n\n“Even with our limited resources and huge geographical challenges, we have managed to prioritise climate action, social progress, cultural preservation and environmental conservation because the happiness and wellbeing of our people and our future generations is at the centre of our development agenda,” Tobgay said in an interview. “If we can do it, developed rich countries with a lot more resources and revenue can – and must do a lot more to reduce their emissions and fight the climate crisis.”\n\nView image in fullscreen Tshering Tobgay in 2016. Photograph: Mike Bowers/The Guardian\n\nAs the UN climate summit enters its final few days, Bhutan’s climate pledge stands out as among the most ambitious with mitigation efforts across every sector of the economy, including boosting energy generation from hydro, solar, wind, distributed energy resource systems and piloting green hydrogen, as well as enhanced efficiency and regulations for transport, buildings and agriculture.\n\nBhutan is a landlocked nation sandwiched between India and China with a population of 750,000 people, about half of whom are subsistence farmers. In 2023, it became only the seventh country to graduate from the UN’s least developed country (LDC) category, thanks to significant progress over the last three decades since transitioning to democracy in areas such as poverty reduction, education and life expectancy.\n\nIt did so not by tearing up environmental regulations to incentivise economic growth but rather by tightening standards and prioritising air, water and land quality. “For us, gross national happiness is the goal, and GDP is just a tool which means economic growth cannot be detrimental to the happiness and wellbeing of our people,” Tobgay said.\n\nBut while lifting itself out of the LDC ranking represented an important milestone, it also reduced access to international climate finance, aid and technical assistance – even as climate shocks such as floods, drought and erratic rainfall increased.\n\nBhutan has contributed negligibly to global heating, and 72% of the territory is forested, making it a crucial carbon sink. It is among only a handful of countries with plans that are fully or almost compliant with the Paris agreement goal of limiting global heating to 1.5C above preindustrial levels, according to the Climate Action Tracker.\n\nBhutan’s focus on environmental and climate protection is not driven only by its commitment to the UN climate process. Bhutanese people believe their deities reside within all parts of the natural environment, which means forests and certain water bodies are off limits and mountaineering is banned. Bhutan is home to the highest unclimbed mountain, Gangkhar Puensum, which rises to more than 7,500 metres above sea level.\n\nAn entire article of the young democracy’s constitution is dedicated to protecting the environment, requiring at least 60% of the country to be under forest cover. It mandates the government and every citizen to contribute to the protection of the natural environment, conservation of the rich biodiversity and prevention of all forms of ecological degradation.\n\nTobgay said: “We are sequestering around five times the amount of carbon dioxide we emit We are taking care of our biodiversity, taking care of our forests. We are nature positive, carbon negative. Yet, because we are a landlocked mountainous country, we bear the brunt of climate change impacts.”\n\nMountain ranges are warming faster than the global average, causing Bhutan’s glaciers to melt and lakes to overflow. Floods have already displaced farming communities and the cost of road maintenance has more than doubled.\n\nskip past newsletter promotion Sign up to Down to Earth Free weekly newsletter The planet's most important stories. Get all the week's environment news - the good, the bad and the essential Enter your email address Sign up Privacy Notice: Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on theguardian.com to send you this newsletter. You can complete full registration at any time. For more information about how we use your data see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nView image in fullscreen Seventy-two per cent of Bhutan’s territory is forested, making it a crucial carbon sink. Photograph: Suzanne Stroeer/Getty Images/Aurora Open\n\n“The developed world must do more to fulfil their moral and legal obligations. They must help the developing world adapt and reduce emissions by providing finance and resource and technology transfers, but most importantly they must reduce their own emissions,” Tobgay said. “Small countries like Bhutan, we are actually doing a lot more than our fair share. The effects of climate change are disastrous, even for rich countries.”\n\nLast year at Cop29, Bhutan led the launch of an alliance with Panama, Suriname and Madagascar, three other carbon-negative or carbon-neutral countries, with the aim of gaining greater recognition and influence at the UN climate talks for the oversized contribution they make to global climate action.\n\n“In all the climate change discussions, the focus is on promises for the future, not on actual results,” Tobgay said. “We want our contributions and foregone opportunities to be acknowledged and compensated. This would incentivise other countries to not just aspire but actually work towards carbon neutrality as soon as possible. Too often bad behaviour is recognised and rewarded and good behaviour is not seen, it’s taken for granted. We’ve got to reverse that.”\n\nLeaders of the so-called G-Zero countries held talks during the UN general assembly in New York in September and agreed on an inaugural summit in Bhutan next year to showcase and share climate solutions and deliver a message to the developed world, which is lagging behind.\n\n“So you may be an industrialised country, you’ve reaped the rewards and spread the benefits of industrialisation throughout the world, but it’s time to now take stock of where we are. You don’t need to reverse industrialisation and economic growth but you need to make it sustainable,” Tobgay said.\n\n“GDP is for what? Reducing carbon emissions is for what? It has to be for the happiness and wellbeing of your people. Earth will survive no matter what we do. The urgency to control global warming, to fight climate change, is for us people now and for our future generations.\n\n“We are taking care of our people, our economy is growing, and at the same time we’ve been able to take care of our environment. If such small developing countries can do it, there’s no excuse that larger countries cannot play bigger roles. After all, they are the leaders of the world.”",
  "summary": "<p>Exclusive: Tshering Tobgay says his country is doing ‘a lot more than our fair share’ on climate and west must cut emissions ‘for the happiness of your people’</p><p>The wealthy western countries most responsible for the climate crisis would improve the health and happiness of their citizens by prioritising environmental conservation and sustainable economic growth, according to the prime minister of Bhutan, the world’s first carbon-negative nation.</p><p>Bhutan, a Buddhist democratic monarchy and biodiversity hotspot situated high in the eastern Himalayas, is among the world’s most ambitious climate leaders thanks to its people’s connection with nature and a strong political focus on improving gross national happiness rather than just GDP, Tshering Tobgay told the Guardian.</p> <a href=\"https://www.theguardian.com/environment/2025/nov/18/bhutan-pm-tshering-tobgay-first-carbon-negative-nation-climate-wellbeing\">Continue reading...</a>",
  "published": "Tue, 18 Nov 2025 15:00:51 GMT",
  "url": "https://www.theguardian.com/environment/2025/nov/18/bhutan-pm-tshering-tobgay-first-carbon-negative-nation-climate-wellbeing",
  "source": "World news | The Guardian"
}