{
  "title": "Astronomers discover thousands of hidden siblings of the “Seven Sisters”",
  "text": "Astronomers at the University of North Carolina at Chapel Hill have found that the well-known Pleiades star cluster, often called the \"Seven Sisters,\" represents only the bright center of a much larger community of related stars. By analyzing data from NASA's Transiting Exoplanet Survey Satellite (TESS) and the European Space Agency's Gaia space telescope, the team identified thousands of additional stellar relatives spread far across the sky. They refer to this enormous structure as the Greater Pleiades Complex, and their results show that the Pleiades is about 20 times larger than scientists once believed.\n\nMost stars, including the Sun, form within groups. As they age, these groups gradually disperse, which makes it difficult to track which stars were born together. Astronomers can use stellar rotation as a \"cosmic clock,\" since young stars spin quickly and older stars slow down over time. The UNC-Chapel Hill team used this technique to locate many long-lost members of the Pleiades spread far beyond the central cluster. With rotation data from NASA's TESS and precise measurements from ESA's Gaia, they concluded that the Pleiades is not a compact grouping but the dense core of a much larger and slowly dispersing stellar association.\n\n\"This study changes how we see the Pleiades -- not just seven bright stars, but thousands of long-lost siblings scattered across the whole sky,\" said Andrew Boyle, lead author and graduate student in physics and astronomy at UNC-Chapel Hill.\n\nCultural Significance and Expanding Scientific Insight\n\nThe discovery reaches beyond astrophysics. The Pleiades has long served as a key reference point for understanding young stars and exoplanets, and it holds cultural meaning across many societies. It appears in the Old Testament and the Talmud, is honored as Matariki in New Zealand, and is depicted in the logo of Subaru in Japan. \"We're realizing that many stars near the Sun are part of massive extended stellar families with complex structures,\" said Andrew Mann, co-author and professor of physics and astronomy at UNC-Chapel Hill. \"Our work provides a new way to uncover these hidden relationships.\"\n\nMapping Hidden Structures in the Milky Way\n\nBy studying how stars rotate, the researchers developed a new way to map our region of the Galaxy. Their findings suggest that many star clusters once thought to be isolated may actually belong to much larger stellar families. This method may eventually help scientists investigate the Sun's own origins and determine whether it formed within a similarly extensive stellar group.\n\n\"By measuring how stars spin, we can identify stellar groups too scattered to detect with traditional methods -- opening a new window into the hidden architecture of our Galaxy,\" Boyle said.\n\nUnderstanding How Solar Systems Form\n\nThe research contributes to ongoing efforts to reconstruct the environments in which stars and planets are born. These insights are essential for understanding how solar systems, including our own, take shape and evolve over time.\n\nThe research paper is available online in The Astrophysical Journal.",
  "summary": "The “Seven Sisters” have far more relatives than anyone imagined. Using NASA and ESA space telescopes, astronomers found thousands of hidden stars linked to the Pleiades, forming a colossal stellar complex. The discovery expands the cluster’s size by a factor of 20 and offers a new way to trace the shared origins of stars—including our own Sun.",
  "published": "Sun, 16 Nov 2025 23:02:16 EST",
  "url": "https://www.sciencedaily.com/releases/2025/11/251116105945.htm",
  "source": "All Top News -- ScienceDaily"
}