{
  "title": "PM Kisan Yojana 21st Installment 2025 LIVE Updates: ‘Focus on one acre, one season’; PM Modi pushes TN farmers for natural farming",
  "text": "Inaugurating the South India Natural Farming Summit 2025 and an exhibition, the Prime Minister released the 21st instalment of PM-KISAN, amounting to more than Rs 18,000 crore to support nine crore farmers across the country.\n\nPM Kisan Samman Nidhi Yojana 21st Installment Date 2025 LIVE Updates: Prime Minister Narendra Modi addressed the South India Natural Farming Summit in Coimbatore a while ago and remarked on agrarian subjects, including organic farming, crop diversification, and usage of fertilizers, among others. Pushing farmers of Tamil Nadu to indulge in natural farming, PM Modi urged them to focus on one acre, one season, and added that crop diversification, organic farming are the solutions to soil-related issues. Lauding the agriculture sector, PM Modi said, “India is on the path of becoming a global hub of organic farming.”\n\nReferring to the NDA’s win in the recently concluded Assembly Elections, Modi said, “When I was at the podium, I noticed many of my brothers twirling their ‘Gamchas’. In that moment, I thought the spirit of Bihar had arrived even before I did.” Ahead of the address, PM Modi released over Rs 18,000 crore as the 21st installment of PM-KISAN. The installment will support 9 crore farmers across the country. Each eligible farmer will receive Rs 6,000 annually in three equal instalments credited directly into bank accounts. Before he arrived in Coimbatore, Modi took part in the centenary celebrations of Sri Sathya Sai Baba at Puttaparthi in Andhra Pradesh.\n\nStory continues below this ad Summit agenda: As per a release, the summit aims to accelerate the shift towards natural and regenerative farming and will also focus on creating market linkages for farmer-producer organisations and rural entrepreneurs. Over 50,000 farmers, natural farming practitioners, scientists, organic input suppliers, sellers, and stakeholders from Tamil Nadu, Puducherry, Kerala, Telangana, Karnataka, and Andhra Pradesh will participate. Live Updates Nov 19, 2025 06:52 PM IST PM Kisan Yojana 21st Installment 2025 LIVE Updates: Embrace natural farming, says PM Modi Prime Minister Narendra Modi said, \"In recent years, the increasing demand for agricultural products has led to a rapid rise in the use of various chemicals in the sector. As a result, soil fertility is deteriorating, and the cost of farming is escalating. The solution lies in adopting crop diversification and natural farming practices. To restore soil fertility and enhance the nutritional value of crops, we must embrace natural farming methods. This approach is not only a necessity, but also a part of our vision for sustainable agriculture.\" Nov 19, 2025 05:32 PM IST PM Kisan Yojana 21st Installment 2025 LIVE Updates: 'One acre, one season': PM Modi's push for organic farming PM Modi said, \"For a Viksit Bharat, and to build a truly futuristic agriculture system, we all must work together. I would urge my farmer brothers and sisters to begin with ‘one acre, one season.’ Try practising natural farming on one acre of land for just one season, and in the coming years, proceed based on the results you achieve.\" Nov 19, 2025 04:51 PM IST PM Kisan Yojana 21st Installment 2025 LIVE Updates: Rs 10 lakh crore provided to farmers in past ten years, says PM Modi PM Modi said, \"In the past 11 years, the agriculture sector has seen a major transformation. Our agricultural exports have doubled. To modernise farming, the Government of India has opened many avenues to support farmers. Through KCC alone, assistance of more than Rs 10 lakh crore has been provided to farmers. The reduction of GST on bio-fertilisers has also helped farmers significantly.\" Nov 19, 2025 04:27 PM IST PM Kisan Yojana 21st Installment 2025 LIVE Updates: Here's what PM Modi said on use of pesticides Excessive use of chemical fertilisers, pesticides led to decrease in soil fertility, says PM Modi in Coimbatore. Nov 19, 2025 04:12 PM IST PM Kisan Yojana 21st Installment 2025 LIVE Updates: Focus on one acre, one season, PM Modi pushes TN farmers for natural farming In his push for natural farming, PM Modi urges farmers of Tamil Nadu to focus on one acre, one season. Nov 19, 2025 04:06 PM IST PM Kisan Yojana 21st Installment 2025 LIVE Updates: South India a living university of agriculture, says PM Modi If we go to Kerala and Karnataka, farming is done in multiple tiers there, and varieties of crops, including spices and other food items, are grown together, says PM Modi. Further, he said, South India is a living university of agriculture. Nov 19, 2025 03:51 PM IST PM Kisan Yojana 21st Installment 2025 LIVE Updates: PM Modi lauds Coimbatore's textile sector Coimbatore's textile sector is a big contributor to the economy, and now C P Radhakrishnan is the VP, increasing the contribution, says PM Modi. Nov 19, 2025 03:50 PM IST PM Kisan Yojana 21st Installment 2025 LIVE Updates: Organic farming close to my heart, says PM Modi Organic farming close to my heart, says PM Modi Nov 19, 2025 03:48 PM IST PM Kisan Yojana 21st Installment 2025 LIVE Updates: Agriculture exports doubled now, says PM Modi Our agriculture exports have doubled now, says PM Modi. Nov 19, 2025 03:45 PM IST PM Kisan Yojana 21st Installment 2025 LIVE Updates: Spirit of Bihar arrived even before I did, says PM Modi \"When I was at the podium, I noticed many of my brothers twirling their 'Gamchas'. In that moment I thought the spirit of Bihar had arrived even before I did.,\" PM Modi was quoted as saying by the BJP in a post on X. Nov 19, 2025 03:44 PM IST PM Kisan Yojana 21st Installment 2025 LIVE Updates: Coimbatore is a power centre, says PM Modi Prime Minister Narendra Modi has begun his address at the South India Natural Farming Summit and referred to Coimbatore as a power centre. Lauding the NDA’s win in the recently concluded Assembly Elections, Modi said the waves of Bihar are also felt here. Nov 19, 2025 03:35 PM IST PM Kisan Yojana 21st Installment 2025 LIVE Updates: PM Modi addresses South India Natural Farming Summit Greeting people of Tamil Nadu with a \"vannakam\", PM Modi has begun his address at South India Natural Farming Summit. Watch video https://twitter.com/BJP4India/status/1991084811839324500?s=20 Nov 19, 2025 03:34 PM IST PM Kisan Yojana 21st Installment 2025 LIVE Updates: PM Modi arrives in Coimbatore Prime Minister Narendra Modi has arrived in Coimbatore and is set to inaugurate the natural farming summit. Following his arrival, the prime minister held a roadshow from the airport to CODISSIA (Coimbatore District Small Industries Association) grounds, a distance of approximately 2 kilometers and people and party workers lined up on both sides of the road to welcome him. Nov 19, 2025 03:01 PM IST PM Kisan Yojana 21st Installment 2025 LIVE Updates: Tamil Nadu BJP launches '#VanakkamModi', calls him 'true friend of every farmer' Ahead of the Prime Minister’s visit, the Tamil Nadu BJP launched “#vanakkammodi”, calling him “a true friend of every farmer.” BJP Coimbatore South MLA and Mahila Morcha national president Vanathi Srinivasan said in a post on X, “The Prime Minister will arrive in Coimbatore today for a power-packed schedule. Roadshow planned at 1.05 pm – a grand display of Tamil Nadu’s unwavering support.” She added, “Coimbatore is all set to welcome a new wave of inspiration and development.” Nov 19, 2025 02:56 PM IST PM Kisan Yojana 21st Installment 2025 LIVE Updates: What's the agenda of the South India Natural Farming Summit? As per a release, the South India Natural Farming Summit, set to be inaugurated by Prime Minister Narendra Modi on Wednesday, aims to accelerate the shift towards natural and regenerative farming and will also focus on creating market linkages for farmer-producer organisations and rural entrepreneurs. Over 50,000 farmers, natural farming practitioners, scientists, organic input suppliers, sellers, and stakeholders from Tamil Nadu , Puducherry, Kerala, Telangana, Karnataka, and Andhra Pradesh will participate, PTI quoted. Over a post on X, Modi had earlier shared, \"The summit brings together many farmers, researchers, and innovators working in this field. The emphasis on sustainable, eco-friendly, and chemical-free agriculture practices is indeed commendable.\" He further said that the event was important as the 21st instalment of PM-Kisan will be released to the \"hardworking farmers across the country.\" Nov 19, 2025 02:53 PM IST PM Kisan Yojana 21st Installment 2025 LIVE Updates: PM Modi to inaugurate natural farming summit in Coimbatore, release PM-KISAN funds today Prime Minister Narendra Modi is set to inaugurate the South India Natural Farming Summit in Coimbatore on Wednesday and release over Rs 18,000 crore as the 21st installment of PM-KISAN. The installment will support 9 crore farmers across the country. Each eligible farmer will receive Rs 6,000 annually in three equal instalments credited directly into bank accounts. Modi will arrive in the city at 1.30 pm from Andhra Pradesh after taking part in the centenary celebrations of Sri Sathya Sai Baba at Puttaparthi. Nov 19, 2025 02:52 PM IST Good afternoon, Welcome to our live blog. Follow here for the latest updates on PM-KISAN funds and scheme here!\n\nStay updated with the latest - Click here to follow us on Instagram\n\n© IE Online Media Services Pvt Ltd",
  "summary": "",
  "published": "Wed, 19 Nov 2025 09:15:22 +0000",
  "url": "https://indianexpress.com/article/india/pm-kisan-samman-nidhi-yojana-21st-installment-2025-live-kab-aayegi-beneficiary-list-status-live-updates-10374209/",
  "source": "India | The Indian Express"
}