{
  "title": "The Premier League players topping the unusual stats tables this season",
  "text": "You know that Erling Haaland is the top scorer in the Premier League and that David Raya is great at keeping them out at the other end of the pitch, but what about the quirkier metrics? Who covers the pitch but sees the penalty area as their kryptonite? Which defender loves one-v-one battles? Who prefers to shoot without taking a touch to settle themselves?\n\nBruno Fernandes\n\nMost shots from outside the box without scoring\n\nBruno Fernandes hasn’t had much luck from shooting outside the box this season. He has attempted 12 shots from range without success, coming closest in the draw at Nottingham Forest, with his low shot striking the foot of a post.\n\nThe fact that only Kevin De Bruyne (15) has scored more goals from outside the box in the Premier League than Fernandes (14) since the Manchester United captain’s debut in February 2020 suggests his luck will change. Maybe it’s time for him to come off free-kick though; h has scored only three of his 60 shot attempts from free-kicks in the Premier League (5%), including two unsuccessful efforts this season.\n\nMichael Kayode\n\nLong throws into the opposition’s box\n\nLong throws are back in fashion. That makes Michael Kayode even more important than usual, with the Brentford defender chucking more of them into the opposition’s box than any other player in the Premier League this season.\n\nKayode has launched 54 long throws into the opposition’s box, eight more than second-placed Nordi Mukiele and 25 more than Chris Richards in third. More importantly, six of his long throws into the penalty area have led to a shot – four more than any other player – and two have led to goals.\n\nIgor Jesus\n\nHighest xG without scoring\n\nIgor Jesus hasn’t had a problem scoring for Nottingham Forest in cup competitions this season. The 24-year-old Brazilian has scored five goals from 13 shots across the League Cup and Europa League, but the Premier League has been a more difficult proposition for him.\n\nHe’s yet to score in 10 league games since joining Forest from Botafogo in the summer, despite having 13 shots. He is the player to have the highest expected goals figure this season without scoring (1.86). At least he isn’t the player with the most shots without scoring – that is Bournemouth’s David Brooks (16 shots, no goals).\n\nFlorian Wirtz\n\nMost shot involvements without a goal or assist\n\nIt’s been a tricky start for Florian Wirtz. In 11 appearances, none of the 16 chances he has created have become assists, which is hardly on him, but he’s also recorded 12 shots without success. That’s 28 chances and no goals.\n\nThierry Henry struggled at the start of his Premier League career – when he was also 22 and arriving from a different country – with only one goal and no assists in his first 12 appearances. But then things started to click and we know the rest.\n\nJack Grealish\n\nExpected assists from open play\n\nJack Grealish tops the open-play assist charts with four, but sometimes assists can be misleading. In order to assess the true creative quality of a player’s passes, expected assists (xA) offers a deeper understanding of how likely a pass is to become an assist.\n\nxA is measured on a scale between zero and one, where zero represents a pass that will never result in an assist, and one represents a pass that the receiver would be expected to score from every single time. Grealish’s passes in open play this season have totalled 2.47 xA, higher than any other player in the division. Interestingly for Everton fans, another of their players ranks second in this metric: Iliman Ndiaye (2.40), just above Jérémy Doku (2.14) and Bukayo Saka (1.94).\n\nErling Haaland\n\nFirst-time shots from open play\n\nErling Haaland has been in electric form, scoring 14 goals in the opening 11 games. What is more surprising is how often he takes first-time shots in open play. Of his 44 open-play shots this season, 26 have come without any prior touch (59.1%) and eight of his 14 goals have come with a first-time finish.\n\nThat is more than any other player in the league, but only just. Jean-Philippe Mateta has had 30 shots in open play and 25 of those have been first-time attempts (83.3%).\n\nCarlos Baleba\n\nMost touches without one being in opposition’s box\n\nEleven players have scored for Brighton this season, but don’t expect the midfielder Carlos Baleba to join that group soon. Despite having 371 touches in 11 appearances this season, none of them has come inside the opposition’s penalty area.\n\nThat’s the most touches by an outfielder without any coming in the opposition’s box this season, 79 more than Axel Tuanzebe (292). During his time in the Premier League, Baleba had 3,230 touches, with only 19 of them in the opposition’s box (0.006%).\n\nView image in fullscreen Opta\n\nRyan Sessegnon\n\nMost fouls without receiving a card\n\nRyan Sessegnon could be considered the most fortunate player to not have entered the referee’s notebook as he has committed 20 fouls without receiving a single card, four more than Pape Matar Sarr (16) and five more than his Fulham teammate Raúl Jiménez (15). Going back to last season, none of Sessegnon’s past 25 fouls have seen him booked.\n\nAt the other end of the scale, three players have committed fewer than 10 fouls but still been given four yellow cards this season: Álex Jiménez (five fouls), Tim Iroegbunam (six) and James Garner (eight).\n\nJérémy Doku\n\nMost carries ending in opposition’s box\n\nJérémy Doku has shown how dangerous he is when running with the ball at his feet, leading the rankings for chances created following a ball carry (11). There aren’t many players who can wriggle their way through tight spaces to create chances for teammates as well as the Belgian winger, and his ball-carrying ability has taken him into the opposition’s penalty area more often than anyone else.\n\nDoku leads the rankings for ball carries ending in the opposition’s box (72), with his tally 19 more than the next highest players, Jack Grealish and Cody Gakpo (53).\n\nView image in fullscreen Jérémy Doku was sensational in City’s 3-0 win against Liverpool. Photograph: Michael Regan/Getty Images\n\nMaxence Lacroix\n\nBest one-v-one defender against dribblers\n\nOf players to have faced at least 20 dribbles, the Crystal Palace defender Maxence Lacroix has won the highest percentage of his tackles (87%), just above his central defensive partner Marc Guéhi (81.5%).\n\nOf defenders, Kieran Trippier has the worst success rate in stopping dribblers. The Newcastle full-back has won just 32.3% of his one-v-one battles, committing 10 fouls and seeing his opponent dribble past him on another 11 occasions.\n\nGranit Xhaka\n\nDistance run\n\nSunderland have started the season brilliantly and few players have stood out more than Granit Xhaka. The 33-year-old has covered more ground than any other player in the Premier League this season, running 124.06km. Elliot Anderson is second (122.44km), with Xhaka’s teammate Noah Sadiki in third (122.33km).\n\nIgor Thiago\n\nHigh pressures applied in the final third\n\nIgor Thiago endured a frustrating first season at Brentford. Hindered by injury, the forward played only 168 minutes across eight appearances in the league. Now fit, the Brazilian has become an integral part of Keith Andrews’s side. Only Erling Haaland (14) has scored more goals than he has (eight).\n\nHe works incredibly hard off the ball too. He leads the rankings for high pressures applied across the whole pitch (609) but, more importantly for Brentford, he also leads the way when it comes to high pressures applied in the final third of the pitch (270).\n\nView image in fullscreen Opta\n\nEmiliano Buendía\n\nMinutes played as a substitute\n\nEmiliano Buendía has been a handy option for Aston Villa off the bench. The Argentinian has played more minutes as a substitute than any other player (200), and his impact has made a difference. No player has been involved in more goals as a sub than he has (three: two goals and one assist). He also leads the rankings for shot involvements as a sub (11: six shots, five chances created) alongside Omari Hutchinson and Estêvão. In fact, he’s been involved in more goals as a sub (three in 200 minutes) than he has as a starter (two in 229 minutes) this season for Villa.\n\nThis is an article by Opta Analyst",
  "summary": "<p>Which players have run the furthest, taken the most long throws and fouled the most without seeing a card?</p><p>By <a href=\"https://theanalyst.com/\">Opta Analyst</a></p><p>You know that Erling Haaland is the top scorer in the Premier League and that David Raya is great at keeping them out at the other end of the pitch, but what about the quirkier metrics? Who covers the pitch but sees the penalty area as their kryptonite? Which defender loves one-v-one battles? Who prefers to shoot without taking a touch to settle themselves?</p> <a href=\"https://www.theguardian.com/football/2025/nov/20/premier-league-players-topping-unusual-stats-this-season\">Continue reading...</a>",
  "published": "Thu, 20 Nov 2025 18:02:25 GMT",
  "url": "https://www.theguardian.com/football/2025/nov/20/premier-league-players-topping-unusual-stats-this-season",
  "source": "The Guardian"
}