{
  "title": "First direct observation of the trapped waves that shook the world in 2023",
  "text": "In September 2023, a bizarre global seismic signal was observed which appeared every 90 seconds over nine days -- and was then repeated a month later. Almost a year later, two scientific studies proposed that the cause of these seismic anomalies were two mega tsunamis which were triggered in a remote East Greenland fjord by two major landslides which occurred due to warming of an unnamed glacier. The waves were thought to have become trapped in the fjord system, forming standing waves (or seiches) that undulated back and forth, causing the mystery signals.\n\nHowever, up to now no observations of these seiches existed to confirm this theory. Even a Danish military vessel which visited the fjord three days into the first seismic event did not observe the wave which was shaking the Earth.\n\nIn the new study, the Oxford researchers used novel analysis techniques to interpret satellite altimetry data. This measures the height of the Earth's surface (including the ocean) by recording how long it takes for a radar pulse to travel from a satellite to the surface and back again. Up to now, conventional satellite altimeters were not able to capture evidence of the wave due to long gaps between observations, and the fact that they sample data directly beneath the spacecraft, producing 1D profiles along the sea-surface. This makes them incapable of depicting the differences in water height needed to spot the waves.\n\nThis study used data captured by the new Surface Water Ocean Topography (SWOT) satellite, launched in December 2022 to map the height of water across 90% of Earth's surface. At the heart of SWOT is the cutting-edge Ka-band Radar Interferometer (KaRIn) instrument, which uses two antennas mounted on a 10-meter boom on either side of the satellite. These two antennas work together to triangulate the return signals that bounce back from the radar pulse -- enabling them to measure ocean and surface water levels with unprecedented accuracy (up to 2.5 meters resolution) along a swath 30 miles (50 kilometers) wide.\n\nUsing KaRIn data, the researchers made elevation maps of the Greenland Fjord at various time points following the two tsunamis. These showed clear, cross-channel slopes with height differences of up to two metres. Crucially, the slopes in these maps occurred in opposite directions, showing that water moved backwards and forwards across the channel.\n\nTo prove their theory, the researchers linked these observations to small movements of the Earth's crust measured thousands of kilometres away. This connection enabled them to reconstruct the characteristics of the wave, even for periods which the satellite did not observe. The researchers also reconstructed weather and tidal conditions to confirm that the observations could not have been caused by winds or tides.\n\nLead author Thomas Monahan (DPhil student, Department of Engineering Science, University of Oxford) said: \"Climate change is giving rise to new, unseen extremes. These extremes are changing the fastest in remote areas, such as the Arctic, where our ability to measure them using physical sensors is limited. This study shows how we can leverage the next generation of satellite earth observation technologies to study these processes.\"\n\n\"SWOT is a game changer for studying oceanic processes in regions such as fjords which previous satellites struggled to see into.\"\n\nCo-author Professor Thomas Adcock (Department of Engineering Science, University of Oxford) said: \"This study is an example of how the next generation of satellite data can resolve phenomena that has remained a mystery in the past. We will be able to get new insights into ocean extremes such as tsunamis, storm surges, and freak waves. However, to get the most out of these data we will need to innovate and use both machine learning and our knowledge of ocean physics to interpret our new results.\"",
  "summary": "A new study has finally confirmed the theory that the cause of extraordinary global tremors in September -- October 2023 was indeed two mega tsunamis in Greenland that became trapped standing waves. Using a brand-new type of satellite altimetry, the researchers provide the first observations to confirm the existence of these waves whose behavior is entirely unprecedented.",
  "published": "Tue, 03 Jun 2025 11:50:15 EDT",
  "url": "https://www.sciencedaily.com/releases/2025/06/250603115015.htm",
  "source": "Latest Science News -- ScienceDaily"
}