{
  "title": "‘Relationships deteriorated’: Laurent Koscielny on leaving Arsenal and his work at Lorient",
  "text": "Returning to Brittany was the obvious choice for Laurent Koscielny. Having left Lorient for Arsenal in 2010, the former defender is back at the Ligue 1 side as the sporting director.\n\n“My wife and I were keen to come back, it’s a beautiful region, and the people are welcoming and kind,” the Frenchman says of the seaside town, known for its annual Celtic music festival and military naval base.\n\nAfter ending his playing career with an ill-fated spell at Bordeaux, Koscielny initially rejoined Lorient as a youth coach. He became part of the upper management when Les Merlus [the Hakes] were relegated in 2024. “The challenge was to return to Ligue 1 the next season for the club’s centenary year.” The club would go straight back up as champions.\n\nAlthough Koscielny initially looked to “keep all doors open”, having taken coaching and sports management courses, the 40-year-old now has a clearer idea of where to take his career. “As sporting director, I get to have a relationship with everyone at the club. I really have an overall view of things, whether it’s finances, marketing, or what happens on the pitch.”\n\nKoscielny often uses the word pérennité, sustainability, when talking about his plans for the club: “It’s good to be ambitious, it’s even better to be grounded,” the former France defender says. He cites the cautious approach of Lorient’s neighbours Brest, whose unlikely title push two years ago led to a Champions League campaign.\n\n“I’ve arrived during a difficult period for French football,” he says, pointing to the successive broadcasting rights crises which have decimated finances. “It does allow us to get back to what we’re good at, though. When you have money, you want to spend it.”\n\nLorient’s ties with the Bournemouth owner, Bill Foley, have led to player exchanges and the American is poised to go from minority to majority shareholder. “I’d say that we’re quite similar clubs,” Koscielny says. “We’re both in seaside towns, with stadiums on the smaller side, and we develop young players.\n\nView image in fullscreen Laurent Koscielny sees similarities between Lorient and Bournemouth with the clubs sharing ties under the investment of Bill Foley. Photograph: Damien Meyer/AFP/The Guardian\n\n“It’s good for our development to work with clubs like that. You can’t just copy and paste, though, because every club is a different environment. We have an identity, and we shouldn’t lose it.”\n\nWhen Lorient needed a replacement for the Bournemouth-bound top scorer Eli Junior Kroupi last summer, Koscielny nearly orchestrated a reunion with his former Arsenal teammate Olivier Giroud. “I’m still in touch with Olivier, and I knew that things weren’t going as he’d hoped in the US and that he might want to return to Europe. I tried to nudge him a bit to test the waters, but it didn’t happen in the end.” Giroud went on to sign for Lille.\n\nThe overarching plan, though, is to invest primarily in young players. “Once they’ve gone as far as they can with us, they can leave for another project. We’re well aware of that, and we’ve shown in the past that we can develop both academy players and signings from lower leagues.” The summer signing of the 21-year-old Ajaccio left-back Arsène Kouassi, who has impressed in his first season in the top flight, is the latest example of that strategy.\n\nKoscielny says “knowing the person you have in front of you” is just as important as data in recruitment. “My questions to players are straightforward. Why did you start playing football? What are your dreams? How do you plan on reaching them? Based on their responses, you can find out a lot about their love for football and their potential development.”\n\nDespite some encouraging results, including a draw against Paris Saint-Germain this month, Lorient are in a relegation battle. “We knew it would be a tough season … We’re playing well but we need to rediscover that scoring touch and work on our defensive errors. I’m confident in the squad and in the coaching staff.”\n\nKoscielny regards Arsène Wenger’s work at Arsenal as a model to follow. “Over those 23 years, he managed to develop the club in every aspect: not just on the pitch, but also in terms of culture, finances and infrastructure.”\n\nskip past newsletter promotion Sign up to Football Daily Free daily newsletter Kick off your evenings with the Guardian's take on the world of football Enter your email address Sign up Privacy Notice: Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on theguardian.com to send you this newsletter. You can complete full registration at any time. For more information about how we use your data see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nIt’s no coincidence, Koscielny points out, that so many of his former Arsenal teammates are in managerial and directorial roles. “I think he succeeded in passing on his experience, and we’re continuing his legacy in terms of everything he taught us.”\n\nView image in fullscreen Laurent Koscielny left Arsenal six years ago but has fond memories from his nine years at the club Photograph: Clive Mason/Getty Images\n\nMikel Arteta’s success as Arsenal’s manager has come as no surprise to him. “As a player he was very considered; he had that ability to solve problems through communication and positioning. He was also very energetic, and he still is today on the touchline. He’s experiencing matches to the fullest and transmitting his energy to the players.”\n\nKoscielny is still in touch with people at Arsenal, not least his former centre-back partner Per Mertesacker, the academy manager. “I often speak with Per. We talk about young players, about recruitment, but also things outside of football.”\n\nTheir relationship on and off the pitch, he says, contributed to making their defensive pairing a success. “I also sense that with Gabriel [Magalhães] and William Saliba. They complement each other well, they know their respective strengths and weaknesses.”\n\nKoscielny’s relationship with the club appears to have survived a controversial exit six years ago. “I was 34, I’d spent nine years at Arsenal and there had been a fair amount of discussions with the club. I wanted to go back to France with my family. There were deteriorated relationships with people at the club, although not with Unai Emery.”\n\nHis departure was also soured by Bordeaux’s announcement video in which he removed an Arsenal top to reveal his new kit. “I understand the fans’ reaction to the video, it wasn’t my idea and I apologised afterwards. I’ve always respected the club and the fans. I developed as a player and as a person during my time there. I have a special attachment to the club and to the city, my children were born there. I would have given everything for the club, on and off the pitch.”",
  "summary": "<p>Former defender on his challenge as sporting director at Ligue 1 club and using Arsène Wenger as an inspiration</p><p>Returning to Brittany was the obvious choice for Laurent Koscielny. Having left Lorient for Arsenal in 2010, the former defender is back at the Ligue 1 side as the sporting director.</p><p>“My wife and I were keen to come back, it’s a beautiful region, and the people are welcoming and kind,” the Frenchman says of the seaside town, known for its annual Celtic music festival and military naval base.</p> <a href=\"https://www.theguardian.com/football/2025/nov/20/laurent-koscielny-lorient-arsenal-ligue-1-arsene-wenger\">Continue reading...</a>",
  "published": "Thu, 20 Nov 2025 13:00:11 GMT",
  "url": "https://www.theguardian.com/football/2025/nov/20/laurent-koscielny-lorient-arsenal-ligue-1-arsene-wenger",
  "source": "The Guardian"
}