{
  "title": "U.N. climate negotiations interrupted by fire as countries move forward without U.S.",
  "text": "U.N. climate negotiations interrupted by fire as countries move forward without U.S.\n\nFor the first time in history, the U.S. isn't at the annual world climate conference called COP30. But some countries say they're OK with that. Countries including China and Brazil are stepping up.\n\nAILSA CHANG, HOST:\n\nWorld climate negotiations are entering the final days in Belem, Brazil. Those discussions were brought to a standstill today when a fire erupted, forcing people to evacuate. NPR's Julia Simon is covering what's called COP30 and was evacuated herself. She joins us now. I'm so glad you're safe, Julia.\n\nJULIA SIMON, BYLINE: Thank you, Ailsa. It's good to be here with you.\n\nCHANG: Good to have you. OK, so first, what do we know about this fire? Like, what happened?\n\nSIMON: So I was in the press center and in this massive, white, inflatable tent where this conference is being held in the Brazilian Amazon. I was on the phone with my editor, and suddenly people were running saying, there's a fire. Here's what it sounded like on my end.\n\nA fire? OK, there's really a fire.\n\nYeah, there are tens of thousands of registered participants here, so we evacuated. Outside, I could hear sirens. There was smoke in the air, the smell of burning plastic. You know, the information is still preliminary, but the COP30 organizers put out a statement this afternoon. It said that delegates here evacuated swiftly. They said the fire was contained with limited damage. This fire means that countries and delegations, who have been working really hard, Ailsa, on these climate negotiations and these events, they just had to stop. And really, the feeling I'm hearing from people who evacuated is one of sadness and disappointment, at least for the moment.\n\nCHANG: I can imagine. OK, so the conference is on hold right now. Officials say they will have updates on that, but before this whole fire even broke out, what had the climate negotiations been focusing on?\n\nSIMON: Some of the goals here are similar to past conferences, figuring out how to adapt to global warming and the money to make it all happen. But notably, at this conference, Ailsa, more than 80 countries, including the U.K., Mexico and Brazil, have been calling for a clear roadmap to transition away from fossil fuels. Here's Juan Carlos Monterrey, special representative for climate change of Panama.\n\nJUAN CARLOS MONTERREY: The main drivers of the climate crisis are fossil fuels, and the truth is that we need to transition away from fossil fuels. We need a pathway to phase out fossil fuels.\n\nSIMON: And creating that pathway, Ailsa, that roadmap, that has been a focus here.\n\nCHANG: OK. Well, we've been saying this for days now - the U.S. is not at this conference for the first time in history. How are people feeling about the absence of federal officials from the U.S.?\n\nSIMON: Well, the Trump administration has been increasing support for fossil fuel production at home and abroad. The U.S. is the largest oil and gas producer in the world. There have been concerns here that this U.S. administration might have been an obstacle when it comes to that call for a roadmap to transition away from fossil fuels. Ralph Regenvanu is minister of climate change of Vanuatu, an island nation threatened by rising seas. He says the U.S. absence might actually not be so bad.\n\nRALPH REGENVANU: Generally, it's a good thing they're not here because we have less recalcitrants to deal with.\n\nSIMON: Meanwhile, countries like China and the host of the conference, Brazil, have been stepping up to play more of a leadership role here. And in an email statement to NPR, White House spokesperson Taylor Rogers wrote that President Trump will not jeopardize our country's economic and national security to pursue vague climate goals.\n\nCHANG: That is NPR's Julia Simon in Brazil. Thank you so much, Julia.\n\nSIMON: Thank you, Ailsa.\n\nCopyright © 2025 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\n\nAccuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.",
  "summary": "For the first time in history, the U.S. isn't at the annual world climate conference called COP30. But some countries say they're OK with that. Countries including China and Brazil are stepping up.",
  "published": "Thu, 20 Nov 2025 15:54:00 -0500",
  "url": "https://www.npr.org/2025/11/20/nx-s1-5612669/cop30-countries-move-forward-without-u-s",
  "source": "NPR Topics: News"
}