{
  "title": "Should the Tigers trade Tarik Skubal? We asked around MLB",
  "text": "Open Extended Reactions\n\nAfter three seasons with a face-of-the-franchise-type superstar to headline the winter, there is no Aaron Judge, Shohei Ohtani or Juan Soto in the 2025-26 free agent class. But there is still one player whose potential availability could rock the offseason ahead: Tarik Skubal.\n\nWhy would the Detroit Tigers possibly move their ace on the heels of his second straight American League Cy Young Award and the team's second consecutive postseason appearance?\n\nQuite simply, because keeping Skubal in Detroit is going to become very expensive, very soon. The 28-year-old left-hander will enter the final year of his contract in 2026 before he is scheduled to reach free agency after the season. If he does hit the market next winter, Skubal has a chance of surpassing Los Angeles Dodgers ace Yoshinobu Yamamoto's record $325 million contract, and he could even become baseball's first $400 million pitcher.\n\nWith Tigers president of baseball operations Scott Harris facing a decision that will shape the future of the franchise -- and impact all of MLB -- we talked with 11 industry insiders about what Detroit should do this offseason, broken into three main options.\n\n1. Trade Skubal this winter\n\nThis was the least-popular option among our panel and one rival executive explained why.\n\n\"The whole reason you do all this is to start a season with a potential contender that has an ace. You can't throw that away before the season starts. How long will it take to get here again?\"\n\nSome panelists hemmed and hawed about how much a team would have to overpay to get Detroit to consider a trade, believing an offer that included a young starting pitcher with front-line potential would be enough to start internal conversations -- but nobody could get themselves logically to advocate for a deal unless something completely illogical was offered. And that type of deal increasingly doesn't happen in modern baseball.\n\nIf the Tigers were to trade Skubal for anything less than a gobsmacking return, it would likely mean their competitive window would be tighter -- and it would be hard to call Detroit a contender without Skubal next season. Dealing away a player of his caliber would label the Tigers a small-market team, at least by mindset, and bring into question whether they would find themselves in this situation again as other star players approach free agency. It's much easier to push some, but not all, of their chips to the middle for the upcoming season and see what they can do with Skubal leading the way. Who knows when the next opportunity will come?\n\nWhen I asked these sources what the Tigers should do, they seemed unsure about how Detroit was viewing the situation but leaned toward believing the Tigers would keep Skubal going into next season. That said, knowing what the market will bear is what Harris likes to do, so the drumbeat of Skubal being available in the right deal -- or at least in the sense that Detroit would listen before hanging up -- will likely continue.\n\n2. Keep Skubal, but trade him at the deadline if the season doesn't go as planned\n\nIn the event things go sideways during the first half of the 2026 season, everyone on our panel agreed that this was the right move. Defining what \"going sideways\" means with the expanded playoffs is hard, but battling for a wild-card spot around the trade deadline was where the gray area began for our panelists.\n\n\"You cannot, under any circumstances, hold Skubal through the trade deadline and miss the playoffs. That would be a catastrophe,\" said one agent.\n\nThe haul would still be formidable for a rental deal -- back-of-the-envelope math says two prospects ranking later in the top 100 or one elite young player, roughly speaking -- but also because the offers would have to clear the bar of Detroit receiving a compensation pick just after the first round to even be considered, as that's what the Tigers would get if Skubal walked in free agency (under the current free agency system).\n\nTop 50 MLB free agents How much will the biggest stars get paid this winter? Kiley McDaniel breaks down the 2025-26 free agent class. Rankings, contract projections »\n\nAnother rival executive has an informed theory on Harris' focus: \"He has his eyes set on 2027 and 2028 as his prime contending years.\" If things go well in 2026, the window would expand to include it as well. Top prospects Kevin McGonigle and Max Clark, the No. 2 and No. 6 prospects in the sport, could be core players as soon as the second half of 2026, so aiming for things to really take off in 2027 is logical.\n\nOpinions vary on whether Skubal would fetch more this winter or at the deadline because it's hard to project how desperate a contender could hypothetically be at the deadline versus what that team would offer to get an entire season of Skubal plus a first-round pick when he walks. It's safe to assume the return would likely be a bit less at the deadline.\n\n3. Keep Skubal no matter what, try to extend him and take the draft pick if he ends up leaving\n\nThis would be a bold move in the era of the asset value-focused approach that so many teams are taking now. If Skubal were to walk in free agency, the compensation would likely be a draft pick in the 30s the following summer -- and that's it. That type of pick is valued at roughly $8-10 million of surplus value, depending on your source.\n\nThere is more value that would come before that for Detroit, but it's hard to quantify. The Tigers would get another title run with the reigning back-to-back AL Cy Young winner and more time to convince him to stay in Detroit. Maybe that combination could make magic and both sides could land on a deal before he hits free agency. Skubal has said he wants to stay in Detroit, so you can't rule it out. Another rival executive thinks Harris is focused on how to make this happen. \"[Harris] will never believe he can't sign Skubal.\"\n\nThat being said, Skubal being represented by Scott Boras makes it unlikely he will sign a deal without at least testing the market, as Boras typically advises clients to hit free agency.\n\nWay-too-early 2026 MLB Power Rankings The Dodgers just won the 2025 World Series -- and we're already looking to next year. Who's No. 1? »\n\nThere's one more variable, though, that is unique to the timing of Skubal's free agency: the expected labor strife next winter, with the current CBA expiring on Dec. 1, 2026. It's unlikely Boras wants Skubal to be on the market through a labor stoppage that would leave him potentially signing right before spring training after some teams have spent their available cash and with the economic model of the game potentially changing in a way that hurts Skubal's market. One source said the CBA complication moves the odds that Skubal signs an extension before free agency from 0% to 10%.\n\nThe last time there was a labor stoppage hanging over free agency, we saw a frenzy of late-November deals before the Dec. 1 lockout. A similar quicker free agent process that ends with Skubal signing around Thanksgiving would give Detroit a slight leg up, given the familiarity and exclusive negotiating window before free agency, relative to a protracted, winter-long bidding war.\n\nThe contract marks to beat are Yamamoto's $325 million guarantee that is the most ever for pitchers and Max Fried's $218 million guarantee that is tops among left-handers all-time. Both of those contracts were landed by agencies other than Boras Corp., and setting precedents is a large part of how top agencies market themselves to potential nine-figure clients.\n\nIt's also worth noting Skubal had Tommy John surgery in college and flexor tendon surgery in 2022, which are factors to consider when projecting a long-term deal in free agency.\n\nBreaking News from Jeff Passan Download the ESPN app and enable Jeff Passan's news alerts to receive push notifications for the latest updates first. Opt in by tapping the alerts bell in the top right corner. For more information, click here.\n\nAre Harris and the Tigers likely to win a straight bidding war with a precedent-setting guarantee? No, but if they can offer a shorter deal at an AAV record with opt-outs, they would at least have a path, albeit a narrow one, to keeping their ace.\n\nThe real issue for Detroit is their payroll. They finished last season with a $155 million competitive balance tax (CBT) payroll figure, over $90 million below the first CBT tax threshold. If Skubal will be getting an AAV in the $30 millions or even the low $40 millions, can the Tigers really justify giving a quarter of their payroll to one player? Would Harris do that, or would signing Skubal be part of a larger move to a payroll number that can justify fitting Skubal in there as the Tigers see their peak competitive window opening? If McGonigle and Clark show up late in 2026 and look like future stars, that won't bump the payroll, but it could make the Tigers look more competitive going forward and that could help their long-term case to Skubal, as well.\n\nThis logic -- if things go well in 2026, the Tigers will contend and hold onto Skubal through the season -- is also why another executive mused on Detroit's options if it traded Skubal at the deadline. \"You could still trade [Skubal] and then sign him back long-term, but I can't imagine the series of events where that would actually happen.\"\n\nThere's also the reading of the tea leaves for this winter. Some sources mentioned Detroit is targeting pitching depth early in free agency. Is that to backfill for a potential Skubal trade? A deal now or at the deadline? Or just to create depth for a title run like all contending teams need? Or to create leverage/depth so they have maximum optionality for all of 2026? You can see what you want to see when it comes to the Rorschach test that is the team-building conundrum of the winter.",
  "summary": "Will the best pitcher in baseball be on the move this offseason? Those in the game offer their advice.",
  "published": "Thu, 20 Nov 2025 19:29:25 EST",
  "url": "https://www.espn.com/mlb/story/_/id/47022782/mlb-free-agency-2025-26-tarik-skubal-detroit-tigers-trade-extension-400-million-contract",
  "source": "www.espn.com - TOP"
}