{
  "title": "'A definitive backslide.' Inside fashion's worrying runway trend",
  "text": "CNN —\n\nNow that the Fall-Winter 2023 catwalks have been disassembled, it’s clear one trend was more pervasive than any collective penchant for ruffles, pleated skirts or tailored coats.\n\nAcross runways in New York, London, Milan and Paris, there was a notable scarcity of plus-size models. This comes at a time when there are five injectable medications which can be used as appetite suppressants currently available by prescription in the US, stirring much conversation; a sixth medication, Rybelsus, is taken as an oral pill. Two are officially approved in the UK — the largest influx of weight loss medication seen in the country in almost a decade.\n\nIn recent months, injectables such as Wegovy and Ozempic — which share the same active ingredient, semaglutide — have been widely reported as Hollywood’s worst-kept weight loss secret. (Ozempic is intended for use primarily to treat Type 2 diabetes.) Comedian Chelsea Handler claimed her “anti-aging doctor just hands (Ozempic) out to anybody” while appearing on a podcast in January. Even Elon Musk tweeted last year about being on Wegovy.\n\nFor many fashion commentators and diversity advocates, the Fall-Winter 2023 runways were in sharp contrast to the (albeit limited) progress and heady promise of recent seasons. This rollback has been widely criticized in the style media as such. And its potential impact is being assessed more broadly: With the rise of these weight loss panaceas, the pursuit of size zero is now just a prescription away.\n\nThe Fall-Winter failings\n\nIn 2020, Jill Kortleve and Paloma Elsesser became the first models outside of a sample size to walk for the Italian fashion house Fendi. (Traditionally, a sample size falls between a US 0-4.) British label Erdem entered the plus-size market in 2021, extending its offering to a UK size 22 (or US size 18). And in January 2022, Valentino made headlines after its haute couture show featured a broad spectrum of body types. But this season, there was a visible lack of curve bodies on their runways — or many others.\n\nFendi and Valentino did not respond when contacted by CNN, while Erdem declined to comment.\n\nAccording to fashion search engine Tagwalk, the number of mid and plus-size models dropped by 24% in comparison to Spring-Summer 2023. Similarly, a size inclusivity report conducted by Vogue Business found that 95.6% of all looks presented for Fall-Winter 2023 were in a size US 0-4. For context, industry market firm Plunkett Research estimated in 2015 that 68% of American women wear a size US 14 or above.\n\nModels on the runway at Erdem's Fall-Winter 2023 show during London Fashion Week. Aitor Rosas Sune/WWD/Getty Images\n\n“It was a definitive backslide,” said IMG model agent Mina White, who represents plus-size and curve supermodels including Elsesser and Ashley Graham. “It was frustrating to see some of these designers not using curved bodies where they had in the past.” Fendi and Valentino did not respond when contacted by CNN, while Erdem declined to comment.\n\n“Watching somebody like Ashley Graham attend the front row for so many of these major houses in full looks (provided by the designer), it was frustrating,” White continued. “They wanted to utilize her image and her social following to command a certain space in the market, but they didn’t want to be reflective on their runways.”\n\nFor others, even the term “backslide” was too generous. “Slipping back from… what? A glorious time when the average American woman (size 16) was as present on the runways as she is in everyday life? A time when fashion ads cast as many ‘plus-size’ and ‘mid-size’ women as ‘straight-size’ women?” fashion journalist Amy Odell wrote in her Substack newsletter of this past season’s runways. “No one needed any data to understand that representing a wide array of body shapes and sizes in runway shows or in fashion imagery is not a priority for the industry.”\n\nThat said, a handful of — mostly smaller — brands pushed ahead this season. In London, emerging labels Di Petsa, Karoline Vitto and Sinead O’Dwyer showcased lineups of size-diverse models. Inclusivity at Christian Siriano, Coach, Kim Shui, Collina Strada and Bach Mai stood out in New York; while in Paris, Belgian brand Esther Manas — a consistent flag-bearer for size diversity — staged one of the city’s most refreshing runways with an assortment of fun, sensual, feminine looks that complimented a range of bodies.\n\nDuring Paris Fashion Week, Ester Manas staged one of the most size-inclusive runways this season. Richard Bord/Getty Images\n\nThere was also a smattering of mid- and plus-size castings to be seen elsewhere: Off-White and Michael Kors, for example, featured a few such models. At Harris Reed’s debut for Nina Ricci, Precious Lee opened the show — which also featured three more plus- and mid-size models.\n\nIt starts with sample size\n\nFashion samples and sample size pieces are one-off garments made before an item is mass-produced, typically to be worn during runway shows. Prioritizing the same body type in sample sizes means runway models are more easily interchangeable, saving fashion houses time and money if someone were to drop out or get sick during or after the casting process for a show.\n\nIt’s also partly why, according to White, casting curve models is still an uphill battle. She says she introduces brands to new faces months in advance of runway season, with their specific measurements up-top and easy to read in all correspondence. “I want to be ahead of that,” White said. “So I’m never told ‘Oh, we wanted to make it work, but we didn’t have her size’ or whatever that conversation might look like.”\n\nBut despite her efforts, she says she’s frequently told it’s too much of a “financial lift” to make larger samples — even by legacy brands. “I get very upset when brands say that,” White said. “I don’t believe that it is, I believe that it’s people not being properly educated on how to do this right.”\n\nA look from London-based brand Di Petsa's Fall-Winter 2023 collection. Aitor Rosas Sun/WWD/Getty Images\n\nBeyond the lack of representation, White notes it’s painful for plus-size consumers to watch brands leverage resources to create custom, made-to-fit pieces for celebrities — all the while claiming the pot is empty for more inclusive runway samples.\n\nLondon-based stylist and editor Francesca Burns agrees sample sizes are part of the problem. In 2020, Burns went viral after she posted on Instagram about a fashion job gone wrong. She says she was sent five looks to style from Celine, none of which fit the size UK 8 (US 4) model booked for the shoot— an 18-year-old on her first job in the business. The experience left her “horrified,” Burns told CNN, recalling what she saw as the model’s shame and embarrassment. “Looking into this girl’s eyes,” Burns said, “she shouldn’t have felt like that.”\n\nBurns’ post, which called the current system “unacceptable,” was picked up widely in the fashion media. (When reached by CNN, Celine declined to comment on the incident.) “Ultimately, the desire to see change has to be there,” Burns said. “And I wonder whether luxury has that desire?”\n\nA case for change\n\nProgress has been slow, but not entirely inexistent. Across fashion campaigns, magazine covers and editorial shoots, there is a growing enthusiasm for inclusivity. “I see the options rolling in for the plus-sized talent, and they’re great offerings,” said White. “Great, strong editorials and covers and campaigns. But I do feel like without the clothes, we are going to go back to see more naked curve stories, or lingerie curve stories or a curve girl in a trench coat. That’s what I don’t want.”\n\nFor British Vogue’s April issue, unveiled March 16, Elsesser, Lee and Jill Kortleve were dubbed “The New Supers.” Preceding the cover story is a letter written by editor-in-chief, Edward Enninful commending the models for “leading the way” and holding “powerful space” in the industry.\n\n“Catwalks are once again under scrutiny for a stark lack of body diversity,” read the magazine’s Instagram caption, unveiling the cover. “But this cover was not conceived as a statement. It is a crowning of an all-powerful trio, the supermodels for a new generation.”\n\nBut many online were quick to point out the disconnect: Two of the Saint Laurent Spring-Summer 2023 dresses were modeled by plus-size women, though they are not available to buy in most plus sizes.\n\nSee the full feature in the April issue of British Vogue available via digital download and on newsstands from March 21. Inez & Vinoodh/Vogue\n\nIn his own social media post, Enninful wrote about his disappointment at the Fall-Winter 2023 runways. “I thought I had gotten into a time machine. Show after show dominated by one body type, so many limited visions of womanhood… one prescribed notion of beauty prevailed again, and it felt like the reality of so many women around the world were being ignored.”\n\nBut for White, the power rests within the entire industry — not just at the feet of brands. “I really do believe there should be an industry standard between the (Council of Fashion Designers of America), the British Fashion Council and key editors at some of these major mass market magazines,” she continued. “If there was a call-to-action from these figureheads saying, moving forward samples need to be readily available for a few different body types, we would see significant and impactful change.”\n\nBurns agrees there must be a trickle-down effect. “I think a lot of responsibility is put on young designers to solve all these issues around sustainability or issues around body inclusivity,” she said. “It’s important that the big powerhouses, which have the capacity to action change, really take some responsibility.”\n\n‘No such thing as a free lunch’\n\nOn March 8, Wegovy — developed primarily as a treatment for those living with obesity and weight-related conditions — was approved in the UK. It’s the second injectable weight management medication to be made available with a prescription via the country’s National Health Service (NHS) in about 3 years, after almost a decade of quiet. Before 2020, the last weight loss medication was approved in the UK was in 2010.\n\nSimilarly, the US has now approved three weight management injections: Wegovy, Saxenda and IMCIVREE. Medications for type-2 diabetes like Mounjaro and Ozempic are not FDA-approved for weight loss, though some doctors are issuing them at their own discretion.\n\nWhile these medicines are a revolutionary tool for those who struggle to lose weight for genetic or medical reasons, they are at risk of being abused.\n\nSemaglutide, the active ingredient in Wegovy and Ozempic, was originally developed for treating type-2 diabetes. It quells hunger signals to the brain by mimicking the hormone glucagon-like peptide-1 (GLP-1). “It can slow how quickly your stomach empties out and may give you a little more feeling of feeling full,” said Dr. Robert Lash, an endocrinologist and Chief Medical Officer of the Endocrine Society in Washington, D.C. In clinical trials, over a period of 68 weeks, participants who used the medication in conjunction with eating fewer calories and increasing their physical activity on average lost around 15% of their body weight compared to 2.4% of those using a placebo, according to the manufacturer Novo Nordisk.\n\nOn March 13, the European Medicines Agency issued a statement warning of an Ozempic shortage that could continue through the year, urging doctors to prioritize prescriptions to diabetics. “Any other use, including for weight management, represents off-label use and currently places the availability of Ozempic for the indicated population at risk,” read the release.\n\nPatients typically need a BMI of 27 or higher (along with another weight-related condition like high blood pressure or diabetes) or have a genetic predisposition towards obesity to be prescribed such appetite suppressant medication by their doctor. But talk of these injectables has been sweeping the West. In January, the New York Times reported on the term “Ozempic Face,” coined by a New York-based dermatologist who reported treating several patients with a hollowed-out appearance that can come with rapid weight loss. By the end of February, the medication had made it to the cover of New York Magazine in a feature titled “Life After Food?” Adverts for GLP-1 injections are even blanketing New York City subway stations.\n\nGLP-1 injections are now being marketed in New York City's subways. Courtesy Ro\n\nAnd across social media, online forums and private group chats, some people looking to lose weight for primarily aesthetic purposes are searching for a way to skirt the requirements.\n\n“I was just looking for a way to lose a few pounds, like 10 to 15 at most,” said one 30-year-old American woman, who wished to remain anonymous, in a phone interview. She scoured social media and forums for guidance on securing a weight loss drug. “I’m certainly a normal BMI, I just have a trip to Mexico coming up and I want to look really good,” she said.\n\nAlthough she says she found a way to access Wegovy, she decided against the medication after considering the cost (which can reach more than $1,000 a month without insurance). “I’ve always very much fit the societal standard but lately I was just like f*ck it, I want to be skinny,” she told CNN.\n\nDr. Lash emphasized the importance of taking weight loss drugs only with medical supervision and a valid prescription. “If somebody was a normal weight and they took this drug because they thought they could be even thinner than they are now, that could lead to complications,” he told CNN, warning of nausea, vomiting, diarrhea and even gallbladder problems. “These drugs are not benign, they do have side effects involving the GI tract. There’s no such thing as a free lunch.”\n\nEvery body is invited\n\nFashion has long promoted size 0 as the ultimate virtue — regardless of its viability for many people, or any health risks. And now with the accessibility of accelerated weight loss medication, the stakes are even higher. For Burns and White, the industry is responsible for amplifying a new, more inclusive vision of beauty.\n\n“There’s a very archaic way of looking at women over a size 16 and just assuming that they’re unhealthy or uneducated or unstylish. Or don’t have the resources to buy into luxury,” said White. “The reality is the same women these brands are alienating in their fashion space are the same women running out to buy their handbags, shoes, perfumes, cosmetics and skincare.”\n\n\"Every body is invited,\" read the show notes for Ester Manas' Fall-Winter 2023 collection. Kay-Paris Fernandes/Getty Images\n\nNot only do designers need to create clothes with this consumer in mind, according to White, but they need to be seen on the runway, too.\n\n“It shouldn’t be a conversation. It should just be normalized that we’re not just looking at a single view of beauty,” echoed Burns.\n\nEster Manas and Balthazar Delepierre, whose bridal-inspired Fall-Winter 2023 collection was one of this season’s most size-diverse runways, summarized it best in their accompanying show notes: “The body is not the subject. Because, obviously, at a wedding, everybody is invited. And all to the party. That is where the designer duo Ester and Balthazar take their stand.”",
  "summary": "Now that the Fall-Winter 2023 catwalks have been disassembled, it's clear one trend was more pervasive than any collective penchant for ruffles, pleated skirts or tailored coats.",
  "published": "Thu, 06 Apr 2023 20:53:38 GMT",
  "url": "https://www.cnn.com/style/article/fashion-week-fall-winter-2023-size-diversity-skinny-wegovy/index.html",
  "source": "CNN.com - RSS Channel - World"
}