{
  "title": "2026 recruiting class rankings: Ohio State, Miami, Iowa on the rise",
  "text": "Open Extended Reactions\n\nThis class ranking update is a reminder that recruiting goes beyond the prospects ranked within the SC Next 300. A wave of commitments, decommitments and flips largely driven by three-star prospects shook up these rankings.\n\nDefending national champion Ohio State added several commits to its class, led by SC Next 300 cornerback Jay Timmons, but another factor that helped the Buckeyes rise was that they also added multiple three-star prospects who strengthened the depth of the class.\n\nMiami is another class that blended four- and three-star additions to boost its ranking as the Hurricanes broke into the top 10.\n\nThe number of remaining undeclared prospects in the SC Next 300 is in single digits, but heading into the initial signing period for the 2026 class, many factors can still drive changes in the rankings.\n\n(Previous update: Oct. 30)\n\nPrevious ranking: 1\n\nSC Next 300 commits: 18\n\nTop offensive prospect: OT Keenyi Pepe\n\nTop defensive prospect: CB Elbert Hill\n\nNo program has more 2026 momentum than USC under Lincoln Riley, especially after hiring general manager Chad Bowden away from Notre Dame. The Trojans have double-digit SC Next 300 commits, with several joining the list since January. That includes two five-stars to start May in Pepe and Hill, and a pair of four-star commits who flipped from Big Ten rival Oregon: in-state defensive lineman Tomuhini Topui and quarterback Jonas Williams. Topui is a physical, aggressive defensive tackle who could develop into an interior pass-rushing headache for opposing offenses, and Williams is a true dual-threat signal-caller.\n\nUSC also made it a point to beef up in the trenches. It pulled four-star defensive tackle Jaimeon Winfield out of Texas, landed in-state defensive end Simote Katoanga and traveled to Utah to snag Corner Canyon offensive lineman Esun Tafa. To further bolster the O-line, the Trojans landed Pepe out of IMG Academy. He is huge at roughly 6-foot-7 and 320 pounds, but is light on his feet as well as physical and can become a standout tackle. On the perimeter, they will not have to wait for in-state defender R.J. Sermons as the SC Next 300 CB reclassified to 2025 and will join the Trojans this fall. For 2026, they pulled Elbert Hill, the top-ranked corner, out of the Midwest. Hill possesses elite speed, having been measured at over 22 mph in game play.\n\nPrevious ranking: 2\n\nSC Next 300 commits: 18\n\nTop offensive prospect: QB Jared Curtis\n\nTop defensive prospect: CB Justice Fitzpatrick\n\nThe Bulldogs have been a staple among the top three recruiting classes during Kirby Smart's tenure and look to be a contender to do so again in 2026. A big step toward finishing near the top is bringing five-star quarterback Curtis back into the mix. After a decommitment, the Bulldogs were able to fend off other suitors, most notably Oregon, and give themselves a potential impact QB for the future. Curtis might need to adjust to a relatively steep jump in competition level, but he has elite physical tools, including a smooth, quick release and the ability to change arm angles.\n\nWith three of their top four pass catchers from 2024 having moved on and the fourth likely to leave after this season, Georgia is bringing in new receiving targets with speed. Brady Marchese has been recorded hitting over 22 mph in game play. Kaiden Prothro can give the Bulldogs a matchup nightmare as he possesses an excellent blend of size, speed and body control. After signing two SC Next 300 TEs in their 2025 class, the Dawgs continue to restock there, adding Lincoln Keyes, who with his big frame and good body control can offer a wide catch radius.\n\nOn defense, the Bulldogs have had 11 first-round NFL draft picks over the past five years and they continue to infuse that unit with top talent, including two of the top DBs in the country in Fitzpatrick and Zechariah Fort. Fort is a safety with good range who can be active in run support. Fitzpatrick is the younger brother of former Alabama great Minkah Fitzpatrick; his blend of size and speed gives him equally promising impact potential.\n\nPrevious ranking: 4\n\nSC Next 300 commits: 17\n\nTop offensive prospect: TE Ian Premer\n\nTop defensive prospect: CB Khary Adams\n\nNotre Dame started the year off slowly on the recruiting trail but added several key SC Next 300 additions in the spring and summer months, including important defensive additions. Rodney Dunham was one of the first on board and is an edge player with a quick first step. The secondary will benefit from adding some length to that unit. Ayden Pouncey is a rangy safety with a 6-foot-3 frame that could allow him to grow into an outside linebacker role. Khary Adams is one of the top cornerback prospects in the nation as he possesses an excellent blend of size (6-foot-2) and speed (21.3 mph max speed).\n\nOn offense, SC Next 300 OT Gregory Patrick joined a class that already featured several top offensive line prospects including top-10 tackle Tyler Merrill, who at 6-foot-7 and 335 pounds is a massive presence with physicality and power in the run game. This group collectively can continue the school's strong reputation as an offensive line factory.\n\nThe Irish also landed Thomas Davis Jr., whose father is former Panthers star Thomas Davis, and four-star quarterback Noah Grubbs, who already has shown impressive footwork and a sound release from the pocket. Their QB of the future will benefit from multiple targets added in this class, including TE Ian Premer. Among the wide receivers in the group is high-three star Devin Fitzgerald, the son of former NFL great Larry Fitzgerald. Like his father, he is a good-sized target at nearly 6-foot-2 and has shown to be productive, with more than 50 receptions and nine TDs as a junior.\n\nPrevious ranking: 6\n\nSC Next 300 commits: 14\n\nTop offensive prospect: TE Kendre' Harrison\n\nTop defensive prospect: S Jett Washington\n\nDan Lanning's run of sustained excellence in Eugene rolls on with Oregon's 2026 class. Reeling in five-star tight end Kendre' Harrison in November set the tone. The 6-6, 250-pound tight end is a dynamic two-sport athlete with an exceptional catch radius and is a nightmare for opposing defenses in the red zone. The Ducks also added a five-star prospect to their defense with the big-framed and rangy Jett Washington. A fluid safety with good ball skills and the ability to win jump-ball battles, he can also be a physical presence in the secondary. The Ducks added four-star defensive back Xavier Lherisse, who clocked an impressive 1.62 10-yard dash and 4.49 40-yard dash at the Under Armour Miami camp. Four-star running back Tradarian Ball adds explosiveness and excellent ball skills.\n\nWhile the commitment of five-star DE Richard Wesley was short-lived, the Ducks still have a strong defensive line foundation within this class. They secured the top in-state big man in SC Next 300 DT Tony Cumberland, who has good burst and power, and can be a disruptive presence. DE Dutch Horisk will arrive from one of the top programs in California (St. John Bosco), where he has been a multiyear starter who uses his hands well; as a junior, he had nine TFLs and four sacks.\n\nOregon also has bolstered its O-line unit. Leading that group is five-star Immanuel Iheanacho, who is a massive presence at around 6-foot-7, 350 pounds and can push defenders around. The Ducks also pulled a pair of OLs from former conference foe Cal, in SC Next 300 OG Tommy Tofi and Koloi Keli.\n\nPrevious ranking: 3\n\nSC Next 300 commits: 15\n\nTop offensive prospect: RB K.J. Edwards\n\nTop defensive prospect: ATH Brandon Arrington\n\nMike Elko has quickly proved he can identify and recruit at a high level. He has worked fertile recruiting grounds outside his home territory, including Georgia, Florida, California. He went out west to land the nation's No. 1-ranked athlete Brandon Arrington, whose speed could allow him to have an impact on either side of the ball, though he projects to corner in College Station. He pulled out Georgia SC Next 300 DLs Bryce Perry-Wright and Tristian Givens as well as landing fellow four-star defensive tackle Jermaine Kinsler out of New Jersey.\n\nThe Aggies bolstered their rushing attack with a pair of in-state running backs in K.J. Edwards and Jonathan Hatton, who has an excellent blend of size (200 pounds) and speed (he was measured hitting 21 mph on film). Edwards has been very productive in high school, rushing for 1,700 yards in each of his last two seasons.\n\nElko has also been able to unearth talent from more unlikely places, such as quarterback Helaman Casuga out of Utah. Casuga is not a big, physical prospect at roughly 6 feet, but he has a live arm and can get the ball out quickly. Victor Singleton, one of the top prospects in Ohio, was a nice flip from Illinois. He has clocked a 21-mph max speed and has the type of quickness and excellent feet to thrive in man coverage at corner.\n\nPrevious ranking: 9\n\nSC Next 300 commits: 13\n\nTop offensive prospect: WR Chris Henry Jr.\n\nTop defensive prospect: S Blaine Bradford\n\nRyan Day has the luxury of building his 2026 class around one of the most coveted players in the country: five-star receiver Henry, whose father, the late Chris Henry, was a star receiver for West Virginia and the Cincinnati Bengals. Henry Jr. stands 6-6 and has a combination of length and quickness rarely seen from high school receivers.\n\nThe rest of the Buckeyes' class has started to take shape around Henry. The team has added a handful of SC Next 300 prospects since March, including Bradford out of Louisiana and linebacker Simeon Caldwell out of Florida. C.J. Sanna is a prospect we like on tape; he is a big, physical linebacker with excellent range and is a bit of an underrated pickup for this talented class. In-state offensive tackle Maxwell Riley is impressive changing direction and finishes plays with the type of nastiness that will endear him to fans in Columbus.\n\nPrevious ranking: 5\n\nSC Next 300 commits: 13\n\nTop offensive prospect: QB Dia Bell\n\nTop defensive prospect: DE Richard Wesley\n\nAs Texas tackles the 2025 season led by one of the most high-profile signings in recent years in quarterback Arch Manning, the Longhorns continue to build for the future, including another five-star QB. Dia Bell brings valuable experience, having faced quality competition during his time in high school. He has shown good accuracy and deep-ball touch, and as a junior threw for more than 2,500 yards and completed 70% of his passes.\n\nThe Horns also added potential targets in SC Next 300 WRs Chris Stewart and Jermaine Bishop Jr. Stewart brings big-play speed, and Bishop is a quick, fluid target who can create after the catch. Their backfield gained more five-star talent with Derrek Cooper, a versatile running back who blends excellent size and speed and can also be a receiving threat. To protect their new offensive weapons, they have also landed some top in-state OLs, including top-10 OG Nicolas Robertson, a powerful big man with good feet.\n\nTexas hit the transfer portal hard to address needs along the defensive line for this season, especially interior DL, but there are young players for that unit in the 2026 class. One-time Oregon commit Richard Wesley was a big add as he is explosive and powerful and could be a versatile and impactful presence in the trenches. Corey Wells, a 300-pounder who can bend well and be disruptive, is one of several SC Next 300 DTs in this class.\n\nPrevious rank: 8\n\nSC Next 300 commits: 11\n\nTop offensive prospect: RB Ezavier Crowell\n\nTop defensive prospect: S Jireh Edwards\n\nIt took some time for Alabama's class to find its footing, but an active June brought the Tide into the mix among the top classes in the country. They kept one of the top running backs in the class at home by landing Ezavier Crowell, an aggressive runner who possesses good power and vision.\n\nThe defense is benefitting from some big pickups, including pulling several SC Next 300 defenders out of Georgia. Xavier Griffin has a lengthy and broad frame to develop and can get up field and bend the edge. From the same high school (Gainesville), the Tide snagged DE Jamarion Matthews, who has a stockier build but can also bend well and get after the quarterback.\n\nThey also added a pair of top-10 CBs in Jorden Edmonds, also out of the Peach State, and in-state Zyan Gibson, who has posted consistent mid-4.4 40s on the camp circuit. The summer success continues into July as the Tide added five-star Jireh Edwards to their secondary. At roughly 6-foot-2 and more than 200 pounds with excellent testing numbers, Edwards can be a physical and versatile defensive back.\n\nPrevious ranking: 11\n\nSC Next 300 commits: 13\n\nTop offensive prospect: OT Jackson Cantwell\n\nTop defensive prospect: LB Jordan Campbell\n\nDespite a rocky finish to the 2024 season, the Hurricanes are trending in the right direction. Former QB Cam Ward was the No. 1 pick in the 2025 NFL draft and they've reeled in two consecutive top-15 recruiting classes. They're working on a third as Mario Cristobal's 2026 class could match or even exceed those groups.\n\nThe Hurricanes are adding pieces to field a dominant offensive line. They could lose several 2025 starters after this season but are adding big men who can step in and project a bright future in the trenches. In addition to landing the top-rated interior OL in the 2025 class, they have added several OLs to their 2026 class, led by No. 1 tackle Jackson Cantwell. Much like current standout OT Francis Mauigoa, who was a five-star himself and a Year 1 starter, Cantwell could step in at one of the tackle spots upon arriving in South Florida. He is a massive presence at roughly 6-7 and 320 pounds and carries his size well. In addition to being powerful, he possesses good quickness and flexibility, and much like Mauigoa is being projected to be a high NFL draft pick.\n\nQB Dereon Coleman has room for growth but has a quick release and accuracy. The Hurricanes flipped from Georgia a speedy receiving target out of California in Vance Spafford, who won the fastest man competition last summer at the UA Future 50 event. Four-star Miami native Jordan Campbell is 6-2, 220 pounds with the versatility to make plays in pursuit and the bend and power that portend a potential impact pass rusher. He's a candidate to take a leap with college coaching.\n\nPrevious ranking: 7\n\nSC Next 300 commits: 11\n\nTop offensive prospect: QB Faizon Brandon\n\nTop defensive prospect: ATH Joel Wyatt\n\nFaizon Brandon, a five-star quarterback, is the headliner here, and rightfully so. He's a strong, accurate passer who fits Tennessee's offense perfectly. His commitment was big initially but seems even more impactful after the Vols' publicized split with Nico Iamaleava.\n\nIn-state four-star receiver Tyreek King (Knoxville Catholic) could be highly productive as he is a quick, fluid target who has clocked in-game speeds faster than 21 mph. Tristen Keys, out of Mississippi, was a big flip from SEC foe LSU. He brings excellent ball skills and body control and offers a wide catch radius. Joel Wyatt (Oakland) is another potential receiver but the versatile athlete projects to play safety in Knoxville. Keep an eye on in-state offensive tackle Gabriel Osenda, who is a massive presence (6-7, 330 pounds) for the Vols to develop and was a riser in the fall player ranking update.\n\nTennessee's in-state success extends to defense with DE Zach Groves. A defender with good quickness and power, he has amassed more than 50 TFLs heading into his senior season. The Vols also bolstered their D-line by landing Dereon Albert out of Mississippi. The 300-pound defender has been a UA Next camp standout two straight years and displays the tools to be a tough, competitive and consistent presence in the trenches. Brayden Rouse, out of Georgia, could contribute at TE but projects to linebacker, where he brings good range and can play well in space and be effective in coverage.\n\nPrevious ranking: 10\n\nSC Next 300 commits: 12\n\nTop offensive prospect: RB Savion Hiter\n\nTop defensive prospect: DE Carter Meadows\n\nThe Wolverines signed the No. 1 QB for the 2025 cycle in Bryce Underwood and he carries high expectations, but they continue to add talent to the position and landed SC Next 300 signal-caller Brady Smigiel. The onetime Florida State commit is not only an accurate passer, but he also plays with the confidence and swagger that will be needed battling with five-star Underwood. Michigan further bolstered its backfield by landing No. 2 RB Savion Hiter, a runner with a nice blend of size (6 feet, 200 pounds), power and speed who can also catch the ball well.\n\nAfter losing two DLs in the first round of the NFL draft, Michigan added several DLs to this class, including four-stars Titan Davis, McHale Blade and Tariq Boney is a player to keep an eye on. He lacks ideal length but can be a well-rounded technician and a quick contributor. In addition to pulling Boney out of the nation's capital, Michigan also landed five-star Carter Meadows, a rangy edge defender who can bend well.\n\nAfter scoring from off the beaten path with former standout TE Colston Loveland (Idaho), the Wolverines hope to strike big again from that same region with Matt Ludwig out of Montana. He is a versatile player with good ball skills who can be tough after the catch and fights for yards.\n\nPrevious ranking: 13\n\nSC Next 300 commits: 12\n\nTop offensive prospect: ATH Davian Groce\n\nTop defensive prospect: DE JaReylan McCoy\n\nFlorida will start over after the dismissal of coach Billy Napier. A strong finish on the recruiting trail was part of what helped him stay on course last season, and while recruiting success couldn't extend Napier's tenure this time around, he does leave behind a promising class for the new staff.\n\nFive-star JaReylan McCoy could be Florida's highest-rated defensive signee in more than a decade. The 6-7, 260-pound Mississippi native brings elite length, explosive traits and a relentless motor that was on full display at the Under Armour All-America week in January. He has the potential to develop into one of the SEC's most feared defensive linemen.\n\nIn June the Gators added a pair of dynamic pass catchers in Marquez Daniel and Justin Williams, as well as Georgia running back Carsyn Baker. An early but key pickup was QB Will Griffin, who came on board in June 2024. A big-bodied passer with a strong arm and good accuracy, he could eventually be a nice transition from current QB DJ Lagway.\n\nPrevious ranking: 14\n\nSC Next 300 commits: 9\n\nTop offensive prospect: TE Xavier Tiller\n\nTop defensive prospect: LB Izayia Williams\n\nMike Norvell cranked up the heat on Florida State's 2026 recruiting class this summer. Coming off a 2-10 season that led to a staff overhaul, Norvell's program is still enduring struggles and working to add pieces to get them back to the success they had in 2023. A key in-state win was landing rangy top-five CB Chauncey Kennon out of Booker High School in Sarasota. LB Izayia Williams has bounced around with multiple commitments, including a previous commitment to the Seminoles, but if they can keep him in the mix, their defense will add a player with excellent speed and range.\n\nThe Seminoles landed multiple four-star commitments in June, headlined by tight end Xavier Tiller, who checks in at No. 84 on the SC Next 300. A former Texas A&M commit, the 6-foot-5, 215-pound Tiller boasts an 80-inch wingspan, fluid movement skills and the toughness to win contested catches.\n\nTiller isn't the only notable pass catcher entering the mix for Florida State. Wide receiver Devin Carter, the son of former Seminoles running back Dexter Carter, is back in the fold after initially flipping to Auburn. He brings explosive short-area quickness and a strong football background. Four-star Florida native Brandon Bennett adds another dynamic option.\n\nNorvell also landed a quarterback who could one day get them the ball and tie the class together by flipping Jaden O'Neal, who plays at Mustang High in Oklahoma, from the in-state Sooners. The 6-foot-3 pocket passer has a good frame, smooth delivery and calm demeanor. If Florida State holds on to O'Neal, he would be the program's highest-rated quarterback signee since 2022.\n\nPrevious ranking: 15\n\nSC Next 300 commits: 9\n\nTop offensive prospect: WR Keeyun Chapman\n\nTop defensive prospect: CB Kenton Dopson III\n\nUnsurprisingly given his ethos, Bill Belichick is building North Carolina's 2026 class from the inside out. Zavion Griffin-Haynes was a key in-state keep. The aggressive, lengthy edge defender can bolster the Heels' defensive front with the tools to be a three-down player. Four-star North Carolina defensive tackle Trashawn Ruffin flipped from Texas A&M, and the 300-pounder has plenty of raw physicality to mold. Ruffin is one of several interior linemen in the class that also includes one-time Oregon commit Viliami Moala, a massive 300-pounder who brings not only jolting power but is light on his feet for his size and can be a handful in the heart of the trenches.\n\nThe secondary has undergone some changes during this recruiting cycle, but Jakob Weatherspoon out of Ohio was a big flip from Ohio State and is CB with excellent speed. Kenton Dopson III was another key flip in the secondary, pulling him from ACC foe Miami, as the SC Next 300 defender reclassed from 2027 to 2026. Crew Davis can be a versatile back with the power to run between the tackles, but he also possesses good ball skills. As a junior, he rushed for more than 1,300 yards and also hauled in more than 50 receptions.\n\nIn an effort to boost their passing attack, the Heels have added several potential big-play pieces. Quarterback commit Travis Burgess had a strong showing at the Elite 11 finals and jumped into the SC Next 300 after spring evaluations. He displayed steady development including improved accuracy and also has excellent mobility to create with his legs as well. In July they added a pair of SC Next 300 WRs in Keeyun Chapman and Carnell Warren, both of whom are big targets (roughly 6-foot-4) who can run well. Having worked with some excellent TEs in his past, Belichick was able to snare a flip from Tennessee in Carson Sneed, who can also be a productive target as well as aid the ground game as a tenacious blocker.\n\nPrevious ranking: 12\n\nSC Next 300 commits: 10\n\nTop offensive prospect: WR Jabari Mack\n\nTop defensive prospect: DT Lamar Brown\n\nMultiple midseason conference losses have LSU starting over. The Tigers can always be tough to beat for in-state talent and if the new staff can keep the core of this class together, it will arrive with a strong base to build off. A key example of that came when LSU fended off several top suitors, including Texas A&M, and kept top-ranked prospect Lamar Brown at home. Projected to the defensive line, he is an agile and flexible big man who also could excel, if needed, as an offensive lineman.\n\nLSU also added wide receiver Jabari Mack (a strong route runner) and offensive tackle Brysten Martinez, a pair of in-state four-star recruits who bolster a class that now features more than half of the top-10 players from Louisiana. That includes a pair of teammates from Edna Karr High: DT Richard Anderson, a stout presence at more than 300 pounds with good initial quickness, and Aiden Hall, a safety with good length, speed and downhill physicality.\n\nThough much of their recruiting success is from within their primary recruiting footprint, the Tigers did go out west to land SC Next 300 CB Havon Finney Jr, who reclassified from the 2027 class. A commit who could prove harder to retain, he has shown he can be physical in press coverage but also brings excellent speed to be able to run with receivers.\n\nPrevious ranking: 16\n\nSC Next 300 commits: 9\n\nTop offensive prospect: OT Leo Delaney\n\nTop defensive prospect: S Kentavion Anderson\n\nClemson is coming off a College Football Playoff appearance, and while another appearance will have to wait, the Tigers are using recruiting to continue their chase of the heights of their mid-2010s success under Dabo Swinney. Despite some on-field struggles, their 2026 group is looking more promising, especially after a red-hot March in which Swinney landed eight verbals, including five SC Next 300 commits.\n\nMuch of the talent is currently concentrated on offense. Naeem Burroughs is a burner in the 100-meter dash who can take the top off a defense and has a high football IQ. Fellow receiver Connor Salmin is another big-play threat. With some new offensive weapons, the Tigers are making sure they have the time to get the ball downfield by loading up along the offensive line. Delaney, Carter Scruggs, Grant Wise, Adam Guthrie and Chancellor Barclay give the Tigers multiple SC Next 300 OLs to help reload a senior-heavy unit that is projected to lose multiple starters after 2025.\n\nThey could one day protect fellow four-star Tait Reynolds, a dual-threat QB out of Arizona who could push to be part of the long-term solution to replace Cade Klubnik. While the foundation of the class is on offense, Anderson is a key in-state pickup on the other side of the ball. With his frame (roughly 6-2, 190 pounds) and range, he can be a versatile back-end defender for the Tigers.\n\nPrevious ranking: 17\n\nSC Next 300 commits: 6\n\nTop offensive prospect: OT Kodi Greene\n\nTop defensive prospect: DE Derek Colman-Brusa\n\nJedd Fisch did an excellent job bringing in talent at Arizona and is now working to retool Washington's roster and get the Huskies back into the playoff hunt. The Huskies won a key recruiting battle by pulling away Greene, an SC Next 300 OL, from rival Oregon. He is a 300-pounder who moves very well for his size with good quickness and the one-time Washington resident can be a key option in the trenches. The Huskies went east to land their QB in Derek Zammit, a tough, smart player with a smooth, quick release. He should continue to improve with the tools to develop into a productive starter.\n\nWashington landed several commitments in the secondary to address that unit. In-state Elijah Durr has good size at roughly 6 feet and is smooth in his movements. He could develop at cornerback or safety. The Huskies also added a pair of four-star DBs in CB Jeron Jones, who has good speed, and Gavin Day out of Las Vegas, an aggressive safety who tallied more than 100 tackles as a junior.\n\nPrevious ranking: 18\n\nSC Next 300 commits: 4\n\nTop offensive prospect: OT Felix Ojo\n\nTop defensive prospect: S LaDamion Guyton\n\nThe Red Raiders have been active in the transfer portal, but Joey McGuire & Co. also remain committed to building their roster through high schools. He pulled off a huge in-state win landing five-star offensive tackle Felix Ojo. It's the second time McGuire has landed an in-state five-star prospect (Micah Hudson, 2024). Ojo is lean and needs some further development but has elite length, bends well and brings a high ceiling for development. In-state guard Jerald Mays is another nice addition to that unit, as he is a thickly built lineman with good feet.\n\nLaDamion Guyton added a second five-star to the class, and the Red Raiders received more good news after his commitment when it was announced he was reclassifying from 2027 to 2026. His sooner-than-expected arrival could be valuable as he possesses the tools to replace the pass-rushing production they will lose when David Bailey moves on.\n\nWhile the hope is Hudson will still break out and meet expectations, Tech is adding to the receiver room in four-star Chase Campbell, a target with good speed and body control who has amassed over 160 receptions with 35 TDs between his sophomore and junior years. In-state safety Donovan Webb can close well and has strong ball skills to finish and generate turnovers. He was position MVP at this spring's UA Dallas camp.\n\nPrevious ranking: 19\n\nSC Next 300 commits: 3\n\nTop offensive prospect: QB Ryder Lyons\n\nTop defensive prospect: DE Braxton Lindsey\n\nKalani Sitake's 2026 class has the potential to be program-defining as BYU builds on the momentum of last year's 11-win season followed by a strong on-field performance in 2025. The Cougars currently hold commitments from three top-100 SC Next 300 standouts -- led by tight end Brock Harris and quarterback Ryder Lyons -- marking what could be their most highly rated duo of high school signees in the SC Next 300 era dating to 2006).\n\nHarris, a 6-foot-7, 240-pound in-state product, has transformed from a jumbo wideout into one of the nation's premier tight ends, adding size while retaining his fluid route-running and wide catch radius. He also brings toughness, having competed at the 2025 Under Armour All-America Game with a cast on his hand. If all goes according to plan, Harris will catch plenty of passes from Lyons, a four-star quarterback who won California's Gatorade Player of the Year award this fall. Lyons' commitment represents a full-circle win for BYU. The Cougars offered him as an eighth grader and held off the likes of USC and Oregon to secure his commitment.\n\nThe third SC Next 300 prospect is two-way lineman Bott Mulitalo, who committed in March and could be tasked with protecting Lyons down the road, adding to what has the makings of a historic haul in Provo.\n\nPrevious ranking: 20\n\nSC Next 300 commits: 7\n\nTop offensive prospect: RB Damarius Yates\n\nTop defensive prospect: LB JaMichael Garrett\n\nThe Rebels have relied heavily on the transfer portal, but by no means have turned their back on bringing in young talent. They signed a top-20 class for 2025 as well one of the top 10 newcomer classes for the last cycle. Damarius Yates was a key in-state keep, as he rushed for more than 1,300 yards as a junior for Kemper County and caught 31 passes. He possesses explosive lateral movement with the acceleration to separate from defenders. Corey Barber is a receiver with good speed and can be a vertical threat as well as create plays on jet sweeps.\n\nOn defense, DEs Landon Barnes and Carmelow Reed both need further development but bring good tools. Barnes is out of one of the top programs in Texas (Duncanville) and uses his hands well and can set the edge. Reed has a big frame and possesses good first-step quickness. The Rebels added to their four-star defensive haul with Dorian Barney, a flip from Michigan who is a fluid and instinctive cover corner.\n\nPrevious ranking: 21\n\nSC Next 300 commits: 3\n\nTop offensive prospect: QB Bowe Bentley\n\nTop defensive prospect: DE Jake Kreul\n\nOklahoma's 2026 recruiting class might be middle of the pack so far in the SEC, but it's anchored by one of the top quarterback prospects in the country. Bowe Bentley, a four-star signal-caller from Celina (Texas) High, gives the Sooners a dynamic player around whom to build. Bentley is a dual-threat passer who pairs impressive production with the kind of arm talent, mobility and leadership -- not to mention a bit of improvisation -- that can shape a class.\n\nBentley is one of several four-stars currently in the group. He's joined by wide receiver Daniel Odom out of St. John Bosco (California). The 6-foot-2, 190-pound target has length, runs polished routes and has deceptive speed off the line. Oklahoma has layered in a slew of signings along the offensive and defensive fronts, including Brian Harris, a 6-3, 280-pounder out of Florida. He's a disruptive interior run defender with an impressive motor. Another key addition out of Florida -- and a big boost to the class overall -- was five-star DE Jake Kreul, who brings an explosive first step, good bend and a relentless motor and should be able to work his way into the mix in Year 1.\n\nPrevious ranking: 22\n\nSC Next 300 commits: 5\n\nTop offensive prospect: OT Darius Gray\n\nTop defensive prospect: S J'Zavien Currence\n\nSouth Carolina nearly made the College Football Playoff, and Shane Beamer keeps brightening the Gamecocks' future outlook as well. South Carolina added J'Zavien Currence out of the same high school, South Pointe High School, as former Gamecocks star Jadeveon Clowney. Currence is a versatile defender with his blend of size, versatility and speed. He could stay in the secondary, or if he continues to grow, he could move to linebacker. Also on defense, South Carolina has added several four-star defensive ends, including Keenan Britt. Britt lacks ideal height but has good arm length and initial quickness. He plays with leverage and can be a disruptive presence with his blend of speed and power.\n\nOn the heels of a deep and talented 2025 cycle receiver haul, the Gamecocks continue to add young talent to that unit, landing in-state SC Next 300 prospect Sequel Patterson. A multi-sport athlete who can play on either side of the ball, he projects to receiver where he can be a productive target as a quick and sharp route runner. SC Next 300 QB Landon Duckworth, a passer with a strong arm, brings high upside with excellent physical tools to develop. Four-star in-state offensive tackle Zyon Guiles is a 6-foot-5, 295-pound mauler with powerful hands and contact explosiveness, which should bode well even if he's asked to move inside.\n\nPrevious ranking: 24\n\nSC Next 300 commits: 5\n\nTop offensive prospect: OT Evan Goodwin\n\nTop defensive prospect: LB Kenneth Goodwin\n\nThe Mustangs charged into the CFP last season and are showing signs they plan to be consistent contenders. Capitalizing on the rich talent base in Texas, they have added several in-state prospects, including SC Next 300 back Christian Rhodes. An explosive runner who has been recorded hitting better than 21 mph in game play, he rushed for more than 1,200 yards as a junior. To help clear running lanes, the Mustangs have added several offensive linemen, including Evan Goodwin, a massive presence at 6-foot-7 and 320 pounds, and in-state guard Drew Evers, a thickly built and strong blocker who can latch on and control defenders.\n\nHigh three-star Aljour Miles II is another nice in-state add, as he is a lengthy receiver with good quickness and body control. Another receiving target with big-play potential, Jakai Anderson, was pulled out of Louisiana. Not quite as big a target, he brings a good blend of speed and elusiveness and could also be productive in the return game. On defense, the addition of DE Hudson Woods is a big plus. Woods shows some savvy as a pass rusher, with active hands and good bend. LB Kenneth Goodwin out of California can be a physical player with the ability to rush the passer as well as make plays in coverage.\n\nPrevious ranking: 25\n\nSC Next 300 commits: 5\n\nTop offensive prospect: WR Jordan Clay\n\nTop defensive prospect: DE Jamarion Carlton\n\nBaylor picked up a WR with strong ties to the program in London Smith, whose father was a football and basketball star at Baylor and whose mother was a national champion triple jumper for the Bears. Unsurprisingly, Smith is a quick, smooth target with good body control. Another key add at WR is Jordan Clay, a nice-sized target at close to 6-3 and 200 pounds who also possesses very good body control.\n\nDespite a disappointing season on the field, the Bears have won some recruiting battles this fall, including bringing four-star Ryelan Morris back into the fold after a stint when he had committed to Stanford. Although diminutive, he is versatile in how he can be utilized within their offense. He is quick with good hands and best projects as a slot receiver, where he can be dangerous after the catch.\n\nFurther capitalizing on in-state talent, Baylor landed SC Next 300 DE Jamarion Carlton and SC Next 300 CB Jamarion Vincent, who possesses coveted size at roughly 6-2 and blends that with good speed and smooth movements.\n\nPrevious ranking: 27\n\nSC Next 300 commits: 2\n\nTop offensive prospect: WR Calvin Russell\n\nTop defensive prospect: DE Kamron Wilson\n\nThe Fran Brown era in Syracuse certainly isn't boring. He led the Orange to just their second 10-win season since 2001 behind Ohio State transfer Kyle McCord, then landed a solid 2025 recruiting class. Now he's pushing for more talent in 2026. They surprised many by beating several top programs, including Michigan, for SC Next 300 WR Calvin Russell, a lengthy but smooth target who plans to also play basketball with the Orange.\n\nFour-star defensive end Jarius Rodgers, also out of Florida, is among Brown's biggest gets so far. The 6-5 220-pounder has tremendous length and an impressive track background. He has considerable physical tools and upside if Syracuse's coaching staff can harness it. Wilson is another big pull out of Florida; the edge defender has good initial quickness and tallied 17 sacks in 2024.\n\nOT Javeion Cooper has real upside too. He has good size (6-5, 300 pounds) yet plays with impressive balance for someone with his power and contact explosiveness. The Orange also have been active in the mid-Atlantic, landing three receivers from Delaware. Among that group is B.J. Garrett, a big target (6-3, 191 pounds) with good hands who could develop into a player in the mold of Oronde Gadsden, who had similar measurables coming out in the 2021 class.\n\nPrevious ranking: 26\n\nSC Next 300 commits: 2\n\nTop offensive prospect: ATH Nasir Rankin\n\nTop defensive prospect: CB Nick Hankins",
  "summary": "As more of the best recruits commit, here's our latest look at the top 65 classes.",
  "published": "Thu, 20 Nov 2025 18:21:36 EST",
  "url": "https://www.espn.com/college-football/recruiting/story/_/id/44574905/2026-college-football-recruiting-class-rankings-top-teams-schools",
  "source": "www.espn.com - TOP"
}