{
  "title": "Android Quick Share now works with Apple's AirDrop feature on Pixel 10 phones",
  "text": "Count this as the latest unexpected detente between Apple and Google. Today, Google announced that the Pixel 10 series of phones can use Android Quick Share with the iPhone’s AirDrop feature, meaning it’ll be much easier to shoot files and photos between the two platforms. While this feature is currently limited to Pixel 10 series phones, Google says it is looking to expand the feature to other devices.\n\nGoogle dropped details on how it made this work from a privacy and security standpoint in its technical blog if you want to get into the nitty-gritty. But it certainly sounds as if Google did this on its own without any input from Apple. “We accomplished this through our own implementation,” Alex Moriconi from Google told Engadget. “Our implementation was thoroughly vetted by our own privacy and security teams, and we also engaged a third party security firm to pentest the solution.”\n\nBut functionally, it sounds like this will work the same as Quick Share currently does. The receiving Apple device (this will work with iPads and Macs as well as iPhones) needs to set their Airdrop visibility preferences to “anyone for 10 minutes.” This means that people outside of your contact list will be able to initiate an AirDrop or Quick Share transfer. From there, the Pixel 10 user should be able to see the receiving Apple device when they go to share things via Quick Share as normal.\n\nAdvertisement Advertisement\n\nAdvertisement\n\nGoogle also notes that Android devices can receive files from Apple devices that are using AirDrop. They’ll just need to make sure their Quick Share visibility settings are similarly set to “everyone for 10 minutes” or that they’re in “receive” mode on the Quick Share page.\n\nIt’s not clear if Apple was involved in making this new feature work or if Google did this all on its own. Apple hasn’t released a corresponding post on its own newsroom. If Apple wasn’t involved, the obvious question is whethere or not they’ll treat this as a security breach and release a software update that undos Google’s work. And if they do, it’s entirely possible that we’re going to head down another long road of the company’s bickering about security versus openness.\n\nWe’ve reached out to Apple to get more details and will update this post if we learn anything.\n\nUpdate, November 20, 2025, 1:27PM ET: Added a statement from Google.",
  "summary": "<p>Count this as the latest unexpected detente between Apple and Google. Today, Google <a class=\"link\" href=\"https://blog.google/products/android/quick-share-airdrop/\" target=\"_blank\">announced</a> that the Pixel 10 series of phones can use Android Quick Share  with the iPhone’s AirDrop feature, meaning it’ll be much easier to shoot files and photos between the two platforms. While this feature is currently limited to Pixel 10 series phones, Google says it is looking to expand the feature to other devices.</p><p>Google dropped details on how it made this work from a privacy and security standpoint <a class=\"link\" href=\"https://security.googleblog.com/2025/11/android-quick-share-support-for-airdrop-security.html\" target=\"_blank\">in its technical blog</a> if you want to get into the nitty-gritty. But it certainly sounds as if Google did this on its own without any input from Apple. “We accomplished this through our own implementation,” Alex Moriconi from Google told Engadget. “Our implementation was thoroughly vetted by our own privacy and security teams, and we also engaged a third party security firm to pentest the solution.”</p><p>But functionally, it sounds like this will work the same as Quick Share currently does. The receiving Apple device (this will work with iPads and Macs as well as iPhones) needs to set their Airdrop visibility preferences to “anyone for 10 minutes.” This means that people outside of your contact list will be able to initiate an AirDrop or Quick Share transfer. From there, the Pixel 10 user should be able to see the receiving Apple device when they go to share things via Quick Share as normal.</p><p>Google also notes that Android devices can receive files from Apple devices that are using AirDrop. They’ll just need to make sure their Quick Share visibility settings are similarly set to “everyone for 10 minutes” or that they’re in “receive” mode on the Quick Share page.</p><p>It’s not clear if Apple was involved in making this new feature work or if Google did this all on its own. Apple hasn’t released a corresponding post on its own newsroom. If Apple wasn’t involved, the obvious question is whethere or not they’ll treat this as a security breach and release a software update that undos Google’s work. And if they do, it’s entirely possible that we’re going to head down another long road of the company’s bickering about security versus openness. </p><p>We’ve reached out to Apple to get more details and will update this post if we learn anything. </p><p><strong>Update, November 20, 2025, 1:27PM ET:</strong> Added a statement from Google.</p>This article originally appeared on Engadget at https://www.engadget.com/mobile/android-quick-share-now-works-with-apples-airdrop-feature-on-pixel-10-phones-173646458.html?src=rss",
  "published": "Thu, 20 Nov 2025 18:28:04 +0000",
  "url": "https://www.engadget.com/mobile/android-quick-share-now-works-with-apples-airdrop-feature-on-pixel-10-phones-173646458.html?src=rss",
  "source": "Engadget is a web magazine with obsessive daily coverage of everything new in gadgets and consumer electronics"
}