{
  "title": "Nearby super-Earth may be our best chance yet to find alien life",
  "text": "A possible \"super-Earth\" located less than 20 light-years from Earth is giving researchers renewed optimism in the search for planets that might host life. The newly identified world, GJ 251 c, earned its \"super-Earth\" label because current data indicate it is almost four times the mass of Earth and is likely a rocky planet.\n\n\"We look for these types of planets because they are our best chance at finding life elsewhere,\" said Suvrath Mahadevan, the Verne M. Willaman Professor of Astronomy at Penn State and co-author of a recent paper in The Astronomical Journal. \"The exoplanet is in the habitable or the 'Goldilocks Zone,' the right distance from its star that liquid water could exist on its surface, if it has the right atmosphere.\"\n\nTwo Decades of Observations Lead to Breakthrough\n\nFor many years, astronomers searching for planets capable of hosting liquid water have developed ever more advanced telescopes and modeling tools to detect extremely faint variations in starlight. According to Mahadevan, this new result arose from more than 20 years of observations and represents one of the strongest opportunities yet to investigate a potentially habitable world.\n\nThe exoplanet was identified using data from the Habitable-Zone Planet Finder (HPF), a high-precision near-infrared spectrograph that functions as a sophisticated prism to separate starlight into its components. The HPF is installed on the Hobby-Eberly Telescope at the McDonald Observatory in Texas, and Penn State researchers led its design and construction to support the search for Earth-like planets orbiting nearby stars.\n\n\"We call it the Habitable Zone Planet Finder, because we are looking for worlds that are at the right distance from their star that liquid water could exist on their surface. This has been the central goal of that survey,\" Mahadevan said. \"This discovery represents one of the best candidates in the search for atmospheric signature of life elsewhere in the next five to ten years.\"\n\nDetecting a Subtle Stellar Wobble\n\nMahadevan and his team studied a large set of measurements collected worldwide over two decades. Their analysis focused on the small but measurable \"wobble\" of the host star, GJ 251, caused by gravitational pulls from orbiting planets. These motions appear as slight Doppler shifts in the star's light.\n\nThey first refined measurements of a previously known inner planet, GJ 251 b, which completes an orbit every 14 days. By combining the long-term observations with new high-precision HPF data, the researchers detected a stronger signal repeating every 54 days, pointing to the presence of a more massive second planet. Additional confirmation came from the NEID spectrometer, another instrument built by Penn State researchers and operating at the Kitt Peak National Observatory in Arizona.\n\n\"We are at the cutting edge of technology and analysis methods with this system,\" said Corey Beard, corresponding author of the paper, who carried out the research while earning his doctorate in astrophysics at the University of California, Irvine. \"We need the next generation of telescopes to directly image this candidate, but what we also need is community investment.\"\n\nOvercoming Stellar Activity to Reveal Planetary Signals\n\nOne of the major difficulties in exoplanet detection is separating a planet's signal from the star's own magnetic activity, which Mahadevan compared to a form of stellar weather. Starspots and other surface features can mimic the periodic variations produced by orbiting planets, creating the illusion of a planetary presence. To distinguish between the two, the team used advanced modeling techniques that examine how signals behave across different colors of light.\n\n\"This is a hard game in terms of trying to beat down stellar activity as well as measuring its subtle signals, teasing out slight signals from what is essentially this frothing, magnetospheric cauldron of a star surface,\" Mahadevan said.\n\nHe noted that detecting planets like GJ 251 c depends not only on sophisticated equipment but also on complex analysis and international teamwork. Such projects require long-term funding and coordination because meaningful discoveries can take decades to emerge.\n\nCollaboration and Advanced Tools Enable Discovery\n\n\"This discovery is a great example of the power of multi-disciplinary research at Penn State,\" said Eric Ford, distinguished professor of astronomy and astrophysics and director of research for Penn State's Institute of Computational & Data Sciences (ICDS). \"Mitigating stellar activity noise required not just cutting-edge instrumentation and telescope access, but also customizing the data science methods for the specific needs of this star and combination of instruments. The combination of exquisite data and state-of-the art statistical methods enabled our interdisciplinary team to transform data into an exciting discovery that paves the way for future observatories to search for evidence of life beyond our solar system.\"\n\nAlthough current technology cannot produce direct images of GJ 251 c, Mahadevan said that upcoming telescopes will be capable of examining the planet's atmosphere, potentially revealing chemical traces of life.\n\nPreparing for Next-Generation Telescopes\n\n\"We are always focused on the future,\" he said. \"Whether that's making sure the next generation of students can engage in cutting-edge research or designing and building new technology to detect potentially habitable planets.\"\n\nGJ 251 c is situated in a position that future advanced telescopes will be able to study directly. Mahadevan and his students are already preparing for the era of 30-meter-class ground based telescopes, which will carry instruments capable of imaging rocky planets within their stars' habitable zones.\n\n\"While we can't yet confirm the presence of an atmosphere or life on GJ 251 c, the planet represents a promising target for future exploration,\" Mahadevan said. \"We made an exciting discovery, but there's still much more to learn about this planet.\"\n\nThe U.S. National Science Foundation, NASA and the Heising-Simons Foundation supported the Penn State aspects of this research.",
  "summary": "A newly detected super-Earth just 20 light-years away is giving scientists one of the most promising chances yet to search for life beyond our solar system. The discovery of the exoplanet orbiting in the habitable zone of its star was made possible by advanced spectrographs designed at Penn State and by decades of observations from telescopes around the world.",
  "published": "Thu, 13 Nov 2025 09:50:14 EST",
  "url": "https://www.sciencedaily.com/releases/2025/11/251113071618.htm",
  "source": "All Top News -- ScienceDaily"
}