{
  "title": "CBSO/Vänskä review – weird brilliance and neurotic tics in a compelling programme",
  "text": "Sibelius and Shostakovich shared a gift for lyric storytelling, lending cohesion to this evening of musical narratives at Symphony Hall, from the frosty myths and legends of Finland to the gnomic utterances of the Soviet composer’s final symphony.\n\nOsmo Vänskä has decades of experience where Sibelius is concerned, so it was unsurprising that these meticulous interpretations felt lived in. What was remarkable, however, was the way the Finnish conductor drew out the groundbreaking qualities in some of the more conventional works. This was particularly apparent in the central movement of the Karelia Suite where the warmth of the City of Birmingham Symphony Orchestra’s strings was underpinned by a folk-inflected harmonic pungency, or in the outer movements where intricate countermelodies that sometimes go unnoticed were revealed.\n\nIt was good, too, to hear a selection of Sibelius’s seldom-programmed vocal works, especially in Helena Juntunen’s characterful performances. A compelling actor, she threw herself into three of the composer’s finest orchestral songs, her body contorting with emotion as the audience hung on her every crystal clear syllable. Baron Magnus, a lyrical ballad in which a gloomy nobleman dallies with a mermaid and (unusually) lives to tell the tale was exquisitely characterised. Juntunen’s stirring soprano was rich and creamy, her dramatic commitment absolute.\n\nView image in fullscreen Osmo Vänskä conducts the CBSO in Symphony. Hall, Birmingham. Photograph: Jonathan Ferro\n\nComposed in 1913, the tone poem Luonnotar is an innovative masterpiece. Rooted in the Kalevala, the Finnish national epic, it describes the creation of heaven, moon and stars out of broken duck eggs as they tumble from the knee of a pregnant nature spirit. Juntunen, returning to the platform in traditional dress, revelled in every aspect of its weird brilliance.\n\nMany have speculated on the meaning behind Shostakovich’s cryptic 15th symphony: the composer said little about it before his death. Vänskä adopted a brisk, puckish approach to the up-tempo movements, relishing the music’s neurotic tics. The percussion section in particular had a field day, and the orchestral playing in general was up a notch on the first half. Diaphanous textures and a sustained tension heightened the Chekhovian ache of the slower movements, the music drawing to a close at last with a ghostly death rattle and a hint of mocking laughter.",
  "summary": "<p><strong>Symphony Hall, Birmingham</strong> <br />Soprano Helena Juntunen brought Sibelius’ vocal works to dramatic life  in a remarkable concert that paired the Finnish composer with late Shostakovich</p><p>Sibelius and Shostakovich shared a gift for lyric storytelling, lending cohesion to this evening of musical narratives at Symphony Hall, from the frosty myths and legends of Finland to the gnomic utterances of the Soviet composer’s final symphony.</p><p>Osmo Vänskä has decades of experience where Sibelius is concerned, so it was unsurprising that these meticulous interpretations felt lived in. What was remarkable, however, was the way the Finnish conductor drew out the groundbreaking qualities in some of the more conventional works. This was particularly apparent in the central movement of the Karelia Suite where the warmth of the City of Birmingham Symphony Orchestra’s strings was underpinned by a folk-inflected harmonic pungency, or in the outer movements where intricate countermelodies that sometimes go unnoticed were revealed.</p> <a href=\"https://www.theguardian.com/music/2025/nov/20/cbso-vanksa-review-symphony-hall-birmingham-osmo-vanska-helena-juntunen\">Continue reading...</a>",
  "published": "Thu, 20 Nov 2025 14:59:40 GMT",
  "url": "https://www.theguardian.com/music/2025/nov/20/cbso-vanksa-review-symphony-hall-birmingham-osmo-vanska-helena-juntunen",
  "source": "The Guardian"
}