{
  "title": "Serbian president faces legal complaint in Sarajevo ‘sniper-tourism’ case",
  "text": "A Croatian investigative reporter has filed a complaint with Milan prosecutors against the Serbian president, Aleksandar Vučić, for his alleged involvement in the “Sarajevo safari” affair, in which snipers from Italy and other countries allegedly travelled to the Bosnian capital to kill civilians during the four-year siege of the city in the 1990s.\n\nView image in fullscreen Aleksandar Vučić has explicitly denied ever firing on Sarajevo but has yet to comment on the latest allegations. Photograph: Zorana Jevtić/Reuters\n\nLast week, Milan prosecutors launched an investigation aimed at identifying the Italians allegedly involved on charges of voluntary murder aggravated by cruelty and abject motives.\n\nAccording to investigators, groups of “sniper tourists” are alleged to have participated in the mass killings after paying large sums of money to soldiers belonging to the army of Radovan Karadžić – the former Bosnian Serb leader who in 2016 was found guilty of genocide and other crimes against humanity – to be transported to the hills surrounding Sarajevo so that they could shoot at the population for pleasure.\n\nMore than 10,000 people were killed in Sarajevo by shelling and sniper fire between 1992 and 1996 in what was the longest siege in modern history, after Bosnia and Herzegovina declared independence from Yugoslavia.\n\nThe snipers were perhaps the most feared element of life under siege in Sarajevo because they would indiscriminately pick off people on the streets, including children.\n\nThe investigation originated from a legal complaint submitted by Ezio Gavazzeni, a Milan-based writer who gathered evidence on the allegations, as well as a report sent to the prosecutors by the former mayor of Sarajevo Benjamina Karić.\n\nGavazzeni said he had first read reports about the alleged sniper tourists in the Italian press in the 1990s, but it was not until he watched Sarajevo Safari, a 2022 documentary by the Slovenian director Miran Zupanič, that he began to investigate further.\n\nView image in fullscreen UN peacekeepers and Sarajevo citizens take cover from gunfire in ‘Sniper Alley’, a main route through the city, in March 1993. Photograph: Hidajet Delic/AP\n\nOn Wednesday, the investigative journalist Domagoj Margetić filed his complaint against Vučić with prosecutors who are investigating the case.\n\nAs reported in Sarajevo, in recent days Margetić posted evidence on social media that Vučić, then a young volunteer, was present at one of the military posts in Sarajevo from which, according to witnesses, foreign citizens and Serbian ultranationalist units were shooting and killing civilians in what has been described as a macabre “tourist safari”.\n\nNicola Brigida, a lawyer who helped Gavazzeni prepare his case, said: “The evidence accumulated after a long investigation [by Gavazzeni] is well substantiated and could lead to serious investigation to identify the culprits. There is also the report from the former Sarajevo mayor.”\n\nView image in fullscreen Pedestrians run along ‘Sniper Alley’ in Sarajevo as French UN peacekeepers look on, 5 April 1995. Photograph: Rikard Larma/AP\n\nGavazzeni claimed “many, many, many Italians” were alleged to have been involved, without providing a figure. “There were Germans, French, English … people from all western countries who paid large sums of money to be taken there to shoot civilians.”\n\nskip past newsletter promotion Sign up to This is Europe Free weekly newsletter The most pressing stories and debates for Europeans – from identity to economics to the environment Enter your email address Sign up Privacy Notice: Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on theguardian.com to send you this newsletter. You can complete full registration at any time. For more information about how we use your data see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nHe added: “There were no political or religious motivations. They were rich people who went there for fun and personal satisfaction. We are talking about people who love guns who perhaps go to shooting ranges or on safari in Africa.”\n\nGavazzeni claimed the Italian suspects would meet in the northern city of Trieste and travel to Belgrade, from where the Bosnian Serb soldiers would accompany them to the hills of Sarajevo.\n\n“There was a traffic of war tourists who went to there to shoot people,” he said. “I call it an indifference towards evil.”\n\nView image in fullscreen A mother and her son run for cover along ‘Sniper Alley’, 6 August 1994. Photograph: Rikard Larma/AP\n\nVučić has yet to comment on the allegations. Yet rumours about his time in Sarajevo have circulated for years.\n\nIn a 2021 interview with a Bosnian TV channel, the Serbian president explicitly denied ever firing on the besieged city, describing the allegations as a political manipulation rooted in the nationalist rhetoric of his youth and the region’s fragile balance of power.\n\nAgencies contributed to this report.",
  "summary": "<p>Milan allegations link Aleksandar Vučić to 1990s shootings of civilians in Bosnian capital by Italians and others</p><ul><li><p><a href=\"https://www.theguardian.com/world/gallery/2025/nov/21/sarajevo-siege-sniper-alley-in-pictures\">In the snipers’ sights: life under fire during siege of Sarajevo – in pictures</a></p></li></ul><p>A Croatian investigative reporter has filed a complaint with Milan prosecutors against the Serbian president, Aleksandar Vučić, for his alleged involvement in the “Sarajevo safari” affair, in which snipers from Italy and other countries allegedly travelled to the Bosnian capital to kill civilians during the four-year siege of the city in the 1990s.</p><p>Last week, Milan prosecutors <a href=\"https://www.theguardian.com/world/2025/nov/11/milan-prosecutors-investigate-alleged-sniper-tourism-during-bosnian-war\">launched an investigation</a> aimed at identifying the Italians allegedly involved on charges of voluntary murder aggravated by cruelty and abject motives.</p> <a href=\"https://www.theguardian.com/world/2025/nov/21/serbian-president-aleksander-vucic-legal-complaint-sarajevo-sniper-tourism-case-milan\">Continue reading...</a>",
  "published": "Fri, 21 Nov 2025 05:00:02 GMT",
  "url": "https://www.theguardian.com/world/2025/nov/21/serbian-president-aleksander-vucic-legal-complaint-sarajevo-sniper-tourism-case-milan",
  "source": "The Guardian"
}