{
  "title": "Baboons walk in line for friendship, not survival, new study finds",
  "text": "Researchers at Swansea University have discovered that baboons walk in lines, not for safety or strategy, but simply to stay close to their friends.\n\nBaboons often travel in structured line formations known as 'progressions' as they move through their home range. Previous studies offered conflicting explanations for this behavior. Some proposed that the order was random, while others argued that baboons strategically positioned themselves, with vulnerable individuals walking in the center to reduce their risk of attack.\n\nNow, using high-resolution GPS tracking, researchers from Swansea University have re-examined this behavior in a group of wild chacma baboons (Papio ursinus) on South Africa's Cape Peninsula. Their findings, published in the journal Behavioral Ecology, reveal that baboon movement patterns are driven by social bonds rather than survival strategies.\n\nThe team analysed 78 travel progressions over 36 days and showed that the order in which the individual baboons travelled were not random.\n\nThe researchers tested four potential explanations for the baboon progression order:\n\nProtecting the vulnerable (risk hypothesis) Competing for resources (competition hypothesis) Following leaders (group decision-making hypothesis) Patterns emerging from social relationships (social spandrel hypothesis)\n\nAfter analysing the data, the researchers found that the baboons' movement patterns were driven solely by their social relationships.\n\nDr Andrew King, Associate Professor at Swansea University said: \"Surprisingly, the consistent order we see for the baboons we studied isn't about avoiding danger like we see in prey animals when they position themselves in the middle of their social group, or for better access to food or water like we see in like we see in the movements of plains zebra. Instead, it's driven by who they're socially bonded with. They simply move with their friends, and this produces a consistent order.\n\n\"In the baboon group we studied, the more socially connected, higher-ranking individuals usually walk in the middle of the group, while lower-ranking baboons are often out in front or at the rear. During these group movements -- like heading to a familiar sleeping spot -- it's likely that the group already knows where they're going. So, the baboons at the front aren't really leading; they're just out ahead.\"\n\nThis finding introduces the concept of a 'social spandrel'. In buildings, spandrels are the triangular spaces that emerge as by-products when arches are placed side by side. In biology, a spandrel refers to a trait that arises not because it was directly selected for, but as a side effect of something else. In this case, the consistent travel patterns among baboons emerge naturally from their social affiliations with each other, and not as an evolved strategy for safety or success.\n\nMarco Fele, the study's lead author and PhD student at Swansea University, said: \"We know that strong social bonds are important for baboons -- they're linked to longer lives and greater reproductive success. But in this context, those bonds aren't serving a specific purpose. The travel order we see is simply a by-product of those relationships, not a strategy with immediate benefits. Our study highlights the potential for these kinds of spandrels in collective animal behaviour.\"",
  "summary": "Researchers have discovered that baboons walk in lines, not for safety or strategy, but simply to stay close to their friends.",
  "published": "Tue, 03 Jun 2025 11:48:13 EDT",
  "url": "https://www.sciencedaily.com/releases/2025/06/250603114813.htm",
  "source": "Latest Science News -- ScienceDaily"
}