{
  "title": "Asda to raise £568m in store sell-off as sales continue to fall",
  "text": "Asda is selling off 24 stores and a distribution centre – and leasing them back – to raise £568m in what has been called a “sign of weakness” as sales at the heavily indebted retailer continue to fall.\n\nThe Leeds-based supermarket group, which is expected to release its quarterly results next week, has continued to lose market share to rivals as sales have gone backwards, despite an effort to win over shoppers with price cuts and improved stores.\n\nSales fell 3.9% in the three months to 2 November, according to data from Worldpanel by Numerator (formerly Kantar), which indicated a one percentage point drop in market share from a year before.\n\nAsda’s parent group slumped to a near-£600m loss last year as sales fell and the cost of servicing its debt pile increased.\n\nNadine Houghton, a national officer for the GMB union, which represents thousands of the retailer’s workers, said there were concerns about Asda’s future in the light of the latest lease-back deal: “Asda’s owners, TDR Capital, is selling off yet more assets to settle the debt liabilities heaped on the business by its own borrowing.\n\n“Debt is up, lease liabilities are up, interest payments are up – but market share and staff morale are rock bottom. Asda was once one of the UK’s biggest retailers – where will it all end?”\n\nClive Black, a retail analyst at Shore Capital, said: “From the outside it looks like a sign of weakness that tangible fixed assets are being sold at this time.”\n\nHe said the deal might help Asda to pay off debt or allow more capital to invest in the business but would also mean higher rents, meaning less cash for day-to-day operations.\n\n“If trading was hunky dory, that can be accommodated in the big scheme of things, but that is not the case. We had expected a more stable trading position from Asda by now,” Black said. “Recent market share data has been very poor for grocery. It all feels rather tight.”\n\nPatrick O’Brien, an analyst at GlobalData, said Asda’s promise in March under its new chair, Allan Leighton, to stir up the market with a barrage of price cuts, did not appear to have hit home.\n\nskip past newsletter promotion Sign up to Business Today Free daily newsletter Get set for the working day – we'll point you to all the business news and analysis you need every morning Enter your email address Sign up Privacy Notice: Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on theguardian.com to send you this newsletter. You can complete full registration at any time. For more information about how we use your data see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\n“There was a feeling that Asda were really going to bring out the big guns and we haven’t really seen that materialise,” he said. “We have not seen that aggressiveness on price as yet.”\n\nAsda, which has 579 supermarkets, 517 Express convenience stores and 29 Asda Living general merchandise and fashion outlets in total, said it would continue to operate from the latest batch of stores to be sold off. They have gone to two buyers: DTZ Investors and Blue Owl Capital.\n\nThe deal is part of plan to cut hefty debts at Asda since a highly leveraged £6.8bn takeover in 2020 by the billionaire Issa brothers and the private equity firm TDR Capital. TDR now controls the group after buying out one of the brothers, Zuber Issa, while Mohsin Issa retains a 22% stake.\n\nAmarveer Singh, a credit analyst at CreditSights, said the deal would negatively affect Asda’s credit rating as it would increase leasehold exposure while the proceeds of the sale and leaseback would not be used for investment or cutting the group’s main debts. Bonds fell as it emerged that the money is to be used to pay off a debt to Walmart, the US retailer that previously owned Asda and retains a 10% stake, as first reported by the Financial Times.\n\nAsda previously sold most of its warehouses for £1.7bn in 2021, and 25 supermarkets for £650m two years later, in similar deals in which it agreed to lease back the properties. It also signed a more unusual ground rent deal for £300m in 2023.\n\nAn Asda spokesperson said: “Asda’s property strategy is centred on maintaining a strong freehold base while also taking a considered and selective approach to unlocking value from our estate where appropriate. These transactions reflect that approach, enabling us to realise value from the sites while retaining full operational control.”",
  "summary": "<p>Supermarket still losing market share despite effort under Allan Leighton to win over customers with price cuts </p><p>Asda is selling off 24 stores and a distribution centre – and leasing them back – to raise £568m in what has been called a “sign of weakness” as sales at the heavily indebted retailer continue to fall.</p><p>The Leeds-based supermarket group, which is expected to release its quarterly results next week, has continued to lose market share to rivals as sales have gone backwards, despite an effort to win over shoppers with price cuts and improved stores.</p> <a href=\"https://www.theguardian.com/business/2025/nov/20/asda-raise-568m-store-sell-off-sales-fall-allan-leighton\">Continue reading...</a>",
  "published": "Thu, 20 Nov 2025 15:30:31 GMT",
  "url": "https://www.theguardian.com/business/2025/nov/20/asda-raise-568m-store-sell-off-sales-fall-allan-leighton",
  "source": "The Guardian"
}