{
  "title": "Ice warnings across parts of UK as cold snap sets in",
  "text": "Ice warnings across parts of UK as cold snap sets in\n\n5 hours ago Share Save BBC Weather and Mallory Moench Share Save\n\nDanny Lawson/PA Wire A dog walker braved frosty conditions in North York Moors\n\nIcy conditions will sweep into more parts of the UK overnight, after snow and ice forced hundreds of schools to shut and closed roads on Thursday. The Met Office issued yellow warnings for ice in areas across the country including in parts of north-east Scotland, western Wales, south-west England, and along England's east coast. Warnings are already in place in some areas. Thursday is expected to see the week's coldest night, with temperatures widely falling below zero and down to -12C (10.4F) in rural Scotland. The UK Health Security Agency (UKHSA) issued cold-health alerts for England until Saturday, saying there could be significant impacts to the elderly and people with health conditions.\n\nSome parts of the country had a blanket of snow on Thursday with Altnaharra in northern Scotland and Loch Glascarnoch in west Scotland recording 9cm as of 11:00 GMT.\n\nThe yellow ice warnings currently in place are: Cornwall in south-west England until 11:00 on Friday\n\nParts of eastern, south-east England, east Midlands and Yorkshire & Humber until 11:00 on Friday\n\nParts of north-east Scotland to 11:00 on Friday\n\nParts of north-east England and Yorkshire & Humber until 12:00 on Friday\n\nParts of western Wales until 11:00 on Friday Gusty winds with occasional blizzard conditions, and potentially a few lightning strikes, could come with the snow showers, posing additional hazards. Around 40 schools in North Yorkshire were closed on Thursday, while 10 were also listed as closed in East Yorkshire.\n\nDanny Lawson/PA Wire A snow covered car on the A169 between Pickering and Whitby on the North York Moors\n\nIn north-east Scotland, more than 100 schools were shuttered as heavy snow caused further disruption across the region. Aberdeenshire Council said dozens of schools could not open, with schools in Moray and the Highlands also closed. Major roads have been affected - including parts of the A90 which was closed for several hours. Traffic Scotland has also reported that the A939 in Scotland has been closed at the snow gate at Tomintoul due to adverse weather conditions.\n\nIn Wales, National Grid said engineers were dealing with \"several separate incidents\" in the west of the country due to adverse weather conditions on Thursday afternoon. Supply has since been restored in Newcastle Emlyn and Pontypridd, updates said. Forty schools were closed in Pembrokeshire, seven in Ceredigion and 14 in Carmarthenshire. Ela McLoughlin, 14, was glad to be off school in Crymych. Along with Helen McLoughlin, Conan Blake and their dog Madog, she walked up Foel Drygarn in the morning and saw people skiing.",
  "summary": "New ice warnings were issued in Scotland, England and Wales for Friday, with the coldest night of the week expected on Thursday.",
  "published": "Fri, 21 Nov 2025 01:01:32 GMT",
  "url": "https://www.bbc.com/news/articles/crexe25709yo?at_medium=RSS&at_campaign=rss",
  "source": "BBC News"
}