{
  "title": "Ranji Trophy: Who after Ashwin? Nikhil, the 6'2\" bowler from Haryana, is up for the challenge",
  "text": "Haryana off-spinner Nikhil Kashyap\n\nNew Delhi:\n\nWhy coach Gautam Gambhir can't continue with his IPL ways in Test cricket\n\nGo Beyond The Boundary with our YouTube channel. SUBSCRIBE NOW!\n\nI love bowling to the right-handed batters. There is a different level of satisfaction if you get them out after setting them up in a spell on a flat track. Nikhil Kashyap\n\nA good spinner will take wickets on all pitches. Why R Ashwin is considered a great is because he has done well wherever he has played. Nikhil Kashyap\n\nWhen the batters step out and hit me over the top, it makes me smile, because I have won half the battle. Nikhil Kashyap\n\nAshwin bhai se milna hai. Kuch baatein puchni hai, who nahi bata sakta. Nikhil Kashyap\n\nPoll Do you believe off-spinners are becoming an endangered species in Indian cricket? Yes, definitely No, they are still competitive Unsure\n\nAshwin bhai se\n\nmilna hai. Kuch baatein puchni hai, who nahi bata sakta aur bas wickets lene hai\n\nGrowing up in Rohtak, Nikhil Kashyap spent his teenage years playing tennis-ball cricket and foxing batters with his carrom ball -- an art he learnt after spending hours on YouTube watching R Ashwin 's bowling videos.\"He (Ashwin) is my idol. I have spent hours watching his videos. He is a magician,\" Kashyap tells TimesofIndia.com in an exclusive interview.\"I am a big fan of his variations, especially the way he tricks the right-handed batters,\" he says.With 24 wickets in five matches, the 25-year-old, in his debut season, has set the Ranji Trophy on fire. The Haryana off-spinner is ninth on the leading wicket-takers list and is the lone off-spinner in the top 20.In a country full of cricketing talent across skills, there is a lack of quality off-spinners coming through the system. They have become an endangered species in Indian cricket . After R Ashwin, Washington Sundar is carrying the baton, but in domestic cricket, the crop seems to have dried up. There are very few who can challenge Washington's place. With leg-spinners and left-arm spinners dominating both white-ball and red-ball formats, off-spinners have slipped down the pecking order.The selectors had their eyes on Pulkit Narang before focus shifted to Tanush Kotian, who was even flown to Australia during the Border Gavaskar Trophy when R Ashwin dropped the retirement bombshell. Madhya Pradesh's Saransh Jain's name is also constantly doing rounds but none have made a pressing case for selection.\"Being an off-spinner is a challenge,\" admits Kashyap, who made his first-class debut this season only after veteran off-spinner Jayant Yadav moved to Puducherry.\"The offies get the ball only if a left-handed batter is at the crease. If the opposition is right-handed heavy, you will see left-arm bowlers operating from both ends. It happens in age-group cricket as well,\" he says.However, Kashyap, who first held the leather ball at the age of 17 when he joined the Shri Ram Narain Cricket Club (SRNCC) academy in Rohtak, where his coaches Ashwani Kumar and Tejinder Mann not only honed his skills but also made him realise that if he wanted to have a successful career, feels he must not think about match-ups.\"There is no fear in me. I love bowling to the right-handed batters. There is a different level of satisfaction if you get them out after setting them up in a spell on a flat track,\" laughs Kashyap.Kashyap, who is a late bloomer, didn’t play age-group cricket for Haryana. But the Haryana Cricket Association (HCA) kept faith in him, and he played two seasons at U-23 level. Last year, he was picked for the Ranji camp, but an unfortunate injury cost him an entire season.\"The side strain delayed my senior debut for Haryana. I was a bit angry with my luck, but it made me hungry,\" he says.Like his childhood hero R Ashwin, Kashyap stands 6 feet 2 inches, and he believes that with his height he doesn't rely much on surfaces.\"A good spinner will take wickets on all pitches. Why R Ashwin is considered a great is because he has done well wherever he has played,\" he says.\"I feel bowling on a turner is also an art. You have to pick that one spot and it is not easy because you get greedy as a spinner when you see the turn and bounce. So, you need to be very cautious with your speed, your variations and length,\" he explains.The lanky spinner says what has helped him in his debut season is his variations.\"I have four different variations. There is one normal stock ball (off-spin), one slider, arm ball and then carrom ball. I am also working on getting that drift if the pitch is seam-friendly,\" says Kashyap.Off-spinners are struggling to create an impact in red-ball cricket too, even at the domestic level. In the shorter formats, they rely on multiple variations and can often get away with minor errors because of the spread-out field. But red-ball cricket offers no such cushion; one loose delivery that goes for a boundary immediately releases all the pressure on the batter.\"It is challenging. But I am relishing every opportunity. I see myself as a wicket-taker, and it has helped me. I go for wickets. The more revs I put on the ball, the better I will become. When the batters step out and hit me over the top, it makes me smile, because I have won half the battle. Because for them, it is a release shot, but for me, I will try and get him out the next time he uses his feet,\" he says.In modern cricket, white-ball cricket offers more lucrative opportunities and financial rewards than red-ball cricket. However, Kashyap, who is yet to receive a call from an IPL franchise, wants to perform well for Haryana in white-ball cricket and hopes to meet R Ashwin at some point.(I want to meet Ashwin. I need to ask him a few things. I can’t reveal what they are, and I just want to take wickets),\" he says.",
  "summary": "Haryana's Nikhil Kashyap is the lone off-spinner in the top 20 wicket-takers’ list in this season's Ranji Trophy. With 24 wickets in five matches, the 25-year-old, in his debut season, has set the Ranji Trophy on fire. He is ninth on the leading wicket-takers list and, with his tall frame, is someone selectors can keep a close eye on for the future.",
  "published": "Fri, 21 Nov 2025 08:21:00 +0530",
  "url": "https://timesofindia.indiatimes.com/sports/cricket/news/the-great-indian-off-spinner-drought-who-after-r-ashwin-nikhil-kashyap-the-62-bowler-from-haryana-is-up-for-the-challenge/articleshow/125475498.cms",
  "source": "Times of India"
}