{
  "title": "Thursday news quiz: TikTok horrors, hat-trick heroes and a rescued baby otter",
  "text": "Last week in the comments, someone dared raise the ancient philosophical conundrum: when we say “the first line of a play”, do we mean the first words spoken by a character, or do the stage directions count? The Thursday quiz condemns such quibbling, hair splitting and dramaturgical pedantry – unless of course it’s the quiz making a fuss. Still, the show must go on regardless, so limber up for another 15 questions of topical nonsense and dubious – though entirely correct – general knowledge. Let us know how you get on in the comments. Allons-y!\n\nThe Thursday news quiz, No 224\n\n1. Which Radio 2 DJ just ran 135 miles in five days carrying a Pudsey Bear backpack from Kielder Forest to Leeds to raise money for Children in Need? Sara Cox Rylan Mel Giedroyc Scott Mills Reveal 2. Westminster Abbey (some window fragment pictured) refused admission to someone wearing a T-shirt that depicted what? A medieval bestiary lion looking a bit too demonic An 18th-century satirical cartoon of a bishop A 1908 illustration of Pan Chris Martin falling through a trapdoor Reveal 3. The disgraced former Spanish football federation president Luis Rubiales (not pictured) had what flung at him – allegedly by his uncle – in Madrid? A milkshake A shoe Some eggs 30-50 feral hogs Reveal 4. This is Willow, the official dog of the Guardian Thursday quiz. She was worried about a baby otter that was rescued off the coast of California, but thankfully it was reunited with its mummy. What was its name? Cucumber Courgette Crumpt Caterpillar Reveal 5. Sky Sports has been forced to ditch its TikTok channel targeting girls and young women three days after its launch, over criticism that it was patronising and 'unbelievably sexist'. What was the ill-fated venture called? Fomo Halo Juno Derek Reveal 6. A Texas state trooper caused a stir when he bumped into some players from South Carolina (not pictured) at some university match-up or other, the Thursday quiz wasn't paying attention. But its eye was caught by the name of the South Carolina university football team involved. What is it? Hornbashers Gamecocks Buckblasters Bullbangs Reveal 7. Which country has sparked bafflement by attempting to set a 6km/h speed limit for cyclists, skaters and other pavements users? Slovenia Serbia Slovakia Syldavia Reveal 8. This week's guest canine is Mia, whom the Thursday quiz met in Watford. She wants to know which player became a national hero by scoring five goals in two matches and propelling Ireland to what had seemed an unlikely looking playoff berth for the 2026 men's Fifa World Cup? Troy Parrott Atlas Jay Hector Sparrow Bobson Dugnutt Reveal 9. Ocean boffins (the correct technical term) have identified the first ever live sighting of which species of whale (not pictured)? Majoram-jawed crested whale Ivy-finned nosedipper whale Ginkgo-toothed beaked whale Shoggothinko abyssal whale Reveal 10. Authorities in Singapore have stuck someone in the slammer after they jumped a barrier and rushed to embrace which member of the cast (not pictured) of Wicked: For Good? Michelle Yeoh Marissa Bode Sharon D Clarke Ariana Grande Reveal 11. Here is Karl-Heinz with his opening lines, which almost rhymes. This week the Thursday quiz imagines the German soccer ace would like to know which song begins: 'Well, they blew up the Chicken Man in Philly last night.' Runnin’ Down a Dream by Tom Petty Atlantic City by Bruce Springsteen Lighten Up, Morrissey by Sparks Cortez the Killer by Neil Young Reveal 12. It is Bo Derek's birthday today. Happy birthday, Bo! Which of these numbers is she most closely associated with? 10 19 27 1,057 Reveal 13. An Argentinian judge has been fired after causing a mistrial in a case related to Diego Maradona (pictured, cheating). Why? Because she was in an undisclosed relationship with the chief prosecutor Because she participated in a documentary about the case Because it emerged that her mother was one of Maradona’s cousins Because she was unmasked as Gary Barlow's massive son in disguise Reveal 14. It's time for on this day with Brian May! And his badger! 20 November is the anniversary of the release of Microsoft Windows 1.0. The Thursday quiz imagines Queen's legendary guitarist wants you to tell him – and his badger – in which year was the release. 1979 1982 1985 1988 Reveal 15. Two long-lost organ pieces by which composer have been performed for the first time in 300 years? Henry Purcell George Frideric Handel Johann Sebastian Bach Some very naughty musical miniature dachshunds Reveal\n\nIf you really do think there has been an egregious error in one of the questions or answers – and can show your working and are absolutely 100% positive you aren’t attempting to factcheck a joke – you can complain about it in the comments below. Why not watch Mangetout by Wet Leg instead?",
  "summary": "<p>Test yourself on topical news trivia, pop culture and general knowledge every Thursday. How will you fare?</p><p>Last week in the comments, someone dared raise the ancient philosophical conundrum: when we say “the first line of a play”, do we mean the first words spoken by a character, or do the stage directions count? The Thursday quiz condemns such quibbling, hair splitting and dramaturgical pedantry – unless of course it’s the quiz making a fuss. Still, the show must go on regardless, so limber up for another 15 questions of topical nonsense and dubious – though entirely correct – general knowledge. Let us know how you get on in the comments. <em>Allons-y!</em></p><p><strong>The Thursday news quiz, No 224</strong></p> <a href=\"https://www.theguardian.com/lifeandstyle/2025/nov/20/the-guardian-thursday-quiz-general-knowledge-topical-news-trivia-224\">Continue reading...</a>",
  "published": "Thu, 20 Nov 2025 06:30:15 GMT",
  "url": "https://www.theguardian.com/lifeandstyle/2025/nov/20/the-guardian-thursday-quiz-general-knowledge-topical-news-trivia-224",
  "source": "The Guardian"
}