{
  "title": "West Bengal voter list 2025: How to check your name in SIR list: Know whether your BLO has uploaded your enumeration form",
  "text": "West Bengal voter list 2025: The Election Commission of India has commenced the second phase of the Special Intensive Revision (SIR) of electoral rolls across 12 states and Union Territories.\n\nThe poll panel will publish a draft electoral list on December 9 and the final electoral roll on February 7, 2026. If you have submitted your Enumeration Form to your Booth Level Officer (BLO) or online, you can easily check whether it has been uploaded to the Election Commission portal.\n\nWest Bengal SIR news: How to check if your BLO has uploaded your Enumeration Form\n\n\n\nIf you have already submitted your Enumeration Form to your Booth Level Officer (BLO) or filled it online, you can quickly verify whether it has been uploaded to the Election Commission portal. Follow these simple steps:\n\nStep 1: Visit the website\n\nOpen your browser and go to voters.eci.gov.in\n\nVoters must verify their names against the 2002 electoral rolls between November 4 and December 9 to appear on the draft list. Voters must verify their names against the 2002 electoral rolls between November 4 and December 9 to appear on the draft list.\n\nStep 2: Open the Enumeration Form page\n\nOn the homepage, click ‘Fill Enumeration Form’. This will take you to the login or signup page.\n\nStep 3: Sign up (if you are a new user)\n\nStory continues below this ad\n\nClick ‘Sign Up’, then enter your mobile number, optional email ID, and the captcha to complete the registration.\n\nStep 4: Log in (for existing users)\n\n\n\nClick ‘Login’, enter your mobile number and the captcha, and then select ‘Request OTP’. Enter the OTP to log in.\n\nStep 5: Go back to the ‘Fill Enumeration Form’ section\n\nOnce logged in, your name will appear at the top. Click ‘Fill Enumeration Form’ again.\n\nStep 6: Enter your EPIC number\n\nType your EPIC (voter ID) number in the given box.\n\nStory continues below this ad\n\nThe last such exercise was held in 2002, and it is only natural that many voters who were on that list have moved elsewhere or died. The last such exercise was held in 2002, and it is only natural that many voters who were on that list have moved elsewhere or died.\n\nStep 7: Search for your form\n\nClick ‘Search’. The status of your form will appear instantly.\n\nHow to understand the status\n\nStep 8: If your form is uploaded\n\nYou will see a message saying:\n\n“Your form has already been submitted with mobile number XXXXX…”\n\nThis confirms that your BLO has uploaded it.\n\nStep 9: If your form is not uploaded\n\nStory continues below this ad\n\nYou will not see the above message. Instead, a new form page may open.\n\nStep 10: If something seems incorrect\n\nIf the mobile number shown is wrong, or the status says ‘submitted’ even though you didn’t submit it, contact your local BLO immediately.\n\nWest Bengal SIR online: When will SIR be conducted?\n\nThe Election Commission informed that for SIR Phase-2, training of officials will begin from October 28 to November 3, 2025.\n\nThe house-to-house enumeration phase is scheduled between November 4 to December 4.\n\nOn December 9, 2025 draft electoral rolls will be published.\n\nAny claims or objections can be filed between December 9 2025, to January 8, 2026.\n\nHearing and verification of these claims will take place between December 9, 2025 to January 31, 2026.\n\nThe final electoral rolls will be published on February 7, 2026.\n\nWest Bengal sir form download: Which documents are needed to be submitted for SIR?\n\n\n\nAny identity card or pension payment issued to a pensioner or an employee of the Central or State Government.\n\nAny Identity card or certificate issued by the Government of India. An Aadhaar card is not a valid proof of citizenship, but can be submitted for SIR.\n\nBirth certificate\n\nPassport\n\nMatriculation or education certificate\n\nPermanent Residence certificate issued by the competent authority.\n\nForest Rights certificate.\n\nOBC/SC/ST or any other caste certificate\n\nNational Register of Citizens (wherever applicable)\n\nAny land or house allotment certificate issued by the government.\n\nFamily Register prepared by local authorities.\n\nWest Bengal election 2026: How will the SIR be conducted?\n\nThis includes 10 steps:",
  "summary": "",
  "published": "Thu, 20 Nov 2025 13:11:26 +0000",
  "url": "https://indianexpress.com/article/india/how-to-check-your-name-in-sir-list-know-whether-your-blo-has-uploaded-your-enumeration-form-10376345/",
  "source": "India | The Indian Express"
}