{
  "title": "My morale badly dampened: Begusarai judge objects to Principal District Judge transferring case away from him",
  "text": "Stating that his morale is “badly dampened” and that such incidents make the “judiciary a matter of laughing stock”, an Additional District and Sessions Judge in Begusarai has raised strong objections to the Principal District Judge (PDJ) transferring a case that was at a “concluding stage”. The Additional District and Sessions Judge-III, Brajesh Kumar Singh, who had recommended contempt action against the Begusarai District Magistrate (DM) and Superintendent of Police (SP), also said the purpose of the transfer was to “shield” them.\n\nHe also noted in his order copy that the PDJ had “interfered on earlier occasions” as well.\n\nThe order was passed by Justice Singh in an execution case from 2024, filed by Manish Kumar of Handalpur in Begusarai. The execution proceedings relate to compensation awarded to Kumar after his guardian died in a road accident involving a police vehicle. The claim had been decreed earlier, and the execution case concerns the enforcement of that award against the State of Bihar through the DM and others.\n\nIn the order copy dictated in court and signed by Justice Singh on November 17, he noted that on October 14, 2025, his court had recommended initiation of contempt proceedings against the DM and SP and had sought show-cause replies.\n\nThe court recorded that no reply was submitted by the DM despite repeated opportunities. The order also mentioned that, though the SP filed a response, paragraph 8 of his filing stated that he would reserve the right to submit a detailed show-cause before the Patna High Court.\n\nJudge Singh observed, “It appears that DM and SP are willing to file their respective show-causes in the Hon’ble High Court, Patna directly.”\n\nIn view of this, the court directed, “OC (officer in charge) to send the extracts of miscellaneous case (with the relevant orders) to the Registrar General, Hon’ble High Court, Patna, with the recommendation to initiate contempt against the SP and DM.”\n\nStory continues below this ad\n\nSoon after issuing these directions, Judge Singh received an order dated November 15 from the Principal District and Sessions Judge (PDJ), Begusarai, recalling the execution case to his “personal file” for hearing and disposal.\n\nJudge Singh stated that he had “no vested interest in the matter” and was ready to comply. He, accordingly, directed the OC “to hand over the entire case records to the court of Ld Principal District and Sessions Judge, Begusarai, for keeping the records in his personal file”.\n\nHowever, he recorded that the recall had taken place “without any application at the behest of either party or without report of the court”. He added that the PDJ appeared to have acted “without even looking at the records, maybe on the basis of his personal knowledge, because the entire file is pending in the court of District Judge-III”.\n\nJudge Singh also mentioned the scope of Section 24 of the Code of Civil Procedure, under which the PDJ acted. He said in the order, “The Principal District and Sessions Judge, Begusarai, has palpably passed the order in the interest of so-called ‘administration’. However, section 24 of CPC is conspicuously silent about transfer on the ground of so-called ‘administration’.”\n\nStory continues below this ad\n\n“It is trite that the power of the Principal District and Sessions Judge under section 24 of the CPC cannot be exercised ‘at his whims and fancies’,” the judge said in the order.\n\nReferring to the phrase “of its own motion” in the provision, he noted, “The alternative phrase ‘of its own motion’ used in section 24 of the CPC cannot be equated with ‘the pleasure’ of Principal District and Sessions Judge’.”\n\nJudge Singh stated that the PDJ “has no absolute power to transfer the case when the transferor court is at the stage of concluding the proceedings in that case”.\n\nAccording to the order, transferring the case at this stage “has violated the ‘principle of judicial independence’, the very judicial principle which every judge has sworn (to) protect”.\n\nStory continues below this ad\n\nJudge Singh remarked that the consequence of such interference was to make “the judiciary a matter of laughing stocks inasmuch as the judges of the subordinate judiciary appear to be only paper tigers, having no order passed by them has got binding effect on mighty and powerful bureaucrats”.\n\nJudge Singh further dictated, “My morale is badly dampened by seeing as to how the water is thrown at the entire efforts of this court by this transfer”.\n\nHe questioned how compliance could be expected from ordinary litigants if senior officials appeared insulated from accountability. “Why only poor should be subjected to coercive orders of the court for non-compliance, when mighty bureaucrats are made absolutely immune from judicial process in the lower judiciary?” Justice Singh stated.\n\nHe added that, in his opinion, “the transfer by Ld Principal District and Sessions Judge, Begusarai, was made to shield the DM and SP from contempt proceeding”.\n\nStory continues below this ad\n\nThe order also notes that the PDJ had interfered on earlier occasions, a matter “duly recorded” in the court’s order dated September 23.\n\nComplying with the transfer order, Judge Singh added, “I am withdrawing from this case as mandated by the aforesaid transfer by Ld Principal District and Sessions Judge, Begusarai, but I have no regrets.”",
  "summary": "",
  "published": "Thu, 20 Nov 2025 02:30:36 +0000",
  "url": "https://indianexpress.com/article/india/makes-judiciary-laughing-stock-paper-tigers-judge-after-case-is-transferred-to-shield-begusarai-dm-sp-10375144/",
  "source": "India | The Indian Express"
}