{
  "title": "Red Fort Blast Case | ‘This is terrorism and nothing else’: Owaisi condemns Umar un Nabi’s claims on suicide bombing",
  "text": "A day after Red Fort bomber Umar un Nabi’s video on ‘suicide bombing’ circulated online, All India Majlis-e-Ittehadul Muslimeen (AIMIM) President Asaduddin Owaisi condemned his actions, underlining that suicide was haram (forbidden) in Islam and that killing of innocents was a “grave sin”.\n\nIn the undated video, now widely shared on social media, Umar could be seen referring to suicide bombing as a “martyrdom operation”.\n\nReferring to the video, Owaisi on Wednesday wrote on X: “There is an undated video of Delhi blasts accused Umar Nabi justifying suicide bombing as “martyrdom,” and that it’s “misunderstood.” Suicide is haram in Islam and the killing of innocents is a grave sin. Such acts are also against the law of the land. They are not “misunderstood” in any way. This is terrorism and nothing else.”\n\nOwaisi also targeted Union Home Minister Amit Shah over his earlier claims that no Kashmiri local had joined terror groups in the past six months. “During Operation Sindoor and Mahadev @AmitShah had assured Parliament that no local Kashmiri had joined terror groups in the last six months. Where did this group come from then? Who is accountable for the failure to detect this group?” he wrote in his post.\n\nThere is an undated video of Delhi blasts accused Umar Nabi justifying suicide bombing as “martyrdom,” and that it’s “misunderstood.” Suicide is haram in Islam and the killing of innocents is a grave sin. Such acts are also against the law of the land. They are not… — Asaduddin Owaisi (@asadowaisi) November 19, 2025\n\nAddressing the Rajya Sabha on the success of Operation Sindoor in July this year, Shah claimed that in the past six months, no local had joined any terrorist group in Jammu and Kashmir (J&K).\n\nAlso Read | Delhi Red Fort blast: All in touch with Umar in last few months under scanner\n\nNabi drove the Hyundai i20 car that exploded near the Red Fort on November 10, with DNA samples from his mother confirming it was him behind the wheel of the car.\n\nAs reported by The Indian Express, investigators relied on key forensic clues to establish that Umar was driving the car, including a charred portion of a leg found near the accelerator and a black sports shoe lying beside the wreckage.\n\nA day earlier, investigators probing the Jaish-e-Mohammad (JeM) terror module Nabi was part of told The Indian Express that the video was extracted from his own mobile phone.\n\nStory continues below this ad\n\nAccording to investigators, Umar’s associates claimed during questioning that he was the most radicalised among the close-knit Jaish module and would often broach the subject of suicide bombing.\n\nThe NIA has arrested two close associates of Umar — Amir Rashid Ali, a resident of Pulwama, and Kasir Bilal Vani alias Danish, a resident of Anantnag — in connection with the blast.",
  "summary": "",
  "published": "Wed, 19 Nov 2025 06:41:17 +0000",
  "url": "https://indianexpress.com/article/india/red-fort-blast-case-terrorism-asaduddin-owaisi-condemns-umar-un-nabi-claims-suicide-bombing-10373829/",
  "source": "India | The Indian Express"
}