{
  "title": "Iran cancels visa-free entry for Indians over trafficking cases",
  "text": "Following a series of cases in which Indians were lured with fake job offers, trafficked into Iran, and later kidnapped for ransom, the government of Iran has suspended its visa-free entry facility for Indian nationals from November 22.\n\nThe suspension applies to all Indian citizens holding ordinary passports. Indian travellers will now need to obtain a visa for both entry and transit through Iran.\n\nIn an advisory issued Monday evening, the Ministry External Affairs (MEA) said the decision aims to stop the misuse of the visa waiver by organised criminal networks exploiting desperate job-seekers.\n\nThe MEA said it had been alerted to multiple incidents where Indians were deceived into travelling to Iran with promises of high-paying jobs, easy transit to Gulf or European countries and visa-free employment opportunities. Many of these individuals were then kidnapped on arrival, with criminal gangs demanding ransom from their families, it said.\n\n“The attention of the Government has been drawn to several incidents of Indian nationals being lured to Iran on false promises of employment… On arrival in Iran, many of them were kidnapped for ransom,” the advisory said. The ministry warned that the suspended visa waiver had been exploited by agents who prey on vulnerable job seekers.\n\nThis latest warning comes just a month after the MEA issued a similar advisory, cautioning Indians about fraudulent agents sending people to Iran on the pretext of employment. The ministry had urged citizens not to fall prey to such offers, stressing that visa-free access had strict limits and did not apply to employment.\n\nSince February last year, Iran had allowed Indians to travel in the country without a visa under certain conditions, with an aim to deepen diplomatic ties with several countries from Central Asia and India. This applied to holders of ordinary passports, allowing them to enter Iran visa-free once every six months for a non-extendable stay of 15 days, exclusively for tourism purposes.",
  "summary": "",
  "published": "Mon, 17 Nov 2025 22:49:44 +0000",
  "url": "https://indianexpress.com/article/india/iran-cancels-visa-free-entry-for-indians-over-trafficking-cases-10371527/",
  "source": "India | The Indian Express"
}