{
  "title": "Texans defense, Davis Mills come up big in TNF win against Bills",
  "text": "Open Extended Reactions\n\nHOUSTON -- The Texans are squarely back in the playoff race after a massive 23-19 win against the Buffalo Bills on \"Thursday Night Football.\"\n\nThe Texans' defense displayed why it's the No. 1-ranked defense in prime time as it held the Bills' offense to 12 points. The defense came in allowing only 16.4 points per game and showed why it is arguably one of the best in recent seasons. The unit sacked Bills quarterback Josh Allen eight times, and when it mattered most, Houston's defense sealed the win with an interception by safety Calen Bullock.\n\nEven though the unit gave up a fourth-and-27 on a hook-and-lateral during the last drive to give Houston faithful a scare, it didn't end up costing the team. Now the Texans are over .500. They have a 37% chance to make the playoffs, per ESPN Analytics.\n\nHere are the most important things to know from Thursday night for both teams:\n\nThe Texans defense hurried Bills QB Josh Allen all night, sacking him eight times for 70 yards. Eric Christian Smith/AP Photo\n\nSurprising performance: Backup Davis Mills threw for two touchdowns and led the Texans offense to 23 points while outplaying the MVP on the other side. Houston's season looked shaky when it lost quarterback C.J. Stroud against the Denver Broncos to a concussion and the team sat at 3-5 overall. But Mills stepped in and operated the offense well enough to improve his record to 3-0.\n\nTurning point: It was when the Texans scored a touchdown before the end of the first half after Bills running back Ray Davis returned a 97-yard kickoff for a touchdown. Mills found wideout Jayden Higgins for a touchdown with five seconds left to provide a huge momentum swing, as it allowed Houston to take a 20-16 lead. With how well Houston's defense has played this season, getting 20 first-half points was all the team needed to win.\n\nTrend to watch: The Texans defense allowed the fewest points per game (16.3) coming into Week 12, but its sacks were middle of the pack with 25 (14th). But Houston sacked Allen eight times, a season high for the Texans. Now that Houston's defense is putting up sacks to tag along with its No. 1-ranked scoring output, we could be looking at one of the best defenses in recent seasons.\n\nStat to know: One reason Mills was able to play well was because he was protected. He was pressured on only 14% of his dropbacks and wasn't sacked at all. There were plays where he could scan the whole field before throwing to his targets. This was the best the Texans' offensive line has played all season when factoring in who they were playing in the Bills and the magnitude of this game for playoff positioning. -- DJ Bien-Aime\n\nNext game: at Indianapolis Colts (1 p.m. ET, Nov. 30)\n\nBills running back James Cook finished Thursday night's game at Houston with 116 yards on 17 carries and one touchdown. Alex Slitz/Getty Images\n\nThe Bills offense needed a drive. The unit had struggled throughout, but with 2:48 left in the game, the reigning MVP got the ball back at his own 18-yard line.\n\nThen, quarterback Josh Allen was sacked for the seventh and eighth time. But the magic came on fourth-and-27 as Allen threw the ball to wide receiver Joshua Palmer, who almost immediately pitched it to wide receiver Khalil Shakir, who then ran up the sideline and picked up a first down.\n\nUltimately, however, the magic ran out a few plays later.\n\nFor myriad reasons, from playcalling to the Texans' No. 1 defense, the Bills offense went most of the game without putting drives together. Allen did not have a touchdown for the ninth time in his career.\n\nAnd despite a valiant last effort, miscues, including a false start by left tackle Dion Dawkins on fourth-and-1, meant that lack of finish came up yet again as the Bills fell short of the end zone. Buffalo dropped to 7-4, yet another game back of the New England Patriots in the race for the AFC East.\n\nStat to know: James Cook III became the third Bills player with 1,000 rushing yards in three straight seasons with his 45-yard touchdown in the first quarter, joining O.J. Simpson and Thurman Thomas as the only Bills to do so. The score was also Cook's 36th career touchdown, breaking a tie with Joe Cribbs and Cookie Gilchrist for the second-most touchdowns for the Bills in a player's first four NFL seasons. (Thomas is first with 39.)\n\nWhat to make of the QB performance: The big story here is the sacks, all eight of them. The Texans were effective in doing so six of those times when sending four or fewer pass rushers, which is the most such sacks Allen has taken in his career. This struggling offense has been at its best when it stays in short-yardage situations, and the sacks -- the combined result of a lack of open receivers, decision-making by Allen, the offensive line having a rough day and a very good Texans defense -- made them few and far between.\n\nTrend to watch: Turnover margin. The Bills had an NFL-record streak of 26 straight games of not losing the turnover margin end in Week 5, and it has been trending downward since. In the six games since then, Buffalo has won the turnover margin twice. This game was a prime example of how turnovers have to be an issue for this team, including wide receiver Khalil Shakir's fumble at the Buffalo 22-yard line. And while yes, the offense is turning it over twice as much as last year (eight to 16), the defense has also struggled to take the ball away (32 takeaways last year to 13 through 11 games this season). -- Alaina Getzenberg\n\nNext game: at Pittsburgh Steelers (4:25 p.m. ET, Nov. 30)",
  "summary": "Houston sacks Buffalo QB Josh Allen eight times and improves its odds for the playoffs.",
  "published": "Fri, 21 Nov 2025 00:15:05 EST",
  "url": "https://www.espn.com/nfl/story/_/id/47042309/buffalo-bills-houston-texans-thursday-night-football-defense",
  "source": "www.espn.com - TOP"
}