{
  "title": "End review – Saskia Reeves and Clive Owen draw couples trilogy to a tender close",
  "text": "David Eldridge’s trilogy has travelled across the early and mid stages of coupledom to come to this finish. The play marks the end of an era in more ways than one. Programmed in Rufus Norris’s final season as the National Theatre’s director, it is also a farewell for the couple at its centre. This is grown up, bittersweet fare that brings with it a full-bodied reflection on the end that awaits us all: death.\n\nA natural order was branded into Eldridge’s previous two plays – Beginning was about the heady spark of a first romance, Middle the sag of an established relationship. This one grapples with a more unforeseen end. Alfie (Clive Owen) is a DJ in his 50s who made his name on the acid house scene. Julie (Saskia Reeves) is a successful novelist. His terminal cancer diagnosis is announced in the opening lines and the play becomes a reflection on what happens when a lifetime of togetherness meets mortality.\n\nLike the different couples in the previous plays, they are Essex-born but Alfie and Julie have long since moved out of Brentwood Park and into leafy north London (not far, it seems, from the Crouch End location of Beginning). “Where you’re from never leaves you,” Julie says nonetheless. It’s true in the case of Alfie. He wants to stop chemotherapy and be buried on Brentwood soil, close to his departed family. She wants him to continue treatment for the sake of the family around him, still living.\n\nView image in fullscreen Push-and-pull … Saskia Reeves and Clive Owen. Photograph: Marc Brenner\n\nIt plays out as a conversation in real time, as in the previous plays, in a kitchen over a pot of tea that is never drunk. They talk about their grownup daughter, the past, his diagnosis, with a push-and-pull between facing the inevitable and evading it.\n\nIt feels like his play rather than hers for some time. Julie listens on the sidelines as he speaks of preparing a playlist for his funeral service, controlling all he is able to. Tensions and complications within their relationship do kick in, with the hurt of old infidelity, and there are times when the play absolutely flies.\n\nBoth actors give searing performances, especially Owen, walking stiffly on crutches. You see the winces of physical pain in his movements and emotional pain across his face. Reeves looks formal in her smart belted dress (to his bare feet and sliders) and her role bears an inherent awkwardness, that of a witness to his fate. She gives a convincing performance as a woman trying to remain strong, desperate for him to put up a fight, but together it sometimes feels as if they are acting, albeit strongly, rather than becoming a convincing couple. There is not quite the comfortable ease of a couple who have spent decades around one another, but an air of formality, or distance, that melts at times but returns.\n\nPerhaps this is because of the difficult mix of material which shuttles from shyness to a convincingly static sex scene to accusations, kisses and quiet devastation. Rachel O’Riordan, directing this time (the previous two were staged by Polly Findlay), does a good job with a challenging script and gives the conversational mode of the play pace and movement but still allowing for pools of silence.\n\nAlfie speaks of the joy he sought to bring with his DJing and it is a justification for a life well lived, it seems. Snippets of music and occasional dance evoke an era and convey the pleasure and hedonism of the house scene. Certain sentences nail the everyday tragedy of our mortality. “I feel so young,” he says.\n\nSometimes the dialogue gives way to monologues on life and death that sit oddly against the domestic realism (the kitchen set, containing vinyl and an acid house smiley face clock, is designed by Gary McCann). Maybe the point is that profundity occurs in the everyday – death, love and sex discussed over a boiling kettle – but it is stiff all the same. The conversation around her desire to write about his death, and her love of writing, feels a little calculated. It is how she processes experience, she says, and it might be an oblique reference to the play (has she written it after his death?) but sounds as if the playwright is speaking through her.\n\nStill, all of it holds you. And despite the bleakness of its subject matter, there is tenderness, warmth and gallows humour. Love in the midst of death; death in the midst of love. A happy ending?",
  "summary": "<p><strong>Dorfman theatre, London</strong> <br />David Eldridge’s two-hander depicts the difficult conversations that follow one partner’s cancer diagnosis</p><p>David Eldridge’s trilogy has travelled across the early and mid stages of coupledom to come to this finish. The play marks the end of an era in more ways than one. Programmed in Rufus Norris’s final season as the National Theatre’s director, it is also a farewell for the couple at its centre. This is grown up, bittersweet fare that brings with it a full-bodied reflection on the end that awaits us all: death.</p><p>A natural order was branded into Eldridge’s previous two plays – <a href=\"https://www.theguardian.com/stage/2017/oct/13/beginning-review-national-theatre-dorfman-david-eldridge\">Beginning</a> was about the heady spark of a first romance, <a href=\"https://www.theguardian.com/stage/2022/may/05/middle-review-david-eldridge-theatre\">Middle</a> the sag of an established relationship. This one grapples with a more unforeseen end. Alfie (Clive Owen) is a DJ in his 50s who made his name on the acid house scene. Julie (Saskia Reeves) is a successful novelist. His terminal cancer diagnosis is announced in the opening lines and the play becomes a reflection on what happens when a lifetime of togetherness meets mortality.</p> <a href=\"https://www.theguardian.com/stage/2025/nov/21/end-review-clive-owen-saskia-reeves-dorfman-theatre-london\">Continue reading...</a>",
  "published": "Fri, 21 Nov 2025 06:00:02 GMT",
  "url": "https://www.theguardian.com/stage/2025/nov/21/end-review-clive-owen-saskia-reeves-dorfman-theatre-london",
  "source": "The Guardian"
}