{
  "title": "Astronomers unveil the surprising hidden geometry of a supernova",
  "text": "Swift observations with the European Southern Observatory's Very Large Telescope (ESO's VLT) have captured a star in the act of exploding, right as the blast pushed through its surface. This moment revealed the shape of the explosion during its earliest stage, a phase so brief that it would have disappeared from view within a day. Scientists have long hoped to observe this initial moment because it helps answer key questions about how massive stars end their lives as supernovae.\n\nSN 2024ggi was first noticed on the night of 10 April 2024 local time. At that moment, Yi Yang, an assistant professor at Tsinghua University in Beijing, China, and lead author of the study, had just arrived in San Francisco after a long flight. Realizing the urgency, he moved quickly. Twelve hours later, he submitted an observation request to ESO, which approved it soon after. By April 11, only 26 hours after the discovery, the VLT in Chile was already observing the event.\n\nA Rare Nearby Explosion\n\nThe supernova is located in the galaxy NGC 3621, in the direction of the constellation Hydra, approximately 22 million light-years away. For astronomers, this distance is close enough to investigate the blast in fine detail. Using the VLT and specialized instruments, the international team captured the early behavior of the explosion. \"The first VLT observations captured the phase during which matter accelerated by the explosion near the centre of the star shot through the star's surface. For a few hours, the geometry of the star and its explosion could be, and were, observed together,\" says Dietrich Baade, an ESO astronomer in Germany and co-author of the study, published on November 12 in Science Advances.\n\n\"The geometry of a supernova explosion provides fundamental information on stellar evolution and the physical processes leading to these cosmic fireworks,\" Yang explains. Scientists are still investigating the exact steps that trigger the explosions of massive stars, which are defined as stars more than eight times the mass of the Sun. SN 2024ggi began as a red supergiant with a mass between 12 and 15 times that of the Sun and a radius 500 times larger. This makes it a textbook example of a massive star approaching the end of its life.\n\nWhat Happens When a Massive Star Runs Out of Fuel\n\nThroughout its life, a star keeps a stable spherical shape because gravity pulls inward while pressure from nuclear fusion pushes outward. When the star exhausts its fuel, this balance collapses. The core gives way, the surrounding layers fall inward, and then bounce off the dense center. This rebound launches a shock wave that travels outward, ultimately tearing the star apart.\n\nOnce the shock reaches the surface, energy is released in enormous amounts and the supernova becomes visible. During the short window before the explosion interacts with surrounding material, astronomers can study the initial breakout shape.\n\nRevealing Hidden Geometry with Spectropolarimetry\n\nTo capture this early structure, astronomers used a technique called 'spectropolarimetry'. \"Spectropolarimetry delivers information about the geometry of the explosion that other types of observation cannot provide because the angular scales are too tiny,\" says Lifan Wang, co-author and professor at the Texas A&M University in the US, who began his career as a student at ESO. Although the exploding star appears as a single point of light, the polarization of that light contains subtle signals about the explosion's shape, which the team successfully decoded.[1]\n\nThe VLT's FORS2 instrument, the only facility in the southern hemisphere able to make this type of measurement, revealed that the first burst of material resembled the shape of an olive. As the blast expanded and encountered material surrounding the star, the shape grew flatter, although the axis of symmetry stayed consistent. Yang notes that \"these findings suggest a common physical mechanism that drives the explosion of many massive stars, which manifests a well-defined axial symmetry and acts on large scales.\"\n\nAdvancing Supernova Science Through Global Collaboration\n\nThese observations allow scientists to eliminate some existing models and refine others, improving our understanding of massive star deaths. \"This discovery not only reshapes our understanding of stellar explosions, but also demonstrates what can be achieved when science transcends borders,\" says co-author and ESO astronomer Ferdinando Patat. \"It's a powerful reminder that curiosity, collaboration, and swift action can unlock profound insights into the physics shaping our Universe.\"\n\nNotes\n\nLight particles (photons) have a property called polarization. In a sphere, the shape of most stars, the polarization of the individual photons cancels out so that the net polarization of the object is zero. When astronomers measure a non-zero net polarization, they can use that measurement to infer the shape of the object -- a star or a supernova -- emitting the observed light.\n\nThis research was presented in a paper published in Science Advances.\n\nThe team is composed of Y. Yang (Department of Physics, Tsinghua University, China [Tsinghua University]), X. Wen (School of Physics and Astronomy, Beijing Normal University, China [Beijing Normal University] and Tsinghua University), L. Wang (Department of Physics and Astronomy, Texas A&M University, USA [Texas A&M University] and George P. and Cynthia Woods Mitchell Institute for Fundamental Physics & Astronomy Texas A&M University, USA [IFPA Texas A&M University]), D. Baade (European Organisation for Astronomical Research in the Southern Hemisphere, Germany [ESO]), J. C. Wheeler (University of Texas at Austin, USA), A. V. Filippenko (Department of Astronomy, University of California, Berkeley, USA [UC Berkeley] and Hagler Institute for Advanced Study, Texas A&M University, USA), A. Gal-Yam (Department of Particle Physics and Astrophysics, Weizmann Institute of Science, Israel), J. Maund (Department of Physics, Royal Holloway, University of London, United Kingdom), S. Schulze (Center for Interdisciplinary Exploration and Research in Astrophysics, Northwestern University, USA), X. Wang (Tsinghua University), C. Ashall (Department of Physics, Virginia Tech, USA and Institute for Astronomy, University of Hawai'i at Manoa, USA), M. Bulla (Department of Physics and Earth Science, University of Ferrara, Italy and INFN, Sezione di Ferrara, Italy and INAF, Osservatorio Astronomico d'Abruzzo, Italy), A. Cikota (Gemini Observatory/NSF NOIRLab, Chile), H. Gao (Beijing Normal University and Institute for Frontier in Astronomy and Astrophysics, Beijing Normal University, China), P. Hoeflich (Department of Physics, Florida State University, USA), G. Li (Tsinghua University), D. Mishra (Texas A&M University and IFPA Texas A&M University), Ferdinando Patat (ESO), K. C. Patra (California and Department of Astronomy & Astrophysics, University of California, Santa Cruz, USA), S. S. Vasylyev (UC Berkeley), S. Yan (Tsinghua University).",
  "summary": "Astronomers have, for the first time, recorded the moment a star’s explosion broke through its surface. The nearby supernova, SN 2024ggi, revealed a surprisingly olive-shaped blast when studied with ESO’s Very Large Telescope. The discovery helps scientists better understand the forces that drive massive stars to explode and underscores how quick international cooperation can lead to groundbreaking results.",
  "published": "Sun, 16 Nov 2025 23:28:07 EST",
  "url": "https://www.sciencedaily.com/releases/2025/11/251116231854.htm",
  "source": "All Top News -- ScienceDaily"
}