{
  "title": "Whitmore No. 1 in WPBL draft; Davis No. 10",
  "text": "Open Extended Reactions\n\nPitcher and outfielder Kelsie Whitmore is returning to familiar surroundings after being selected by San Francisco with the first pick in the inaugural Women's Pro Baseball League draft Thursday night.\n\nMo'ne Davis, meanwhile, had to wait until the 10th pick before being selected by Los Angeles. The 24-year-old Davis, who is from Philadelphia, competed at the 2014 Little League World Series at age 13 and became the first girl to win a game and pitch a shutout.\n\nWhitmore is from San Diego and made her professional debut in the Bay Area with a coed team, the Sonoma Stompers, in 2016. The 27-year-old has won two silver medals representing the United States at the Women's Baseball World Cup and won gold at the 2015 Pan-Am Games in Toronto.\n\n\"You ask a 6-year-old version of me about this opportunity happening right now, she would, one, probably not believe you, but, two, just be so, so, so, so excited for it,\" said Whitmore, who in 2022 signed with the Staten Island FerryHawks, becoming the first woman to compete in pro baseball's Atlantic League. She played for the Savannah Bananas this season.\n\nKelsie Whitmore has won two silver medals representing the U.S. at the Women's Baseball World Cup and gold at the 2015 Pan-Am Games. She also was the first woman to compete in pro baseball's Atlantic League, with the Staten Island FerryHawks. AP Photo/Bebeto Matthews\n\nWhitmore was among 120 players selected in the six-round draft that also included teams representing New York and Boston.\n\nMajor League Baseball commissioner Rob Manfred opened the draft by congratulating the WPBL for its launch. The league is scheduled to begin play Aug. 1.\n\nEach team made five picks per round, with the order of selection determined by a random draw. Teams will cut their 30-player rosters to 15 for the start of the season.\n\nJapan's Ayami Sato went No. 2 to Los Angeles. The 35-year-old right-hander is a five-time World Cup winner and the only player to earn three tournament MVP honors.\n\nNew York selected U.S. infielder Kylee Lahners with the third pick. Boston chose South Korean catcher Hyeonah Kim at No. 4.\n\nThe startup league had a four-day tryout camp in Washington this summer with more than 600 hopefuls on hand.\n\nThe league is scheduled to play all of its games at Robin Roberts Stadium in Springville, Illinois. Teams will be based there over a seven-week season, split up into a four-week regular season, a week for all-star activities and a two-week playoff.\n\nThe WPBL was co-founded by Justine Siegal, who became the first woman to coach for an MLB team with the Oakland Athletics in 2015. It will be the first pro baseball league for women since the All-American Girls Professional Baseball League -- immortalized in the film \"A League of Their Own\" -- dissolved in 1954.",
  "summary": "Kelsie Whitmore was selected by San Francisco with the first pick in the inaugural Women's Pro Baseball League draft, while Mo'ne Davis went to Los Angeles at No. 10.",
  "published": "Thu, 20 Nov 2025 23:07:46 EST",
  "url": "https://www.espn.com/espn/story/_/id/47043509/kelsie-whitmore-goes-no-1-womens-pro-baseball-league-draft",
  "source": "www.espn.com - TOP"
}