{
  "title": "A struggling lumber industry wants to join farmers in government bailout package",
  "text": "A struggling lumber industry wants to join farmers in government bailout package\n\nThe U.S. hardwood lumber industry is struggling because of past tariffs and a recent export ban to China. Now the industry says, just like soybean farmers, they need help.\n\nAILSA CHANG, HOST:\n\nThe White House has promised a relief package for farmers affected by President Trump's tariff policies. The hardwood industry wants to be included in that plan. Rural sawmills say they're struggling because of Trump's trade policies. Kentucky Public Radio's Justin Hicks has this story.\n\nJUSTIN HICKS, BYLINE: GreenTree Forest Products is a family-owned sawmill in rural Wallingford, Kentucky. Logs are fed into saw blades by a maze of conveyor belts. They'll be cut over and over to make lumber which goes into some local staples like horse fences and bourbon barrels.\n\n(SOUNDBITE OF SAW WHIRRING)\n\nHICKS: It's pretty clear that Greg Wells, one of the co-owners, is proud of this giant, deafening machine.\n\nGREG WELLS: We average about 70,000 feet a day.\n\nHICKS: But each day at the sawmill is a delicate dance with supply and demand. Wells says you have to saw enough logs each day to keep the mill running and folks employed. But that's been difficult. In the past few years, they've gone down from two shifts a day to one.\n\nG WELLS: Loggers have gotten out of the business and, you know, we're just having to reach out further and further to get what we need to keep things going.\n\nHICKS: Before President Trump's first administration, trade data graphed by the American Hardwood Export Council shows China was buying more than a billion dollars of U.S. hardwood a year. Then, it levied as much as a 25% retaliatory tariff on U.S. hardwood. James Wells, Greg's brother and other co-owner, says that hurt a major export market for sawmills.\n\nJAMES WELLS: That tariff wiped out a lot of big what they call concentration yards, who is people who buy green lumber, dry it and prep it for export.\n\nHICKS: Wells says the hardwood industry never really recovered, even after China eased up on its tariffs. This year, trade war round two took off, and instead of responding with tariffs this time, China, in March, banned the import of American uncut logs. They claimed it was because of invasive bark and longhorn beetles, but Wells isn't convinced.\n\nJ WELLS: Well, they say it's due to pests, but nothing has changed. They were buying logs, and then all of a sudden they weren't because of pests. Well, what pest developed in a week? I don't know.\n\nHICKS: Earlier this month, China lifted its import ban on logs. At the same time, it started buying soybeans again. The Trump administration has promised billions of dollars in a relief package for soybean farmers, and the hardwood industry wants some of that aid too. The Kentucky Forest Industries Association signed on to an open letter to the federal government signed by companies in nearly 40 states. Here's executive director James Wright.\n\nJAMES WRIGHT: If and when there's a relief package that comes along, you know, we have to ensure to be a part of that. It's not a guarantee, obviously, but that's what - that's our hope.\n\nHICKS: Neither the U.S. Department of Agriculture nor the White House responded to emails requesting comment on the letter. Meanwhile, on the import side, Wright says Trump's recent tariffs on foreign-made wood products could be good for sawmills if it brings furniture factories back to the U.S. But that'll take time. At his sawmill, James Wells says some aid would help bridge that gap, but he says his industry is frequently forgotten.\n\nJ WELLS: I'll just be blunt. The hardwood lumber industry is supposed to be included in agriculture. We always get the shaft.\n\nHICKS: Wells says there's plenty of healthy forests out there ready to be logged, but with a shrinking workforce and a lot of economic uncertainty, it'll be a while before it's cut.\n\nFor NPR News, I'm Justin Hicks in Wallingford, Kentucky.\n\n(SOUNDBITE OF MUSIC)\n\nCopyright © 2025 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\n\nAccuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.",
  "summary": "The U.S. hardwood lumber industry is struggling because of past tariffs and a recent export ban to China. Now the industry says, just like soybean farmers, they need help.",
  "published": "Thu, 20 Nov 2025 15:59:09 -0500",
  "url": "https://www.npr.org/2025/11/20/nx-s1-5608999/a-struggling-lumber-industry-wants-to-join-farmers-in-government-bailout-package",
  "source": "NPR Topics: Business"
}