{
  "title": "In Alex Karp’s World, Palantir Is the Underdog",
  "text": "Recently, WIRED editor at large Steven Levy sat down for an interview with Palantir CEO Alex Karp. Karp defended his company’s contracts with clients like ICE and the Israeli government, which have increasingly gathered criticism. In this episode of Uncanny Valley, we dive into the most revealing parts of the interview and break down how Karp’s techno-state ideology has rippled across Silicon Valley.\n\nArticles mentioned in this episode:\n\nPlease help us improve Uncanny Valley by filling out our listener survey.\n\nYou can follow Michael Calore on Bluesky at @snackfight, Caroline Haskins on Bluesky at @carolinehaskins, and Steven Levy on Bluesky at @stevenlevy. Write to us at uncannyvalley@wired.com.\n\nHow to Listen\n\nYou can always listen to this week's podcast through the audio player on this page, but if you want to subscribe for free to get every episode, here's how:\n\nIf you're on an iPhone or iPad, open the app called Podcasts, or just tap this link. You can also download an app like Overcast or Pocket Casts and search for “uncanny valley.” We’re on Spotify too.\n\nTranscript\n\nNote: This is an automated transcript, which may contain errors.\n\nMichael Calore: Hey, Caroline, how are you doing?\n\nCaroline Haskins: Doing all right. Thanks. I'm filling in for Lauren today. I know she's on vacation. I do not know where, but hope she's having a nice time. How are you doing?\n\nMichael Calore: I'm doing well. Thanks. She's leaving on a plane right now. Hopefully, given the circumstances, her plane actually took off on time.\n\nCaroline Haskins: Yeah. I guess to be determined on how that goes.\n\nMichael Calore: Well, we also have a special guest with us today, WIRED's editor at large, Steven Levy. Hello, Steven.\n\nSteven Levy: Hi, Michael, and hello, Caroline. I'm delighted to be back on the show.\n\nMichael Calore: Yes. Thanks for joining us again. We have you on this week because you recently sat down with Palantir's CEO, Alex Karp, and we're excited to hear more about it on today's show. But if you had to summarize the vibe of the conversation that you had with him, how would you summarize it?",
  "summary": "In this episode of Uncanny Valley, we get to know Palantir CEO Alex Karp and dive into what his answers in a recent WIRED interview reveal about the larger beliefs driving the tech industry today.",
  "published": "Wed, 19 Nov 2025 16:51:13 +0000",
  "url": "https://www.wired.com/story/uncanny-valley-podcast-alex-karp-world-palantir-underdog/",
  "source": "WIRED"
}