{
  "title": "Bazball reaches its endgame; Eng's hopes hinge on raw pace to recreate Bodyline",
  "text": "During the 2019 Ashes Test at Lord's, the Jofra Archer bouncer struck Steve Smith. (Photo/Agencies)\n\nThe Cricketer\n\nTimesofIndia.com\n\nWisden Cricketers' Almanack\n\nTimesofIndia.com\n\nFast bowling barrage may break Ashes barrier for England\n\n\n\nTest Cricket: A History\n\nTimesofIndia.com\n\nBazball reaches its climax\n\n\n\nNEW DELHI: Former England captain Michael Vaughan feels the Ben Stokes-led side has all the tools to beat an ageing Australian team. England’s five-pacer attack will be their quickest ever to tour Australia. Captain Ben Stokes has shown, countless times, his ability to inspire his team to sublime heights.Historically, England's teams have made a habit of arriving with a defensive mentality. They dig in the moment they land and become even more entrenched with each passing day. England have managed a grand total of zero Test victories in 15 attempts since the triumphant 2010–11 series under Andrew Strauss.But under Brendon McCullum and Ben Stokes they won't be carrying the ghost of the past. However, it will be a litmus test for their playing style - the notoriously famous \"Bazball\".The Bazball approach -- an aggressive, result-oriented style of play adopted by England in Test cricket under McCullum-Stokes era -- has produced mixed outcomes. While England transitioned from a dismal 6% win rate (1 win, 11 loss, 5 draw) in the 17 Tests prior to the Bazball era, to an impressive 61% success rate overall in 42 matches since (25 win, 14 loss, 2 draw), they've not won a series against India or Australia during the period.England’s last Ashes win came at home in 2015. Their last series win in Australia was in 2010-11. Since then, England have toured Australia three times, played 15 Tests, won none, and lost 13. In the 2021-22 Ashes, they were beaten 4-0.As Ben Stokes' men set to compete for the urn once again Down Under, starting with the first Test in Perth from Friday, this could be the era-defining series for Bazball - which has been tweaked and subtly evolved from \"entertaining, reckless at times\" at its inception to now slightly matured \"reading moments\".\"We are continually being told that Bazball is being reined in, tweaked; but the proof will be in the pudding in this Ashes series, as is so often the case in English cricket,\" Huw Turbervill, the editor ofmagazine, said while talking toLawrence Booth, editor of, believes that Bazball is England's best chance to clinch the Ashes in Australia. Booth told, \"England tend not to win in Australia unless they take a chance, and Bazball is very much that chance. Yes, it can go wrong, but then what style of cricket guarantees victory?\"Among many other things, the key to winning a Test series in Australia is to have bowlers who possess raw pace and are genuinely quick off the wicket. Australia's hard, bouncy pitches favour the fast bowlers who hit the deck hard in comparison to fast-medium pacers.\"Since losing the Ashes 4-0 in 2021/22, the entire restructuring of the England Test team has been done with regaining the urn in mind. This hasn't just been about England scoring much faster; it's also been about bowling much faster too, with England consciously moving away from traditional English-style seamers in favour of those with more pace,\" Tim Wigmore, author of the book, toldEver since the Bodyline series in 1932/33, when captain Douglas Jardine unleashed his hostile fast-bowling attack of Harold Larwood and Bill Voce to counter Don Bradman's batting, England have won five Ashes series on Australian soil and one thing which has been common in all those victories was presence of genuine quicks in the English camp.In 1932/33, England won the series 4-1. In 1954-55, Len Hutton’s side won 3-1, driven by Frank \"Typhoon\" Tyson, who took 28 wickets at 20.82 in the series. His pace unsettled Australian batters on home pitches, with Brian Statham’s outswing acting as support. Tyson’s speed forced even established names like Neil Harvey into defensive play.In 1970-71, Ray Illingworth led England to a 2-0 win. John Snow, tall and bowling fast at around 90mph, claimed 31 wickets. Bob Willis, making his debut, added more fire power. Mike Brearley’s team's 5-1 success in 1978-79 followed the same pattern, built on Willis’ bounce and speed (20 wickets) and Ian Botham’s all-round performance, which included 23 wickets.England’s 2-1 victory in 1986-87 under Mike Gatting was powered by Graham Dilley’s 16 wickets, Botham’s nine, and Gladstone Small’s 12.England’s most recent triumph, the 3-1 win under Andrew Strauss in 2010-11, relied on James Anderson’s 24 wickets through late swing, who was bowling at around 140+ kmph at that time, and he was backed by the speed of Steven Finn, Tim Bresnan, and Chris Tremlett. In all these Ashes victories in Australia, England's wins have consistently revolved around fast bowling.England's pace bowling attacks on recent tours have been short of raw speed, but as England march on Friday again, in quest to regain the Ashes and win the series on Australian soil after 15 years, they now have in their armoury the most lethal fast bowling lineup in decades. Not since a bowling line-up led by John Snow and Bob Willis, which helped England win the 1970-71 series, have the Three Lions arrived in Australia with such an array of genuine quicks.Mark Wood and Jofra Archer regularly touch 90 mph speed and are capable of demolishing the best batting lineups in the world, and they are accompanied by Josh Tongue, Gus Atkinson, Brydon Carse and Matthew Potts, to launch thunderbolts at Aussie batters.Over the last three years, England have changed how they bat in Tests, overhauled their fast-bowling and assembled an attack built for the demands of Australian pitches, and now they come to Australia for the natural climax of the McCullum-Stokes’ Bazball era.Turbervill told TimesofIndia.com that a lot rests on the first Test at Perth starting on Friday, \"against that depleted Australian attack.\" Depleted because Pat Cummins and Josh Hazlewood are out of the first Test in Perth due to injuries. \"England win, and they are away, their approach endorsed, the hosts on the back foot. Lose, and the talk will turn to yet another Ashes annihilation in Australia, like in 2013/14,\" Turbervill said, adding, \"Maybe Brendan Doggett will shine on his unexpected debut, and Scott Boland will roll back the years at 36. Before the action begins, however, it seems fair to say that England look as if they have a real chance of winning three Tests in an Ashes series like they did at home in 2013 and 2015.\"Wigmore said that if England regain the Ashes, it would be \"ultimate vindication\" for Bazball. \"England have lost 13-0 across the last three Ashes tours; to regain the urn in Australia would be a stunning achievement and seen as ultimate vindication for the Bazball project.\"Echoing Wigmore, Booth also called this series a \"defining moment for the Bazball project.\" \"Australia have also seen that Bazball can go right: in 2023, England came from 2-0 down to square the Ashes, and might have won 3-2 had it not rained in Manchester. Having said all that, it's clear that this series represents the defining moment for Bazball. If England lose, critics will say it has failed, because they will have had four series against India and Australia, and won none. If they win, it will vindicate everything Ben Stokes and Brendon McCullum have tried to do over the last three and a half years. But it's a big if.\"If England's pace attack fires on all cylinders, and Joe Root ends his Australia jinx with others bat around him and manage to neutralise the Aussie attack, they could very well end their Ashes drought, and Ben Stokes would board the plane back to England in January as among the \"lucky few captains who have come here and been successful.\"But it is the hope that kills the English fans, because an Ashes win in Australia holds an exotic appeal that never wears off.",
  "summary": "England enter the Ashes with their quickest pace attack in decades and a matured Bazball philosophy, aiming to end a 15-year drought in Australia. With Mark Wood, Jofra Archer and a battery of genuine quicks, Ben Stokes’ side arrives believing speed can break the long-standing barrier. For Bazball, this is the defining series: victory brings vindication, defeat invites its fiercest scrutiny yet.",
  "published": "Thu, 20 Nov 2025 19:15:33 +0530",
  "url": "https://timesofindia.indiatimes.com/sports/cricket/ashes/ashes-bazball-reaches-its-endgame-down-under-englands-hopes-hinge-on-raw-pace-to-recreate-bodyline/articleshow/125463840.cms",
  "source": "Times of India"
}