{
  "title": "Slovenia with soul: food and culture from the city to the hills",
  "text": "It is said that soul is the true spice of any dish – and Slovenian cuisine has soul writ large. This is, in part, down to the vast array of locally produced and sourced ingredients, from trout caught in the crystal, alpine waters of the Soča River, to goat’s cheese, farmed on the misty Polhov Gradec hills. This produce, created in harmony with nature, can be found in the recipes on the tables of some of the country’s best and most authentic restaurants.\n\nOne of these is Grič, located in a remote spot in the village of Šentjošt, about 40 minutes’ drive from the capital Ljubljana. There, chef Luka Košir creates dishes which are at turns wildly experimental and infused with the culinary knowhow of Japan and Scandinavia, but are wholly rooted in traditional local ingredients, and a sense of place.\n\nView image in fullscreen At Grič, chef Luka Košir’s dishes are created from traditional local ingredients\n\n“Being here is an advantage for me,” says Košir, whose restaurant has been recognised with both a Michelin star and Michelin Green star. “I feel good here, I literally live off the locals, the fields, I’m self-sufficient, work with people I trust … You don’t have to fake anything and make up stories to sell yourself well,” he continues. “This is no romance. Our life here is that simple.”\n\nMichelin-recognised restaurants in Slovenia are decidedly unstuffy places. Even those that have undergone seismic change and transformed from a very local bar and eatery with excellent food to a celebrated restaurant – the chances are you’ll still find them frequented by some of the locals on whom their success was founded.\n\nView image in fullscreen Gostilna Repovž has been awarded a Michelin Green Star for its use of ingredients grown on its own organic farm\n\nThe Repovž family, and their restaurant Gostilna Repovž, embody this thinking. Based in a traditional inn in the village of Šentjanž, about 75 minutes’ drive east of the capital, they have been awarded a Michelin Green Star in recognition of their commitment to sustainable gastronomy. The family transitioned to organic farming in their vegetable garden and orchard about 20 years ago. Today, many of the vegetables, herbs and fruit served in the restaurant are from their own land. “With our tasting menu,” says chef Sabina Repovž, “we try to introduce our guests to the [local] regions of Posavje and Dolenjska and, last but not least, to our farm.”\n\nView image in fullscreen Slovenia’s beekeepers produce exceptional honey\n\nIt’s impossible to think of local ingredients in Slovenia without mentioning honey. Slovenia has a rich history of beekeeping – Anton Janša, who was born in 1734 in the village of Breznica, in what is now northern Slovenia, is seen as a pioneer of modern beekeeping. He had a passion for bees from a young age and went on to teach apiculture at the Habsburg court in Vienna. His book, A Complete Guide to Beekeeping, is seen as one of the most influential on beekeeping of all time and his birthday, 20 May, is world bee day.\n\nView image in fullscreen Ljubljana, Slovenia’s capital and cultural heart\n\nToday Slovenia is said to have more beekeepers per capita than any other country in Europe – there are more than 4,500 beehives just in and around Ljubljana – and the honey from pristine forests and mountains with flower-filled meadows is exceptionally good. The best place to learn about the history of beekeeping in Slovenia is the Museum of Apiculture in the medieval town of Radovljica, north-west of Ljubljana – where you can also discover the painted beehive panels that are a very distinctive part of Slovenian folk art, some of them dating back to the mid 1700s.\n\nView image in fullscreen Cukrarna, a contemporary art gallery housed in a former sugar refinery\n\nLjubljana is Slovenia’s endlessly vibrant and beating, cultural heart – and with some exceptions, many of Slovenia’s major museums and art galleries are found here. Some are landmark state institutions with priceless art, archaeological or ethnographic collections, which preserve the DNA of an entire nation.\n\nThe National Museum of Slovenia is one of these – the oldest museum in Slovenia, founded more than 200 years ago, with treasures including a 60,000-year-old Neanderthal flute, the earliest known musical instrument in the world. Other museums are housed in restored industrial complexes – such as Cukrarna, a contemporary art gallery in a former sugar refinery. There’s also a plethora of smaller galleries that should not be missed, among them the Jakopič Gallery, Slovenia’s foremost photography gallery, and Škuc, a landmark centre for contemporary art. Šiška is one of Ljubljana’s most vibrant districts for contemporary culture, with about 30 galleries, exhibition spaces and ateliers within a 300 metre radius, and some of the city’s best street art.\n\nView image in fullscreen Kris Guštin, guitarist and cultural ambassador for Slovenia\n\nKris Guštin, guitarist with the Slovenian rock band Joker Out, is a cultural ambassador for Slovenia along with his fellow band members. One of his favourite Ljubljana galleries is Vžigalica – a name that is translated as the Match Gallery – a space for fiery new ideas. “I visit it most often during the Lighting Guerrilla festival [where artists display their works using light as a medium]. Every year I stroll around the city and discover hidden light installations,” he says. Another of his top galleries is DobraVaga, near the Central Market, which he loves as it’s a space where young, contemporary artists exhibit.\n\nView image in fullscreen View image in fullscreen Venture out of Ljubljana to visit towns such as Piran (top) and Radovljica (bottom right) or its green hills and valleys\n\nBeyond its capital, Slovenia has a whole raft of small and memorably beautiful historical towns: Škofja Loka, just over 12 miles west of Ljubljana and perched above the confluence of two tributaries of the Sora River and set below an imposing castle; Radovljica, near Bled, with its elongated town square surrounded by well-preserved houses from the 16th and 17th centuries, overlooking the broad valley of the Sava River; Kostanjevica na Krki, set on a small island enclosed within a great looping bend in the Krka River, and accessed by bridges; and Piran, the jewel of Slovenia’s Adriatic coast, its old town a wedge of narrow cobbled alleys juxtaposed with a soaring “Venetian bell tower” modelled on that of St Mark’s in Venice. Each place has its own character, all are imbued with stacks of charm – and a deep sense of soul.\n\nWhat will be your way of feeling Slovenia?",
  "summary": "<p>From Michelin Green Stars to a beekeeping museum – via a 60,000-year-old flute – Slovenia gives visitors the authentic, lesser-travelled experience</p><p>It is said that soul is the true spice of any dish – and Slovenian cuisine has soul writ large. This is, in part, down to the vast array of locally produced and sourced ingredients, from trout caught in the crystal, alpine waters of the Soča River, to goat’s cheese, farmed on the misty Polhov Gradec hills. This produce, created in harmony with nature, can be found in the recipes on the tables of some of the country’s best and most authentic restaurants.</p><p>One of these is <a href=\"https://www.tasteslovenia.si/en/unique-stories/culinary-magic-deep-in-the-forests-of-horjul/\" rel=\"nofollow\">Grič</a>, located in a remote spot in the village of Šentjošt, about 40 minutes’ drive from the capital Ljubljana. There, chef Luka Košir creates dishes which are at turns wildly experimental and infused with the culinary knowhow of Japan and Scandinavia, but are wholly rooted in traditional local ingredients, and a sense of place.</p><p>At Grič, chef Luka Košir’s dishes are created from traditional local ingredients</p> <a href=\"https://www.theguardian.com/slovenia-your-way/2025/oct/10/slovenia-travel-guide-food-culture-city-and-hills\">Continue reading...</a>",
  "published": "Fri, 10 Oct 2025 14:26:29 GMT",
  "url": "https://www.theguardian.com/slovenia-your-way/2025/oct/10/slovenia-travel-guide-food-culture-city-and-hills",
  "source": "The Guardian"
}