{
  "title": "Jessie Diggins, trailblazing star of cross-country skiing, to retire at end of season",
  "text": "Jessie Diggins, the most decorated American cross-country skier of all time, has revealed that she will retire at the end of the season, calling time on a 15-year career that redefined what US athletes could achieve in a sport long dominated by European nations.\n\nDiggins will race the full World Cup calendar and compete in her fourth Olympics at Milano-Cortina before finishing her career on home snow at the World Cup finals in Lake Placid. She announces her departure as the world’s No 1-ranked skier, the owner of three overall World Cup titles and three distance globes, and a four-time Olympic medalist – including the famous 2018 team sprint gold she won with Kikkan Randall that marked the first Olympic title in US cross-country skiing history.\n\n“It’s time to open the next chapter of my life and it’s going to be filled with so many things,” she said Thursday in a Zoom call from Finland, where she is preparing for the season opener. “I’ve been working very, very hard for a very long time and I love what I do and I love this team … but it’s time to open the next chapter of my life.”\n\nThe 34-year-old from the tiny St Paul suburb of Afton (population: 2,951) said she is looking forward to spending more time at home after years of living on the road for seven months a year. “The hard work I don’t mind, although it can be really hard on your body,” she said. “But really, it’s the travel … it makes it quite hard to have anything close to a normal life. The time has come for me to get really excited about having a normal life.”\n\nShe also revealed an ultra-endurance goal: running a 100-mile race. “It’s ironic to be like, yeah, I’m going to be done cross-country ski racing so I can go run a hundred miles on trails,” she said with a laugh. “But it really lights up my soul.”\n\nSince debuting on the World Cup circuit as a teenager, Diggins has amassed 79 podiums and 29 victories. She’s also won three overall crystal globes, cross-country skiing’s biggest prize, something no woman from outside Europe had won even once until Diggins in 2021. Her trademark glitter-streaked cheeks and relentlessly upbeat demeanor helped turn her into one of winter sport’s most visible personalities, while her ability to plunge deep into what she calls the “pain cave” made her one of its fiercest competitors. She credits her Minnesota upbringing for instilling that fighting spirit. “Minnesota raises people really tough – tough but with kindness,” she said. “It was like, ‘Nope, it’s super cold out, no problem, just put an extra jacket on.’”\n\nBut Diggins’ legacy extends far beyond medals. Her openness about her long recovery from an eating disorder, and her push to improve athlete mental-health support, have made her one of the most influential advocates in the US Olympic movement. “One of the legacy pieces that I’m leaving behind is how US Ski & Snowboard handles mental health and how they support people,” she said. “When someone says, ‘Hey, I’m struggling with an eating disorder,’ there is so much help available, because I was so open and shared everything along the way.”\n\nDiggins said Thursday the decision to retire emerged gradually rather than through a single dramatic moment. “It wasn’t an a-ha moment,” she said. “Over time, all of these other things in my life that are important to me started to out-value just ski racing.”\n\nThe chance to devote more time to her husband, Wade, played a major role. “When you’re 20 years old and you’re not dating anyone, being on the World Cup is great,” she said. “But then over time you’re like, oh my gosh, this gets harder and harder, and all these other things started to out-value just ski racing.”\n\nShe admitted she hesitated to go public earlier this autumn, especially after an FIS official prematurely leaked her plans. “I didn’t want to share it until I was ready to have everybody in on it with me,” she said. “Now I am.”\n\nWith the retirement news now public, Diggins said she will approach Milano-Cortina differently than her previous Olympics. “Telling people, yeah, this is my last Games, it frees me to enjoy it,” she said. “Even if it doesn’t go perfectly, my career is this entire body of work. I just want to be present and enjoy every single day and every single race.”\n\nView image in fullscreen Jessie Diggins leads a pack during the women’s 20km mass start free at the World Cup event in February at Falun, Sweden. Photograph: Fredrik Sandberg/TT NEWS AGENCY/AFP/Getty Images\n\nShe expects around 60 friends and family to attend, a stark contrast to the isolation of the Covid-compromised Beijing Games. “I want to be able to share it with them,” she said.\n\nHer goal for the season, she said, is simple: to savor it. “I get to say thank you every time I leave a race venue. It’s the last time you’re going to take my skis after a race and take my bib. That’s really special.”\n\nShe still plans to race a full schedule, including the Tour de Ski, the seven-stage, nine-day series of races modeled after the Tour de France that straddles the New Year. “My body seems to enjoy racing quite a lot,” she said. “So basically doing as many as I can because it’s my last time. And why not?”\n\nBefore signing off, Diggins reflected on what she hopes young athletes will take from her career. “Do the thing that you love and share it with as many people as possible,” she said. “And it’s OK to be super vulnerable. The amount of people that then become part of your story and part of your life, it’s incredible.”",
  "summary": "<ul><li><p>US cross-country star announces retirement</p></li><li><p>World’s No 1 ranked skier will compete in Olympics</p></li><li><p>Will finish career in World Cup finals on home snow</p></li></ul><p>Jessie Diggins, the most decorated American cross-country skier of all time, has revealed that she will retire at the end of the season, calling time on a 15-year career that redefined what US athletes could achieve in a sport long dominated by European nations.</p><p>Diggins will race the full World Cup calendar and compete in her fourth Olympics at Milano-Cortina before finishing her career on home snow at the World Cup finals in Lake Placid. She <a href=\"https://www.instagram.com/p/DRPMK2mgsMl\">announces her departure</a> as the world’s No 1-ranked skier, the owner of three overall World Cup titles and three distance globes, and a four-time Olympic medalist – including the <a href=\"https://www.theguardian.com/sport/2018/feb/21/usa-cross-country-gold-jessie-diggins-kikkan-randall\">famous 2018 team sprint gold</a> she won with Kikkan Randall that marked the first Olympic title in US cross-country skiing history.</p> <a href=\"https://www.theguardian.com/sport/2025/nov/20/jessie-diggins-retirement-us-cross-country-skiing\">Continue reading...</a>",
  "published": "Thu, 20 Nov 2025 20:58:14 GMT",
  "url": "https://www.theguardian.com/sport/2025/nov/20/jessie-diggins-retirement-us-cross-country-skiing",
  "source": "The Guardian"
}