{
  "title": "HP and Dell disable HEVC support built into their laptops’ CPUs",
  "text": "Some Dell and HP laptop owners have been befuddled by their machines’ inability to play HEVC/H.265 content in web browsers, despite their machines’ processors having integrated decoding support.\n\nLaptops with sixth-generation Intel Core and later processors have built-in hardware support for HEVC decoding and encoding. AMD has made laptop chips supporting the codec since 2015. However, both Dell and HP have disabled this feature on some of their popular business notebooks.\n\nHP discloses this in the data sheets for its affected laptops, which include the HP ProBook 460 G11 [PDF], ProBook 465 G11 [PDF], and EliteBook 665 G11 [PDF].\n\n“Hardware acceleration for CODEC H.265/HEVC (High Efficiency Video Coding) is disabled on this platform,” the note reads.\n\nDespite this notice, it can still be jarring to see a modern laptop’s web browser eternally load videos that play easily in media players. As a member of a group for system administrators on Reddit recalled recently:\n\nPeople with older hardware were not experiencing problems, whereas those with newer machines needed to either have the HEVC codec from the Microsoft Store removed entirely from [Microsoft Media Foundation] or have hardware acceleration disabled in their web browser/web app, which causes a number of other problems / feature [degradations]. For example, no background blurring in conference programs, significantly degraded system performance …\n\nOwners of some Dell laptops are also experiencing this, as the OEM has also disabled HEVC hardware decoding in some of its laptops. This information, however, isn’t that easy to find. For example, the product page for the Dell 16 Plus 2-in-1, which has HEVC hardware decoding disabled, makes no mention of HEVC. There’s also no mention of HEVC in the “Notes, cautions, and warnings” or specifications sections of the laptop’s online owner’s manual. The most easily identifiable information comes from a general support page that explains that Dell laptops only support HEVC content streaming on computer configurations with:",
  "summary": "HEVC licensing gets more expensive in January.",
  "published": "Thu, 20 Nov 2025 23:02:01 +0000",
  "url": "https://arstechnica.com/gadgets/2025/11/hp-and-dell-disable-hevc-support-built-into-their-laptops-cpus/",
  "source": "Ars Technica - All content"
}