{
  "title": "Supercomputers decode the strange behavior of Enceladus’s plumes",
  "text": "In the 17th century, astronomers Christiaan Huygens and Giovanni Cassini pointed some of the earliest telescopes at Saturn and made a surprising discovery. The bright structures around the planet were not solid extensions of the world itself, but separate rings formed from many thin, nested arcs.\n\nCenturies later, NASA's Cassini-Huygens (Cassini) mission carried that exploration into the space age. Starting in 2005, the spacecraft returned a flood of detailed images that reshaped scientists' view of Saturn and its moons. One of the most dramatic findings came from Enceladus, a small icy moon where towering geysers shot material into space, creating a faint sub-ring around Saturn made of the ejected debris.\n\nNew computer simulations run at the Texas Advanced Computing Center (TACC), using data collected by Cassini, now provide refined estimates of how much ice Enceladus is losing to space. The updated numbers are important for understanding the moon's internal activity and for planning future robotic missions that may explore its buried ocean, which could potentially support life.\n\n\"The mass flow rates from Enceladus are between 20 to 40 percent lower than what you find in the scientific literature,\" said Arnaud Mahieux, a senior researcher at the Royal Belgian Institute for Space Aeronomy and an affiliate of the UT Austin Department of Aerospace Engineering & Engineering Mechanics.\n\nSupercomputers and DSMC Models Reveal Plume Physics\n\nMahieux is the corresponding author of a computational study of Enceladus published August 2025 in the Journal of Geophysical Research: Planets. In this work, he and his collaborators used Direct Simulation Monte Carlo (DSMC) models to better describe how enormous plumes of water vapor and icy grains behave after erupting from cracks and vents at the surface of Enceladus.\n\nThe project builds on earlier research led by Mahieux and published in 2019. That previous study was the first to use DSMC techniques to pin down the starting conditions for the plumes, including the size of the vents, the ratio of water vapor to solid ice grains, the temperature of the material, and the speed at which it escapes into space.\n\n\"DSMC simulations are very expensive,\" Mahieux said. \"We used TACC supercomputers back in 2015 to obtain the parameterizations to reduce computation time from 48 hours then to just a few milliseconds now.\"\n\nUsing these mathematical parameterizations, the team calculated key properties of Enceladus's cryovolcanic plumes, such as how dense they are and how fast the gas and particles move. They based their calculations on Cassini measurements collected while the spacecraft flew directly through the jets.\n\n\"The main finding of our new study is that for 100 cryovolcanic sources, we could constrain the mass flow rates and other parameters that were not derived before, such as the temperature at which the material was exiting. This is a big step forward in understanding what's happening on Enceladus,\" Mahieux said.\n\nA Tiny Moon With Powerful Cryovolcanic Jets\n\nEnceladus is a relatively small moon, only about 313 miles wide, and its weak gravity is not strong enough to keep the erupting jets from escaping into space. The new DSMC models are designed to represent this low-gravity environment accurately. Earlier models did not capture the physics and gas dynamics in as much detail as the current DSMC approach.\n\nMahieux compares the phenomenon to a volcanic eruption. What Enceladus does is akin to a volcano hurling lava into space -- except the ejecta are plumes of water vapor and ice.\n\nThe simulations track how gas in the plumes behaves on very small scales, where individual particles move, collide, and transfer energy in a way similar to marbles bouncing into one another. The models follow several millions of molecules in time steps measured in microseconds. Because of the DSMC method, scientists can now simulate conditions at lower, more realistic pressures and allow for longer distances between collisions than previous models could handle.\n\nThe Planet Code and the Power of TACC Supercomputers\n\nDavid Goldstein, a professor at UT Austin and co-author of the study, led the development in 2011 of the DSMC code known as Planet. TACC granted Goldstein computing time on its Lonestar6 and Stampede3 supercomputers through The University of Texas Research cyberinfrastructure portal, which provides resources to researchers across all 14 UT system institutions.\n\n\"TACC systems have a wonderful architecture that offer a lot of flexibility,\" Mahieux said. \"If we're using the DSMC code on just a laptop, we could only simulate tiny domains. Thanks to TACC, we can simulate from the surface of Enceladus up to 10 kilometers of altitude, where the plumes expand into space.\"\n\nEnceladus and the Family of Icy Ocean Worlds\n\nSaturn orbits beyond what astronomers call the \"snow line\" in the solar system, along with other giant planets that host icy moons, including Jupiter, Uranus, and Neptune.\n\n\"There is an ocean of liquid water under these 'big balls of ice,'\" Mahieux said. \"These are many other worlds, besides the Earth, which have a liquid ocean. The plumes at Enceladus open a window to the underground conditions.\"\n\nBecause the plumes carry material from deep below the surface into space, they offer a rare natural sample of the hidden ocean, without the need to drill through miles of ice.\n\nFuture Missions and the Search for Life\n\nNASA and the European Space Agency are planning new missions that would return to Enceladus with far more ambitious goals than simple flybys. Some proposals envision landing spacecraft on the surface and drilling through the crust to reach the ocean beneath, in order to look for chemical signs of life that might be preserved there.\n\nIn the meantime, measuring what is inside the plumes and how much material they carry gives scientists a powerful indirect way to study the subsurface environment. By analyzing the jets, researchers can infer conditions in the ocean without having to physically bore through the ice shell.\n\n\"Supercomputers can give us answers to questions we couldn't dream of asking even 10 or 15 years ago,\" Mahieux said. \"We can now get much closer to simulating what nature is doing.\"",
  "summary": "Cutting-edge simulations show that Enceladus’ plumes are losing 20–40% less mass than earlier estimates suggested. The new models provide sharper insights into subsurface conditions that future landers may one day probe directly.",
  "published": "Tue, 18 Nov 2025 07:59:29 EST",
  "url": "https://www.sciencedaily.com/releases/2025/11/251117095650.htm",
  "source": "All Top News -- ScienceDaily"
}