{
  "title": "Let’s put an end to demolition and blast policy: BJP leader in Valley after Umar Nabi’s house razed",
  "text": "Four days after the home of Red Fort “bomber” Umar Nabi was demolished, a BJP leader in the Valley has said “demolitions or blasts are not the solution”.\n\n“Let us put an end to this demolition and blast policy and instead adopt stricter, more effective measures to deal with terrorism,” BJP leader Arshad Ahmad Bhat said in a social media post.\n\nA resident of Pulwama, Bhat was the BJP’s candidate from the Rajpora constituency in last year’s Assembly elections; he lost the polls.\n\nDuring his election campaign, Bhat had taken a different stand compared to other BJP leaders and candidates, talking about zulm (oppression), the Public Safety Act, and the Unlawful Activities (Prevention) Act. In his rallies, slogans had echoed those from separatist rallies.\n\nUmar was employed as an assistant professor in the general medicine department of Al Falah University in Faridabad. (File) Umar was employed as an assistant professor in the general medicine department of Al Falah University in Faridabad. (File)\n\nBhat said a family should not be stigmatised for the actions of one family member. “A father of a terrorist cannot be called a terrorist or weighed on the same scale as his militant son,” he said. “The same applies to other family members, they cannot automatically be held responsible.”\n\nSaying that “terrorism or a terrorist should be dealt with through stringent legal action,” Bhat added that Kashmiris live in a complex situation.\n\n“We Kashmiris live in a complex situation. Even the grave of NC’s tallest leader, Sheikh Mohammad Abdullah, is guarded by security personnel and… (so is) the grave of the late Mufti Mohammad Sayeed,” he said. “We are living life on a double-edged sword. No mother or father ever wishes to see their child die early.”\n\nStory continues below this ad\n\nOn November 14, Umar’s home in his hometown of Koil in Pulwama district was razed. Most of his family, including his parents, brother and sister-in-law, lived in the two-storey house that had a small yard in front. Officials in Pulwama had earlier said that the house was blown up overnight after moving the residents out.\n\nThe action came days after Umar, a doctor at Faridabad’s Al Falah University, allegedly drove the car that exploded outside the Red Fort Metro station in Delhi on November 10, killing 12 people. Officials had said DNA samples taken from Umar’s mother confirmed it was him behind the wheel of the car.\n\nBhat also said the doctor fraternity should not be stigmatised for the actions of a few. “Our doctors are serving this country to the best of their capacity, whether in Kashmir or outside,” he said. “Branding or generalising the whole fraternity is unfair.”",
  "summary": "",
  "published": "Wed, 19 Nov 2025 09:06:27 +0000",
  "url": "https://indianexpress.com/article/india/end-demolition-blast-policy-bjp-leader-in-valley-umar-nabis-house-razed-10374197/",
  "source": "India | The Indian Express"
}