{
  "title": "Astronomers spot a rare planet-stripping eruption on a nearby star",
  "text": "Astronomers working with the European Space Agency's XMM-Newton observatory and the LOFAR radio telescope have obtained clear evidence of a violent burst of material hurled into space by a distant star. The outflow was strong enough that any nearby planet in its path would likely have its atmosphere stripped away.\n\nThis burst was identified as a coronal mass ejection (CME), a type of eruption frequently produced by the Sun. During a CME, enormous quantities of charged particles and plasma are pushed outward from the star, filling the surrounding space. These dramatic outbursts drive what we call space weather, influence events such as auroras on Earth, and can gradually erode the atmospheres of neighboring planets.\n\nScientists had long suspected that other stars generate their own CMEs, yet convincing proof had remained elusive. That gap has now been filled.\n\n\"Astronomers have wanted to spot a CME on another star for decades,\" says Joe Callingham of the Netherlands Institute for Radio Astronomy (ASTRON), author of the new research published in Nature. \"Previous findings have inferred that they exist, or hinted at their presence, but haven't actually confirmed that material has definitively escaped out into space. We've now managed to do this for the first time.\"\n\nA Rare Radio Signal Marks Material Escaping the Star\n\nAs a CME pushes outward through the outer layers of a star and into the surrounding region, it generates a shock wave along with a sudden burst of radio waves (a form of light). Joe and his colleagues detected this brief, intense radio signal and traced it to a star located around 130 light-years away.\n\n\"This kind of radio signal just wouldn't exist unless material had completely left the star's bubble of powerful magnetism,\" adds Joe. \"In other words: it's caused by a CME.\"\n\nA Hyperactive Red Dwarf With Planet-Scorching Power\n\nThe star producing the eruption is a red dwarf, which is a much cooler, dimmer, and smaller type of star than the Sun. It differs from our Sun in several key ways: it has about half the Sun's mass, it rotates 20 times faster, and its magnetic field is an estimated 300 times stronger. Most planets discovered in the Milky Way orbit stars of this type.\n\nThe radio signal was detected with the Low Frequency Array (LOFAR) thanks to new data-processing techniques developed by co-authors Cyril Tasse and Philippe Zarka at the Observatoire de Paris-PSL. The team then relied on ESA's XMM-Newton to measure the star's temperature, rotation, and X-ray brightness. These details were necessary to interpret the radio burst and determine the nature of the eruption.\n\n\"We needed the sensitivity and frequency of LOFAR to detect the radio waves,\" says co-author David Konijn, a PhD student working with Joe at ASTRON. \"And without XMM-Newton, we wouldn't have been able to determine the CME's motion or put it in a solar context, both crucial for proving what we'd found. Neither telescope alone would have been enough -- we needed both.\"\n\nTheir measurements revealed that the CME was traveling at roughly 2400 km per second. CMEs that fast occur in only about 1 out of every 2000 events on the Sun. The burst was also dense and energetic enough that any planet orbiting close to this star could have its atmosphere entirely stripped away.\n\nImplications for Life Around Red Dwarfs\n\nThe ability of such a CME to remove atmospheres is an important factor in the search for life beyond the Solar System. A planet's habitability is often tied to whether it falls within its star's 'habitable zone', where liquid water can persist on the surface of a planet with the right atmospheric conditions. The concept is similar to the Goldilocks idea: too close is too hot, too far is too cold, and the middle region is potentially just right.\n\nHowever, a star that frequently unleashes strong eruptions and extreme space weather may rob even a well-positioned planet of its atmosphere. A world exposed to repeated high-energy CMEs could be reduced to bare rock, even if it orbits at a distance normally considered favorable for life.\n\n\"This work opens up a new observational frontier for studying and understanding eruptions and space weather around other stars,\" adds Henrik Eklund, an ESA research fellow based at the European Space Research and Technology Centre (ESTEC) in Noordwijk, The Netherlands.\n\n\"We're no longer limited to extrapolating our understanding of the Sun's CMEs to other stars. It seems that intense space weather may be even more extreme around smaller stars -- the primary hosts of potentially habitable exoplanets. This has important implications for how these planets keep hold of their atmospheres and possibly remain habitable over time.\"\n\nExpanding the Study of Extreme Space Weather\n\nThis discovery also deepens our knowledge of space weather more broadly, an area long studied by ESA through missions including SOHO, the Proba series, Swarm, and Solar Orbiter.\n\nXMM-Newton remains a key observatory for examining high-energy environments throughout the Universe. Since its launch in 1999, it has explored galactic cores, studied stellar evolution, investigated regions around black holes, and observed bursts of intense radiation from distant stars and galaxies.\n\n\"XMM-Newton is now helping us discover how CMEs vary by star, something that's not only interesting in our study of stars and our Sun, but also our hunt for habitable worlds around other stars,\" says ESA XMM-Newton Project Scientist Erik Kuulkers. \"It also demonstrates the immense power of collaboration, which underpins all successful science. The discovery was a true team effort, and resolves the decades-long search for CMEs beyond the Sun.\"",
  "summary": "Scientists have finally confirmed a powerful coronal mass ejection from another star, using LOFAR radio data paired with XMM-Newton’s X-ray insights. The eruption blasted into space at extraordinary speeds, strong enough to strip atmospheres from close-orbiting worlds. This suggests planets around active red dwarfs may be far less hospitable than hoped.",
  "published": "Fri, 14 Nov 2025 09:07:09 EST",
  "url": "https://www.sciencedaily.com/releases/2025/11/251114041208.htm",
  "source": "All Top News -- ScienceDaily"
}