{
  "title": "Scientists grow a tiny human “blood factory” that actually works",
  "text": "Our body's \"blood factory\" is made of highly specialized tissue containing bone cells, nerves, blood vessels and several other cell types. Researchers have now recreated this complex network in the laboratory using only human cells, marking a first in the field. This new system could help reduce the number of animal experiments needed for many types of research.\n\nThe bone marrow usually operates quietly and goes largely unnoticed. It becomes a focus of attention only when its function falters, such as in blood cancers. In those moments, knowing how blood is normally produced, and what causes that process to break down, becomes essential.\n\nHuman Cell Model Offers a New Research Tool\n\nFor decades, most studies on bone marrow have relied on animal research or simplified cell systems that cannot fully mimic the human environment. Scientists from the Department of Biomedicine at the University of Basel and University Hospital Basel have now produced a realistic bone marrow model made entirely from human cells. The team, led by Professor Ivan Martin and Dr Andrés García García, reports in Cell Stem Cell that this platform may support blood cancer studies, drug testing and possibly future personalized treatments.\n\nUnderstanding Bone Marrow Niches\n\nBone marrow contains several specialized microenvironments known as \"niches.\" One niche that plays a central role in creating new blood cells lies near the bone surface and is linked to blood cancer's ability to resist treatment. Called the endosteal niche, it features blood vessels, immune cells, nerves and bone cells. Until now, no human model had managed to include all of these components in a single system.\n\nThe researchers have now developed a model that replicates this complexity. Their work began with an artificial bone framework made of hydroxyapatite, a natural mineral found in teeth and bones. They then used human cells that had been reprogrammed into pluripotent stem cells through molecular biology techniques. These stem cells can develop into many different cell types based on the signals present in their environment.\n\nBuilding a Functional 3D Bone Marrow System\n\nThe team introduced these stem cells into the artificial bone scaffold and guided them through controlled developmental steps to produce a diverse range of bone marrow cell types. Their analysis showed that the resulting three-dimensional structure closely matches the human endosteal niche. It is also larger than previous models, measuring eight millimeters in diameter and four millimeters in thickness. Using this model, the researchers were able to maintain human blood cell formation in the laboratory for several weeks.\n\nPotential to Reduce Animal Experiments\n\n\"We have learned a great deal about how bone marrow works from mouse studies,\" says Ivan Martin. \"However, our model brings us closer to the biology of the human organism. It could serve as a complement to many animal experiments in the study of blood formation in both healthy and diseased conditions.\" This goal aligns with the university's broader effort to reduce, refine and replace animal experiments whenever feasible.\n\nThe system could also support drug development. \"However, for this specific purpose, the size of our bone marrow model might be too large,\" explains Andrés García García. To test many drugs or doses at the same time, the platform would need to be made smaller.\n\nIn the future, this approach could help guide personalized treatment decisions for blood cancers. Researchers envision creating patient-specific bone marrow models that allow doctors to test therapies and identify the most effective option for each individual. Further improvements will be necessary before this becomes possible, but the study represents an important early step.",
  "summary": "Researchers have recreated a miniature human bone marrow system that mirrors the real structure found inside our bones. The model includes the full mix of cells and signals needed for blood production and even maintains this process for weeks. It could transform how scientists study blood cancers and test new drugs. In the future, it may support more personalized treatment strategies.",
  "published": "Thu, 20 Nov 2025 10:24:49 EST",
  "url": "https://www.sciencedaily.com/releases/2025/11/251120092103.htm",
  "source": "All Top News -- ScienceDaily"
}