{
  "title": "Supercomputer creates the most realistic virtual brain ever",
  "text": "Using the strength of one of the fastest supercomputers on the planet, scientists have created one of the most comprehensive and biologically realistic animal brain simulations ever developed. This digital reconstruction of the entire mouse cortex gives researchers a new way to explore brain function by recreating conditions such as Alzheimer's or epilepsy inside a virtual environment. It allows them to track how damage moves through neural circuits and to investigate processes involved in cognition and consciousness. The simulation includes nearly ten million neurons, 26 billion synapses, and 86 connected brain regions, capturing both structure and activity at high resolution.\n\nThis major accomplishment was enabled by Supercomputer Fugaku, Japan's premier high-performance system capable of performing quadrillions of calculations per second. Scientists from the Allen Institute and Tadashi Yamazaki, Ph.D., at Japan's University of Electro-Communications, partnered with three additional Japanese organizations to lead this work. The full findings will be detailed in a paper scheduled for release at SC25, the top global supercomputing conference taking place in mid-November.\n\nA New Way to Explore Disease and Brain Function\n\nResearchers can use this virtual cortex to study how neurological disorders form, how brain waves contribute to attention, and how seizures move through neural networks. In the past, these kinds of questions required real brain tissue and could only be addressed through individual experiments. With this model, scientists can test many ideas in a digital space. These simulations may offer early clues about how brain disorders begin before symptoms appear and provide a safe way to evaluate potential therapies.\n\n\"This shows the door is open. We can run these kinds of brain simulations effectively with enough computing power,\" said Anton Arkhipov, Ph.D., an investigator at the Allen Institute who worked on the project. \"It's a technical milestone giving us confidence that much larger models are not only possible, but achievable with precision and scale.\"\n\nThis collaborative effort brings together deep neuroscience knowledge and the processing power of a world-class machine. The Allen Institute contributed the biological foundation of the virtual brain using data from the Allen Cell Types Database and the Allen Connectivity Atlas, while Fugaku handled the massive computations needed to generate the model.\n\nHow Researchers Created the Whole Cortex Simulation\n\nFugaku, developed by RIKEN and Fujitsu, ranks among the fastest computers ever built and can process more than 400 quadrillion operations every second. To grasp the scale of that number, counting to it at one count per second would take over 12.7 billion years (approximately the age of the universe: 13.8 billion years). The system's name, \"Fugaku,\" refers to Mount Fuji and reflects the machine's far-reaching capability and towering performance.\n\n\"Fugaku is used for research in a wide range of computational science fields, such as astronomy, meteorology, and drug discovery, contributing to the resolution of many societal problems,\" said Yamazaki. \"On this occasion, we utilized Fugaku for a neural circuit simulation.\"\n\nThe supercomputer is assembled from many small processing units called nodes. These nodes are organized into units, shelves, and racks, forming a system of 158,976 total nodes that can handle enormous amounts of data and calculations.\n\nFrom Biological Data to a Living Digital Cortex\n\nUsing the Allen Institute's Brain Modeling ToolKit, the team converted biological data into a functioning digital reconstruction of the cortex. To simulate living neuronal behavior, a tool called Neulite transformed mathematical equations into virtual neurons capable of spiking, signaling, and communicating as real neurons do.\n\nWatching the simulation is similar to observing live brain activity. The model reproduces fine details of neuron structure, synapse activity, and electrical signaling across cell membranes. \"It's a technical feat, but it's only the first step,\" said Yamazaki. \"God is in the details, so in the biophysically detailed models, I believe.\"\n\n\"Our long-term goal is to build whole-brain models, eventually even human models, using all the biological details our Institute is uncovering,\" said Arkhipov. \"We're now moving from modeling single brain areas to simulating the entire brain of the mouse.\" With computational systems this powerful, the possibility of a complete, biologically accurate brain model is moving from concept to reality. Scientists are entering a new era in which understanding the brain also means being able to construct one.\n\nThis cutting-edge research was made possible by an international team including Laura Green, Ph.D.; Beatriz Herrera, Ph.D.; Kael Dai, B.Sc.; Rin Kuriyama, M.Sc.; and Kaaya Akira, Ph.D.",
  "summary": "Researchers have created one of the most detailed virtual mouse cortex simulations ever achieved by combining massive biological datasets with the extraordinary power of Japan’s Fugaku supercomputer. The digital brain behaves like a living system, complete with millions of neurons and tens of billions of synapses, giving scientists the ability to watch diseases like Alzheimer’s or epilepsy unfold step by step. The project opens a new path for studying brain function, tracking how damage spreads across neural circuits, and testing ideas that once required countless experiments on real tissue.",
  "published": "Tue, 18 Nov 2025 22:33:37 EST",
  "url": "https://www.sciencedaily.com/releases/2025/11/251118212037.htm",
  "source": "All Top News -- ScienceDaily"
}