{
  "title": "On Zubeen Garg’s 53rd birth anniversary, Assam CM Himanta Sarma’s big announcement",
  "text": "Assam Chief Minister Himanta Biswa Sarma Tuesday announced that Union Home Minister Amit Shah has granted the necessary sanction under Section 208 of the Bharatiya Nagarik Suraksha Sanhita (BNSS) to conduct the proceedings against the accused linked to the death of singer and philanthropist Zubeen Garg’s in Singapore in September.\n\nSarma’s announcement on X post comes as Assam celebrated Zubeen Garg’s birth anniversary on Tuesday, with several organisations, including political parties, holding day-long programmes to honour one of the most influential musical artistes from the state. Garg was born at Tura in Meghalaya on November 18, 1972.\n\n“Today marks the 53rd birthday of our beloved Zubeen Garg — a day that reminds us of his music, his voice, and his irreplaceable place in Assam’s heart. On this very day, the Hon’ble Union Home Minister Sri @AmitShah Ji has granted the required sanction under Section 208 of the Bharatiya Nagarik Suraksha Sanhita (BNSS) to proceed against the accused linked to Zubeen’s death in Singapore,” Sarma posted on X.\n\nToday marks the 53rd birthday of our beloved Zubeen Garg — a day that reminds us of his music, his voice, and his irreplaceable place in Assam’s heart. On this very day, the Hon’ble Union Home Minister Sri @AmitShah Ji has granted the required sanction under Section 208 of the… — Himanta Biswa Sarma (@himantabiswa) November 18, 2025\n\nZubeen Garg, 52, passed away in Singapore after losing consciousness during a yacht outing organised by Assam Association Singapore. He was in the country as cultural brand ambassador for the North East India Festival.\n\nDescribing the sanction as a “crucial legal step”, Sarma wrote that it allows them to “file charge sheet and move forward firmly and lawfully for trial of the case. We remain fully committed to file the chargesheet against the accused persons within 10th of December 25.”\n\nFans celebrate 53rd birth anniversary of Zubeen Garg\n\nZubeen Garg’s fans gathered outside his Kahilipara residence at midnight to cut a cake and placed it before his photograph, with his wife Garima Saikia Garg and sister Palmee Borthakur present on the occasion, news agency PTI reported.\n\nThe fans sang the birthday song, and his popular songs to ring in the celebrations. They also gathered at the ‘Zubeen Kshetra‘, the site of his cremation, to pay tributes by offering ‘gamosas‘ (traditional scarves) and flowers, lighting lamps and singing his songs, the report stated.\n\nSarma, in his tribute to Garg, wrote, “Some presence fades from sight but shines brighter in memory.”\n\nStory continues below this ad\n\n“Today, we honour the enduring legacy of an artist who was, will and forever be our heartthrob. That of our #BelovedZubeen. Forever in our hearts,” the chief minister added.\n\n‘BJP, Congress to celebrate singer’s birth anniversary’\n\nThe ruling Bharatiya Janata Party (BJP) in Assam will organise a blood donation camp on Tuesday, PTI reported.\n\nNationalist Democratic Alliance (NDA) partner Asom Gana Parishad (AGP) will observe the day as the ‘Jatiya Swabhiman Diwas’ (National Self-respect Day) by organising a tribute ceremony at the party headquarters, where a blood donation camp will be held, along with rendition of Garg’s popular songs and planting of saplings, it stated.\n\nMeanwhile, the Opposition Congress will also organise a commemorative programme, ‘Kanchanjunga-Sanskriti Houk Maitreyir Mantra’ (Culture be the mantra of harmony) to honour his memory, celebrate his cultural contributions and reaffirm the party’s continued commitment to secure justice for him.\n\nStory continues below this ad\n\nAssam Pradesh Congress President Gaurav Gogoi will be present on the occasion – an evening of “remembrance, reverence and collective reflection”, a party spokesperson told PTI.\n\nClubs and unions commemorate Zubeen’s birthday\n\nThe All Assam Students’ Union (AASU) has volunteered to organise a three-day programme to commemorate the singer’s birthday since Sunday across all district headquarters, by organising art camps, cycle rallies and planting of saplings.\n\nThe All Assam Zubeen Garg Fan Club will also hold programmes across the state to mark his birth anniversary.\n\nMembers of the Gauhati Press Club (GPC) paid floral tributes to Garg on the occasion.",
  "summary": "",
  "published": "Tue, 18 Nov 2025 09:06:12 +0000",
  "url": "https://indianexpress.com/article/india/assam-cm-himanta-birth-anniversary-zubeen-garg-10372197/",
  "source": "India | The Indian Express"
}