{
  "title": "Warner Bros. Discovery is up for sale as theaters hope for a renewed focus on films",
  "text": "Warner Bros. Discovery is up for sale as theaters hope for a renewed focus on films\n\nWarner Brothers Discovery is accepting bids this week, sparking concerns among theater owners who hope the potential buyer will prioritize making movies for cinemas.\n\n: [POST-BROADCAST CORRECTION Nov. 20, 2025: A previous version of this story incorrectly said that Warner Brothers produced 2001: A Space Odyssey. The film was released by MGM in 1968. Warner later acquired the film’s rights.]\n\nJUANA SUMMERS, HOST:\n\nThe entertainment industry is abuzz with the news that Warner Bros. Discovery is up for sale. The legendary film studio, which has grown into streaming services and cable channels, is accepting bids until this Thursday, according to reports. It has become something of a Hollywood parlor game to guess who will ultimately buy the house that Jack Warner built. One group that has an interest in all of this is theater owners, as NPR's Mandalit del Barco reports.\n\n(SOUNDBITE OF MAX STEINER'S \"OPENING/END TITLE FROM 'ARSENIC AND OLD LACE'\")\n\nMANDALIT DEL BARCO, BYLINE: Warner Bros. has been in business since 1923, founded by four brothers - Harry, Albert Sam and Jack Warner. They owned a movie theater in Pennsylvania before coming to Hollywood to make movies. Warner Bros. Pictures found one of its first silent picture stars in a German shepherd named Rin Tin Tin.\n\n(SOUNDBITE OF FILM, \"THE JAZZ SINGER\")\n\nAL JOLSON: (As Jakie Rabinowitz) Wait a minute. You ain't heard nothing yet.\n\nDEL BARCO: And in 1927, the studio made history with its feature-length talkie picture, \"The Jazz Singer,\" starring Al Jolson.\n\n(SOUNDBITE OF FILM, \"THE JAZZ SINGER\")\n\nJOLSON: (As Jakie Rabinowitz, singing) Toot, toot, tootsie. Goodbye.\n\nDEL BARCO: Over the years, Warner Bros. has made so many iconic films, including \"Casablanca\"...\n\n(SOUNDBITE OF FILM, \"CASABLANCA\")\n\nHUMPHREY BOGART: (As Rick Blaine) Here's looking at you, kid.\n\nDEL BARCO: ...From \"Bonnie and Clyde\" to \"Barbie,\" and all those \"Looney Tunes\" cartoons.\n\n(SOUNDBITE OF TV SHOW, \"LOONEY TUNES\")\n\nMEL BLANC: (As Bugs Bunny) Eh, what's up, Doc?\n\nDEL BARCO: Over the decades, Warner Bros. had several owners. Three years ago, Warner Media, as it was called, merged with Discovery, and last June, the company announced it would split into two, with film, TV and streaming studios on one side and on the other side, mostly legacy cable channels, including CNN. The split hasn't happened, and a new buyer might get the entirety of Warner Bros. Discovery. As the film industry continues to consolidate, there's speculation that Warner Bros.' old rival, Paramount, could take over.\n\nHaving just merged as Paramount Skydance, CEO David Ellison has already made several overtures. The idea of streaming giant Netflix buying the company has raised antitrust concerns on Capitol Hill. Industry watchers suggest other suitors could be Comcast, Amazon or an investor who's not already in the entertainment business. Regardless of whoever does end up buying the company, theater owners say they hope they'll prioritize making movies for the cinemas.\n\nDANIEL LORIA: As long as we have more movies - that doesn't mean the same amount, that doesn't mean less, but more movies - I think you're going to find folks in the movie theater industry support any business decision that gets us there.\n\nDEL BARCO: That's Daniel Loria, senior vice president at The Boxoffice Company, which analyzes data from studios and theaters. He says when Disney purchased Fox and Fox Searchlight, their combined studios significantly reduced the number of films they released in the theaters. That's a problem for theater owners who have been struggling to bring audiences back to cinemas after the COVID-19 pandemic shut them down. They're competing with movie watching on TVs, computers and cellphones, and some fear studios will only greenlight a few big-budget blockbusters. Max Friend is the CEO of Filmbot, the ticketing platform for independent cinemas in the U.S.\n\nMAX FRIEND: The concern is that we're going to see less of that risk-taking, less of that experimentation and less of that embracing new directors, new filmmakers in the future. And it's really important that there are studios that are funding and supporting cultivating that kind of work.\n\nDEL BARCO: Friend points out that this year, Warner Bros. made a string of critical hits, including Ryan Coogler's \"Sinners,\" the horror film \"Weapons\" and Paul Thomas Anderson's \"One Battle After Another.\" He wonders if the next owner will take similar risks with original creative films. Mandalit del Barco, NPR News, Los Angeles.\n\n(SOUNDBITE OF LADY WRAY SONG, \"HOLD ON\")\n\nSUMMERS: And a note that Warner Bros., CNN, Disney, Amazon, Comcast, Oracle, 20th Century Studios and Paramount are NPR sponsors, but we cover them as we would any other company.\n\n(SOUNDBITE OF LADY WRAY SONG, \"HOLD ON\")\n\nCopyright © 2025 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\n\nAccuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.",
  "summary": "Warner Brothers Discovery is accepting bids this week, sparking concerns among theater owners who hope the potential buyer will prioritize making movies for cinemas.",
  "published": "Tue, 18 Nov 2025 16:49:11 -0500",
  "url": "https://www.npr.org/2025/11/18/nx-s1-5601922-e1/warner-bros-discovery-is-up-for-sale-as-theaters-hope-for-a-renewed-focus-on-films",
  "source": "NPR Topics: Business"
}