{
  "title": "What is chickenpox and how can I get my child vaccinated?",
  "text": "What is chickenpox and how can I get my child vaccinated?\n\n29 August 2025 Share Save Michelle Roberts Digital health editor, BBC News Share Save\n\nGetty Images Calamine lotion can be used to help relieve the itchiness of chickenpox spots\n\nYoung children in the UK will soon be offered a free chickenpox vaccine on the NHS. It will be added to the list of standard childhood vaccinations from January 2026, and there will be a catch-up programme for older children. Children to be offered chickenpox vaccine on NHS\n\nWhat is chickenpox and how can you catch it?\n\nChickenpox is a highly contagious disease caused by the varicella zoster virus (VZV). The virus is transmitted through direct contact between people, or through airborne droplets in coughs and sneezes. It is very easy to catch, especially if you've never had it before. While it mostly affects children - around half have had it by their fourth birthday - people of any age can get it.\n\nWhat are the symptoms of chicken pox and what does the rash look like?\n\nGetty Images\n\nThe first symptoms include a fever, muscle aches and pains and generally feeling unwell. A couple of days later, an itchy, spotty rash appears. These red or pink dots can appear anywhere on the body, including inside the mouth. Some children might have only a few spots, but others can be covered from head to toe. The spots fill up with fluid and become blisters before crusting over to form scabs, which eventually drop off and clear up. You are contagious and can spread chickenpox to other people from two days before the first spots develop until they have all formed scabs, which is usually five days after they first appear.\n\nHow dangerous is chickenpox?\n\nMost cases in children are mild, although they will feel unwell and will need to miss school or nursery for several days. Some children will go on to develop complications. In rare cases chicken pox can cause a swelling of the brain, called encephalitis; an inflammation of the lungs, called pneumonitis; and stroke, which can result in hospitalisation and - very rarely - death. Chickenpox is often more serious in very young infants and adults. It can be dangerous in pregnancy, causing complications in both the mother and the baby.\n\nCan you get chickenpox twice?\n\nIt's possible to get chickenpox more than once, but that is very unusual. Some people who have had chickenpox develop a related condition called shingles later in life.\n\nHow will the chickenpox vaccine work and who can get it?\n\nYou can already get the chickenpox vaccine privately in the UK, at a cost of up to £200. But experts say adding the varicella vaccine to the official NHS childhood immunisation programme will dramatically reduce the number of people who catch chickenpox, leading to far fewer serious cases. The vaccine doesn't guarantee lifetime immunity, but it does greatly reduce the risk of someone developing chickenpox or having a bad case. Serious side effects, such as a severe allergic reaction, are very rare. From January 2026, children will be automatically offered two doses at 12 and 18 months of age. They will get the combined MMRV vaccine, which protects against measles, mumps, rubella and varicella. It is a live vaccine which means it contains a weakened version of the chickenpox virus. As such, it is not recommended for those with a compromised immune system because of an illness like HIV or as a result of treatment such as chemotherapy. The move will bring the UK into line with other countries which already offer routine varicella vaccination, including Germany, Canada, Australia and the US. It had previously been thought that vaccinating children against chickenpox would cause a problematic rise in shingles, but a recent long-term study from the US disproved that theory. The committee which advises the government on vaccinations - the JCVI - recommended that all children be given the MMRV in November 2023. It also suggested that there should be a temporary catch-up programme for slightly older children who will just miss out. Details of this are expected in due course. The decision to vaccinate against chickenpox was announced as new data revealed none of the main childhood vaccines in England reached the 95% uptake target in 2024/25. Some 91.9% of five-year-olds had received one dose of the MMR vaccine, unchanged from 2023/24 and the lowest level since 2010/11, according to the UK Health Security Agency.\n\nWhat is shingles and is there a vaccine?",
  "summary": "The NHS in England and Wales will start offering the MMRV vaccine to young children from January 2026.",
  "published": "Fri, 29 Aug 2025 11:51:59 GMT",
  "url": "https://www.bbc.com/news/articles/cn0rnqj52y5o?at_medium=RSS&at_campaign=rss",
  "source": "BBC News"
}