{
  "title": "‘No justification for terrorism’: EAM Jaishankar days after Delhi’s Red Fort blast",
  "text": "A week after a blast near Delhi’s Red Fort area killed 12 people, External Affairs Minister S Jaishankar on Tuesday reiterated that India has “zero tolerance for terrorism” and there can be “no white washing for terrorism”.\n\nSpeaking at the SCO Heads of Government Summit in Moscow, Jaishankar said: “It is imperative that the world display zero tolerance towards terrorism in all its forms and manifestations. There can be no justification, no looking away and no whitewashing. As India has demonstrated, we have the right to defend our people against terrorism and will exercise it.”\n\n“We must never forget that the SCO was founded to combat the three evils of terrorism, separatism and extremism. These threats have become even more serious in the years that have passed,” he added.\n\nMy remarks at SCO Council of Heads of Government meeting in Moscow.\n\nhttps://t.co/uis0JJCH5I — Dr. S. Jaishankar (@DrSJaishankar) November 18, 2025\n\nA Hyundai i20 car exploded outside the Red Fort on November 10. Umar Un Nabi, the driver of the vehicle and the accused in the case, worked at Al Falah University (Faridabad, Haryana) as an assistant professor.\n\nThe Patiala House Court Tuesday sent the co-conspirator and close aide of Nabi, Jasir Bilal Wani, to NIA custody for 10 days. He was arrested by the National Investigation Agency (NIA) on Monday.\n\nJaishankar at SCO\n\nOn the economic agenda, Jaishankar noted that the global financial environment is “particularly uncertain and volatile,” with supply-side risks increasingly compounded by demand-side pressures. In such a climate, he said, nations must urgently de-risk and diversify their economic engagements.\n\n“This is best done by as many of us forging the widest possible economic links,” he said, adding that such cooperation must be fair, transparent and equitable for all SCO members. He pointed out that India’s ongoing efforts to negotiate free trade agreements with several countries in the region should be viewed in this context of building resilient and diversified economic partnerships.\n\nTransitioning to cultural cooperation, Jaishankar pointed to India’s deep historical ties with member nations, noting that these shared civilisational roots provide a strong foundation for people-to-people engagement. It was in recognition of this heritage, he said, that Prime Minister Narendra Modi had proposed the launch of an SCO Civilisational Dialogue Forum at the Tianjin SCO Summit. The platform is intended to strengthen cultural exchange, celebrate shared histories, and bolster mutual understanding among SCO states.\n\nStory continues below this ad\n\nEarlier on Monday, Jaishankar met Russian Foreign Minister Sergey Lavrov in Moscow, while Russian Security Council Secretary Nikolai Patrushev held talks with National Security Adviser Ajit Doval in New Delhi. The meetings come as both sides prepare for President Vladimir Putin’s expected visit to India on 4–5 December.",
  "summary": "",
  "published": "Tue, 18 Nov 2025 10:16:23 +0000",
  "url": "https://indianexpress.com/article/india/no-justification-whitewashing-jaishankar-terrorism-after-delhi-red-fort-blast-10372365/",
  "source": "India | The Indian Express"
}