{
  "title": "Wild new “gyromorph” materials could make computers insanely fast",
  "text": "Researchers are exploring a new generation of computers that operate using light, or photons, instead of electrical currents. Systems that rely on light to store and process information could one day run far more efficiently and complete calculations much faster than conventional machines.\n\nLight-driven computing is still at an early stage, and one of the main technical obstacles involves controlling tiny streams of light traveling through a chip. Rerouting these microscopic signals without weakening them requires carefully engineered materials. To keep signals strong, the hardware must include a lightweight substance that prevents stray light from entering from any direction. This type of material is known as an \"isotropic bandgap material.\"\n\nDiscovery of Gyromorphs at NYU\n\nScientists at New York University have identified a new material called \"gyromorphs\" that meets this challenge more effectively than any other known structure. Gyromorphs combine features normally associated with liquids and crystals, yet they exceed both in their ability to block incoming light from all angles. The discovery, reported in Physical Review Letters, introduces a fresh strategy for tuning optical behavior and could help advance the development of photonic computers.\n\n\"Gyromorphs are unlike any known structure in that their unique makeup gives rise to better isotropic bandgap materials than is possible with current approaches,\" says Stefano Martiniani, an assistant professor of physics, chemistry, mathematics and neural science, and the senior author of the study.\n\nWhy Existing Materials Fall Short\n\nFor decades, researchers have looked to quasicrystals when designing isotropic bandgap materials. These structures, first proposed by physicists Paul Steinhardt and Dov Levine in the 1980s and later observed by Dan Schechtman, follow mathematical rules but do not repeat like traditional crystals.\n\nDespite their promise, quasicrystals come with a trade-off noted by the NYU team. They may completely block light, but only from limited directions. Alternatively, they can weaken light from all directions but fail to fully stop it. This limitation has driven scientists to search for alternatives that can block signal-degrading light more comprehensively.\n\nEngineering New Metamaterials\n\nIn their Physical Review Letters study, the NYU researchers created \"metamaterials,\" which are engineered structures whose properties depend on their architecture rather than on their chemical composition. One major challenge in designing these materials lies in understanding how their arrangement leads to desired physical behaviors.\n\nTo overcome this, the team developed an algorithm capable of producing functional structures with built-in disorder. Their work revealed a new form of \"correlated disorder\" that sits between the fully ordered and fully random extremes.\n\n\"Think of trees in a forest -- they grow at random positions, but not completely random because they're usually a certain distance from one another,\" Martiniani explains. \"This new pattern, gyromorphs, combines properties that we believed to be incompatible and displays a function that outperforms all ordered alternatives, including quasicrystals.\"\n\nHow Gyromorphs Achieve Their Unique Capabilities\n\nDuring their analysis, the scientists observed that every isotropic bandgap material exhibited a shared structural signature.\n\n\"We wanted to make this structural signature as pronounced as possible,\" says Mathias Casiulis, a postdoctoral fellow in NYU's Department of Physics and the paper's lead author. \"The result was a new class of materials -- gyromorphs -- that reconcile seemingly incompatible features.\n\n\"This is because gyromorphs don't have a fixed, repeating structure like a crystal, which gives them a liquid-like disorder, but, at the same time, if you look at them from a distance they form regular patterns. These properties work together to create bandgaps that lightwaves can't penetrate from any direction.\"\n\nThe research also included Aaron Shih, an NYU graduate student, and received support from the Simons Center for Computational Physical Chemistry (839534) and the Air Force Office of Scientific Research (FA9550-25-1-0359).",
  "summary": "Researchers engineered “gyromorphs,” a new type of metamaterial that combines liquid-like randomness with large-scale structural patterns to block light from every direction. This innovation solves longstanding limitations in quasicrystal-based designs and could accelerate advances in photonic computing.",
  "published": "Thu, 13 Nov 2025 09:31:54 EST",
  "url": "https://www.sciencedaily.com/releases/2025/11/251113071609.htm",
  "source": "All Top News -- ScienceDaily"
}