{
  "title": "Israeli strikes across Gaza kill 25 Palestinians, health ministry says",
  "text": "Israeli strikes across Gaza kill 25 Palestinians, health ministry says\n\n22 hours ago Share Save Rushdi Abualouf, Gaza correspondent, in Istanbul and David Gritten Share Save\n\nAnadolu via Getty Images Some of the casualties were brought to al-Shifa hospital in Gaza City\n\nAt least 25 Palestinians were killed in Israeli strikes across the Gaza Strip on Wednesday, the Hamas-run health ministry has said, in what was one of the deadliest days since the ceasefire came into effect five weeks ago. Ten people were killed when a ministry of religious endowments building in the eastern Zeitoun neighbourhood of Gaza City was hit, according to rescuers. Israel's military said it struck \"Hamas terrorist targets\" after gunmen opened fire towards an area where its soldiers were operating in the southern city of Khan Younis in violation of the ceasefire deal. Hamas questioned the claim and denounced what it said was a \"dangerous escalation\" that could jeopardise the ceasefire.\n\nThe flare-up of violence comes after the UN Security Council passed a resolution that endorsed US President Donald Trump's Gaza peace plan to end two years of devastating war.\n\nMahmoud Bassal, a spokesman for Gaza's Hamas-run Civil Defence agency, told the BBC that Israeli air, drone and artillery strikes hit several locations in Gaza City and Khan Younis shortly after sunset on Wednesday. The attacks marked a sharp escalation after several days of relative calm, he said. The Civil Defence reported that the strike in Zeitoun caused severe damage to the religious endowments ministry's building and surrounding structures, and posted a video showing its rescue workers appearing to find two people buried under rubble. Photos published by the Anadolu news agency meanwhile showed the bodies of three young children reportedly recovered from the scene. In a separate incident in Gaza City, one person was killed and several others were wounded when a drone struck a group of people at Shejaiya junction on Salah al-Din Street, Gaza's main north-south road, according to Mr Bassal. He said another person was killed when a tank shell struck a house belonging to the Balboul family in Shejaiya's Mushtaha Street, which is also in eastern Gaza City. The Civil Defence reported that another 13 people were killed in the Khan Younis area. Mr Bassal said three of them were killed in a strike on a group inside a sports club run by the UN agency for Palestinian refugees (Unrwa). In a statement, the Israel Defense Forces (IDF) said that \"several terrorists opened fire toward the area where IDF soldiers are operating in Khan Younis\" earlier on Wednesday. \"This action constitutes a violation of the ceasefire agreement. No IDF injuries were reported,\" it added. \"In response, the IDF began striking Hamas terrorist targets across the Gaza Strip.\" Israeli public broadcaster Kan cited a security source as saying the targets of the strikes were the commander of the Zeitoun Battalion of Hamas's military wing, the Izz al-Din al-Qassam Brigades, and the commander of its naval force. Hamas denounced the Israeli strikes, saying in a statement that it considered them a \"dangerous escalation through which the war criminal [Israeli Prime Minister Benjamin] Netanyahu seeks to resume the genocide against our people\". It also urged the US to \"honour its stated commitments and exert immediate pressure on Israel to enforce the ceasefire and halt its attacks\". But a US official told Reuters news agency that Hamas was aiming to break the ceasefire and not fulfil its commitment to disarm.",
  "summary": "The Israeli military says it struck several Hamas targets after gunmen fired at soldiers in Gaza in violation of the five-week-old ceasefire.",
  "published": "Thu, 20 Nov 2025 07:30:46 GMT",
  "url": "https://www.bbc.com/news/articles/c62e27j69q9o?at_medium=RSS&at_campaign=rss",
  "source": "BBC News"
}