{
  "title": "Scientists identify secret ingredient in Leonardo da Vinci paintings",
  "text": "Editor’s Note: Sign up for CNN’s Wonder Theory science newsletter. Explore the universe with news on fascinating discoveries, scientific advancements and more.\n\nCNN —\n\n“Old Masters” such as Leonardo da Vinci, Sandro Botticelli and Rembrandt may have used proteins, especially egg yolk, in their oil paintings, according to a new study.\n\nTrace quantities of protein residue have long been detected in classic oil paintings, though they were often ascribed to contamination. A new study published Tuesday in the journal Nature Communications found the inclusion was likely intentional — and sheds light on the technical knowledge of the Old Masters, the most skilled European painters of the 16th, 17th, or early 18th century, and the way they prepared their paints.\n\n“There are very few written sources about this and no scientific work has been done before to investigate the subject in such depth,” said study author Ophélie Ranquet of the Institute of Mechanical Process Engineering and Mechanics at the Karlsruhe Institute of Technology in Germany, in a phone interview. “Our results show that even with a very small amount of egg yolk, you can achieve an amazing change of properties in the oil paint, demonstrating how it might have been beneficial for the artists.”\n\nSimply adding some egg yolk to their works, it turns out, could have long-lasting effects that went beyond just aesthetics.\n\nEggs vs. oil\n\nCompared with the medium formulated by ancient Egyptians called tempera — which combines egg yolk with powdered pigments and water — oil paint creates more intense colors, allows for very smooth color transitions and dries far less quickly, so it can be used for several days after its preparation. However, oil paint, which uses linseed or safflower oil instead of water, also has drawbacks, including being more susceptible to color darkening and damage caused by exposure to light.\n\nBecause making paint was an artisanal and experimental process, it is possible that the Old Masters might have added egg yolk, a familiar ingredient, to the newer type of paint, which first showed up in the seventh century in Central Asia before spreading to Northern Europe in the Middle Ages and Italy during the Renaissance. In the study, the researchers recreated the process of paint-making by using four ingredients — egg yolk, distilled water, linseed oil and pigment — to mix two historically popular and significant colors, lead white and ultramarine blue.\n\n“The addition of egg yolk is beneficial because it can tune the properties of these paints in a drastic way,” Ranquet said, “For example by showing aging differently: It takes a longer time for the paint to oxidize, because of the antioxidants contained in the yolk.”\n\nThe chemical reactions between the oil, the pigment and the proteins in the yolk directly affect the paint’s behavior and viscosity. “For example, the lead white pigment is quite sensitive to humidity, but if you coat it with a protein layer, it makes it a lot more resistant to it, making the paint quite easy to apply,” Ranquet said.\n\n“On the other hand, if you wanted something stiffer without having to add a lot of pigment, with a bit of egg yolk you can create a high impasto paint,” she added, referring to a painting technique where the paint is laid out in a stroke thick enough that the brushstrokes are still visible. Using less pigment would have been desirable centuries ago, when certain pigments — such as lapis lazuli, which was used to make ultramarine blue — were more expensive than gold, according to Ranquet.\n\n\"The Madonna of the Carnation,\" on display at the Alte Pinakothek in Munich, Germany, is one of Leonardo da Vinci's earliest paintings. Wrinkling of the oil paint is evident on the faces. DeAgostini/Getty Images\n\nA direct evidence of the effect of egg yolk in oil paint, or lack thereof, can be seen in Leonardo da Vinci’s “Madonna of the Carnation,” one of the paintings observed during the study. Currently on display at the Alte Pinakothek in Munich, Germany, the work shows evident wrinkling on the face of Mary and the child.\n\n“Oil paint starts to dry from the surface down, which is why it wrinkles,” Ranquet said.\n\nOne reason for wrinkling may be an insufficient quantity of pigments in the paint, and the study has shown that this effect could be avoided with the addition of egg yolk: “That’s quite amazing because you have the same quantity of pigment in your paint, but the presence of the egg yolk changes everything.”\n\nBecause wrinkling occurs within days, it’s likely that Leonardo and other Old Masters might have caught onto this particular effect, as well as additional beneficial properties of egg yolk in oil paint, including resistance to humidity. The “Madonna of Carnation” is one of Leonardo’s earliest paintings, created at a time when he might have been still trying to master the then newly popular medium of oil paint.\n\nNew understanding of the classics\n\nAnother painting observed during the study was “The Lamentation Over the Dead Christ,” by Botticelli, also on display at the Alte Pinakothek. The work is mostly made with tempera, but oil paint has been used for the background and some secondary elements.\n\n“We knew that some parts of the paintings show brushstrokes that are typical for what we call an oil painting, and yet we detected the presence of proteins,” Ranquet said. “Because it’s a very small quantity and they are difficult to detect, this might be dismissed as contamination: In workshops, artists used many different things, and maybe the eggs were just from the tempera.”\n\nHowever, because adding egg yolk had such desirable effects on oil paint, the presence of proteins in the work might be an indication of deliberate use instead, the study suggested. Ranquet hopes that these preliminary findings might attract more curiosity toward this understudied topic.\n\nMaria Perla Colombini, a professor of analytical chemistry at the University of Pisa in Italy, who was not involved in the study, agreed. “This exciting paper provides a new scenario for the understanding of old painting techniques,” she said in an email.\n\n“The research group, reporting results from molecular level up to a macroscopic scale, contributes to a new knowledge in the use of egg yolk and oil binders. They are not more looking at simply identifying the materials used by Old Masters but explain how they could produce wonderful and glittering effects by employing and mixing the few available natural materials. They try to discover the secrets of old recipes of which little or nothing is written,” she added.\n\n“This new knowledge contributes not only to a better conservation and preservation of artworks but also to a better comprehension of art history.”\n\n\n\nTop image: The “Mona Lisa” by Leonardo Da Vinci",
  "summary": "\"Old Masters\" such as Leonardo da Vinci, Sandro Botticelli and Rembrandt may have used proteins, especially egg yolk, in their oil paintings, according to a new study.",
  "published": "Thu, 30 Mar 2023 17:43:18 GMT",
  "url": "https://www.cnn.com/style/article/old-masters-da-vinci-egg-yolk-painting-scn/index.html",
  "source": "CNN.com - RSS Channel - World"
}