{
  "title": "NIA’s first arrest in Delhi blast case: Aide of doctor who drove the car that blew up near Red Fort",
  "text": "In its first arrest in the Delhi blast case, the National Investigation Agency (NIA) has taken into its custody a Kashmir-based aide of Umar Nabi, the doctor who allegedly drove the car that exploded outside the Red Fort Metro station on November 10.\n\nThe agency said the car, a Hyundai i20, involved in the attack was registered in the name of Amir Rashid Ali. He was earlier arrested by the Jammu & Kashmir police from his home in Pampore, a few hours after the blast.\n\n“The arrested person has been identified as Amir Rashid Ali, in whose name the Hyundai i20 involved in the attack was registered. He was arrested from Delhi (where he was brought for questioning) by the NIA, which had launched a massive search operation after taking over the case from the Delhi Police,” a NIA spokesperson said.\n\n“Investigations has revealed that Ali, a resident of Samboora, Pampore, had conspired with the alleged suicide bomber, Umar Un Nabi, to unleash the terror attack,” the spokesperson said.\n\n“Amir had come to Delhi to facilitate the purchase of the car, which was eventually used as a vehicle-borne Improvised Explosive Device (IED) to trigger the blast. NIA has forensically established the identity of the deceased driver of the vehicle-borne IED as Umar Nabi, a resident of Pulwama district and Assistant Professor in General Medicine Department at Al Falah University in Faridabad,” the spokesperson said.\n\nDuring the investigation, the NIA also seized another vehicle belonging to Umar. “The vehicle is being examined for evidence in the case. NIA has so far examined 73 witnesses, including those injured in the blast on November 10,” the spokesperson said.\n\nAlso Read | Red Fort blast: Man who followed Umar to mosque detained\n\n“Working in close coordination with Delhi Police, J&K Police, Haryana Police, UP Police and various sister agencies, NIA is continuing its investigation across states. It is pursuing multiple leads to unearth the larger conspiracy behind the bombing and identify others involved in the case,” the spokesperson added.\n\nStory continues below this ad\n\nMeanwhile, a doctor from Haryana was questioned by the Counter Intelligence Team in J&K late on Saturday night. A student at the Government Medical College in Anantnag, she was questioned regarding Dr Adeel Rather, the accused in the Red Fort blast-linked terror module case. Adeel was her senior at the medical college. The woman’s Haryana-based family said she was released after questioning for a few hours even though her mobile phone was kept by the investigating agency for further probe.",
  "summary": "",
  "published": "Sun, 16 Nov 2025 13:48:49 +0000",
  "url": "https://indianexpress.com/article/india/red-fort-blast-nia-makes-first-arrest-umar-nabi-close-aide-kashmir-10369421/",
  "source": "India | The Indian Express"
}