{
  "title": "Scientists discover metformin may block key exercise benefits",
  "text": "A widely used medication for diabetes prevention may unexpectedly interfere with one of the most reliable ways to lower disease risk: regular physical activity.\n\nA Rutgers-led team reported in The Journal of Clinical Endocrinology & Metabolism that metformin appeared to weaken several important benefits normally gained from exercise. These include improvements in blood vessel function, overall fitness and the body's ability to control blood sugar.\n\nSince 2006, medical guidance has encouraged people with elevated blood sugar to combine metformin with consistent exercise. The expectation was that two well-established treatments would reinforce one another. According to the Rutgers researchers, the evidence suggests a different outcome.\n\n\"Most health care providers assume one plus one equals two,\" said Steven Malin, a professor in the Department of Kinesiology and Health in the School of Arts and Sciences and the lead author of the study. \"The problem is that most evidence shows metformin blunts exercise benefits.\"\n\nHow the Study Tested Metformin's Impact\n\nTo explore this issue, Malin and his colleagues enrolled 72 adults considered at risk for metabolic syndrome, which is a cluster of conditions known to raise the likelihood of both diabetes and heart disease. Participants were separated into four groups: high-intensity exercise with placebo, high-intensity exercise with metformin, low-intensity exercise with placebo and low-intensity exercise with metformin.\n\nOver a 16-week training period, the research team measured how well participants' blood vessels responded to insulin. This response helps vessels widen and deliver oxygen, hormones and nutrients after eating.\n\nThe results showed that exercise alone strengthened vascular insulin sensitivity. Blood vessels became more responsive to insulin, allowing greater blood flow to the muscles. This is important because insulin-assisted dilation helps move glucose from the bloodstream into body tissues, lowering blood sugar after meals.\n\nMetformin Significantly Reduced Expected Gains\n\nWhen metformin was added, these improvements became noticeably smaller. The medication also appeared to limit gains in aerobic capacity and lessen positive changes in inflammation and fasting blood glucose.\n\n\"Blood vessel function improved with exercise training, regardless of intensity,\" Malin said. \"Metformin blunted that observation, suggesting one type of exercise intensity is not better either with the drug for blood vessel health.\"\n\nThese findings are concerning because exercise is intended to support healthy blood sugar levels and improve physical capability. If metformin reduces these effects, patients relying on both may not receive the degree of protection they expect.\n\n\"If you exercise and take metformin and your blood glucose does not go down, that's a problem,\" Malin said. \"People taking metformin also didn't gain fitness. That means their physical function isn't getting better and that could have long-term health risk.\"\n\nReal-Life Consequences for Daily Function and Well-Being\n\nMalin noted that exercise-driven fitness improvements influence everyday activities such as climbing stairs, playing with children or maintaining an active social life. If these gains are diminished, overall quality of life can suffer.\n\nThe researchers emphasized that the findings should not prompt anyone to stop taking metformin or abandon exercise. Instead, the study highlights the need for physicians to closely consider how these interventions interact and to monitor patient progress. Malin hopes that future studies will help identify approaches that preserve the positive effects of both.\n\nWhy Metformin May Interfere With Exercise Adaptation\n\nThe reason metformin dampens exercise benefits is still being investigated. Malin explained that metformin partly works by inhibiting specific mitochondrial processes. This action reduces oxidative stress and helps regulate blood sugar. However, the same interference may block the cellular changes typically triggered by exercise, including better mitochondrial efficiency and improved aerobic performance. In essence, the mechanism that makes metformin effective may also hinder the body's ability to fully respond to physical training.\n\nEarlier studies have suggested a similar pattern, but this trial is one of the first to look closely at vascular insulin sensitivity, a key factor in both glucose control and cardiovascular health. By demonstrating that metformin can limit changes in both major arteries and small capillaries across different exercise intensities, the researchers highlight how complex these combined treatments can be.\n\nImplications for Diabetes Prevention and Clinical Guidelines\n\nMalin pointed out that nearly 35 million people in the United States live with type 2 diabetes, and prevention strategies often depend on a mix of lifestyle changes and medication. If these approaches do not work together as expected, long-term risks may increase.\n\n\"We need to figure out how to best recommend exercise with metformin,\" Malin said. \"We also need to consider how other medications interact with exercise to develop better guidelines for doctors to help people lower chronic disease risk.\"\n\nOther Rutgers researchers involved in the study include: Sue Shapses, professor in the Department of Nutritional Sciences at the School of Environmental and Biological Sciences; Andrew Gow, professor of pharmacology and toxicology at the Ernest Mario School of Pharmacy; Ankit Shah, assistant professor in the Department of Medicine at Robert Wood Johnson Medical School; Tristan Ragland, a former post-doctoral fellow in Department of Kinesiology and Health; Emily Heiston, project scientist and clinical coordinator in the Applied Metabolism and Physiology Laboratory; and Daniel Battillo, a former doctoral student in the Department of Kinesiology and Health.",
  "summary": "Rutgers scientists found that metformin can blunt many of the metabolic and cardiovascular improvements normally produced by exercise. Participants who took the drug saw reduced gains in fitness, blood vessel function, and glucose control. The interference may stem from how metformin affects mitochondrial activity.",
  "published": "Tue, 18 Nov 2025 10:36:44 EST",
  "url": "https://www.sciencedaily.com/releases/2025/11/251117095648.htm",
  "source": "All Top News -- ScienceDaily"
}