{
  "title": "In the works: Policy to make for Jammu and Kashmir ‘investment-ready’",
  "text": "Jammu and Kashmir Lieutenant Governor Manoj Sinha on Thursday called for fulfilling the developmental needs of Jammu and Kashmir through smart logistics infrastructure and improved logistics operations. He said that a “Jammu and Kashmir Logistics Policy 2025” would be unveiled soon.\n\nThe new policy intervention will introduce a comprehensive framework focusing on multimodal connectivity, development of dry ports and warehousing zones, and the promotion of private sector participation, Sinha said while sharing key initiatives aimed at making J&K a more competitive and investment-ready destination. He was delivering an address at the Jammu Trade and Logistics Conclave-2025, organised by the Indian Chamber of Commerce (ICC) in Jammu.\n\n“It will also grant the logistics sector industry status, ensuring that it receives all the benefits of industrial policy,” the Lt Governor said.\n\nHe also said that, under the PM GatiShakti National Master Plan (PMGS-NMP), 49 major logistics and connectivity projects worth Rs 3,000 crore have already been mapped, supporting real-time coordination and faster execution. He said the integrated planning approach is helping J&K identify logistics gaps, improve last-mile connectivity to industrial estates, optimise freight movement, and significantly reduce logistics costs and transit times.\n\nA Multi-Modal Logistics Park (MMLP) will be developed through a public-private partnership (PPP) model under a build-develop-finance-operate-transfer (DBFOT) approach at Vijaypur, he said.\n\nAccording to Sinha, the park will offer modern facilities such as an inland container depot (ICD), warehousing, cold storage, truck terminal and container freight station aimed at boosting trade and logistical efficiency.\n\nReferring to the significant boost in road and rail connectivity in Jammu and Kashmir over the last five years, he said this has unlocked the region’s potential and that Jammu is rapidly emerging as a trade and logistics hub, connecting Ladakh and the Kashmir Valley with the country’s trade corridors.\n\nStory continues below this ad\n\nHe also highlighted that the National Logistics Policy, under the guidance of Prime Minister Narendra Modi, has accelerated reforms in the logistics ecosystem and revolutionised digital integration, skill development and infrastructure planning.\n\nStorage, multimodal connectivity, logistics capability, and last-mile connectivity have ensured that remote areas remain connected to the mainstream of development, he said, adding that penetration of e-commerce and the growing retail sector is also playing a significant role in expanding the footprint of the warehousing and logistics sector.\n\n“The Union Territory of Jammu and Kashmir is a living example of this extraordinary transformation,” the Lieutenant Governor said.\n\n“A robust storage, logistics and warehouse ecosystem is the need of the hour to propel our economy towards self-reliance, directly link the producers to consumers and to fulfil the aspiration of our traders, industrialists, farmers, artisans and MSMEs,” Sinha said.",
  "summary": "",
  "published": "Fri, 21 Nov 2025 01:08:28 +0000",
  "url": "https://indianexpress.com/article/india/in-the-works-policy-to-make-for-jammu-and-kashmir-investment-ready-10377162/",
  "source": "India | The Indian Express"
}