{
  "title": "We had to help ourselves, snowstorm survivor says",
  "text": "We had to help ourselves, snowstorm survivor says\n\n11 hours ago Share Save George Thorpe and Angela Kalwaites, South West Share Save\n\nBBC Christian Aldridge said staff at the park did not take requests for help seriously\n\nSurvivors of a snowstorm in Patagonia which killed five people including a British woman have said local authorities did not offer enough help. Victoria Bond, 40, from Cornwall, was among those killed in the tourist hotspot of Torres del Paine National Park in Chile. Christian Aldridge, who was part of Ms Bond's party, said the group had to organise their own search party to try to find her on the mountain. Chile's National Forestry Corporation had said it had ordered an internal investigation \"to determine any potential liability\". The BBC has approached Chilean authorities for further comment.\n\nAlong with Ms Bond, a public relations consultant who had worked for Visit Isles of Scilly, Chilean officials said two German and two Mexican citizens had died in the snowstorm. Their bodies were found on Tuesday.\n\nVisit Isles of Scilly Victoria Bond was killed along with four others in the storm\n\nMr Aldridge, from Newquay, said the conditions during the storm had been \"really rough and freezing\". The group he was part of had tried to keep moving, but no-one came to rescue them, he said. \"I was shocked,\" he said. \"I went and spoke to the staff personally and said, 'We're missing a friend, we think she's still on the mountain, you need to get a search party'.\" Chilean President Gabriel Boric Font said search and rescue teams had worked in \"intense\" snowfall and winds reaching 118mph (190km/h). The Chilean Forestry Corporation said its priority was to relocate people who had been on the park's O Circuit hiking route, which Ms Bond and Mr Aldridge's group were visiting.\n\nCarabineros de Chile/Reuters A snowstorm has led to search and rescue missions in the Patagonia area of Chile\n\nHowever, Mr Aldridge said park staff \"didn't seem to take it seriously\". \"They moved us aside and said they needed to check in new guests and get dinner ready,\" he said.\n\nMr Aldridge said the group ended up having to hike out of the park over three days despite being injured. \"We're sleep-deprived, shocked, traumatised, and grieving,\" he said. \"We were like, 'Why are we not getting the help? Why are we not getting evacuated from this place?'.\"\n\nSophie Collier Sophie Collier and Jack Gunter said communication within the park was poor\n\nJack Gunter and Sophie Collier, a couple from London caught up in the snowstorm, said communication from park officials had been \"absolutely horrific\". Ms Collier, originally from Devon, said people had paid a lot of money to do the trip and tickets to the park were \"harder than getting Glastonbury tickets\". \"The [Chilean] government knows people are prepared to pay the money and they're not doing anything or investing in the route or the safety of the people,\" she said. Chile's forestry corporation said it \"deeply regretted the incident and it was sending its solidarity to the families of the deceased\". It said it was reviewing \"the safety and communication protocols in the park's circuits together with the concessionaires, with the aim of strengthening prevention and emergency response capacity\".\n\nFollow BBC Cornwall on X, Facebook and Instagram. Follow BBC Devon on X, Facebook and Instagram. Send your story ideas to spotlight@bbc.co.uk.",
  "summary": "Park officials in Chile's Patagonia did not take a plea for help seriously, a survivor says.",
  "published": "Thu, 20 Nov 2025 19:18:59 GMT",
  "url": "https://www.bbc.com/news/articles/cx2y21lzzx4o?at_medium=RSS&at_campaign=rss",
  "source": "BBC News"
}