{
  "title": "Microsoft CEO Satya Nadella to employees: Must rapidly rethink AI",
  "text": "Satya Nadella Steps Back to Focus on AI: Microsoft’s Major Reorganisation Explained\n\nCloud computing shift offers blueprint for Microsoft's AI transformation\n\n\n\n\n\nMicrosoft CEO Satya Nadella fears repeating old mistakes\n\n\n\n\n\nMicrosoft CEO Satya Nadella believes the company needs to completely rethink its business model for the artificial intelligence era, turning to an executive who influenced Microsoft's cloud computing transformation 15 years ago to help navigate what he describes as a critical platform shift that could determine the tech giant's survival. Nadella appointed Rolf Harms as an advisor on AI economics, the same executive whose 2010 white paper \"Economics of the Cloud\" helped force a cultural reckoning at Microsoft and paved the way for its cloud success. In an early November memo to top Microsoft executives obtained by Business Insider, Nadella wrote that the company needs to \"rapidly rethink the new economics of AI across the company — just as we once did with the cloud\".\"This platform shift is all about building a new AI factory and family of Copilots and agents that drive diffusion and usage across the full stack,\" Nadella wrote in the memo. The move comes as AI companies face mounting questions over whether massive infrastructure investments will pay off. Microsoft took its foot off the AI spending pedal earlier this year, helping to stoke these concerns, though the company has recently doubled down through major new deals with OpenAI and Anthropic.Harms' 2010 white paper was considered a watershed moment in cloud computing, helping make the case for Microsoft's investments by showing why customers would eventually use large-scale cloud services to save money despite concerns about security and availability. At the time, people at Microsoft complained to Harms that he was \"throwing bombshells into their org,\" to which he responded: \"they're already there, I'm just helping you find them\".In a July 2025 letter to employees, Nadella acknowledged the \"uncertainty and seeming incongruence\" of thriving by objective measures while undergoing layoffs, calling it \"the enigma of success in an industry that has no franchise value\". He emphasized the need to meet changing customer needs by maintaining current business while creating new categories with new business models.The urgency reflects deeper concerns about Microsoft's long-term survival. At a September town hall, Nadella told employees he is \"haunted\" by Digital Equipment Corporation, which once ruled minicomputers but disappeared after making strategic errors. The Verge reported that Nadella warned \"some of the biggest businesses we've built might not be as relevant going forward\".Harms will continue reporting to Cloud + AI boss Scott Guthrie while working closely with Nadella and top executives, advising them on adapting to AI's new economics, from infrastructure to platform technology and applications. In his annual letter, Nadella reframed Microsoft's mission from building a \"software factory\" to becoming an \"intelligence engine\" that empowers everyone to create their own tools.Microsoft declined to comment when asked about the memo.",
  "summary": "Microsoft CEO Satya Nadella has appointed Rolf Harms, the executive behind the influential 2010 \"Economics of the Cloud\" white paper, to help rethink Microsoft's business model for the AI era. In an internal memo obtained by Business Insider, Nadella emphasized the need to rapidly transform the company's approach to AI economics, similar to its cloud computing pivot 15 years ago. The move reflects Nadella's concerns about Microsoft's survival in the AI era, as he warned employees that some of the company's biggest businesses may become irrelevant without fundamental changes.",
  "published": "Thu, 20 Nov 2025 10:16:53 +0530",
  "url": "https://timesofindia.indiatimes.com/technology/tech-news/microsoft-ceo-satya-nadella-to-employees-in-internal-memo-we-need-to-rapidly-rethink-the/articleshow/125453240.cms",
  "source": "Times of India"
}