{
  "title": "Researchers develop recyclable, healable electronics",
  "text": "Between upgrades and breakdowns to cellphones, tablets, laptops, and appliances, so many electronics are getting tossed in the trash that they've taken on a name of their own: e-waste.\n\nAccording to a 2024 report issued by the United Nations, the amount of e-waste worldwide has almost doubled in the past 12 years, from 34 billion to 62 billion kilograms -- the equivalent of 1.55 million shipping trucks -- and it's estimated to hit 82 billion kilograms by 2030. Just 13.8 billion kilograms -- about 20 percent of the total -- is expected to be recycled, a number projected to remain flat.\n\nPut simply, we're throwing away more and more electronics, and recycling isn't keeping up. But a new study in Advanced Materials by two Virginia Tech research teams offers a potential solution to the e-waste problem: a recyclable material that could make electronics easier to break down and reuse.\n\nChemistry and engineering have an answer\n\nMichael Bartlett, associate professor of mechanical engineering, and Josh Worch, assistant professor of chemistry, come from different fields, but together they created a new class of circuit materials. With significant work from their team of postdoctoral and graduate student researchers, including Dong Hae Ho, Meng Jiang, and Ravi Tutika, the new circuits are recyclable, electrically conductive, reconfigurable, and self-healing after damage. Yet they retain the strength and durability of traditional circuit board plastics -- features rarely found together in a single material.\n\nThe new material starts with a vitrimer, a dynamic polymer that can be reshaped and recycled. This versatile material is combined with droplets of liquid metal that do the work of carrying the electric current, the way rigid metals do in a traditional circuit.\n\nThis is a fundamentally different approach from other recyclable or flexible electronics. By combining the high-performance, adaptable polymers with electrically conductive liquid metals, the new circuit holds up under a host of challenges.\n\n\"Our material is unlike conventional electronic composites,\" said Bartlett. \"The circuit boards are remarkably resilient and functional. Even under mechanical deformation or damage, they still work.\"\n\nA second life\n\nRecycling traditional circuit boards involves several energy-intensive deconstruction steps and still yields large amounts of waste. Billions of dollars of valuable metal components are lost in the process.\n\nRecycling the team's circuit board is straightforward and can be accomplished in multiple ways.\n\n\"Traditional circuit boards are made from permanent thermosets that are incredibly difficult to recycle,\" said Worch. \"Here, our dynamic composite material can be healed or reshaped if damaged by applying heat, and the electrical performance will not suffer. Modern circuit boards simply cannot do this.\"\n\nThe vitrimer circuit boards also can be deconstructed at their end of life using alkaline hydrolysis, enabling recovery of key components such as the liquid metal and LEDs. Fully reusing all components of the conductive composites in a closed-loop process remains a goal for future research.\n\nWhile it may not be possible to curb the amount of electronics that are discarded by the world's consumers, this work represents a key step toward keeping more electronics out of landfills.\n\nThis research was supported by Virginia Tech through the Institute for Critical Technology and Applied Science and Bartlett's National Science Foundation Early Faculty Career Development (CAREER) award.",
  "summary": "Electronics often get thrown away after use because recycling them requires extensive work for little payoff. Researchers have now found a way to change the game.",
  "published": "Mon, 02 Jun 2025 19:04:34 EDT",
  "url": "https://www.sciencedaily.com/releases/2025/06/250602190434.htm",
  "source": "Latest Science News -- ScienceDaily"
}