{
  "title": "Neo-Nazi member refused bail after allegedly sending ‘menacing message’ about federal MP Allegra Spender",
  "text": "A member of an active neo-Nazi group who allegedly harassed a politician who condemned a recent neo-Nazi protest has been refused bail and will remain in custody due to risks he could commit a “dangerous” offence.\n\nJoel Davis, a 30-year-old from the Sydney suburb of Bondi who is a member of the National Socialist Network, was arrested by the Australian federal police on Thursday after he was accused of sending a “menacing message”.\n\nThe messages allegedly encouraged abusive and hateful messages to be directed towards the MP for Wentworth, Allegra Spender after she condemned a neo-Nazi rally held outside the New South Wales parliament earlier this month.\n\nThe Australian federal police made two further arrests under the same police operation on Friday, after one man allegedly harassed a different federal MP and another man allegedly harassed an “Australian high-office holder”. Guardian Australia understands that only one of these men has neo-Nazi links.\n\nDavis appeared on camera from custody before the NSW bail division on Friday and was represented by Legal Aid lawyer Liam McKibbin.\n\nMagistrate Daniel Covington said he would refuse Davis’s application for bail and remand Davis in custody because of the risk he could commit a “dangerous” offence while on bail.\n\nHe said due to suggestions of the “ideology” that Davis follows, it would be “difficult for me on balance to think he wouldn’t continue to commit a serious offence if bail was granted today”.\n\nHe noted Davis did not have a violent history and only an unrelated offence in NSW in 2014.\n\nMcKibbin had argued that Davis should be granted bail because his partner is nine months pregnant with their son and had been due on Thursday.\n\nHe also argued Davis is unlikely to face the maximum penalty for the one charge he is facing of using a carriage service to menace, harass or cause offence, and which carries a maximum penalty of five years in prison.\n\n“[The] allegation does not include a physical threat of violence, not withstanding the alleged disturbing conduct,” McKibbin told the court.\n\nCovington later noted the message included threats to Spender that included sexual violence.\n\nSpender had condemned the police-authorised neo-Nazi protest that was held outside NSW parliament earlier this month and was attended by about 60 black-clad men who held up a sign that said “Abolish the Jewish lobby” and chanted a Hitler Youth slogan.\n\nProsecutor Kristen Wakefield said Davis should not get bail. She told the court that Davis was already on bail for an alleged offence committed in South Australia and there was a risk he wouldn’t appear for future court dates if he was bailed again.\n\nShe said the “victim expressed concern for the safety of her family and herself”.\n\nWakefield said: “There was a comment directed at a wider audience which elevated the seriousness of this offence” and alleged that he was “encouraging a wider audience to engage in the violence against the victim”.\n\nWakefield then said: “Telegram itself has an extremely wide audience … It would be very difficult to ensure that further offending through Telegram or at some other similar social media platform didn’t occur.”\n\nskip past newsletter promotion Sign up to Breaking News Australia Free newsletter Get the most important news as it breaks Enter your email address Sign up Privacy Notice: Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on theguardian.com to send you this newsletter. You can complete full registration at any time. For more information about how we use your data see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nMcKibbin had offered bail conditions that included Davis not going within 100 metres of the Wentworth electorate office, and only carrying one mobile phone which he would allow to be checked.\n\nThe court heard Davis had been employed in retail in Sydney until last week. He moved to Sydney three months ago to be with his pregnant partner.\n\nOn Friday, the Australian federal police confirmed there had been two additional arrests by a national security investigation team that was set up to “target groups and individuals causing high levels of harm to Australia’s social cohesion, including the targeting of federal parliamentarians”.\n\nThis included a 32-year-old Melbourne man who allegedly threatened another federal MP, and a third 29-year-old Tamworth man who allegedly sent online threats to an “Australian high office holder”.\n\nThe AFP has not revealed the identity of the two men arrested on Friday.\n\nThe Melbourne man was also charged with using a carriage service to harass a federal parliamentarian after seizing his electronic devices. He will appear before court next Thursday.\n\nThe parliamentarian’s electoral office had reported to the AFP after the man allegedly sent multiple harassing emails before escalating to an abusive phone call, which included hateful and menacing rhetoric.\n\nThe Tamworth man will face a number of charges when he appears in court in January, including four counts of using a carriage service to harass, one count of unauthorised possession of a prohibited firearm, one count of not safely keeping a firearm and one count of possessing ammunition without a licence or permit.\n\n\n\nOn Saturday, the AFP searched a Tamworth home, where they seized a rifle and ammunition.\n\nDavis is due to appear before court again in December.",
  "summary": "<p>Magistrate refuses Davis’s application for bail because of risk he could commit a ‘dangerous’ offence</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/nov/21/australia-news-live-mark-dreyfus-republic-anthony-albanese-g20-south-africa-eu-trade-deal-nt-cyclone-darwin-airlines-powerbank-ban-nsw-politics-leadership-kellie-sloane-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>A member of an active neo-Nazi group who allegedly harassed a politician who condemned a recent neo-Nazi protest has been refused bail and will remain in custody due to risks he could commit a “dangerous” offence.</p><p>Joel Davis, a 30-year-old from the Sydney suburb of Bondi who is a member of the National Socialist Network, was arrested by the Australian federal police on Thursday after he was accused of sending a “menacing message”.</p> <a href=\"https://www.theguardian.com/australia-news/2025/nov/21/neo-nazi-group-member-joel-davis-refused-bail-ntwnfb\">Continue reading...</a>",
  "published": "Fri, 21 Nov 2025 05:30:01 GMT",
  "url": "https://www.theguardian.com/australia-news/2025/nov/21/neo-nazi-group-member-joel-davis-refused-bail-ntwnfb",
  "source": "World news | The Guardian"
}