{
  "title": "Some people 'not ready for black superstar' like Bellingham - Wright",
  "text": "Bellingham's stature has grown remarkably since he left Birmingham City in 2020 for German club Borussia Dortmund and joined Real Madrid three years later in a deal worth up to 133.9m euros (£115m).\n\nHe won a La Liga and Champions League double in his first year at the Bernabeu, scoring 23 times and providing 13 assists.\n\nAt Euro 2024, he helped Gareth Southgate's side into the quarter-finals, scoring a brilliant overhead kick in the 95th minute to force extra time against Slovakia.\n\nFormer England defender and coach Gary Neville, a fellow pundit on the show, said Raheem Sterling felt he was unfairly targeted by the media when he worked with the Chelsea winger at Euro 2016.\n\nIn 2018, Sterling - who won the last of his 82 caps at the 2022 World Cup - questioned the portrayal of black footballers in national newspapers and accused them of feeding prejudice.\n\nAsked if there were similarities, Wright - Arsenal's second-highest goalscorer behind Thierry Henry - added: \"I don't think they're ready for a black superstar, who can move like Jude is moving. They can't touch him.\n\n\"He goes out there, he performs, he does what he does.\n\n\"It's too uppity for these people. I'll put it in football terms. They all love N'Golo Kante. He's a humble black man, gets on with what he's doing.\n\n\"But if you get a [Paul] Pogba, or a Bellingham, and you get that kind of energy, that does not sit well with people. So someone like Jude, for some reason, frightens these people because of his capability and the inspiration he can give.\"\n\nBellingham was left out of England's October squad to face Wales and Latvia in October, before returning for this month's qualifiers against Serbia and Albania.\n\nHe came on after 65 minutes against Serbia and was replaced after 84 minutes by Morgan Rogers against Albania.\n\n\"I think to a certain degree, if you have players like Jude, who are so competitive, they will never like it [being substituted],\" said Tuchel.\n\n\"But he has to accept it. We are about standards and level, and commitment to and respect to each other, so someone is waiting outside, and we will not change our decision just because someone is waving their arms.\"\n\nBukayo Saka, Marcus Rashford and Jadon Sancho were racially abused on social media after the trio missed penalties in the Euro 2021 final defeat by Italy at Wembley.\n\nA mural of Rashford, who led a campaign against the government's plans to scrap free school meals out of term time, was defaced in south Manchester following the final.\n\n\"If you are outspoken, black, and playing to that kind of level and not caring, that frightens certain people,\" said Wright, who scored nine goals in 33 England appearances.",
  "summary": "Former England striker Ian Wright does not think some people are \"ready for a black superstar\" following the media treatment of Jude Bellingham.",
  "published": "Thu, 20 Nov 2025 14:41:12 GMT",
  "url": "https://www.bbc.com/sport/football/articles/ckgkg1d49v7o?at_medium=RSS&at_campaign=rss",
  "source": "BBC Sport"
}