{
  "title": "Australia news live: Darwin warned Tropical Cyclone Fina will strike tomorrow with destructive wind gusts up to 150km/h possible",
  "text": "From 1h ago 04.40 GMT Darwin warned Tropical Cyclone Fina will strike tomorrow In the Northern Territory, authorities are giving an update on Tropical Cyclone Fina. They say the worst of the conditions in Darwin are expected to be during the day tomorrow and tomorrow evening. There may be … periods during the day where conditions seem to ease, and this is typical during a cyclone event, but it will be temporary, so do not assume that the danger has passed until you have been advised that it has. Share Updated at 04.48 GMT\n\n10m ago 05.53 GMT Jonathan Barrett ‘Santa rally’ in doubt after ASX plunge Australian shares recorded steep losses today, as renewed fears of an artificial intelligence-fuelled bubble gripped markets around the world. The benchmark S&P/ASX 200 fell 1.6% to 8,416.5 points, erasing more than $40bn in value from the index. While the Australian market rose from its earlier lows, the bounce was modest, signalling fear among traders. Tony Sycamore, market analyst at IG Australia, says there are “clear question marks circling now around the extent of any Santa rally and which sector will lead it, with Christmas now just under five weeks away”. The “Santa rally” and “January effect” refer to a period when stock markets tend to rise, especially after a strong year. The ASX has now recorded its fourth straight weekly loss. The plunge occurred even after the world’s biggest company, chip maker Nvidia, released a soaring profit result and upbeat outlook that initially sparked a recovery in global markets. But lingering concerns Wall Street may be engulfed by a bubble reversed the sentiment. Traders have also lost confidence the US Federal Reserve will deliver a rate cut in December amid rising inflation concerns; the same dynamic that has dimmed hopes for further cuts in Australia. Just eight out of Australia’s biggest 50 listed companies eked out share price gains today, with miners among the most heavily sold-off companies. Share\n\n18m ago 05.46 GMT Anne Ruston criticises government over bulk-billing rates The shadow health minister, Anne Ruston, has been speaking on Afternoon Briefing about bulk-billing rates. She said: We have a government … [that] promises to Australians for the last three years, telling them all they will need is their Medicare card, when quite frankly the government has always known out-of-pocket costs were on the rise and likely to continue to rise into the future. Nearly a million less visits to a doctor year-on-year for the same quarter last year to this year … 10,000 visitors less every day. 10,000 people are avoiding seeing their doctor, which means they are likely to be sick before they engage with the health system. And we have a prime minister who can’t negotiate the hospital funding agreement, which is where these people are ending up. View image in fullscreen Shadow health minister Anne Ruston. Photograph: Mick Tsikas/AAP Share Updated at 05.57 GMT\n\n36m ago 05.27 GMT Share market falls to lowest level since June From AAP: Australia’s share market has crumbled to its lowest level since June, as concerns about stretched valuations collide with a reduced outlook for interest rate cuts. The benchmark S&P/ASX 200 lost 133.9 points on Friday, down 1.57% to 8,418.8, as the broader All Ordinaries fell 144.9 points (1.64%) to 8,689.1. A stronger-than-expected US jobs report overnight dampened hopes of incoming interest rate cuts from the world’s largest central bank, dragging on equities markets. The top-200 has tumbled more than 7% after hitting an all-time high of 9,115.2 in mid-October, and has fallen each of the past four weeks. The Australian dollar is buying 64.46 US cents, down from 64.79 US cents on Thursday at 5pm. Share Updated at 05.58 GMT\n\n1h ago 05.02 GMT Nick Greiner congratulates Kellie Sloane, calling for ‘a unified approach’ from the party The chair of the NSW Liberal party management committee, Nick Greiner, has welcomed Kellie Sloane’s unanimous election as the NSW leader. In a statement, Greiner said: I congratulate Kellie on her election. She has always been driven by community service – from her almost 20 years in journalism to her work as the National CEO of Life Education – striving to deliver real change for our community. Liberal Party members across the state are behind Kellie, as the parliamentary and volunteer wings of our Party work together towards a Liberal election victory that will deliver a thriving NSW. Now is the time for a unified approach behind Kellie and Natalie Ward to ensure the Party looks outward and forward as an alternative government with a laser focus on winning in 2027. View image in fullscreen Newly elected NSW Liberal leader Kellie Sloane. Photograph: Bianca De Marchi/AAP Share Updated at 06.02 GMT\n\n1h ago 04.52 GMT Engels: There will be rain and wind prior to the cyclone. Do not drive in flooded water conditions. Let’s all together use our common sense and stay safe. Share Updated at 04.54 GMT\n\n1h ago 04.51 GMT Engels says when the storm impacts are starting to be felt in Darwin, residents are asked to park their cars, find shelter and stay there until it has passed. She said businesses in Darwin may close tomorrow and buses will not be running. We expect to tell Darwin residents to take shelter tomorrow. Based on the information we have, we are comfortable that your homes are able to withstand the event. If you have concerns, we ask you to go and find somewhere that you feel safe to shelter. Share Updated at 04.52 GMT\n\n1h ago 04.48 GMT Supt Kirsten Engels is speaking now. Cyclone Fina is beginning to show their presence on the northern islands now. Schools in Minjilang and Warruwi and Milikapiti have all been closed today. Tomorrow we expect to see impacts starting to be felt in the Darwin area. We are standing up an emergency hotline 1800 88 901, and that will be available from this afternoon. She says residents of Minjilang and Warruwi and the Tiwi Islands have been asked to pick their place of shelter and be there before dark. She said these communites are used to these events and are prepared and ready. Share Updated at 04.51 GMT\n\n1h ago 04.44 GMT A flood watch is current for much of the Top End, and daily rainfall is expected of up to 200mm or more. A storm tide of about 1 metre above the highest tide is expected around Minjilang and could be above normal in other coastal communities over the next few days. Share Updated at 05.14 GMT\n\n1h ago 04.41 GMT Destructive wind gusts of 150km an hour could develop during this evening in this warning area as the system nears the coast. After this, the wind is expected to hit 120km an hour in the warning area. Share\n\n1h ago 04.40 GMT Darwin warned Tropical Cyclone Fina will strike tomorrow In the Northern Territory, authorities are giving an update on Tropical Cyclone Fina. They say the worst of the conditions in Darwin are expected to be during the day tomorrow and tomorrow evening. There may be … periods during the day where conditions seem to ease, and this is typical during a cyclone event, but it will be temporary, so do not assume that the danger has passed until you have been advised that it has. Share Updated at 04.48 GMT\n\n2h ago 04.15 GMT Victoria’s St Vincent de Paul chief: ‘warning signs of this hunger crisis are clear’ The St Vincent de Paul Society Victoria has opened a new facility in the south-east of Melbourne, in response to the surge in demand for food relief. The City of Greater Dandenong, where the new facility will be, has the highest level of homelessness in Victoria, with up to one in five people and one in four children living in poverty. In the last financial year alone, Vinnies South Eastern and Berwick soup vans provided over 81,500 meals, and the South Eastern service saw a massive 22% increase in demand. St Vincent de Paul Society Victoria CEO Jennifer Fitzgerald: The warning signs of this hunger crisis are clear across Victoria: more households are skipping meals to pay rent, and the calls for help are loudest from the south-east – and it’s no longer just the homeless or unemployed, it’s increasingly the working person, the single mum. This hub is a lifeline. We’re not just handing out food; we’re upholding a person’s dignity and providing a stable base for community connection. Share Updated at 04.29 GMT\n\n2h ago 04.05 GMT Nick Visser That’s all for me! Cait Kelly is going to bring Friday home. Have a lovely weekend. Share\n\n2h ago 03.52 GMT Adeshola Ore Man becomes first to be convicted of hate speech against trans people in NSW A New South Wales man who called for violence and created an “invitation on social media for a genocide” has become the state’s first person to be convicted of hate speech against transgender people. Thomas Fordham, 27, was on Wednesday sentenced to a 12-month community correction order for the offence in Sydney’s central local court, with magistrate Christopher Halburd acknowledging his “multitude” of mental health conditions. According to court documents, Fordham posted a series of comments on YouTube accounts, including some videos by the American influencer and transgender activist Mercury Stardust, between March to May 2024. The comments were in response to videos about LGBTIQ+ issues. Read more: Man becomes first to be convicted of hate speech against trans people in NSW Read more Share Updated at 03.54 GMT\n\n3h ago 03.32 GMT Tom McIlroy Government drops proposal to reduce default regional speed limits The federal government has dropped a controversial proposal to reduce default speed limits on regional roads from 100km/h to between 70 and 90km/h, following a backlash from some Labor and Coalition MPs. Back in September, the federal infrastructure department began consultation on a “regulatory impact analysis” as part of the National Road Safety Action Plan. Noting that it is up to individual states and territories to implement their own road rules, Labor MPs called the consultation “overreach”, while Nationals and Liberals slammed any move to force lower speed limits. View image in fullscreen Photograph: Chris Gordon/Getty Images The analysis was part of the National Road Safety Strategy 2021-2030, agreed to by state, territory and commonwealth governments in May 2021. The plan aims to reduce road fatalities by 50% and reduce serious injuries by 30% by 2030, and cut fatalities and serious injuries to zero by 2050. The latest analysis states the country is not on track to meet those goals and needs further government intervention. After a meeting with her counterpart ministers from around the country on Friday, federal infrastructure and transport minister Catherine King called time on the default speed limits consultation work. “Ministers noted recent feedback from consultation on open road default speed limits that has been in the National Road Safety Strategy since 2018,” a joint statement said. It went on: Ministers noted the commonwealth does not set speed limits in any jurisdiction, and that states and territories are responsible for these decisions. No further work is being undertaken on open road default speed limits. Share Updated at 03.36 GMT\n\n3h ago 03.12 GMT What to expect from Tropical Cyclone Fina Petra Stock Tropical Cyclone Fina, currently a category one cyclone, is expected to intensify over coming days as it moves through the Van Diemen Gulf and could reach category three as it heads into the Timor Sea, according to the latest track map from Bureau of Meteorology. Senior meteorologist Sarah Scully said Fina was expected to cross the Northern Territory’s Cobourg Peninsula near Cape Don later tonight or in the early hours of tomorrow morning, and then continue its south-west path. ⚠️🌀Tropical #CycloneFina is impacting the Cobourg Peninsula, extending to other parts of the northwest Top End today and on Saturday.\n\n\n\nWarning zone: Tiwi Islands, Dundee Beach to Warruwi, and inland to Batchelor, including #Darwin.\n\n\n\nLatest track map: https://t.co/sUS8eqwtb5 pic.twitter.com/zfVQVq4Sz2 — Bureau of Meteorology, Northern Territory (@BOM_NT) November 21, 2025 Winds were expected to pick up in Darwin from Saturday morning, peak during the afternoon and evening, and continue into Sunday morning, as TC Fina pushes past the city. Scully said: Then it’s expected to continue moving out into the Timor Sea and intensify further to a category three system as it starts to approach the Kimberley coast. Areas across the western Top End, including Darwin, could see winds of up to 155km/h, heavy rainfall (including the potential for 24-hour totals of 200-300mm) with flash flooding, and the potential for storm surge. Share Updated at 03.16 GMT\n\n3h ago 02.51 GMT Amanda Meade ABC staff vote no on enterprise agreement offer Staff at the ABC have voted no to an enterprise agreement offer of a 10% pay rise over three years and commitments to pay progression. Media, Entertainment & Arts Alliance (Meaa) chief executive Erin Madeley claimed it was a “backwards offer” which would “cut job security and access to career progression”. Staff also rejected an offer of 9% over three years last month. Madeley said the offer ignored staff calls for ethical and accountable use of AI in the workplace, respect for the Meaa journalist code of ethics, and an audit into racial and disability pay gaps. Madeley added: We applaud the brave and principled Meaa members at the ABC, who will not back down in their fight for workers’ rights, journalism and a sustainable national broadcaster. An ABC spokesperson said the preliminary outcome shows the majority of ABC staff voted against the EA offer, with 44.1% of staff voting yes and 55.9% voting no. “This is 238 votes short of the required number of votes to have a majority agree to the proposal. We anticipate CorpVote will declare the official outcome next week,” the spokesperson said. Information about next steps ahead of the resumption of bargaining will be communicated to ABC staff in the next couple of weeks. The ABC MEAA house committee said the offer won’t keep up with inflation. Share Updated at 02.53 GMT\n\n3h ago 02.35 GMT Twitch included in under-16s social media ban Josh Taylor The eSafety commissioner has added video streaming platform Twitch to the list of platforms that will be required to ban under-16s in Australia from having an account in less than three weeks. In a statement on Friday, the regulator said it had informed Twitch it was covered by the ban and must take reasonable steps to stop under-16s from holding an account by 10 December, because its dominant purposes is social interaction. eSafety said: Twitch is a platform most commonly used for livestreaming or posting content that enables users, including Australian children, to interact with others in relation to the content posted. View image in fullscreen Photograph: Lionel Bonaventure/AFP/Getty Images Pinterest has been informed it is not included in the ban because its common purpose is for users collating images for inspiration and idea curation.\n\n\n\nTwitch joins Facebook, Instagram, Kick, Reddit, Snapchat, TikTok, X and YouTube to be covered by the ban. Threads is also included in the ban as an Instagram account is needed to use the Twitter-like platform.\n\n\n\neSafety said this is the last assessment planned before the ban comes into effect. Share Updated at 03.12 GMT\n\n4h ago 02.21 GMT Petra Stock Bureau of Meteorology issues cyclone warning for large parts of the Top End including Darwin Tropical Cyclone Fina was likely to cross the Northern Territory coast either very late on Friday or early Saturday, according to the Bureau of Meteorology. The Bureau of Meteorology has issued a cyclone warning for the Tiwi Islands, and from Darwin to Warruwi. This includes Cobourg Peninsula, Minjilang and Gunbalanya, and also Pirlangimpi, Milikapiti and Wurrumiyanga. The system is currently a category one cyclone, but is expected to re-intensify to category two as it makes landfall. There remains a chance it could reach category three as it moves into the Van Diemen Gulf. View image in fullscreen Photograph: Lloyd Jones/AAP Fina is likely to cross at the Cobourg Peninsula near Cape Don, with rain already building at Croker Island, off the Northern Territory coast. The Northern Territory Emergency Service has advised those in affected areas to prepare for the risk of destructive winds, torrential rain, dangerous storms and coastal flooding, with potential disruption to essential services. Residents in Milikapiti to Maningrida, including Cobourg Peninsula, Minjilang and Warruwi were asked to enact their emergency plans and secure their properties. Those in affected areas -Daly River Mouth to Gunbalanya, including Dundee Beach, Darwin, Batchelor, Pirlangimpi and Wurrumiyanga (Tiwi Islands) – have been advised to prepare emergency plans and kits and stay informed. Share Updated at 03.13 GMT",
  "summary": "<p>Follow today’s news live</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/2025/nov/21/wieambilla-qld-police-shooting-inquest-coroner-report-findings-queensland-ntwnfb\">Wieambilla police shooting not ‘terrorism’ but driven by Train family’s shared ‘delusions’, Queensland coroner finds</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p><strong>Government urging those in Fina’s path to stay up-to-date and heed warnings</strong></p><p><strong>Kristy McBain</strong>, the federal minister for emergency management, said officials are urging people to “prioritise their safety” and heed cyclone warnings and advice.</p><p>We’ve been working really closely with the Northern Territory government on the pre-deployment of assets, but it is really important that people listen to those warnings and they’ll be continually updated. … But these things are a little bit unpredictable at this stage. So we’re just asking people to be aware.</p><p>Fina is forecast to further intensify to a severe tropical cyclone during Sunday afternoon in the southern Timor Sea. There continues to remain a chance that it could reach category 3 intensity earlier, during late Friday or early Saturday as it moves into the Van Diemen Gulf.</p> <a href=\"https://www.theguardian.com/australia-news/live/2025/nov/21/australia-news-live-mark-dreyfus-republic-anthony-albanese-g20-south-africa-eu-trade-deal-nt-cyclone-darwin-airlines-powerbank-ban-nsw-politics-leadership-kellie-sloane-ntwnfb\">Continue reading...</a>",
  "published": "Fri, 21 Nov 2025 05:50:20 GMT",
  "url": "https://www.theguardian.com/australia-news/live/2025/nov/21/australia-news-live-mark-dreyfus-republic-anthony-albanese-g20-south-africa-eu-trade-deal-nt-cyclone-darwin-airlines-powerbank-ban-nsw-politics-leadership-kellie-sloane-ntwnfb",
  "source": "World news | The Guardian"
}