{
  "title": "Spain's attorney general convicted in controversial leak case",
  "text": "Spain's attorney general convicted in controversial leak case\n\nThe trial of García Ortiz fuelled already acrimonious relations between the left-wing government of Prime Minister Pedro Sánchez and right-wing opposition.\n\nThe court handed him a two-year ban from the post and a fine of €7,200 (£6,438). He must also pay €10,000 to Mr González Amador as compensation.\n\nThe Supreme Court found that García Ortiz had unlawfully revealed details of the tax status of businessman Alberto González Amador, boyfriend of a senior conservative politician.\n\nSpain's Attorney General, Álvaro García Ortiz, has been forced to step down after being found guilty of revealing confidential information in a deeply controversial case, which accentuated the country's political division.\n\nTheir contrasting positions were underlined by reactions to the conviction.\n\n\"Sánchez must apologise to Spaniards, resign and call elections, in that order,\" said Ester Muñoz, spokeswoman for the conservative People's Party.\n\nThe government said it did not agree with the ruling but respected it and would proceed with the appointment of a new attorney general.\n\nHowever, a number of politicians on the left expressed outrage at what they saw as a politically motivated ruling.\n\nHealth Minister Mónica García, of the Sumar party, said the conviction dealt a \"lethal blow to [the concept of] presumption of innocence\" and threw ordinary Spaniards \"under the bus\" when it came to the rule of law.\n\nThe complex case dates back to March 2024, when the attorney general's office issued a press release stating that Mr González Amador had requested a plea bargain after being found to have evaded tax payments worth €350,951.\n\nThe document corrected mistaken press reports stating that the attorney general's office had proposed the bargain.\n\nThe source of the incorrect reports was the head of communications of the conservative regional president of Madrid, Isabel Díaz Ayuso. Ms Díaz Ayuso is the partner of Mr González Amador.\n\nMr González Amador filed a complaint against the attorney general, claiming his privacy had been breached. The case against García Ortiz also saw him accused of leaking information about the affair to the media. Prosecutors pointed to the attorney general's decision to change his phone as incriminating.\n\nHowever, there was no direct evidence linking García Ortiz to the leak and several journalists testified during the trial that he had not been the source of their information. Regarding the press statement, the attorney general said he was simply correcting the erroneous reports.\n\nGarcía Ortiz can appeal against the ruling.\n\nThis comes as a severe blow for the prime minister, who has been under judicial pressure on various fronts.\n\nHis brother is due to go on trial for influence peddling, his wife is under investigation for her business activities and two former senior figures in the Socialist Party, José Luis Ábalos and Santos Cerdán, are accused of overseeing a massive kickback scheme.",
  "summary": "Álvaro García Ortiz is barred from the post for two years and must pay €10,000 in compensation.",
  "published": "Thu, 20 Nov 2025 17:27:58 GMT",
  "url": "https://www.bbc.com/news/articles/cly4ypj92j9o?at_medium=RSS&at_campaign=rss",
  "source": "BBC News"
}