{
  "title": "Congress questions PM Modi, EAM Jaishankar as US report claims ‘Pakistan’s military success’ against India",
  "text": "The Congress party on Thursday mounted a fresh attack on the Centre, questioning Prime Minister Narendra Modi and External Affairs Minister S Jaishankar’s diplomacy policy. The Congress cited the 2025 US-China Economic and Security Review Commission report and said: “Our diplomacy has received yet another serious blow.”\n\nThe 2025 US-China Economic and Security Review Commission report that was submitted to the US Congress on Wednesday mentioned that China and Pakistan participated in multinational AMAN drills, “highlighting China’s and Pakistan’s growing defence cooperation”. “India’s commentators viewed the drills as losses in their relationship with China and as direct security threats to its territorial positions.”\n\nIt further said: “Pakistan’s military success over India in its four-day clash showcased Chinese weaponry. While characterization of this conflict as a “proxy war” may overstate China’s role as an instigator, Beijing opportunistically leveraged the conflict to test and advertise the sophistication of its weapons, useful in the contexts of its ongoing border tensions with India and its expanding defense industry goals.”\n\nStory continues below this ad\n\nThe US report, claiming “Pakistan’s military success”. The US report, claiming “Pakistan’s military success”.\n\nThe Congress party has pointed out this portion and questioned the Centre. The party said such assertions were “absolutely unacceptable for India”. “Will the Prime Minister and the Ministry of External Affairs raise objections and register a protest on this? Our diplomacy has received yet another serious blow,” the party’s Rajya Sabha MP Jairam Ramesh said on X.\n\nअमेरिका की यूएस-चाइना इकोनॉमिक एंड सिक्योरिटी रिव्यू कमीशन ने अभी-अभी अपनी वार्षिक रिपोर्ट अमेरिकी कांग्रेस को सौंपी है। अमेरिकी सीनेट और हाउस ऑफ रिप्रेज़ेंटेटिव्स द्वारा संयुक्त रूप से बनाई गई इस कमीशन में बारह स्वतंत्र सदस्य होते हैं। 2025 की यह वार्षिक रिपोर्ट लगभग 800 पन्नों… pic.twitter.com/IIPxXq1Rb7 — Jairam Ramesh (@Jairam_Ramesh) November 20, 2025\n\nTrump claims PM Modi phoned in to call off ‘war’ after tariff threat\n\nJust hours after the release of the 2025 US-China Economic and Security Review Commission report, US President Donald Trump said that he threatened Pakistan and India with tariffs. “The Prime Minister of Pakistan [Shehbaz Sharif] called me and said ‘Thank you very much’. He said: ‘President Trump saved millions of lives’. I got a call from Prime Minister Modi, saying ‘we’re done’. I ask: ‘you’re done with what?’. ‘We’re not going to go to war’.” Trump said this at the US-Saudi investment forum, where Saudi Arabian crown Prince Mohammed bin Salman Al Saud was present.\n\nPointing to this part of his speech, Jairam Ramesh posted on X: “The US President reiterated for the 61st time his claim that he ended Operation Sindoor by threatening to impose a 350% tariff on India.”\n\nIndia has consistently maintained that it has never relented to any tariff threats to call off the Operation Sindoor offensive against Pakistan. India has said that the US had no role to play in the ceasefire that followed Operation Sindoor and that it was a completely independent decision.",
  "summary": "",
  "published": "Thu, 20 Nov 2025 08:41:47 +0000",
  "url": "https://indianexpress.com/article/india/congress-pm-modi-jaishankar-us-report-pakistan-military-success-india-10375710/",
  "source": "India | The Indian Express"
}