{
  "title": "What happened to last year's AFC juggernauts? Chiefs, Ravens and Texans are all 5-5",
  "text": "Open Extended Reactions\n\nThere has been a surprising balance of power shift in the AFC this season, leaving some defending division champions with plenty of work to do in order to reach the postseason.\n\nLast season, the four division winners from the AFC -- Kansas City Chiefs, Baltimore Ravens, Houston Texans and Buffalo Bills -- were the last teams standing in the playoffs from the conference. Now, entering Week 12, none of them leads its division, and the Chiefs, the Ravens and the Texans all share disappointing 5-5 records and would not qualify for the playoffs if the season ended today.\n\n\"Our heads are just above water,\" Ravens coach John Harbaugh said, extending his neck upward. \"We're just above water; we're breathing.\"\n\nThe teams that are thriving in the AFC are the New England Patriots (9-2), who have found their franchise quarterback in Drake Maye; the Denver Broncos (9-2), who strike fear with a relentless pass rush; and the Indianapolis Colts (8-2), who continue to lean on the NFL's most productive running back in Jonathan Taylor.\n\nKansas City, Baltimore and Houston are essentially in survival mode for the final seven weeks. Entering this season, of the 989 teams in the Super Bowl era to start 5-5 or worse through 10 games, only 89 of them (9%) went on to make the playoffs, according to ESPN Research.\n\n\"We know what we need to clean up, and we need to do it,\" Chiefs coach Andy Reid said. \"But the guys, they get it. Some of these guys have been through some pretty good seasons, and it isn't like this one's lost. We just got to clean up a few of these things -- and the urgency level, obviously, we got to make sure we take care of that now.\"\n\nThe Ravens, winners of four straight, have a 63.9% chance of making the playoffs, according to ESPN's Football Power Index.\n\nThe Chiefs, who are off to their worst start since Patrick Mahomes became their starting quarterback in 2018, have a projected chance of 53.8% to qualify for the postseason.\n\nOf the AFC teams that captured division titles last season, the Texans have the biggest uphill climb for a playoff berth with a 23.4% chance. Houston coach DeMeco Ryans doesn't believe the standings mean much at this point.\n\n\"What matters is, however the standings look, I know what improves the standings is winning,\" Ryans said. \"So, my focus is on doing everything I can possibly do to help our team be in position to win this game this week. The standings and all those things, they will take care of themselves.\"\n\nESPN NFL Nation reporters Nate Taylor (Chiefs), Jamison Hensley (Ravens) and D.J. Bien-Aime (Texans) weigh in on what lies ahead for these three teams.\n\nChances to win division: 61%\n\nChances to make playoffs: 63.9%\n\nRemaining strength of schedule: 22nd\n\nWhat's the biggest reason for the 5-5 record?\n\nThe Ravens' defense failed to step up against top competition early on, allowing an NFL-worst 32.3 points per game during a 1-5 start. Mahomes, Josh Allen, Jared Goff and C.J. Stroud combined for 11 touchdown passes and no interceptions against Baltimore. However, the Ravens' D has turned the team's season around ever since, holding foes to less than 20 points in each of its four straight victories.\n\nWhat needs to happen to make the playoffs?\n\nLamar Jackson and Baltimore need to continue to take care of business in the AFC North. Four of the Ravens' final six games are against the Pittsburgh Steelers and the Cincinnati Bengals. Since the start of the 2022 campaign, Jackson is 7-2 (.778), including the playoffs, against Pittsburgh and Cincinnati, totaling 19 touchdown passes and four interceptions. But Jackson has to break out of his two-game slump, during which he has completed 57.4% of his throws for an average of 184.5 yards passing.\n\nWhat is the biggest hurdle to reach the postseason?\n\nThe Ravens' offensive line. The struggle to win up front is the major reason Baltimore has gone from being the NFL's best red zone offense last year (74.2%) to 28th this season (47.2%). The Ravens have had trouble throwing the ball in the red zone, where Jackson has been sacked seven times (second most in the NFL). Baltimore also has had trouble punching the ball into the end zone with running back Derrick Henry, who has 17 yards on 19 carries in goal-to-go situations. -- Hensley\n\nChances to win division: 8.9%\n\nChances to make playoffs: 53.8%\n\nRemaining strength of schedule: 21st\n\nWhat's the biggest reason for the 5-5 record?\n\nUnlike last season -- when the Chiefs went on a remarkable streak of victories in close games -- they haven't been able to make the winning plays in one-score games this season, losing all five such contests. Three of those defeats have included a pivotal turnover in the red zone. Another issue is that the Chiefs commit far too many penalties for a team with so many talented and experienced players.\n\nWhat needs to happen to make the playoffs?\n\nMahomes will need to perform better in the final seven games of the regular season, especially when he attempts deep passes. On defense, the Chiefs will have to be more aggressive against opposing quarterbacks to generate more takeaways; Kansas City has forced just nine turnovers, tied for the fourth fewest in the league.\n\nWhat is the biggest hurdle to reach the postseason?\n\nAt this point, the Chiefs cannot afford to lose any more games to fellow AFC teams. They already don't have the tiebreaker against the Bills and the Jacksonville Jaguars -- teams that are ahead of the Chiefs in the standings. The best path for Kansas City to clinch a playoff spot is to win upcoming games over the Texans, the Los Angeles Chargers, the Tennessee Titans and the Las Vegas Raiders to boost its 2-4 conference record. -- Taylor\n\nChances to win division: 4.5%\n\nChances to make playoffs: 23.4%\n\nRemaining strength of schedule: 3rd\n\nWhat's the biggest reason for the 5-5 record?\n\nIt is strictly just the offense. The unit ranks 22nd at 20.8 points per contest. In Houston's losses, the defense (which allows the fewest points in the NFL at 16.3) has yielded more than 20 points in a game just once. Granted, the D has had moments when it has allowed a game-winning drive, but there's only so much the unit can do.\n\nWhat needs to happen to make the playoffs?\n\nThe offense just has to get rolling. If Houston could average close to what it totals in wins (28 points), then this could turn into one of the hottest teams in the NFL and be a squad nobody wants to see.\n\nWhat is the biggest hurdle to reach the postseason?\n\nTheir schedule. The Texans will first have to overcome the Bills (7-3) on Thursday without Stroud, who will miss his third game as he remains in the concussion protocol. Houston also will face the Colts twice, as well as the Chargers (7-4) and the Chiefs. Reaching the playoffs will be an uphill battle if the Texans' offense remains inconsistent down the stretch. -- Bien-Aime",
  "summary": "There has been a surprising power shift in the AFC this season.",
  "published": "Thu, 20 Nov 2025 18:43:19 EST",
  "url": "https://www.espn.com/nfl/story/_/id/47022733/baltimore-ravens-kansas-city-chiefs-houston-texans-5-5-record-last-year-afc-leaders-happened",
  "source": "www.espn.com - TOP"
}