{
  "title": "The most beautiful sections of China's Great Wall",
  "text": "Editor’s Note: Monthly Ticket is a CNN Travel series that spotlights some of the most fascinating topics in the travel world. In September, we’re celebrating superlatives as we look at some of the world’s biggest, tallest and most expensive attractions and destinations.\n\nCNN —\n\nHaving lived in Beijing for almost 12 years, I’ve had plenty of time to travel widely in China.\n\nI’ve visited more than 100 cities, not to mention countless towns and villages throughout the mainland’s 31 provinces.\n\nLooking back, I’ve come to realize it was my frequent visits to different parts of the Great Wall in Beijing that were a driving force behind my desire to explore the rest of the country and, along with it, the many sections of wall that lie outside the capital’s boundaries.\n\nWork on the Great Wall began more than 2,500 years ago, its origins dating back to China’s Spring and Autumn Period of around 770 BCE to 476 BCE. Various sections were added in subsequent eras as competing dynasties and factions sought to exert their control.\n\nWork eventually stopped in the 17th century.\n\nThough not a single, unbroken structure, the wall spans over 21,000 kilometers, winding through 15 provinces, 97 prefectures and 404 counties.\n\nAnd while certain sections have been incredibly popular among tourists, many parts have slipped into obscurity, disrepair and sometimes oblivion.\n\nWhether you’re planning to visit the Great Wall for the first time or the 50th, the following destinations are sure to make your trip to China even more worthwhile. (Check out the above video for dramatic aerial footage of some of these amazing sites.)\n\nYongtai Turtle City\n\nYongtai Turtle City is in north central Gansu province. Alex Sherr\n\nThe Great Wall is not simply a brick and mortar bulwark; in certain places, towers on jagged mountain peaks, fortress towns or even wide rivers count as sections of “wall.”\n\nThe Turtle City, built in the Ming Dynasty (1368-1644) as part of the Great Wall’s “Yellow River Defense Line,” was completed in 1608 and was home to around 2,000 infantrymen and 500 cavalry units during peak use.\n\nToday, this fortress city is located in the Sitan Township of Jingtai County in north central Gansu province.\n\nWhile there aren’t many real turtles in the “Turtle City,” the garrison town got its nickname due to its unique shape.\n\nThe south gate acts as the head and the west and east gates as the flippers. The town’s oval wall is the body, while the north gate acts as its tail. As one of the most well-preserved and truly authentic walled cities left in China today, it’s definitely worth your time.\n\nStaying in the Jingtai County center is recommended. The ancient city is only a 30-minute cab ride from your lodgings, so you can visit whenever the light is best for photos.\n\nWhen in Jingtai, try local specialties such as the five Buddha tofu and the Jingtai cold mixed noodles – both are spicy vegetarian dishes. A walk through the sprawling night market in Jingtai County People’s Square, which boasts more than 50 snack stalls, is also recommended for adventurous foodies.\n\nGetting there: Lanzhou, the capital of Gansu province, has a major international airport and high-speed train connections from many cities in China. The drive to Yongtai Turtle City from downtown Lanzhou takes about 2.5 hours (195 kilometers). From Lanzhou Zhongchuan Airport, it’s only 1.5 hours (125 kilometers).\n\nMutianyu/Jiankou\n\nThe Mutianyu and Jiankou sections of wall are about 25 kilometers in length. Alex Sherr\n\nMutianyu and Jiankou are two parts of the same Stone Dragon – two contiguous sections of the Great Wall that together stretch for roughly 25 kilometers along Beijing’s mountaintops.\n\nHistorical records show that millions of men spent centuries constructing the Great Wall. Stand atop the wall at either Mutianyu or Jiankou, and you’ll begin to comprehend the gravity of this statement.\n\nThese two sections are arguably the two most classic examples of Ming Dynasty Great Wall surviving today, and climbing either is guaranteed to be a life-changing experience.\n\nMutianyu is the best portion of the “tourist wall.” Restored in the 1980s, it’s very commercial but also superbly beautiful. Visitors not up for the hike can take a cable car to the top.\n\nTo the west of Mutianyu, Jiankou is colloquially known as the “wild wall” – no ticket needed and not commercialized. That being said, as of 2020, hiking at Jiankou has become somewhat frowned upon by the local government because of safety concerns.\n\nMutianyu and Jiankou are less than a 90-minute drive (without traffic) from downtown Beijing, yet it’s highly recommended to enjoy a night in the countryside if time allows.\n\nJiankou can be accessed via Xizhazi village; if dates align, you might even be able to spend a few days with William Lindesay, world-renowned Great Wall historian, and his wonderful family at The Barracks, their wall-side courtyard home.\n\nFor lodgings around Mutianyu, The Brickyard is a superbly comfortable choice.\n\nIn fall and spring, shades of the wall’s gray brick contrast with nature’s vibrant colors. Peak autumn foliage and spring cherry blossoms provide stunning backdrops for photos.\n\nFor winter sports enthusiasts, there’s skiing and skating next to the Wall at locations not far from Mutianyu.\n\nGetting to Mutianyu: Restrictions on applying for temporary driving licenses in China were relaxed in September 2019, so renting a car as a foreign tourist is entirely possible. (International driving licenses are not accepted in China.)\n\nYou can also hire a car with a driver for the day or take the Mutianyu Special Tourism Bus from the Dongzhimen Wai Bus Station.\n\nGetting to Jiankou: Renting a car or booking private transport is recommended. As Xizhazi is a small village, buses are scarce so it can take up to five hours to get there by public transport, as opposed to 90 minutes by car.\n\nBataizi\n\nThis Gothic church was built in 1876. Alex Sherr\n\nBataizi village sits just inside the Motianling section of the Great Wall and is home to the ruins of a Gothic church built in 1876 under the direction of a German missionary.\n\nThe church has been damaged and repaired numerous times in its nearly 150-year history; the bell tower is the only part still standing.\n\nThe juxtaposition of its ruins against the rammed-earth Great Wall makes Bataizi a unique place to spend a morning or afternoon.\n\nAfter finishing your hike along the wall and visiting the church ruins, drop in to the village’s “new” church to say hello to Father Pan; if you speak Chinese, he can answer any questions about the village’s long connection with Catholicism.\n\nBesides Bataizi, Datong should also be on your tourist map; visiting the Yungang Grottoes (a UNESCO world heritage site) and the Hengshan Hanging Temple will make your trip even more memorable.\n\nLate summer is an ideal time to visit Bataizi, as you’ll see a wonderful contrast between the Great Wall and the lush green hills.\n\nGetting there: Bataizi village is 80 kilometers west of Datong, one of Shanxi province’s largest and most famous cities. Zuoyun County is only 22 kilometers away from Bataizi – about a 35-minute drive.\n\nDatong is easily accessible by plane or high-speed train from other cities in China; a taxi from downtown Datong to Bataizi should cost roughly 300 yuan (about $43).\n\nAlternatively, you can make your way to Zuoyun County by bus then hop in a taxi.\n\nIn Datong, luxury seekers will want to head for the five-star Yunzhong Traditional Courtyard Hotel. Zuoyun County has one hotel that can accept foreigners: Zuoyun Jinshan International Hotel. Both can be found on popular hotel booking sites.\n\nLaoniuwan (aka the Old Ox Bend Great Wall)\n\nLaoniuwan, where the Great Wall and the Yellow River meet. Alex Sherr\n\nAs the locals say, Laoniuwan is where the Great Wall and the mighty Yellow River shake hands.\n\nThe Laoniuwan Fortress was built in 1467, while the most famous tower of the Great Wall in this area, Wanghe Tower (literally meaning river-watching tower), was constructed in 1544.\n\nLaoniuwan village is located in Pianguan County, part of Xinzhou city in Shanxi province, just across the river from Inner Mongolia.\n\nLate summer or early fall is a great time to visit, as you’ll avoid the potentially dangerous mountain roads during spring rainstorms, or being uncomfortably cold in a place without great infrastructure.\n\nAlong the Great Wall, there are only a few places where it meets bodies of water; of all those, this is the most stunning.\n\nA boat ride along the river is highly recommended. You’ll be able to soak in the natural beauty of the Yellow River Gorge while marveling at the steadfast resolve of these ancient architects.\n\nGetting there: Laoniuwan is difficult to get to by public transportation. The best option is to rent or book a car to take you from Datong to Laoniuwan via Bataizi – this way, you’ll be able to see two incredible locations along the Great Wall in one trip.\n\nPianguan is the nearest city, about one hour away. Pianguan does not have a train station or an airport. The only option is to arrive by bus. Shuozhou, 140 kilometers from Laoniuwan, has an airport opening later this year.\n\nFairy Tower\n\nSimatai's Fairy Tower is a sight to behold. Alex Sherr\n\nConstruction on the Great Wall in Simatai began in 1373. It was expanded and reinforced periodically throughout the Ming Dynasty.\n\nThe Fairy Tower is one of the best-known towers of the wall at Simatai but also one of the least visited due to how difficult it is to access.\n\nInstead, aim to take in incredible views of the Fairy Tower from Wangjing Tower (just a few hundred meters away). It’s a journey that will satiate even the most adventurous hikers, yet can be done without any ropes, ladders or other essential safety gear.\n\nAs with a visit to Mutianyu/Jiankou, this section of wall is guaranteed to deliver stunning views any time of year. My only suggestion is to wait for a clear day (usually visibility is great the day after it rains or snows), as the view from Wangjing Tower is unobstructed in every direction.\n\nThe hike to the Fairy Tower will leave you in awe of the Northern Barbarians’ supposed determination to reach the capital; the mountains are nearly impassable on foot, let alone by horse, with sheer cliff faces on either side.\n\nIt makes for absolutely world-class hiking and an interesting history lesson.\n\nFive-star lodgings are available at Hobo Farm; they also have an incredible restaurant that serves delicious Western and Chinese fare. For 4.5 star lodgings with a lower price tag, try Yatou’s Homestay. Both can be found on major hotel booking sites.\n\nGetting there: Both the Fairy Tower and Wangjing Tower should be accessed via Tangjiazhai village, located in Beijing’s Miyun district.\n\nTangjiazhai village is 140 kilometers from downtown Beijing, depending on your route. Booking a private car from the city is probably the most time-effective way to get there.\n\nYou can also take a high-speed train from Beijing Station to Miyun district and switch to a bus or taxi from there.\n\nDushikou\n\nDushikou stand seven meters tall in some spots. Alex Sherr\n\nConstructed during the reign of Emperor Jiajing (1507-1567), this single-wall section stands seven meters tall in some spots – no small feat considering it was made by piling stones.\n\nIt’s located just across the road from the town of Dushikou, in Chicheng in Hebei province.\n\nThe piled-stone wall at Dushikou is unique, as many other sections of the Great Wall close to Beijing were constructed using kiln-fired bricks.\n\nDushikou is best visited in the summer, specifically July and August, when the rolling hills of the surrounding grasslands are peak green. Cool evenings make for perfect outdoor barbecue/bonfire weather.\n\nYou’ll be able to find clean and comfortable farmhouse lodgings in Dushikou town; alternatively, Chicheng, 45 minutes away, has a range of hotels to choose from.\n\nLamb skewers and roast leg of lamb are specialties in these parts, as this part of Hebei is very close to the border with Inner Mongolia. Noodle lovers should also try the local oat noodles, which are delicious.\n\nGetting there: Thanks to all the infrastructure built for the 2022 Winter Olympics, the drive to Dushikou has been shortened by almost two hours. If you prefer not to drive, hop on a bus to Chicheng from the Liuliqiao Transport Hub in Beijing and take a 45-minute taxi ride to Dushikou.\n\nNote that public transportation will take one or two hours longer than private car.",
  "summary": "Having lived in Beijing for almost 12 years, I've had plenty of time to travel widely in China.",
  "published": "Mon, 18 Sep 2023 02:57:08 GMT",
  "url": "https://www.cnn.com/travel/article/china-beautiful-great-wall-sections-cmd/index.html",
  "source": "CNN.com - RSS Channel - World"
}