{
  "title": "The Playbook: Lineup locks, Shadow Reports for Week 12",
  "text": "Open Extended Reactions\n\nWelcome to The Playbook for Week 12, which kicks off Thursday with the Bills at the Texans.\n\nThis column features score projections, over/unders, win probabilities, and of course, easily digestible fantasy advice for seasonlong leagues and DFS. This guide should help you with all sorts of decision-making, including sit/start, last-minute waiver adds and lineup choices.\n\nAdditionally, we have folded our Shadow Reports, previously a separate column, into the game-by-game breakdowns here. Using our play-by-play data, we're able to identify defensive schemes and where each wide receiver and cornerback lines up on each play. By tracking these WR/CB matchups, including potential shadow situations, we can offer the best fantasy guidance suggestions each week.\n\nIf you want a more detailed look at some of this data, be sure to check out the weekly Shadow Reports: WR vs. CB Cheat Sheet. You can also take a look at the latest update of each team's rest-of-season strength of schedule.\n\nAll of this advice is centered on 12-team PPR leagues with relatively standard scoring and lineup settings (1 QB, 2 RB, 3 WR, 1 flex, 1 K, 1 D/ST), although I'll often mention \"shallow\" or \"deep\" leagues for some starters. The charts show all players who have been projected for at least 6.0 fantasy points this week, as well as all D/STs. \"Matchup\" is automatically determined using a proprietary metric that factors in raw and volume-adjusted fantasy points allowed to each position by the opposing defense this season.\n\n(Editor's note: Projections and rankings will align almost perfectly, but sometimes when a projection is close, a player might be ranked slightly higher or lower because of other factors, including upside or risk. This column is subject to updates during the weekend, although at the very minimum, rankings will be updated on the site and projections will always be updated inside the game leading up to kickoff.)\n\nBUF-HOU | PIT-CHI | NE-CIN | NYG-DET | MIN-GB | SEA-TEN | IND-KC\n\nNYJ-BAL | CLE-LV | JAX-ARI | PHI-DAL | ATL-NO | TB-LAR | CAR-SF\n\nProjected score: Bills 24, Texans 24\n\nLineup locks: Josh Allen, James Cook III, Woody Marks, Nico Collins\n\nFantasy scoop: Allen is too good to bench, but expectations should be lowered this week on the road against an elite Houston defense. Consider: Allen is averaging 29.6 fantasy PPG at home this season (minimum 19.4) but just 17.4 PPG on the road. His weekly road performances are as follows: 11.8 points at the Jets (QB24), 15.4 points at the Falcons (QB18), 23.2 points at the Panthers (QB8) and 19.3 points at the Dolphins (QB10).\n\nAdditionally, Houston has allowed the fewest fantasy points, fourth-fewest pass yards, sixth-fewest pass TDs (10), second-lowest completion rate (58%), second-lowest yards per attempt (6.1) and zero rushing TDs to quarterbacks. No quarterback has reached 20 fantasy points against the Texans and only three have hit 14. Allen is a midrange QB1 play with the potential for a dud.\n\nShadow Report: Downgrade Buffalo's wide receivers against a Houston defense that has allowed the second-fewest fantasy points to receivers, including the third-fewest to the perimeter. The Texans have held receivers to the lowest catch rate (53%) and third-lowest yards per target (6.7), and only three receivers have even reached 13 points against them. Khalil Shakir is the only Buffalo receiver worth considering for your WR3/flex slot, and his ceiling is limited in this matchup.\n\nShadow Report: Collins can expect Christian Benford shadow coverage this week. Benford has traveled with Garrett Wilson (9.0 fantasy points in the game), Tyreek Hill (15.9), Chris Olave (11.0), Drake London (31.8), Tetairoa McMillan (16.9), Travis Kelce (10.6) and Emeka Egbuka (9.0) on their perimeter routes this season. The six wide receivers averaged 15.6 fantasy points, with half of them reaching 15.9. We haven't been afraid of this matchup all season and won't be here in Week 12. Collins can be started with confidence.\n\nOver/under: 47.8 (7th highest)\n\nWin probability: Bills 51% (13th)\n\nProjected score: Bears 25, Steelers 21\n\nLineup locks: D'Andre Swift, Jaylen Warren, DK Metcalf, Rome Odunze\n\nFantasy scoop: Warren departed Sunday's win after only 18 snaps due to injury, and Kenneth Gainwell took advantage. The 2021 fifth-round pick didn't do much on the ground (24 yards on nine carries) but posted a 7-81-2 receiving line on seven targets. Gainwell has played 60% or more of the snaps in two games this season (both due to Warren injuries) and he scored 29-plus fantasy points in each outing. Of course, he has failed to score double-digit fantasy points in any other game, so his Week 12 outlook will depend on Warren's health.\n\nIf Warren plays, Gainwell belongs on the bench. If Warren is sidelined, Gainwell will defer some carries to Kaleb Johnson but will be well positioned for 15-plus touches against a Chicago defense that sits midpack in fantasy points allowed to RBs but has allowed 5.0 yards per carry (fourth highest) to the position. In that scenario, Gainwell will be a solid RB2 option.\n\nShadow Report: Upgrade Pittsburgh's receivers against a Chicago pass defense that has surrendered the second-most touchdowns (14), fourth-highest yards per target (9.2) and ninth-most fantasy points to receivers. Chicago is actually coming off a solid effort against Minnesota's receivers but still sits top-10 in points allowed to both the perimeter and slot over the past four weeks.\n\nMetcalf has struggled this season while often dealing with shadow coverage and/or tough matchups, but he has managed three 16-plus-point fantasy outings and he matched a season high with nine targets last week (four from Mason Rudolph). Set for perhaps his easiest matchup of the season to date, Metcalf is in the WR2/3 mix, even with Aaron Rodgers possibly sidelined.\n\nOver/under: 45.5 (10th)\n\nWin probability: Bears 66% (8th)\n\nProjected score: Patriots 32, Bengals 25\n\nLineup locks: Drake Maye, Chase Brown, TreVeyon Henderson, Tee Higgins, Stefon Diggs\n\nFantasy scoop: Henderson is red hot, having followed up Week 10's 150-yard, two-TD, 28.0-fantasy-point effort with a 93-yard, three-TD, 32.3-point explosion in Week 11. Henderson's recent surge has, of course, been fueled by Rhamondre Stevenson's absence, but it's fair to wonder whether his strong play, which includes 87-plus yards in all three games, will lead to a much larger role moving forward.\n\nIf Stevenson remains sidelined, Henderson is a lineup lock. Even if Stevenson returns, both backs are viable RB2 options against a horrific Bengals run defense that has allowed the most rushing yards (185.6 yards per game), scrimmage yards, touchdowns (1.5) and fantasy points (34.1) to running backs. An almost-unbelievable 13 backs have already scored 15-plus fantasy points against them this season.\n\nShadow Report: With Ja'Marr Chase suspended for this game, expect Higgins to draw shadow coverage from Christian Gonzalez. New England's top corner shadowed Jerry Jeudy, Drake London and Emeka Egbuka over the past month. Gonzalez held Jeudy without a single catch, did well when aligned on London (London still scored 38.8 points in the game, but nearly all was against other defenders) and wasn't as good against Egbuka (23.5 fantasy points scored in the game). Unlike London and Egbuka, Higgins doesn't move into the slot very often (12% to be exact) and thus will see Gonzalez on nearly all of his routes. Higgins figures to see more targets with Chase out, but that may be offset a bit by this matchup.\n\nOver/under: 56.6 (highest)\n\nWin probability: Patriots 75% (5th)\n\nProjected score: Lions 30, Giants 23\n\nLineup locks: Jaxson Dart, Jahmyr Gibbs, Amon-Ra St. Brown, Wan'Dale Robinson, Jameson Williams\n\nFantasy scoop: With Sam LaPorta on IR, Brock Wright stepped in as the Lions' featured tight end in Week 11. Wright was more involved than he was when LaPorta missed Week 11 of last season, this time playing 82% of the snaps and handling a career-high seven targets. Wright's 19.4% target share in the game was actually a hair above LaPorta's 18.6% share during Weeks 1-10. Wright ran 25 routes, tied for third on the team behind only St. Brown and Williams. Wright was able to turn the seven targets into only 8 yards, but that feels a bit fluky considering Jared Goff struggled with 14 completions on 37 attempts against a good Eagles defense.\n\nWe don't want to get too carried away here, as Wright has produced double-digit fantasy points in just six of 71 career games, but he has also never been asked to play such a substantial offensive role. Wright isn't a must add, but he's very much in the TE2 mix in a much better matchup this week. The Giants sit top-12 in passing yards and TDs allowed.\n\nOver/under: 53.4 (3rd)\n\nWin probability: Lions 73% (6th)\n\nProjected score: Packers 27, Vikings 19\n\nLineup locks: Emanuel Wilson, Justin Jefferson, Romeo Doubs, Jordan Addison\n\nFantasy scoop: Josh Jacobs (knee) is in doubt for this week's game and, if he's sidelined, Wilson should find his way into your starting lineup. With Jacobs (who has yet to miss a game since joining Green Bay) limited to 11 snaps on Sunday, Wilson stepped in and handled 11 carries and one target on 36 snaps (17 routes). Chris Brooks was barely involved off the bench, totaling only one carry on five snaps (zero routes). Brooks was more involved last season -- mainly as a pass catcher -- but it appears that he's clearly behind Wilson on the depth chart here in 2025. Wilson, a 2023 UDFA, has played solid ball when called on, averaging 4.6 yards per carry on 185 career attempts, while also adding 174 yards on 36 targets. If Jacobs is out, Wilson is a solid RB2 play.\n\nOver/under: 45.5 (11th)\n\nWin probability: Packers 77% (4th)\n\nProjected score: Seahawks 26, Titans 15\n\nLineup lock: Jaxon Smith-Njigba\n\nFantasy scoop: Calvin Ridley (fibula) is done for the season, which solidifies Elic Ayomanor, Chimere Dike and Van Jefferson as the Titans' top receivers moving forward. Ridley had played only seven snaps during Tennessee's past six games due to injury, with the team's WR usage as follows: Ayomanor (244 snaps, 30 targets), Jefferson (228 snaps, 28 targets), Dike (174 snaps, 20 targets) and all others combined (97 snaps, 10 targets).\n\nDike, whose numbers are deflated a bit after he left Sunday's game injured, paces the group with 9.4 fantasy PPG during the stretch, with Ayomanor (6.1) and Jefferson (7.1) also not particularly productive. Dike did flash with a pair of 16-plus-point games during Weeks 7 and 8, so there's some hope for him as a deep-league flex, but he'll be tough to trust in an offense that has scored a horrific 11 touchdowns in 10 games.\n\nShadow Report: We've been picking on the short-handed Titans secondary for a while now and we're going to do it again here in Week 12. After allowing 24.2 points to Nico Collins on Sunday, Tennessee has allowed the seventh-most fantasy points to receivers this season, including the third-most over expected. Tennessee is allowing the highest catch rate (72%) and third-highest yards per target (9.2) to the position. Smith-Njigba, Cooper Kupp and Rashid Shaheed can be upgraded against Darrell Baker Jr. (who may shadow JSN), Marcus Harris, Jalyn Armour-Davis and Samuel Womack III.\n\nOver/under: 41.2 (12th)\n\nWin probability: Seahawks 85% (highest)\n\nProjected score: Chiefs 28, Colts 27\n\nLineup locks: Patrick Mahomes, Daniel Jones, Jonathan Taylor, Rashee Rice, Michael Pittman Jr., Tyler Warren, Travis Kelce\n\nFantasy scoop: Alec Pierce is on pace for a career year and suddenly finds himself on the WR3 radar after posting consecutive 17-plus-point fantasy outings prior to the Colts' Week 11 bye. Pierce's early-season production wasn't overly impressive (under 11 points in four straight games to open the season), but he's averaging 8.8 targets, 91.5 yards and 14.9 fantasy PPG in four games since. The fifth-year receiver sits 34th among WRs in fantasy PPG, and that number could be even better if he found the end zone more often. Pierce has one TD (2.1 xTD), which is a bit of a regression-to-the-mean overcorrection after he scored seven times (4.2 xTD) in 2024. Pierce paces qualified receivers in yards per reception (20.9) and aDOT (20.1), which is a role that sets him up for big plays.\n\nOn the other hand, Colts receivers will have their hands full this week against a Chiefs defense that has allowed the seventh-fewest fantasy points to receivers and only nine passing TDs on the season. Only three receivers have hit 14.5 fantasy points against them, and two were in Week 1. The Colts' elite offense with four teams on a bye is enough to keep Pierce, Pittman and Josh Downs on the fantasy radar this week, but the bust risk is higher than usual.\n\nOver/under: 54.4 (2nd)\n\nWin probability: Chiefs 54% (10th)\n\nProjected score: Ravens 29, Jets 18\n\nLineup locks: Lamar Jackson, Derrick Henry, Breece Hall, Zay Flowers\n\nFantasy scoop: Tyrod Taylor is set to replace Justin Fields as the Jets' starting quarterback, and his presence should add a little bit of juice to the passing game. Taylor has played only one full game this season -- Week 3 against the Buccaneers -- and threw for 197 yards and two TDs on 36 attempts, adding 48 yards on eight carries. The pass attempt number is most notable, as Fields averaged 25.8 attempts in his seven full games and reached 33 only once. With Garrett Wilson on IR, Hall is the only thing close to a lineup lock in this offense, with Mason Taylor a more attractive TE2 play. The Jets shook up their WR room big-time last week (John Metchie III, Isaiah Williams, Tyler Johnson and Adonai Mitchell each played 28-plus snaps). None should be in lineups at the moment.\n\nShadow Report: Upgrade Baltimore's receivers against the Sauce Gardner-less Jets pass defense. Secondary receivers had already fared well against New York prior to Gardner's departure, and now we are starting to see No. 1 receivers perform at a higher level. That includes Jerry Jeudy's 19.8 points in Week 10 and Stefon Diggs' 19.5 points last week. Flowers is the primary benefactor, and Rashod Bateman (if back from injury) is a noteworthy deep sleeper.\n\nOver/under: 47.4 (8th)\n\nWin probability: Ravens 85% (2nd)\n\nProjected score: Browns 18, Raiders 15\n\nLineup locks: Ashton Jeanty, Quinshon Judkins, Brock Bowers\n\nFantasy scoop: Harold Fannin Jr. has handled at least 20% of Cleveland's targets in five consecutive games, but the heavy usage has yet to allow consistent fantasy production. Fannin's two best fantasy outings did come during this stretch (15.1 points in Week 6 and 18.4 points in Week 8), but he fell short of 8.5 points in the other three games. Fannin sits top-seven among tight ends in targets and catches, but Cleveland's weak offense has him 12th in yards and 23rd in touchdowns (two). Especially with David Njoku still in the mix, Fannin is no more than a fringe TE1, especially this week against a Raiders defense that has allowed the fourth-fewest fantasy points to tight ends.\n\nOver/under: 32.7 (lowest)\n\nWin probability: Browns 58% (9th)\n\nProjected score: Cardinals 23, Jaguars 23\n\nLineup locks: Michael Wilson, Trey McBride\n\nFantasy scoop: Is the Bhayshul Tuten emergence finally upon us? It sure seemed like it during Week 11's dominant win over the Chargers. Prior to Tuten's departure early in the fourth quarter with an injury, Jacksonville's RB usage was as follows: Tuten (22 snaps, 15 carries for 74 yards, 1 TD), Travis Etienne Jr. (25 snaps, 12 carries for 47 yards, 1 TD) and LeQuint Allen Jr. (4 snaps, 0 carries).\n\nDespite missing most of the fourth quarter, Tuten posted career highs in snap share (32%) and touches (15). Tuten's strong play suggests a larger share of the workload could be in order, but it's important to note that he benefited greatly from game script (Jacksonville called 45 runs), and this is very likely to remain a committee. Etienne has 859 yards in 10 games and is averaging 4.7 yards per carry, and Allen is a passing-down specialist. Tuten remains without much work in the pass game (11 targets in 10 games, including zero in Week 11). An Arizona defense that has allowed 13 touchdowns to RBs (fourth most) presents a good Week 12 matchup, but Tuten is no more than a deep-league flex lottery ticket until he cements a larger role.\n\nOver/under: 45.7 (9th)\n\nWin probability: Cardinals 51% (12th)\n\nProjected score: Eagles 26, Cowboys 25\n\nLineup locks: Jalen Hurts, Saquon Barkley, Javonte Williams, CeeDee Lamb, A.J. Brown, DeVonta Smith, George Pickens, Dallas Goedert, Jake Ferguson\n\nFantasy scoop: Prescott will be a risky fantasy start this week against a surging Eagles defense that held him to 188 yards, zero touchdowns and 7.8 fantasy points when these teams met in Week 1. Prescott did heat up for a while after that game (22-plus fantasy points in five of his next six), but he has been boom/bust as of late, with fewer than 16 points against Denver and Arizona prior to beating up on the Raiders (24.3) on Monday. The Eagles, meanwhile, have allowed just two QB fantasy finishes better than 12th and seem to be peaking defensively. They've allowed a league-low 57% completion rate and have held both Jordan Love (7.8) and Jared Goff (12.1) to poor fantasy days over the past two weeks. Prescott is, at best, a fringe starting option.\n\nShadow Report: Quinyon Mitchell is likely to shadow Pickens this week, as he did when these teams faced off in the season opener. During that game, Mitchell aligned against Pickens on 16 of his 24 routes, including 16 of 22 on the perimeter. Pickens was held to 15 yards on three targets (3.5 fantasy points), whereas Lamb benefited from facing off with Adoree' Jackson (110 yards and 18.0 fantasy points on 10 targets). Expectations should be lowered for Pickens raised a bit for Lamb (even though the Eagles' defense is playing well).\n\nOver/under: 51 (4th)\n\nWin probability: Eagles 52% (11th)\n\nProjected score: Saints 20, Falcons 20\n\nLineup locks: Bijan Robinson, Chris Olave\n\nFantasy scoop: The Atlanta offense is headed for a shakeup with both Michael Penix Jr. (IR) and Drake London sidelined this week. Coincidentally, we got a look at this setup in Week 8 when both were out against Miami. In that game -- a 34-10 loss -- Kirk Cousins struggled, with 173 yards and zero TDs on 31 pass attempts, Robinson was held to 48 yards on 12 touches (Tyler Allgeier scored the team's only touchdown) and no wide receiver cleared 31 yards.\n\nThe only silver lining was a strong effort by Kyle Pitts Sr., who handled nine targets (his second-highest total of the season) and matched a career high with nine catches. Pitts saw a 30% target share in that game and figures to be very busy against the Saints. He'd be a lineup lock if we had more confidence in Cousins. Darnell Mooney didn't show well in the Week 8 game (11 yards on four targets), but he's the top receiver for Atlanta, and that's enough for WR3 consideration against a Saints defense that has allowed the seventh-most passing TDs (18) and the eighth-highest EPA against the pass.\n\nOver/nder: 39.7 (13th)\n\nWin probability: Saints 50% (lowest)\n\nProjected score: Rams 29, Buccaneers 20\n\nLineup locks: Matthew Stafford, Kyren Williams, Puka Nacua, Emeka Egbuka, Davante Adams\n\nFantasy scoop: Sean Tucker came out of nowhere to deliver 140 yards and three touchdowns on 21 touches against the Bills on Sunday. The impressive showing may lead to more work for Tucker moving forward, but there are several factors that suggest he won't find his way to consistent fantasy value. For starters, he beat up on perhaps the league's worst run defense (Buffalo has allowed the second-most rushing yards, most TDs and second-most fantasy points to RBs). Second, Bucky Irving remained out for that game and has a real shot to return here in Week 12.\n\nThird, we've seen this before: Tucker exploded for 192 yards and two scores on 17 touches in Week 6 of last season prior to totaling 39 touches, 204 yards and one TD over the final 12 games of the season. Finally, even if Irving remains out this week, Tucker will have a much stiffer challenge against a Rams defense that has allowed just three touchdowns and the third-fewest fantasy points to RBs this season.\n\nPerhaps the Bucs shock the NFL world and make Tucker their clear lead back, Rico Dowdle-style, but that seems unlikely with Irving and Rachaad White in the mix. Tucker should remain on benches unless Irving remains out. In the latter scenario, he'll be on the RB2/flex radar.\n\nShadow Report: Emmanuel Forbes Jr. figures to shadow Egbuka this week, as he has against Rashid Shaheed (Shaheed scored 11.8 fantasy points in the game), Jauan Jennings (19.1) and Jaxon Smith-Njigba (19.5) during the Rams' past three games. The Rams have been exceptional against the pass (second-lowest EPA allowed) but face quite a bit of volume (fifth-most pass attempts faced), which is why they sit top-10 in catches and yards allowed to receivers. It also helps explain the solid numbers by the aforementioned trio of receivers. It may not be the most efficient day at the office, but Egbuka should see enough volume to produce at his usual WR1/2 level.\n\nOver/under: 48.9 (6th)\n\nWin probability: Rams 78% (3rd)\n\nProjected score: 49ers 28, Panthers 22\n\nLineup locks: Christian McCaffrey, Rico Dowdle, Tetairoa McMillan, Jauan Jennings, George Kittle\n\nFantasy scoop: Ricky Pearsall returned from injury on Sunday -- his first game action since Week 4. The results were poor (zero yards on three targets), but the good news is that he was immediately the team's No. 2 receiver, running a route on 85% of the pass plays. Pearsall was productive early in the season (100-plus yards in two of his three full games), and now healthy, he should quickly return to fantasy relevance in an offense that has scored four-plus touchdowns in three straight games. He's on the flex radar against a Carolina defense that has allowed only six TDs to receivers, but the 10th-highest EPA against the pass.\n\nShadow Report: Upgrade Carolina's receivers against a 49ers defense that, after allowing 33.5 fantasy points to Michael Wilson last week, now sits top-five in receptions, yards, fantasy points and catch rate allowed to receivers. The 49ers have been worse against the slot than the perimeter this season, though they've struggled against both over the past month. That's notable as McMillan aligns out wide 82% of the time. He's in a good spot against Niners boundary corners Renardo Green and Deommodore Lenoir.\n\nOver/under: 50.3 (5th)\n\nWin probability: 49ers 71% (7th)",
  "summary": "An all-encompassing look at matchups to exploit or avoid and lineup locks in fantasy, as well as projected scores.",
  "published": "Thu, 20 Nov 2025 19:30:00 EST",
  "url": "https://www.espn.com/fantasy/football/story/_/id/47008913/nfl-fantasy-football-2025-ultimate-playbook-projections-win-probabilities-week-12-shadow-reports-mike-clay",
  "source": "www.espn.com - TOP"
}