{
  "title": "Michael Jordan's 1998 NBA Finals sneakers sell for a record $2.2 million",
  "text": "Editor’s Note: This story was updated with the final sale price and other details following the auction.\n\nCNN —\n\nIn 1998, Michael Jordan laced up a pair of his iconic black and red Air Jordan 13s to bring home a Bulls victory during Game 2 of his final NBA championship — and now they are the most expensive sneakers ever to sell at auction.\n\n\n\nThe game-winning sneakers sold for $2.2 million at Sotheby’s in New York on Tuesday, smashing the sneaker auction record of $1.47 million, set in 2021 by a pair of Nike Air Ships that Jordan wore earlier in his career.\n\nThe sale arrives during “Jordan Year” — a reference to the NBA star player’s iconic jersey number 23. In January, Air Jordan partnered with Sotheby’s to auction off 13 pairs of retro sneakers that were designed in memory of The Notorious B.I.G. All lots outsold their high estimates of $5,000 by multiples, with the highest selling for more than $32,000.\n\nLast year, Jordan’s Game 1 jersey, also from the 1998 finals, became the most expensive item of worn sports memorabilia to sell at auction when it fetched $10.1 million at a Sotheby’s sale.\n\nJordan’s farewell run with the Chicago Bulls is often referred to as “The Last Dance,” after the title of an ESPN and Netflix documentary that chronicled the season. Jordan announced his (second) retirement weeks before the finals, leading to the six-game series against the Utah Jazz becoming the most-watched in NBA history, based on Nielsen TV ratings. (Jordan would later return from 2001 to 2003 to play with the Washington Wizards, but did not win another championship).\n\nMichael Jordan pictured wearing the record-breaking sneakers during the NBA Finals at the Delta Center in Salt Lake City, Utah, on June 05, 1998. Jeff Haynes/AFP/Getty Images/File\n\n“Michael Jordan game-worn sports memorabilia has proven time and time again to be the most elite and coveted items on the market,” said Brahm Wachter, Sotheby’s head of streetwear and modern collectables, in a press release prior to the sale. “However, items from his ‘Last Dance’ season are of a greater scale and magnitude as seen with our record-breaking sale of his Game 1 jersey in 2022.”\n\nThe pair of sneakers sold Tuesday were worn during Game 2, in Salt Lake City, which the Bulls won 93-88 after losing Game 1, with Jordan scoring 37 points. They are the last pair of black and red Air Jordan 13s that Jordan ever wore on the court for an NBA game, a press release from Sotheby’s noted.\n\nFollowing Game 2, Jordan signed and gifted the set of worn shoes to the ball boy in the visitor’s locker room, as he was known to do, according to Sotheby’s.\n\nThe Air Jordan 13 sneakers starred in a sports memorabilia sale called “Victoriam,” which featured items worn by athletes including Tom Brady, Kobe Bryant and Roger Federer. Several other Jordan items were included in the two-part auction, with a game-worn 1998 Bulls jersey and a pair of 1985 Air Jordan 1s fetching $508,000 and $127,000 respectively.\n\nOther top lots included one of Kobe Bryant’s LA Lakers shooting shirts, which sold for over $406,000, and a soccer jersey, worn by the late Pelé on his debut for the New York Cosmos in 1975, that sold fetched over $177,000.\n\nTop image: The Air Jordan 13 sneakers signed by Michael Jordan.",
  "summary": "In 1998, Michael Jordan laced up a pair of his iconic black and red Air Jordan 13s to bring home a Bulls victory during Game 2 of his final NBA championship — and now they are the most expensive sneakers ever to sell at auction.\n\nThe game-winning sneakers sold for $2.2 million at Sotheby's in New York on Tuesday, smashing the sneaker auction record of $1.47 million, set in 2021 by a pair of Nike Air Ships that Jordan wore earlier in his career.",
  "published": "Wed, 12 Apr 2023 03:17:57 GMT",
  "url": "https://www.cnn.com/style/article/michael-jordan-sneakers-1998-finals-sothebys-auction-record/index.html",
  "source": "CNN.com - RSS Channel - World"
}