{
  "title": "Coastal flooding more frequent than previously thought",
  "text": "Flooding in coastal communities is happening far more often than previously thought, according to a new study from North Carolina State University and the University of North Carolina at Chapel Hill. The study also found major flaws with the widely used approach of using marine water level data to capture instances of flooding.\n\n\"Government agencies and researchers use data from tide gauges to measure water levels in coastal areas, then use that data to estimate flood frequency in the region,\" says Miyuki Hino, corresponding author of a paper on the study and assistant professor of city and regional planning at UNC. \"Those estimates are used both to assess how often flooding has taken place and to predict how often flooding may take place in the future. However, our study shows that this approach does not accurately capture how often flooding takes place or how long those floods last.\"\n\n\"Due to sea-level rise, we're now seeing flooding in coastal areas outside of extreme storms like hurricanes,\" says Katherine Anarde, co-author of the paper and an assistant professor of coastal engineering at NC State. \"There can be flooding during everyday rain showers or at high tide on sunny days. It's important that the methodology we use to monitor and predict flooding reflects this reality, since sea-level rise means these flooding events are going to become even more common.\n\n\"Our research shows you need land-based measures of flooding to capture the burden on coastal residents, which can inform policy and planning decisions moving forward,\" Anarde says.\n\nAnarde and Hino are part of the Sunny Day Flooding Project, a research initiative focused on improving flood monitoring, broadening our understanding of coastal flooding, and identifying the most effective flood mitigation strategies.\n\nAt present, there are two widely accepted \"thresholds\" used to infer flooding on land based on tide gauge data: the National Oceanic and Atmospheric Administration (NOAA) High Tide Flooding threshold (HTF) and the National Weather Service's minor flood threshold (NWS).\n\nFor this study, the researchers made use of data from a network of land-based sensors that their team designed to identify flooded roadways and deployed across eastern North Carolina. The researchers focused on a year of data from sensors in three communities: Beaufort, Carolina Beach and Sea Level.\n\nDuring the study period, the sensors detected flooding on 26 days in Beaufort, 65 days in Carolina Beach and 128 days in Sea Level.\n\n\"These numbers were very different from what the HTF and NWS thresholds tell us based on water levels at tide gauges,\" Anarde says. \"In general, the thresholds drastically underestimated the number of floods. For example, when you subtract floods associated with extreme storms, we recorded flooding on 122 days in Sea Level. But if you looked at the data from the closest tidal gauge, the NWS threshold inferred that there were 31 days of flooding. And the HTF threshold inferred only nine days of flooding.\n\n\"However, the NWS threshold sometimes overestimates the number of flood days,\" Anarde says. \"For example, Carolina Beach had 65 days of flooding, but if you applied the NWS threshold using data from the closest tidal gauge, it inferred that there were 120 days of flooding.\"\n\n\"In addition to being inaccurate in terms of how often it is flooding, our findings also show that the actual duration of the floods is longer than is captured by the HTF and NWF thresholds,\" Hino says. \"Essentially, the thresholds don't adequately account for how long it takes water to drain off of land.\"\n\n\"More accurate information on coastal flooding can inform where and how we invest resources in building more resilient communities,\" says Anarde. \"It's hard to design an efficient solution when you don't know the scope of the problem.\"\n\nAnarde and Hino are now working with partner communities to identify and evaluate response strategies that can mitigate the impacts of chronic flooding.\n\n\"Every community is unique, so there's no one-size-fits-all solution,\" says Hino. \"But with more accurate data, we can help communities assess what response strategy is best for them, now and in the future.\"\n\nThe paper, \"Land-based Sensors Reveal High Frequency of Coastal Flooding,\" will be published June 2 in the open-access journal Nature Communications Earth & Environment. The paper was co-authored by Ryan McCune and Thomas Thelen, Ph.D. students at NC State; Elizabeth Farquhar, a research associate at NC State; Perri Woodard, an undergraduate student at NC State; Tessa Fridell, a former undergraduate student at UNC; and Anthony Whipple, a research technician at UNC.\n\nThis work was done with support from the U.S. Department of Homeland Security under grant number 2015-ST-061-ND0001-01. The views and conclusions contained herein are those of the researchers and should not be interpreted as necessarily representing the official policies, either expressed or implied, of the U.S Department of Homeland Security. The work was also done with support from North Carolina Sea Grant under institution grant NA22OAR4170109; the National Science Foundation's Human-Environment and Geographical Systems Program under grant BCS-2215195; NOAA's Climate Adaptation Partnerships program and the Bipartisan Infrastructure Law, under grant NA23OAR4310474; NASA, under grant 80NSSC24K0504; the North Carolina Department of Transportation, under grant RP2024-56; the Gulf Research Program Early-Career Research Fellowship, under award 2000013691-2022; and the Eunice Kennedy Shriver National Institute of Child Health and Human Development, under award 5-K01-HD112604-02. The researchers also thank their community partners in the Town of Beaufort, the Town of Carolina Beach, and the Core Sound Waterfowl Museum and Heritage Center for their support.",
  "summary": "Flooding in coastal communities is happening far more often than previously thought, according to a new study. The study also found major flaws with the widely used approach of using marine water level data to capture instances of flooding.",
  "published": "Mon, 02 Jun 2025 15:53:38 EDT",
  "url": "https://www.sciencedaily.com/releases/2025/06/250602155338.htm",
  "source": "Latest Science News -- ScienceDaily"
}