{
  "title": "White House announces new oil and gas drilling off California and Florida",
  "text": "The Trump administration on Thursday announced new oil and gas drilling off California’s and Florida’s coasts, setting the stage for a political showdown – including with Sunshine state Republicans who have largely opposed petroleum development in the Gulf of Mexico.\n\nThis announcement comes as the US petroleum industry, despite contending with low crude prices, has been pushing for an entree to additional offshore drilling areas. The industry’s move for increased access also marks an effort to increase jobs and US energy independence, according to the Associated Press.\n\nThe federal government has prohibited offshore drilling in the eastern Gulf of Mexico, which extends from Florida shores to portions of Alabama, since 1995. The ban stemmed from worries about potential oil spills.\n\nWhile California does have some offshore oil development, there have not been new leases in federal waters for nearly 30 years, the AP said.\n\nA proposed schedule for petroleum leasing in federal waters includes up to 34 auctions from 2026 to 2031; these auctions include up to six sales off California’s coastline, 21 off of Alaska’s coastline, and two in the Gulf of Mexico’s eastern portion, Politico said. The sales in Alaska would reportedly include a region that has never had oil drilling.\n\nThe move reflects Trump’s dogged efforts to roll back former president Joe Biden’s efforts against global heating. Trump has described climate change as “the greatest con job ever perpetrated on the world”, and launched a National Energy Dominance Council to boost domestic energy production, with an emphasis on fossil fuels, AP noted.\n\nTrump has simultaneously thwarted renewable energy development including offshore windfarms. His administration has also axed billions in green energy grants, the AP said.\n\nCalifornia’s Democratic governor, Gavin Newsom, a Trump foe weighing a presidential run, rejected offshore drilling expansion, calling it “dead on arrival”.\n\nOffshore oil development has faced bipartisan opposition in Florida, where unblemished beaches and sparkling waters underpin the state’s $131bn tourism industry.\n\nskip past newsletter promotion Sign up to This Week in Trumpland Free newsletter A deep dive into the policies, controversies and oddities surrounding the Trump administration Enter your email address Sign up Privacy Notice: Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on theguardian.com to send you this newsletter. You can complete full registration at any time. For more information about how we use your data see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nSenator Rick Scott, a Florida Republican, dissuaded Trump from offshore drilling plans in 2018. He and his fellow Republican Florida senator, Ashley Moody, co-sponsored a bill that would maintain a ban on drilling.\n\n“As Floridians, we know how vital our beautiful beaches and coastal waters are to our state’s economy, environment and way of life,” Scott said in a statement earlier this month. “I will always work to keep Florida’s shores pristine and protect our natural treasures for generations to come.”",
  "summary": "<p>But Sunshine state Republicans might oppose drilling off state’s famous beaches that keep tourism dollars coming in</p><p>The <a href=\"https://www.theguardian.com/us-news/trump-administration\">Trump administration</a> on Thursday announced new oil and gas drilling off <a href=\"https://www.theguardian.com/us-news/california\">California</a>’s and <a href=\"https://www.theguardian.com/us-news/florida\">Florida</a>’s coasts, setting the stage for a political showdown – including with Sunshine state <a href=\"https://www.theguardian.com/us-news/republicans\">Republicans</a> who have largely opposed petroleum development in the Gulf of Mexico.</p><p>This announcement comes as the US petroleum industry, despite <a href=\"https://www.politico.com/news/2025/11/20/trump-administration-california-florida-oil-drilling-00648189\">contending with low crude prices</a>, has been pushing for an entree to additional offshore drilling areas. The industry’s move for increased access also marks an effort to increase jobs and US energy independence, <a href=\"https://www.pbs.org/newshour/politics/trump-administration-proposes-new-oil-drilling-off-the-coasts-of-california-and-florida\">according to the Associated Press</a>.</p> <a href=\"https://www.theguardian.com/us-news/2025/nov/20/white-house-new-oil-gas-drilling-california-florida\">Continue reading...</a>",
  "published": "Thu, 20 Nov 2025 23:54:35 GMT",
  "url": "https://www.theguardian.com/us-news/2025/nov/20/white-house-new-oil-gas-drilling-california-florida",
  "source": "The Guardian"
}