{
  "title": "More details of US plan for Ukraine emerge, sees territory ceded to Russia",
  "text": "More details are emerging from a 28-point peace plan backed by United States President Donald Trump aimed at ending Russia’s four-year war on Ukraine, with several media outlets and officials confirming that the plan, which has yet to be officially published, appears to favour Russia.\n\nDetails of the plan also come after US ambassador to the United Nations, Mike Waltz, told the UN Security Council on Thursday afternoon that the US had offered “generous terms for Russia, including sanctions relief”.\n\n“The United States has invested at the highest levels, the president of the United States personally, to end this war,” Waltz told the council.\n\nIn the meantime, Russia’s unrelenting attacks on Ukraine continue. A Russian strike on the city of Zaporizhia in southern Ukraine late on Thursday killed five people and wounded three others, emergency services said. Russia has been gaining ground in the Zaporizhia region that houses the southeastern Ukrainian city that straddles both banks of the Dnipro River.\n\nThe AFP news agency reported on Friday that the plan, which the US views as a “working document”, says that “Crimea, Lugansk [Luhansk] and Donetsk will be recognised as de facto Russian, including by the United States”.\n\nThis corresponds with an earlier report from US media outlet Axios.\n\nThe Associated Press (AP) news agency also reported on Friday that the plan would require Ukraine to surrender the Donbas, which includes the Luhansk and Donetsk regions that Ukraine currently partly holds.\n\nUnder the draft, Moscow would hold all the eastern Donbas region, even though approximately 14 percent still remains in Ukrainian hands, AP reported.\n\nAdvertisement\n\nAFP and AP also confirmed Axios’s earlier report that the plan would require Ukraine to limit the size of its military.\n\nAccording to AFP, the plan specifically says that the army would be limited to 600,000 personnel. Ukraine is estimated to currently have just under 900,000 active duty military staff.\n\n‘A neutral demilitarised buffer zone’\n\nUkrainian member of parliament Oleksiy Goncharenko shared a document showing what appeared to be the full 28-point peace plan with his 223,000 followers on the Telegram messaging app, late on Thursday, Ukraine time.\n\nRussia’s state TASS news agency also reported on details included in the document shared by Goncharenko, saying it “purportedly represents a Ukrainian translation of 28 points of the new American plan for a peace settlement in Ukraine”.\n\nNew details included in the document shared by Goncharenko include that “Ukraine has the right to EU [European Union] membership” and that the “United States will work with Ukraine to jointly restore, develop, modernise, and operate Ukraine’s gas infrastructure, including pipelines and storage facilities”.\n\nThe document also states that Ukraine’s “Zaporizhzhia Nuclear Power Plant will be commissioned under [UN nuclear agency] IAEA supervision, and the electricity generated will be shared equally between Russia and Ukraine in a 50:50 ratio”.\n\nThe text of the document shared by Goncharenko also states that “Ukrainian forces withdraw from the part of the Donetsk region that they currently control, and this withdrawal zone will be considered a neutral demilitarised buffer zone”.\n\nHanding over territory to Russia would be deeply unpopular in Ukraine and would also be illegal under Ukraine’s constitution. Ukraine’s President Volodymyr Zelenskyy has repeatedly ruled out such a possibility.\n\nZelenskyy has said he’s willing to work with the United States on the plan, despite pushback from European allies who say that the US-backed plan heavily favours Russia. Zelenskyy’s office on Thursday confirmed that he had received a draft of the plan, and that he would speak with Trump in the coming days.\n\nThe Ukrainian president said on Telegram that “Ukraine needs peace. And real peace is one that will not be broken by a third [Russian] invasion. A dignified peace is that the conditions are respectful of our independence, our sovereignty, and the dignity of the Ukrainian people.”\n\nNo NATO membership for Ukraine\n\nThe AFP news agency also reported that, according to the plan, European fighter jets would be based in Poland specifically to protect Ukraine.\n\nAdvertisement\n\nHowever, Kyiv would have to concede that no NATO troops would be stationed in Ukraine and that it would agree never to join the military alliance.\n\nAdditional details reported by AP include that Russia would commit to making no future attacks on Ukraine, something the White House views as a concession by Moscow.\n\nIn addition, $100bn in frozen Russian assets would be dedicated to rebuilding Ukraine, AP reported.\n\nRussia would also be re-admitted to the G8 group of nations and be integrated back into the global economy under the plan, according to AFP.\n\nWhite House Press Secretary Karoline Leavitt said on Thursday that both Ukrainians and Russians have had input into the plan, which she said US Secretary of State Marco Rubio and US special envoy Steve Witkoff have been quietly working on for a month.",
  "summary": "Ukraine MP publishes full text of apparent draft proposal as US envoy says Washington offered Russia &#039;generous terms&#039;.",
  "published": "Fri, 21 Nov 2025 03:32:30 +0000",
  "url": "https://www.aljazeera.com/news/2025/11/21/more-details-of-us-plan-for-ukraine-emerge-sees-territory-ceded-to-russia?traffic_source=rss",
  "source": "Al Jazeera – Breaking News, World News and Video from Al Jazeera"
}