{
  "title": "A silent kidney crisis is spreading faster than anyone expected",
  "text": "A growing number of people worldwide are now believed to have reduced kidney function, according to a new analysis. The number of affected individuals increased from 378 million in 1990 to 788 million in 2023. As populations have expanded and grown older, the condition has reached a point where it is now listed among the top 10 causes of death across the globe.\n\nResearchers from NYU Langone Health, the University of Glasgow, and the Institute for Health Metrics and Evaluation (IHME) at the University of Washington led the investigation. Their work focused on chronic kidney disease, a condition in which the kidneys gradually lose the ability to clear waste and extra fluid from the bloodstream. Early stages often produce no noticeable symptoms, while advanced disease may require dialysis, kidney replacement therapy, or a transplant.\n\nGlobal Burden and Mortality Trends\n\nThe study estimates that roughly 14% of adults worldwide live with chronic kidney disease. In addition, approximately 1.5 million people died from the condition in 2023. When changes in population age structures are taken into account, this represents more than a 6% increase in deaths since 1993.\n\n\"Our work shows that chronic kidney disease is common, deadly, and getting worse as a major public health issue,\" said study co-senior author Josef Coresh, MD, PhD, director of NYU Langone's Optimal Aging Institute. \"These findings support efforts to recognize the condition alongside cancer, heart disease, and mental health concerns as a major priority for policymakers around the world.\"\n\nGrowing Health Priority for Global Agencies\n\nIn May, the World Health Organization added chronic kidney disease to its list of health priorities aimed at reducing early deaths from noncontagious diseases by one-third before 2030. Coresh, who is also the Terry and Mel Karmazin Professor of Population Health at the NYU Grossman School of Medicine, notes that identifying current patterns in the disease is essential for developing effective strategies.\n\nThe new report was published online Nov. 7 in The Lancet and, according to the authors, represents the most detailed assessment of chronic kidney disease in nearly ten years. It is also being presented at the American Society of Nephrology's annual Kidney Week conference.\n\nHow the Study Was Conducted\n\nThe research was part of the Global Burden of Disease (GBD) 2023 study, considered the most wide-ranging effort to track health-related loss in countries over long periods of time. Findings from this initiative frequently inform public health policy and guide future research.\n\nTo generate the new estimates, the team examined 2,230 scientific papers and national health datasets from 133 countries. Their work centered not only on diagnoses and deaths, but also on the level of disability associated with chronic kidney disease.\n\nLinks to Heart Disease and Leading Risk Factors\n\nAnother key conclusion was that impaired kidney function is a major contributor to heart disease. The study reports that it accounted for about 12% of global cardiovascular deaths. In 2023, chronic kidney disease ranked as the 12th leading cause of disability-related reductions in quality of life. High blood sugar, high blood pressure, and high body mass index (a measure of obesity) were identified as the most significant risk factors for developing the condition.\n\nMost individuals in the study were in the early stages of chronic kidney disease. Coresh emphasizes that this is a crucial window for intervention, as timely treatment and lifestyle changes can prevent the need for dialysis or transplantation later on.\n\nAccess to Treatment Remains Uneven Worldwide\n\nCoresh also points out that in parts of sub-Saharan Africa, Southeast Asia, Latin America, and other lower-income regions, many people do not receive dialysis or transplants. These therapies are less accessible and often too expensive for widespread use in those areas.\n\n\"Chronic kidney disease is underdiagnosed and undertreated,\" said study co-lead author Morgan Grams, MD, PhD. \"Our report underscores the need for more urine testing to catch it early and the need to ensure that patients can afford and access therapy once they are diagnosed.\"\n\nNew Therapies but Slow Global Progress\n\nGrams, the Susan and Morris Mark Professor of Medicine at the NYU Grossman School of Medicine, notes that several new medications introduced over the past five years can slow disease progression and reduce the likelihood of heart attack, stroke, and heart failure. Even so, she explains that it will take time before the benefits of these treatments are reflected worldwide.\n\nShe also warns that because chronic kidney disease is often not tested for, its true global prevalence may be even higher than the study suggests.\n\nStudy Support and Research Team\n\nThe project was funded by National Institutes of Health grant R01DK100446, the Gates Foundation, and the National Kidney Foundation.\n\nCoresh serves as a scientific adviser and equity holder in Healthy.io, a health technology company that provides remote clinical testing and related services. He also works as a consultant for SomaLogic. These roles are disclosed and managed according to NYU Langone Health policies.\n\nAlong with Coresh and Grams, Patrick Mark, PhD, at the University of Glasgow, and Lauryn Stafford, MS, at IHME at the University of Washington in Seattle, were co-lead authors.\n\nAdditional co-senior authors included Jennifer Lees, PhD, at the University of Glasgow, and Theo Vos, PhD, and Liane Ong, PhD, at IHME at the University of Washington in Seattle.",
  "summary": "Chronic kidney disease has surged to nearly 800 million cases and is now among the top causes of death worldwide. The condition is heavily linked to diabetes, hypertension, and obesity, and often goes unnoticed until late stages. Many countries lack access to dialysis and transplants, leaving millions without adequate care.",
  "published": "Tue, 18 Nov 2025 10:07:29 EST",
  "url": "https://www.sciencedaily.com/releases/2025/11/251117095646.htm",
  "source": "All Top News -- ScienceDaily"
}