{
  "title": "How much are Browns to blame for 'rough' Sanders debut?",
  "text": "Sanders is used to being in the spotlight as his father is two-time Super Bowl winner Deion Sanders, who was also his son's head coach throughout his college career.\n\nShedeur earned about $6.5m (£4.9m) through name, image or likeness (NIL) deals in college, and his watch celebration was copied by players in the NFL, NBA and WNBA in 2023.\n\nHe was the initial favourite to be the first overall pick in this year's draft, but as NFL evaluators began to assess him, his draft stock fell.\n\nConcerns were raised over his ability and attitude. One coach even said his team's chat with Sanders was \"the worst formal interview I've ever been in\".\n\nEven so, he was still expected to be taken in the first round. When he was not selected till the fifth - Cleveland trading up to take him with the 144th overall pick - it ended the most dramatic draft slide in NFL history.\n\n\"He grew up with a celebrity upbringing and has a really devout fanbase,\" said ESPN's Cleveland Browns reporter Daniel Oyefusi.\n\n\"He was one of the biggest stars in the NFL as soon as he was drafted, but he didn't have the credentials to back it up to this point. So regardless of what he does, what he says, there's going to be a lot of attention, a lot of discussion, and he's just overall a very polarising player, for better or worse.\"\n\nIt was also surprising that it was Cleveland that put Sanders out of his misery. They had already drafted Gabriel and Sanders was the fourth quarterback they signed in the off-season.\n\nSanders was fourth on the Browns' depth chart but impressed in their first pre-season game, then began the campaign as their third-choice quarterback, and became back-up to Gabriel when veteran Joe Flacco was traded on 7 October.",
  "summary": "Shedeur Sanders' long-awaited NFL debut did not go as he had hoped but how much are the Cleveland Browns to blame for the way they have handled the rookie?",
  "published": "Thu, 20 Nov 2025 10:08:54 GMT",
  "url": "https://www.bbc.com/sport/american-football/articles/ckg4kg359xlo?at_medium=RSS&at_campaign=rss",
  "source": "BBC Sport"
}