{
  "title": "White nationalist Nick Fuentes is exposing a civil war among US Republicans: ‘We look like clowns’",
  "text": "View image in fullscreen Composite: The Guardian/Getty Images\n\nFive days a week, thousands of fans gather online to watch Nick Fuentes hold court about the dangers of non-white immigration, feminism and “organized Jewry”. Usually dressed in a dark suit and tie, he lectures to his far-right followers, known as “Groypers”, about what he argues is the insufficient radicalism of Donald Trump’s Republican party and what he describes as the perfidies of the state of Israel and its American supporters.\n\nFuentes’s fixation with Israel is not rooted in concern about the war in Gaza but a belief, in his telling, that Jews are responsible for most of society’s problems. Fuentes, who is 27 and lives in Illinois, has called Adolf Hitler “really fucking cool” and compared the Holocaust to the baking of cookies.\n\nDespite that – and despite having said that the Republican vice-president, JD Vance, is a “race traitor” for marrying an Indian American woman – Fuentes has ascended in recent weeks from the influential but unacknowledged outer dark of the American right to a position within striking distance of the mainstream Republican party. He has been interviewed on several major platforms in rapid succession, culminating in a friendly, two-hour chat last month on Tucker Carlson’s popular online talkshow. He and Carlson discussed a variety of subjects, including their shared dislike of Christian Zionists. Fuentes also said, casually, that he was a fan of Joseph Stalin.\n\nThe result of that interview has been a bitter and widening civil war within the American right that has exposed longstanding fissures – between conservatives and populists, Zionists and Israel skeptics, mainstream Maga right and far right – as well as revealed the extent to which a Republican party that has been flooded in recent years by extremists now seems unable to contain them, or even agree if it should. A power struggle already under way inside many rightwing organizations, people familiar told me, has now spilled into the open.\n\nAfter Carlson interviewed Fuentes, some Republican politicians, including the senators Mitch McConnell and Ted Cruz, condemned his decision to do so. Pressure also built on the Heritage Foundation, a conservative thinktank with personal and commercial ties to Carlson, to distance itself from him. Instead, the foundation’s president, Kevin Roberts, issued a video statement which noted that while antisemitism “should be condemned”, “conservatives should feel no obligation to reflexively support any foreign government, no matter how loud the pressure becomes from the globalist class”. A “venomous coalition”, he said, was trying to “cancel” Carlson.\n\nThis delighted Fuentes. The Heritage Foundation was “the brain of the conservative movement”, he correctly told his viewers on a recent evening, whose policy ideas and talking points are “sort of like gospel for [Republicans] in the US Congress. It’s a big deal.” Staff from the Heritage Foundation often go on to work for Republican legislators and draft federal law; Groyperism, he argued, was now “inside the institutions”.\n\nView image in fullscreen An upside-down American flag, sometimes used as a pro-Trump symbol, flies at the Heritage Foundation in Washington DC. Photograph: José Luis Magaña/AP\n\nRoberts soon backtracked. He issued a second statement more explicitly condemning Fuentes. He has also apologized for using the terms “venomous coalition” and “globalist class”, saying he did not realize their antisemitic connotations.\n\nBut a civil war broke out at the organization, in the form of information leaks, anguished meetings, and fighting on social media. Many current or former employees expressed horror at Roberts’s seeming initial reluctance to distance Heritage from the far right. “I gave my soul to that place …” someone told me, choking up. (Like some others I spoke to, this person asked for anonymity to speak freely and to avoid drawing online harassment.)\n\nNot everyone sees it that way, however. Under the slogan “No enemies to the right”, some populists have fiercely defended Carlson, or argued that the controversy is being exploited by “BoomerCons”, “Reagan zombies” and “right liberals” trying to protect a dying conservative establishment from a new right populist tide.\n\nThe turmoil has engulfed more and more of the right. Earlier this month, two board members of the Intercollegiate Studies Institute (ISI), another influential conservative group, resigned; in a public letter, they alleged that a “cadre” hostile to liberal democracy – with an agenda different from, and more radical than, Trump’s – have “worked together, behind the scenes, to wrest control of conservative institutions from actual conservatives”, in the process infiltrating “white supremacy, antisemitism, eugenics, and bigotry”.\n\nConservative institutions [...] are now squeezed between a strident Maga mainstream and a naked far right\n\nThey noted that ISI recently unveiled a new podcast whose first guest, Curtis Yarvin, has defended slavery, said that white people have inherently higher IQs than black people and called for the American republic to be replaced with a dictatorship. Conservatism, they argued, was in an “existential” crisis.\n\nComing shortly after Politico revealed that a number of prominent young Maga activists had a racist and antisemitic group chat, and in the aftermath of a poor Republican election showing and rising Maga disappointment in Trump’s second term, this internecine battle has become a referendum on the future of the right – as well as a vivid illustration of how conservative institutions anxious to prove themselves radical enough for the age of Trump are now squeezed between a strident Maga mainstream and a naked far right.\n\nNo one wants responsibility for creating the monster. Yet everyone I spoke to, when pressed, agreed on at least one thing: that the Fuentes-Carlson-Heritage scandal has exposed a deep schism in the right that will explode open when Trump departs the White House. So far, the person most pleased about that is Fuentes.\n\nIf you are young, male and spend a lot of time online, you have probably encountered clips of Fuentes – somehow square-jawed and baby-faced simultaneously, and usually either grinning wolfishly or leaning at the viewer with a news anchor’s seriousness.\n\nAlthough Fuentes is banned from YouTube and other platforms for violating hate-speech policies, Elon Musk allowed him back on X last year on freedom-of-expression grounds. Since then, Fuentes’s posts and video clips seem to have become algorithmically turbocharged; on election night, 2024, he took to social media to deride pro-choice women: “Your body, my choice. Forever.” His post was viewed more than 90m times; some schools reported boys taunting female classmates with the phrase. (Fuentes could not be reached for comment.)\n\nIn October, before it was removed, his podcast briefly became the highest-trending on Spotify, ahead of the podcasts of Joe Rogan, Amy Poehler and Carlson himself. In recent months, Fuentes has appeared on popular shows including Red Scare, the PBD Podcast and System Update with Glenn Greenwald.\n\nFuentes grew up in a middle-class, mostly white, suburb of Chicago, in a Catholic family. Neither of his parents attended college. (His father is of Mexican American descent, hence his Hispanic surname.) He was a debating star in high school and the student body president. His parents – though not his twin sister – may partly share his racist views, according to Patch and Mother Jones.\n\nAs a teenager, Fuentes adored talk radio, particularly Mark Levin, a rightwing and staunchly Zionist commentator known for his outraged tone and for arguing with callers. Fuentes listened to him “every day” in high school, he told Carlson: “I actually liked how he was kind of obnoxious and mean to his callers, vicious … I thought that was funny. But I’ll never forget one show … he says: ‘America is becoming a majority non-white country. Does anybody think that’s a good idea?’ And I was thinking to myself, yeah, that actually doesn’t sound so good.”\n\nWhen he arrived at Boston University, in 2016, he shocked liberal classmates by wearing a Maga hat and telling a video interviewer that he was voting for Trump. “People were threatening to find him and beat him up,” a student who led a libertarian group at BU at the time told me.\n\nThe libertarian group decided to hold a public debate between Fuentes and a leftwing student, two days before the presidential election; 400 students turned up. Fuentes attacked multiculturalism, according to a campus newspaper, but denied he was racist. “It has nothing to do with race, everything to do with culture,” he said. “Asia has taken our culture and done well for themselves. The Middle East? Not so much.”\n\nView image in fullscreen Nick Fuentes holds a rally in Michigan on 11 November 2020. Photograph: Nicole Hester/AP\n\nDespite a hostile crowd, Fuentes was “articulate and confident, and had that air of somebody good at public speaking”, the libertarian-group leader recalled. Fuentes’s politics at that time seemed to be “standard Maga. I mean, there was nothing that Trump himself hadn’t said.”\n\nImpressed by his debate performance, some fellow young conservatives got Fuentes a slot on Right Side Broadcasting Network (RSBN), a startup that aspired to be unapologetically Maga at a time when Trump was still polarizing within the right. This would be a pattern: seeing Fuentes’s oratorical gifts, conservatives would elevate him, then regret it.\n\nFuentes soon alienated his new friends by bucking the pro-Israel line standard at many conservative publications. He also exhibited more unsettling behavior. RSBN was forced to apologize when Fuentes, during an anti-Islam rant, called for the “globalists … that run CNN” to be “deported or hanged”. Soon after, a conservative social media account leaked a candid video in which Fuentes described interracial sex as “degenerate” and said that he was harmed in daily life by Jews.\n\nThe leaker hoped to discredit Fuentes, but only half succeeded. Drummed out of the Maga mainstream, he embraced a new and potent audience. After he was seen in 2017 at the notorious Unite the Right rally in Charlottesville, Virginia, he dropped out of college and became a full-time white nationalist.\n\nFuentes cultivated himself as a suited-and-tied pundit dedicated to the Maga-adjacent slogan “America first”. In 2021, he held the inaugural America First Political Action Conference (AFPAC) as a far-right response to the Conservative Political Action Conference (CPAC), which he is barred from attending. He was also present at the 2021 riot at the US Capitol, though he did not enter the building.\n\nThis anger is a preview of the fractiousness we’re going to see when Trump is no longer the superhero of the new right David French\n\nFuentes also began embracing the rhetoric of Christian nationalism, casting himself as a traditionalist Catholic, decrying feminism and using crucifixes as props – although a rival white nationalist who lived with Fuentes for a time has said that he rarely attended mass and loved HBO shows such as Euphoria and The Sex Lives of College Girls. Fuentes has also argued that many women “want to be raped” and has claimed, perhaps facetiously, that “the only really straight heterosexual position is to be an asexual incel”.\n\nAround 2022, Fuentes became friendly with the rapper Kanye West, whose own views had grown antisemitic and conspiratorial. That relationship climaxed, that year, with Fuentes and West dining with Trump at Mar-a-Lago. (Trump later said he did not know who Fuentes was.) Trump’s agreement to meet them was widely criticized, but did not incite nearly the outrage on the right that Carlson’s interview has now.\n\nThat is because Trump is “he-who-must-not-be-critiqued”, David French, the conservative New York Times columnist, told me. “We’ve seen this a lot in the second Trump term. People feel free to get angry at Pam Bondi over the Epstein files, or at Pete Hegseth, or at Robert F Kennedy Jr, but Trump is always left out of it.”\n\nYet Fuentes’s mainstreaming is forcing open a bloody ideological divide that only Trump’s cult of personality has so far kept scabbed over. “This anger,” French said, “is a preview of the fractiousness we’re going to see when Trump is no longer the superhero of the new right.”\n\nToday, Fuentes’s main media outlet is his nightly live stream on Rumble, an online broadcasting platform. He is often hours late to his own show. While they wait for “Nicker”, fans with usernames such as “CruiseBasher”, “ShekelSnatcher” and “BadGoy74” argue with each other and trade racist jokes. Sometimes users spam the chat with false information that the evening’s program has been cancelled, leading others to wonder if they are spies of the Mossad.\n\nOnce he’s on air, Fuentes’s show is much the same each night. He attacks the Maga right from the further right – forcing mainstream populists to either engage with him, thereby letting Groyperism into the tent, or refuse and be painted as centrist sellouts. The late Maga activist Charlie Kirk, founder of Turning Point USA, was one of his biggest quarries; in 2019 Groypers began harassing Turning Point events and heckling Kirk for supporting Israel.\n\n“My job,” Fuentes said in 2021, “is to keep pushing things further … We’re going to get called racist, sexist, antisemitic, bigoted, whatever. When the party is where we are, two years later, we’re not going to get the credit.” But “that’s OK … We are the rightwing flank of the Republican party.”\n\nPart of Fuentes’s power is that he is also a free agent – an enfant terrible who can react to events in a way that others on the right cannot. He can criticize Trump (“tired”, with an administration that “is cooked”), or Vance (“a dork”), or mock Maga conspiracy theories that others are reluctant to acknowledge are silly. And he can attack what was until recently one of the right’s last true sacred cows: Israel.\n\nFor years modern conservatism was defined by rules set down by its intellectual architect, William F Buckley. Starting in the second half of the 20th century, the right “fused” three seemingly unrelated tenets – social conservatism, foreign policy hawkishness and free-market libertarianism – into the united front of the Reagan revolution.\n\nThat coalition endured for decades. It also came to adopt a reflexively pro-Israel stance, particularly as evangelical Protestants, some of whom believe that Christians are biblically required to support modern Israel, became a key Republican voting bloc. Rightwing Israelis also cultivated a close relationship with the American right because they believed that conservative evangelicals would prove more reliable Zionists than liberal Jewish Americans.\n\nIn the eyes of many conservatives, Buckley’s equally important legacy was practicing “hygiene” by ejecting cranks and bigots from the movement. He exiled a number of writers – such as Peter Brimelow, Sam Francis, John Derbyshire and Joseph Sobran – for racist or fringe thinking, and in 1991, he accused the conservative writer and politician Pat Buchanan, who was known for fulminating against Israel and its US supporters in terms that seemed to single out Jews, of rhetoric “amount[ing] to antisemitism”.\n\nBuchanan was also a hardline immigration restrictionist, isolationist and advocate for tariffs to protect American workers – views that were out of step with the right of the 1990s, but which now look like an uncanny prediction of Maga populism.\n\nThere’s a constant yearning for something more and more radical ... Rightwing support for Israel is almost like the last thing standing Laura K Field\n\nToday a critical mass of people at conservative organizations, including many younger staff, are more sympathetic to Buchanan’s vision than to Buckley’s or Reagan’s. Many view US institutions as irredeemably decadent and corrupt, and are less interested in “conserving” them than burning them to the ground. In some cases they are hostile not just to progressivism, but to liberal democracy itself.\n\nThis turn has been more radical than many older conservatives “have been willing to admit to themselves, and a lot more radical than I think the American electorate really understands”, Laura K Field, a political theorist and the author of Furious Minds: The Making of the MAGA New Right, told me. Her book charts how the ideas of a small group of reactionary intellectuals influenced the Trumpian right.\n\nIn the process of this turn, she said, Buckley’s cordon sanitaire against the far right – which some skeptics say was overstated to begin with – ha “completely broken down”. Parts of the new right are eager to rehabilitate Buchanan and others expelled from conservatism decades ago, as well as mainstream newer figures such as Fuentes and Yarvin.\n\nAt the same time, populist Maga views that were once controversial in the Republican party – on tariffs or immigration, for example – have become standard positions, meaning that firebrand pundits who like to frame themselves as radical outsiders (Carlson, Steve Bannon) are keen for new ways to differentiate themselves from the establishment.\n\n“There’s a constant yearning for something more and more radical,” Field said. “Rightwing support for Israel is almost like the last thing standing.”\n\nAnd cracks are showing in that support. The most radical and influential rightwing intellectuals today tend to be Catholic, not Protestant, without older evangelical Protestants’ historical investment in Israel. At the same time, younger evangelical Protestants increasingly regard Christian Zionism as a bizarre and embarrassingly dated tic of their boomer parents.\n\nThose demographic changes coincide with rising public anger, across the political spectrum, at the US’s role in a grinding foreign war that has killed thousands of civilians to no apparent end, and with the rise of a Christian nationalism that has replaced the earnest philosemitism of older Christian conservatives with a religious fervor that views Jews with polite distance or even suspicion.\n\nAll of which contributed to the Heritage Foundation – caught between a historically pro-Israel, hawkish older right and a radical new one – walking right into disaster. Founded in 1973, the thinktank is a fundraising powerhouse with a staff of 400 and a budget of $100m. Among the major right-of-center thinktanks, it is known as the most political and perhaps least intellectual, and as a wobbly weather vane that has often, in recent years, seemed to be trying to “catch up” to Maga populism and prove a slavish loyalty to Trump.\n\nIn 2023, the Heritage Foundation released Project 2025, a 900-page manifesto for the incoming second Trump administration that proposed, among other things, criminalizing pornography and loyalty-testing civil servants. Democrats successfully seized on the document as a talking point. Angry at the fallout, and at Heritage’s presumptuousness, Trump temporarily distanced himself from the organization.\n\nIn 2021, Kevin Roberts became the new president of the Heritage Foundation – taking over from Kay Cole James, a black woman and former George W Bush official whom Carlson had attacked on Fox for being too sympathetic to the George Floyd protests.\n\nIn contrast, Roberts is an ardent culture warrior who wears cowboy boots, drives a diesel Ford F-150 with a “Don’t Tread on Me” license plate, and idolizes Buchanan. He was previously the president of a tiny conservative Catholic college in Wyoming whose students learn Latin and horseback riding and can attend Byzantine mass. The stageplay Heroes of the Fourth Turning, shortlisted for a 2020 Pulitzer, is set at a thinly fictionalized version of the college. (Roberts and Heritage did not respond to requests for comment.)\n\nRoberts is part of a circle of radical new right intellectuals who call themselves “post-liberals”, Catholic integralists or “national conservatives”. Many are traditionalist Catholics (or Eastern Orthodox), often converts, and, like Roberts, have ties to Opus Dei, the ultraconservative Catholic order. They believe that the consensus that Buckley upheld was not true conservatism, but merely a right-leaning liberal capitalism that sacrificed America to globalization, mass immigration, consumerism, foreign misadventure and secular decadence. The group are close to Vance, who has described himself as post-liberal. (Vance did not respond to a request for comment.)\n\n“I think you’ll never get on the board of Heritage, ISI, or whatever unless you’re part of this true believer circle – a real post-liberal, and a hardcore traditionalist Catholic or Orthodox,” someone close to those organizations told me.\n\nView image in fullscreen Kevin Roberts, the president of the Heritage Foundation, in Washington DC in October 2022. Photograph: Tom Williams/CQ-Roll Call, Inc/Getty Images\n\nRoberts is indulgent of friends and allies. In 2022, the Dispatch exposed a young conservative writer who had previously criticized Groyperism, Nate Hochman, for participating in a private online debate with Fuentes in which he had criticized Fuentes’s tactics but told him: “I respect some of what you’re doing.” (“In an attempt to get him to engage,” Hochman said at the time, “I said some really stupid things, which I don’t actually believe.”) Roberts later had Hochman on his podcast, in what seemed like an effort to rehabilitate someone he considered unfairly treated. Hochman then got a job with the Florida governor, Ron DeSantis, before being fired in 2023 after creating an unauthorized campaign video containing Nazi symbolism. (Hochman, who now works for Senator Eric Schmitt, could not be reached for comment.)\n\nDespite Roberts’s bona fides, some observers told me, he has a fatal flaw common to leaders on the new right: he is ideologically insecure, and anxious to be perceived as sufficiently hardcore in a movement where moderation is viewed as cowardice and transgression signals that one is strong enough to battle for civilization.\n\n“We are in the process of the second American revolution, which will remain bloodless if the left allows it to be,” Roberts said last year. On another occasion, he said: “The future won’t belong to soft men chasing comfort. It will belong to those who risk safety to defend their homeland, their families, and their faith.” (Roberts has denied that his views are extreme, suggesting elsewhere that international elites who “erase borders, criminalize faith, and preach globalism” are the extremists.)\n\nIn a scathing essay, Oren Cass, a policy commentator whose economic ideas have been popular in some Maga circles, recently described Roberts as someone who had tried to hold a day job as a “credible conservative leader” while moonlighting as a “cheerleader for fever-swamp extremism”.\n\nRoberts plays with “divisive, nonsensical gasoline, aimed at impressing a narrow constituency”, Cass argued – and last month that gasoline finally met “a sufficiently hot and prominent surface that it blew up in his face”.\n\nSince being fired from Fox News in 2023, Carlson has started an independent online talkshow that has quickly become one of the most popular in America. Embracing a longform conversational format similar to Joe Rogan’s, he has interviewed a variety of guests that would have been outre at Fox, including the podcaster Darryl Cooper, who argued that Winston Churchill, not Hitler, was the “chief villain” of the second world war. As a source for his claims, Cooper later cited the work of the Holocaust denier David Irving.\n\nCarlson’s show has also devoted an extraordinary amount of coverage to the US’s relationship with Israel – raising legitimate concerns about US foreign policy and the war in Gaza, but with a fervor and unevenhandedness that made some conservatives uneasy.\n\nWhen Carlson’s Fuentes interview debuted, on 27 October, it hit the conservative world like a meteor. Speaking on Megyn Kelly’s show, Carlson said that he was trying to gently moderate Fuentes’s views. A piece in the Federalist argued, similarly, that Carlson was trying to “offer Fuentes some fatherly correction and redirection”. (Carlson declined to comment for this article, saying in a text message that he gave his “full views” to Kelly.)\n\nAny tent that’s big enough to include Groypers and neo-Nazis shouldn’t be called conservative … It’s something else entirely Mark Goldfeder\n\nMany conservatives were less persuaded – and the Heritage Foundation was in the meteor’s blast radius. Roberts was well-known friends with Carlson, and until earlier this year Heritage sponsored episodes of Carlson’s show. Soon after the Fuentes interview, a blurb from Carlson disappeared from the Heritage website. Staff wondered if Roberts would do anything to draw further distance, or simply take the prudent course of saying nothing. Instead, he issued the video defending Carlson.\n\nThe situation exploded. Angry staffers began posting the phrase “NAZIS ARE BAD” on social media. Robert George, a Princeton legal scholar on Heritage’s board of trustees, tried to build a board majority to oust Roberts, according to the New York Post, and has since resigned. A number of conservatives on a Heritage antisemitism taskforce also quit in protest.\n\n“Any tent that’s big enough to include Groypers and neo-Nazis shouldn’t be called conservative,” Mark Goldfeder, who resigned, told me. “It’s something else entirely.”\n\nOn 5 November, Heritage had a long, emotional, all-hands meeting, footage of which leaked online. Roberts apologized for his handling of the controversy. “I made a mistake,” he told staff, adding: “You can say you’re not going to participate in canceling someone … while also being clear you’re not endorsing everything they’ve said, you’re not endorsing softball interviews.”\n\nRoberts also said that he had not understood who Fuentes was. Although he is the leader of one of the most important political thinktanks in the US, and paid more than $800,000 a year, he said that he mainly watched “sports”, and did not “consume a lot of news”.\n\nAfter he spoke, staff gave questions and remarks. These exchanges illuminate a fascinating generational divide at the organization; at times the meeting seemed like a rightwing answer to the kinds of confrontations that swept left-leaning institutions around five years ago, when older liberals at newsrooms, non-profits and educational organizations seemed to speak a different language from their more radical younger colleagues.\n\nMany of the most veteran employees spoke first, some with voices trembling with emotion, to decry antisemitism and white nationalism. Asking why now would be any different, a staffer who had worked at Heritage for 47 years invoked Buckley’s purging of the far right: “Did we ‘cancel’ David Duke? Yes. Did we ‘cancel’ the John Birch Society? Yes … Because they were harmful. Because if they’re in your movement, you look like clowns.”\n\nOn the other hand, “a handful of young colleagues and I had no issue with the points you made in the original video,” a young female staffer said. “Gen Z has an [increasingly] unfavorable view of Israel, and it’s not because millions of Americans are antisemitic. It’s because we are Catholic and Orthodox and believe that Christian Zionism is a modern heresy.”\n\nReferring to a proposal by some Jewish conservatives to host Shabbat dinners for Heritage staff as an intercultural exercise, Evan Myers, an adviser to Roberts, said: “For many Christians, Friday is a special day of prayer and abstinence to commemorate the death of Christ … I assume that no staff will be required to attend the Shabbat dinners.” He was concerned, he said, that the dinners might be a “litmus test”.\n\nDuring the meeting, Roberts said that his chief of staff, Ryan Neuhaus, had ghostwritten the video defending Carlson, and implied that Neuhaus had misled him into thinking that other staff had approved it. (Neuhaus, who has since resigned, could not be reached for comment.)\n\nAround the time of the video, Neuhaus also began retweeting posts on X defending Carlson and arguing that the right would be better off today if conservatives had never “cancelled” Pat Buchanan, John Derbyshire and Sam Francis. One was a photo of Buchanan holding an antique revolver, captioned: “Slowly but surely he will be vindicated.”\n\nOn 7 November, two days after the Heritage Foundation meeting, the board of the Intercollegiate Studies Institute (ISI) convened for its own tense meeting.\n\nIn August, ISI unveiled a new podcast, Project Cosmos, whose first guests were Patrick Deneen, a post-liberal political theorist, and Yarvin, the neo-monarchist. Although there had been two ISI board meetings since Project Cosmos entered production, two members of the board, Christopher Long and Thomas Lynch, have alleged that they were never told the podcast existed.\n\nAt the meeting, they confronted the other members with things Yarvin has said – such as, “If Americans want to change their government, they’re going to have to get over their dictator-phobia” and “Although I am not a white nationalist, I am not exactly allergic to the stuff” – and argued against platforming him.\n\nThey were overruled. When they called a vote of no confidence in John Burtka, ISI’s president, they lost 13-2. Lynch and Long then resigned. They were replaced on the spot by Jordan Teti, a Los Angeles attorney, and Susan Hanssen, a professor of history at the University of Dallas. (Hanssen’s father appears to be the FBI agent Robert Hanssen, who pleaded guilty in 2001 to spying for the Soviet Union and Russia.)\n\n“This group … don’t care about the law, and don’t believe in restraints on power,” a person familiar with ISI said. Some “are self-proclaimed ‘neo-monarchists’. It’s hard to believe, right? But that’s what they say they are.”\n\nIf we look at the root, underlying thing, is it really about Tucker? About Fuentes? About the video? Anonymous source\n\nISI and Burtka did not respond to interview requests, though some activists and intellectuals on the new right have disputed the characterization of recent events. They argue that Reaganite conservatives unhappy at the direction of the right are trying to use the Carlson controversy to smear isolationism and Israel skepticism by associating them with Fuentes’s antisemitism – thereby hindering Vance, who is considered sympathetic to the new right, from succeeding Trump as the leader of the Republican party.\n\nThe old right are “panicking [about] losing their once total monopoly on conservative institutions”, Chad “CC” Pecknold, a professor of theology at the Catholic University of America, said in an email. They “want to demonstrate that they still have power, and have chosen the run-up to the midterms as the time to do maximum damage on new right opponents. They are looking for scalps, and will take any opportunity to smear leaders who have usurped what they regard as their rightful place.”\n\nEven conservatives on the other side acknowledge that they do not represent the zeitgeist. People like Fuentes and Yarvin, French said, “are extraordinarily popular – far more popular, in many ways, than the people critiquing them”.\n\nView image in fullscreen JD Vance boards Air Force Two to travel to a Turning Point USA event in Mississippi on 29 October 2025. Photograph: Jonathan Ernst/Reuters\n\nTrump and Vance have mostly remained out of the fray so far, though Trump told a reporter on Sunday that “you can’t tell [Carlson] who to interview” and on 5 November Vance wrote on X that “infighting is stupid.” Vance is in a difficult spot: Carlson helped get him selected as Trump’s running mate, and Carlson’s son, Buckley Carlson, works for Vance.\n\nVance spoke at a Turning Point event in Mississippi, two weeks ago, where a man in the audience had a question for him: “I’m a Christian man, and I’m just confused,” the man said. “There’s this notion that we … owe Israel something, or that they’re our greatest ally, or that we have to support this [foreign aid package] to Israel to cover … ethnic cleansing in Gaza. I’m just confused why this idea has come around, considering the fact that not only does their religion not agree with ours, but also openly supports the prosecution of ours.”\n\nThe man’s reference to “prosecution”, or persecution, may have been describing recent attacks on Palestinian Christians, but Vance’s answer was also odd; he seemed to discuss Judaism with the conciliatory tact with which an American vice-president might normally describe a foreign nation: “Jews do not believe that Jesus Christ is the messiah; obviously, Christians do believe that,” he said. “There are some significant theological disagreements between Christians and Jews. My attitude is, let’s have those conversations.”\n\nSome of the conservatives I spoke to seemed like they were grappling with a dissonance – that they had spent so long in political battle with the left that they were having trouble, psychically, coming to terms with the idea that the call might be coming from inside their own house.\n\n“Perhaps Roberts made a bad leadership decision – he shouldn’t have released the video, or they shouldn’t have had a relationship with Tucker,” someone tied to Heritage said despairingly. “But if we look at the root, underlying thing, is it really about Tucker? About Fuentes? About the video? Or is it about this” – the speaker searched for the right word – “undercurrent that’s pushing all of this?”",
  "summary": "<p>Tucker Carlson’s interview with the activist revealed the mainstream right is being flooded by extremism – and it’s now impossible to contain</p><p>Five days a week, thousands of fans gather online to watch Nick Fuentes hold court about the dangers of non-white immigration, feminism and “organized Jewry”. Usually dressed in a dark suit and tie, he lectures to his far-right followers, known as “Groypers”, about what he argues is the insufficient radicalism of Donald Trump’s Republican party and what he describes as the perfidies of the state of Israel and its American supporters.</p><p>Fuentes’s fixation with Israel is not rooted in concern about the war in Gaza but a belief, in his telling, that Jews are responsible for most of society’s problems. Fuentes, who is 27 and lives in Illinois, has called Adolf Hitler “really fucking cool” and compared the Holocaust to the baking of cookies.</p> <a href=\"https://www.theguardian.com/us-news/ng-interactive/2025/nov/20/nick-fuentes-tucker-carlson\">Continue reading...</a>",
  "published": "Thu, 20 Nov 2025 13:00:09 GMT",
  "url": "https://www.theguardian.com/us-news/ng-interactive/2025/nov/20/nick-fuentes-tucker-carlson",
  "source": "The Guardian"
}