{
  "title": "Recalled baby formula linked to a botulism outbreak may still be in some stores",
  "text": "Recalled baby formula linked to a botulism outbreak may still be in some stores\n\ntoggle caption Cheyanne Mumphrey/AP\n\nInfant formula linked to a botulism outbreak that has sickened dozens of babies across 15 states may still be on store shelves even after being recalled, federal health officials say.\n\nAs of Wednesday, the Food and Drug Administration (FDA) said, 31 cases of suspected or confirmed infant botulism have been reported in babies who consumed ByHeart Whole Nutrition formula and got sick between August and mid-November.\n\nNo deaths have been reported. But all 31 babies were hospitalized with the illness, which can cause a potentially life-threatening form of gradual paralysis in infants less than a year old.\n\nSponsor Message\n\n\"Epidemiologic and laboratory data show that ByHeart Whole Nutrition infant formula might be contaminated with Clostridium botulinum, which is causing infant illness in multiple regions of the country,\" the FDA said.\n\nByHeart Whole Nutrition recalled two batches of its infant formula earlier this month before expanding the recall to all of its products — which include cans and single-serve packets — last week. They are sold at major retailers — including Target, Publix, Walmart and Whole Foods — and online nationwide, with some products shipped to customers outside the U.S.\n\nByHeart, which describes itself as a \"next-generation baby nutrition company,\" first hit the market in 2022. The FDA says its products make up \"approximately 1%\" of all infant formula sold in the U.S., so it does not have concerns about a potential shortage.\n\nIn an apology note to parents, ByHeart says it is cooperating with the FDA and \"investigating every facet of our process\" to identify the cause of the outbreak.\n\nIn the meantime, the company — along with the FDA — is urging adults to stop using the formula and monitor their babies for symptoms of botulism. The FDA is also asking stores to stop selling the product.\n\nBut in its Wednesday update, the agency said it had \"received reports that recalled formula is still being found on store shelves in multiple states.\" NPR has reached out to the FDA for more information but did not hear back by publication time.\n\nSponsor Message\n\nThe FDA says it is working with state partners and retailers \"to ensure an effective recall\" as its investigation into the outbreak continues.\n\ntoggle caption JoNel Aleccia/AP\n\nWhat we know about the outbreak\n\nAs of Wednesday, the FDA said the 31 cases had been reported in 15 states: Arizona, California, Idaho, Illinois, Kentucky, Maine, Michigan, Minnesota, North Carolina, New Jersey, Oregon, Pennsylvania, Rhode Island, Texas and Washington.\n\nThe outbreak has grown since the FDA first announced its investigation on Nov. 8. At that point, it said that out of an estimated 83 cases of infant botulism reported nationwide since August, 13 of the infants had consumed ByHeart formula at some point.\n\nThat raised red flags, because botulism is uncommon in dairy products and \"there is no historical precedent of infant formula causing infant botulism,\" the FDA said.\n\nIn response, ByHeart promptly recalled two batches of its products. The next day, it announced that the California Department of Public Health had tested a sample from one of those batches, and the result came back positive for Clostridium botulinum, the bacteria that causes infant botulism.\n\nThat sample came from an opened can, which ByHeart originally said did not prove that its product was to blame (as the bacteria can occur naturally in places like soil and dust). But in an FAQ on its website, it now says further testing by a third-party group identified the bacteria in some samples of unopened formula, too.\n\nByHeart says the FDA informed it in a \"late-night call\" on Nov. 10 that it had found two more cases of infant botulism in babies that had consumed its formula. The next day, ByHeart, citing \"too many unanswered questions,\" recalled all of its products and released information for parents about how to switch to a different formula brand.\n\nWhat to know about infant botulism\n\nBotulism is a rare but serious illness caused by Clostridium botulinum. When a baby swallows the spores, \"they grow in the gut and make toxin,\" according to the Centers for Disease Control and Prevention (CDC).\n\nSponsor Message\n\nSymptoms can appear three to 30 days after consuming the bacteria, and generally start with constipation, poor feeding, difficulty swallowing and loss of head control.\n\n\"If untreated, infants with infant botulism experience a progressive, flaccid paralysis that can lead to breathing difficulties and require weeks of hospitalization,\" the CDC says.\n\nTreatment for infant botulism involves an antitoxin known as BabyBIG, which is administered through an IV.\n\nThe CDC says parents should stay vigilant for several weeks after their baby last consumed ByHeart formula. They are advised to wash contaminated surfaces and label any leftover powder \"DO NOT USE\" and store it safely for a month, in case their infant develops symptoms and the state health department wants to test it.\n\nThe CDC says parents should seek immediate medical care if they see any concerning symptoms, and also directs them to an infant botulism outbreak hotline from the California Department of Public Health set up specifically to respond to this outbreak.\n\nWhat the company is doing\n\nByHeart says it is conducting its own \"extensive testing\" and giving the FDA \"complete and unrestricted access to all of our facilities and products for their investigation.\"\n\nThe company has released more resources for customers in the days since the recall, like a 24/7 support hotline and refunds for purchases since October.\n\nIt has also pledged to implement stronger safeguards and testing in the future, saying that Clostridium botulinum was \"not among the pathogens routinely tested for across the industry\" — until now.\n\nIn the meantime, several affected family members have taken legal action.\n\nThe parents of two four-month-olds who were hospitalized with infant botulism — in Arizona and Kentucky — filed separate federal lawsuits last week. They accused ByHeart of negligence and are seeking compensation for medical bills and emotional distress after both their daughters required hospitalization. A separate class-action suit filed in New York alleges deceptive marketing.\n\nSponsor Message\n\nByHeart told NPR over email that it cannot comment on litigation, but reiterated its commitment to supporting families and the FDA's investigation.",
  "summary": "A botulism outbreak that has sickened more than two dozen babies in 15 states has been linked to ByHeart formula sold nationwide. Here's what to know about it.",
  "published": "Thu, 20 Nov 2025 14:08:02 -0500",
  "url": "https://www.npr.org/2025/11/20/nx-s1-5615060/byheart-baby-formula-botulism-recall",
  "source": "NPR Topics: News"
}