{
  "title": "2 months after his face was smeared with cow dung, Goa police chargesheet says attack on activist had ‘no political link’",
  "text": "Two months after activist Rama Kankonkar was attacked with chains, and his face was smeared with cow dung, the Goa Police on Monday filed a chargesheet ruling out any political link to the case.\n\nIn the 1,371-page chargesheet filed at the District and Sessions Court, North Goa, police said the activist was attacked due to a grudge that the accused held against him after he purportedly posted videos online against them. Police said the probe “does not suggest the involvement of any politician or any political link” in the case.\n\nOn September 18, at around 12.30 pm, Kankonkar and his friend were walking to a car after having lunch in Caranzalem near Panaji, when a group of men cornered him and thrashed him with chains and cable wires. The incident led to protests in Panaji, with the Opposition and other activists terming the assault an attempt to “muzzle independent voices” and alleging a “collapse of law and order” in the state. The protesters demanded an impartial probe to identify the “mastermind” of the attack, including any political links.\n\nPolice arrested eight accused, who are in judicial custody.\n\nAccording to the chargesheet, one of the accused, Francis Nadar, revealed during the investigation that he and his associates assaulted the activist with cable wires and smeared cow dung on his face as part of a conspiracy hatched “due to a personal grudge” and “online mockery”.\n\nPolice said one of the accused tried to assault the activist on two occasions in the past due to enmity over the issue. Police said the attack was coordinated by another prime accused, Zenito Cardozo, who “tracked Kankonkar’s movements and communicated with other accused via WhatsApp”.\n\nPolice have charged the eight accused persons under BNS sections 126(1) (wrongful restraint),109 (attempt to murder), 351(3) (criminal intimidation), 238 (causing disappearance of evidence of offence), 111 (organised crime) read with 3(5) (common intention) and 61 (criminal conspiracy), and relevant section of the Scheduled Caste and Scheduled Tribe (Prevention of Atrocities) Act.\n\nNorth Goa SP Rahul Gupta said, “We have filed the chargesheet within 60 days as mandated by law. We examined 49 witnesses, and 32 muddemals have been attached. The eight accused persons who were arrested have been chargesheeted.”\n\nStory continues below this ad\n\nIn his six-page statement to the police recorded on October 2, Kankonkar said he was attacked because of the issues that he had been raising. “I always raised issues/questions with regards to government functioning and had raised the issue of Khapreshwar Devasthan, questioning politician[s] about the same. One of the other issues which I raised was ‘why always ST (Tribal Affairs) portfolio…is with the Home Minister when we have four ST MLAs’,” the statement said. In his statement, he alleged that during the assault, one of the accused, who was in a pink t-shirt, asked if he wanted the “ST portfolio” and whether he wished to be “Goa’s rakhondar (protector)”.\n\nAfter he was discharged from hospital, Kankonkar claimed that he suspected the involvement of the Chief Minister and the Tourism Minister in the attack. Goa Chief Minister Pramod Sawant denied the allegation, calling it an attempt to “sensationalise and politicise the issue”.\n\nPolice last month said Kankonkar did not mention the name of any political leader when his statement was first recorded.",
  "summary": "",
  "published": "Tue, 18 Nov 2025 01:30:18 +0000",
  "url": "https://indianexpress.com/article/india/2-months-after-his-face-was-smeared-with-cow-dung-goa-police-chargesheet-says-attack-on-activist-had-no-political-link-10371483/",
  "source": "India | The Indian Express"
}