{
  "title": "Days after Hasina conviction, Doval meets Bangladesh NSA",
  "text": "NATIONAL SECURITY Adviser Ajit Doval met his Bangladesh counterpart Khalilur Rahman on Wednesday, days after ousted Bangladesh Prime Minister Sheikh Hasina was convicted of crimes against humanity by the International Crimes Tribunal.\n\nWhile there was no official word on whether the issue of her extradition was discussed during the meeting, a statement from the Bangladesh High Commission said the NSAs discussed the functioning of the Colombo Security Conclave and key bilateral issues. Rahman also invited NSA Doval to visit Bangladesh.\n\nEarlier this week, Hasina was sentenced to death for crimes against humanity during the July uprising last year. According to the judgment, the 78-year-old ousted leader, who is now in India, was handed the death penalty concerning the shooting and killing of six unarmed protesters in Dhaka’s Chankharpul on August 5 last year.\n\nHasina had said the verdict announced against her was “biased and politically motivated”.\n\nRahman is leading the Bangladesh delegation for the seventh NSA CSC Meet.\n\nNSA Doval is set to host his counterparts from the member states of the Colombo Security Conclave (CSC) in Delhi.\n\n“The 7th Meeting of the National Security Advisers (NSAs) of the Colombo Security Conclave (CSC) will be held in New Delhi on November 20. NSA Ajit Doval will host his counterparts from Member States including Maldives, Mauritius, Sri Lanka and Bangladesh. Seychelles will be participating as an Observer State, and Malaysia has been invited as a Guest,” the MEA said.\n\nStory continues below this ad\n\nThe 6th Meeting of the NSAs of CSC was held in December 2023 in Mauritius, and Member States met again during the Signing Ceremony for the Founding Documents of CSC in Sri Lanka in August 2024. The Deputy NSAs of CSC countries have also been meeting at regular intervals. The last such meeting was held in virtual format in July 2024.\n\nThe CSC was formed to promote closer cooperation between Member States on vital matters of security and to strengthen partnership for enhancing regional security in the Indian Ocean region.",
  "summary": "",
  "published": "Wed, 19 Nov 2025 22:26:04 +0000",
  "url": "https://indianexpress.com/article/india/days-after-hasina-conviction-doval-meets-bangladesh-nsa-10375282/",
  "source": "India | The Indian Express"
}