{
  "title": "Marina Lewycka obituary",
  "text": "Marina Lewycka, who has died aged 79 from a degenerative brain condition, appeared to achieve a kind of fairy-tale transformation when, in her late 50s, her comic debut novel became a million-copy bestseller.\n\nHowever, behind the literary stardust that settled on the British Ukrainian novelist after A Short History of Tractors in Ukrainian lay not just “a long career as an unpublished author”. That book grew from intimate involvement with the sorrow and pity of war-torn Europe: a “measureless ocean of tears and blood”.\n\nShe developed a unique gift for converting the memory of trauma – not just in her family’s background, but that of others too – into exuberant fiction. Its warmth, fun and sympathy embodied a conviction that humour “sees us through hard times and keeps us in touch with our essential humanity”.\n\nAfter her award-winning debut in 2005, five further novels united comic skills with serious themes. They not only charmed and entertained readers but revealed the “hidden worlds” of global upheaval behind the everyday business of multicultural Britain.\n\nLewycka began life as a refugee. She never lost her curious outsider’s eye, or sense of being “a bit of human flotsam washed up on a faraway shore”. Her Ukrainian parents, Peter and Halyna – father an engineer and inventor, mother a trained vet – had gone to Germany as forced labourers under the Third Reich. Marina was born in a “displaced persons” camp run by British authorities in Kiel shortly after the second world war.\n\nAccidents of birth meant that her parents qualified to come to Britain. First they lived in “idyllic” East Sussex with Rosalind Dobbs – sister of the social reformer Beatrice Webb, mother-in-law of the writer-broadcaster Malcolm Muggeridge – before moves to Oxfordshire and South Yorkshire.\n\nAt school Marina “badly wanted to be an English girl”, but spoke Ukrainian at home. As a bilingual child, she recalled, “you listen carefully”. Her father worked for the International Harvester tractor company in Doncaster (his expertise wittily informs her breakthrough novel).\n\nShe attended grammar schools in Lincolnshire and Oxfordshire, acquired a lifelong love of poetry, then studied English and philosophy at Keele University. After a BPhil at York, she embarked on a doctorate at King’s College London, devoted to the radical writings of Levellers and Diggers in the English civil wars. However, present-day activism distracted her (she had joined CND as a teenager): tension between the narrator’s leftwing values and the staunch anti-communism of the parents generates a running battle in A Short History ...\n\nLewycka taught in adult education, for the Open University and as a supply teacher. In 1975 she met her future husband, the New Zealand-born Dave Feickert, who became a mining safety expert and trade unionist. They had a daughter, Sonia, and married in New Zealand in 1987. Sonia became an epidemiologist.\n\nView image in fullscreen Marina Lewycka’s book A Short History of Tractors in Ukrainian, which drew on aspects of her family history, was a million-copy bestseller\n\nLewycka and Feickert lived in Sheffield, where he worked as research officer for the National Union of Mineworkers (and later for the TUC in Brussels). She taught extra-mural classes at Sheffield University, then joined Sheffield Hallam University as lecturer in journalism and public relations: she called PR “the art of making fictions in the real world”; after her literary success she retained a part-time post, keen “to listen to the way young people speak”, and lectured until her retirement in 2012.\n\nIn the 1990s and early 2000s she wrote carers’ manuals for the charity Age Concern and persisted with fiction, more “modernist” and “philosophical” than the books that later won her fame. Her unpublished writing gathered 36, carefully preserved, rejection slips.\n\nA Short History of Tractors in Ukrainian emerged from a creative-writing MA she took at Sheffield Hallam; it counted as a “staff development” course. Teachers such as the poet Sean O’Brien and the novelist Jane Rogers encouraged her, and fortune smiled when the external examiner turned out to be the literary agent Bill Hamilton.\n\nThe deal he struck with Penguin led to an “almost overnight transformation”. An author who had planned a sombre saga of European displacement won prizes – notably the Bollinger Everyman Wodehouse award – for comic fiction. With the novel also shortlisted for the Orange prize, she carried a gag-rich version of Ukraine’s tortured, fractured past into the bestseller charts.\n\nA Short History ... drew on aspects of Lewycka family history, with its tale of an octogenarian engineer who, after his wife’s death, falls for a much-younger Ukrainian woman. Lewycka had planned a memoir, taped interviews with her mother, but soon realised that “I was going to have to make stuff up”. As she, uproariously, did.\n\nAround 30 translations swiftly followed, but Ukrainians in Ukraine objected to what they viewed as stereotypes. Yet behind the wit, merriment and farce stood grief, pain and division: notably between the narrator Nadia, a “peacetime baby” brought up amid kindness and plenty, and her older sister Vera, the “war baby” who has seen “the darkness that lurks at the bottom of the human soul”. That polarity would recur in subsequent books.\n\nAfter the novel’s triumph, Lewycka travelled in Ukraine and made contact with long-lost relatives. She played tapes of her late mother’s voice to an aunt who had heard nothing of her sister for six decades. Back in Sheffield, she adjusted to professional authorship – “It was your dream, and it became your job” – while refusing to act as the “arrogant and selfish” literary celebrity. Interviewers would find themselves treated to a warming bowl of borscht.\n\nLater novels grew into a sort of comic unofficial history of postwar Britain, seen from its ragged sidelines. Her humour sounded both homely and bizarre, pitched between the worlds of Alan Bennett and (Ukraine-born) Nikolai Gogol. Two Caravans (2007) takes eastern European migrant workers on a satirical, Chaucerian underclass pilgrimage, while We Are All Made of Glue (2009) tries to connect Jewish and Palestinian hopes and fears through the fate of a London house.\n\n“I get excited about what bonds people together,” one character says. Lewycka’s fiction sought to bind clashing outlooks via its special brand of verbally inventive, historically informed sitcom. Her novels express the cheerful resilience of a “peacetime baby” raised in the welfare-state culture celebrated in The Lubetkin Legacy (2016): “paternalistic maybe, but untainted by cynicism or self-interest”.\n\nLewycka wrote some of her fiction at Feickert’s house in New Zealand, but the couple separated (he died in 2014). She formed a relationship with the historian Donald Sassoon. In later years she became estranged in another way, as the rare neurological condition multiple system atrophy progressively affected her speech, balance and movement. It could make her stumble “like a drunk” and slur her words.\n\nAs she wrote, to have a degenerative disease was “scary, lonely and socially unacceptable”. But the idealistic “peacetime baby” found that “people’s spontaneous kindness often brings tears to my eyes”. A final novel, The Good, the Bad and the Little Bit Stupid (2020), added Brexit to its satirical pick-and-mix, glued together not so much by plot as by tone: defiantly warm-hearted and high-spirited in the face of calamity, great or small.\n\nAs with Zadie Smith or Hanif Kureishi, her work rejoices in the rival voices and visions of a mixed-up, fast-changing country and, on the page at least, resolves its conflicts into uplifting comedy.\n\nShe is survived by Donald and her daughter.",
  "summary": "<p>Award-winning author whose novels, including her debut, A Short History of Tractors in Ukrainian, united comic skills with serious themes</p><p>Marina Lewycka, who has died aged 79 from a degenerative brain condition, appeared to achieve a kind of fairy-tale transformation when, in her late 50s, her comic debut novel became a million-copy bestseller.</p><p>However, behind the literary stardust that settled on the British Ukrainian novelist after <a href=\"https://guardianbookshop.com/a-short-history-of-tractors-in-ukrainian-9780241981443/\">A Short History of Tractors in Ukrainian</a> lay not just “a long career as an unpublished author”. That book grew from intimate involvement with the sorrow and pity of war-torn Europe: a “measureless ocean of tears and blood”.</p> <a href=\"https://www.theguardian.com/books/2025/nov/19/marina-lewycka-obituary\">Continue reading...</a>",
  "published": "Wed, 19 Nov 2025 17:49:38 GMT",
  "url": "https://www.theguardian.com/books/2025/nov/19/marina-lewycka-obituary",
  "source": "The Guardian"
}