{
  "title": "Why saving microbes may be the most important conservation effort ever",
  "text": "A newly released study describes how researchers collaborated to design the first comprehensive roadmap for protecting microbial life. The effort was led by Professor Jack Gilbert, President of Applied Microbiology International.\n\nThe work appears in the article titled 'Safeguarding Microbial Biodiversity: Microbial Conservation Specialist Group (MCSG) within the Species Survival Commission of the International Union for Conservation of Nature (IUCN)', published in Sustainable Microbiology, an AMI journal.\n\nLaunching a New Global Effort Through the IUCN\n\nIn July 2025, the IUCN formally created the MCSG within its Species Survival Commission. The group is co-chaired by Professor Gilbert and Raquel Peixoto (KAUST / ISME). Its formation followed a May workshop led by Professor Gilbert that brought together conservation specialists and microbiologists to explore how traditional conservation goals apply in a world driven by microbial processes.\n\n\"This is the first global coalition dedicated to safeguarding microbial biodiversity, which is the 'invisible 99% of life', to ensure that microbes are recognized as essential to the planet's ecological, climate, and health systems,\" Professor Gilbert said.\n\nHe added: \"I think this reframes conservation from saving individual species to preserving the networks of invisible life that make visible life possible -- a paradigm shift toward planetary health. It also gives us a really good look into the microbial tools that can support conservation action -- so that we may use microbiology to solve the world's biggest problems.\"\n\nWhy Microbial Biodiversity Matters for the Planet\n\nMicrobes are central to soil fertility, carbon cycling, marine productivity, and the health of plants and animals. Despite this, they rarely appear in conservation policy. Professor Gilbert noted that overlooking microbial diversity weakens climate resilience, food security, and ecosystem restoration efforts. He explained: \"The MCSG fills this gap by embedding microbiology directly into IUCN's conservation machinery, i.e. using Red List criteria, ecosystem assessments, and restoration programs, to make microbes visible in policy, not just in science.\"\n\nBuilding a Global Network to Guide Microbial Conservation\n\nOver the past two years, the founding members have assembled an international community of microbiologists, ecologists, legal experts, and Indigenous knowledge holders from more than 30 countries. Together, they created the first microbial conservation roadmap, outlining five core components of the IUCN Species Conservation Cycle:\n\nAssessment -- develop Red List-compatible metrics for microbial communities and biobanks.\n\n-- develop Red List-compatible metrics for microbial communities and biobanks. Planning -- create ethical and economic frameworks for microbial interventions.\n\n-- create ethical and economic frameworks for microbial interventions. Action -- pilot restoration projects using microbial solutions (coral probiotics, soil carbon microbiomes, pathogen-resistant wildlife).\n\n-- pilot restoration projects using microbial solutions (coral probiotics, soil carbon microbiomes, pathogen-resistant wildlife). Networking -- connect scientists, culture collections, and Indigenous custodians worldwide.\n\n-- connect scientists, culture collections, and Indigenous custodians worldwide. Communication & Policy -- launch public and policy campaigns, including \"Invisible but Indispensable.\"\n\nEarly work is supported by funding from the Gordon & Betty Moore Foundation, along with in kind support from AMI and ISME. This first phase focuses on mapping microbial hotspots, building conservation indices, and linking existing microbial biobanks into a coordinated global archive.\n\nOvercoming Scientific and Ethical Challenges\n\nProfessor Gilbert explained that creating a conservation framework for microscopic life comes with complex scientific and conceptual barriers. These challenges include:\n\nDetermining what qualifies as a \"microbial species\" within Red List criteria.\n\nIntegrating genomic and ecological information into systems originally developed for plants and animals.\n\nAddressing the belief that microbes are too resilient or too complicated to require protection.\n\n\"Microbial conservation must contend with enormous unseen diversity and highly dynamic community structures that defy classical species concepts. Taxonomic instability, lack of long-term baselines, and the ethical handling of microbial samples (including Indigenous or human-associated microbiota) all require new definitions of 'loss', 'restoration', and 'rights of microbes',\" he said.\n\nHe added, \"But a major landmark came when the IUCN approved the MCSG as a formal Specialist Group -- officially extending global conservation to microbes for the first time.\"\n\nPlans for the Next Phase of Conservation Work\n\nThe group's upcoming goals include:\n\nDeveloping the first Microbial Red List framework by 2027.\n\nCreating global maps of microbial hotspots across soil, marine, and host-associated systems.\n\nTesting conservation strategies such as microbial bioremediation, coral probiotics, and soil carbon restoration.\n\nEnsuring microbial indicators are incorporated alongside plants and animals in IUCN and UN biodiversity targets by 2030.\n\nWhat Is Needed for Long-Term Progress\n\nSustained investment will be essential to expand global microbial monitoring networks. Future progress also depends on integrating microbes into national biodiversity and climate strategies, including \"30 by 30\" and One Health policies. Another key priority is building \"public microbial literacy -- recognizing microbes as the foundation of ecosystem and human health.\" The roadmap also highlights the importance of digital-twin and AI tools to anticipate how microbial communities will respond to environmental change.\n\nThe paper was published today (November 20) in Sustainable Microbiology.",
  "summary": "Researchers have launched the first coordinated plan to protect microbial biodiversity, calling attention to the “invisible 99% of life” that drives essential Earth systems. The IUCN has formally recognized this effort through the creation of the Microbial Conservation Specialist Group. By developing new metrics, policies, and restoration tools, scientists aim to make microbial life a core part of global conservation action. The roadmap also outlines upcoming goals such as microbial hotspot maps and new microbe-based conservation solutions.",
  "published": "Thu, 20 Nov 2025 10:49:56 EST",
  "url": "https://www.sciencedaily.com/releases/2025/11/251120102600.htm",
  "source": "All Top News -- ScienceDaily"
}