{
  "title": "Now, desi gene editing technology to aid cheaper, commercial GE crop breeding",
  "text": "In a boost to indigenous efforts at genome-edited (GE) crop breeding, Indian scientists have developed what is claimed to be a “miniature alternative” to the proprietary CRISPR-Cas proteins-based technology to precisely cut and tweak the DNA of plants.\n\nThe new GE technology — for which the Indian Council of Agricultural Research (ICAR) has recently been granted a patent — deploys the so-called TnpB or Transposon-associated proteins. These, just like the most widely used CRISPR-associated Cas9 and Cas12a proteins, act as “molecular scissors” to cleave the DNA of a gene at a predetermined target site and change its sequence. Such editing is aimed at bringing forth desirable alterations in that gene’s expression and function.\n\n“What we have developed is a new GE system based on TnpB, instead of Cas proteins. It offers an alternative, yet highly effective next-generation tool for genome editing in plants,” said Kutubuddin Ali Molla, senior scientist at ICAR’s Central Rice Research Institute (CRRI) in Cuttack, Odisha and lead inventor of the technology.\n\nThe CRISPR-Cas technologies are controlled mainly by the Broad Institute (a partnership between the Massachusetts Institute of Technology and Harvard University) and the US seeds-cum-crop protection chemicals giant Corteva Agriscience. While Broad Institute owns the patents for CRISPR-Cas12a, Corteva has a joint licencing agreement with the former to offer access to CRISPR-Cas9 technology for agricultural applications.\n\nWhile scientists have developed rice varieties using CRISPR-Cas technology, they face a major hindrance in commercial cultivation since the intellectual property (IP) rights are with global companies/institutions that may demand license fees. Here’s where indigenous genome-edited crop breeding tools will help.\n\nThe advantage with the TnpB proteins used by Dr Molla’s team is their compactness: They are much smaller, having 400-500 amino acids per molecule, compared with 1,000-1,400 for Cas9 and about 1,300 for Cas12a.\n\n“If Cas9 and Cas12a are footballs, TnpBs are baseballs,” summed up the 40-year-old Molla, whose work has also been published in the prestigious Plant Biotechnology and highlighted in the ChemistryEurope and Nature India journals.",
  "summary": "",
  "published": "Wed, 19 Nov 2025 22:50:56 +0000",
  "url": "https://indianexpress.com/article/india/now-desi-gene-editing-technology-to-aid-cheaper-commercial-ge-crop-breeding-10375188/",
  "source": "India | The Indian Express"
}