{
  "title": "The CDC revives debunked 'link' between childhood vaccines and autism",
  "text": "The CDC revives debunked 'link' between childhood vaccines and autism\n\ntoggle caption Ben Hendren/Bloomberg via Getty Images\n\nThe Centers for Disease Control and Prevention has made a dramatic about-face in the agency's position on the relationship between vaccines and autism.\n\nThe CDC's website now says a link between vaccines and autism cannot be ruled out . That's a reversal from the CDC's longstanding stance that there is no link.\n\nThe change comes even though a connection between vaccines and autism has long been debunked by a large body of high-quality research. But Health Secretary Robert F. Kennedy Jr. has long promoted the discredited claim.\n\nThe CDC's change is alarming public health experts. They are already worried about a drop in childhood vaccination, which has led to a resurgence of dangerous childhood diseases like measles and whooping cough.\n\nSponsor Message\n\n\"The Centers for Disease Control and Prevention website has been changed to promote false information suggesting vaccines cause autism,\" said Dr. Susan J. Kressly, president of the American Academy of Pediatrics, in a statement. \"Since 1998, independent researchers across seven countries have conducted more than 40 high-quality studies involving over 5.6 million people. The conclusion is clear and unambiguous: There's no link between vaccines and autism.\"\n\nShe went on to say, \"Anyone repeating this harmful myth is misinformed or intentionally trying to mislead parents. We call on the CDC to stop wasting government resources to amplify false claims that sow doubt in one of the best tools we have to keep children healthy and thriving: routine immunizations.\"\n\nIn a statement to NPR, Department of Health and Human Services spokesperson Andrew Nixon repeated one of the changes to the website: \"The claim 'vaccines do not cause autism' is not an evidence-based claim because studies have not ruled out the possibility that infant vaccines cause autism.\"\n\nHe said the department \"has launched a comprehensive assessment of the causes of autism, including investigations on plausible biologic mechanisms and potential causal links.\"\n\n\"The new statement shows a lack of understanding of the term 'evidence,'\" the Autism Science Foundation said in a statement the organization provided to NPR, adding, \"No environmental factor has been better studied as a potential cause of autism than vaccines.\"\n\nSponsor Message\n\nIt's a statement that's confusing by design, said Dr. Paul Offitt, a pediatrician and director of the Vaccine Education Center at the Children's Hospital of Philadelphia. \"These are the usual anti-vaccine tropes, misrepresentation of studies, false equivalence,\" he says. \"They might as well say chicken nuggets might cause autism because you can't prove that either.\"\n\nThe changes on the website \"blindsided\" career scientists at CDC, says Dr. Demetre Daskalakis, a former top CDC official who resigned from the agency in August. \"The scientists did not participate in its creation,\" he says. \"And the data are unvetted.\"\n\nTwo current CDC staffers, who contacted NPR Thursday, say the updates are a glaring red flag that indicate the vaccine information on the agency website is no longer credible, and is instead \"anti-science.\" They requested anonymity out of concern they could lose their jobs for speaking to the press.\n\nThe moves are the latest in a series of steps Kennedy has taken on the safety and effectiveness of vaccines that run counter to mainstream medical and scientific organizations like the pediatrics academy, the Infectious Disease Society of American and the American College of Physicians.\n\nVaccine proponents say the moves are recklessly undermining public confidence in vaccines and fueling vaccine hesitancy, putting the nation's children at risk. The U.S. appears to be poised to lose its status as having eliminated measles .\n\nKennedy sacked all the members of the CDC's influential Advisory Committee on Immunization Practices, or ACIP, earlier this year and replaced the members with his own slate. In one of its first actions, the new advisory committee called for the removal of the preservative thimerosal used in a small fraction of flu vaccines, even though safety concerns about it have also been debunked.\n\nUnder Kennedy, federal health agencies have also made it harder for people to get vaccinated against COVID-19, and canceled grants funding new vaccines that rely on mRNA technology at the heart of the most used COVID vaccines.\n\nSponsor Message\n\nThe Trump administration has also claimed there is a link between acetaminophen, the active ingredient in Tylenol, and autism, and promoted the use of leucovorin, a prescription form of vitamin B9, to treat autism even though the evidence supporting that is scant .\n\nAn ACIP working group is now studying more major changes in childhood vaccinations, including removing compounds that include aluminum used to increase vaccine effectiveness . These adjuvants have been used safely for nearly a century. The committee is also exploring separating a single shot now given to protect against measles, mumps and rubella in a single shot into individual shots.\n\nPublic health experts say both moves are scientifically unsound and would essentially upend the nation's childhood vaccination regimen, leaving children vulnerable to diseases that had long been brought under control.\n\nThe committee is also considering recommending delaying vaccinating children against hepatitis B . For years, all babies have been vaccinated against hepatitis at birth. Hepatitis B can cause liver failure and liver cancer.\n\nThe CDC acknowledges in a footnote on its main webpage on autism and vaccines that it still carries a header reading \"Vaccines do not cause autism*\" and says it hasn't \"been removed due to an agreement with the chair of the U.S. Senate Health, Education, Labor, and Pensions Committee that it would remain on the CDC website.\"\n\nNPR emailed Louisiana Republican Sen. Bill Cassidy's office for comment but didn't receive an immediate response. Cassidy chairs the Senate HELP Committee, which vetted Kennedy's nomination to lead HHS and voted along party lines to support it.\n\nCassidy posted on X Thursday afternoon: \"I'm a doctor who has seen people die from vaccine-preventable diseases. What parents need to hear right now is vaccines for measles, polio, hepatitis B and other childhood diseases are safe and effective and will not cause autism. Any statement to the contrary is wrong, irresponsible, and actively makes Americans sicker.\"",
  "summary": "A Centers for Disease Control and Prevention webpage that previously stated \"Vaccines do not cause autism\" has been changed to cast doubt on the scientific research that supports the finding.",
  "published": "Thu, 20 Nov 2025 12:25:05 -0500",
  "url": "https://www.npr.org/sections/shots-health-news/2025/11/20/nx-s1-5615040/cdc-rfk-childhood-vaccines-autism",
  "source": "NPR Topics: News"
}