{
  "title": "Scientists uncover a surprising protein that heals stubborn wounds",
  "text": "When a routine blood test shows high levels of a protein called SerpinB3, it often alerts doctors that something is seriously wrong. Elevated SerpinB3 can be associated with difficult-to-treat cancers or severe inflammatory diseases.\n\nSerpinB3 is known as a key protein that helps reveal when the body's barrier tissues, such as the skin and lungs, are under intense strain from cancer or long-term illness. It has typically been viewed as a sign that these protective surfaces are in trouble.\n\nRecent work from scientists at Arizona State University adds an unexpected twist. Their research shows that SerpinB3, long regarded mainly as a disease marker, also plays a natural part in helping the body repair itself by supporting wound healing.\n\nChronic Wounds, High Costs\n\nSkin wounds remain a major medical challenge. Each year in the U.S., an estimated 6 million wounds occur, and many are slow to heal or difficult to manage. These hard-to-treat injuries are frequently linked with diabetes, burns, infection or older age, and together they are thought to cost about $20 billion annually.\n\nIn a new study, coauthors Jordan Yaron, Kaushal Rege and their colleagues at the Biodesign Center for Biomaterials Innovation and Translation found that SerpinB3 is one of the body's own wound-healing tools. Their results indicate that the protein helps damaged skin recover after injury.\n\nThe work opens the door to new medical strategies. Increasing SerpinB3 activity might one day speed wound repair, while limiting its activity could become a way to slow or control aggressive cancers. The research may also shed light on how SerpinB3 contributes to inflammatory diseases, ranging from skin disorders to asthma.\n\nThe findings are reported in Proceedings of the National Academy of Sciences.\n\nLinking Biomaterials, Serpins and Tissue Repair\n\nThis study emerged from the intersection of two major efforts in the team's lab: their broader research on bioactive materials that promote wound repair and their expertise in a family of proteins known as serpins (short for serine protease inhibitors). Serpins help regulate many processes in the body, including blood clotting and immune responses, and several members of this family appear to help keep tissue breakdown and tissue repair in balance.\n\n\"When we looked deeper into how our bioactive nanomaterials were helping tissue repair, SerpinB3, a protein originally implicated in cancer, jumped at us as a key factor that correlated with nanomaterial-driven wound healing,\" Rege said. \"This journey, which started from use-inspired research on biomaterials for tissue repair to uncovering the fundamental role of this protein as an injury-response mechanism in skin, has been truly fascinating. We are now building on this basic finding and investigating the role of SerpinB3 in other pathological conditions.\"\n\nRege is a professor of chemical engineering and director of the Biodesign Center for Biomaterials Innovation and Translation. Yaron serves as an assistant professor of chemical engineering and is also part of the center's faculty. Both researchers hold academic appointments in the School for Engineering of Matter, Transport and Energy at ASU.\n\nA Protein With a Double Life: Cancer and Healing\n\nMany serpins are associated with disease when their levels in the body fall out of balance, contributing to inflammation, fibrosis and cancer. SerpinB3, one member of this family, has been widely used in cancer diagnostics as a marker of particularly aggressive forms of the disease.\n\nSerpinB3 -- also known as squamous cell carcinoma antigen-1 -- was first identified in cervical cancer tissue in 1977. Since then, it has been routinely used as a biomarker for aggressive cancers of the lung, liver and skin, where high concentrations often signal a poorer prognosis.\n\n\"For more than four decades, SerpinB3 has been recognized as a driver of cancer growth and metastasis -- so much so that it became a clinical diagnostic. Yet after all this time, its normal role in the body remained a mystery,\" Yaron said. \"But when we looked at injured, healing skin, we found that cells moving into the wound bed were producing enormous amounts of this protein. It became clear that this is part of the machinery humans evolved to heal epithelial injuries, a process that cancer cells have learned to exploit to spread. This now opens the doors to understanding how this protein is involved in many more diseases.\"\n\nHow SerpinB3 Speeds Skin Repair\n\nBy monitoring which genes become active during the healing process, the researchers discovered that SerpinB3 levels rose sharply in wounded skin. This increase was even greater in wounds covered with advanced biomaterial dressings, confirming earlier work from the group that showed how these materials can amplify the body's own repair signals.\n\nIn laboratory experiments, supplying additional SerpinB3 caused skin cells to move more quickly and cover wounds more rapidly. It proved to be about as effective as Epidermal Growth Factor, a well-known molecule that promotes healing. SerpinB3 acts by stimulating keratinocytes -- the skin cells that normally migrate to repair damage. When activated, these cells become less tightly attached to their surroundings and more able to move, allowing them to slide into the wound area and rebuild tissue.\n\nThe protein also supports the body's broader repair networks, helping to coordinate healing and the growth of new tissue. Wounds treated in this way showed collagen fibers that were more orderly and better organized, creating a stronger support framework that helps the skin regain its strength and integrity.\n\nFuture Treatments for Wounds and Cancer\n\nThe scientists emphasize that additional research is needed to understand how SerpinB3 fits into the body's overall healing systems. Because it appears to accelerate repair, SerpinB3 could eventually be developed into a therapy for chronic, hard-to-heal wounds, such as pressure sores and other ulcers that close only very slowly over time.\n\nBy uncovering SerpinB3's double role in both cancer and tissue repair, the study suggests that learning more about the body's own healing machinery could lead to improved treatments for persistent wounds and new approaches to controlling cancer.",
  "summary": "Researchers have uncovered that SerpinB3, typically linked to severe cancers, is also a key player in natural wound healing. The protein drives skin cell movement and tissue rebuilding, especially when paired with next-generation biomaterial dressings. Its newfound role explains why cancer cells exploit it and opens the door to new wound-healing therapies.",
  "published": "Mon, 17 Nov 2025 08:55:51 EST",
  "url": "https://www.sciencedaily.com/releases/2025/11/251116105631.htm",
  "source": "All Top News -- ScienceDaily"
}