{
  "title": "Flyers to honor young cancer patients with pregame SkateSkins",
  "text": "Open Extended Reactions\n\nWhen the Philadelphia Flyers take the ice for warm-ups on Thursday night against the St. Louis Blues, it will feature both a heartwarming and history-making little detail that the players will be wearing.\n\nAll of ESPN. All in one place. Watch your favorite events in the newly enhanced ESPN App. Learn more about what plan is right for you. Sign Up Now\n\nPhilly has partnered with SkateSkins, a company that creates customizable skate accessories, to show off custom designs made by Flyers players and young cancer patients as part of the club's work in support of Hockey Fights Cancer.\n\n\"We had the idea to bring in players [to partner] with children battling cancer to design them together,\" chair of Flyers charities and alternate governor Blair Listino told ESPN. \"Nine kids came in and met with nine players about a month ago after practice. And they designed them together. The player would design one side and the kid would design the other side.\"\n\nListino said that Trevor Zegras was the quickest on the draw as the first player to raise his hand for the initiative. He was paired with 19-year-old Juliette, who has grade-4 glioblastoma multiforme. Their design was inspired by her tattoos.\n\nTrevor Zegras and other Flyers players designed custom skate accessories with cancer patients like 19-year-old Juliette. Courtesy of the Flyers\n\nCenter Sean Couturier and defenseman Travis Sanheim have been long-time advocates for Hockey Fights Cancer initiatives.\n\nCouturier was paired with a 14-year-old named Emile, battling craniopharyngioma, who is from Trois-Rivieres, Quebec, close to where Couturier lives in the summertime.\n\n\"It was cool to chat in French and build that relationship,\" Couturier said. \"He was designing a lot of hockey-related, Flyers stuff, and I told him to design something about himself, what he likes, what are his hobbies and stuff. He put a fishing rod. He loves nature.\"\n\nCourtesy of the Flyers\n\nSanheim was partnered with 15-year-old George, battling cutaneous t-cell lymphoma, whose favorite player is, in fact, Travis Sanheim. The defenseman admitted he isn't the most artistic, and was happy to pass off the drawing duties.\n\n\"I kind of left it up to George for the most part,\" Sanheim explained. \"Just allowed him to get creative with it. [I] threw out some ideas here and there, but I wanted him to kind of really enjoy it and and have most of the responsibility of designing it, and then getting the chance to wear it and for him to kind of see it firsthand.\"\n\nCourtesy of the Flyers\n\nForward Noah Cates was paired with 10-year-old Rachel, who is battling acute myeloid leukemia, and is post bone marrow transplant.\n\n\"She [drew] some initials of some of her other friends. I [added] some numbers of some college teammates that had cancer,\" Cates said about what went into their particular design. \"Just talking about some friends and people that have gone through it and some different experiences was pretty remarkable. For a kid that young to be going through that is crazy. It was a good time with them, and I'm looking forward to that game and wearing those.\"\n\nCourtesy of the Flyers\n\nDesign day was not only a highlight for the kids, but it certainly left a mark on the players as well.\n\n\"It's crazy how strong they are in terms of, they're all the happiest people in the room and carry the most energy,\" said defenseman Jamie Drysdale, who was paired with 10-year-old Chase, who is battling rhabdomyosarcoma. \"It was unbelievable to be a part of. [I] had a blast. The kid I was paired with was awesome. Had great energy, had a lot of great ideas, it was really great to design with him.\"\n\nJamie Drysdale was paired with 10-year-old Chase to design his custom SkateSkins. Courtesy of the Flyers\n\nListino added that forward Travis Konecny and his kid, Frankie, put the initials \"BAMF\" on their design. \"Frankie started to write it and Travis followed, they had a good laugh.\"\n\nCourtesy of the Flyers\n\nThe Flyers are the first organization to adopt SkateSkins at the team level, where every player will be wearing them during warmups.\n\n\"This is our second year of a Hockey Fights Cancer partnership that we have through the NHL, and this will be the first time that they're being worn on NHL ice,\" SkateSkins founder Matt Keeler told ESPN. \"This is a pretty big milestone moment, and yeah, for us, the Flyers really just wanted to be the first team to wear it, and I think they have some pretty cool ideas of what they want to do for the future down the road. They had reached out to us, and had player involvement right away.\"\n\n\"I love being the first [team] to do this,\" Listino said. \"It also shows our team is definitely one-for-all. And I think this also shows that one person's like, 'this is really important to me.' And I think most people would say cancer has impacted their life in some way or another. So, for everyone to jump on board very quickly for this initiative was really, really exciting.\"\n\nThe players that didn't participate in the custom design event will be wearing a Hockey Fights Cancer design created by SkateSkins, which includes a variation of the familiar placard where players can write the name of who they are honoring.\n\nKeeler said that players even ordered extras of the final SkateSkins designs so they could gift a pair of skates to the kids they were paired with featuring their artwork.\n\nThe NHL approved the use of SkateSkins during warmups prior to the start of this season. Players like Auston Matthews and Clayton Keller have been supportive of the brand in the past, and players have worn SkateSkins in other leagues like the AHL and Canadian junior leagues. Listino said that the Flyers would leave the door open for players to continue to create SkateSkins designs for causes or forms of expression that is meaningful to them.\n\nHockey Fights Cancer is a joint initiative of the NHL and NHL Players Association, in partnership with the V Foundation for Cancer Research, and is in its 27th season.",
  "summary": "The custom skate accessories were designed as part of the Hockey Fights Cancer initiative.",
  "published": "Thu, 20 Nov 2025 23:19:33 EST",
  "url": "https://www.espn.com/nhl/story/_/id/47022852/nhl-2025-26-philadelphia-flyers-skateskins-hockey-fights-cancer",
  "source": "www.espn.com - TOP"
}