{
  "title": "Superman No 1 sells for $9.12m, becoming most expensive comic ever sold",
  "text": "A copy of Superman No 1 that was discovered in an attic in California last year has become the world’s most expensive comic book after selling for US$9.12m (£6.96m, A$14.14m).\n\nSuperman No 1 was published in 1939 and was the Man of Steel’s first solo title. It marked the first time a character that debuted in a comic book had their own title devoted entirely to them.\n\nThe copy that sold on Thursday was found in 2024 under a stack of old newspapers in a cardboard box by three unnamed brothers in northern California while they were going through their late mother’s attic.\n\nTheir mother had bought the comic when she was nine years old and living in San Francisco, the brothers, who have asked not to be named, said. Over the years, she told her sons that she had “rare comics somewhere”, but they never found them.\n\nDespite where the 86-year-old comic was kept, it was in pristine condition and became the highest-ever-graded copy of Superman No 1 with a score of 9.0 on the 10-point scale used in the industry to grade the condition of comic books. It is one of only seven known copies with a grade of 6.0 or higher.\n\nThe $9.12m price tag, with fees, smashes a record set only last year when a 8.5-graded copy of Action Comics No 1, the 1938 comic that featured the first ever appearance of Superman, sold for $6m.\n\nHalf a million copies of Superman No 1 were initially printed, followed by print runs of 250,000 and then 150,000 – but intact copies are rare today, in part because the comic included an invite to children to cut the cover off to use as a poster.\n\nSuperman No 1 is one of the “big three” comics, along with Action Comics No 1 and Detective Comics No 27, which featured the first appearance of Batman.\n\nLon Allen, vice-president of Heritage Auctions, which sold the comic on Thursday, called it “a momentous day”.\n\n“Superman No 1 is a milestone in pop culture history, and this copy is not only in unprecedented condition, but it has a movie-worthy story behind it. I was glad to see the price reflect that and am honored Heritage was entrusted with this iconic book,” Allen said.\n\nSuperman was created in 1933 by two Cleveland teenagers, Jerry Siegel and Joe Shuster, but they sold the rights to DC Comics for just $130, receiving $10 for each page they drew.",
  "summary": "<p>The pristine copy of Superman No 1, the character’s first solo title from 1939, was discovered in an attic in California last year </p><p>A copy of Superman No 1 that was discovered in an attic in California last year has become the world’s most expensive comic book after selling for US$9.12m (£6.96m, A$14.14m).</p><p>Superman No 1 was published in 1939 and was the Man of Steel’s first solo title. It marked the first time a character that debuted in a comic book had their own title devoted entirely to them.</p> <a href=\"https://www.theguardian.com/books/2025/nov/21/superman-no1-becomes-most-expensive-comic-ever-sold\">Continue reading...</a>",
  "published": "Fri, 21 Nov 2025 05:23:20 GMT",
  "url": "https://www.theguardian.com/books/2025/nov/21/superman-no1-becomes-most-expensive-comic-ever-sold",
  "source": "World news | The Guardian"
}