{
  "title": "India, Israel set to launch talks for free trade pact",
  "text": "India And Israel Launch FTA Talks; Piyush Goyal, Nir Barkat Sign Terms Of Reference\n\nTEL AVIV/ NEW DELHI: India and Israel on Thursday inked terms of reference (ToR) to formally launch negotiations for a free trade agreement, commerce & industry minister Piyush Goyal said.The ToR, which will be the basis for talks, includes market access for goods by eliminating tariff and non-tariff barriers, investment facilitation, simplification of customs procedures, increasing cooperation for innovation and technology transfer, and easing norms to promote trade in services.\"Now we will soon finalise the dates for starting the negotiations for that... Given the complementarities and challenges faced by the two countries, this can be a good basis for bilateral trade relations and open new opportunities,\" the minister said. Goyal, who is leading a 60-member business delegation, also said that the Israel has conveyed that it will not seek market access in sensitive areas such as dairy, rice, wheat and sugar.India and Israel had earlier engaged in negotiating a similar agreement and eight rounds of talks were held. The fresh dialogue comes amid India's growing appetite for trade deals as it seeks to diversify its exports to de-risk the portfolio. Israel is seen as a crucial ally, given the strategic nature of the relationship, although trade has so far not been a major driver. While Israel does not have a large market, it is home to cutting edge technology and some of the Israeli companies can use India as a base for manufacturing for the Indian market and also for exports.Israel economy minister Nir Barkat said India is a great bet for investment. \"Make In India is one of the smartest concepts and is relevant for many Israeli companies,\" he said. During 2024-25, India's exports to Israel fell 52% to $2.1 billion, while imports were down 26% to $1.5 billion.",
  "summary": "India and Israel have officially launched negotiations for a free trade agreement, signing terms of reference to guide discussions. The pact aims to boost trade by removing barriers, facilitating investment, and enhancing cooperation in innovation and technology. Israel has assured India it won't seek market access in sensitive sectors like dairy and agriculture, opening new avenues for bilateral commerce.",
  "published": "Fri, 21 Nov 2025 01:47:38 +0530",
  "url": "https://timesofindia.indiatimes.com/business/india-business/india-israel-set-to-launch-talks-for-free-trade-pact/articleshow/125471764.cms",
  "source": "Times of India"
}