{
  "title": "White House has apologised over Georgia raid, says Hyundai boss",
  "text": "White House has apologised over Georgia raid, says Hyundai boss\n\nMore than 300 South Koreans were detained in a massive immigration raid in Georgia\n\nIn reply to a request for comment from the BBC, the White House did not directly address whether or not it had called Mr Muñoz to apologise.\n\nIn September, more than 300 South Korean workers were detained in a raid at a battery plant operated by Hyundai and electronics giant LG, raising tensions between Washington and Seoul.\n\nSpeaking at a conference of business leaders in Singapore, Mr Muñoz said the governor of Georgia had also called him and said \"I don't know what happened, this is not state jurisdiction.\"\n\nHyundai chief executive José Muñoz said on Wednesday that the White House phoned him personally to apologise for a massive immigration raid at a factory in the US state of Georgia.\n\n\"The United States is proud to be a home for major investments and looks forward to continuing to build on these historic investments and partnerships that President Trump has secured,\" White House spokeswoman Abigail Jackson said in an emailed statement.\n\n\"Any foreign workers brought in for specific projects must enter the United States legally and with proper work authorisations,\" she added.\n\nThe BBC has also contacted the governor of Georgia for comment.\n\nDuring the raid, workers were forced to sit on the floor of the factory as officers shackled their legs in scenes that sparked outrage in South Korea.\n\nThe workers were held in detention for more than a week before being flown home after the South Korean government held urgent talks with the US.\n\nThe company warned in September that the raid would delay the plant's opening due to labour shortages.\n\nMr Muñoz said during a panel discussion at the Bloomberg New Economy Forum that he believed that someone had \"made a phone call and made it look like there were illegal immigrants\" at the plant.\n\n\"That's absolutely not the case,\" said Mr Muñoz.\n\nThe raid was \"a bad surprise\" but the company remained committed to manufacturing in the US, he added.\n\nUS President Donald Trump has previously said that he was \"very much opposed\" to the raid.\n\nTrump said at the time that the US had an \"understanding\" with the world on the need to bring in experts to set up specialised facilities and train local workers.\n\nDespite the raid increasing tensions between the US and South Korea, the two countries announced in October that they had reached a broad trade deal.\n\nUnder the agreement, the two sides reduced reciprocal tariffs from 25% to 15%, while South Korea said it would invest $350bn (£266.5bn) in the US.",
  "summary": "The carmaker's CEO said the raid was \"a bad surprise\" but the firm will continue to invest in the US.",
  "published": "Wed, 19 Nov 2025 23:48:52 GMT",
  "url": "https://www.bbc.com/news/articles/c8ey0nl62ypo?at_medium=RSS&at_campaign=rss",
  "source": "BBC News"
}