{
  "title": "Flying with whales: Drones are remaking marine mammal research",
  "text": "In 2010, the Deepwater Horizon oil rig exploded in the Gulf of Mexico, causing one of the largest marine oil spills ever. In the aftermath of the disaster, whale scientist Iain Kerr traveled to the area to study how the spill had affected sperm whales, aiming specialized darts at the animals to collect pencil eraser-sized tissue samples.\n\nIt wasn’t going well. Each time his boat approached a whale surfacing for air, the animal vanished beneath the waves before he could reach it. “I felt like I was playing Whac-A-Mole,” he says.\n\nAs darkness fell, a whale dove in front of Kerr and covered him in whale snot. That unpleasant experience gave Kerr, who works at the conservation group Ocean Alliance, an idea: What if he could collect that same snot by somehow flying over the whale? Researchers can glean much information from whale snot, including the animal’s DNA sequence, its sex, whether it is pregnant, and the makeup of its microbiome.\n\nAfter many experiments, Kerr’s idea turned into what is today known as the SnotBot: a drone fitted with six petri dishes that collect a whale’s snot by flying over the animal as it surfaces and exhales through its blowhole. Today, drones like this are deployed to gather snot all over the world, and not just from sperm whales: They’re also collecting this scientifically valuable mucus from other species, such as blue whales and dolphins. “I would say drones have changed my life,” says Kerr.\n\nS’not just mucus\n\nGathering snot is one of many ways that drones are being used to study whales. In the past 10 to 15 years, drone technology has made great strides, becoming affordable and easy to use. This has been a boon for researchers. Scientists “are finding applications for drones in virtually every aspect of marine mammal research,” says Joshua Stewart, an ecologist at the Marine Mammal Institute at Oregon State University.",
  "summary": "Aerial drones are giving scientists a new view of life at sea.",
  "published": "Thu, 20 Nov 2025 17:22:29 +0000",
  "url": "https://arstechnica.com/science/2025/11/flying-with-whales-drones-are-remaking-marine-mammal-research/",
  "source": "Ars Technica - All content"
}