{
  "title": "‘We excel at every phase of AI’: Nvidia CEO quells Wall Street fears of AI bubble amid market selloff",
  "text": "Global share markets rose after Nvidia posted third-quarter earnings that beat Wall Street estimates, assuaging for now concerns about whether the high-flying valuations of AI firms had peaked.\n\nOn Wednesday, all eyes were on Nvidia, the bellwether for the AI industry and the most valuable publicly traded company in the world, with analysts and investors hoping the chipmaker’s third-quarter earnings would dampen fears that a bubble was forming in the sector.\n\nJensen Huang, founder and CEO of Nvidia, opened the earnings call with an attempt to dispel those concerns, saying that there was a major transformation happening in AI, and Nvidia was foundational to that transformation.\n\n“There’s been a lot of talk about an AI bubble,” said Huang. “From our vantage point, we see something very different. As a reminder, Nvidia is unlike any other accelerator. We excel at every phase of AI from pre-training to post-training to inference.”\n\nThe company surpassed Wall Street’s expectations in nearly every regard, as it has for multiple quarters in a row, a sign that the financially enormous AI boom is not slowing down. Nvidia reported $1.30 in diluted earnings per share on $57.01bn in total revenues, beating investor expectations of $1.26 in earnings per share on $54.9bn in revenue. Sales are up 62% year-over-year. The company reported $51.2bn in revenue from datacenter sales, beating expectations of $49bn. The company is also projecting fourth- quarter revenue of around $65bn; analysts had predicted the company would issue a guidance of $61bn.\n\nOn the call with investors, Huang said that there were three huge platform shifts: a transition from general purpose computing to accelerated computing; a transition to generative AI and a transition to agentic and physical AI, eg robots or autonomous vehicles.\n\n“As you consider infrastructure investments, consider these three fundamental dynamics,” Huang said. “Each will contribute to infrastructural wealth. Nvidia … enables all three transitions and does so for any form or modality of AI.”\n\nDemand for the company’s chips continues to grow, he said.\n\n“AI is going everywhere, doing everything, all at once.”\n\nskip past newsletter promotion Sign up to TechScape Free weekly newsletter A weekly dive in to how technology is shaping our lives Enter your email address Sign up Privacy Notice: Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on theguardian.com to send you this newsletter. You can complete full registration at any time. For more information about how we use your data see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nThomas Monteiro, senior analyst at Investing.com, said: “This answers a lot of questions about the state of the AI revolution, and the verdict is simple: it is nowhere near its peak. As investors worry that mounting CapEx will force companies to slow their AI adoption cycles, Nvidia continues to prove that datacenter scaling is not optional, but rather the central need for every tech business in the world.”\n\nAnalysts and experts said that although they were largely confident Nvidia would beat Wall Street expectations, they were anxiously awaiting the earnings call for more news on the status of industry demand for the firm’s AI chips.\n\n“There is still no doubt that Nvidia is far and away the leader for AI-focused chips,” David Meier, senior analyst at investment website the Motley Fool, wrote. “So, I expect revenue, margins, and cashflows to be pretty close to analysts’ estimates. But the valuable information is more likely to come from the commentary about where management sees its markets headed, whether it’s in the AI market or [a] new market the company is currently pursuing.”\n\nShares in Nvidia have been down 7.9% in November after major investors dumped their stocks in the firm. Peter Thiel’s hedge fund, Thiel Macro, sold off its entire stake in the chipmaker in the last quarter. His holdings would have been valued at about $100m, according to a Reuters report. Softbank has also sold off its $5.8bn holdings in the company, further boosting fears of an AI bubble.\n\nShares in Nvidia – which last month became the world’s first $5tn company – rose more than 5% in post-market trade, while S+P 500 and Nasdaq futures also soared. Asian markets also rallied on Thursday, following the news.\n\nHowever, SPI Asset Management’s Stephen Innes said: “Nvidia’s latest forecast has, for now, dulled the sharpest edges of the AI-bubble anxiety that had gripped global markets … But make no mistake: this is still a market balancing on a wire stretched between AI euphoria and debt-filled reality.”\n\n“I do not believe that Nvidia’s growth is sustainable long-term,” said Forrester’s senior analyst Alvin Nguyen. “AI demand is unprecedented, but if there is a market correction due to supply meeting demand or a slowdown in the pace of innovation/businesses getting used to the pace, I expect that the continued growth in Nvidia share value will slow down.”",
  "summary": "<p>Jensen Huang opens earnings call with attempt to dispel concerns after his $5tn firm beat Wall Street expectations</p><p>Global share markets rose after Nvidia posted third-quarter earnings that beat Wall Street estimates, assuaging for now concerns about whether the high-flying valuations of AI firms had peaked.</p><p>On Wednesday, all eyes were on Nvidia, the bellwether for the AI industry and the most valuable publicly traded company in the world, with analysts and investors hoping the chipmaker’s third-quarter earnings would dampen fears that a bubble was forming in the sector.</p> <a href=\"https://www.theguardian.com/technology/2025/nov/19/nvidia-earning-report\">Continue reading...</a>",
  "published": "Thu, 20 Nov 2025 03:36:19 GMT",
  "url": "https://www.theguardian.com/technology/2025/nov/19/nvidia-earning-report",
  "source": "The Guardian"
}