{
  "title": "People of Bihar don’t need politics lessons, they teach world: PM Modi",
  "text": "Crediting the people of Bihar for the massive mandate that returned the ruling NDA to power in the state, Prime Minister Narendra Modi said Saturday that they had rejected the “poison of casteism” and the “divisive” politics of the “Muslim League-Maowadi Congress (MMC) and allied parties” and opted for “new heights in development”.\n\nTargeting Congress leader Rahul Gandhi and RJD’s Tejashwi Yadav — he did not take names but referred to a “naamdar” and a “jamanati beta” — Modi, who was addressing migrants from Bihar at the Surat International Airport, said, “Bihar ke logon ko rajniti samjhani nahi padti hai, woh duniya ko rajniti samjhane ki taakat rakhte hain.”\n\nAdvertisement\n\n(“One doesn’t have to teach politics to the people of Bihar, they wield the power to teach politics to the world.”)\n\n“Go anywhere in the world, and you will find Bihar’s talent. Bihar is now showing a willingness to reach new heights in development. This election reflected that willingness. Bihar’s women and youth — Mahila and Yuva, M-Y — formed a combination that has strengthened the foundation of politics for decades to come. Those who analyse politics will take months to analyse the implications of Bihar’s election results.”\n\n“There are many in the Congress party with nationalist ideology, who at some point worked under the leadership of Indiraji and Rajiv Gandhi. They are unhappy with the conduct of the ‘naamdar’. They say nobody can now save the Congress.”\n\nAdvertisement\n\n“There is a jamanati beta (son out on bail) who went around Bihar giving lectures on casteism and used all his energy to spread the poison of casteism. Going by the past, they felt that maybe we would win the game. But this election has completely rejected the poison of casteism. This is a bright signal for the country,” he said.\n\nOne of the leaders, he said, tore the Waqf law. “They said if they win, they will now allow the Waqf law. People of Bihar rejected this poison of communalism.”\n\n“You must have seen the Bihar Assembly, how it had become a fashion to humiliate (Chief Minister) Nitish Kumar. In Parliament too, the other naamdar, broke all decorum with his unbecoming conduct. People did not accept this.”\n\nTargeting the Congress, he said it should be a “matter of introspection” that those who had ruled for 50-60 years were “finished in one or two decades”.\n\n“They are not able to explain to their own colleagues the reasons for their defeat. They have found an easy way: sometimes the EVM is defeating them, sometimes the Election Commission is defeating them, sometimes the matdata suchi ka shuddhikaran (Special Intensive Revision of electoral rolls) is defeating them. This can last for some time, but will not be accepted by their cadres very long,” he said.\n\n“I know they (the Opposition) cannot talk of Swadeshi, Atmanirbhar Bharat, Viksit Bharat because their primary concern is not this country, nor the future of its people,” Modi said. The Bihar verdict, therefore, is very important for India’s politics, he said.",
  "summary": "",
  "published": "Sat, 15 Nov 2025 22:30:41 +0000",
  "url": "https://indianexpress.com/article/india/people-of-bihar-dont-need-politics-lessons-they-teach-world-pm-modi-10368324/",
  "source": "India | The Indian Express"
}