{
  "title": "UWCL talking points: Chelsea on the rise? PSG headed for an early exit?",
  "text": "Open Extended Reactions\n\nMatchday 4 of this season's UEFA Women's Champions League (UWCL) saw more exciting matchups and gave us a taste of what's to come as the table starts to take shape.\n\nOn Wednesday, Arsenal came back to defeat Real Madrid 2-1 thanks to an Alessia Russo brace, OL Lyonnes salvaged a 3-3 draw vs. Juventus, VfL Wolfsburg rolled past Manchester United 5-2, Paris FC knocked off Benfica 2-0, and Valerenga drew 2-2 with St. Polten.\n\nThen on Thursday, we saw heavyweights Barcelona and Chelsea draw 1-1, Paris Saint-Germain's struggles continue with a 3-1 loss to Bayern Munich, Atlético Madrid steamroll FC Twente 4-0, and OH Leuven and Roma play out a 1-1 draw.\n\nWe asked our writers Julien Laurens, Sam Marsden and Yash Thakur to answer some of our burning questions.\n\n- Women's Champions League: How the new format plays out\n\n- Don't know which UWCL team to support? ESPN can help\n\n- Chelsea make UWCL statement of intent, end Barcelona's perfect run\n\nWhat did we learn about Chelsea's and Barcelona's chances of winning the title?\n\nThakur: Chelsea have finally stood their ground against Barcelona in the Women's Champions League, with a very solid performance that restricted Barcelona to a mere nine shots and one big chance. Sonia Bompastor's side neutralized the three time European champions, especially in midfield. The Blues remain unbeaten in all competitions this season. However, they will be itching to convert these strong performances into victories to win the elusive European title.\n\nBarcelona looked far from their best and have shown vulnerabilities in their recent games. Chelsea and Real Madrid both adopted a player-to-player aggressive marking scheme that caused Barcelona problems at times and made it difficult for them to progress through the middle. Pere Romeu's side remains a strong contender and is one of three unbeaten sides in the UWCL, but with their lack of depth, the Blaugranas are often restricted in their game plan.\n\nDisney+ becomes new home of Women's Champions League in Europe Disney+ will be the only place football fans can watch all 75 matches live each season. Visit the Disney+ website to get access.\n\nMarsden: Don't draw too many conclusions from Thursday's Stamford Bridge stalemate. Given recent meetings between the teams, Chelsea might be happier with the draw than Barcelona, although the English side had the better chances to win it late on.\n\nWhat this match did deliver was further confirmation about Barcelona in general this season. If everyone is fit and on form, they are probably still the best team in Europe, with a nod to OL Lyonnes. However, even just one injury setback -- such as Patri Guijarro and Salma Paralluelo missing this game -- can seriously derail them.\n\nLaia Alexandri has done well stepping in for Guijarro, and Paralluelo is far from guaranteed her place in her side, but take two players out of this Barça squad and the depth is seriously tested. Romeu was reluctant to make changes in search of a win. He made one defensive substitution in the 63rd before waiting for the final 15 minutes to inject fresh legs into the attack.\n\nLaurens: In a way, this draw will feel like a mini-win for Chelsea. They were the better side on Thursday night against arguably the best team in the competition. Their tactical discipline was impressive and their game plan was almost perfect. They gave nothing away to this Barcelona team. On another night, the Blues would have won, but Bompastor will take so many positives from this draw.\n\nFor Barcelona and Romeu, it is the other extreme. This game showed that they are not as superior as they used to be. Arsenal showed it in the final last season, Chelsea did on Thursday, and Leuven made them work hard as well for their opening goal.\n\nChelsea got a solid result vs. Barcelona, but neither side asserted itself as a clear favorite in their 1-1 draw. Alex Davidson/Getty Images\n\nAfter a tough week for Real Madrid, what do they need to take the next step?\n\nThakur: Last season, Real Madrid defeated Arsenal and Real Madrid in back-to-back games. This season they have lost to them both, despite some encouraging performances under new manager Pau Quesada. However, this season they have picked up a win against Paris Saint-Germain for the first time in five meetings.\n\nThe squad quality has improved considerably in the last few seasons, including six additions this summer addressing key areas. It is a case of sticking to this process of strengthening the squad while retaining their key players as there are improvements in their performances. Currently, the squad feels lacking in a clinical striker and a controller in midfield. Quesada's side has its job cut out for it in the upcoming summer.\n\nMarsden: It has been a week of missed chances for Madrid: Naomie Feller off the post against Barcelona, Caroline Weir off the line and then missing a penalty, and then failing to take their opportunities when they were 1-0 up against Arsenal on Wednesday.\n\nIt would be unfair to say it has been easy, but it has certainly been easier to reach the level they are now -- the second-best team in Spain and regularly qualifying for the Champions League -- than it is to take the next step.\n\nThere are loads of signs they are closing the gap on Europe's elite, though. A first win against Barça last March showed that, coupled with a decent run in the Champions League, but they are still lacking what it takes to really compete with the top teams regularly. There are hints of improvement under new coach Quesada, at least, who wants to see his team be more consistent and clinical in both boxes. It is also evident that a little bit more quality will be needed eventually.\n\nLaurens: I was at the Arsenal-Real Madrid game on Wednesday evening, and the Merengues felt in control of most of the first half. It was another good performance from them -- just like it was against Barcelona in the Clásico last weekend, when they created six big chances to Barça's five and lost 4-0.\n\nThey are not far at all from the top. They are probably one top player short at the back to play alongside Maelle Lakrar, who is a classy defender and potentially dangerous as a No. 9 too. Feller played there against the Gunners and was not clinical enough. Overall, Madrid were not efficient enough in both boxes and that's why they lost. But if they can build on their good performances, the results will come.\n\nplay 1:23 Caroline Weir disappointed to lose to Arsenal on a set piece Caroline Weir reacts to her goal and Real Madrid's 2-1 defeat to Arsenal in the Women's Champions League.\n\nWhat on earth happened with OL Lyonnes, and have they shown they are vulnerable?\n\nThakur: Lyonnes reinforced their squad a lot in the summer. However, most of their signings were attacking in nature. There were questions around their midfield, defense and overall squad balance. I think a lot of what we saw against Juventus this matchday boils down to this.\n\nWhile what happened against Juventus was a freak incident, the midfield balance continues to be skewed toward the attack. This is especially true without Korbin Shrader on the pitch. The French champions have talismanic attacking talents in midfield, but finding the right balance between them remains coach Jonatan Giráldez's biggest challenge at the club.\n\nLaurens: I really don't think there was anything alarming in OL Lyonnes' draw with Juventus on Wednesday. They were 3-0 down at halftime, true, but only because Juventus were clinical while the French side wasted chance after chance. In the second half, they dominated again and came back and probably should have won the game.\n\nI hear Yash about the midfield, but the issue was more that Giráldez tried Lily Yohannes in there, which was a mistake. He took her off at the break and replaced her with Korbin Shrader, and things were so much better. The same was true when Alice Sombath took Tarciane's place at the back. They need to get better, for sure, but I am not worried at all right now. The Lyonnaises are still my favorite to win this competition, especially considering that they are sitting at the top of the table, level with Barcelona, while they are not even at their best yet.\n\nMarsden: I am with Jules on this. Lyonnes can write this off as a freak night, given how they found themselves 3-0 down at the end of a first half in which Juventus only managed 24% possession and three shots on target. If anything, it will help Giráldez warn his players in the future that they can not take anything for granted in this competition.\n\nTeams such as Arsenal last season and Wolfsburg, Man United, Bayern and Chelsea this year are showing they can compete with the big two of Lyonnes and Barça. Lyonnes, though, displayed in the second half against Juve how easily they can switch it back on. They probably should have won the game. I certainly would not call them vulnerable just yet, but last year's semifinal loss to Arsenal and this game against Juve should keep them on their toes.\n\nWhat has gone wrong for PSG? They've had some tough fixtures, but are they heading out early?\n\nThakur: The squad quality has dipped at Paris Saint-Germain over the last few summers. The style of play has changed under new manager Paulo César and the defense looks bleak. All of this has been evident in their recent performances at the domestic and European level. The decline in squad quality has made it difficult for them to compete with the best teams.\n\nAll of ESPN. All in one place. Watch your favorite events in the newly enhanced ESPN App. Learn more about what plan is right for you. Sign Up Now\n\nThey are the only team yet to earn a point in the new UWCL format, conceding 11 times and scoring just thrice. With a comparatively easier run of games against OH Leuven and Benfica up next, there could be some cautious optimism. However, their destiny isn't in their hands anymore. Last season's elimination in the qualification rounds was the early alarm bell that the team didn't listen to.\n\nLaurens: This is a team in transition -- a massive one. There should not be too much expectation on them. They are moving away from their free-spending, big-name-signing policy to developing young talents from Paris and building around them. I was at the PSG-Bayern game, and despite the evident superiority of the German side, especially technically, the Parisians were closer to 2-2 than to 1-3 for most of the second half. There have been positives in their performances recently, at Manchester United and on Thursday, but without the results. Their four fixtures (Wolfsburg, Real Madrid, Manchester United and Bayern Munich) were really tough for such a young team with an inexperienced manager in Paulo César. I expect them to beat Leuven at home and Benfica away but I don't think six points will be enough to qualify unfortunately.\n\nMarsden: Two things are true here. PSG are a team in transition that has been dealt a really tough fixture list in Europe. But it is also remarkable that a team that has historically done quite well in the Champions League is the only side without a point after four matches. There needs to be some major soul-searching at the club over the coming months, because that is not acceptable. Given the team in the 12th and final qualifying position -- Paris FC -- currently has five points, it's hard to see how they get out of this mess this season. The good news is it can't get any worse.\n\nWhich of the smaller teams have impressed you most, and who could qualify?\n\nThakur: It has to be OH Leuven. One of the debutants this year from Belgium, they have held their own against every opponent. Even in the 3-0 defeat to Barcelona, they came out looking all right. They have matched clubs such as Roma and Paris FC, two midsized clubs with Champions League experience and ambitions.\n\nOH Leuven and Valerenga seem to be in the race for a spot in the qualification playoffs. The latter seemed to be the best positioned as of now, but their dropped points against St. Polten this matchday could prove costly. The former have upcoming tough challenges against PSG and defending champions Arsenal, making it a tough task. If their performances against Paris FC and Roma are any indicators, they could cause an upset against the Parisian side.\n\nLaurens: I agree with Yash on Leuven, but I will go for Valerenga, who are just a point behind (4 points vs. 5) with a slightly better goal difference (minus-1 to minus-2). They were unlucky to lose against Wolfsburg in the 98th minute and were solid in their win away at Roma, but they missed a massive opportunity by dropping two points against St. Polten despite a 2-0 lead. They work really hard and will fancy their chances against Paris FC at home next month. If they win that, they will have made a massive step toward the top 12 and qualification for the next round.\n\nMarsden: It's absolutely Leuven. Like Yash says, even against Barça, they were so close to getting to the break goalless, and they have lost just one of their four games. It's going to be a nail-biting few weeks to see if they can make it through. They probably need a result against either PSG or Arsenal to make the playoff round. Even considering PSG's dreadful form in Europe, that is going to be difficult.\n\nAnd people might object to them being called small teams (and both also had setbacks this week) but Madrid and Man United, who have little history in the women's game, continue to make inroads. Neither side had lost before this round of fixtures, and they both remain in the top seven, well on track to reach the next stage of the competition.",
  "summary": "Julien Laurens, Sam Marsden and Yash Thakur answer some of our burning UWCL questions.",
  "published": "Thu, 20 Nov 2025 23:58:32 EST",
  "url": "https://www.espn.com/soccer/story/_/id/47037068/uwcl-talking-points-chelsea-title-chances-psg-struggles",
  "source": "www.espn.com - TOP"
}