{
  "title": "Hours after suspension over ‘anti party activities’, former Union Minister RK Singh quits BJP",
  "text": "Former Union minister and senior BJP leader RK Singh resigned from the party on Saturday hours after he was suspended for “anti-party activities.” His exit came a day after the NDA swept the Bihar assembly elections and amid Singh’s growing rift with the party leadership.\n\nSingh said the BJP’s suspension letter “does not specify the anti party activities of which I have been accused. I cannot give a showcase against charges which have not been specified.”\n\nA former MP from Arrah, Singh had openly criticised both the BJP and the Nitish Kumar-led NDA government in Bihar for months. His allegations of a scam in the commissioning of a power plant—raised days before the state went to polls—triggered a political storm and deepened tensions within the alliance.\n\nIn its suspension notice issued Saturday morning, the BJP accused him of serious indiscipline: “You are indulging in anti-party activities… This has caused harm to the party. Therefore, you are being suspended and asked to explain why you should not be expelled.” The party asked him to submit a reply within one week.\n\nBihar BJP suspends former Union Minister RK Singh for “anti-party activities”. The party has asked him to submit a reply within one week. pic.twitter.com/fFB7ydsvnf — ANI (@ANI) November 15, 2025\n\nHours later, Singh said he has submitted his resignation to BJP national president JP Nadda. “I have sent my resignation to the party. The letter sent by me to the state office and the resignation sent to the honourable national president of the BJP are attached,” he wrote on X.\n\nIn his resignation letter, Singh argued that his comments did not amount to anti-party activity. “The show cause is probably because of my statement against the distribution of tickets to people with a criminal background. The statement is not anti-party. It is in the interest of the nation, the society at large and the party to stop criminalisation of politics and to curb corruption,” he wrote, adding that “some people in the party are not comfortable with this”.\n\nIn a Facebook post in October, Singh had urged voters to not support leaders with criminal records\n\nA bureaucrat-turned-politician\n\nSingh, a 1975-batch IAS officer from the Bihar cadre, previously served as home secretary under Prime Minister Manmohan Singh and later as secretary in the Department of Defence Production. After retiring in 2013, he joined the BJP and went on to win the Arrah Lok Sabha seat in 2014 and 2019.\n\nHe held significant portfolios in the Modi government, and was the Minister for Power and New & Renewable Energy. He was previously the Minister of State for Skill Development and Entrepreneurship.",
  "summary": "",
  "published": "Sat, 15 Nov 2025 14:12:39 +0000",
  "url": "https://indianexpress.com/article/india/rk-singh-quits-bjp-suspension-anti-party-activities-10367934/",
  "source": "India | The Indian Express"
}