{
  "title": "India will continue to treat terrorists and their sponsors alike, relations with China improved significantly: Army Chief General Upendra Dwivedi",
  "text": "India will continue to treat terrorists and their sponsors alike, and will respond to those encouraging terrorists, Army Chief General Upendra Dwivedi said Monday, in a message to Pakistan.\n\nFurther, he called Operation Sindoor an 88-hour trailer, adding that, if given the chance, Pakistan would be taught a lesson on how a responsible nation should behave towards a neighbouring country.\n\nHe also stated that relations between India and China have improved significantly since October last year, following dialogue between the leaders of the two nations to restore normalcy.\n\nHe made the statements during an interactive session at the curtain raiser event of the Chanakya Defence Dialogue to be held in Delhi at the end of this month.\n\nGen Dwivedi said when a country encourages state-sponsored terrorism, it is a matter of concern for India.\n\n“India talks about progress, but if someone creates obstacles in our path, then we will have to take some action against them” he said.\n\n“When we talk about the new normal, we have said that talks and terror can’t go together.”\n\nStory continues below this ad\n\n“All we are asking is to adopt a peaceful process, which we will cooperate with. Until then, we will treat terrorists and their sponsors alike. We will respond to those encouraging terrorists,” he said, adding that India today is accomplished enough not to be scared of any blackmail attempt.\n\nLooking for solutions on the ground at LAC, says General Dwivedi\n\nTalking about the situation at the Line of Actual Control (LAC) in eastern Ladakh, he said, “There has been a lot of improvement in our (India and China) relations since last October, following talks between the political leadership of the two nations to bring normalcy.” He added that both sides have agreed to have a dialogue and look at ways to achieve conflict resolution.\n\nIndia and China reached an agreement in October last year to disengage from the remaining legacy friction points along the LAC.\n\nGen Dwivedi said that since last year, there have been 1,100 ground-level military interactions, or approximately three interactions a day.\n\nStory continues below this ad\n\nHe said these interactions have been at the battalion and company commander levels. “Our efforts are to solve as many issues as possible on the ground, and we are looking for solutions on the ground. However, major decisions will be made at higher levels. Both sides have been directed to solve as many issues as possible on the ground,” he said, adding that cooperation on the ground between the two sides is “very good”.\n\nHe said that while disengagement has been achieved significantly along the LAC, other bigger issues on the boundary questions will be handled as per the directions of the Working Mechanism for Consultation and Coordination (WMCC) on India–China Border Affairs.\n\nDiscussing modern, multi-domain battles, he said it is impossible to predict how long they will last. “We have to ensure we have supplies to last long.”",
  "summary": "",
  "published": "Mon, 17 Nov 2025 12:55:36 +0000",
  "url": "https://indianexpress.com/article/india/terrorists-sponsors-china-relations-india-army-chief-general-upendra-dwivedi-10370941/",
  "source": "India | The Indian Express"
}