{
  "title": "Tej Pratap’s warning to ‘Jaichands’ amid Rohini Acharya row; urges PM Modi, Amit Shah to order probe",
  "text": "Tej Pratap Yadav, Lalu Prasad Yadav’s elder son who was expelled from the Rashtriya Janata Dal, on Tuesday came out in support of his sister Rohini Acharya following her recent public allegations of humiliation by her brother Tejashwi Yadav and his aide Sanjay Yadav. Tej Pratap Yadav also urged the Centre and the Bihar government to order a probe if his parents were subjected to any form of mental harassment.\n\nTej Pratap Yadav, who lost the election from Mahua assembly seat in the recently concluded elections, voiced his sentiments in support of Rohini Acharya in a post on his X handle, blaming the crisis on “Jaichand”, a metaphor for traitors.\n\nAdvertisement\n\nThe former Bihar minister also urged Prime Minister Narendra Modi, Union home minister Amit Shah and the state government to investigate if his parents have been subjected to any form of mental harassment.\n\n“It is being said that some people, Jaichands, are making attempts to keep my parents Lalu Prasad ji and my mother under mental and physical pressure. If there is even a shred of truth in this, then this is not just an attack on my family, it is a direct blow to the very soul of the RJD.\n\n“I request the PM, Amit Shah ji, and the Bihar government that an impartial, strict, and immediate investigation be conducted in the matter,” Tej Pratap said in a social media post shared from his Janshakti Janta Dal’s account.\n\nAdvertisement\n\nHe further said irregularities in ticket distribution, giving tickets in exchange for money, and the collusive politics of flatterers have ignored those pillars who dedicated themselves day and night to build the RJD over the years.\n\nToday, these same Jaichands, driven by greed and sycophancy, are destroying both the family and the organisation, he added.\n\n“My father is already unwell, he absolutely cannot bear such pressure. I also request the government that if anyone has misbehaved, pushed or manhandled, hurled filthy abuses, or inflicted mental/physical harassment on my sister, my mother, or my father, then people such as Sanjay Yadav, Rameez Nemat Khan and Pritam Yadav must immediately be booked and FIRs should be registered against them,” he wrote.\n\nWhat Tej Pratap said on Rohini Acharya\n\nIn another post on his X handle, Tej Pratap wrote, “I will not tolerate the insult to our sister under any circumstances… Jaichands will have to pay the price for their misdeeds… they will have to face the consequences.”\n\n“Whatever has happened with Rohni didi has shaken me. I tolerated whatever happened to me, but I can’t tolerate this insult to my sister. It’s unacceptable and unbearable,” he said.\n\n“I must tell all these Jaichands… If they target our family, people of Bihar will never forgive them,” he added.\n\nWhat Rohini Acharya alleged\n\nOn Sunday, Rohini Acharya alleged that she has been “sworn at” and accused of extracting “crores of rupees and a party ticket” in exchange for a “filthy kidney” that she gave to her ailing father.\n\nA day after having left for Delhi, claiming that she had been “driven out” of her parents’ home by the cohorts of her younger brother Tejashwi Yadav, the 47-year-old shared lurid details of what took place at their place after the party suffered a debacle in the Bihar assembly elections.\n\nIn a couple of posts on her X handle, Acharya alleged, “I was sworn at (gandi galiyan di gayi)”, and was “accused of having given my filthy (gandi) kidney to my father” in exchange for “crores of rupees and a party ticket”.\n\nAcharya, who had donated a kidney to Lalu Prasad, had contested last year’s Lok Sabha polls, unsuccessfully, from Saran. In her emotionally charged posts, she rued having made the sacrifice to save her father’s life “without caring for the approval of my husband and my in-laws or for the well-being of my three children”.\n\nIn a dig at Tejashwi Yadav, her father’s heir apparent, and Sanjay Yadav, she said, “May all married women, if they have a brother, never take such a step. They should ask their brother to donate his own kidney or that of a Haryanvi friend.”",
  "summary": "",
  "published": "Tue, 18 Nov 2025 14:10:56 +0000",
  "url": "https://indianexpress.com/article/india/tej-prataps-warning-to-jaichands-amid-rohini-acharya-row-urges-pm-modi-amit-shah-to-order-probe-10372768/",
  "source": "India | The Indian Express"
}