{
  "title": "A 2,000-year mystery in chameleon eyes is finally solved",
  "text": "Chameleons have intrigued observers for thousands of years, largely because their eyes seem to roam independently in nearly every direction. After centuries of curiosity, modern imaging techniques have now uncovered the anatomical feature responsible for this extraordinary ability. Hidden behind each protruding eye are two long, spiraled optic nerves -- a configuration not documented in any other lizard species.\n\n\"Chameleon eyes are like security cameras, moving in all directions,\" explained Juan Daza, associate professor at Sam Houston State University and author of a new study describing the trait. \"They move their eyes independently while scanning their environment to find prey. And the moment they find their prey, their eyes coordinate and go in one direction so they can calculate where to shoot their tongues.\"\n\nA Surprising Discovery in the Lab\n\nAlthough chameleons' shifting gaze is easy to see, the internal structures enabling it have remained unclear. That changed in 2017 when Edward Stanley, director of the Florida Museum of Natural History's digital imaging laboratory, noticed an unexpected pattern while visiting Daza's lab. A CT scan of the minute leaf chameleon (Brookesia minima) revealed tightly coiled optic nerves, a shape unlike anything he had encountered.\n\nDespite the excitement, both researchers hesitated at first. Given the long scientific history surrounding chameleons, they assumed someone must have reported this structure before.\n\n\"I was surprised by the structure itself, but I was more surprised that nobody else had noticed it,\" Daza said. \"Chameleons are well studied, and people have been doing anatomical studies of them for a long time.\"\n\nChameleons' Distinctive Biology\n\nChameleons inhabit parts of Africa, Europe and Asia, and their remarkable adaptations go far beyond color change. They move through trees using a prehensile tail for balance and mitten-like feet for a careful, measured stride. Their slow pace is compensated by a high-speed weapon: a tongue that can accelerate from zero to 60 miles per hour in about one hundredth of a second. This sticky, elongated tongue can strike prey located at more than double the chameleon's own body length.\n\nWith such striking qualities, it is unsurprising that chameleons have appeared in human culture for millennia. Their recognizable silhouettes, complete with coiled tails, even appear in ancient Egyptian rock carvings. Convinced that someone must have described the optic nerve coils in earlier literature, the research team combed through vast archives. They enlisted language experts to interpret old anatomical works written in French, Italian and Latin, sometimes in a perplexing blend of several languages.\n\nHistorical Attempts to Explain Chameleon Vision\n\nMore than two thousand years ago, Aristotle incorrectly suggested that chameleons lacked optic nerves entirely. He believed their eyes were connected directly to the brain, which, in his view, explained their independent movement. In the mid-1600s, Roman physician Domenico Panaroli refuted this idea, asserting that chameleons do possess optic nerves, but that they do not cross as they do in many other animals. In most vertebrates, this crossing transfers information from the right eye to the left side of the brain and vice versa. Panaroli reasoned that the absence of this crossing granted chameleons greater freedom of eye movement.\n\nIsaac Newton later supported Panaroli's conclusions. He referenced chameleons in his 1704 book Optiks, a collection of three decades of his ideas on color and light. However, French anatomist Claude Perrault had already drawn a much more accurate representation in 1669, showing two optic nerves that crossed and then continued straight. His illustration received little attention from Newton's contemporaries, even though it was one of the clearest early depictions.\n\nWhy the Optic Nerve Coils Went Unnoticed\n\nOver time, published diagrams came close to showing the true shape of the optic nerves but never captured it fully. Johann Fischer's 1852 treatise on lizard neuroanatomy included part of the coil but omitted the remainder, and Fischer never described the curled structure. In 2015, Lev-Ari Thidar, a master's student at the University of Haifa, noted a C-shaped section of the nerve. Only after a detailed literature search did the modern research team confirm that no complete description of the coil existed.\n\nHow such a distinctive feature remained hidden for so long became clear as scientists examined historical research methods. Earlier studies relied heavily on physical dissections. These procedures frequently damaged or shifted the fragile optic nerves, making accurate observations nearly impossible.\n\n\"Throughout history people have looked at chameleon eyes because they're interesting,\" Stanley said. \"But if you physically dissect the animal, you lose information that can tell the full story.\"\n\nCT Imaging and Open Access Data Transform Research\n\nToday, CT scanning is widespread in medical and scientific settings. High-resolution X-ray CT makes it possible to view structures concealed inside preserved specimens, including the interior of a chameleon's skull.\n\nSpotting a coiled optic nerve in one chameleon provided an important clue, but researchers needed broader evidence. Fortunately, they had access to extensive digital resources through oVert (short for openVertebrate). This project, led by the Florida Museum of Natural History and involving 18 U.S. institutions, offers public access to 3D digital models of vertebrate anatomy.\n\n\"These digital methods are revolutionizing the field,\" Daza said. \"Before, you couldn't discover details like this. But with these methods, you can see things without affecting the anatomy or damaging the specimen.\"\n\nComparing Chameleons With Other Reptiles\n\nUsing oVert datasets, the team examined CT scans from more than thirty lizards and snakes, including three chameleon species representing major lineages. They built 3D brain models for 18 of these reptiles and measured the optic nerves in each. All three chameleon species displayed optic nerves that were significantly longer and more tightly coiled than those of the other lizards. This confirmed that the initial finding in Daza's lab was representative of the group.\n\nThe researchers then investigated how the coils develop in young chameleons. Examining embryos of the veiled chameleon (Chamaeleo calyptratus) at three stages, they noted that the optic nerves start straight and lengthen over time, eventually forming loops before the animal hatches. Hatchlings already possess fully mobile eyes.\n\nEvolutionary Context for the Eye Coils\n\nDetermining when this feature evolved is more difficult. The oldest known chameleon fossils date to the early Miocene, about 16 to 23 million years ago, long after many of their arboreal adaptations had appeared. These fossils do not reveal much about the sequence in which traits emerged. However, the newly documented nerve coils provide a clue about why this adaptation may have arisen.\n\nMany vertebrates with large eyes expand their field of view in one of two ways: by turning their head or by moving their eyes extensively. Owls and lemurs rotate their necks to look around. Humans and some other mammals rely on stretchy optic nerves that allow substantial eye movement. Rodents achieve a similar effect with wavy nerve fibers that add flexibility.\n\nChameleons, however, do not have flexible necks. The researchers suggest that the coiled optic nerve developed as a workaround, giving the eyes extra slack and reducing strain as they pivot. A comparable adaptation has been observed only in a few invertebrates, such as the stalk-eyed fly.\n\n\"You can compare optic nerves with old phones,\" Daza said. \"The first phones just had a simple, straight cord attached to the headset, but then someone had the idea to coil the cord and give it more slack so people could walk farther while holding it. That's what these animals are doing: They're maximizing the range of motion of the eye by creating this coiled structure.\"\n\nContinuing the Search for Visual Adaptations\n\nEven with thousands of years of interest in chameleons, new surprises continue to emerge. Researchers now wonder whether other tree-dwelling lizards evolved similar solutions. Stanley and Daza plan to explore this question in future work.\n\n\"These giants we've cited -- Newton, Aristotle and others -- have inspired natural historians for centuries,\" Stanley said. \"It's exciting to be the ones taking the next step along the long road to understanding what on earth is going on in chameleons.\"\n\nThe authors published their study in the journal Scientific Reports.",
  "summary": "Chameleons’ extraordinary ability to move their eyes independently stems from a previously overlooked anatomical marvel: long, tightly coiled optic nerves hidden behind their bulging eyes. Modern CT imaging finally revealed this structure, which centuries of dissections and even the scrutiny of figures like Aristotle and Newton failed to capture. The coils give the eyes extra slack, enabling nearly 360-degree scanning without neck mobility.",
  "published": "Wed, 19 Nov 2025 08:57:20 EST",
  "url": "https://www.sciencedaily.com/releases/2025/11/251118220056.htm",
  "source": "All Top News -- ScienceDaily"
}