{
  "title": "Convicted Murderer Sues For His 'Human Right' To Eat A Divisive Foodstuff",
  "text": "LOADING ERROR LOADING\n\nMELBOURNE, Australia (AP) — A prisoner is challenging an Australian state’s ban on inmates eating Vegemite, claiming in a court suit that withholding the yeast-based spread breaches his human right to “enjoy his culture as an Australian.”\n\nAndre McKechnie, 54, serving a life sentence for murder, took his battle for the salty, sticky, brown byproduct of brewing beer to the Supreme Court of Victoria, according to documents released to The Associated Press on Tuesday.\n\nAdvertisement\n\nMost Australians revere Vegemite as an unfairly maligned culinary icon, and more than 80% of Australian households are estimated to have a jar in their pantries.\n\nBut inmates in all 12 prisons in Victoria are going without.\n\nMcKechnie is suing Victoria’s Department of Justice and Community Safety and the agency that manages the prisons, Corrections Victoria.\n\nThe case is scheduled for trial next year.\n\nVegemite has been banned from Victorian prisons since 2006, with Corrections Victoria saying it “interferes with narcotic detection dogs.” via Associated Press\n\nAdvertisement\n\nPrisoner argues Vegemite ban breaches Charter of Human Rights and Responsibilities\n\nVegemite has been banned from Victorian prisons since 2006, with Corrections Victoria saying it “interferes with narcotic detection dogs.”\n\nInmates used to smear packages of illicit drugs with Vegemite in the hope that the odor would distract the dogs from the contraband.\n\nVegemite also contains yeast, which is banned from Victorian prisons because of its “potential to be used in the production of alcohol,” the contraband list says.\n\nAdvertisement\n\nMcKechnie is seeking a court declaration that the defendants denied him his right under the Charter of Human Rights and Responsibilities Act to “enjoy his culture as an Australian.”\n\nThe Act guarantees “All persons with a particular cultural, religious, racial or linguistic background” the right to “enjoy their culture, to declare and practice their religion and to use their language.”\n\nHe also wants a declaration that the defendants breached the Corrections Act by “failing to provide food adequate to maintain” McKechnie’s “well-being.”\n\nAdvertisement\n\nThe Australian favorite since 1923 considered an acquired taste\n\nManufactured in Australia since 1923 as an alternative to Britain’s Marmite, Vegemite was long marketed as a source of vitamin B for growing children.\n\nThe spread is beloved by a majority of Australians, but typically considered an acquired taste at best by those who weren’t raised on it.\n\nAdvertisement\n\nThe last U.S. president to visit Australia, Barack Obama, once said: “It’s horrible.”\n\nAustralian band Men at Work aroused international curiosity about the spread when they mentioned a “Vegemite sandwich” in their 1980s hit “Down Under.”\n\nThe band’s lead singer, Colin Hay, once accused American critics of laying Vegemite on too thick, blaming a “more is more” U.S. culture.\n\nIt’s a favorite on breakfast toast and in cheese sandwiches, with most fans agreeing it’s best applied sparingly. Australian travelers bemoan Vegemite’s scarcity overseas.\n\nAdvertisement\n\nThe Australian government intervened in April when Canadian officials temporarily prevented a Toronto-based cafe from selling Vegemite in jars and on toast in a dispute media branded as “Vegemite-gate.” The Canadians relented and allowed the product to be sold despite its failure to comply with local regulations dealing with food packaging and vitamin fortification.\n\nThe Department of Justice and Community Safety and Corrections Victoria declined to comment Tuesday. Government agencies generally maintain it is not appropriate to comment on issues that are before the courts.\n\nAdvertisement\n\nPrisons in Queensland state also ban Vegemite, but Australia’s most populous state, New South Wales, does not. Other Australian jurisdictions had yet to tell AP on Tuesday where they stand on the spread.\n\nVictims of crime brand Vegemite lawsuit frivolous and offensive\n\nVictims of crime advocate and lawyer John Herron said it was a frivolous lawsuit that was offensive to victims’ families.\n\n“As victims, we don’t have any rights. We have limited if any support. It’s always about the perpetrator, and this just reinforces that,” said Herron, whose daughter Courtney Herron, was beaten to death in a Melbourne park in 2019.\n\nAdvertisement\n\nHer killer was found not guilty of murder by reason of mental impairment.\n\n“It’s not a case of Vegemite or Nutella or whatever it may be. It’s an extra perk that is rubbing our faces in the tragedy that we’ve suffered,” Herron added.\n\nMcKechnie is currently held at maximum-security Port Phillip Prison. He was 23 years old when he stabbed to death wealthy Gold Coast property developer Otto Kuhne in Queensland in 1994.\n\nHe was sentenced to life for murder and transferred a decade later from the Queensland to the Victorian prison system.\n\nAdvertisement\n\nHe wrote last year that he spent eight years out on parole in Victoria before he decided that the system “had done more damage than good” and opted to return to prison a decade ago.",
  "summary": "The spread -- which Barack Obama once called “horrible\" -- is banned in some Australian prisons with officials saying it “interferes with narcotic detection dogs.”",
  "published": "Tue, 18 Nov 2025 05:30:04 -0500",
  "url": "https://www.huffpost.com/entry/australia-prisoner-human-right-food_n_691c46eee4b0414d84d74ac8",
  "source": "World News"
}