{
  "title": "Behind taxi turf wars that cast shadow on tourism in Goa",
  "text": "The tourism season has started in Goa, and so have the turf wars between taxi operators.\n\nThe long-running feud between traditional taxi operators and app-based taxis continues to cast a shadow on Goa’s tourism sector, with instances already emerging of visitors facing difficulties, and the government acknowledging that this is an issue that has to be brought under control.\n\nLast week, a German tourist and vlogger posted a video on social media, claiming he faced harassment from local taxi and rickshaw operators in South Goa’s Canacona when he tried to book a cab from an app-based aggregator. The tourist later uploaded another video, saying the local police informed him that they were “looking seriously” into the matter. The incident comes a month after another tourist from Mumbai was seen lugging suitcases for over a kilometre in Varca as she walked to a taxi she booked on an app. The cab driver refused to pick her up from her hotel, citing fear of being attacked by the local taxi union.\n\nTourism Minister Rohan Khaunte on Wednesday issued a stern warning to the taxi operators, saying, “Dadagiri (hooliganism) will not work.” Acknowledging that tourism is impacted due to such incidents, he said, “Everywhere, only one question is asked, ‘Is the taxi system under control?’ and I think it has to come under control. I would not call them a ‘mafia’, but there are some troublemakers in the taxi sector, and these troublemakers need to be handled to ensure that tourism runs efficiently.”\n\nTaxi unions have historically enjoyed political patronage, especially in the coastal belt, and are a vital vote bank for legislators in those areas. The minister said these MLAs need to “come out of the mindset of vote-bank politics”, adding, “The issue needs to be resolved because things are escalating. Tourists are being dragged out… What world are we in? If we kill the hen [which lays the golden eggs], where will the eggs come from?”\n\nThe tussle over app-based services\n\nFor years, tourists have complained that privately-owned taxis fleece customers and charge extortionate fares. A flight from Bengaluru to Goa can often be cheaper than a taxi ride from Dabolim airport to Pernem. The taxi unions have also opposed the entry of app-based taxi aggregators like Ola and Uber, saying it would open the floodgates for “outsiders” to threaten the livelihood of local Goan drivers. In June, Goa Chief Minister Pramod Sawant announced that cab aggregators like Ola and Uber would not come to the state.\n\nIn 2018, the Goa Tourism Development Corporation launched a state government-backed app-based taxi service, GoaMiles — the state’s first such app-based service. Over the years, taxi unions have demanded that the service be scrapped and often got into scuffles with its drivers, especially outside five-star hotels and the airport. Goa currently has two local aggregators, GoaMiles and Goa Taxi App.\n\nStory continues below this ad\n\nUtkarsh Dabhade, the founder and CEO of Goa Miles, said the situation was improving. “This is not something new that we are facing in the transport domain. These challenges exist in many parts of the country. It has been rightly articulated by the Tourism Minister also that hooliganism is not acceptable in the tourism space. Tourists coming to Goa should have a mesmerising experience, in terms of travel, stay and convenience, and we are committed to ensuring that. The number of such harassment incidents faced by our drivers have reduced drastically over a period of time,” he said.\n\n“A lot of effort is being taken by the administration and police, and due to coordination with local unions, the situation is better than earlier. That’s how we have increased the number of taxis to 5,000. The Goa Miles drivers are not outsiders. They are all Goans,” Dabhade said.\n\nDrivers of traditional taxis said Goa, being a small state, does not require an app-based cab service. “App-based taxi aggregators work in metropolitan cities. In Goa, there is simply not enough demand or volume. If app-based aggregators come, they will flood the market with their big fleets and drive us out. Some apps already exist, but where is the demand, except for a few months during tourist season in the coastal belt?” asked Abhay Kandolkar, a taxi driver in Candolim.\n\n“The drivers affiliated with these apps coach passengers to walk from their resorts and poach them. So, we have to step in then…to stop them. We do not like to see tourists dragging trolleys like a coolie. The government must ensure that the fares are uniform for everyone, otherwise the problem…, and the turf war, will continue,” he said.\n\nStory continues below this ad\n\nTraditional taxi operators fear that the app-based aggregators will displace them in the long run. “When tourism thrived, our previous generations set up this business. We are fighting for our livelihood and identity. The taxi business must be in the hands of locals, not outsiders from other states. After mining ended, locals are mostly employed in the tourism or taxi business,” said Kandolkar.\n\n‘Ambassadors of tourism’\n\nSairo Tarasco has been driving a taxi for more than three decades. His father, too, drove a taxi when the first wave of tourists arrived in the late 1960s and 1970s. It upsets him when taxi operators are called a “mafia”.\n\n“We are the ambassadors of tourism in Goa,” said Tarasco, sitting on a bench outside a prominent hotel in North Goa’s Candolim on Thursday evening. He said he has only completed one ride, earning Rs 1,200, the whole day, showing a notebook with all the entries of the taxi stand.\n\nThe taxi system in the state is largely governed by an unwritten social contract, built around cooperation and trust, he said. Taxi drivers operate according to a queue system, and camp outside hotels, railway stations, airports and designated taxi stands. “When I pick up a passenger from Candolim and drop him at the airport, I will not pick up a passenger for the return journey…since other local drivers already have a stand at the airport. Everyone followed this system, and there was no dispute. So, the cost, which may seem excessive to a passenger, is reflected in the fare,” Tarasco said.\n\nStory continues below this ad\n\n“The problem started when the app-based services arrived a few years ago and started to undercut us by charging lower fares,” he claimed.\n\nGurudas Pai, who has a black-and-yellow taxi at the prepaid taxi counter in Panaji, also took issue with the “mafia” allegations. He said, “We are charging the gazetted rates that are notified by the government. We are not a mafia, we are not stealing from anyone.”\n\nIn June, the state Tourism Department urged local taxi operators to “integrate” with state-backed digital taxi platforms to align with the government’s broader vision to promote “smart mobility, economic inclusion and a tourist-friendly environment through regulated and transparent services”.\n\nMany drivers are, however, reluctant to get on board. A driver, who was affiliated with GoaMiles and requested anonymity, said, “Last year, when I went to pick a customer at a hotel in South Goa, the local taxi unions punctured my car tyre and threatened me. They asked the passenger to deboard. I was scared they would attack me. I now drive a rental cab.”",
  "summary": "",
  "published": "Sun, 16 Nov 2025 01:35:46 +0000",
  "url": "https://indianexpress.com/article/india/behind-taxi-turf-wars-that-cast-shadow-on-tourism-in-goa-10368241/",
  "source": "India | The Indian Express"
}