{
  "title": "Pope Leo Blasts ‘Disrespectful’ Trump-Era Policy, Backs U.S. Bishops’ Rebuke",
  "text": "LOADING ERROR LOADING\n\nCASTEL GANDOLFO, Italy (AP) — Pope Leo XIV on Tuesday strongly backed U.S. bishops who condemned the Trump administration’s immigration crackdown, as he urged the American people to listen to them and treat migrants humanely.\n\nHistory’s first American pope was asked about the “special message” the U.S. Conference of Catholic Bishops adopted during the bishops’ general assembly last week. The text criticized the Trump administration’s mass deportation of migrants and the “vilification” of them in the current migration debate. It lamented the fear and anxiety immigration raids have sown in communities, and the denial of pastoral care to migrants in detention centers.\n\nAdvertisement\n\nLeo, who has previously urged local bishops to take the lead on speaking out on matters of social justice, said he appreciated the U.S. bishops’ statement and urged Catholics and all people of goodwill to listen to what they said.\n\n“I think we have to look for ways of treating people humanely, treating people with the dignity that they have,” said the Chicago-born Leo. “If people are in the United States illegally, there are ways to treat that. There are courts, there’s a system of justice.”\n\nPope Leo has previously urged local bishops to take the lead on speaking out on matters of social justice. via Associated Press\n\nAdvertisement\n\nSpeaking to reporters as he left the papal country house south of Rome, Leo acknowledged there are problems in the U.S. migration system. But he stressed that no one has said the U.S. should have open borders, and that every country has the right to determine who can enter and how.\n\n“But when people are living good lives, and many of them for 10, 15, 20 years, to treat them in a way that is extremely disrespectful to say the least — and there’s been some violence unfortunately — I think that the bishops have been very clear in what they said,” he said.\n\n“I would just invite all people in the United States to listen to them.”\n\nThe bishops’ “special message” was rare, the first time since 2013 the bishops had penned such a single-issue statement at one of their meetings. It was accompanied by an Instagram video of individual bishops reading the text on camera, to hammer home its message.\n\nAdvertisement\n\nUpcoming travel plans\n\nLeo spoke to reporters gathered outside his villa in Castel Gandolfo, where he usually spends Monday afternoons and Tuesdays relaxing, playing tennis and swimming in the estate’s indoor pool.\n\nHe suggested that he is planning more travel starting in 2026, after his Rome commitments ease up with the end of the Holy Year.\n\nAsked if he would return to Peru, where he spent some 20 years as a missionary, Leo said “of course.”\n\nAdvertisement\n\nBut he also hinted at other possible destinations, including the Fatima shrine in Portugal, the Guadalupe shrine in Mexico, and visits to Argentina and Uruguay.\n\n“I love to travel, the problem is scheduling with all the commitments,” he said.\n\nLeo next week will embark on his first foreign trip as pope, to Turkey and Lebanon.\n\nAP journalist Nicole Winfield in Rome contributed to this report. Associated Press religion coverage receives support through the AP’s collaboration with The Conversation US, with funding from Lilly Endowment Inc. The AP is solely responsible for this content.",
  "summary": "The first American pope talked about \"ways of treating people humanely, treating people with the dignity that they have.\"",
  "published": "Thu, 20 Nov 2025 02:22:30 -0500",
  "url": "https://www.huffpost.com/entry/pope-leo-donald-trump-immigration-policies_n_691ebcd9e4b0d33fcd988d56",
  "source": "Politics"
}