{
  "title": "Should Townsend continue or is it time for change?",
  "text": "In early autumn Gregor Townsend must have thought he had it sussed; an extended contract with Scotland, an international squad that he felt was in the best place it had been in his eight years in charge and a new sideline gig as a consultant with Red Bull. Life was good.\n\nThe way he was talking, the coach was clearly expecting a big November. So much for that. What we have now is a team being booed off after losing a 21-point lead against Argentina, a Scottish Rugby Union (SRU) that appears to be running away from questions about the state of things and a game coming up against Tonga that's utterly irrelevant.\n\nScotland will win and will probably win well, but it will prove nothing.\n\nThey had their chance against New Zealand and Argentina to show that they have improved and they blew it.\n\nThe only thing they succeeded in doing was rubber-stamping the image that a now rapidly growing number of people have of them as a talented but flaky outfit that's treading water, coached by a regime that's done some fine things but has been there too long.\n\nScotland are a good team, when their mood is right. Only good teams could race into a 21-0 lead against the excellent Pumas. Only good teams could score 17 unanswered points against the All Blacks while creating a ton of other chances.\n\nSo they do things that only good sides can do, but then they do a host of other things that good sides would never do, like losing a 21-0 lead for a start. Like panicking and giving away soft penalties and easy field position in the closing minutes against New Zealand.\n\nTheir split personality is always there, you just don't know what's coming first, the Jekyll or the Hyde.\n\nThey were blown away early on against the All Blacks and, in turn, they blew away the Pumas early on a week later. They rallied wonderfully against the Kiwis and then imploded. They rallied briefly, with a Finn Russell penalty to make it a 12-point game against Argentina, and then imploded again.\n\nIt's a wearying cycle of failure from a team that's still stymied by its own weak psychology.\n\nThe stat that did the rounds after Sunday, courtesy of the statinator Kevin Millar, focused on the last 25 minutes of Scotland's past five games against teams ranked in the world's top 12.\n\nScotland 3-33 Argentina; Scotland 3-7 New Zealand; Fiji 14-0 Scotland; France 12-0 Scotland; Scotland 0-21 Wales. They lost four of the five. Six points scored, 87 conceded. Two penalties for, 13 tries against.",
  "summary": "After frustrating defeats to New Zealand and Argentina, Tom English suggests it is time Scotland considered replacing long-serving head coach Gregor Townsend.",
  "published": "Thu, 20 Nov 2025 17:59:50 GMT",
  "url": "https://www.bbc.com/sport/rugby-union/articles/czxkx2yzq8jo?at_medium=RSS&at_campaign=rss",
  "source": "BBC Sport"
}