{
  "title": "Karoline Leavitt Defends Trump's 'Quiet, Piggy' Insult By Suggesting We Should Be... Grateful?",
  "text": "LOADING ERROR LOADING\n\nIn the aftermath of President Donald Trump calling a reporter “piggy,” White House press secretary Karoline Leavitt suggested to journalists Thursday that they should be grateful he looks them in the eye and insults them.\n\n“I think the president being frank and open and honest to your faces rather than hiding behind your backs is, frankly, a lot more respectful than what you saw in the last administration, where you had a president who lied to your faces and didn’t speak to you for weeks,” she said.\n\nAdvertisement\n\nLeavitt was responding to a reporter who asked during Thursday’s press briefing what Trump meant when he told Bloomberg reporter Catherine Lucey to be “quiet, piggy” onboard Air Force One. The incident took place Friday but wasn’t publicized until this week.\n\nPresident Donald Trump points as he speaks to reporters aboard Air Force One on Nov. 14 en route to Palm Beach, Florida. JIM WATSON via Getty Images\n\nTrump, Leavitt said, is simply a “very frank and honest” man. She referred to his frankness three more times in about a minute.\n\nAdvertisement\n\n“It’s one of the many reasons the American people reelected this president, because of his frankness,” she claimed.\n\nLeavitt also suggested reporters are to blame for riling up the president.\n\n“He calls out fake news when he sees it,” she said. “He gets frustrated with reporters when you lie about him, when you spread fake news about him and his administration.”\n\nTrump lobbed the “piggy” insult at Lucey after she asked him about the possibility that he could be incriminated in files his Justice Department has on the late child sex predator Jeffrey Epstein. The incident was captured on video, showing Trump wagging his finger at Lucey as she stands off-screen.\n\nAdvertisement\n\nAhead of Leavitt’s remarks, the White House issued a statement slamming Lucey.",
  "summary": "She also blamed reporters for \"frustrating\" the president.",
  "published": "Thu, 20 Nov 2025 16:27:10 -0500",
  "url": "https://www.huffpost.com/entry/karoline-leavitt-quiet-piggy-defense_n_691f6a37e4b04484952377bc",
  "source": "Politics"
}