{
  "title": "Spotify now includes a built-in tool for importing your playlists from other services",
  "text": "Spotify definitely wants you to only use Spotify for streaming music, but it’s willing to admit that you might have used another service in the past. Those people can now more easily import their playlists into the Spotify app, thanks to its latest integration with TuneMyMusic .\n\nAvailable through Spotify mobile users and rolling out globally from today, you can access the new feature through Your Library in the Spotify app. Scroll to the bottom and you’ll see an option to import your music by connecting to TuneMyMusic (it looks like it boots you into your browser at this stage) and choosing the service you want to transfer from. Apple Music already lets you do something similar directly from within your settings on an iPhone, iPad or Android device, or through the web.\n\nTuneMyMusic supports transfers into Spotify from a wide range of streaming platforms, including Apple Music, YouTube Music, Amazon Music and Tidal. You won’t lose your playlists in the source location. It’ll just copy them over so they appear in your Spotify library.\n\nIf you aren’t already aware, Spotify lets you customize playlists in a number of ways, from inviting friends to add their own songs, to designing the cover art yourself. So if you’ve been considering a jump from elsewhere, this new feature should make the transition a little easier.",
  "summary": "<p>Spotify definitely wants you to only use Spotify for streaming music, but it’s willing to admit that you might have used another service in the past. Those people can now more easily import their playlists into the Spotify app, thanks to its latest integration with <a href=\"https://www.tunemymusic.com/\"><ins>TuneMyMusic</ins></a>.</p>\n<p>Available through Spotify mobile users and rolling out globally from today, you can access the new feature through Your Library in the Spotify app. Scroll to the bottom and you’ll see an option to import your music by connecting to TuneMyMusic (it looks like it boots you into your browser at this stage) and choosing the service you want to transfer from. Apple Music already lets you do something <a class=\"rapid-with-clickid\" href=\"https://shopping.yahoo.com/rdlw?siteId=us-engadget&amp;pageId=1p-autolink&amp;contentUuid=0efbe043-2e3e-4ed4-a3b3-79ac660062a3&amp;featureId=text-link&amp;linkText=similar&amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsImxhbmRpbmdVcmwiOiJodHRwczovL3N1cHBvcnQuYXBwbGUuY29tL2VuLWdiLzExODI0OSIsImNvbnRlbnRVdWlkIjoiMGVmYmUwNDMtMmUzZS00ZWQ0LWEzYjMtNzlhYzY2MDA2MmEzIiwib3JpZ2luYWxVcmwiOiJodHRwczovL3N1cHBvcnQuYXBwbGUuY29tL2VuLWdiLzExODI0OSJ9&amp;signature=AQAAAd6Z19LKsqDfxrtHiaNBqVK1lo6tltFTXaieUJA_9kji&amp;gcReferrer=https%3A%2F%2Fsupport.apple.com%2Fen-gb%2F118249\"><ins>similar</ins></a> directly from within your settings on an iPhone, iPad or Android device, or through the web.</p>\n<span id=\"end-legacy-contents\"></span><p>TuneMyMusic supports transfers into Spotify from a wide range of streaming platforms, including Apple Music, YouTube Music, Amazon Music and Tidal. You won’t lose your playlists in the source location. It’ll just copy them over so they appear in your Spotify library.</p>\n<p>If you aren’t already aware, Spotify lets you customize playlists in a number of ways, from inviting friends to add their own songs, to designing the cover art yourself. So if you’ve been considering a jump from elsewhere, this new feature should make the transition a little easier.</p>This article originally appeared on Engadget at https://www.engadget.com/apps/spotify-now-includes-a-built-in-tool-for-importing-your-playlists-from-other-services-175100343.html?src=rss",
  "published": "Thu, 20 Nov 2025 17:51:00 +0000",
  "url": "https://www.engadget.com/apps/spotify-now-includes-a-built-in-tool-for-importing-your-playlists-from-other-services-175100343.html?src=rss",
  "source": "Engadget is a web magazine with obsessive daily coverage of everything new in gadgets and consumer electronics"
}