{
  "title": "In 1982, a physics joke gone wrong sparked the invention of the emoticon",
  "text": "On September 19, 1982, Carnegie Mellon University computer science research assistant professor Scott Fahlman posted a message to the university’s bulletin board software that would later come to shape how people communicate online. His proposal: use :-) and :-( as markers to distinguish jokes from serious comments. While Fahlman describes himself as “the inventor… or at least one of the inventors” of what would later be called the smiley face emoticon, the full story reveals something more interesting than a lone genius moment.\n\nThe whole episode started three days earlier when computer scientist Neil Swartz posed a physics problem to colleagues on Carnegie Mellon’s “bboard,” which was an early online message board. The discussion thread had been exploring what happens to objects in a free-falling elevator, and Swartz presented a specific scenario involving a lit candle and a drop of mercury.\n\nThat evening, computer scientist Howard Gayle responded with a facetious message titled “WARNING!” He claimed that an elevator had been “contaminated with mercury” and suffered “some slight fire damage” due to a physics experiment. Despite clarifying posts noting the warning was a joke, some people took it seriously.\n\nCredit: Jason Scott A DECSYSTEM-20 KL-10 (1974) seen at the Living Computer Museum in Seattle. Scott Fahlman used a similar system with a terminal to propose his smiley concept.\n\nThe incident sparked immediate discussion about how to prevent such misunderstandings and the “flame wars” (heated arguments) that could result from misread intent.\n\n“This problem caused some of us to suggest (only half seriously) that maybe it would be a good idea to explicitly mark posts that were not to be taken seriously,” Fahlman later wrote in a retrospective post published on his CMU website. “After all, when using text-based online communication, we lack the body language or tone-of-voice cues that convey this information when we talk in person or on the phone.”",
  "summary": "A simple proposal on a 1982 electronic bulletin board helped sarcasm flourish online.",
  "published": "Thu, 20 Nov 2025 12:00:22 +0000",
  "url": "https://arstechnica.com/gadgets/2025/11/in-1982-a-physics-joke-gone-wrong-sparked-the-invention-of-the-emoticon/",
  "source": "Ars Technica - All content"
}