{
  "title": "Satellite images reveal the fastest Antarctic glacier retreat ever",
  "text": "A glacier on the Eastern Antarctic Peninsula has undergone the quickest ice loss documented in modern times, according to a major international study co-authored by Swansea University.\n\nPublished in Nature Geoscience, the research reports that Hektoria Glacier shortened by nearly half its length in only two months during 2023. The glacier shed eight kilometers of ice in that short period, a pace comparable to the rapid withdrawals that marked the end of the last ice age.\n\nLed by the University of Colorado Boulder (CU Boulder), the global research team, which included Swansea glaciologist Professor Adrian Luckman, determined that the underlying landscape played a major role in accelerating the glacier's retreat.\n\nIce Plain Structure Fueled Rapid Breakup\n\nHektoria Glacier had been positioned on an ice plain, a level expanse of bedrock located below sea level. Once retreat began, this setting allowed large portions of ice to detach quickly and in sequence.\n\nThe remarkable speed and scale of the glacier's collapse may now guide researchers as they work to identify other glaciers with similar vulnerabilities and determine which ones require the closest observation.\n\nAlthough Hektoria Glacier is modest in size by Antarctic standards, covering about 115 square miles (slightly smaller than the city of Austin, Texas), its abrupt retreat serves as a serious warning. Comparable events occurring on larger glaciers could significantly influence the rate of global sea level rise.\n\nUnprecedented Retreat in Observational Records\n\nProfessor Adrian Luckman, a co-author of the study, stated: \"Glaciers don't usually retreat this fast. The circumstances may be a little particular, but this scale of ice loss shows what may happen elsewhere in Antarctica, where glaciers are lightly grounded and sea ice loses its grip.\n\n\"Although the paleo record indicates some very rapid retreats in the past, the pace of retreat of Hektoria Glacier and its neighbors is unprecedented in the observational record.\n\n\"This is the latest chapter in a sequence of events which started with the collapse of the Larsen B Ice Shelf 23 years ago, marking a landscape-changing event that offers insights into the potential future rates of glacier retreat elsewhere in Antarctica.\"\n\nSatellite and Seismic Evidence of Grounded Ice Loss\n\nThe research team used satellite data and seismic measurements to examine the glacier's breakdown in detail. Their analysis revealed several grounding lines, the points where a glacier transitions from resting on solid rock to floating on seawater. These features confirmed the presence of the ice plain and highlighted how easily the glacier could retreat when exposed to ocean-driven forces.\n\nSeismic devices also detected glacier earthquakes, small tremors caused by abrupt ice shifts. These signals showed that the ice was still grounded at the time of retreat, meaning the loss directly contributed to global sea level rise.\n\nFaster Sea Level Rise Possible if Conditions Repeat\n\nDr. Ted Scambos, a Senior Research Scientist at CU Boulder's Earth Science and Observation Center, noted: \"This kind of lightning-fast retreat really changes what's possible for other, larger glaciers on the continent. If the same conditions are set up in some of the other areas, it could greatly speed up sea level rise from the continent.\"\n\nThe authors emphasize the importance of ongoing monitoring efforts and international scientific cooperation to better track and understand changes unfolding across Earth's frozen regions.",
  "summary": "Hektoria Glacier’s sudden eight-kilometer collapse stunned scientists, marking the fastest modern ice retreat ever recorded in Antarctica. Its flat, below-sea-level ice plain allowed huge slabs of ice to detach rapidly once retreat began. Seismic activity confirmed this wasn’t just floating ice but grounded mass contributing to sea level rise. The event raises alarms that other fragile glaciers may be poised for similar, faster-than-expected collapses.",
  "published": "Fri, 14 Nov 2025 03:09:57 EST",
  "url": "https://www.sciencedaily.com/releases/2025/11/251113071611.htm",
  "source": "All Top News -- ScienceDaily"
}