{
  "title": "‘Democratic forces must unite’: Tripura Oppn leader Jitendra Chaudhury slams attacks on CPI(M) offices after Bihar poll results",
  "text": "Amid reports of attacks on the offices of the Communist Party of India (Marxist) in Tripura soon after the announcement of the Bihar poll results, CPI(M) Politburo member and Leader of Opposition in the state, Jitendra Chaudhury, said democratic forces must unite against such violence.\n\n“Soon after the Bihar poll results, BJP-backed miscreants started attacking the Opposition, especially the CPI(M). One of their party members even publicly said that if the CPI(M) organised any programme, its members will be attacked and taught a lesson,” Chaudhury told reporters in Agartala on Sunday.\n\nCondemning the attack on the CPI(M) offices, the Sabroom MLA said, “The victory in Bihar may be celebrated, but looting other party offices, setting fire on them here… What kind of deformed mentality is this? In the future, the prime task for all democratic forces will be to confront this jointly,” he said.\n\nChaudhury alleged that before the polls, the BJP was doubtful about its victory, not only in Bihar but throughout the country. He said that as per the information from the Election Commission, 7.42 crore people were enrolled for voting in Bihar, but the number of votes polled was 7.45 crore.\n\nMeanwhile, CPI(M) leader Amal Chakraborty filed a complaint with a local police station in Agartala on Sunday against a BJP mandal leader from the Barjala area who is purportedly seen in a viral video threatening CPI(M) leaders and supporters with dire consequences unless they stopped all political activities.\n\nReacting to the allegations, Chief Minister and BJP leader Dr Manik Saha said Monday that neither he nor his party endorses violence. “I have asked (the police) to provide me a detailed report of what happened, and what was said (in the purported threat) and why,” he added.\n\nSaha, who is also in charge of the Home portfolio, however, blamed the former Left Front and Congress governments in Tripura for creating an atmosphere of political violence in the state.\n\nStory continues below this ad\n\nAfter the BJP-led National Democratic Alliance (NDA) won the Assembly polls in Bihar – the results of which were announced on Friday – Tripura Chief Minister Dr Manik Saha said West Bengal would be the next state to see an expected political change. The BJP, which has been trying to win the state for some years now, has amped up its activities in Bengal.",
  "summary": "",
  "published": "Mon, 17 Nov 2025 08:23:07 +0000",
  "url": "https://indianexpress.com/article/india/democratic-forces-must-unite-tripura-10370357/",
  "source": "India | The Indian Express"
}