{
  "title": "India confirms deadly Delhi car blast being treated as terror incident",
  "text": "India has confirmed it is treating the explosion that killed 12 people outside Delhi’s Red Fort on Monday as a “terror incident” perpetrated by “anti-national forces”.\n\nThe statement by the cabinet, led by the prime minister, Narendra Modi, confirmed mounting speculation that a terrorist attack was behind the blast that took place during peak time in one of the capital’s busiest areas and outside one of India’s major landmarks.\n\nThe explosion, from a car in bumper-to-bumper traffic, threw bodies into the air and caused nearby vehicles to catch fire. By Wednesday the number of dead had risen to 12 after several people died from their injuries, while more than 30 others were wounded. It was the deadliest terrorist attack in Delhi for more than a decade.\n\nThe cabinet statement on Wednesday night condemned what it called a “dastardly and cowardly act that has led to the loss of innocent lives”.\n\nThe national investigation agency, India’s anti-terrorism squad, was handling the investigation and police filed a case under the country’s anti-terror law. Declaring the case a terrorism incident gives investigators expansive powers to carry out raids and arrests.\n\nThe cabinet statement did not give any further details on the nature of the terrorism behind the attack. However, earlier in the day police confirmed they had detained five people in the Pulwama district of the disputed region of Kashmir in connection with the attack.\n\nThough the link was not directly made by police, it came after they claimed to have uncovered an “interstate and transnational terror” cell allegedly connected to the Islamist group Jaish-e-Mohammad (JeM) operating in a state neighbouring Delhi.\n\nThe Pakistan-based insurgent group is primarily active in India-administered Kashmir, a region that has been disputed between India and Pakistan since their formation in 1947.\n\nPolice said they uncovered 2,900kg of explosives materials as well as chemicals, detonators and guns in raids early on Monday morning. At least seven people, including two Kashmiri doctors, were arrested as part of the terror cell raids.\n\nSeveral sources briefing India media said investigators were seeking to determine whether the driver of the car that caused the Delhi explosion was part of the same terror cell, and whether Monday night’s attack was a panicked response to the arrests and raids.\n\nThe Red Fort explosion is the first terror incident in India since an attack in April when gunmen singled out more than 20 Hindu tourists and shot them dead. India blamed Pakistan for masterminding the attack and in May retaliated with cross-border missiles that it said targeted camps and JeM hideouts.\n\nPakistan denied any involvement in the April attack. It hit back with missile and drone strikes, bringing the two nuclear-armed countries the closest they had been to war in decades, before a US-led ceasefire stopped hostilities. In the aftermath, India repeatedly vowed that any further act of terror on Indian soil would be seen as an act of war.\n\nWith relations already at historic lows, India’s confirmation of the Red Fort blast as a terrorism incident risks pushing the two countries back towards full hostilities that could further destabilise the region. After the Red Fort blast, the Modi cabinet reiterated that it would take a policy of “zero tolerance towards terrorism in all its forms”.\n\nThe day after the explosion, a suicide bomber targeted a court complex in Pakistan’s capital, Islamabad, killing 12 people. The Pakistan Taliban claimed responsibility for the attack but the country’s prime minister, Shehbaz Sharif, claimed “Indian state terrorism” was behind the blast.\n\nOn Tuesday, India’s home minister, Amit Shah, said he had instructed senior officials to “hunt down each and every culprit behind this incident”. “Everyone involved in this act will face the full wrath of our agencies,” he said.",
  "summary": "<p>Cabinet says explosion near Red Fort that killed 12 is suspected to have been perpetrated by ‘anti-national forces’</p><p>India has confirmed it is treating the explosion that killed 12 people outside Delhi’s Red Fort on Monday as a “terror incident” perpetrated by “anti-national forces”.</p><p>The statement by the cabinet, led by the prime minister, Narendra Modi, confirmed mounting speculation that a terrorist attack was behind the blast that took place during peak time in one of the capital’s busiest areas and outside one of India’s major landmarks.</p> <a href=\"https://www.theguardian.com/world/2025/nov/12/india-confirms-deadly-delhi-car-blast-being-treated-as-terror-incident-red-fort\">Continue reading...</a>",
  "published": "Wed, 12 Nov 2025 17:46:13 GMT",
  "url": "https://www.theguardian.com/world/2025/nov/12/india-confirms-deadly-delhi-car-blast-being-treated-as-terror-incident-red-fort",
  "source": "World news | The Guardian"
}