{
  "title": "A tiny ancient virus reveals secrets that could help fight superbugs",
  "text": "A research effort led by Ōtākou Whakaihu Waka has generated an in-depth structural map of a bacteriophage, offering new insight into how these viruses could be used to counter drug-resistant bacteria.\n\nLead author Dr. James Hodgkinson-Bean, who completed his PhD in the Department of Microbiology and Immunology, says bacteriophages are \"extremely exciting\" to scientists searching for alternatives to antibiotics as antimicrobial resistance continues to rise.\n\n\"Bacteriophage viruses are non-harmful to all multi-cellular life and able to very selectively target and kill a target bacterium. Due to this, they are increasingly being researched and applied in 'phage therapy' to treat highly drug-resistant bacteria,\" he says.\n\nHe explains that bacteriophages are \"exquisitely intricate viruses\" that infect bacteria using large mechanical structures known as 'tails'.\n\n3D Analysis Reveals How a Phage Attacks E. coli\n\nThe study, published in Science Advances, involved researchers from Otago and the Okinawa Institute of Science and Technology. They examined the structure of Bas63, a virus that infects E. coli, at a molecular scale to better understand how its tail functions during infection.\n\n\"This kind of research is important for understanding how we can select the optimal bacteriophages for therapies, and to understand the differences in infectious behavior we see in the lab,\" Dr. Hodgkinson-Bean says.\n\nSenior author Associate Professor Mihnea Bostina, also from Otago's Department of Microbiology and Immunology, notes that rising antibiotic resistance and growing threats to global food security from plant pathogens make bacteriophages an increasingly valuable alternative.\n\n\"Our detailed blueprint of a bacteriophage advances rational design for medical, agricultural, and industrial applications, from treating infections to combating biofilms in food processing and water systems.\n\n\"Beyond science, the 3D data -- which shows the virus' rare whisker-collar connections, hexamer decoration proteins, and diverse tail fibers -- may inspire artists, animators, and educators.\"\n\nStructural Clues Strengthen Understanding of Viral Evolution\n\nAccording to Dr. Hodgkinson-Bean, insights into viral structure also help clarify how these viruses have evolved.\n\n\"While DNA generally serves as the best evolutionary marker in humans, the 3-dimensional structure of a virus is more informative of its distant evolutionary relationships with other viruses,\" he says.\n\nThe team identified features that had previously only been seen in viruses that are very distantly related, revealing evolutionary connections that had not been documented before.\n\n\"We know through structural studies that bacteriophages are related to Herpes viruses -- this relationship is thought to extend back billions of years to before the emergence of multi-cellular life. For this reason, when we look at bacteriophage structure, we are looking at living fossils, primordial ancient beings.\n\n\"There is something truly beautiful about that.\"\n\nBuilding on Earlier Discoveries\n\nThis newly described structure is the second of its kind documented by the same research group. It follows an earlier investigation into pathogens responsible for potato diseases, which was recently published in Nature Communications.",
  "summary": "Scientists mapped the Bas63 bacteriophage in unprecedented detail, uncovering how its tail machinery infects bacteria. The structure reveals rare whisker-collar features and distant evolutionary ties reaching back billions of years. These insights could guide new phage therapies and innovations in medicine, agriculture, and industry.",
  "published": "Mon, 17 Nov 2025 10:32:09 EST",
  "url": "https://www.sciencedaily.com/releases/2025/11/251117095635.htm",
  "source": "All Top News -- ScienceDaily"
}