{
  "title": "‘Her fearless leadership shaped a self-reliant nation’: Congress pays tributes to former PM Indira Gandhi on 108th birth anniversary",
  "text": "The Congress party on Wednesday paid floral tributes to former Prime Minister late Indira Gandhi at Shakti Sthal, her memorial site in New Delhi on the occasion of her 108th birth anniversary.\n\nParty president Mallikarjun Kharge, Leader of Opposition in the Lok Sabha Rahul Gandhi, and Congress Parliamentary Party (CPP) Chairperson Sonia Gandhi, visited the site to offer their respects.\n\nCongress president Mallikarjun Kharge, party leaders Sonia Gandhi and Rahul Gandhi paid floral tributes to Indira Gandhi at her memorial, Shakti Sthal in New Delhi. (Express Photo by Anil Sharma) Congress president Mallikarjun Kharge, party leaders Sonia Gandhi and Rahul Gandhi paid floral tributes to Indira Gandhi at her memorial, Shakti Sthal in New Delhi. (Express Photo by Anil Sharma)\n\nOver a post on X, the party wrote: “On her birth anniversary, we honour Indira ji’s fearless leadership, decisive vision and unwavering commitment to India’s progress. From the Green Revolution to the liberation of Bangladesh, her bold leadership shaped a strong, self-reliant nation that bowed to no superpower.”\n\nOn her birth anniversary, we honour Indira ji’s fearless leadership, decisive vision and unwavering commitment to India’s progress. From the Green Revolution to the liberation of Bangladesh, her bold leadership shaped a strong, self-reliant nation that bowed to no superpower. pic.twitter.com/b7J6a0wW50 — Congress (@INCIndia) November 19, 2025\n\nBorn on November 19, 1917, Indira Gandhi served as the prime minister of the country from January 1966 to March 1977, and again from January 1980 until her assassination on October 31, 1984.\n\nPrime Minister Narendra Modi too paid his tributes to the country’s first female PM on the occasion.\n\n“Tributes to former PM Smt. Indira Gandhi Ji on the occasion of her birth anniversary,” Modi wrote over a post on X.\n\nPeople across several parts of the country offered their tributes to the ‘Iron Lady of India,’ by visiting her memorial site, as well as planning events throughout the day.\n\nTributes to former PM Smt. Indira Gandhi Ji on the occasion of her birth anniversary. — Narendra Modi (@narendramodi) November 19, 2025\n\nAccording to a video shared by news agency PTI, people gathered at the Shakti Sthal, the memorial site of the former PM and paid their tributes.\n\nIn Uttar Pradesh’s Prayagraj, the 40th Indira Marathon was flagged off early Wednesday to commemorate the occasion.",
  "summary": "",
  "published": "Wed, 19 Nov 2025 04:43:56 +0000",
  "url": "https://indianexpress.com/article/india/pm-modi-congress-tributes-former-pm-indira-gandhi-108th-birth-anniversary-10373632/",
  "source": "India | The Indian Express"
}