{
  "title": "MEA reacts to Sheikh Hasina’s death sentence: ‘India remains committed to the best interests of people of Bangladesh’",
  "text": "After Bangladesh’s International Crimes Tribunal (ICT-BD) awarded the death sentence to the country’s former Prime Minister Sheikh Hasina, New Delhi said India remains committed to the best interests of the people of Bangladesh, adding that it will “always engage constructively with all stakeholders.” Since her ouster in August 2024, Hasina has been living in exile in the Indian capital.\n\n“India has noted the verdict announced by the ‘International Crimes Tribunal of Bangladesh’ concerning former Prime Minister Sheikh Hasina,” the Ministry of External Affairs said in its statement.\n\n“As a close neighbour, India remains committed to the best interests of the people of Bangladesh, including in peace, democracy, inclusion and stability in that country. We will always engage constructively with all stakeholders to that end,” it added.\n\nThe ICT-BD awarded the death sentence to the Bangladesh’s former Prime Minister Sheikh Hasina and ex-interior minister Asaduzzaman Khan on Monday after it found them guilty of crimes against humanity. Their conviction came alongside that of former police chief Chowdhury Abdullah Al-Mamun.\n\nThe verdict ends a months-long trial stemming from an order she allegedly issued for a crackdown on a student-led uprising last year which claimed up to 1,400 lives, as per United Nations estimates.\n\nAlso Read | Sheikh Hasina sentenced to death: what happens now\n\nFollowing the move, the interim government in Bangladesh, led by Chief Adviser Muhammad Yunus, called it a “historic verdict,” and asked the Indian Government to hand over Hasina and Khan, news agency Reuters reported. India has not formally responded to Dhaka’s previous demands.\n\nReacting to the verdict, Hasina alleged that the trial was politically motivated. “Verdicts announced against me were made by a rigged tribunal established and presided over by an unelected government with no democratic mandate…I was given no fair chance to defend myself in court,” news agency Reuters reported her as saying. “I am not afraid to face my accusers in a proper tribunal where evidence can be weighed, tested fairly,” she added.\n\nStory continues below this ad\n\nThe 2024 uprising in Bangladesh was rooted in public resentment towards the quota system. Since its war of independence from Pakistan in 1971, the country had always reserved 30 per cent of all civil service roles for veterans and their descendants.\n\nHasina’s government had scrapped the quota system in 2018, but a lower court reinstated it in 2024, sparking protests, following which the government imposed a curfew.\n\nThe Supreme Court’s Appellate Division directed that 93% of government jobs be open to candidates on merit, as protests turned deadly. However, the uprising spiraled in into a revolution leading to her ouster on August 5.",
  "summary": "",
  "published": "Mon, 17 Nov 2025 12:26:00 +0000",
  "url": "https://indianexpress.com/article/india/sheikh-hasina-death-sentence-india-best-interests-bangladesh-10370862/",
  "source": "India | The Indian Express"
}