{
  "title": "£1bn growth plan for Greater Manchester unveiled",
  "text": "£1bn growth plan for Greater Manchester unveiled\n\n14 hours ago Share Save Kevin Fitzpatrick Greater Manchester political reporter Share Save\n\nBBC Stockport town centre is among the areas which have seen a cash injection in recent years\n\nGreater Manchester's leaders have announced a £1bn plan for 30 new projects aimed at boosting the city region's economy. There will be three projects in each of the area's 10 boroughs, with the first wave of schemes expected to deliver nearly 3,000 new homes, 22,000 jobs and two million square feet of employment space. Mayor Andy Burnham said the initial investment would unlock a further £1.3bn in private capital. The region wanted to \"pioneer a new model for economic growth\" over the next decade, he added.\n\nThe city region has become the fastest growing part of the UK economy with annual growth of 3.1% - more than double the rate of the country as a whole. It has, however, been focused mainly in Manchester and the aim of the GM Good Growth Fund is to ensure the benefits are felt across the whole conurbation. It is made up from various funding pots of government cash as well as £300m from the Greater Manchester Pension Fund. Some funding investments will be loans that will be reinvested in other projects once repaid.\n\nTown centre regeneration\n\nBurnham said: \"Greater Manchester is the UK's economic success story of the past decade. \"Powered by devolution, our journey of growth has transformed our city region and is opening up opportunities that people could not have imagined 30 years ago. \"Good growth is the defining challenge of our age – and today we are setting out a serious, practical plan to achieve it.\" The first wave of £400m in funding will be invested in house building schemes such as Oldham's Prince's Gate development and Wigan's Cotton Works. It will also be used for town centre regeneration projects in Ashton-under-Lyne in Tameside and Prestwich in Bury, while support would be given for Mayoral Development Zones in Stockport, Bolton, Leigh and Middleton.\n\nBilal Sadiq welcomed the investment in Prestwich\n\nBilal Sadiq, 31, lives in Oldham but works in Prestwich in Bury and said he welcomed news that £6.8m would go towards creating new shops and a community hub there. \"I think it would be good for the area. You go to Manchester now and see all these skyscrapers being built and you think 'what are they doing for our local area?', he said. Mr Sadiq said he would also like to see Rochdale and Oldham being economically boosted. The fund will mark the start of a new strategic partnership between the Greater Manchester Combined Authority and the region's Pension Fund to prioritise local investment, thought to be the first of its kind in the UK.\n\nMayor Andy Burnham spoke to BBC Radio Manchester about the £1bn growth plan\n\nListen to the best of BBC Radio Manchester on Sounds and follow BBC Manchester on Facebook, X, and Instagram. You can also send story ideas via Whatsapp to 0808 100 2230.",
  "summary": "Andy Burnham says the city region wants to \"pioneer a new model for economic growth\" in the next decade.",
  "published": "Thu, 20 Nov 2025 16:54:34 GMT",
  "url": "https://www.bbc.com/news/articles/cwyn8y6q957o?at_medium=RSS&at_campaign=rss",
  "source": "BBC News"
}