{
  "title": "Russian Missile Kills at Least 25 in Ukrainian Apartment Building",
  "text": "Russia launched a deadly barrage of missiles and drones against Ukraine, as President Volodymyr Zelensky sought to revive long-stalled peace talks on Wednesday with negotiations in Turkey.\n\nAt least 25 people were killed and some 73 wounded in Ternopil, in western Ukraine, when a Russian missile hit an apartment building, according to Ukraine’s emergency service. The top three floors of the building were hit, the first time that a Russian missile had struck a residential complex in the city. Emergency workers searched for people who might be trapped in the rubble, as priests prayed over the bodies of victims.\n\n“This fragile sense of safety has been destroyed and there’s no longer any feeling that Ternopil is even a little bit safe,” Tetyana Dolishna, a 55-year-old resident, wrote on Facebook.\n\nMr. Zelensky said on social media that Russia had launched 470 attack drones and 48 missiles in the overnight attack, hitting energy, transport and civilian infrastructure across Ukraine.\n\nThe deadly strikes came while Mr. Zelensky was in Turkey to meet with President Recep Tayyip Erdogan, trying to reinvigorate efforts to end the war with what he said were new Ukrainian proposals. Ukrainian and Russian officials have not held direct talks since the summer, and negotiations have been stuck since the meeting between Mr. Trump and President Vladimir V. Putin of Russia in August in Alaska. Russian officials will not join the talks in Turkey.\n\nMr. Zelensky’s efforts to revive negotiations came as Mr. Trump’s special envoy, Steve Witkoff, and Russian officials have prepared a proposal, without consulting Ukraine, for ending the war, according to a senior Ukrainian official.\n\nIt was not clear if Ukrainian officials would discuss this proposal in Turkey or whether it could come up in separate talks in Kyiv this week with a visiting delegation of senior Pentagon officials led by Army Secretary Daniel Driscoll.\n\nThe Trump administration has informed Ukraine of the plan it drafted with Russia and several of the points in it, but has not sought Kyiv’s input, according to the senior Ukrainian official. The administration’s talks with Russia were first reported by Axios.\n\nMr. Zelensky is seeking to restart the diplomatic push as he faces a sweeping corruption scandal that threatens his ability to push war-related matters through Parliament. In Kyiv, Russia’s renewed push for a settlement on its terms is seen as an attempt to exert pressure on Ukraine’s government as it reels from the scandal, the Ukrainian official said.",
  "summary": "The attack was part of a wave of strikes across the country as President Volodymyr Zelensky seeks to revive stalled peace talks.",
  "published": "Wed, 19 Nov 2025 19:41:35 +0000",
  "url": "https://www.nytimes.com/2025/11/19/world/europe/ukraine-russia-strikes-peace-talks.html",
  "source": "NYT > World News"
}