{
  "title": "‘My husband collects pictures of old men’s faces to give me’: Keira Knightley on art, ghosts and West Ham’s midfield",
  "text": "Have you read or listened to the delightful chapter in Alan Partridge’s Big Beacon where he demands: “We came for Knightley, we want to see Knightley, where’s Knightley?” dcieron\n\nNo! Do I want to see it? Or is it something that will make me cringe and want to hide under the sofa? I do like Alan Partridge. He’s kind of terrifying but amazing, so now that I know I’ve been a part of Alan Partridge, I should check it out.\n\nWhen you first wore the green dress in Atonement, did you realise how iconic it would be? Murdomania\n\nI thought it was a bloody good dress. It never actually lasted. It was so fragile that, any time you touched the front, it would completely break, so they had to make a load of different fronts. By the end, I was thoroughly sick with having the dress remade on me. But it’s a beautiful dress and I had no idea that it would have the life that it did.\n\nI’m a huge fan of British cinema, particularly British kitchen sink dramas from the swinging 60s. If you could have been part of a different era of film-making, which would it be? Kal_85\n\nI’m going to go for the 30s or 40s, because I love the fast machinegun dialogue; the intelligent, witty, larger-than-life characters, thinking fast. I’m thinking His Girl Friday vibes, Bette Davis, or The Philadelphia Story with Katharine Hepburn whacking lines back like it’s a tennis match.\n\nView image in fullscreen Swordplay … Keira Knightley with Kevin McNally in Pirates of the Caribbean: At World’s End, 2007. Photograph: Cinematic/Alamy\n\nWhat is one habit or skill from one of the characters you’ve played that you have adopted in your daily life? Aeternia\n\nI’m pretty good at sword-fighting from doing three years on Pirates. I played Robin Hood’s daughter [in the 2001 TV movie Princess of Thieves] when I was 15, then I did King Arthur when I was 18 where I had to do a knights’ boot camp with a lot of archery. This summer, we bought the kids one of those sucky archery sets for the garden. I got a bullseye, so I was very cool for about five seconds to a bunch of 10-year-olds. I wish the football had stayed. My 10-year-old plays a lot of football. She’s just watched Bend It Like Beckham and was like, ‘What happened to you?’ It’s a good question.\n\nDo you believe in the paranormal? LauraLiza\n\nNo. But I did see a ghost in the Chateau Marmont, the big hotel in LA where John Belushi died. I feel like everyone’s seen a ghost in the Chateau Marmont. It was the middle of the day – I hadn’t been out the night before, so I wasn’t, you know, in any kind of state. He had a burgundy shirt, black hair. I thought it was a man sitting in my room. I said: “I’m really sorry, this is my room.” When he turned, he disappeared. My brother and my mum were in the other room, and my mum came in and said: “Who were you talking to?” I don’t actually believe in ghosts, but I have seen that one.\n\nView image in fullscreen Tragic figure … Keira Knightley with Aaron Taylor-Johnson in Anna Karenina, 2012. Photograph: Universal Pictures/Allstar\n\nNever Let Me Go is one of the saddest films I have ever seen. After seeing it I went into a depression for about a week. Did it have the same effect on you? Inversight_26\n\nNo. Sorry. That’s awful. I remember my reaction from the book because it’s so shocking, like a slow-motion horror movie. I’m sorry this person was depressed by it. Yes, it was sad. It should provoke a reaction, so I guess that’s good. I’m not a method actor. I don’t mean for characters to rub off on me, even if you are conjuring up an emotion. Anna Karenina was the big one because she’s such a tragic figure and she feels so trapped. I remember at the end of it, my then boyfriend, now husband, was like: “I don’t want to live with Anna Karenina any more.” She wasn’t fun.\n\nCan you see yourself still rocking it in 40 years’ time, like Helen Mirren and Meryl Streep? VirgilHilts\n\nMaybe. Obviously, Helen and Meryl are amazing. But I quite like the idea of retirement: sitting in the garden and being quiet.\n\nDo you think West Ham have at last resolved their midfield crisis, and where on the table do you see us finishing this season? TAHarvey\n\n[Answering before Graham Potter was sacked.] Based on our recent signings: a new central midfielder, a new left-back, a new centre-back … a centre-forward – Callum Wilson – that was the free loan. We’ve got our top players: [Lucas] Paquetá, [Aaron] Wan-Bissaka … [Crysencio] Summerville is fit again. I’m going to be quietly confident and say we are going to finish 12th. Graham Potter knows what he’s doing.\n\nWhat is your go-to sanity saver? Shires\n\nA hundred per cent drawing, while I listen to things. I suppose the sanity saver is not listening to my lines, and going for a podcast or a book. I’ll be listening to Alan Partridge next, for sure!\n\nView image in fullscreen Ball game … Keira Knightley as Juliette ‘Jules’ Paxton in Bend It Like Beckham, 2002. Photograph: Bskyb/Allstar\n\nNot a question, just a very respectful acknowledgment that writing and illustrating a children’s book is very impressive. I look forward to seeing it and hope it does well! RuthlessCosmopolitan\n\nThat is incredibly sweet. I hope you like it, whoever you are, because you might just look at it and go: “Oh, bloody hell.” I’ve always loved drawing. I draw when I learn my lines. They’re normally old men’s faces with very detailed lines. For some reason – I think it’s because I’m dyslexic – so I have to get the words off the page as quickly as possible. I record the whole script, then listen to it while doing these quite intricate drawings to get the lines into my head. I get into a really meditative state, which I love. My scripts are full of pictures of old men’s faces. Now that my husband and friends know I do it, they collect pictures of old men’s faces to give me. But I don’t think I’d like to go on Sky’s Portrait Artist of the Year, because then I couldn’t learn my lines. If I’ve got some dude sitting in the room, that wouldn’t work at all.",
  "summary": "<p>As she launches her first children’s book, the actor answers your questions on Alan Partridge, her iconic green dress and thrilling 10-year-olds with a bullseye </p><p><strong>Have you read or listened to the delightful chapter in Alan Partridge’s Big Beacon where he demands: “We came for Knightley, we want to see Knightley, where’s Knightley?” </strong><em><a href=\"https://profile.theguardian.com/user/id/110299950\">dcieron</a><br /></em>No! Do I want to see it? Or is it something that will make me cringe and want to hide under the sofa? I do like Alan Partridge. He’s kind of terrifying but amazing, so now that I know I’ve been a part of Alan Partridge, I should check it out.</p><p><strong>When you first wore <a href=\"https://www.theguardian.com/film/filmblog/2008/feb/05/atonementsgreendressdeserve\">the green dress</a> in Atonement, did you realise how iconic it would be? </strong><em><a href=\"https://profile.theguardian.com/user/id/1600699\">Murdomania</a><br /></em>I thought it was a bloody good dress. It never actually lasted. It was so fragile that, any time you touched the front, it would completely break, so they had to make a load of different fronts. By the end, I was thoroughly sick with having the dress remade on me. But it’s a beautiful dress and I had no idea that it would have the life that it did.</p> <a href=\"https://www.theguardian.com/film/2025/nov/20/keira-knightley-interview-art-ghosts-west-ham-prospects\">Continue reading...</a>",
  "published": "Thu, 20 Nov 2025 12:13:45 GMT",
  "url": "https://www.theguardian.com/film/2025/nov/20/keira-knightley-interview-art-ghosts-west-ham-prospects",
  "source": "The Guardian"
}