{
  "title": "Geological time capsule highlights Great Barrier Reef's resilience",
  "text": "New research led by the University of Sydney adds to our understanding of how rapidly rising sea levels due to climate change foreshadow the end of the Great Barrier Reef as we know it.\n\nThe findings suggest the reef can withstand rising sea levels in isolation but is vulnerable to associated environmental stressors arising from global climate change.\n\nLed by Professor Jody Webster from the School of Geosciences, the research was published today in Nature Communications. It draws from a geological time capsule of fossil reef cores, extracted from the seabed under the Great Barrier Reef.\n\nThe findings suggest rapid sea level rise in isolation did not spell the end of the reef's predecessor, Reef 4. Rather, associated environmental stressors like poor water quality and warming climates led, in combination, to its demise about 10,000 years ago (towards the end of the last ice age).\n\nThe ensuing one to two thousand years saw Reef 4 transition. Its shallow reef ecosystem moved landward to reestablish itself as the Great Barrier Reef we know today.\n\n\"This research shows us a healthy, active barrier reef can grow well in response to quite fast sea level rises,\" said Professor Webster. \"It's the combination of additional environmental stressors, on top of rapid sea level rise, that lead to its demise.\n\nThe findings lend weight to already grave concerns about the Great Barrier Reef.\n\n\"The modern reef faces rising sea levels, more heat waves and extensive bleaching, along with increasing sediment and nutrient input. This combination, on top of rising sea levels, is of deep concern. If the current trajectory continues, we should be concerned about whether the Great Barrier Reef will survive the next 50 to 100 years in its current state.\n\n\"It won't die but its characteristics may change. We will see a different collection of coral species, perhaps simpler and not as structurally complex.\"\n\nLearning from the 'proto-Great Barrier Reef'\n\nThe 15 to 20-metre cores underpinning this research comprise a mix of fossil coral, algae and sediments. They reveal how the reef's previous incarnations responded to rapid sea level rise. The cores analysed for this research focus on how the reef ecosystem evolved between 13,000 to 10,000 years ago.\n\nOf particular interest to Professor Webster's team was the period known as Meltwater pulse 1B, between 11,450 and 11,100 years ago, when sea levels rose very rapidly.\n\n\"This 350-year period is crucial; it covers a time when global sea levels rose very rapidly,\" Professor Webster said. \"It's a period when polar ice sheets are thought to have experienced accelerated melting due to warming temperatures. Based on records from Barbados, we previously thought sea levels were rising by about 40 millimetres a year at this time.\n\n\"Our research shows the rise wasn't so large and fast. It was more likely to have been in the order of three to five millimetres a year, comparable to what we're experiencing today.\"\n\nExtracted by a drilling ship from beneath the Great Barrier Reef's shelf edge at a depth of 40 to 50 metres, the cores offered new insight into how Reef 4, also known as the proto-Great Barrier Reef, was impacted by rising sea levels.\n\n\"Reef 4 is very exciting,\" Professor Webster said. \"It had a similar morphology and mix of coral reef communities to the modern Great Barrier Reef. The types of algae and corals, and their growth rates, are comparable.\n\n\"Understanding the environmental changes that influenced it, and led to its ultimate demise, therefore offers clues on what might happen to the modern reef.\"\n\nProfessor Webster and colleagues used radiometric dating and reef habitat information to accurately pinpoint core samples pertaining to Meltwater pulse 1B.\n\nThe cores underpinning this research were obtained under the International Ocean Discovery Program International Ocean Drilling Program (IODP), an international marine research collaboration involving 21 nations.\n\nProfessor Webster said his latest research highlights the importance of IODP and shows the value of these records, obtained by drilling deep beneath the seabed. They provide paleoclimate and paleoenvironmental data, going far further back in time than instrumental records which go back only 50 to 100 years.\n\n\"These data allow us to more precisely understand how reef and coastal ecosystems have responded to rapid environmental changes, like the rises in sea level and temperature we face today.\"\n\nProfessor Webster completed this research in collaboration with colleagues from the University of Tokyo, Australian National University, Nagoya University, the University of Granada and Aix-Marseille University.",
  "summary": "New research adds to our understanding of how rapidly rising sea levels due to climate change foreshadow the end of the Great Barrier Reef as we know it. The findings suggest the reef can withstand rising sea levels in isolation but is vulnerable to associated environmental stressors arising from global climate change.",
  "published": "Mon, 02 Jun 2025 15:55:13 EDT",
  "url": "https://www.sciencedaily.com/releases/2025/06/250602155513.htm",
  "source": "Latest Science News -- ScienceDaily"
}