{
  "title": "Familiarity breeds contempt as Shabana does her double act | John Crace",
  "text": "Truly we are spoiled. Not one, but two Commons announcements on immigration from the home secretary. Both of them statements of intent. Foreigners, your time is up. Britain isn’t just full. It’s super-saturated with all the wrong kind of people. Theresa May must be shaking her head. She got labelled with creating a hostile environment just for sending vans round to areas with a large proportion of immigrants, saying: “Piss off home. You’re not wanted.” I guess those were gentler, kinder times. Almost a welcome mat.\n\nFair to say, Shabana Mahmood’s first statement on illegal immigration went down an absolute storm. With Reform. At Wednesday’s prime minister’s questions, Lee Anderson had been open-mouthed with admiration.\n\n“The government is guilty of dog-whistle politics,” he said. From Reform, there is no higher praise. To out-Nigel Nigel is to live the dream. A thing of beauty. It was all Lee could do not to stand and applaud.\n\nNow Shabana was due back in the Commons to tackle legal migration. Time to empty the care homes of low-paid workers. Let the old die. They needed to learn to stand on their own two feet. Not lounge around in bed.\n\nFirst though, Mahmood had an appointment with the BBC’s Nick Robinson to appear on his Political Thinking podcast. She had some important thoughts to share.\n\nFirst were some changes to deporting asylum seekers. Rather than just bunging them £3,000 to go home – which most turned their noses up at – the Home Office would offer a serious wedge. Enough to get refugees to go quietly without a legal fight that could cost the government £30,000.\n\nIt made for a brilliant business model. For illegal migrants. Come over here by boat. Collect £10,000 on arrival on the beach. Then take the same boat back to France. It’s such a waste that these inflatables were used only once. And after two weeks or so, you could do the same thing and collect another £10,000.\n\nOK, there were people smugglers to pay off but you could still earn a decent wedge each month. Enough to have a big enough income to qualify for legal residency.\n\nShabana also had a few words to say about the No 10 briefings against her and Wes Streeting. “It was a total car crash,” she said. “It was embarrassing for the prime minister because he’s then got to sort it out and he shouldn’t be put in that position. It’s not how he does his politics.” She also twice used the word humiliation.\n\nAs it is, No 10 is just hoping everyone forgets the sorry episode. Sorry for bringing it up again, chaps.\n\nIn the meantime, Shabana showed up in the Commons just after 1pm for the statement on legal migration. There was far less interest this time round than on Monday. Familiarity breeds contempt. Or there’s only so much anyone can take.\n\nThe Labour benches were almost empty. As were the Tories’. No Reform MPs bothered to show up for their specialist subject. Perhaps they reckon they can now trust Mahmood to deliver without any input from them. Team Shabana.\n\nMahmood started with a bit of her personal backstory. To reassure Labour MPs that this was going to hurt her far more than it was going to hurt them. She was a proud immigrant, she said. She loved this country for the welcome it had shown her parents and so many others.\n\nBUT … patriotism was narrowing in this country. Because so many people in Britain were becoming a bit more racist, it was necessary for the government to become a bit more beastly to foreigners. Not only would Labour lose the next election if it didn’t become more unpleasant, what followed would be worse. A spoonful of hatred helps the medicine go down.\n\nThe BorisWave had been a disaster. So it was time to change the rules. Indefinite leave to remain would now be granted only after 10 years, not five. And then only if you had a clean criminal record, had proficiency in English up to A-level standard.\n\nIt’s a truth universally acknowledged than an immigrant in possession of ILR must be in want of the ability to quote Jane Austen, have national insurance paid up to date and have no debt. If you can’t afford a house without getting a mortgage, you have to bugger off back to wherever you came from. In other words you have to be a great deal more British – not to say richer – than the average British person to qualify as a Brit.\n\nUnlike on Monday, this time round Kemi Badenoch trusted shadow home secretary, Chris Philp, to reply on behalf of the Tories. Partly because even she had exhausted her hatred and anger tank for the week, but mainly because even the Philpster couldn’t really fuck this one up.\n\nAll he had to do was congratulate Mahmood for adopting Conservative party policy, before suggesting a few tweaks to make it even harder for anyone to get ILR.\n\nIt’s not entirely clear who MPs think will run the health service. Obviously none of them has been inside a hospital in the past 10 years. Maybe it’s best if we all just die now.\n\nA few Labour MPs made pleas for compassion. Stella Creasy demanded “Let love be love”. But their hearts weren’t really in it. They have had the fight knocked out of them. Shabana would get her way.\n\nTory Edward Leigh started talking about illegal immigration. No one had the heart to tell him we had moved on. That was Monday, this was now. Maybe he was suffering from PTSD. It’s been that kind of a week.",
  "summary": "<p>Even Reform MPs failed to show up to hear the home secretary talk about migration, their specialist subject</p><p>Truly we are spoiled. Not one, but two Commons announcements on immigration from the home secretary. Both of them statements of intent. Foreigners, your time is up. Britain isn’t just full. It’s super-saturated with all the wrong kind of people. Theresa May must be shaking her head. She got labelled with creating a hostile environment just for sending vans round to areas with a large proportion of immigrants, saying: “Piss off home. You’re not wanted.” I guess those were gentler, kinder times. Almost a welcome mat.</p><p>Fair to say, Shabana Mahmood’s first statement on illegal immigration went down an absolute storm. With Reform. At Wednesday’s prime minister’s questions, Lee Anderson had been open-mouthed with admiration.</p> <a href=\"https://www.theguardian.com/politics/2025/nov/20/familiarity-breeds-contempt-as-shabana-does-her-double-act\">Continue reading...</a>",
  "published": "Thu, 20 Nov 2025 19:11:43 GMT",
  "url": "https://www.theguardian.com/politics/2025/nov/20/familiarity-breeds-contempt-as-shabana-does-her-double-act",
  "source": "The Guardian"
}