{
  "title": "Indian, Nasa experts confirm 3I/ATLAS is a ‘comet’, rule out ‘alien ship’ theory",
  "text": "Indian and Nasa space scientists have captured fresh images of interstellar object 3I/ATLAS and confirmed that it has all the characteristics of a “comet” while dismissing some astronomers’ theory that it could be an “alien ship”.The scientists from Ahmedabad-based Physical Research Laboratory (PRL) under the Department of Space have captured interstellar comet 3I/ATLAS, which is currently on its way out of the inner solar system, Isro said in a statement on Wednesday. PRL scientists observed 3I/ATLAS in imaging and spectroscopic modes with the 1.2-metre telescope, located at an altitude of 1,680 metre in Mount Abu. PRL made these observations between Nov 12 and 15.On Wednesday, Nasa also released fresh images of 3I/ATLAS and dismissed speculation that it is an alien spacecraft. “It definitely behaves like a comet. We certainly haven't seen any technosignatures or anything from it that would lead us to believe it was anything other than a comet,” Nicola Fox, associate administrator of Nasa's science mission directorate, said, while referring to the comet as “our friendly solar system visitor”.Fox said Nasa has studied 3I/ATLAS with over a dozen scientific platforms, including Hubble and James Webb space telescopes and satellites orbiting Mars.NASA associate administrator Amit Kshatriya also said, “It looks and behaves like a comet. And all evidence points to it being a comet.” The new Nasa images showed it with a blurry appearance but with the clear presence of a telltale coma — the hazy cloud of gas and dust around its nucleus — and the tail of dust following its orbit.According to Indian scientists, the images of PRL observation show a near-circular coma. The coma of a comet is the large, glowing atmosphere of gas and dust that forms around its nucleus as it gets closer to the Sun. It is created when the Sun's heat causes the frozen ices on the nucleus to vaporise, or ‘sublimate’, releasing gas and dust that form a large, diffused cloud. Indian scientists have also acquired a spectrum of the light from the comet. The result shows prominent emission features commonly seen in solar system comets — CN, C2 and C3 bands in the shorter wavelength side of the spectrum, the Isro statement said.In case of 3I/ATLAS, the production rates for the prominent bands (emissions pertaining to the constituent molecules) were computed with limiting values around 1025 molecules/sec. The production rate ratios seem to place this comet in the class of ‘typical comets’ of the solar system. Further observations will be continued as the comet gradually comes into the darker part of the night, it said.",
  "summary": "",
  "published": "Fri, 21 Nov 2025 02:41:37 +0530",
  "url": "https://timesofindia.indiatimes.com/india/indian-nasa-experts-confirm-3i/atlas-is-a-comet-rule-out-alien-ship-theory/articleshow/125471886.cms",
  "source": "Times of India"
}