{
  "title": "‘Kim Kardashian had no pretensions that she was a great actress’: Glenn Close hits back at zero-star All’s Fair reviews",
  "text": "Glenn Close has hit back at the critical mauling for her recent series All’s Fair. The actor stars in Ryan Murphy’s legal drama, which has received a string of zero-star reviews. In her appraisal, the Guardian’s Lucy Mangan described it as: “Fascinatingly, incomprehensibly, existentially terrible.” The series currently holds a 3% rating on reviews site Rotten Tomatoes.\n\nAccording to Close, the main issue was the choice to air the worst three episodes first. “I personally think that the first three episodes were the weakest,” she told Variety. “That was a tough way to start. I’ve seen all nine episodes, and I think it actually adds up to something.”\n\nShe also spoke out in support of her co-star Kim Kardashian, who plays one of a number of women who found a legal firm that deals with divorces in California. She says she had a good relationship with Kardashian on-set, at one point going to an alcohol-fuelled viewing of Close’s movie classic Fatal Attraction, which was organised by Kardashian’s mother Kris Jenner.\n\n“What surprised me was Kim’s seriousness of intent,” Close said. “She always knew her lines. She never was late. She always was prepared. She had no pretensions that she was a great actress, but she was smart enough to have people around her who she could learn from. If she was a big ego, or what I call a ‘life-is-too-short person’, I would have been unhappy, but she’s not.”\n\nClose also blamed the Kardashians’ reputation for part of the negative backlash. “The Kardashians would say this themselves, but not everybody likes them. They have an image.”\n\nClose has previously spoken of her love for the show. During a Guardian interview that questioned the quality of the writing of All’s Fair, she said: “I swear to God, I’ve seen all nine episodes and it’s pretty fucking good. It is what it is: it’s juicy and outrageous at times and touching.”",
  "summary": "<p>Actor praises co-star in abominably reviewed Ryan Murphy legal drama, and claims show deserved more appreciation</p><p>Glenn Close has hit back at the critical mauling for her recent series All’s Fair. The actor stars in Ryan Murphy’s legal drama, which has received a string of zero-star reviews. In her appraisal, <a href=\"https://www.theguardian.com/tv-and-radio/2025/nov/04/alls-fair-review-kim-kardashian-divorce-drama-is-fascinatingly-existentially-terrible\">the Guardian’s Lucy Mangan</a> described it as: “Fascinatingly, incomprehensibly, existentially terrible.” The series currently holds a 3% rating on <a href=\"https://www.rottentomatoes.com/tv/alls_fair_2025\">reviews site Rotten Tomatoes</a>.</p><p>According to Close, the main issue was the choice to air the worst three episodes first. “I personally think that the first three episodes were the weakest,” she told Variety. “That was a tough way to start. I’ve seen all nine episodes, and I think it actually adds up to something.”</p> <a href=\"https://www.theguardian.com/tv-and-radio/2025/nov/20/glenn-close-zero-star-reviews-alls-fair-kim-kardashian\">Continue reading...</a>",
  "published": "Thu, 20 Nov 2025 12:26:47 GMT",
  "url": "https://www.theguardian.com/tv-and-radio/2025/nov/20/glenn-close-zero-star-reviews-alls-fair-kim-kardashian",
  "source": "The Guardian"
}