{
  "title": "Chelsea make UWCL statement of intent as Barcelona's perfect run comes to an end",
  "text": "Open Extended Reactions\n\nLONDON -- Chelsea drew 1-1 with Barcelona on Thursday at Stamford Bridge, in a UEFA Women's Champions League match that had a eight-minute delay during the first half due to technical failure.\n\nThe two teams know each other extremely well, having met at the semifinal stage of the tournament the past three seasons, so this was always going to be one of the marquee matches of the Champions League pool stage. And for the most part it lived up to its billing, with both teams showing why they are some of the favourites to lift the trophy this season.\n\nChelsea, who named Millie Bright on the bench, opened the scoring through an Ellie Carpenter wondergoal after 16 minutes, only for Ewa Pajor to equalise in the 24th minute, pouncing on uncertainty in the Chelsea box and firing home.\n\nThe match was played at a frenetic pace, only for the match to be halted in the 37th minute. It seemed to be because of a technical fault in the stadium. The delay lasted eight minutes, the two teams keeping warm on the pitch in the freezing temperatures.\n\nCome the second-half it was more of the same, and Chelsea thought they'd got the lead only for Catarina Macario's goal to be ruled out for the tightest of offsides. Carpenter then had an incredible opportunity to put Chelsea ahead in the 80th minute only to fire wide, leaving Chelsea the more aggrieved of the two teams at not having found a winner.\n\n- Arsenal must keep Russo at No. 9 to revive UWCL campaign\n\n- NWSL faces litmus test to retain Trinity Rodman's star power\n\n- NWSL GM Survey: Execs raise concerns about salary cap\n\nChelsea state intent in the Champions League\n\nChelsea must be sick of the sight of Barcelona. The Catalans have been Chelsea's Champions League nemesis, with Barcelona winning five of their seven meetings since the 2021 Champions League final. Barca won that 4-0, and Chelsea have met them at the semifinal stage of the competition for the past three seasons. On all three occasions, Barcelona progressed.\n\nSo this was a test of Chelsea's credentials. For so long the Champions League has been the trophy Chelsea covet the most, but have never quite landed. Watching Arsenal win the whole thing last season would've stung Chelsea, and with their world-class squad bursting at the seems and other teams in transition, this would seem to be an outstanding chance to end that wait for Europe's biggest honour.\n\nWhile Chelsea and Barca will progress to the knockout stages -- either directly or through the playoffs -- what this match offered was a gauge of where Chelsea stand. And for the most part, they met the challenge.\n\nEllie Carpenter was outstanding, while Erin Cuthbert was the beating heart of the team in the middle of the pitch. Naomi Girma was brilliant at centre back in Chelsea's 3-5-2 formation while Sandy Baltimore relished in the space she found on the left-flank. They kept Barcelona superstar Aitana Bonmatí quiet and had the chances to win this.\n\nMacario's offside effort was because of the thinnest margins and then came Carpenter's incredible opportunity in the 80th minute as she slammed an effort wide with most of the goal to aim at. But overall -- Chelsea did well. -- Hamilton\n\nBarcelona's perfect Champions League run comes to an end\n\nDisney+ becomes new home of Women's Champions League in Europe Disney+ will be the only place football fans can watch all 75 matches live each season. Visit the Disney+ website to get access.\n\nThere are no perfect teams left in the Champions League, which is probably a good thing for the game. After OL Lyonnes and Manchester United's 100% records were ended on Wednesday, Barça's came to an end on Thursday in London after emphatic wins against Bayern Munich, Roma and OH Leuven.\n\nBarça coach Pere Romeu is unlikely to be too concerned, mind. His team remain top of the standings after four matches with 10 points and have now played what, in theory, were their two most difficult matches, at home to Bayern and away to Chelsea. It's hard to imagine Benfica and Paris FC will pose them too many problems in their final two games.\n\nIt makes drawing conclusions from the draw at Stamford Bridge difficult. Barça dominated the Blues in last year's semifinal, but were unable to take them apart in the same manner this time. But with a point not a dreadful result, coupled with their short squad being pushed to the limit at the moment, it felt, certainly at times in the second half, that they were more than happy to take the draw and get back to Catalonia.\n\nRomeu's changes were, if anything, defensive. Aïcha Cámara's introduction for Esmee Brugts was certainly that, while he took an age to introduce Portugal international Kika Nazareth. It was as clear a sign as any that the Spanish champions were more than content with a point on a freezing night in the English capital which came just days after a huge win against Real Madrid in Liga F. -- Marsden\n\nChelsea's depth put to the test\n\nChelsea have been building a squad to compete on all fronts. They came into this off the back of two uncharacteristic draws in the WSL, such are the standards this group are held to having won six titles in a row.\n\nBut with world-class personnel missing in the injured Hannah Hampton, Sam Kerr and Mayra Ramírez, and as they reintroduce Lauren James slowly after her injury in the summer and with Guro Reiten also absent on paternal leave, Chelsea had to rotate their pool of talent for Barca. But what you're seeing is Chelsea's incredible ability to replace like for like.\n\nTake Aggie Beevor-Jones - for 72 minutes she'd run at Barca's defence, and having emptied her legs, she was replaced by Macario, also a brilliant player. You feel they're lacking a little bit of bite up front with the absent personnel, but it was for these sorts of occasions why they have so frequently sought to add some of the world's best young, hungry players to their squad.\n\nLivia Peng did well in goal in Hampton's absence, and could've done little for Pajor's first, while the fact Bright was on the bench shows the strength of options at Bompastor's disposal. -- Hamilton\n\nplay 1:48 Erin Cuthbert explains how Chelsea kept Barcelona quiet Erin Cuthbert explains Chelsea's gameplan in their 1-1 Women's Champions League draw with Barcelona at Stamford Bridge.\n\nPajor a sign of Barcelona's depth\n\nThe good news for Barça from a relatively drab encounter was another goal for Pajor. After trimming the squad in the summer, with a renewed focus on youngsters like Camara, Clara Serrajordi and Sydney Schertenleib, the team's depth has been tested in recent weeks, with a 1-0 loss at Real Sociedad in Liga F highlighting that they are not unbeatable.\n\nHowever, in Pajor, they have one of the best goal getters in the game. The Poland striker is not the most aesthetically pleasing of players, but she has a knack for scoring when it matters. She showed that at the weekend with a brace in the 4-0 win against Madrid, when she also had two more goals ruled out, the first for a marginal offside and the second for a debatable handball.\n\nShe once again recused Barça against Chelsea, finding the net at a time when her side were being put under the cosh. It is impossible to put a price on just how much she is worth to her team in the final third.\n\nThat said, Barça's depth will continue to be tested. Laia Aleixandri has stepped into midfield superbly in the absence of Patri Guijarro in recent weeks, and was again brilliant at Stamford Bridge, but it still feels like this is a team which could struggle in the second half of the season if it suffers any sort of injury crisis. -- Marsden\n\nChelsea feel sting of Millie Bright's absence\n\nOf all the team news, the notable missing name was Millie Bright.\n\nFor so long she's been the focal point of Chelsea's success, an incredible servant to the club and one of their finest ever players. But you feel we're starting to see the changing of the guard. Girma's introduction has been slow at Chelsea, hamstrung by a couple of injuries she's picked up since joining for that world record transfer last January.\n\nSources told ESPN Girma would have been used more frequently this season as part of a first-choice defence had it not been for her injuries, so they've taken the conservative approach to keep her as fresh as possible.\n\nOn Sunday, captain Bright was hauled off at half-time in their eventual 1-1 draw with Liverpool having been caught out for Beata Olsson's break on the counter-attack. Four days on and with Bright watching on, Girma and Nathalie Björn did brilliantly against Barca, with Lucy Bronze the other part of that three-part defence.\n\nThere's plenty of time left in this season to see more of Bright, but this was the first time we've seen signs of the pecking order manager Sonia Bompastor favours in defence for these huge matches. It's also testament to how ruthless Bompastor is prepared to be, dropping their captain, as Chelsea chase European supremacy. -- Hamilton",
  "summary": "Thursday's draw proves Chelsea's credentials as powerhouse Barcelona are denied.",
  "published": "Thu, 20 Nov 2025 23:58:32 EST",
  "url": "https://www.espn.com/soccer/story/_/id/47040002/chelsea-make-uwcl-statement-intent-end-barcelona-perfect-run",
  "source": "www.espn.com - TOP"
}