{
  "title": "The sweet spot: sugar-based sensors to revolutionize snake venom detection",
  "text": "Every five minutes, 50 people are bitten by a snake worldwide; four will be permanently disabled and one will die. In the time-critical situation following a bite, identifying the snake venom making its way through your system is vital to saving lives and providing the best treatment.\n\nMost approaches to diagnose and treat snake venom, a WHO neglected tropical disease, rely on antibodies. Antibody assays have several challenges associated with them, including high costs, lengthy procedures, and inconsistencies, and yet there are not robust, low-cost, and widely available alternatives to antibody-based approaches.\n\nIn this new research paper, published in ACS Biomacromolecules, Warwick researchers have shown the first proof of concept for a cheap and rapid alternative -- a glycopolymer-based ultraviolet-visible (UV-vis) test to detect snake venom. They showcase a version of this diagnostic assay in the paper that specifically detects Western Diamondback Rattlesnake (Crotalus atrox) venom.\n\nDr. Alex Baker, Assistant Professor at Warwick, lead researcher of the Baker Humanitarian Chemistry Group and senior author of the paper said: \"Snake venoms are complex and detecting the toxins at work is challenging but essential to save lives. We've produced an assay using synthetic sugars that mimic the sugars in our bodies that the toxins naturally bind to and an amplification system that makes this rapid test visible. This method lays the foundations for the rapid and cheap detection of snakebite beyond antibody-based techniques, potentially improving improve patient outcomes.\"\n\nWestern Diamondback Rattlesnake venom has evolved to bind to specific sugar molecules on the surface of cells in the body, such as red blood cells and platelets. Specifically, the toxin binds to galactose-terminal glycans (sugar chains ending in galactose). Binding to these glycans allows the venom to disrupt blood clotting or interfere with the immune responses leading to disability and death.\n\nTo create the venom assay for Crotalus atrox venom, the team engineered synthetic chains of sugar-like units (glycopolymers), to mimic the natural sugar receptors targeted by venom proteins. The synthetic sugars were attached to gold nanoparticles to amplify the response and make the reaction visible, creating a test that changes colour when venom toxins bind to the synthetic sugars.\n\nMahdi Hezwani, first author and alumni of Dr Baker's research group said: \"This assay could be a real game-changer for snake envenomation. Venoms from other snake species do not interact with glycans in the body. For example, when we tested venom from the Indian Cobra (Naja naja) we did not see binding to the synthetic glycans that bind to C.atrox venom. Hence this assay shows promise to be able to distinguish between different snake venoms based on their sugar-binding properties.\"\n\nThis is the first example of a diagnosis test using sugars for detecting snake venom in a rapid detection system, and builds on the work of this Warwick research group using a glyconanoparticle platform in COVID-19 detection.\n\nThis new assay is faster, cheaper, easier to store, is modifiable since the sugars can be custom-made to recognise a specific toxin and is an example of the bold, innovative solutions that will continue to be made possible through The University of Warwick's new STEM Connect programme.",
  "summary": "Researchers have published the first example of a synthetic sugar detection test for snake venom, offering a new route to rapid diagnosis and better antivenoms.",
  "published": "Mon, 02 Jun 2025 15:55:05 EDT",
  "url": "https://www.sciencedaily.com/releases/2025/06/250602155505.htm",
  "source": "Latest Science News -- ScienceDaily"
}