{
  "title": "3 Best Hall Effect Keyboards for Gamers and Serious Typists (2025)",
  "text": "Other Hall Effect Keyboards to Consider\n\nAsus Falchion Ace HFX Photograph: Henri Robbins\n\nAsus Falchion Ace HFX for $200: The Falchion Ace HFX (7/10, WIRED Recommends) has a lot of unique features, and underneath them, it’s genuinely a solid Hall effect keyboard. Small details like a touchpad and a physical rapid-trigger switch, paired with big-ticket items like an 8,000-Hz polling rate and one of the better customization software available, make this keyboard both intuitive for daily use and powerful for high-speed gaming. It feels good to type on, looks good, and can be customized extensively without needing to close your game or open up customization software.\n\nSteelseries Apex Pro Mini Gen 3 Photograph: Henri Robbins\n\nSteelSeries Apex Pro Mini Gen 3 for $220: The Apex Pro Mini (6/10, WIRED Review) is a perfectly serviceable HE keyboard with solid switches, fast refresh rates, and useful features like rapid trigger and mis-input protection. However, the build quality is a bit underwhelming for the price, and SteelSeries’ GG software can be tedious at times to use. The Apex Pro Mini uses a tray mount with standard GH60 mounting points. This means the typing experience feels a bit stiff compared to gasket-mounting, but it can easily be customized with aftermarket cases. While it’s ultimately a serviceable keyboard, I can’t recommend it at MSRP. Wait until this one is on sale.\n\nSony Inzone KBD-H75 for $300: The first gaming keyboard under Sony’s Inzone brand, the KBD-H75, sounds good, feels comfortable to type on (which is expected from Gateron switches), and has functional software to accompany it. Sony’s Inzone Hub has extensive adjustable settings for how the Hall effect switches behave, with adjustable actuation distances and customizable rapid trigger functionality. Much like Sony’s cameras, though, the setting adjustments can be a bit too much at times—they provide more customization than most users will know what to do with, and don’t provide much guidance on how they work or what they should be set to. The RGB lighting is bright, and the 8,000-Hz polling is on par with even the highest-end gaming keyboards today. The response time of this keyboard feels fantastic too. The gasket-mount is relatively firm, feeling more comfortable than a tray-mount without introducing too much flex when typing. However, the KBD-H75 doesn’t have a SOCD system (like Snap Tap). The volume knob can easily get “stuck” between two bumps and not register an input. Unlike other options on this list, the KBD-H75 only has an aluminum top half, with the bottom of its case being made from plastic—something that shouldn’t be the case for a wired-only keyboard at this price. It's a serviceable premium keyboard, but I'd wait for a sale.\n\nElecom VK720A for $63: As one of the few Hall effect keyboards on this list to use a non-Gateron switch, this keyboard stands out against the competition. The switches are solid and smooth, and the keyboard feels good to type on. It has some fun quirks, like swappable spacebars and a set of keycaps that were designed specifically for gaming (which work very well for that). A lack of wireless connectivity and a middling build quality knock it down a peg, but it’s a solid option nonetheless.\n\nAvoid These Keyboards\n\nCorsair K70 Pro TKL Photograph: Henri Robbins\n\nCorsair K70 Pro TKL: If you’re only kind of looking for a Hall effect keyboard, the Corsair K70 Pro TKL (5/10, WIRED Review) might be for you. The center cluster of keys uses Hall effect switches, but the entire outside of this keyboard uses standard mechanical switches. While this isn’t a huge issue if you only use the center cluster of keys, it still results in inconsistent customization options and a keyboard that has two separate typing feels between the main keys and the peripheral ones. Plus, if you adjust the actuation distance of your HE switches, you’ll be stuck with a large number of keys around the outside that perform entirely differently than them, which I didn’t enjoy when I tested this keyboard. If you like the design, I’d recommend saving a few dollars and going for the Core TKL Wireless model instead. It adds Bluetooth and 2.4-GHz connectivity, and it has a consistent typing feel with standard mechanical switches across the entire board.\n\nSteelSeries Apex Pro TKL: SteelSeries seemingly made the same mistake as Corsair, also opting to have only the central cluster of keys use HE switches. This keyboard has a few advantages over Corsair’s version, however, like an OLED display that adds a bit of fun and functionality. However, I really can’t recommend this model over SteelSeries’ 60% HE keyboard, since you’re getting just as many Hall effect switches in a much more compact form factor.\n\nPhotograph: Henri Robbins\n\nCorsair Vanguard Pro 96: The Vanguard Pro 96 feels like Corsair’s first serious attempt at a Hall effect keyboard, and it's fairly competent. The build quality feels solid, the switches are smooth, and the layout feels great. Corsair’s SOCD feature, FlashTap, works incredibly well, and the switches feel responsive and quick with 8,000-Hz polling and low latency. Beyond that, the memory foam wrist rest is comfortable, and the keycaps have just the right texture to feel grippy without being abrasive. The screen in the top right corner primarily displays changes to settings, such as adjusting the switches’ actuation distances, enabling FlashTap, or changing the functionality of the knob. The knob can be used to adjust actuation distance, change volume, and swap between windows. So why don't I recommend it? Customization is very limited. The screen can only display GIFs and images (no options for system information like GPU and CPU temperatures or fan speeds), and multiple inputs (like enabling FlashTap, adjusting RGB, and adjusting actuation distance) can’t be remapped to different keys than the default. Certain settings, like adjusting the switch actuation distance, can’t be mapped to specific keys and can only be done through the knob. The Vanguard Pro 96 isn’t compatible with Corsair’s iCue software, either, something that is specifically advertised on the box. Corsair claims it is working on iCue support, but like any promise in the tech world, I'll believe it when I see it. If Corsair can sort out the software issues with this keyboard, I will gladly recommend it. This is, physically, a really good keyboard. However, in its current state, it feels half-baked.\n\nPhotograph: Henri Robbins\n\nSyntech Chronos68: This keyboard does pretty much everything wrong when it comes to tuning a keyboard, creating something that, while functional, is not pleasant to type on at all. The largest issue is the Outemu dustproof switches: They're really bad. I’ve tested a lot of Hall Effect keyboards, and quite a few of them felt a bit soft at the bottom of the keypress. None of them compares to the Chronos68, which has a soft, uncomfortable bottom-out on some of the keys, but not all of them! It feels like a significant percentage of them were over-lubed by the factory. It feels like you’re typing directly into a slice of sponge cake, or an Oreo that’s been dipped in milk. The assembly is a standard tray-mount, which has the typical flaws: stiffer spots where the plate screws into the case, and softer spots where it doesn’t. However, the sound-dampening foam combines with the switches to create an unpleasant typing sound; a muted top end, a heavy midrange, and subtle low frequencies that make the keyboard sound like you’re listening to it through low-quality earplugs. This keyboard’s performance is acceptable—it has all the expected features like Rapid Trigger, 8,000-Hz polling, adjustable actuation distance, and SOCD adjustment—but the software is not. The SynHub Driver software is laggy and awkward to use. Ultimately, the specs and functionality aren’t worth suffering through the rest of the keyboard’s user experience.\n\nPower up with unlimited access to WIRED. Get best-in-class reporting and exclusive subscriber content that's too important to ignore. Subscribe Today.",
  "summary": "Ascend from your mechanical keyboard to magnetically powered Hall effect switches.",
  "published": "Wed, 19 Nov 2025 16:30:00 +0000",
  "url": "https://www.wired.com/gallery/best-hall-effect-keyboards/",
  "source": "WIRED"
}