{
  "title": "Week 13 preview: Stakes in key conference matchups, breakout players and more",
  "text": "Open Extended Reactions\n\nWith two weeks left in the regular season, what was once a vague picture of the College Football Playoff is finally coming into view.\n\nOhio State and Indiana look like sure things from the Big Ten. Georgia, Texas A&M and Ole Miss have all but punched their playoff tickets. Notre Dame and Texas Tech feel good about their odds, but all of that depends on something critical happening these last two weeks that can be boiled down to two simple words: avoid chaos.\n\nAh, but chaos is certainly possible.\n\nIs Miami a contender? Can the Canes slip into the ACC title game mix?\n\nIs Texas Tech guaranteed a bid? What happens if BYU keeps its stellar season going?\n\nThe ACC is ground zero for chaos and everyone from 9-1 Georgia Tech to 5-5 Duke still has a shot at winning the conference.\n\nIn the Big Ten, Oregon and USC will face off in what might be a de facto play-in game for the playoff.\n\nAnd remember last week when Oklahoma earned a statement win against Alabama that appeared to shore up a playoff spot for the Sooners? Well, that dance card is only good as long as Oklahoma beats Missouri this week.\n\nIt's late November, with just enough season behind us to feel as if we've got a real understanding of what's ahead and just enough left on the docket to upend the whole picture and inject a fresh dose of head-spinning into the mix. -- David Hale\n\nJump to:\n\nBreakout players | BYU-Cincinnati\n\nWhat's at stake? | Quotes of the week\n\nTop five breakout players this season\n\nOle Miss quarterback Trinidad Chambliss has had a massive breakout season totaling 20 touchdowns so far. Justin Ford/Getty Images\n\nTrinidad Chambliss, QB, Ole Miss: One of the great plot twists of this college football season has been a little-known transfer from Division II Ferris State stepping in and leading the Rebels to a 10-1 record. Lane Kiffin's new dual-threat playmaker won a D-II national title last season and has shown no fear in moving up to SEC ball, ranking seventh nationally with 3,101 total yards, 20 total touchdowns and only four turnovers since taking over for injured starter Austin Simmons. The No. 6 Rebels struck gold with Chambliss as well as 1,110-yard rusher Kewan Lacy, a Missouri transfer, in their efforts to reload on offense and get into the CFP.\n\nArvell Reese, LB, Ohio State: Reese entered this season with only five career starts over two seasons with the Buckeyes, eager to finally become a full-time starter for the defending national champions. The 6-foot-4, 243-pound junior is quickly playing his way into projected top-10 draft pick status as one of the most versatile defensive playmakers under first-year coordinator Matt Patricia. Reese has produced a team-high 58 tackles with 18 pressures, 10 tackles for loss and 6.5 sacks as a fast, powerful off-ball linebacker who's just as gifted at rushing off the edge for the No. 1 scoring defense in FBS.\n\nDavid Bailey, OLB, Texas Tech: Bailey didn't earn All-ACC honors last season at Stanford but was highly coveted in the transfer portal by the Red Raiders as an impact pass rusher with big-time potential. Bailey has been worth every penny, leading the country with 12.5 sacks and 61 pressures through 11 games, while playing alongside Romello Height and Lee Hunter on one of the top defensive lines in the sport. Bailey is performing like a first-round talent for a No. 5-ranked Texas Tech squad determined to win the program's first Big 12 championship.\n\nCashius Howell, DE, Texas A&M: The former Bowling Green transfer had a good debut season with the Aggies in 2024, but Howell has totally raised his game in his second year in the SEC. The 6-2, 248-pound senior has been a consistently elite pass rusher for the undefeated Aggies with 11.5 sacks and 37 pressures, and could end up being a first-round pick next spring.\n\nAhmad Hardy, RB, Missouri: Hardy exceled during his freshman season at UL Monroe and continues to be one of the great transfer portal gets for the Tigers. He's leading the country with 1,346 rushing yards and 15 TDs, and has forced 72 missed tackles, according to ESPN Research. Hardy just had another career-best day Saturday with a 300-yard effort against Mississippi State after already rushing for 250 yards against Louisiana, plus he has five 100-yard performances this season. -- Max Olson\n\nHow could BYU-Cincinnati affect the Big 12 title race?\n\nTexas Tech and BYU, the Big 12's remaining one-loss teams, appear to be on course to meet again in the championship game. For them, it's simple: win and you're in. But as BYU learned last season when it was in the same spot through 10 games, simple doesn't mean easy.\n\nIf the Cougars win at Cincinnati on Saturday, it would eliminate the Bearcats. Then BYU would be, at minimum, a win against UCF away from the title game. But the Cougars could also clinch a spot this weekend with two scenarios: 1) A win plus losses by Arizona State (at Colorado) and Houston (vs. TCU); or 2) A win and an Arizona State loss, plus a Utah win (Kansas State).\n\nIf BYU loses to Cincinnati, then all bets are off. Utah, Houston, Arizona State and Cincinnati are all mathematically alive. Which means that all over them can still cling to CFP hopes, as far-fetched as they might be. This is one of the obvious benefits of the playoff format. It keeps more teams relevant later in the season and ensures meaningful games across the board into the final weeks. -- Kyle Bonagura\n\nWhat's at stake in each matchup?\n\nUSC's matchup with Oregon could have a potential College Football Playoff spot on the line. Harry How/Getty Images\n\nUSC-Oregon: To put it bluntly: a spot in the CFP. That's what's at stake in Eugene this week as the college football world sets its eyes on the one marquee matchup this week.\n\nUSC has only one Big Ten loss and should it beat the Ducks, it would qualify for not only its best win of the season but one of the best wins in the sport this year. The Trojans have the offense to keep up with the Ducks; the question is, what USC defense will show up Saturday? That will be the key to pulling off the upset and putting Lincoln Riley's team in the driver's seat for a CFP spot.\n\nOne-loss Oregon might have some more breathing room if it loses to USC, but it's not a guarantee the Ducks will get in with two losses. At that point, the Ducks' best win would be at Iowa (currently unranked) and would have to rank behind at least USC (and Michigan if it beats Ohio State) making their entry back into the field a tight one, should it happen.\n\nPlus, not to mention the fact that Oregon finishes with a tricky game at Washington -- a team that has been up-and-down this season but has plenty of talent and motivation to play spoiler against its rival. -- Paolo Uggetti\n\nPitt-Georgia Tech: A week ago, Pitt coach Pat Narduzzi colorfully made the point that his team could give up 100 points to Notre Dame, but it wouldn't change the fact that these next two games, starting with Georgia Tech, will define the Panthers' postseason fate. Well, Pitt didn't surrender 100, but Notre Dame did win easily, putting an even bigger spotlight on the Panthers' need to win out if they want any hope of capitalizing on a wide-open ACC.\n\nFor Georgia Tech, the stakes are even clearer. This is the Yellow Jackets' final ACC game of the season. Win, and they're guaranteed a spot in Charlotte for the ACC championship. Lose and all bets are off. Tech's defense has been a train wreck the past two games, and getting right against Pitt is essential to keep a magical season going a little longer. -- Hale\n\nSMU-Louisville: While much of the attention in the ACC has focused on Miami, Virginia and Georgia Tech, SMU still has a shot to make it to the ACC championship game for the second straight season. That is the biggest thing on the line Saturday. With only one conference loss, SMU sits in a four-way tie atop the ACC headed into the weekend. The easiest path to Charlotte is this one: SMU has to win out, and Pitt has to beat Georgia Tech on Saturday. There is another clinching scenario: SMU wins out, and Virginia Tech upsets Virginia next week.\n\nThough the Mustangs do not control their destiny, the fact they are in the mix to play for a conference championship again speaks to the job coach Rhett Lashlee has done since SMU made the move to the ACC in 2024. SMU is not a one-trick pony (see what we did there), but is building a program meant to contend year after year.\n\n\"It is a little bit different than last year because we were in control of everything,\" Lashlee said. \"This year, it's almost like a playoff scenario already. Nobody's talking about us, and I'm totally cool with that.\" -- Andrea Adelson\n\nQuotes of the week\n\n\"Brent Key, a great football coach who's done an outstanding job,\" Pitt's Pat Narduzzi said of Georgia Tech's fourth-year head coach. \"They might as well just announce him as ACC Coach of the Year. He's done an incredible job. Just give it to him early.\"\n\n\"I think for us, these are all the same people that thought we were going to suck,\" USC coach Lincoln Riley said on the 8-2 Trojans' Week 13 appearance on College GameDay. \"This is all the same people, you know, we were going to do this and USC was this and that. And so for us to pay attention to them now would be a little bit counterproductive. We haven't forgotten that.\"\n\nAll of ESPN. All in one place. Watch college football and much more in the newly enhanced ESPN App. Stream the biggest games\n\nOle Miss' Lane Kiffin on if he expects to be coaching in the Nov. 29 Egg Bowl: \"Do you know something that I don't know? Do I expect to coach next week? Why would I not expect to coach next week? I mean, I expected to coach against Florida, too. So I don't even understand the question about how I would not expect to coach next week. Why would I [not] be at work?\"\n\n\"I've had no discussions, not with my agent, not with the university, not with any other school, not with any NFL team, about ever going anywhere else,\" said Texas' Steve Sarkisian, who knocked down rumors around a potential departure this week. \"I came here to win championships.\"\n\nColorado's Deion Sanders appealed for more time with the Buffaloes this week: \"You've got the right man [for the job]. I promise you, you do. And I'm going to prove that to you. Just give me an opportunity and a little more time, and I'm going to prove that to you.\"\n\n\"Does it look, feel, smell and operate like a big-time program?\" James Franklin said of his plans for Virginia Tech in his introductory news conference with the Hokies. \"All those things need to be in place. ... I think the previous coaches here were in some challenging situations. That's the truth of it. There's some things that we're going to have to look at, and it's not just James Franklin. It's the marketing office, the ticketing office. Everybody's got to take some time and look in the mirror and say, 'Are we operating like a big-time program?'\"",
  "summary": "Our college football experts tell us what's at stake in key conference matchups, plus breakout players and more.",
  "published": "Thu, 20 Nov 2025 23:03:55 EST",
  "url": "https://www.espn.com/college-football/story/_/page/gamedaykickoff112025/2025-college-football-gameday-kickoff-week-13-usc-oregon-breakout-players",
  "source": "www.espn.com - TOP"
}