{
  "title": "Extreme floods are slashing global rice yields faster than expected",
  "text": "Intense flooding has significantly reduced rice harvests around the world in recent decades, putting at risk the food supply of billions of people who rely on the grain as a dietary staple. Between 1980 and 2015, annual losses averaged about 4.3%, or roughly 18 million tons of rice each year, according to Stanford University research published November 14 in Science Advances.\n\nThe researchers found that the damage has grown worse since 2000 as extreme floods have become more common in many of the planet's main rice-growing regions. They report that climate change is likely to further increase the frequency and severity of these destructive floods in the coming decades.\n\nDroughts, Floods, and a Delicate Balance for Rice\n\nScientists and farmers have long known that rice yields fall during droughts. The new study adds fresh detail to this picture, estimating that droughts reduced rice yields by an average of 8.1% per year during the 35-year study window. At the same time, the work draws attention to a related but less examined danger from too much water. Rice plants benefit from shallow standing water during early growth, yet prolonged or deep flooding can severely damage or kill the crop.\n\n\"While the scientific community has focused on damage to rice yield due to droughts, the impacts of floods have not received enough attention,\" said Steven Gorelick, the study's senior co-author and a professor of Earth system science in the Stanford Doerr School of Sustainability. \"Our research documents not only areas where rice yields have suffered due to past flooding, but also where we can anticipate and prepare for this threat in the future.\"\n\nWhat Counts as a 'Rice-Killing' Flood\n\nThe research team clearly spells out, for the first time, the conditions that turn a flood into a lethal event for rice, said lead study author Zhi Li, who worked on the project as a postdoctoral fellow in Gorelick's lab at Stanford and recently joined the faculty of the University of Colorado Boulder.\n\nThey found that a full week of complete submergence during the plant's growth cycle is the critical tipping point. \"When crops are fully submerged for at least seven days, most rice plants die,\" Li said. \"By defining 'rice-killing floods,' we were able to quantify for the first time how these specific floods are consistently destroying one of the most important staple foods for more than half of the global population.\"\n\nHow the Researchers Measured Flood and Drought Damage\n\nTo estimate how much past droughts and floods have harmed rice production, the scientists combined several lines of evidence. They drew on information about rice growth stages, annual global rice yields, a worldwide database of droughts and floods dating back to 1950, a model of how floods behave across landscapes, and a simulation of soil moisture levels over time in major rice-growing river basins.\n\nTheir analysis indicates that, in the coming decades, the most intense week of rainfall in key rice-growing basins around the world could deliver 13% more rain than the average for those regions during the 1980 to 2015 baseline period. This projected increase suggests that rice-killing flood conditions may become more common as the climate continues to warm.\n\nFlood-Resistant Rice Varieties and High-Risk Regions\n\nWider use of flood-resistant rice varieties could help reduce future losses, especially in the areas that face the highest risk. The study highlights the Sabarmati Basin in India, which experiences the longest rice-killing floods, along with North Korea, Indonesia, China, the Philippines, and Nepal, where the impact of such floods on rice yields has grown the most in recent decades. The greatest total losses have occurred in North Korea, East China, and India's West Bengal.\n\nThe researchers also identified exceptions, such as India's Pennar Basin, where flooding appears to boost rice yields. They suggest that in these locations, hot and dry conditions may allow standing floodwater to evaporate quickly, reducing long-term damage and sometimes even creating favorable moisture conditions for the crop.\n\nCompounding Climate Stresses on Rice\n\nFor Gorelick and Li, the new findings reinforce the need to understand how rice responds not only to floods and droughts, but also to heat waves and cold stress, both individually and when they occur in succession. Earlier research has shown that rapid swings from drought to flood and back again can nearly double rice yield losses compared with single flood or drought events on their own. According to the authors, \"How these combined effects can be mitigated remains a major challenge.\"\n\nAdditional co-authors not mentioned above include Lorenzo Rosa, who is affiliated with the Department of Earth System Science in the Stanford Doerr School of Sustainability and the Department of Global Ecology at the Carnegie Institution for Science. The research was supported by a Dean's Postdoctoral Fellowship awarded to Li by the Stanford Doerr School of Sustainability.",
  "summary": "Scientists discovered that a week of full submergence is enough to kill most rice plants, making flooding a far greater threat than previously understood. Intensifying extreme rainfall events may amplify these losses unless vulnerable regions adopt more resilient rice varieties.",
  "published": "Sat, 15 Nov 2025 23:42:17 EST",
  "url": "https://www.sciencedaily.com/releases/2025/11/251115095918.htm",
  "source": "All Top News -- ScienceDaily"
}