{
  "title": "Helen Goh’s recipe for cranberry, orange and ginger upside-down cake | The sweet spot",
  "text": "Bright, tart cranberries are one of the most vivid flavours of the Thanksgiving table, but they often play a supporting role to turkey and stuffing. Here, however, they take centre stage in a sparkling upside-down cake, and their ruby tones gleam over a tender, orange-scented crumb. The batter is enriched with soured cream, ensuring every bite is a balance of sweet, sharp and soft.\n\nCranberry, orange and ginger upside-down cake\n\nA note about the cranberries: if using frozen, do not defrost them first.\n\nPrep 10 min\n\nCook 1 hr 15 min, plus cooling\n\nServes 8-10\n\nFor the cranberry caramel base\n\n60g unsalted butter\n\n100g light brown sugar\n\n1 tbsp fresh orange juice\n\n2 tsp finely grated ginger\n\n⅛ tsp flaky sea salt\n\n250g fresh or frozen cranberries\n\nFor the cake batter\n\n150g plain flour\n\n1 tsp baking powder\n\n¼ tsp bicarbonate of soda\n\n¼ tsp fine sea salt\n\n120g unsalted butter, at room temperature, plus extra for greasing\n\n150g caster sugar\n\nFinely grated zest of 1 orange\n\n2 large eggs\n\n2 tsp vanilla extract\n\n120g full-fat soured cream\n\nGrease a 20cm round cake tin (at least 5cm deep, and not springform), then line the base and sides with baking paper.\n\nMake the caramel base by mixing the butter, brown sugar, orange juice, ginger and salt in a small saucepan, then put it on a medium-low heat and cook, stirring gently, until glossy and bubbling Pour into the prepared tin, swirl gently to coat the base, then scatter the cranberries evenly on top.\n\nHeat the oven to 195C (175C fan)/380F/gas 5½. Sift the flour, baking powder, bicarb and salt into a medium bowl. Put the butter, sugar and orange zest in the bowl of an electric mixer and beat with the paddle attachment on medium-high until pale and creamy. Add the eggs one at a time and beat in well – the mix may curdle at this point, but don’t worry: it will come back together.\n\nBeat in the vanilla, then, on low speed, add the sifted dry ingredients in three instalments, alternating with the soured cream. Scrape the base and sides of the bowl a few times with a flexible spatula to ensure the batter is evenly mixed, then spoon the batter over the cranberries in the tin. Use a spatula to smooth out the top evenly.\n\nPut the tin on an oven tray and bake for about 50 minutes, until a skewer inserted into the centre of the cake comes out clean. Transfer the cake in its tin to a wire rack and leave to cool for at least 30 minutes.\n\n\n\nCarefully invert the cake on to a platter, then peel away and discard the baking paper. Serve warm or at room temperature with cream, soured cream or vanilla ice-cream.",
  "summary": "<p>Move over, turkey! It’s time for cranberries to take Thanksgiving centre stage in this moreish upside-down cake</p><p>Bright, tart cranberries are one of the most vivid flavours of the Thanksgiving table, but they often play a supporting role to turkey and stuffing. Here, however, they take centre stage in a sparkling upside-down cake, and their ruby tones gleam over a tender, orange-scented crumb. The batter is enriched with soured cream, ensuring every bite is a balance of sweet, sharp and soft.</p> <a href=\"https://www.theguardian.com/food/2025/nov/21/cranberry-orange-ginger-upside-down-cake-recipe-helen-goh\">Continue reading...</a>",
  "published": "Fri, 21 Nov 2025 06:00:02 GMT",
  "url": "https://www.theguardian.com/food/2025/nov/21/cranberry-orange-ginger-upside-down-cake-recipe-helen-goh",
  "source": "The Guardian"
}