{
  "title": "As Goa sees uptick in crime, senior officers are transferred in police reshuffle",
  "text": "The Goa government on Thursday appointed Harishchandra V Madkaikar as Superintendent of Police (SP) North Goa, replacing IPS officer Rahul Gupta, as part of a major reshuffle in the police department. Gupta, who is SP Crime Branch and SP Cyber Crime, had been holding additional charge as SP of North Goa district since May.\n\nThe government also transferred 34 police inspectors and six deputy superintendents of police (DSPs) in the reshuffle.\n\nThe transfers come in the wake of a spurt in crime in recent weeks. On Wednesday night, Goa Chief Minister Pramod Sawant chaired a high-level review meeting with the police top brass to assess the law-and-order situation in the coastal state. After the meeting, Sawant said he has directed police officers to intensify night patrolling, enforce nakabandis at strategic locations and focus on taking preventive actions to deter criminal activity.\n\nAn order issued by the Department of Personnel, Goa government, on Thursday said that senior scale officer (SP), Goa Police Service, Harishchandra V Madkaikar, who was posted as SP Konkan Railway, has now been posted as SP North Goa. IPS officer Tikam Singh Verma, who is SP South Goa, will hold the additional charge of SP Konkan Railway.\n\nThe state has been rocked by a series of dacoities in recent months. On Tuesday, armed robbers broke into the apartment of a businessman in Baina in South Goa and decamped with cash and jewellery worth Rs 35 lakh. The dacoits allegedly hit the businessman with an iron rod and also assaulted his family members. Another burglary was reported in St Cruz, where the accused stole cash and jewellery worth Rs 25 lakh this week. Last month, six armed robbers broke into a doctor’s house in North Goa’s Mapusa, tied up the occupants for over two hours and fled with jewellery, cash and a car, while in a similar incident in April, at least four armed robbers broke into the house of an elderly couple from a reputed business family, tied them up and left with gold and cash in the Dona Paula area.\n\nThree murders were also reported between the last week of October and the first week of November. On November 5, the government authorised the district magistrates of both districts in the state to exercise powers under the stringent National Security Act (NSA) for three months, citing “prevailing circumstances” in the state. The order was issued over a month after police wrote to the state’s Home Department urging that DMs be empowered under the NSA, saying that while many offenders had been arrested, the measures were proving “insufficient to neutralise repeat offenders and organised elements, who are likely to act in a manner prejudicial to the maintenance of public order”.\n\nIn a statement on Thursday, police said personnel in North Goa district have intensified their focus on preventive policing measures to enhance safety and deter criminal activity.\n\nStory continues below this ad\n\n“This year, 66,479 tenants and 33,123 servants/labourers have been physically verified. Adopting the Aadhaar-based online verification system through the Goa Police app, over 1,250 tenants have been verified till date. This measure ensures that any potential threat posed by unverified tenants, servants, or temporary residents is identified early. Every night, more than 30 nakabandis, depending on staff availability, are strategically placed across the district from 6 pm to 6 am. These are actively supervised by police inspectors and senior officers, who remain in the field to monitor night deployment, vehicle checks, and area patrolling to deter potential offenders. Special verification drives for scrap yards were undertaken wherein 105 scrapyards and 221 scrap dealers have been verified,” the statement said.",
  "summary": "",
  "published": "Fri, 21 Nov 2025 00:40:33 +0000",
  "url": "https://indianexpress.com/article/india/as-goa-sees-uptick-in-crime-senior-officers-are-transferred-in-police-reshuffle-10377161/",
  "source": "India | The Indian Express"
}