{
  "title": "Israel used widely banned cluster munitions in Lebanon, photos of remnants suggest",
  "text": "Israel used widely banned cluster munitions in its recent 13-month war in Lebanon, photos of munition remnants in south Lebanon seen by the Guardian suggest.\n\nThe images, which have been examined by six different arms experts, appear to show the remnants of two different types of Israeli cluster munitions found in three different locations: south of the Litani River in the forested valleys of Wadi Zibqin, Wadi Barghouz and Wadi Deir Siryan.\n\nView image in fullscreen The remnants of what is believed to be a Barak Eitan cluster munition, with ‘cluster’ written in Hebrew on the shell.\n\nThe evidence is the first indication that Israel has used cluster munitions in nearly two decades since it employed them in the 2006 Lebanon war. It would also be the first time that Israel was known to have used the two new types of cluster munitions found – the 155mm M999 Barak Eitan and 227mm Ra’am Eitan guided missiles.\n\nCluster munitions are container bombs which release many smaller submunitions, small “bomblets”, over a wide area the size of several football fields. The use of cluster munitions is widely banned as up to 40% of submunitions do not explode upon impact, posing a danger to civilians who might later stumble upon them and be killed when they explode.\n\nTo date, 124 states have joined the convention on cluster munitions, which forbids their use, production and transfer. Israel is not a party to the convention and is not bound by it.\n\n“We believe the use of cluster munitions is always in conflict with a military’s duty to respect international humanitarian law because of their indiscriminate nature at time of use and afterwards,” said Tamar Gabelnick, the director of the Cluster Munition Coalition. “Their wide area impact means they cannot distinguish between military and civilian targets and the cluster munition remnants kill and maim civilians for decades after use.”\n\nThe Israeli military neither confirmed nor denied its use of cluster munitions but said it “uses only lawful weapons, in accordance with international law and while mitigating harm to civilians”.\n\nIsrael’s war with Hezbollah which started in October 2023 and killed almost 4,000 people in Lebanon and about 120 people in Israel, left the Lebanese militant group devastated. Much of Lebanon’s south remains in ruins and Israel still carries out near-daily airstrikes in the country, despite a ceasefire signed last year.\n\nLebanon in particular has a painful history with cluster munitions. Israel blanketed Lebanon with 4m cluster bombs in the final days of the 2006 war, with an estimated 1m failing to explode. The presence of unexploded cluster bombs continues to make life in south Lebanon dangerous, with more than 400 people killed by unexploded bomblets since 2006.\n\nThe huge number of unexploded cluster bombs in Lebanon was a main driving factor for the drafting of the cluster convention in 2008.\n\nDespite not being a party to the convention, Israeli officials condemned Iran’s use of cluster munitions in Israel during this summer’s 12-day war. “The terror regime seeks to harm civilians and even used weapons with wide dispersal in order to maximise the scope of damage,” said the Israeli military spokesperson, Brig Gen Effie Defrin, after an Iranian strike used cluster munitions in populated areas in southern Israel.\n\nImages of the remnants of the first cluster munition, a 155mm M999 Barak Eitan advanced anti-personnel munition produced by the defence contractor Elbit Systems in 2019, were verified by six different arms experts, including Brian Castner, the head of crisis research at Amnesty International, and NR Jenzen-Jones, the director of Armament Research Services, a technical intelligence consultancy specialising in arms and munitions analysis. Elbit Systems did not respond to a request for a comment.\n\nEach M999 artillery shell releases nine submunitions which explode into 1,200 tungsten shards, according to a US army primer on the weapon.\n\nView image in fullscreen The second munition’s remnants were said by two analysts to be from a Ra’am Eitan guided missile. The yellow diamond markers indicate that the shell contains high-explosive submunitions.\n\nPhotos of the second munition’s remnants were identified as a cluster bomb by five different arms experts, though most were unable to identify the exact model owing to a lack of open-source materials on this specific rocket.\n\nJenzen-Jones and a separate weapons analyst said the weapon was a 227mm Ra’am Eitan guided missile, a new type of cluster munition developed by Elbit Systems. This specific shell was produced in 2017, evidenced by its lot code.\n\nIsraeli media described the Ra’am Eitan as guided missiles that hold 64 bomblets each, which “scatter in a large radius and kill everyone present”. According to a press release by the IDF in February 2024, Israeli troops operating on the country’s northern border were equipped with the Ra’am Eitan in preparation for a fight with Hezbollah.\n\nThe legality of cluster munition usage for non-signatory countries is dependent on the circumstances of the strikes they were used in, as well as the intentions of the military personnel involved in their use. The Guardian does not have information about the strikes the shells were used in, as the remnants were found after the fact.\n\nThe remnants were found in heavily forested valleys in south Lebanon, which Israel accused Hezbollah of exploiting during the war to provide cover from aerial bombing and surveillance.\n\nCluster munitions, due to their wide spread, could be useful against soldiers spread out across large, wooded areas. US forces used cluster munitions in a similar way in Vietnam, carpeting dense jungles where Vietcong soldiers were located.\n\nAccording to Israeli media reports, both of the cluster munitions found had been developed in recent years to leave fewer unexploded munitions behind, with claims that the Ra’am Eitan had a “dud rate” of 0.01%. Israel developed the munitions after its use of cluster bombs in the 2006 Lebanon war triggered outrage abroad and at home – seeking a way to continue using cluster bombs while minimising civilian harm.\n\nGabelnick and other arms experts warned that dud rates advertised by arms companies were often many times higher in the field. Israel Military Industries claimed a 0.06% dud rate for the M85 cluster munition used in the 2006 war; later analysis suggested the rate was about 10%.\n\nHuman rights groups have said that it is impossible for cluster munitions to be used in a way that minimises harms to civilians.\n\n“Cluster munitions are banned internationally for a reason. They are inherently indiscriminate and there is no way to employ them lawfully or responsibly, and civilians bear the brunt of the risk as these weapons stay deadly for decades to come,” said Castner.",
  "summary": "<p>Exclusive: Images are first indication that Israel has used cluster munitions in nearly 20 years</p><p>Israel used widely banned cluster munitions in its recent 13-month war in Lebanon, photos of munition remnants in south Lebanon seen by the Guardian suggest.</p><p>The images, which have been examined by six different arms experts, appear to show the remnants of two different types of Israeli cluster munitions found in three different locations: south of the Litani River in the forested valleys of Wadi Zibqin, Wadi Barghouz and Wadi Deir Siryan.</p> <a href=\"https://www.theguardian.com/world/2025/nov/19/israel-used-widely-banned-cluster-munitions-in-lebanon-photos-of-remnants-suggest\">Continue reading...</a>",
  "published": "Wed, 19 Nov 2025 14:00:39 GMT",
  "url": "https://www.theguardian.com/world/2025/nov/19/israel-used-widely-banned-cluster-munitions-in-lebanon-photos-of-remnants-suggest",
  "source": "World news | The Guardian"
}