{
  "title": "Scientists found the key to accurate Maya eclipse tables",
  "text": "Astronomical events such as eclipses were central to Maya culture, reflected in the care the Maya took to keep accurate calendars to aid in celestial predictions. Among the few surviving Maya texts is the so-called Dresden Codex, which includes a table of eclipses. Researchers have concluded that this table was repurposed from earlier lunar month tables, rather than being created solely for eclipse prediction, according to a paper published in the journal Science Advances. They also figured out the mechanism by which the Maya ensured that table would be accurate over a very long time period.\n\nThe Maya used three primary calendars: a count of days, known as the Long Count; a 260-day astrological calendar called the Tzolk’in; and a 356-day year called the Haab’. Previous scholars have speculated on how awe-inspiring solar or lunar eclipses must have seemed to the Maya, but our understanding of their astronomical knowledge is limited. Most Maya books were burned by Spanish conquistadors and Catholic priests. Only four hieroglyphic codices survive: the Dresden Codex, the Madrid Codex, the Paris Codex, and the Grolier Codex.\n\nThe Dresden Codex dates back to the 11th or 12th century and likely originated near Chichen Itza. It can be folded accordion-style and is 12 feet long in its unfolded state. The text was deciphered in the early 20th century and describes local history as well as astronomical lunar and Venus tables.\n\nFor their study, co-authors John Justeson of the University at Albany and Justin Lowry of SUNY-Plattsburgh focused their attention particularly on pages 51 and 58, which consist of eclipse tables covering all solar and most lunar eclipses. It is accurate enough to run from its starting date in the eighth century up to the 18th century. (The Madrid Codex also contains an eclipse almanac, but it is primarily concerned with how agricultural cycles correspond with eclipses.)",
  "summary": "Eclipse tables in the Dresden Codex were based on lunar tables and adjusted for slippage over time.",
  "published": "Thu, 20 Nov 2025 20:23:49 +0000",
  "url": "https://arstechnica.com/science/2025/11/study-how-the-maya-created-such-accurate-eclipse-tables/",
  "source": "Ars Technica - All content"
}