{
  "title": "Saudi Arabia Bus Crash Live Updates: At least 45 Indian pilgrims feared dead near Medina, Hyderabad families in distress",
  "text": "People gather after at least 45 people, most of them from Hyderabad, were killed in a bus accident in Saudi Arabia, in Hyderabad. (PTI)\n\nSaudi Arabia Bus Crash Live Update: Dozens of distraught relatives of Haj pilgrims rushed to travel agencies in Hyderabad early Monday, seeking information about their loved ones after a bus carrying 54 Umrah pilgrims met with a accident near Medina, in which 45 Indians are feared dead. The bus, which reportedly collided with an oil tanker around 1:30 am (IST). Confirming the death toll, V C Sajjanar, Commissioner of Police, Hyderabad, said 54 people had travelled from Hyderabad to Jeddah on November 9. “Their travel plan was from November 9 to 23. While eight of them escaped the accident by choosing to travel separately, 46 boarded a bus from Mecca to Medina. The bus met with an accident and 45 of them died,” he said.\n\nExternal Affairs Minister S Jaishankar, currently on a visit to Russia, expressed shock over the accident. “Our Embassy in Riyadh and Consulate in Jeddah are giving the fullest support to Indian nationals and families affected by this accident,” he said.\n\nStory continues below this ad What did the Telangana CM say? Expressing shock over the accident, Telangana Chief Minister A Revanth Reddy directed Chief Secretary K Ramakrishna Rao and DGP B Shivadhar Reddy to ascertain the full details. He sought information on how many of the victims were from Telangana and asked officials to coordinate with the Union Ministry of External Affairs and the Saudi Embassy. He also instructed them to take immediate relief measures, if required. Helpline numbers: A control room has been set up in the Secretariat to provide appropriate information and assistance to the families of the bus accident victims in Saudi Arabia. The helpline numbers– +91 79979 59754 and +91 99129 19545. Live Updates Nov 17, 2025 06:44 PM IST Saudi Arabia Bus Accident Live Updates: 18 members of a family were in the ill-fated bus As many as 18 members of a family across three generations were in a bus involved in a deadly accident with an oil tanker in Saudi Arabia, relatives said here on Monday. Shaik Nazeeruddin, a retired railway employee, was travelling in the ill-fated bus along with his wife, son, three daughters and grandchildren on his way to Medina, his nephew Mohammed Aslam said. \"Whether it was an accident or what happened we do not know, but total 18 members- Shaik Nazeeruddin, his son, daughters and grandchildren were in the bus,\" Salam told PTI. Nazeeruddin's another son is currently in the US. (PTI) Nov 17, 2025 04:07 PM IST Saudi Arabia Bus Accident Live Updates: J&K Chief Minister Omar Abdullah condoles pilgrims' death in Medina J&K Chief Minister Omar Abdullah expressed deep sorrow over the deaths of Indian pilgrims in a bus accident in Saudi Arabia’s Medina. Over 40 Indians were reportedly on board when the bus collided with an oil tanker, causing a massive fire. Hyderabad Police Commissioner V C Sajjanar has informed that total of 54 people from the city had left for the pilgrimage recently. (PTI) Nov 17, 2025 02:00 PM IST Saudi Arabia Bus Accident Live Updates: VP condole loss of lives of Indian pilgrims in Medinah bus accident Vice President C P Radhakrishnan Monday condoled the loss of lives in the bus accident involving several Indian Umrah pilgrims in Saudi Arabia's Medinah. Around 40 Indians, most of them from Telangana, were on board the bus which reportedly collided with an oil tanker at around 1:30 am (IST). In a social media post, Radhakrishnan said he was deeply pained by the tragic road accident near Medinah, Saudi Arabia. \"My thoughts are with the affected families during this difficult time. Heartfelt condolences to the bereaved families, and prayers for the speedy recovery of the injured,\" he said. Nov 17, 2025 01:24 PM IST Saudi Arabia Bus Accident Live Updates: Naidu mourns loss of Telangana pilgrims killed in Saudi bus accident Andhra Pradesh CM N Chandrababu Naidu expressed condolences over the Saudi Arabia bus accident that claimed the lives of several pilgrims from Telangana. “I am deeply saddened by the tragic accident in Saudi Arabia that took our fellow brothers and sisters who were on the holy Umrah pilgrimage. May their souls rest in peace, and may the bereaved families find strength and solace in this difficult time,” he wrote on X. I'm deeply saddened to hear about the tragic accident in Saudi Arabia that took the lives of our fellow brothers and sisters from Telangana who were on the holy Umrah pilgrimage. May their souls rest in peace, and may the bereaved families find strength and solace in this… — N Chandrababu Naidu (@ncbn) November 17, 2025 Nov 17, 2025 12:56 PM IST Saudi Arabia Bus Accident Live Updates: Telangana Bhavan sets up control room in Delhi to assist families after Saudi bus tragedy In the wake of the tragic bus accident in Saudi Arabia involving Indian pilgrims travelling from Makkah to Madinah, Telangana Bhavan in New Delhi has set up a dedicated control room to assist affected families. Senior officials at the Bhavan are in constant touch with the Indian Embassy in Riyadh as efforts continue to gather complete details of the incident and verify how many pilgrims from Telangana were involved. Families seeking information can reach out to the control room through the following contacts: Smt. Vandhana, PS to Resident Commissioner and Liaison Head ( +91 98719 99044 ); Sri Ch. Chakravarthi, Public Relations Officer ( +91 99583 22143 ); and Sri Rakshith Nail, Liaison Officer ( +91 96437 23157 ). Nov 17, 2025 12:40 PM IST Saudi Arabia Bus Accident Live Updates: Cong condoles death of Indian pilgrims in Saudi Arabia Congress president Mallikarjun Kharge on Monday condoled the death of Indian pilgrims in Saudi Arabia and urged the Centre to closely coordinate with state authorities to provide succour to the families of the deceased. Several Indian Umrah pilgrims, most of them hailing from Telangana, are feared dead in a horrific bus accident in Saudi Arabia's Madina early Monday. Around 40 Indians were on board the bus which reportedly collided with an oil tanker at around 1:30 am (IST). \"Deeply saddened by the heart-wrenching tragedy near Medinah, Saudi Arabia involving several Indian nationals. My deepest condolences to the bereaved families, and prayers for the swift recovery of the injured,\" he said in a post on X. \"The Union Government, through the @MEAIndia should closely coordinate with state authorities and the families of the victims here in India to provide succour and relief, in this difficult time,\" he said. Nov 17, 2025 12:35 PM IST Saudi Arabia Bus Accident Live Updates: 45 Hyderabad pilgrims dead in Saudi bus crash, says Hyderabad Police Commissioner Hyderabad Police Commissioner VC Sajjanar Monday confirmed that 45 pilgrims from Hyderabad were killed in the Saudi Arabia bus accident while travelling from Mecca to Madina. Of the 54 people who left for Jeddah on November 9 for a two-week trip, eight escaped the tragedy after opting to travel separately, while the remaining 46 took the ill-fated bus that crashed en route. Nov 17, 2025 12:29 PM IST Saudi Arabia Bus Accident Live Updates: PM Modi expresses grief over Medinah bus tragedy, assures support to affected families Prime Minister Narendra Modi Monday expressed deep sorrow over the fatal bus accident in Medinah that claimed the lives of several Indian nationals. In a post on X, he conveyed his condolences to the bereaved families and wished a speedy recovery to the injured. Modi said the Indian Embassy in Riyadh and the Consulate in Jeddah are extending all possible assistance and remain in close touch with Saudi authorities. Deeply saddened by the accident in Medinah involving Indian nationals. My thoughts are with the families who have lost their loved ones. I pray for the swift recovery of all those injured. Our Embassy in Riyadh and Consulate in Jeddah are providing all possible assistance. Our… — Narendra Modi (@narendramodi) November 17, 2025\n\nStay updated with the latest - Click here to follow us on Instagram\n\n© IE Online Media Services Pvt Ltd",
  "summary": "",
  "published": "Mon, 17 Nov 2025 06:48:21 +0000",
  "url": "https://indianexpress.com/article/india/saudi-arabia-bus-accident-live-updates-hyderabad-umrah-pilgrims-10370083/",
  "source": "India | The Indian Express"
}