{
  "title": "‘Never, ever give up’: fighting for Afghanistan’s sporting future in shadow of the Taliban",
  "text": "“My message for all Afghan women who play is that if there is any small opportunity, do it,” Samira Asghari says. “My solid message is never, ever give up. Afghanistan was always a war-torn country, unfortunately. We have grown up in a war country. And we believe in a future Afghanistan, and the future of Afghanistan is the people.”\n\nAsghari is 31, the youngest member of the International Olympic Committee and an exile from her home. Resident in Europe, her role requires her to try to bring an end to current restrictions which prevent Afghan women and girls from taking part in sport. In this, the people she must negotiate with are the Taliban.\n\nThere are easier jobs, but Asghari argues that Afghans have long been accustomed to life being hard. “If you ask someone in the street if they are happy, they say: ‘It’s OK, nobody’s killing each other.’” But she argues the desire for reform in the country remains and is only growing, and she believes progress can be achieved before the next Olympic Games by concentrating on grassroots change.\n\n“Before 2028 and the Los Angeles Olympics, what I really hope for is to develop sports for schools, to invest in girls’ sports in Afghanistan.” Girls are now allowed to attend school until year six, she says, but the provision for sport – teachers, equipment – is scant. “My hope is that we could reach a negotiation point with the Taliban, to develop sport and the primary school for girls so at least tomorrow, the new generation, they understand what is basketball, what is football, what is taekwondo. That’s really my push.”\n\nSince December 2022, the IOC has been in “continuous dialogue” with Afghan sporting authorities under Taliban control, with the aim of “reversing the current restrictions” on participation. Asghari acknowledges that negotiating with the militant Islamic organisation, who took power in Afghanistan for a second time in 2021, is not always popular.\n\n“There are critics who ask why we should be talking to the Taliban in the first place, when they ignore human rights,” she says. “That’s the reality and, of course, we stand against the breach of human rights. But on the other hand, we can’t leave behind the daughters and the girls of Afghanistan. The Taliban are also human. I believe in more talks, I believe in communication, if we need to give something to achieve something, I think we should do that.”\n\nAsghari is speaking from Riyadh, where she is watching the Afghan team take part in the Islamic Solidarity Games (ISG), where 57 Muslim nations are competing against each other in 21 sports and two para-sports. Afghanistan has taken a team of 76 athletes, a far remove from the compromise of six that was agreed with the IOC for the Paris Olympics last year. The team largely comprises exiles, drawn from expatriate hubs in countries such as Iran, itself another hurdle. But with a historic first gold at the Games, after Mohammad Yousuf Jahangir won the men’s 70-75kg final in muay thai boxing, Asghari believes the ISG provides a platform for Afghan athletes that could be effective in sporting and political terms.\n\nView image in fullscreen Mohammad Yousuf Jahangir on his way to glory in Riyadh. Photograph: François Nel/Getty Images\n\n“The Games are unifying the neighbourhood,” she says, “and I believe that we really needed it. We should be united, because we are the ones who are the victims of different conflicts, underdeveloped countries are all in this region. These are also countries who need more competitions. Afghanistan, Iraq, Pakistan, they need more opportunity.”\n\nAsghari believes the Saudi-led body behind the games, the Islamic Solidarity Sports Association, could play a diplomatic role in the future. “One of my comments for Issa is that if they could speak to the Taliban, to show them the footprint of Saudi in the past, that they were very closed but now they are open in relation to the situation of women, I think it would be a good support.”\n\nAsghari is optimistic for the future of her country and about the prospects of generations to come. “I believe in the youth of Afghanistan.” As for hopes at the pinnacle of sport, she says the next Olympics should raise expectations among an expanded team. “I believe that until 2028 we should invest in our athletes to be stronger, to perform stronger, and not just to participate. That should be one goal, and another should be to support those who want to reach the Olympic Games, because we have potential outside [the system, often in exile]. I believe that if we invest properly and manage properly, it’s possible that we are stronger.”",
  "summary": "<p>Samira Asghari, the International Olympic Committee’s youngest member, says negotiation with Taliban is only way to help Afghan girls access sport</p><p>“My message for all Afghan women who play is that if there is any small opportunity, do it,” Samira Asghari says. “My solid message is never, ever give up. Afghanistan was always a war-torn country, unfortunately. We have grown up in a war country. And we believe in a future Afghanistan, and the future of Afghanistan is the people.”</p><p>Asghari is 31, the youngest member of the International Olympic Committee and an exile from her home. Resident in Europe, her role requires her to try to bring an end to current restrictions which prevent Afghan women and girls from taking part in sport. In this, the people she must negotiate with are the Taliban.</p> <a href=\"https://www.theguardian.com/sport/2025/nov/20/afghanistan-taliban-international-olympic-committee-samira-asghari\">Continue reading...</a>",
  "published": "Thu, 20 Nov 2025 11:29:23 GMT",
  "url": "https://www.theguardian.com/sport/2025/nov/20/afghanistan-taliban-international-olympic-committee-samira-asghari",
  "source": "The Guardian"
}