{
  "title": "Palestinians ‘squeezed’ as Israel moves beyond ‘yellow line’ in Gaza City",
  "text": "Move comes as Israeli attacks on bombarded enclave killed at least 32 Palestinians and wounded 88 others in 24 hours.\n\nDozens of Palestinian families are “besieged” in northern Gaza, local authorities say, as the Israeli military has repositioned its forces deeper into the enclave in violation of a United States-brokered ceasefire agreement.\n\nGaza’s Government Media Office said on Thursday that Israeli forces and tanks had advanced about 300 metres (984 feet) beyond the so-called “yellow line” in eastern Gaza City.\n\n“The fate of many of these families remains unknown amidst the shelling that targeted the area,” the office said, adding that the expansion of the yellow line shows a “blatant disregard” for the ceasefire deal.\n\nSet out in the agreement between Israel and Hamas, the yellow line refers to an unmarked boundary where the Israeli military repositioned itself when the deal came into effect last month.\n\nIt has allowed Israel, which routinely fires at Palestinians who approach the line, to retain control over more than half of the coastal territory.\n\nReporting from Gaza City on Thursday, Al Jazeera’s Hind Khoudary said Israeli soldiers were seen placing yellow blocks and signs to identify the new deployment line, deeper into the city’s eastern neighbourhood of Shujayea.\n\n“But the entire boundary has not been marked, so many Palestinians do not know exactly where it is,” Khoudary said.\n\n“With this latest advancement in Gaza City’s Shujayea, more Palestinians are unable to reach their homes. People say this is a cage, as they’re being pushed and squeezed into the western parts of Gaza.”\n\nThe Israeli military has not publicly commented on the reports that it has gone beyond the yellow line in violation of the ceasefire.\n\nAdvertisement\n\n‘When will this nightmare end?’\n\nThe move comes amid a surge in Israeli attacks across the Gaza Strip that have sown fear across the war-ravaged enclave.\n\nThe Palestinian Health Ministry in Gaza said on Thursday morning that at least 32 Palestinians were killed in Israeli attacks over the past 24 hours and another 88 were wounded.\n\nMedics said an Israeli air strike on a house in Bani Suheila, a town east of Khan Younis, killed three people, including a baby girl, and wounded 15 others.\n\nIsrael has violated the truce nearly 400 times since it came into force on October 10, according to an Al Jazeera analysis.\n\nA displaced Palestinian man, 36-year-old Mohammed Hamdouna, told the AFP news agency that people are being killed daily in continued shelling.\n\n“We are still living in tents. The cities are rubble, the crossings are still closed, and all the basic necessities of life are still lacking,” he said.\n\nLina Kuraz, a 33-year-old from the Tuffah neighbourhood east of Gaza City, also told AFP that she was worried about the full-blown war starting up again.\n\n“Every time we try to regain hope, the shelling starts again,” Kuraz said. “When will this nightmare end?”",
  "summary": "Move comes as Israeli attacks on bombarded enclave killed at least 32 Palestinians and wounded 88 others in 24 hours.",
  "published": "Thu, 20 Nov 2025 19:54:51 +0000",
  "url": "https://www.aljazeera.com/news/2025/11/20/palestinians-squeezed-as-israel-moves-beyond-yellow-line-in-gaza-city?traffic_source=rss",
  "source": "Al Jazeera – Breaking News, World News and Video from Al Jazeera"
}