{
  "title": "Kashmir is focus of arrests after Delhi car blast linked to ‘terror module’",
  "text": "Police have carried out raids and made several arrests across the Indian region of Kashmir in the aftermath of a car explosion in Delhi that left 13 people dead.\n\nOn Wednesday, the Indian government confirmed it was treating the blast as a “terror incident” perpetrated by “anti-national forces”. The explosion took place outside one of India’s most significant monuments during rush hour on Monday evening.\n\nInitially, eight people were confirmed dead, but the figure had risen to 13 by Friday as more victims succumbed to their injuries. It is one of the deadliest terror attacks to target India’s capital in more than a decade.\n\nNarendra Modi, the Indian prime minister, described the incident as a “conspiracy”, while his home minister, Amit Shah, vowed to “hunt down each and every culprit behind this incident”.\n\nAdding to the febrile atmosphere, at least seven people were killed and 27 injured on Friday night after an explosion at a police station in Srinagar, Kashmir’s main city. According to local media, a large pile of confiscated explosives detonated, killing police officers and members of the forensics team.\n\nThe authorities have yet to make any formal announcement about who they believe to be behind the Delhi attack. Unofficially, however, Indian investigators have said inquiries are continuing into “an interstate and transnational terror module” that was targeted by the police in the days before the explosion.\n\nAn investigation into the group began last month, after posters promoting the Pakistan-backed armed terror group Jaish-e-Mohammad appeared in Srinagar. The region has long been disputed by India and Pakistan, and since the 1990s the Indian-controlled south has faced a militant insurgency backed by Pakistan.\n\nSeven people were arrested as a result of the inquiries, including two Kashmiri doctors working in other Indian states. During a raid of one of the doctors’ homes in the city of Faridabad, in Haryana state, police said they had uncovered 2,900kg of explosive materials as well as chemicals, detonators and assault rifles, which they now believe were being readied for a multi-target attack.\n\nThough they have yet to directly link the group to the Delhi blast, police have described the network as a “white-collar ecosystem involving radicalised professionals and students in contact with foreign handlers operating from Pakistan and other countries”.\n\nThe day after the arrests, a white Hyundai car travelled from Haryana to central Delhi. After some time waiting in a car park in the bustling old quarter of the city, the driver pulled out into busy Monday evening traffic. Shortly after, the car exploded with huge force, throwing bodies into the air and setting surrounding cars and rickshaws alight.\n\nOn Tuesday, a case was registered under India’s anti-terror laws and the investigation was taken over by India’s National Investigation Agency, which oversees terror cases. Police in Kashmir have since ramped up their raids and arrests across the region.\n\nInvestigators have alleged that the car was being driven by another Kashmiri doctor from the village of Koil, 20 miles south of Srinagar. One of the doctors arrested the day before was also from Koil, and both were working at the same medical college in Faridabad.\n\nPeople in Koil described both men as accomplished doctors known for their impressive academic records, and expressed shock at the allegations against them. Their two families denied knowing one another.\n\nPolice arrived at the home of the alleged driver just hours after the blast, searching the premises, confiscating all mobile phones and detaining several family members for questioning. Despite not formally confirming the doctor’s involvement, by Friday morning the authorities had demolished his home in an apparent case of “bulldozer justice” – a widespread but illegal tactic used by the Indian authorities to punish those accused of crimes against the state.\n\nView image in fullscreen The remains of the alleged driver’s house, seemingly destroyed by ‘bulldozer justice’. Photograph: Farooq Khan/EPA\n\nAccording to Kashmir police, the seven people previously arrested in the terror network case had links with both Jaish-e-Mohammad and Ansar Ghazwat-ul-Hind, an Islamic State affiliate operating in Kashmir. This could not be verified by the Guardian.\n\nIndia’s response to the Delhi blast has been markedly restrained in contrast to the last terror attack that took place on its soil. When more than 20 Hindu tourists were shot dead in Pahalgam, Kashmir, in April, the Indian government blamed Pakistan and launched cross-border drone and missile strikes. Pakistan responded in kind, pushing the two countries to the brink of all-out war.\n\nIn the aftermath, the Indian government firmly stated that any more Pakistani terror attacks would be seen as an “act of war”. However, the more restrained language used this week by Modi’s cabinet is seen by some to reflect uncertainty over who may have been behind the latest attack and the alleged wider terror plot.\n\nPolice in Kashmir said they remained “on high alert to prevent further incidents”. A senior officer added: “Multiple agencies have conducted raids to disrupt terrorist activities. Investigation is ongoing, and we are monitoring all suspicious activity closely.”",
  "summary": "<p>Investigators believe an explosion that killed 13 people may be linked to group operating in the disputed region</p><p>Police have carried out raids and made several arrests across the Indian region of Kashmir in the aftermath of a car explosion in Delhi that left 13 people dead.</p><p>On Wednesday, the Indian government confirmed it was <a href=\"https://www.theguardian.com/world/2025/nov/12/india-confirms-deadly-delhi-car-blast-being-treated-as-terror-incident-red-fort\">treating the blast as a “terror incident”</a> perpetrated by “anti-national forces”. The explosion took place <a href=\"https://www.theguardian.com/world/2025/nov/11/witnesses-describe-car-explosion-delhi\">outside one of India’s most significant monuments</a> during rush hour on Monday evening.</p> <a href=\"https://www.theguardian.com/world/2025/nov/14/kashmir-is-focus-of-arrests-after-delhi-car-blast-linked-to-terror-module\">Continue reading...</a>",
  "published": "Fri, 14 Nov 2025 23:43:51 GMT",
  "url": "https://www.theguardian.com/world/2025/nov/14/kashmir-is-focus-of-arrests-after-delhi-car-blast-linked-to-terror-module",
  "source": "World news | The Guardian"
}