{
  "title": "Cop30 conference centre evacuated as fire breaks out – as it happened",
  "text": "9h ago 20.42 GMT Day 10 of COP30 - in summary That brings us to a wrap on the live blog for Day 10. A fire erupted in the Blue Zone, dramatically pausing negotiations as delegates face fast-approaching deadlines to secure an agreement. With just days left, key and contentious items remain on the agenda, including financing and phasing off fossil fuels. 0:37 People evacuated from Cop30 venue after fire breaks out – video Here’s more of what we covered: Turkey clinched hosting duties for Cop31 but will be aided by Australia, which will lead the negotiations, a deal that ended a fierce stand-off between the two countries.\n\nA roadmap for the transition away from fossil fuels is appearing increasingly unlikely , with some sources hearing by midday on Thursday that the language had been removed from the draft text.\n\nDespite the excitement on Tuesday when 82 countries from across the globe came together to call for its inclusion – nearly half of all the nations at Cop30 – they represent just 7% of fossil fuel production and are unlikely to convince big producers.\n\nThere was a call for host country Brazil – along with all the other nations – to put a tax on meat and dairy , and use the revenue this generates to subsidise healthier plant-based foods.\n\nThe UN secretary-general, António Guterres, is in Belém to urge the world’s nations to find compromises in the final hours of Cop30 and deliver a deal to accelerate climate action: “We are down to the wire and the world is watching.”\n\nUS leaders weighed in from afar, both for and against participating in global climate agreements. The White House spokeswoman said that other countries are “lining up” to import American oil and gas. Meanwhile, Rhode Island Senator Sheldon Whitehouse, the lone federal representative to attend the summit, said: “Trump does not represent the United States…“He represents the fossil fuel industry and specifically, his big billionaire fossil fuel, donors, when it comes to climate matters”. Thanks for joining us today. As always, you can catch the latest news and analysis from the Guardian on COP30 here. Share\n\n9h ago 20.18 GMT Officials announced that the Cop30 venue will be closed until 8pm local time, Reuters reports. The fire has been contained and more than a dozen people were impacted by the smoke. No other injuries have been reported.\n\n\n\n“Thirteen individuals were treated on site for smoke inhalation. Their condition is being monitored, and appropriate medical support has been provided,” organizers said in a statement, that also said the fire was under control within 6 minutes. But the evacuations, while successful, where harrowing for those who were rushed from the smoking building.\n\n\n\n“I was in the Amazon Governor’s pavilion and then I saw people running towards me,” Nathaniel Mtunji, a Kenyan policy advisor for The Nature Conservancy, told my colleague Damian Carrington. “The fire was big and coming towards us, spreading along the roof.” The fire ignited in the pavilion area just after 2pm local time, its cause still under investigation. This is just one of many dangers that have plagued the summit venue, which has also been waterlogged by deluges of rain and baked in humidity and high temperatures. There has also been concern and criticism over security and the crackdown on protests. “Between the booths flooding and a fire breaking out in the Blue Zone, feels like maybe someone is trying to tell us something at Cop30,” climate journalist Amy Westervelt said in a post on Bluesky. Share Updated at 20.40 GMT\n\n10h ago 19.23 GMT Dharna Noor US legislators in the democratic party held a press conference today to speak about climate and the country’s missing leadership at COP30. From my colleague Dharna Noor: Donald Trump told the UN general assembly in September that the climate crisis was “the greatest con job ever perpetrated on the world. But he was “projecting,” said US speaker emerita Nancy Pelosi. “President Trump is the biggest con job in American history,” said Pelosi, who recently said she will retire at the end of her term, at a press conference convened by the Senate Committee on Environment and Public Works. Trump’s administration refused to send a delegation to the UN climate summit for the first time this year. The lone federal representative to attend the summit was Rhode Island Senator Sheldon Whitehouse, ranking member on the environment and public works committee. “Trump does not represent the United States” when it comes to climate action, the senator said at the presser. “He represents the fossil fuel industry and specifically, his big billionaire fossil fuel, donors, when it comes to climate matters,” Whitehouse said. “The United States is still very solid on climate action. He just has chosen to represent his crooked billionaire donors.” Whitehouse aimed to highlight Trump’s ties to big oil at the climate talks in Brazil, to which he made a short trip on Friday. The administration also refused him an official US badge for the conference, so he was forced to attend as part of a climate research nonprofit’s delegation.\n\n\n\nHouse Democratic Leader Hakeem Jeffries also spoke at the Thursday press conference. “It’s shameful that the Trump administration and the United States government chose not to be involved and engaged at the most recent cop conference, essentially ceding leadership on this issue in the world to our rival China,” he said. Speaker Emerita Nancy Pelosi said she wanted to “associate herself” with Jeffries remarks, noting that the first UN climate summit she attended was in Rio de Janeiro in 1992. “Our delegation in this was led by Senator Al Gore and while we were there, he made one of the most spectacular save the planet speeches you ever heard,” she said. After the speech, Gore was nowhere to be found because “he was called away by Bill Clinton to ask if he wanted to be vice president of the United States,” she added. Trump’s dismantling of public education, refusal to take on gun violence, and his environmental record mean he is uniquely bad for young people, Pelosi said. “Donald Trump is the worst president of the United States for America’s children, the worst president America’s children have ever had,” she said. Share Updated at 19.26 GMT\n\n11h ago 19.12 GMT Dharna Noor Countries are gathered at Cop30 to take on the climate crisis. But at the talks, Ahmed Abu Thaher is plagued by another concern: the atrocities taking place in his home of Palestine. “To continue the ceasefire in the Gaza Strip, and also to stop the Israeli settlers’ violations in the West Bank, this is the top priority,” said Abu Thaher, director of projects and international relations at Palestine’s Environment Quality Authority, who came to the talks from Ramallah. Over the last two years, Israel has killed at least 69,182 people in Gaza, according to Al Jazeera’s tracker, including nearly 300 since a ceasefire was declared on October 10. Settlers have also set fire to Palestinian homes, vehicles, and other property in several West Bank villages this month. The ecological impacts of the war in Gaza have been unprecedented, Abu Thaher said. “Unfortunately, it has not happened in the world before,” said Abu Thather. “80% infrastructure is demolished,” he added, citing UN estimates. All six of Gaza’s wastewater treatment plants have been damaged or destroyed by the conflict, he noted, so raw sewage exposure is causing a public health crisis. Electricity systems have also been taken out, with “even most of the solar panels” demolished. And UN estimates show “60 million tons of rubble has accumulated in the Gaza Strip,” noted Abu Thather, some 5 million of which could be contaminated with toxic asbestos. Advocates at Cop30 are drawing connections between the war in Gaza and climate action. At a major protest outside the summit on Saturday, many activists wore keffiyehs and chanted: “There is no climate justice without justice for Palestine.” Some are also calling for a fuel embargo on Israel. This year, some activists also demanded that Israel be removed from the UN’s climate body. “We cannot talk about ending fossil fuels while welcoming states and corporations that weaponize them for genocide,” said Ana Sánchez of the group Global Energy Embargo for Palestine, who backs both calls. Abu Thaher declined to comment on the activists’ demands. Civil society has also increasingly highlighted the emissions impact of militaries, which multilateral climate agreements do not require countries to track or report. Benjamin Neimark, a leading scholar of the climate effects of defense departments, has long pushed for the issue to be placed on a formal Cop agenda. “We’ve been banging the drum since Cop26 in Glasgow that the United Nations framework on climate change needs to mandate transparent reporting of military emissions from states,” he said at Cop30. “We cannot make cuts to military emissions without adequate baselines, and we don’t have those baselines because we don’t have transparent and comprehensive reporting.” Abu Thaher agreed that the lack of reporting is a problem, and said he “of course” supports the call for the UN to require it. This year, the Guardian covered a study that Neimark co-authored which found emissions from first 15 months of the Gaza war exceed those of a hundred individual countries. Carbon footprint of Israel’s war on Gaza exceeds that of many entire countries Read more “But there is no certain study that confirms this,” said Abu Thaher. “These are still estimates.” Israel should not be able to brand itself as a climate leader while its airstrikes are destroying Gaza’s environment, said Patrick Bigger, research director at nonprofit Climate and Community Institute and another co-author of the recent estimate. “How are you possibly supposed to become more climate resilient if you’re a person in Gaza when 80% of the buildings are rubble,” he asked. Emissions reporting requirements would not likely deter countries from perpetrating conflict, said. But it is still important to tally up the climate impacts of militaries, he said. “If that makes a climate-focused person sort of perk up their ears a little bit and think about genocide in a new way, that’s good,” he said. “That is increasingly the case.” He hopes the new venture Transition Security Project, which his nonprofit co-launched with the group Common Wealth, can help people draw those connections. Ahead of Cop30, Brazilian president Luiz Inácio Lula da Silva called for world leaders to face harsh realities, saying: “Cop30 will be the Cop of truth.” That should require reckoning with the war in Gaza, Abu Thaher said. “We must take the present situation into consideration absolutely as a truth,” he said. “We have occupation, we have settlers, we have wars.” Though there is “unfortunately not so much” discussion in Cop30 negotiations, he said, ignoring these issues will not only harm his home but also hamper climate progress. Though the “situation in Palestine is more bad than others,” he said, “the truth is, we are one globe,” said Abu Thaher. Share\n\n11h ago 18.50 GMT In the wake of the fire, the premises has been returned to local authority and is no longer considered a Blue Zone, according to an update from the UNFCCC. The fire chief has ordered a full evacuation of the venue, but will provide an update around 4pm local time. Meanwhile, reactions to the unexpected emergency have continued to roll in. Mohamed Adow, director of think tank Power Shift Africa said in a statement issued to the Guardian that what could have been a traumatic event was handled well and speaks to the possibility of collaboration. “Even in a moment of chaos, one thing stood out: people from every corner of the world, different nations, creeds and affiliations, looked out for one another,” he said. “When faced with a crisis, cooperation wasn’t a slogan, but a human instinct in its rawest, truest form.” He connected the sentiments as an example of how to move through the ongoing negotiations: “That spirit is precisely what climate action demands. The climate crisis doesn’t care for our borders or diplomatic dramas. It requires the same urgency, solidarity and shared purpose we saw today, minus the flames, ideally. If we can respond to the planet’s emergencies with the same unity shown in that tense moment, COP30 might yet be remembered not for an incident, but for a turning point.” Share Updated at 18.55 GMT\n\n11h ago 18.33 GMT Damian Carrington Talks are still on pause but earlier today, my colleague Damian Carrington wrote about how conservative nations - from the Vatican to Iran – are pushing to narrow the definition of gender at Cop30: The move is aimed at excluding trans and non-binary people and threatens to increase the difficulty of already tortuous negotiations, AFP reports. The effort uses footnotes in key texts to attach country-specific interpretations. Paraguay, Argentina, Iran, Indonesia, Malaysia as well as the Vatican have so far entered footnotes into the draft Gender Action Plan (GAP) meant to guide work for the next decade. Similar footnotes have also appeared in a text related to the “just transition” – the framework to shift to environmentally sustainable economies without leaving workers and communities behind. The Vatican, for example, says it understands gender as “grounded on the biological sexual identity that is male and female.” “We do not agree at all with what some countries are putting in the agenda footnotes,” Alicia Barcena, Mexico’s secretary of environment, told AFP. “We feel we are going backwards – we should never go backwards.” “If every Party could footnote core terms like finance, ambition or equity, we would have no negotiation left – only fragmentation. Gender equality is an agreed principle under this Convention – it needs no qualification,” said Bridget Burns, executive director of the Women’s Environment and Development Organization. The issue has become so sensitive that Cop30’s Brazilian presidency has elevated it from technical negotiations to a higher political level, where ministers are now trying to hash out a compromise. You can read more on the issue in Chloe Farand’s story for the Guardian. Share\n\n12h ago 18.05 GMT After dozens of firefighters battled the Cop30 blaze it has been contained, according to Brazil’s tourism minister, Celso Sabino, speaking to a local news channel. Forensic teams will try to establish how the fire started but he said he doubts it was criminal. “You’d have to be a really awful person to set fire to a Cop,” he tells reporters. Officials are also reporting that there were no injuries from the fire and that everyone was safely evacuated. The building has taken some damage, however, and it will be several hours before attendees will be allowed back in. The fire has added even more urgency to deliberations as time ticks down to come to agreement – but it has also brought the issues themselves into sharper focus. “The tragic fire at COP30, which has derailed UN Climate Conference, the People’s Plenary, and obstructed the negotiations is unfortunately a potent metaphor,” US-based activist Jes Vesconte said, speaking with my colleague Dharna Noor. “As capitalist fossil fuel companies, imperialist countries, and militarist powers block the talks here (or in abstentia in the case of the US) — they are putting profits over planet and people, profiteering off ecocide, genocide and countless deaths, at the expense of all life on Earth, and pouring fuel on the fire of the burning planet.” Share Updated at 18.07 GMT\n\n12h ago 17.54 GMT Oliver Milman While we wait for more information about the status of the fire – and the negotiations it disrupted – my colleague Oliver Milman has an update on just how absent the US is from the summit: Some negotiators at Cop30 have feared a late intervention from Donald Trump, even though the US hasn’t sent a delegation to Belem – a first for America in this era of annual climate summits. Instead, the Trump administration has sought to studiously ignore Cop30 and during the conference has pushed ahead with its pro-fossil fuel agenda in the US, tearing down limits placed upon drilling and mining in Alaska and weakening endangered species and clean water rules that industry finds irksome. Asked by the Guardian for its take on the negotiations, which have included a demand for a phaseout of fossil fuels that Trump would surely balk at, a White House spokeswoman said that other countries are “lining up” to import American oil and gas. “The president has set a strong example for the rest of the world by reversing course on the green energy scam and unleashing our natural resources, like beautiful, clean coal and natural gas, to strengthen our grid stability and lower energy costs,” she said. “President Trump has been clear: he will not jeopardize our country’s economic and national security to pursue vague climate goals that are killing other countries.” Trump, then, may well be the phantom that haunts this Cop, as depicted in a rather grotesque statue placed in front of the venue by the artist Jens Galschiøt, rather than one that actively shapes it.\n\n\n\nMost countries have steered clear of criticizing the US’ absence, bar one brave Tuvaluan, and the lack of Trump should, many think, remove a hefty barrier to the negotiations. As Christiana Figueres, the former UN climate chief, said last week when asked about the Trump administration’s no-show: “Ciao, bambino!’ Share\n\n12h ago 17.46 GMT So far there isn’t any information on what sparked the fire but emergency crews are working to contain the flames. Rains have started which may aid in their efforts. Power was cut to the buildings as a precaution. Some delegates have been allowed back into their darkened offices, but the venue is largely under evacuation. The fire erupted in a pavilion, an area of spaces hosted by each country where they can have private meetings and offices away from official negotiating rooms. The area is part of the sprawling Blue Zone, inaccessible to the public. Share\n\n12h ago 17.21 GMT A fire has ignited forcing evacuations 0:37 People evacuated from Cop30 venue after fire breaks out – video A fire has broken out in the Blue Zone. Videos posted on online showed flames billowing from pavilion as security personnel blew whistles and called for evacuations. Fire inside COP30 venue in Belem Brazil . Building being evacuated pic.twitter.com/O5zGJGCyuN — Catherine Ellis (@Cat_lucy1) November 20, 2025 #COP30 is on fire pic.twitter.com/VWAIhjVrqm — Mike Szabo / @szabotage.bsky.social (@MikeSzaboCP) November 20, 2025 In areas farther from the fire, alarms disrupted afternoon discussions as attendees were asked to leave the venue. Smoke could be seen wafting from the temporary structures by throngs of people who evacuated outside. Fire trucks have arrived on scene. This is a breaking story and we will share more as we have it. Share Updated at 18.44 GMT\n\n13h ago 16.56 GMT Gabrielle Canon here, taking over for Ajit to take you through the second half of day 10. Let’s start with a quick recap of where things stand: The summit started with 121 agenda items on the table, according to Carbon Brief, which has hosted a live tracker of what’s been agreed, drafted, or postponed. The breakdown currently shows 51 items done, 38 in drafts, and 4 with informal text, and 10 still in the red – a number that’s persisted since Monday. The days left are winding down to check off these agenda items, which include some of the most challenging issues to reach consensus. Among the biggest questions is whether a fossil fuels roadmap that will help implement a phaseout and a just transition will make the cut. Ministers are also hoping to work out financing and who will put up the finds to ensure the most impacted nations don’t continue to bear the brunt of the climate crisis. New draft text is expected tonight. Share Updated at 17.14 GMT\n\n13h ago 16.28 GMT US President Donald Trump may have snubbed Belém and the UN climate process, but my colleague Fiona Harvey has spotted him in the form of a statue outside the venue. View image in fullscreen A statue of an artwork depicting Donald Trump at Cop30 in Belem, Brazil. Photograph: Fiona Harvey/The Guardian Titled “The Orange Plague”, the statue claims to depict US President Donald Trump as a self-proclaimed king of justice, sitting atop a frail man as he wields a golf club next to an Earth-shaped golf ball. The sculpture by Jens Galschiøt seeks to “highlight America’s failure to share responsibility for Earth’s future.” The Danish artist, who has exhibited at climate summits dating back to 2002, is best known for his “Pillar of Shame” series of sculptures, which memorialise the loss of life during the 1989 Tiananmen Square Massacre in Beijing, China. View image in fullscreen Staff taking down “Pillar of Shame” that was defaced with black paint in front of Chiang Kai-shek Memorial Hall, in Taipei, Taiwan in 2022. Photograph: Ann Wang/Reuters It’s unclear how long the statue will last in Belém. Share\n\n14h ago 16.10 GMT Next year’s Cop is set to take place in a stunning resort city on the Mediterranean - a tourist magnet that boasts a rich history stretching back to the empires of ancient Greece and Rome. But in recent years, the weight of the climate crisis has borne down on Antalya. The southern Turkish city and surrounding province of the same name have been plagued in recent years by horrific fires and severe floods. View image in fullscreen Cars wade through flooded roads after heavy rains in Antalya, Turkey, in 2024. Photograph: Anadolu/Getty Images View image in fullscreen Wildfires in a forested area in Alanya district of Antalya, Turkey, in 2025. Photograph: Anadolu/Getty Images View image in fullscreen People running away from the fire-devastated Sirtkoy village, near Manavgat, Antalya, Turkey. Photograph: AP View image in fullscreen Dark smoke drifting over a hotel complex during a forest fire near the town of Manavgat, Antalya, on July 29, 2021. Photograph: Ilyas Akengin/AFP/Getty Images Like other countries on the Mediterranean, Turkey is no strange to violent weather made stronger by carbon pollution. A World Weather Attribution analysis this summer found weather conditions leading to deadly wildfires in July in Turkey, Cyprus and Greece were made 10 times more likely due to climate change. Share",
  "summary": "<p>UN secretary-general António Guterres earlier used speech at Belem summit to urge countries to find compromises in final hours of negotiations</p><p>Inside the halls of Cop30 you see people from all around the world, and it can be easy to forget that there are many people who remain unrepresented.</p><p>On Thursday morning, Magne Tony was standing with compatriots from French Guiana outside the entrance to the conference centre, trying to push pieces of paper into the hands of arriving delegates and observers headed: “Our Amazon is dying”.</p><p>The main problem is that France are in 9,000 kilometres from Amazonia, from South America, and they’re taking decisions. [But] they don’t really know what is the problem really. They’re taking the decisions from their own mind and the problem is that they’re far from reality.</p><p>That’s why we decided to alert the people in the world about [our] problems: water coming up, getting enough to eat, more heat – in some parts of French Guiana, people don’t have water.</p><p>These crises, a consequence of Western capitalist madness, primarily affect the most vulnerable: women and communities dependent on forests and rivers. But they also concern all of humanity: French Guiana is part of the Amazon, a regulator of the global climate and essential to planetary balance.</p><p>We remind you that French Guiana is the last colony in South America without self-determination. We will not be able to protect our environment or guarantee our food and energy self-sufficiency, essential for our collective survival, as long as decisions are made in Paris without consulting the affected communities or taking into account local specificities.</p> <a href=\"https://www.theguardian.com/environment/live/2025/nov/20/cop30-live-news-updates-belem-brazil-president-lula\">Continue reading...</a>",
  "published": "Thu, 20 Nov 2025 20:42:40 GMT",
  "url": "https://www.theguardian.com/environment/live/2025/nov/20/cop30-live-news-updates-belem-brazil-president-lula",
  "source": "World news | The Guardian"
}