{
  "title": "Some migrants to face 20 year wait for settled status",
  "text": "Some migrants to face 20 year wait for settled status\n\n12 hours ago Share Save Harry Farley, Political correspondent and Sam Francis, Political reporter Share Save\n\nReuters\n\nMigrants who are in the UK legally could have to wait up to 20 years before they can settle permanently, under government proposals. The Home Secretary Shabana Mahmood has announced the qualifying period for indefinite leave to remain will be extended from five to 10 years, and will apply to the estimated 2.6 million who arrived since 2021. The changes will not apply to people who had already obtained settlement. Mahmood said becoming part of the UK was \"not a right but a privilege - and one that must be earned\". The package is the latest in a string of changes to the immigration system announced by Mahmood over the past week.\n\nSettlement, also known as Indefinite Leave to Remain (ILR), allows someone to live in the UK permanently, work without restrictions and access public services. It is also a key step towards British citizenship. Currently, most work and family visa holders can apply for settlement after five years. Under the proposed changes the standard wait will be 10 years - with a range of criteria that would lengthen or shorten that period. Legal migrants who claim benefits for less than 12 months will have to wait 15 years\n\nPeople who arrived on post-Brexit health and social care visas would have to wait 15 years, up from five year currently\n\nMigrants reliant on benefits for more than 12 months face a 20-year wait for settlement, four times more than the current period and the longest in Europe There is also a reduction to three years for applicants who earn £125,140 in the three years prior to applying for settlement, with this reduced to five years for anyone earning £50,270. Time spent volunteering and competency in the English language are also factors which could reduce the wait. Announcing the changes in the Commons, Mahmood said: \"Migration will always be a vital part of Britain's story. \"But the scale of arrivals in recent years has been unprecedented.\"\n\nConservative shadow home secretary Chris Philp accused Labour of \"copying and pasting\" policies from his party that it had previously \"voted against\". Philp said his part would support the changes, but warned the new system could create loopholes and urged ministers to adopt a migration cap. Reform UK did not respond to the statement in the Commons. But the party has previously announced it would abolish ILR - replacing it with visas that migrants must reapply for every five years. That includes hundreds of thousands of migrants currently in the UK.\n\nHome Office figures show net migration added 2.6 million people to UK population between 2021 and 2024. Because of this, settlement grants are also expected to spike over the next five years, with around 1.6 million people forecast to settle between 2026 and 2030. Ministers plan to introduce an \"earned settlement\" system, requiring migrants to demonstrate social integration, economic contribution and good \"character\" before being granted settled status. Applicants will need to meet stricter minimum requirements including the equivalent to A-level standard English language, a clean criminal record and earning above £12,570 a year for at least three years. There will be accelerated routes for those who make an \"outsized contribution\" to the UK. Doctors and nurses working in the NHS will be able to settle after five years. The \"brightest and best\" international talent could have settlement fast-tracked, with high earners and entrepreneurs able to stay after just three years. Family members will not gain automatic status when the main applicant qualifies. Children who came to the UK under the age of 18 may settle with parents, but older dependants could face separate requirements. Existing fast-track routes for victims of domestic abuse, bereaved partners and resettled refugees will remain.\n\nPublic service union Unison said the changes would be \"devastating to thousands of essential workers\" and put services at risk. Christina McAnea, Unison's general secretary, said: \"Forcing staff, many of whom stepped up during Covid, to wait 15 years for certainty about their futures betrays the promises they were made.\" Ms McAnea warned the government not to \"overlook the care workers, nursing assistants and school support staff from overseas\" as without them \"care services would collapse\".\n\nThe changes build on measures first set out in the government's May white paper. The government plan to roll out changes from spring 2026, after a consultation ends on 12 February. On Monday, Mahmood announced a sweeping overhaul of the UK's asylum system – including plans to end permanent refugee status and replace it with temporary status subject to review every 30 months.",
  "summary": "Shabana Mahmood says becoming part of the UK is \"not a right but a privilege – and one that must be earned\".",
  "published": "Thu, 20 Nov 2025 17:36:36 GMT",
  "url": "https://www.bbc.com/news/articles/c3w9wlney23o?at_medium=RSS&at_campaign=rss",
  "source": "BBC News"
}