{
  "title": "Massive hidden waves are rapidly melting Greenland’s glaciers",
  "text": "Iceberg calving happens when large pieces of ice split from the front of a glacier and fall into the ocean. This natural event is a major contributor to the rapid reduction of ice on the Greenland ice sheet. For the first time, an international team led by the University of Zurich (UZH) and the University of Washington (UW) has used fiber-optic technology to track how the impact of falling ice, along with the movement of the released ice, causes glacial meltwater to mix with warmer seawater below the surface.\n\n\"The warmer water increases seawater-induced melt erosion and eats away at the base of the vertical wall of ice at the glacier's edge. This, in turn, amplifies glacier calving and the associated mass loss from ice sheets,\" explains Andreas Vieli, a professor in UZH's Department of Geography and co-author of the research. Vieli leads the Cryosphere cluster, one of six groups in the international GreenFjord project in southern Greenland, supported by the Swiss Polar Institute. The team's discovery about how ice and seawater interact was highlighted on the cover of Nature.\n\nWave measurements using fiber-optic cable on seafloor\n\nDuring the GreenFjord project, researchers from UZH, UW and several Swiss partners carried out an extensive field campaign to study calving behavior. They placed a ten-kilometer-long fiber-optic cable on the seafloor across the fjord in front of the Eqalorutsit Kangilliit Sermiat glacier. This fast-moving glacier in southern Greenland releases about 3.6 km3 of ice into the ocean each year, which is almost three times the annual volume of the Rhône glacier near the Furka mountain pass in Switzerland.\n\nThe research team relied on Distributed Acoustic Sensing (DAS), a method that detects tiny vibrations along the cable caused by events such as newly formed crevasses, falling ice blocks, ocean waves or temperature changes. \"This enables us to measure the many different types of waves that are generated after icebergs break off,\" says lead author Dominik Gräff, a UW postdoctoral researcher affiliated with ETH Zurich.\n\nUnderwater waves amplify glacier melt and erosion\n\nAfter an iceberg crashes into the water, surface waves called calving-induced tsunamis sweep across the fjord and mix the upper water layers. Because seawater in Greenland's fjords is warmer and denser than meltwater, it sinks toward the deeper layers.\n\nThe team also detected another type of wave that continues to move between density layers long after the surface becomes calm. These internal underwater waves, which can reach heights comparable to skyscrapers, cannot be seen from above but keep mixing the water for extended periods. This ongoing movement brings warm water upward, increasing melting and erosion at the glacier's edge and promoting further calving. \"The fiber-optic cable allowed us to measure this incredible calving multiplier effect, which wasn't possible before,\" says Gräff. The data gathered will support future efforts to document calving events and better understand the rapid decline of ice sheets.\n\nA fragile and threatened system\n\nScientists have long known that interactions between seawater and calving play an important role in glacier retreat, but collecting detailed measurements in the field has been extremely difficult. Fjords filled with icebergs present constant hazards from falling ice, and satellite observations cannot capture what happens below the surface where these interactions occur. \"Our previous measurements have often merely scratched the surface, so a new approach was needed,\" says Andreas Vieli.\n\nThe Greenland ice sheet covers an area around 40 times larger than Switzerland. If it were to melt completely, global sea levels would rise by about seven meters. The large volumes of meltwater flowing from shrinking glaciers can also disrupt major ocean currents such as the Gulf Stream, with significant consequences for Europe's climate. The retreat of calving glaciers further affects the ecosystems within Greenland's fjords. \"Our entire Earth system depends, at least in part, on these ice sheets. It's a fragile system that could collapse if temperatures rise too high,\" warns Dominik Gräff.",
  "summary": "Researchers in Greenland used a 10-kilometer fiber-optic cable to track how iceberg calving stirs up warm seawater. The resulting surface tsunamis and massive hidden underwater waves intensify melting at the glacier face. This powerful mixing effect accelerates ice loss far more than previously understood. The work highlights how fragile the Greenland ice system has become as temperatures rise.",
  "published": "Fri, 14 Nov 2025 03:35:45 EST",
  "url": "https://www.sciencedaily.com/releases/2025/11/251113071623.htm",
  "source": "All Top News -- ScienceDaily"
}