{
  "title": "I won't be silenced, says French anti-drugs activist after murders of two brothers",
  "text": "I won't be silenced, says French anti-drugs activist after murders of two brothers\n\n2 days ago Share Save Hugh Schofield Paris Share Save\n\nNICOLAS TUCAT/AFP via Getty Images Amine Kessaci was 17 when his first brother was killed - now he has lost another\n\nA prominent French anti-drugs campaigner whose brother was killed by drugs criminals last week, five years after the murder of his elder brother, has vowed to stand up to intimidation and \"keep telling the truth about drugs violence\". Amine Kessaci, 22, was writing in Le Monde newspaper a day after the funeral of his younger brother Mehdi, whose murder last week has been described by the government as a turning-point in France's drugs wars. \"Yesterday I lost my brother. Today I speak out,\" he wrote in his opinion piece. \"[The drugs-traffickers] strike at us in order to break, to tame, to subdue. They want to wipe out any resistance, to break any free spirit, to kill in the egg any embryo of revolt.\"\n\nMehdi Kessaci, 20, was shot dead last Wednesday as he parked his car in central Marseille in what appears to have been a warning or punishment aimed at his older brother, Amine, from the city's drugs gangs. Speaking after a ministerial meeting on drugs crime at the Elysée palace on Tuesday, Interior Minister Laurent Nuñez said: \"We all agreed that this premeditated murder was something totally new. It's clearly a crime of intimidation. It's a new level of violence.\" Mehdi was the second Kessaci brother to be killed by drugs criminals. In 2020 the body of Brahim Kessaci, then 22, was found in a burnt-out car. That murder prompted Amine to launch his association, Conscience, which aims to expose the damage to working-class communities caused by gangs. Marseille is renowned for worsening drugs wars, and Amine Kessaci recently wrote a book called Marseille Wipe your Tears – Life and Death in a Land of Drugs.\n\nAFP via Getty Images Mehdi Kessaci, giving an interview last year at an event for his brother\n\nIn his Le Monde article, Amine revealed he was recently warned by police to leave Marseille because of threats to his life. He attended his younger brother's funeral wearing a bullet-proof jacket and under heavy police protection. \"I speak because I have no choice but to fight if I don't want to die. I speak because I know that silence is the refuge of our enemies,\" he wrote, urging courage from citizens, and action from the government. Mehdi Kessaci's murder has brought the national spotlight back on a drugs trafficking problem that French experts and ministers agree is reaching almost unmanageable proportions. According to Senate member Étienne Blanc, author of a recent study, turnover in the drugs trade in France is now €7bn (£6bn) – or 70% of the entire budget of the justice ministry. He said around 250,000 people drew a living from the trade in France – more than the entire number of police and gendarmes, which is 230,000. According to Le Monde, the country counts 1.1 million users of cocaine.\n\nPresident Emmanuel Macron on Wednesday launched a broadside against such consumers, telling the weekly cabinet meeting that \"sometimes it is the city-centre bourgeoisie that is funding the traffickers\". Macron had called a special drugs summit the day before in response to Mehdi's murder and in order to review progress on a new anti-drugs law that was passed in June. It sets up a special prosecutor's office dedicated to organised crime - similar to the office that tackles terrorism - which will eventually have 30 specialised magistrates. Under the law, senior drugs convicts are made to serve their terms in isolation in a specially converted prison where it is hoped it will be harder to continue running operations from behind bars. According to Laurent Nuñez, there is evidence that the crackdown on drugs crime is having an effect - with the number of homicides in Marseille down from 49 in 2023 to 24 in 2024. The number of dealing points in the city had halved from 160 to 80, he added. \"The war is not won, but we do have results.\"\n\nALAIN JOCARD/AFP via Getty Images Members of Parliament stand to pay tribute to Mehdi Kessaci on 13 November",
  "summary": "Drugs gangs have a grip on Marseille, but Amine Kessaci says he has \"no choice but to fight\" after the violent deaths of his brothers.",
  "published": "Wed, 19 Nov 2025 16:54:37 GMT",
  "url": "https://www.bbc.com/news/articles/cz6n6j0d3xpo?at_medium=RSS&at_campaign=rss",
  "source": "BBC News"
}