{
  "title": "Oklahoma's anthracite alternates headline top college football uniforms for Week 13",
  "text": "SEC Now's Fozzy Whittaker and Matt Stinchcomb discuss Ahmad Hardy and the Tigers' incredible run game as they square off against one of the best run defenses in the Sooners. (2:36)\n\nOpen Extended Reactions\n\nOn paper, Week 13 in college football doesn't appear to be packed with the most exciting matchups. As schools gear up for the traditional rivalry week during the Thanksgiving break, this week features just two games between top-25-ranked teams.\n\nBut that doesn't mean teams will stop bringing the heat with their uniforms.\n\nTake No. 8 Oklahoma, who will host No. 22 Missouri on Saturday in one of Saturday's top games and are in the hunt to host a College Football Playoff game with an 8-2 record.\n\nWith a playoff berth in sight, Oklahoma will sport a distinct set of alternate threads, ditching the school's iconic crimson and cream palette for an anthracite look.\n\nThe school's \"Unity\" alternates have been worn for one game each season under coach Brent Venables (Oklahoma boasts a 3-0 record in said games), with the uniforms' defining features being the anthracite-heavy color scheme and \"Unity\" on the back of every jersey in place of traditional nameplates.\n\nWeek 13 vs. Missouri\n\n\n\n📍 Norman\n\n🕚 11 AM CT\n\n📺 ABC pic.twitter.com/VLti3BT454 — Oklahoma Football (@OU_Football) November 17, 2025\n\nThe Sooners won't be the only team sporting memorable threads this weekend. Here are the top uniforms from around college football in Week 13.\n\nNo. 12 in the most recent College Football Playoff rankings, Utah enters the final two weeks of the season on a three-game win streak with an outside shot to finish in the final field.\n\nHaving reeled off three consecutive wins, the Utes are hoping to keep their momentum going against Kansas State -- and will look to do so in style. Utah is pulling out its all-black uniforms for the occasion, which features bright red numbers and accents that pop against the dark background.\n\nAnother team playing in one of Week 13's biggest games is Oregon, which plays host to a resurgent USC squad looking to make some noise of its own in the playoff race. The Ducks are known to bring the heat with their seemingly endless array of uniform combinations, and this weekend will be no different.\n\nOregon also is going for a darker theme, mixing a black base with metallic steel accents and numbers with a green helmet. The most distinct detail for this particular Ducks jersey comes on the sleeves, where a diamond-plating pattern offers a throwback to Oregon's 2005 uniforms.\n\nSome of college football's most underrated uniform combinations belong to UTEP, and their offerings this week fit that notion.\n\nThe Miners' unique orange, light blue and white color palette makes the jersey a treat, but the real prize of UTEP's looks comes on the helmet. The bright orange lids feature an old-school cartoon miner motif on each side of a center stripe, carrying a pickaxe in one hand and a football in the other.\n\nUTEP isn't the only school making waves with its helmet game this weekend, though -- UTSA is stepping up, too.\n\nThe Roadrunners' lids make no bones about representing UTSA's local ties, representing both the school's state and city. The helmet's design includes the number \"210\" -- the main area code for the city of San Antonio -- inside a Texas state outline and above a star representing San Antonio's location.\n\nFresno State will take the field for its \"Ag Fest\" game on Saturday in a unique uniform that pays homage to local industry.\n\nWhile white jerseys aren't anything new to the Bulldogs, the secondary color for their threads stands out: green. The uniforms are meant to represent the agricultural roots of California's Central Valley region, with the helmet design featuring a green \"V\" logo that nods to the school's location.",
  "summary": "Oklahoma will ditch their usual crimson and cream color palette for just this week, donning their anthracite \"Unity\" alternates against Missouri.",
  "published": "Thu, 20 Nov 2025 16:04:14 EST",
  "url": "https://www.espn.com/college-football/story/_/id/47038176/college-football-week-13-best-uniforms",
  "source": "www.espn.com - TOP"
}