{
  "title": "10 Best Early Black Friday Deals at Best Buy (2025)",
  "text": "Whether you like it or not, Black Friday is next week. The holiday shopping season is upon us, and it's when some of the best deals of the year make their appearance. Ahead of Black Friday, Best Buy has been offering some really solid tech deals on some of our favorite products we've tested and reviewed, ranging from laptops and gaming mice to cordless vacuums. So, whether you're shopping for the perfect gift for that tech lover in your life or if you've been waiting all year for prices to drop on something for yourself, there are a few great options below.\n\nFor more great discounts, check out our Best Early Black Friday Deals roundup and all of our deals coverage here.\n\nThe Latest MacBook Pro\n\nThe M5 MacBook Pro (8/10, WIRED Recommends) is only a month old, and it's already on sale. It's the only Mac so far to get the bump to the latest M5 chip, benefiting from improved performance all around. In my testing, there was a significant step forward everywhere you looked, including the GPU, the CPU, and the Neural Engine for AI tasks. It's the GPU that's seen the biggest leap, though, which should speed up both gaming and creative applications. Other than that, this is the same MacBook Pro you probably already know and love, with its bright mini-LED screen, robust speakers, and extra ports (over the MacBook Air, at least).\n\nThis base 14-inch model doesn't have the incredible value of the MacBook Air or the powerhouse performance of the M4 Pro and M4 Max MacBook Pro. Ultimately, when it comes to which MacBook you should buy, the answer is still the Air. But the M5 versions of these laptops aren't coming until next year, so if you're after the latest Apple Silicon in one of the best laptops you can buy, this deal on the M5 MacBook Pro is solid.\n\nThe Best Bluetooth Speaker\n\nThe JBL Flip 7 (9/10, WIRED Recommends) is a Bluetooth speaker that has it all. As our A/V reviewer Ryan Waniata says, “JBL's Flip strikes the perfect compromise between mobility and sound quality, offering clean detail with plenty of punch.” Waniata also praises the durability of the Flip 7, which is important in a Bluetooth speaker meant to be used outdoors. There are tons of different color options to match your vibe, and it gets up to 16 hours of battery life. The increased water resistance means it'll bring the party to wherever you need it. Put simply, it's the best Bluetooth speaker you can buy, and it's at a great price.\n\nOur Favorite Dyson Vacuum\n\nEveryone wants a cordless Dyson vacuum, but they tend to be exorbitantly expensive. It's still not cheap, but at $300 off, this is as good a deal as we've seen on this vacuum. The V15 Detect is our vacuum expert's favorite Dyson. In her testing, Nena Farrell says she was impressed by how much dust and dirt it sucked up from her carpet, as well as from hard floors. The V15 Detect also comes with an extra sensor that can actually count the number of dust particles. That's overkill for most people, but if you have severe allergies (or have friends or family that do), the Dyson V15 Detect can actually verify what you're picking up.\n\nThe Best TV Deal Right Now\n\nOLED TVs might be the best TVs you can buy, but if you're shopping for a TV under $1,000 like most people are, the TCL QM6K QLED (8/10, WIRED Recommends) is what you should be eyeing. It's a 4K mini-LED screen, and our TV reviewers call it “a versatile display that does just about everything well, from naturalistic colors to rich black levels and impressive clarity.” It's not the brightest TV in the world, but it does come with a 144-Hz refresh rate for gaming and a smart Google TV interface for your streaming needs. There are screen options ranging from 55 inches up to 98 inches, all of which are on sale ahead of Black Friday, with the happy-medium 65-inch model starting at $500.\n\nThe Best Phone Under $300\n\nNo one is calling the Moto G Stylus 5G the best phone in the world. In fact, our phone expert (and tech editor extraordinaire, Julian Chokkattu) recommends Nothing's Phone 3a as the better cheap phone. But the 2025 Moto G Stylus is not only the best Moto G phone you can buy, it also has a lot of high-end features, such as a large 6.7-inch AMOLED screen with a 120-Hz refresh rate. It even has a beautiful blue back, a built-in stylus, and a headphone jack. That's a lot of uncommon features in a remarkably cheap phone, especially at its discounted pre–Black Friday price.\n\nA Classy Gaming Laptop\n\nThe Razer Blade 14 (8/10, WIRED Recommends) is a gaming laptop. The RGB-backlit keyboard and green snakes logo on the lid give it away. But if not for those elements, you could easily mistake the Blade 14 for a true MacBook Pro rival made for content creators and pro users. It's around the same thickness as the MacBook Pro, despite the fact that it has a powerful discrete graphics card for gaming. That's what makes it such a great hybrid device that could work just as well for school and work as for late-night gaming.\n\nThe Razer Blade 14 didn't get a massive revamp in 2025, but the new model did make some tweaks. It now has an OLED panel, which is high-resolution (2880 x 1800) and color-accurate, and it sports a faster 120-Hz refresh rate. It's not the best gaming screen I've seen on a laptop, but again, it's a great comparison to the MacBook Pro. And for this price, it's a must-buy.\n\nThe Perfect Travel Partner\n\nThese earbuds came out a couple of years ago, but they remain some of the best you can buy. When they came out, Sony's fifth-generation of high-end wireless earbuds were trimmed down to around 25 percent smaller and 20 percent lighter than the previous generation. You also get two extra full charges from the case, for a total of up to 36 hours of listening. That all makes it the best pair of earbuds for traveling in particular. There's no compromise in noise canceling either. In fact, our A/V experts say the XM5 have “some of the most advanced functionality in terms of EQ, touch controls, and adaptive noise canceling available on the market.” They're $100 off the retail price ahead of Black Friday, which is the best discount we've ever seen on them.\n\nAn Incredible OLED Gaming Monitor\n\nSamsung makes some of the prettiest gaming monitors, especially in the past couple of years. Within its Odyssey lineup, there's now just about every size and form factor of monitor you can imagine. The Odyssey G6 (8/10, WIRED Recommends) is a 27-inch OLED with a resolution of 2560 x 1440 and a 360-Hz refresh rate, which should be great no matter what game you're playing. Want extreme frame rates for competitive shooters? You can drop the resolution to 1080p and explore the higher echelon of the 360-Hz refresh rate. For slower-paced single-player games, the 1440p resolution is crisp, and the OLED panel gets you gorgeous HDR in games. It's $250 off the full price ahead of Black Friday, down now to $650.\n\nA Dirt-Cheap Chromebook\n\nYou can't expect a laptop this cheap to be without compromises. But when it comes to budget Chromebooks, this is as good as it gets. It's a reasonably affordable and attractive laptop, with lots of ports, decent performance, and a comfortable keyboard. For a Chromebook, the specs aren't bad either, coming with 8 GB of RAM and 128 GB of storage. Unfortunately, the touchpad isn't the best, nor is the display. It's not bright enough, and the colors look off. For a laptop under $300, though, the CX14 should do the trick, especially for a student or a first-time laptop owner.\n\nA Gaming Mouse\n\nIf you play MMOs, you know how useful it is to map various actions to buttons on your keyboard or mouse. Well, this gaming mouse from Corsair gives you a ton of options to customize your gameplay. There are 12 reprogrammable side buttons, but the mouse also has a high 33,000-dpi optical sensor and 1,000-Hz polling for low input lag and high responsiveness. It can connect via a 2.4-GHz dongle instead of Bluetooth, too.\n\nPower up with unlimited access to WIRED. Get best-in-class reporting and exclusive subscriber content that's too important to ignore. Subscribe Today.",
  "summary": "The main event hasn’t started, but Best Buy has already rolled out great deals on our favorite tech of the year.",
  "published": "Thu, 20 Nov 2025 13:00:00 +0000",
  "url": "https://www.wired.com/story/early-black-friday-best-buy-deals/",
  "source": "WIRED"
}