{
  "title": "News Today Live Updates, 21 November | Pune on My Plate: How city’s newer South Indian restaurants have gone beyond idli, dosa to offer reimagined fare",
  "text": "News Today Live Updates: Get the latest news updates from India and all around the world. Stay updated with breaking news today.\n\nThe Enforcement Directorate has filed a supplementary prosecution complaint naming Robert Vadra, husband of Congress MP Priyanka Gandhi Vadra and son-in-law of Sonia Gandhi, as an accused in an alleged black money case linked to UK-based arms consultant Sanjay Bhandari. The prosecution complaint, which is akin to a chargesheet, was filed before a special court in the Rouse Avenue court complex on November 15 and will be heard on December 6.\n\nOne of three alleged foreign handlers linked to the doctors from Faridabad’s Al Falah Medical College, who are accused in the Red Fort blast-linked terror module, sent 42 videos on making bombs via encrypted apps to Muzammil Ahmad Ganai, one of the arrested doctors, investigators have told The Indian Express. Ganai was a colleague and associate of Umar Nabi, 36, who carried out a blast. The roles and identities of the handlers, who investigators believe helped the module build a bomb and nudged them on the path of a suicide attack, are now being scrutinised by security agencies for overlaps with incidents involving a similar modus operandi of do-it-yourself (DIY) bombings in India in recent times, said sources in Karnataka familiar with the Delhi probe.\n\nStory continues below this ad In order to comply with the European Union’s ban on import of petroleum products derived from Russian oil, private sector behemoth Reliance Industries (RIL) has stopped importing Russian crude into its export-oriented refinery. RIL operates the world’s largest single-location refining complex in Gujarat’s Jamnagar. The complex has two refineries, one of which is exclusively for fuel exports. RIL is India’s largest fuel exporter, as well as the country’s largest importer of Russian crude, accounting for around half of Russian oil flows to India. Disclaimer: This is an AI-generated live blog and has not been edited by Indian Express staff. Live Updates Nov 21, 2025 11:50 AM IST Pune News Live Updates | Pune on My Plate: How city’s newer South Indian restaurants have gone beyond idli, dosa to offer reimagined fare\n\nRead More Whether you are craving a classic Udupi breakfast or looking for a modern spin on the benne dosa, Pune now has something in store for everyone who can’t get enough of South Indian food. Nov 21, 2025 11:33 AM IST World News Live Updates | Trump and New York Mayor-elect Zohran Mamdani set White House meeting: What’s at stake?\n\nRead More Although previous New York mayors have taken part in broader White House gatherings, a one-on-one Oval Office meeting marks a notable departure from recent precedent. Nov 21, 2025 11:31 AM IST Chandigarh News Live Updates | Cross-border heroin supply network: ED files complaint against four to initiate money laundering prosecution\n\nRead More Interrogation led police to Lovepreet Singh, alias Lavi, a Ferozepur resident, who was arrested in a Ludhiana hotel. Nov 21, 2025 11:23 AM IST India News Live Updates | South India Weather, Politics LIVE updates: ED raids former MLA’s home; Ex-TDB chief arrested in Sabarimala gold theft case\n\nRead More Light to moderate rain may occur at a few places in Tamil Nadu, Puducherry and Karaikal on Friday (November 21), according to the IMD. Nov 21, 2025 11:22 AM IST Chandigarh News Live Updates | ‘Blaming Punjab farmers won’t resolve Delhi pollution; we’ll have to learn from China’\n\nRead More The Centre must also support us. Crop diversification is essential — not just for clean air but also to conserve groundwater. We cannot keep depleting our water resources for paddy. Nov 21, 2025 10:50 AM IST Kolkata News Live Updates | Earthquake in Kolkata: 5.2 quake in Bangladesh sends strong Tremors across Bengal\n\nRead More The quake, recorded at 04:38 UTC (around 10:08 am IST) at a shallow depth of 10 km, had its epicentre 13 km south-southwest of Narsingdi, Bangladesh. Nov 21, 2025 10:50 AM IST World News Live Updates | G20 summit in South Africa set to open without US as Trump announces boycott: 8 things to know\n\nRead More PM Modi will also present India’s perspective at the forum in line with its “vision of ‘Vasudhaiva Kutumbakam’ and ‘One earth, One Family and One future.’ Nov 21, 2025 10:48 AM IST India News Live Updates | Gold Today Rate, November 21: Check 18, 22 and 24 carat gold prices Chennai, Mumbai, Delhi, Kolkata and other cities\n\nRead More Today's 18, 22 and 24 Carat Gold Prices in Chennai, Bangalore, Hyderabad, Mumbai, Delhi: As of Friday, November 21, the price of gold in India today is is ₹12,448 per gram for 24 karat gold, ₹11,410 per gram for 22 karat gold and ₹9,336 per gram for 18 karat gold. Nov 21, 2025 10:48 AM IST Chandigarh News Live Updates | ‘Two-clinic cap for doctors will create space for quacks, illegal pregnancy termination centres’\n\nRead More Haryana health department, gynaecologists abortion restriction, MTP Act India, Haryana abortion rules, medical practitioners concerns, Haryana additional chief secretary Sudhir Rajpal, MTP centres regulation, abortion policy Haryana, quack abortions risk, sex ratio Haryana 2024, skewed sex ratio India, female foeticide crackdown, illegal abortions Haryana, gender determination surveillance, Panchkula gynaecologist quote, rural healthcare Haryana, safe abortion access India, women’s reproductive rights Haryana, Haryana government proposal, abortion law compliance India Nov 21, 2025 10:27 AM IST Chandigarh News Live Updates | MMC, IOCL sign MoU to set up compressed biogas plant for scientific waste processing\n\nRead More The MoU, signed at the MC Office, marks a significant push toward scientific waste processing, reducing landfill burden, and promoting renewable energy in the city. Nov 21, 2025 10:15 AM IST World News Live Updates | Zelenskyy likely to meet Trump as 28-point peace proposal draws Kyiv’s criticism\n\nRead More Ukraine continues to strike Russian military and energy targets with long-range drones, even as Moscow’s assaults on Ukrainian cities and infrastructure persist. Nov 21, 2025 10:06 AM IST Chandigarh News Live Updates | Punjab Human Rights panel gets a new member: Delhi ex-MLA Jitender Singh Shunty\n\nRead More Shunty is the founder of the Shaheed Bhagat Singh Sewa Dal. He was with Bharatiya Janata Party (BJP) earlier and was MLA from Shahadra in Delhi. In December 2024, ahead of Delhi Assembly elections, he had joined the AAP. Nov 21, 2025 10:01 AM IST World News Live Updates | ‘He calls out fake news’: White House defends Trump after his ‘Quiet, piggy’ remark at reporter\n\nRead More Press secretary Karoline Leavitt claimed his directness was part of why Americans re-elected him. Nov 21, 2025 10:00 AM IST India News Live Updates | JNMF launches Nehru Archive, ‘Selected Works of Jawaharlal Nehru’ released online in first phase\n\nRead More The 100 volumes of ‘The Selected Works of Jawaharlal Nehru’ were put together by the JNMF over the last 50 years. Nov 21, 2025 09:56 AM IST Hyderabad News Live Updates | ‘Nobody knows what you are doing’: Telangana High Court pulls up Hyderabad disaster agency over lack of SOP\n\nRead More The Telangana High Court was hearing a matter regarding the demolition of a multi-storied structure owned by Sandhya Hotels in Gachibowli's FCI layout on November 17 by the Hyderabad Disaster Response and Asset Protection Agency. Nov 21, 2025 09:48 AM IST India News Live Updates | Tamil Nadu Weather Today, November 21: Tamil Nadu to receive light to moderate rain; heavy rain in isolated pockets\n\nRead More Weather authorities say Tenkasi, Virudhunagar, Tirunelveli, Kanyakumari, Thoothukudi, Ramanathapuram, Cuddalore, Tiruvarur, Nagapattinam and Mayiladuthurai districts and Karaikal may record heavy rain at isolated spots. Nov 21, 2025 09:43 AM IST Chandigarh News Live Updates | Remembering the glorious legacy of Bhai Jaita: His family had a long history of devotion to the Sikh gurus\n\nRead More The ashes were preserved in a bronze pot and buried at the cremation spot. Nov 21, 2025 09:29 AM IST India News Live Updates | ‘Particularly special summit’: PM Modi as he embarks on 3-day visit to South Africa to attend G20 Summit\n\nRead More PM Modi will present India's perspective at the forum in line with its vision of ‘Vasudhaiva Kutumbakam’ and 'One earth, One Family and One future.’ Nov 21, 2025 09:24 AM IST Kolkata News Live Updates | ‘Inhuman workload’: Mamata writes to ECI to immediately stop voter rolls revision after BLO’s death in Bengal\n\nRead More A revision that previously required three years is now being forcibly compressed into three months, subjecting BLOs and officials to inhuman working conditions and forcing common people under the shadow of fear and uncertainty, Mamata Banerjee said. Nov 21, 2025 09:18 AM IST Chandigarh News Live Updates | PU Bachao Morcha warns of campus shutdown on November 26\n\nRead More Students allege threats against activist; FIR yet to be lodged Nov 21, 2025 09:08 AM IST World News Live Updates | US Coast Guard to drop Swastika, noose from list of hate symbols: Report\n\nRead More The Coast Guard will classify the Swastika as “potentially divisive” under new guidelines. The Coast Guard is not officially part of the US Department of Defense, but the service has been reworking its policies to align with the Trump administration’s stance on hazing and harassment within the US military. Nov 21, 2025 08:04 AM IST Delhi News Live Updates | Delhi-NCR AQI Level Today: Toxic Delhi air equal to smoking 11 cigarettes, no respite in sight\n\nRead More Delhi-NCR AQI Level Today, November 21, 2025: Delhi’s air quality has plunged to hazardous levels, with AQI readings crossing 450 and PM2.5 nearly 20 times above WHO limits. NCR cities fare even worse as authorities enforce GRAP-3; experts urge strict precautions and limited outdoor exposure. Check the latest air quality index and pollution level updates. Nov 21, 2025 07:17 AM IST India News Live Updates | National-level shooter sexually harassed on bus by drivers, conductor in Indore\n\nRead More The incident took place during a night journey, when the woman was returning home on a private bus after an event in Bhopal, police said. Three people have been arrested. Nov 21, 2025 07:05 AM IST Lucknow News Live Updates | Make Bharat Scouts Jamboree a world-class event: CM Adityanath\n\nRead More The event will be held from November 23 to 26 at the Defence Expo Ground in Lucknow and will host 32,000 scouts Nov 21, 2025 07:05 AM IST Lucknow News Live Updates | 19 students fall sick after ‘gas leak’ in Hardoi school, probe on\n\nRead More Nine admitted to Lucknow’s KGMU, all stable: Officials Nov 21, 2025 06:38 AM IST India News Live Updates | In the works: Policy to make for Jammu and Kashmir ‘investment-ready’\n\nRead More Jammu and Kashmir Logistics Policy 2025 will be unveiled soon, says Lt Governor Manoj Sinha. Focus on multimodal connectivity, dry ports and warehousing zones, and promotion of private sector participation. Nov 21, 2025 06:35 AM IST India News Live Updates | ‘Maulana’s Building’, Al Falah University chairman’s ancestral home in Madhya Pradesh, gets demolition notice\n\nRead More The prominent landmark in Mhow’s Kayastha locality is still under the name of Mohammad Hammad Siddiqui, Al Falah chairman Jawad Siddiqui’s father, officials say Nov 21, 2025 06:19 AM IST Delhi News Live Updates | ‘He loved acting… We planned to go to Mumbai and try to make it in Bollywood’: Friend of Delhi student who died by suicide\n\nRead More The friend said he knew that the boy was being targeted by their teachers due to his low marks, but he was not aware that it had affected him so deeply. Nov 21, 2025 06:19 AM IST Delhi News Live Updates | ‘Can’t make exception because victim says relationship is consensual’: Delhi HC refuses to quash POCSO case against man\n\nRead More Refuses to quash FIR against man booked under POCSO for marrying minor Nov 21, 2025 06:18 AM IST Delhi News Live Updates | ‘Children more sensitive today… teachers must be friends’: After student’s death, Delhi school heads reflect on generational shift\n\nRead More Teachers also argued that behavioural correction is being mistaken for hostility. Nov 21, 2025 06:17 AM IST Delhi News Live Updates | ‘Class 10 boy who died by suicide regularly visited school counselling room, was looking for someone to talk to’\n\nRead More Many parents said the school WhatsApp groups remained silent for hours after the boy died. Teachers, they said, learnt of the incident only late at night on November 18. Nov 21, 2025 06:16 AM IST Delhi News Live Updates | ‘Promised to change his school the day before he died’: Father of Class 10 boy who killed himself\n\nRead More The child, who was admitted to St Columba’s in Class 2, began to complain about his teachers’ behaviour soon after he began Class 10, the father said. Nov 21, 2025 06:13 AM IST Delhi News Live Updates | How schools can support struggling students — and the warning signs to watch for. A doctor explains\n\nRead More Dr Rajesh Sagar, Professor, Psychiatry, AIIMS Delhi, says teachers should be careful while speaking with the students and give them full respect. Dr Sagar, who specialises in child and adolescent psychiatry, says there has been a positive change over the years. Nov 21, 2025 06:10 AM IST India News Live Updates | As Goa sees uptick in crime, senior officers are transferred in police reshuffle\n\nRead More Chief Minister Pramod Sawant directed police to intensify night patrolling, set up checkpoints at strategic locations and focus on taking preventive actions Nov 21, 2025 06:09 AM IST Lucknow News Live Updates | Applicants in dark as UP teacher recruitment exam postponed again, at last minute\n\nRead More The selection commission has been without a chairperson since September, which is cited as one reason why the exam has now been put off several times. Nov 21, 2025 04:30 AM IST Kolkata News Live Updates | Vande Mataram birthplace fights for survival: Damp walls, crammed rooms & fund crunch\n\nRead More The staff cite lack of finances and manpower. The museum depends on the state government for upkeep, and officials say it needs urgent repairs but funds are scarce. Nov 21, 2025 04:20 AM IST India News Live Updates | EXCLUSIVE | Red Fort blast module: Foreign handler ‘shared 42 bomb-making videos with doctor on encrypted apps’\n\nRead More Officials probe if handlers had role in similar DIY bombings in recent times. Nov 21, 2025 04:20 AM IST India News Live Updates | ED names Robert Vadra as accused in case against UK-based arms consultant\n\nRead More The prosecution complaint, which is akin to a chargesheet, was filed before a special court in the Rouse Avenue court complex on November 15 and will be heard on December 6. Nov 21, 2025 04:20 AM IST Delhi News Live Updates | Student’s suicide: Delhi’s St Columba’s school suspends four of staff, govt to probe\n\nRead More An official order, issued by the school’s principal Robert Fernandes, stated that the action against three teachers and a headmistress followed the registration of an FIR in the case while taking into consideration the “seriousness of the allegations” against them. Nov 21, 2025 03:09 AM IST India News Live Updates | BRICS Presidency: India to follow G20 model, take meetings, delegations to all states, UTs\n\nRead More While the leaders’ summit will be held later next year in New Delhi, around 100 other meetings, including ministerials, forums and working groups, which will be held across 60 Indian cities, The Indian Express has learnt.\n\nStay updated with the latest - Click here to follow us on Instagram\n\n© IE Online Media Services Pvt Ltd",
  "summary": "",
  "published": "Fri, 21 Nov 2025 04:45:31 +0000",
  "url": "https://indianexpress.com/article/india/latest-news-today-live-updates-world-india-cities-news-delhi-mumbai-bengaluru-11-21-2025-news-headlines-10377453/",
  "source": "India | The Indian Express"
}