{
  "title": "Exploring the home town of the artist Joseph Wright of Derby",
  "text": "The river rushes white around each of the large, flattish rocks as I tread tentatively over the stepping stones that Dovedale is famous for. This limestone valley on the border between Derbyshire and Staffordshire is a popular spot for day trips and hiking. Thankfully, it’s quiet on this brisk November morning, and I’m able to soak in the scene: the River Dove flowing fast, the autumn trees turning russet and gold, the green fold of hills rising around me.\n\nOn days like this, it’s clear why Dovedale has inspired creatives. One of those was the 18th-century artist Joseph Wright of Derby, whose work is being celebrated in a new exhibition at the National Gallery.\n\nLandscapes such as Dovedale were painted by Wright at a time when “people started travelling to places that in those days were hard to get to – places like the Peak District”, says Tony Butler, executive director of Derby Museums Trust. We meet at Derby Museum and Art Gallery, which houses the world’s largest collection of Wright’s paintings. Places such as Dovedale were seen as wild, Butler explains, but there was an increasing appreciation of landscapes like this, with a gradual opening up of the country, and the idea of nature evoking the sublime.\n\nView image in fullscreen Wright’s Dovedale By Moonlight. Photograph: Alamy\n\nThe gallery showcases Wright’s prolific and varied work. In the place of paintings that have gone to the National Gallery exhibition are works from other artists, including paintings inspired by Wright’s use of light and dark by Nottingham-based Joseph Norris.\n\nMuch of Wright’s work reflects the industry and invention of the Enlightenment, a time of faith in reason and scientific discovery. As a hub of industrial growth, Derby was one of the Midlands towns at the centre of the movement, and Wright spent time with members of the Lunar Society, the Midlands-based group of Enlightenment thinkers. “The Enlightenment was a way of life in Derby, and he was a documenter of that,” says Butler. “He’s really reflecting the spirit of the age.”\n\nMuch of Wright’s work reflects the industry and invention of the Enlightenment, a time of faith in reason and scientific discovery\n\nOne of Wright’s most famous works, A Philosopher Giving That Lecture on the Orrery (in Which a Lamp Is Put in Place of the Sun), shows a philosopher lecturing on the solar system at a time when talks like this were held in Derby’s town hall. He painted portraits of figures reflecting the area’s role in industry, including Sir Richard Arkwright, the industrialist who built his cotton mill in nearby Cromford and was one of Wright’s patrons.\n\nI have lunch at The Engine Room, a recently opened restaurant that draws on another element of Derby’s industrial heritage, as a centre for railway manufacturing, with railway art decorating the walls. Afterwards, I wander with Alex Rock from Derby Museums along the River Derwent as Canada geese bob by and the breeze throws leaves on the water. It’s a short walk to the Museum of Making, which stands on the site of Derby Silk Mill, often regarded as the world’s first modern factory, near where Wright grew up.\n\nView image in fullscreen The Museum of Making. Photograph: Kate Lowe\n\nThe museum explores 300 years of Derby’s history of making, from the Enlightenment era that inspired Wright through to the city’s contemporary creativity. A Toyota car hangs high in the atrium as a sign of Derbyshire’s modern manufacturing. “In Stoke, we lift up crockery to see where it’s made,” I say, a nod to my own home town’s industry. “I do the same,” Rock says, and we lift our coffee mugs to see them stamped as Denby, the Derbyshire-based pottery company. Afterwards, I join the crowd gathered to watch the trains running on the museum’s impressive model railway.\n\nI look around the Assemblage room, curated so items are displayed by their principal material, such as wood or metal. There are racks of everything from Derby-made train parts to ceramics showcasing the museum’s collection. The museum is also home to a workshop where visitors can book sessions to learn skills such as pot-throwing and woodwork.\n\nskip past newsletter promotion Sign up to The Traveller Free newsletter Get travel inspiration, featured trips and local tips for your next break, as well as the latest deals from Guardian Holidays Enter your email address Sign up Privacy Notice: Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on theguardian.com to send you this newsletter. You can complete full registration at any time. For more information about how we use your data see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nCromford Mills, the world’s first successful water-powered cotton spinning mill, was built in 1771 by Sir Richard Arkwright\n\nWe wander to Derby cathedral, striking for how bright it is inside a nave that was rebuilt in 1725 – the large windows symbolically letting in the light of the Enlightenment. I amble down Sadler Gate, a pedestrianised street lined with independent shops, where I settle for a while with a pint of cider at the Old Bell Hotel, a 17th-century former coaching inn that’s been sensitively restored.\n\nFollowing the Derwent and the A6 north leads to the village of Cromford, home to Cromford Mills, the world’s first successful water-powered cotton spinning mill. I join an hour-long guided tour and learn how it was built in 1771 by Arkwright, and is seen as another important site of the Industrial Revolution. The tour takes us into vast old factory buildings, and we see examples of the machinery that would have been used. Wright painted Cromford Mills in day and night scenes.\n\nView image in fullscreen Cromford, home to Sir Richard Arkwright’s cotton mill. Photograph: Daniel Matthams/Alamy\n\nI have lunch at Oakhill, built by the Arkwright family in the mid-19th century as a private family dwelling, and now a boutique hotel and restaurant. I eat a delicious and generously sized cauliflower steak in the elegant restaurant, with wide windows offering views over the Derbyshire countryside.\n\nI leave with a sense of the people and places that inspired Joseph Wright, from the valley of Dovedale to the industrial changes of the 18th century, and how places like Cromford and Derby are drawing on that history. As Alex Rock says: “If you really want to experience the culture that Wright came from, you need to come to Derby.”\n\nWright of Derby: From the Shadow is at the National Gallery, London, until 10 May, tickets from £12. The trip was provided by Visit Derby and Visit Peak District & Derbyshire",
  "summary": "<p>With a new exhibition of his work at the National Gallery in London, a visit to the artist’s home town reveals the landscapes and industry that inspired him</p><p>The river rushes white around each of the large, flattish rocks as I tread tentatively over the stepping stones that Dovedale is famous for. This limestone valley on the border between Derbyshire and Staffordshire is a popular spot for day trips and hiking. Thankfully, it’s quiet on this brisk November morning, and I’m able to soak in the scene: the River Dove flowing fast, the autumn trees turning russet and gold, the green fold of hills rising around me.</p><p>On days like this, it’s clear why Dovedale has inspired creatives. One of those was the 18th-century artist Joseph Wright of Derby, whose work is being celebrated <a href=\"https://emea01.safelinks.protection.outlook.com/?url=https%3A%2F%2Fwww.nationalgallery.org.uk%2Fexhibitions%2Fwright-of-derby-from-the-shadows&amp;data=05%7C02%7C%7C2c73c10d6594486dc3b008de1df83ace%7C84df9e7fe9f640afb435aaaaaaaaaaaa%7C1%7C0%7C638981149135380542%7CUnknown%7CTWFpbGZsb3d8eyJFbXB0eU1hcGkiOnRydWUsIlYiOiIwLjAuMDAwMCIsIlAiOiJXaW4zMiIsIkFOIjoiTWFpbCIsIldUIjoyfQ%3D%3D%7C0%7C%7C%7C&amp;sdata=NpVy5siquW1rMmAQEiY4YfGQplE4oLiBmXoWzH26rXo%3D&amp;reserved=0\" title=\"Protected by Outlook: https://www.nationalgallery.org.uk/exhibitions/wright-of-derby-from-the-shadows. Click or tap to follow the link.\">in a new exhibition</a> at the National Gallery.</p> <a href=\"https://www.theguardian.com/travel/2025/nov/19/exploring-the-home-town-of-the-artist-joseph-wright-of-derby\">Continue reading...</a>",
  "published": "Wed, 19 Nov 2025 07:00:10 GMT",
  "url": "https://www.theguardian.com/travel/2025/nov/19/exploring-the-home-town-of-the-artist-joseph-wright-of-derby",
  "source": "The Guardian"
}