{
  "title": "New laser smaller than a penny can measure objects at ultrafast rates",
  "text": "Researchers from the University of Rochester and University of California, Santa Barbara, engineered a laser device smaller than a penny that they say could power everything from the LiDAR systems used in self-driving vehicles to gravitational wave detection, one of the most delicate experiments in existence to observe and understand our universe.\n\nLaser-based measurement techniques, known as optical metrology, can be used to study the physical properties of objects and materials. But current optical metrology requires bulky and expensive equipment to achieve delicate laser-wave control, creating a bottleneck for deploying streamlined, cost-effective systems.\n\nThe new chip-scale laser, described in a paper published in Light: Science & Applications, can conduct extremely fast and accurate measurements by very precisely changing its color across a broad spectrum of light at very fast rates -- about 10 quintillion times per second. Unlike traditional silicon photonics, the laser is made with a synthetic material called lithium niobate and leverages a physical phenomenon known as the Pockels effect, which changes the refractive index of a material when an electric field is present.\n\n\"There are several applications we are aiming for that can already benefit from our designs,\" says Shixin Xue, a PhD student advised by Qiang Lin, the Dean's Professor of electrical and computer engineering and optics, both of whom are among the paper's authors. \"The first is LiDAR, which is already used in autonomous vehicles, but a more advanced form known as frequency-modulated continuous-wave LiDAR requires a large tuning range and fast tuning of the laser's frequency, and that's what our laser can do.\"\n\nThe researchers demonstrated how their laser could be used to drive a LiDAR system on a spinning disc and identify the letters U and R made out of toy building blocks. They say that the miniature demonstration could be scaled up to detect vehicles and obstacles at highway speeds and distances.\n\nThe researchers also demonstrated how the chip-scale laser could be used for Pound-Drever-Hall (PDH) laser frequency locking, a common technique used to narrow down, stabilize, and reduce a laser's noise.\n\n\"It's a very important process that can be used for optical clocks that can measure time with extreme precision, but you need a lot of equipment to do that,\" says Xue, noting that a typical setup might require instruments the size of a desktop computer such as an intrinsic laser, an isolator, an acoustic optic modulator, and a phase modulator. \"Our laser can integrate all of these things into a very small chip that can be tuned electrically.\"\n\nThe research was supported in part by the Defense Advanced Research Projects Agency (DARPA) Lasers for Universal Microscale Optical Systems (LUMOS) and the National Science Foundation.",
  "summary": "Researchers have engineered a laser device smaller than a penny that they say could power everything from the LiDAR systems used in self-driving vehicles to gravitational wave detection, one of the most delicate experiments in existence to observe and understand our universe.",
  "published": "Mon, 02 Jun 2025 15:48:59 EDT",
  "url": "https://www.sciencedaily.com/releases/2025/06/250602154859.htm",
  "source": "Latest Science News -- ScienceDaily"
}