{
  "title": "Ex-FBI Employee Says In Lawsuit Kash Patel Fired Him For Hanging A Pride Flag",
  "text": "LOADING ERROR LOADING\n\nA longtime FBI employee who says he was fired last month for hanging an LGBTQ+ Pride flag at his workspace has filed a lawsuit in federal court.\n\nDavid Maltinsky, a decorated intelligence specialist, spent 16 years working in the Los Angeles Field Office and had completed nearly four months of special agent training when he received a letter signed by FBI Director Kash Patel telling him he had been “summarily dismissed” from the agency for the “inappropriate display of political signage” at his workspace.\n\nAdvertisement\n\nMaltinsky’s lawsuit, filed on Wednesday in the United States District Court for the District of Columbia, alleges that Patel unlawfully terminated Maltinsky and violated his rights to free speech and equal protection under the law. The suit, first reported by CBS News, also names Attorney General Pam Bondi, the FBI and the Department of Justice as defendants.\n\nMaltinsky said in the suit that he had displayed a Pride flag at his Los Angeles office workspace since 2021 after a special agent had given him several flags in recognition of his work with the FBI’s diversity initiatives.\n\nIn June 2021, FBI headquarters had authorized federal buildings across the country to fly Pride flags beneath the American flag in recognition of LGBTQ+ Pride Month. The Los Angeles office had flown both a traditional rainbow Pride flag and a “Progress Pride” flag, which includes black, brown, pink, blue and white colors to represent people of color and trans people.\n\nAdvertisement\n\n“From a young age, all I have wanted to do is serve my country and ensure its security alongside the brilliant and dedicated men and women of the FBI,” Maltinsky said in a statement to HuffPost.\n\n“I displayed that Pride flag…not as a political statement, but as a symbol of inclusion, unity, and equal service. These are the values that once made the FBI strong. Now it is a place where people like me are targeted. I believe I was fired not because of who I am, but what I am: a proud gay man,” he continued.\n\nThe FBI did not immediately respond to HuffPost’s request for comment.\n\nPeople carrying a \"Progress Pride\" flag walk through bubbles during the World Pride parade on June 7, 2025, in Washington. AP Photo/Alex Brandon\n\nAdvertisement\n\nIn April, Maltinsky began training to become a special agent, which he had dreamed about since he was a child. He completed 16 of the 19 weeks of training when he was informed that he was being fired, according to the lawsuit.\n\nPrior to his termination, Maltinsky was recognized for his commitment to improving diversity and inclusion within the FBI. In 2020, he was awarded the FBI Director’s Award for Excellence, and in 2022, he received an award from the DOJ for his work in supporting the equal employment opportunity program.\n\nAfter a gunman killed 49 people at Pulse, a gay nightclub in Orlando, Florida, Maltinsky raised his hand to help the agency enhance its diversity initiatives. As a gay man, he felt he had a responsibility to make the agency more inclusive for LGBTQ+ employees, according to the lawsuit.\n\nAdvertisement\n\nDuring his tenure at the Los Angeles field office, Maltinsky assisted agents responding to cyberattacks by North Korea and traveled to Nigeria to assist efforts to fight cybercrimes.\n\nShortly after Trump returned to office on Jan. 20, a Los Angeles FBI employee “reported an alleged concern” to Maltinsky’s supervisor about the flag. His boss informed him about the concern but noted that displaying the flag was “permissible and appropriate.” Maltinsky spoke to the chief legal adviser to the Los Angeles office, who maintained that displaying the Pride flag did not violate any agency policies.\n\nThe lawsuit notes that the FBI allows employees to display other kinds of flags, including the Gadsden Flag, known for its rattlesnake and “Don’t Tread on Me” message, and the Punisher flag, with a black and white skull. Both of these flags have been associated with far-right and right-wing movements.\n\nAdvertisement\n\nMaltinsky’s firing is part of a pattern of firings across the FBI by Patel — and more broadly, by the Trump administration across the federal government. After Trump signed an executive order to dismantle diversity, equity and inclusion programs in January, many people employed in DEI for the federal government — including many women, people of color and LGBTQ+ people — lost their jobs.\n\nLast month, former FBI official Michael Feinberg slammed Patel for firing Maltinsky, who at that point remained unnamed.\n\n“What this employee was doing was not at all out of line, out of the norm or at all inappropriate,” Feinberg told MSNBC. “It’s absolute madness, and the fact that Kash Patel would go after this individual is lunacy.”\n\nAdvertisement\n\nThe San Francisco FBI participates in the 53rd Annual San Francisco Pride Parade on June 25, 2023. Arun Nevader via Getty Images\n\nMaltinsky told CBS News that after Trump was reelected, some LGBTQ+ FBI employees were fearful that the administration would make a list of employees who had self-selected their sexual orientation or gender identity. He said that many of his gay colleagues and allies have since removed Pride flags.\n\nThe administration has since terminated hundreds of employees whose backgrounds or actions critique Trump and his far-right, anti-LGBTQ+ and anti-DEI agenda. In February, Tulsi Gabbard, the director of national intelligence, fired more than 100 intelligence officers after far-right activist Chris Rufo posted screenshots of a private chat in which employees discussed topics around gender-affirming care, transition and polyamory. In September, the FBI fired at least 15 agents who were photographed kneeling during the 2020 protests after the police killing of George Floyd. The administration has also cracked down on agents who were accused of working on criminal cases involving Trump.\n\nAdvertisement\n\nMaltinsky’s lawyers said in a statement that this case speaks to part of the Trump administration’s larger purge of federal employees.\n\n“This case is about far more than one man’s career—it’s about whether the government can punish Americans simply for saying who they are,” Christopher Mattei, Maltinsky’s lawyer, said in a statement. “David’s dream was to serve our country as an FBI Special Agent. When that dream was cruelly taken from him, he stayed true to his oath and is now fighting to protect the rights of all Americans.”",
  "summary": "David Maltinsky was told that he had been “summarily dismissed” from the agency for the \"inappropriate display of political signage” at his workspace.",
  "published": "Wed, 19 Nov 2025 18:59:26 -0500",
  "url": "https://www.huffpost.com/entry/fbi-employee-says-kash-patel-fired-him-over-hanging-a-pride-flag_n_691e3ec8e4b0dc5d37ac204e",
  "source": "Politics"
}