{
  "title": "Fossil fuel phase-out can’t be uniform for all countries, says India at COP30",
  "text": "India on Thursday made it clear that it was not in favour of a uniform roadmap for fossil fuel phase-out and said that countries should be allowed to decide on their own the pathway to transition away from fossil fuels.\n\nA roadmap for ending the use of fossil fuels is one of the key issues holding up agreement over the political package that is expected to be the main outcome from the COP30 meeting here.\n\nOver 80 countries, led mainly by the European Union and small island nations, have been pushing for inclusion of a language on the early phase out of fossil fuels in the political package that the host Brazil is hoping to be the showcase outcome from the annual climate summit.\n\nIndia said it was not opposed to the mention of a fossil fuel phase-out plan in the package but it must be ensured that countries are not called to adhere to a uniform pathway for it.\n\n“In every country, fossil fuel is used in a different way. In India, for example, the government allows subsidies in fossil fuel when it comes to public welfare schemes like the Ujjwala Scheme in which LPG is supplied to households at subsidised rate. Similarly, in African countries the government allows subsidies on kerosene because the fishing community uses it for running their boats,” an official said.\n\n“Therefore, if you straightaway mandate a uniform phase out of fossil fuels, or a complete ban on subsidies, then it may hurt the public welfare schemes in many countries. Our position, therefore, is that countries must be allowed to choose their pathways in their national interest,” the source said.\n\nAccording to the source, India does not provide fossil fuel subsidies on luxurious goods. In fact, it is among countries charging higher taxes on petroleum and diesel, but the world needs to understand that subsidies for programmes like Ujjwala are essential for India’s development, public health and poverty alleviation, the source said, adding that India has the support of many other countries, including China, Egypt, Saudi Arabia and Venezuela, which are all part of Like Minded Developing Countries (LMDC) grouping.\n\nStory continues below this ad\n\nThe political package is an attempt by Brazil to address four long-standing concerns of different sets of countries which could not be accommodated in the official agenda of COP30. It includes two important concerns of developing countries, including India — full implementation of a key finance provision in Paris Agreement, which these countries insist has been ignored till now, and unilateral trade measures like Carbon Border Adjustment Mechanism (CBAM) of EU, which countries like India and China say is a discriminatory trade practice in the garb of climate action.\n\nBrazil had said it wanted to finalise the political package by Wednesday. But after the first draft was released on Tuesday, a sort of deadlock prevailed on this issue, with countries unable to agree on a common language on the four issues. Even a day-long intervention by Brazilian President President Luiz Inácio Lula Da Silva on Wednesday failed to break the deadlock.\n\nLula urged the world to start looking to a future beyond fossil fuels. “If fossil fuel is something that is regarded as the main cause behind higher emission levels, then we will have to start thinking about a world where we can live without fossil fuels and I say this out of honest willingness, because I live in a country that extracts 5 million barrels of oil per day. But I am also from a country that uses the highest proportion of ethanol blended with gasoline and biodiesel. I am also from a country whose 87% of total electricity is produced from sustainable sources,” Lula said.\n\nThese countries were able to make progress on some other issues, though, most notably on provisions related to the creation of carbon markets.\n\nStory continues below this ad\n\nFire at venue\n\nThe COP30 meeting was disrupted on Thursday afternoon ((2230 India time) after a fire broke out at the venue, leading to an evacuation of all the delegates and deployment of firefighters and ambulances. Preliminary information suggested the fire began at the country pavilion hall. There were no immediate reports of anyone getting injured.",
  "summary": "",
  "published": "Thu, 20 Nov 2025 21:42:30 +0000",
  "url": "https://indianexpress.com/article/india/fossil-fuel-phase-out-cant-be-uniform-for-all-countries-says-india-at-cop30-10377323/",
  "source": "India | The Indian Express"
}