{
  "title": "Beyond Ultra-Processed Foods: Can Farmers Fix Our Health and the Planet?",
  "text": "Available for over a year\n\nIs it possible to produce enough healthy food to feed the nation whilst also restoring nature? The farmer and best-selling author James Rebanks thinks it is but says there needs to be a radical change to government policy and our entire food system. He explains why he thinks farming subsidies are flawed, the unintended consequences of cheap food, and the delicate balance between food security and environmental stewardship. And from the hills of Cumbria to a remote island in Norway, he also reflects on the lessons he learnt about masculinity whilst writing his latest book, ‘The Place of Tides’. A government spokesperson said: “Farmers are stewards for our nation's land and for our food security. Farming also plays a central role in our mission to kickstart economic growth. “We understand that when farmers run profitable businesses, it’s good for the whole economy. “That is why we are backing them through new technology, streamlined regulation and our nature-friendly farming schemes are helping farmers produce food for the nation.” (00:05:34) James explains his rise to farming fame (00:08:49) Why British farming is in crisis (00:16:42) Food production vs nature recovery (00:24:35) Our cheap food system (00:32:27) Supermarkets and food security (00:36:29) Restoring the balance between supermarkets and farmers (00:39:00) How can consumers help British farmers? (00:42:15) What do we do to build a better system? (00:46:00) Farming and politics (00:49:30) What it's like to be a British farmer and James’ family history (00:52:43) From the farm to Oxford University (00:57:37) How a visit to a remote island in Norway led to ‘The Place of Tides’ (01:05:17) Amol’s reflections GET IN TOUCH * WhatsApp: 0330 123 9480 * Email: radical@bbc.co.uk Episodes of Radical with Amol Rajan are released every Thursday and you can also watch them on BBC iPlayer: https://www.bbc.co.uk/iplayer/episodes/m002f1d0/radical-with-amol-rajan Amol Rajan is a presenter of the Today programme on BBC Radio 4. He is also the host of University Challenge on BBC One. Before that, Amol was media editor at the BBC and editor at The Independent. Radical with Amol Rajan is a Today Podcast. It was made by Lewis Vickers with Anna Budd. Digital production was by Gabriel Purcell-Davis. Technical production was by Dave O’Neill. The editor is Sam Bonham. The executive producer is Owenna Griffiths.\n\nProgramme Website",
  "summary": "James Rebanks on how to build a secure, sustainable and healthy food system.",
  "published": "Thu, 20 Nov 2025 06:00:00 GMT",
  "url": "https://www.bbc.co.uk/sounds/play/m002mbys?at_medium=RSS&at_campaign=rss",
  "source": "BBC News"
}