{
  "title": "Army invites commercial bids for fast patrol boats, landing craft assault: Focus on operations in Sir Creek, Brahmaputra river basin, eastern Ladakh",
  "text": "OVER A year after it first projected the need to procure fast patrol boats and Landing Craft Assaults to be used for deployment in Sir Creek, the Brahmaputra river basin and in eastern Ladakh, the Army recently went a step further towards these acquisitions and floated two Request for Proposals (RFPs) from vendors for the purchase of the two platforms.\n\nLast week, the Army invited technical and commercial proposals to procure eight Landing Craft Assaults for employment at sea as well as in shallow creek areas — the Brahmputra River, the Sunderban Delta of West Bengal and Eastern Ladakh.\n\nSimilarly, last month, it floated an RFP for the purchase of six fast patrol boats that will be primarily used for small team insertion for surveillance and reconnaissance, patrolling and domination of waterbodies, deployment for intervention operation of high-speed craft, in support of direct action and operations in shallow and muddy waters.\n\nThe boats will help facilitate amphibious operations. Both should have a minimum 60% indigenous content and should have a service life of 10 years or 10,000 hours of operation, whichever is earlier, according to the two RFPs.\n\nThe step forward in the procurement of the two platforms also assumes significance in the wake of the defence establishment’s increased focus on the Sir Creek area. Last month, the Armed Forces kicked off a mega tri-service military exercise along the western border with Pakistan, including the desert and Sir Creek areas, called Trishul. Defence Minister Rajnath Singh, in September, had warned Pakistan and said that a route to Karachi passes through Sir Creek. He had said any aggression in the Sir Creek area would be met with a response that would “change both history and geography”.\n\nAccording to the RFP, the Landing Craft Assaults are to be deployed for the transportation of vehicles and materials, and for random boat patrol and limited search and rescue in the Sir Creek Area, the Brahmaputra River Basin and Eastern Ladakh.\n\nIt is to be designed for high speed with good sea-keeping features and soft riding hull characteristics even at maximum speed, the RFP noted, adding that they would be designed to ensure the safety of occupants, reduction of operator fatigue whilst achieving the desired standards for rugged military use.\n\nStory continues below this ad\n\nThe RFP mandates them to have a minimum 60% indigenous content and should be able to achieve a maximum speed of 20 knots.\n\nThe boats should be able to accommodate 35 troops or one Tata Storme/equivalent class vehicle and 12 men with a total weight of 3,990 kg, as well as ammunition, troops’ equipment, and a crew of five with a total payload of Rs5,255 kg.\n\nThe Landing Craft Assaults is designed to ensure the safety of occupants, reduce operator fatigue while achieving the desired standards for rugged military use.\n\nThe fast patrol boats, on the other hand, would be employed to carry out patrolling and surveillance of conflict zones, aside from its other designated duties.\n\nStory continues below this ad\n\nThe fast patrol boat should have endurance of at least six hours of continuous operation without refuelling at the speed of 25-30 knots with eight people on board, including crew. They will have a capacity to carry eight people on board, including crew, with a total payload of 1,000 kg, the RFP states.\n\nThe significance of Sir Creek\n\nSir Creek, originally Ban Ganga, is a fluctuating 96-km tidal estuary along the India-Pakistan border. To its east lies the Rann of Kutch in Gujarat, and to its west, the province of Sindh in Pakistan. It has long been at the centre of an unresolved border dispute between India and Pakistan. The region is strategically and economically important for both the countries as it is said to hold untapped oil and gas reserves.",
  "summary": "",
  "published": "Tue, 18 Nov 2025 20:18:08 +0000",
  "url": "https://indianexpress.com/article/india/army-invites-commercial-bids-for-fast-patrol-boats-landing-craft-assault-focus-on-operations-in-sir-creek-brahmaputra-river-basin-eastern-ladakh-10373304/",
  "source": "India | The Indian Express"
}