{
  "title": "Hundreds of millions at risk from Chinese shopping app malware",
  "text": "CNN —\n\nIt is one of China’s most popular shopping apps, selling clothing, groceries and just about everything else under the sun to more than 750 million users a month.\n\nBut according to cybersecurity researchers, it can also bypass users’ cell phone security to monitor activities on other apps, check notifications, read private messages and change settings.\n\nAnd once installed, it’s tough to remove.\n\nWhile many apps collect vast troves of user data, sometimes without explicit consent, experts say e-commerce giant Pinduoduo has taken violations of privacy and data security to the next level.\n\nIn a detailed investigation, CNN spoke to half a dozen cybersecurity teams from Asia, Europe and the United States — as well as multiple former and current Pinduoduo employees — after receiving a tipoff.\n\nMultiple experts identified the presence of malware on the Pinduoduo app that exploited vulnerabilities in Android operating systems. Company insiders said the exploits were utilized to spy on users and competitors, allegedly to boost sales.\n\n“We haven’t seen a mainstream app like this trying to escalate their privileges to gain access to things that they’re not supposed to gain access to,” said Mikko Hyppönen, chief research officer at WithSecure, a Finnish cybersecurity firm.\n\n“This is highly unusual, and it is pretty damning for Pinduoduo.”\n\nThis is highly unusual, and it is pretty damning for Pinduoduo. Mikko Hyppönen, cybersecurity expert\n\nMalware, short for malicious software, refers to any software developed to steal data or interfere with computer systems and mobile devices.\n\nEvidence of sophisticated malware in the Pinduoduo app comes amid intense scrutiny of Chinese-developed apps like TikTok over concerns about data security.\n\nSome American lawmakers are pushing for a national ban on the popular short-video app, whose CEO Shou Chew was grilled by Congress for five hours last week about its relations with the Chinese government.\n\nThe revelations are also likely to draw more attention to Pinduoduo’s international sister app, Temu, which is topping US download charts and fast expanding in other Western markets. Both are owned by Nasdaq-listed PDD, a multinational company with roots in China.\n\nWhile Temu has not been implicated, Pinduoduo’s alleged actions risk casting a shadow over its sister app’s global expansion.\n\nThere is no evidence that Pinduoduo has handed data to the Chinese government. But as Beijing enjoys significant leverage over businesses under its jurisdiction, there are concerns from US lawmakers that any company operating in China could be forced to cooperate with a broad range of security activities.\n\nPinduoduo's parent company PDD is listed on the Nasdaq in New York. Mike Segar/Reuters/File\n\nThe findings follow Google’s suspension of Pinduoduo from its Play Store in March, citing malware identified in versions of the app.\n\nAn ensuing report from Bloomberg said a Russian cybersecurity firm had also identified potential malware in the app.\n\nPinduoduo has previously rejected “the speculation and accusation that Pinduoduo app is malicious.”\n\nCNN has contacted PDD multiple times over email and phone for comment, but has not received a response.\n\nRise to success\n\nPinduoduo, which boasts a user base that accounts for three quarters of China’s online population and a market value three times that of eBay (EBAY), wasn’t always an online shopping behemoth.\n\nFounded in 2015 in Shanghai by Colin Huang, a former Google employee, the startup was fighting to establish itself in a market long dominated by e-commerce stalwarts Alibaba (BABA) and JD.com (JD).\n\nIt succeeded by offering steep discounts on friends-and-family group buying orders and focusing on lower-income rural areas.\n\nPinduoduo posted triple digit growth in monthly users until the end of 2018, the year it listed in New York. By the middle of 2020, though, the increase in monthly users had slowed to around 50% and would continue to decline, according to its earnings reports.\n\nColin Huang, a former Google employee, founded Pinduoduo in 2015 in Shanghai. He stepped down as CEO in 2020 and resigned as chairman the following year. VCG/VCG/Getty Images/File\n\nIt was in 2020, according to a current Pinduoduo employee, that the company set up a team of about 100 engineers and product managers to dig for vulnerabilities in Android phones, develop ways to exploit them — and turn that into profit.\n\nAccording to the source, who requested anonymity for fear of reprisals, the company only targeted users in rural areas and smaller towns initially, while avoiding users in megacities such as Beijing and Shanghai.\n\n“The goal was to reduce the risk of being exposed,” they said.\n\nBy collecting expansive data on user activities, the company was able to create a comprehensive portrait of users’ habits, interests and preferences, according to the source.\n\nThis allowed it to improve its machine learning model to offer more personalized push notifications and ads, attracting users to open the app and place orders, they said.\n\nThe team was disbanded in early March, the source added, after questions about their activities came to light.\n\nPDD didn’t reply to CNN’s repeated requests for comment on the team.\n\nWhat experts found\n\nApproached by CNN, researchers from Tel Aviv-based cyber firm Check Point Research, Delaware-based app security startup Oversecured and Hyppönen’s WithSecure conducted independent analysis of the 6.49.0 version of the app, released on Chinese app stores in late February.\n\nGoogle Play is not available in China, and Android users in the country download their apps from local stores. In March, when Google suspended Pinduoduo, it said it had found malware in off-Play versions of the app.\n\nThe researchers found code designed to achieve “privilege escalation”: a type of cyberattack that exploits a vulnerable operating system to gain a higher level of access to data than it’s supposed to have, according to experts.\n\n“Our team has reverse engineered that code and we can confirm that it tries to escalate rights, tries to gain access to things normal apps wouldn’t be able to do on Android phones,” said Hyppönen.\n\nIn China, about three quarters of smartphone users are on the Android system. Luo Yunfei/China News Service/VCG/Getty Images\n\nThe app was able to continue running in the background and prevent itself from being uninstalled, which allowed it to boost its monthly active user rates, Hyppönen said. It also had the ability to spy on competitors by tracking activity on other shopping apps and getting information from them, he added.\n\nCheck Point Research additionally identified ways in which the app was able to evade scrutiny.\n\nThe app deployed a method that allowed it to push updates without an app store review process meant to detect malicious applications, the researchers said.\n\nThey also identified in some plug-ins the intent to obscure potentially malicious components by hiding them under legitimate file names, such as Google’s.\n\n“Such a technique is widely used by malware developers that inject malicious code into applications that have legitimate functionality,” they said.\n\nAndroid targeted\n\nIn China, about three quarters of smartphone users are on the Android system. Apple (AAPL)’s iPhone has 25% market share, according to Daniel Ives of Wedbush Securities.\n\nSergey Toshin, the founder of Oversecured, said Pinduoduo’s malware specifically targeted different Android-based operating systems, including those used by Samsung, Huawei, Xiaomi and Oppo.\n\nCNN has reached out to these companies for comment.\n\nToshin described Pinduoduo as “the most dangerous malware” ever found among mainstream apps.\n\n“I’ve never seen anything like this before. It’s like, super expansive,” he said.\n\nMost phone manufacturers globally customize the core Android software, the Android Open Source Project (AOSP), to add unique features and applications to their own devices.\n\nToshin found Pinduoduo to have exploited about 50 Android system vulnerabilities. Most of the exploits were tailor made for customized parts known as the original equipment manufacturer (OEM) code, which tends to be audited less often than AOSP and is therefore more prone to vulnerabilities, he said.\n\nPinduoduo also exploited a number of AOSP vulnerabilities, including one which was flagged by Toshin to Google in February 2022. Google fixed the bug this March, he said.\n\nI’ve never seen anything like this before. It’s like, super expansive. Sergey Toshin, Android security expert\n\nAccording to Toshin, the exploits allowed Pinduoduo access to users’ locations, contacts, calendars, notifications and photo albums without their consent. They were also able to change system settings and access users’ social network accounts and chats, he said.\n\nOf the six teams CNN spoke to for this story, three did not conduct full examinations. But their primary reviews showed that Pinduoduo asked for a large number of permissions beyond the normal functions of a shopping app.\n\nThey included “potentially invasive permissions” such as “set wallpaper” and “download without notification,” said René Mayrhofer, head of the Institute of Networks and Security at the Johannes Kepler University Linz in Austria.\n\nPeople using their phones on the Beijing subway in July 2022. Sheldon Cooper/SOPA Images/LightRocket/Getty Images\n\nDisbanding the team\n\nSuspicions about malware in Pinduoduo’s app were first raised in late February in a report by a Chinese cybersecurity firm called Dark Navy. Even though the analysis didn’t directly name the shopping giant, the report spread quickly among other researchers, who did name the company. Some of the analysts followed up with their own reports confirming the original findings.\n\nSoon after, on March 5, Pinduoduo issued a new update of its app, version 6.50.0, which removed the exploits, according to two experts who CNN spoke to.\n\nTwo days after the update, Pinduoduo disbanded the team of engineers and product managers who had developed the exploits, according to the Pinduoduo source.\n\nThe next day, team members found themselves locked out of Pinduoduo’s bespoke workplace communication app, Knock, and lost access to files on the company’s internal network. Engineers also found their access to big data, data sheets and the log system revoked, the source said.\n\nMost of the team were transferred to work at Temu. They were assigned to different departments at the subsidiary, with some working on marketing or developing push notifications, according to the source.\n\nA core group of about 20 cybersecurity engineers who specialize in finding and exploiting vulnerabilities remain at Pinduoduo, they said.\n\nToshin of Oversecured, who looked into the update, said although the exploits were removed, the underlying code was still there and could be reactivated to carry out attacks.\n\nOversight failure\n\nPinduoduo has been able to grow its user base against a backdrop of the Chinese government’s regulatory clampdown on Big Tech that began in late 2020.\n\nThat year, the Ministry of Industry and Information Technology launched a sweeping crackdown on apps that illegally collect and use personal data.\n\nIn 2021, Beijing passed its first comprehensive data privacy legislation.\n\nThe Personal Information Protection Law stipulates that no party should illegally collect, process or transmit personal information. They’re also banned from exploiting internet-related security vulnerabilities or engaging in actions that endanger cybersecurity.\n\nPinduoduo’s apparent malware would be a violation of those laws, tech policy experts say, and should have been detected by the regulator.\n\n“This would be embarrassing for the Ministry of Industry and Information Technology, because this is their job,” said Kendra Schaefer, a tech policy expert at Trivium China, a consultancy. “They’re supposed to check Pinduoduo, and the fact that they didn’t find (anything) is embarrassing for the regulator.”\n\nThe ministry has regularly published lists to name and shame apps found to have undermined user privacy or other rights. It also publishes a separate list of apps that are removed from app stores for failing to comply with regulations.\n\nPinduoduo did not appear on any of the lists.\n\nThey’re supposed to check Pinduoduo, and the fact that they didn’t find (anything) is embarrassing for the regulator. Kendra Schaefer, tech policy expert\n\nCNN has reached out to the Ministry of Industry and Information Technology and the Cyberspace Administration of China for comment.\n\nOn Chinese social media, some cybersecurity experts questioned why regulators haven’t taken any action.\n\n“Probably none of our regulators can understand coding and programming, nor do they understand technology. You can’t even understand the malicious code when it’s shoved right in front of your face,” a cybersecurity expert with 1.8 million followers wrote last week in a viral post on Weibo, a Twitter-like platform.\n\nThe post was censored the next day.",
  "summary": "",
  "published": "",
  "url": "https://cnn.it/40OSomK",
  "source": "CNN.com - RSS Channel - App International Edition"
}