{
  "title": "Decades-old assumptions about brain plasticity upended",
  "text": "A new study from Pitt researchers challenges a decades-old assumption in neuroscience by showing that the brain uses distinct transmission sites -- not a shared site -- to achieve different types of plasticity. The findings, published in Science Advances, offer a deeper understanding of how the brain balances stability with flexibility, a process essential for learning, memory and mental health.\n\nNeurons communicate through a process called synaptic transmission, where one neuron releases chemical messengers called neurotransmitters from a presynaptic terminal. These molecules travel across a microscopic gap called a synaptic cleft and bind to receptors on a neighboring postsynaptic neuron, triggering a response.\n\nTraditionally, scientists believed spontaneous transmissions (signals that occur randomly) and evoked transmissions (signals triggered by sensory input or experience) originated from one type of canonical synaptic site and relied on shared molecular machinery. Using a mouse model, the research team -- led by Oliver Schlüter, associate professor of neuroscience in the Kenneth P. Dietrich School of Arts and Sciences -- discovered that the brain instead uses separate synaptic transmission sites to carry out regulation of these two types of activity, each with its own developmental timeline and regulatory rules.\n\n\"We focused on the primary visual cortex, where cortical visual processing begins,\" said Yue Yang, a research associate in the Department of Neuroscience and first author of the study. \"We expected spontaneous and evoked transmissions to follow a similar developmental trajectory, but instead, we found that they diverged after eye opening.\"\n\nAs the brain began receiving visual input, evoked transmissions continued to strengthen. In contrast, spontaneous transmissions plateaued, suggesting that the brain applies different forms of control to the two signaling modes.\n\nTo understand why, the researchers applied a chemical that activates otherwise silent receptors on the postsynaptic side. This caused spontaneous activity to increase, while evoked signals remained unchanged -- strong evidence that the two types of transmission operate through functionally distinct synaptic sites.\n\nThis division likely enables the brain to maintain consistent background activity through spontaneous signaling while refining behaviorally relevant pathways through evoked activity. This dual system supports both homeostasis and Hebbian plasticity, the experience-dependent process that strengthens neural connections during learning.\n\n\"Our findings reveal a key organizational strategy in the brain,\" said Yang. \"By separating these two signaling modes, the brain can remain stable while still being flexible enough to adapt and learn.\"\n\nThe implications could be broad. Abnormalities in synaptic signaling have been linked to conditions like autism, Alzheimer's disease and substance use disorders. A better understanding of how these systems operate in the healthy brain may help researchers identify how they become disrupted in disease.\n\n\"Learning how the brain normally separates and regulates different types of signals brings us closer to understanding what might be going wrong in neurological and psychiatric conditions,\" Yang said.",
  "summary": "A new study challenges a decades-old assumption in neuroscience by showing that the brain uses distinct transmission sites -- not a shared site -- to achieve different types of plasticity.",
  "published": "Tue, 03 Jun 2025 17:29:03 EDT",
  "url": "https://www.sciencedaily.com/releases/2025/06/250603172903.htm",
  "source": "Latest Science News -- ScienceDaily"
}