{
  "title": "Top shares to buy: Stock recommendations for today- check list",
  "text": "Top stocks to buy (AI image)\n\nStock market recommendations:\n\nAccording to Bajaj Broking Research, the top stock picks for November 21, 2025 are Fortis Healthcare, and Jio Financial Services. Here’s its view on Nifty and Bank Nifty:\n\nIndex View: NIFTY\n\nNIFTY BANK\n\nStock Recommendations:\n\nFortis Healthcare\n\nBuy at CMP ₹ 925\n\nTarget\n\n\n\nReturn\n\n\n\nTime Period\n\n\n\n₹ 1051\n\n\n\n~14 %\n\n\n\n6 Months\n\n\n\n\n\nJio Financial Services\n\nBuy in the range of 306-308.5\n\nTarget\n\n\n\nStop loss\n\n\n\nReturn\n\n\n\nTime Period\n\n\n\n₹ 340\n\n\n\n₹ 290\n\n\n\n~ 10.5%\n\n\n\n3 Months\n\n\n\n\n\n(Disclaimer: Recommendations and views on the stock market, other asset classes or personal finance management tips given by experts are their own. These opinions do not represent the views of The Times of India)\n\nBenchmark indices snapped its two weeks losing streak supported by record low India CPI data and as U.S. government shutdown came to an end. A majority for the ruling NDA party in the Bihar election further lifted sentiments. Nifty started the week on a positive note and rallied higher as the week progressed to form an intraweek high of 26010 on Thursday. Nifty traded with high volatility in last Friday’s session and closed the week at 25910.05 levels up by 1.64% on a weekly basis.Looking ahead, the bias stays positive. A sustained move above last month’s high of 26,100 could pave the way for a retest of the previous all-time high at 26,277 in this week.If Nifty fails to hold above 26,100, it may slip into a consolidation phase between 26,100 and 25,700 after its sharp 700-point rally over the past few sessions.Key short-term support lies at 25,500–25,300, where the 50-day EMA, a major previous breakout zone, and key retracement levels all converge.Bank Nifty had rallied over 600 points last week (+1.11%), closing at a new record high of 58,516.55 after hitting an all-time peak of 58,615.95, reflecting strong momentum across both PSU and private banks.Looking ahead, the index is expected to continue moving higher, with fresh all-time highs likely. The uptrend remains strong, supported by a consistent higher-high, higher-low pattern on the weekly chart.It is trading well above all major moving averages, with its support base steadily rising. Immediate support is seen near 57,600 — the earlier supply zone that has now turned supportive — followed by 57,200, which aligns with the lows of the past two weeks.On the upside, as the index heads into uncharted territory, the next resistance levels are at 59,300 and then 59,650, which matches the 61.8% Fibonacci extension of the previous weekly swing.While stochastic indicators suggest overbought conditions, any dips can still be used as buying opportunities.Fortis Healthcare is a leading integrated healthcare service provider in India. The healthcare verticals of the company primarily comprise hospitals, diagnostics and day care specialty facilities. Currently, the company operates its healthcare delivery services in India, Nepal, Dubai and Sri Lanka.The company controls its diagnostics business through its 57% owned subsidiary SRL Limited. It is amongst the largest private diagnostics chains. It has a presence in over 600 cities and towns, with an established strength of 415 laboratories, 8,200 direct clients and 1,400 collection centers.The company is entering a multi-year earnings upcycle supported by (1) the largest bed expansion program in its history, (2) rising ARPOB and occupancy levels driven by a richer case mix, (3) accelerating O&M-led network scaling without incremental capital, (4) diagnostics margin recovery toward industry standards (28%) , (5) Removal of key regulatory overhung following SEBI’s approval of the IHH open offer, and (6) a clear pathway to becoming net debt free by FY28.Valuation: We value Fortis Healthcare on FY28E EV/EBITDA multiple of 26x, with a target price of Rs. 1,051 given its transition into a structurally stronger, higher-growth driven quality-oriented hospital platform.The stock is forming a base and consolidating on the daily chart. It is trading near its key moving averages and has retested the breakout from its falling trendline resistance level.After a brief pullback, it has regained strength and closed above the previous day, indicating continued upside potential. The risk–reward setup looks positive, and the RSI moving above 50 further supports the bullish view.We expect the stock to move toward 340 in the near term, which aligns with the previous swing high.",
  "summary": "Stock market recommendations: Bajaj Broking Research highlights Fortis Healthcare and Jio Financial Services as top stock picks for November 21, 2025. Nifty and Bank Nifty show positive momentum, with Nifty eyeing its all-time high and Bank Nifty setting new records.",
  "published": "Fri, 21 Nov 2025 07:30:00 +0530",
  "url": "https://timesofindia.indiatimes.com/business/india-business/top-stock-recommendations-for-november-21-2025-fortis-healthcare-jio-financial-services-stocks-to-buy-today/articleshow/125468033.cms",
  "source": "Times of India"
}