{
  "title": "Red Fort blast echo in Jammu as key prisons are searched",
  "text": "THE COUNTER Intelligence unit of J&K Police on Wednesday conducted searches in the high security Kot Bhalwal jail here and the district jail in border Poonch district.\n\nThe searches formed part of the continued stepped up vigil by police and security forces following unearthing of the pan-India “white collar” terror module and subsequent explosion in Delhi’s Red Fort area on November 10.\n\nThe Kot Bhalwal jail houses a number of hardcore Pakistani and local terrorists, besides notorious criminals. Sources said the searches were part of the J&K Police’s drive to dismantle Pakistan’s terror network.\n\nAfter the Red Fort blast, the prison staff too had carried out searches in various jails across Jammu province.\n\nWith police and security forces maintaining heightened vigil across the region, additional personnel have been deployed within the Mata Vaishno Devi shrine area and along the yatra tracks from Katra town. Additional check points have been set up along the yatra tracks from Katra town to the holy shrine and intensified frisking and checking of people in the area.\n\nThe security agencies have also been asked to expedite verification of individuals employed in shops operating along the yatra track and in Katra town, sources said.\n\nIn Jammu, police have already intensified patrolling and its teams are constantly monitoring CCTV footage from cameras installed across the city as part of strengthened security measures, sources said, adding that the quick reaction teams are also put in place to meet any eventuality.\n\nStory continues below this ad\n\nThe security has also been stepped up along the Jammu-Srinagar national highway and around vital installations and places of worship across Jammu region.",
  "summary": "",
  "published": "Thu, 20 Nov 2025 02:49:49 +0000",
  "url": "https://indianexpress.com/article/india/red-fort-blast-echo-in-jammu-as-key-prisons-are-searched-10375162/",
  "source": "India | The Indian Express"
}