{
  "title": "More than 250 arrested in Charlotte as US immigration crackdown escalates",
  "text": "More than 250 arrested in Charlotte as immigration crackdown escalates\n\nUS Border Patrol agents have arrested more than 250 people in Charlotte since Saturday\n\nBut local lawmakers and residents have railed against the detainments, which the federal government has dubbed \"Operation Charlotte's Web\". The state's Democratic governor has alleged people are being targeted because of their race.\n\nCharlotte is the latest US city that Trump has targeted with federal troops, following similar measures in bigger cities like Chicago and Los Angeles earlier this year. Officials with the Department of Homeland Security (DHS) told the BBC that those arrested are criminals and gang members.\n\nMore than 250 people have been arrested in Charlotte, North Carolina, as part of President Donald Trump's escalating crackdown on undocumented immigration, US officials say.\n\nIn a statement released on Wednesday, a DHS spokesperson said the operation has led to the arrest of \"some of the most dangerous criminal illegal aliens\", including gang members.\n\nOthers arrested had been convicted of a range of crimes, including assault on law enforcement, driving while intoxicated, theft and tampering with government documents, the department said earlier.\n\nNorth Carolina's Democratic Governor Josh Stein, who has denounced Trump's operations, accused agents of racially profiling residents.\n\n\"We've seen masked, heavily armed agents in paramilitary garb driving unmarked cars, targeting American citizens based on their skin colour, racially profiling and picking up random people in parking lots,\" Stein said on Sunday. \"This is not making us safer.\"\n\nThe city's mayor, also a Democrat, urged federal agents to operate with \"respect\" for the city's values. She also commended those who came out in droves on Saturday to protest the Trump administration's actions in the city.\n\n\"I am deeply concerned with many of the videos I've seen,\" Mayor Vi Lyles said. \"To everyone in Charlotte who is feeling anxious or fearful: you are not alone. Your city stands with you.\"\n\nDHS has not said how long the raids will last. Chicago's crackdown started in September and is still ongoing. Like other cities subject to immigration crackdowns, some migrants in Charlotte are staying home for fear of federal agents in the city, according to local media reports.\n\nStein says he's monitoring reports that the operation will come to Raleigh, another North Carolina city, next.\n\n\"Once again, I call on federal agents to target violent criminals, not neighbors walking down the street, going to church, or putting up Christmas decorations,\" he wrote.",
  "summary": "Charlotte's Democratic leaders say border agents are \"stoking fear\" in the city.",
  "published": "Thu, 20 Nov 2025 15:20:12 GMT",
  "url": "https://www.bbc.com/news/articles/ckgzge16vkdo?at_medium=RSS&at_campaign=rss",
  "source": "BBC News"
}