{
  "title": "Meta&#8217;s Hyperscape is ready to turn your real living room into a VR hangout",
  "text": "is a senior reporter covering technology, gaming, and more. He joined The Verge in 2019 after nearly two years at Techmeme.\n\nMeta’s impressive, photorealistic digital replicas of real places built using its “Hyperscape” capture tech, which uses the cameras on a Quest 3 or Quest 3S VR headset to scan a room, have so far been solitary spaces. If you wanted to visit a virtual version of a room in your house (or of Gordon Ramsay’s home kitchen), you could only do it on your own. But beginning this week, Meta is rolling out the ability to share links that will let other people visit Hyperscape rooms with you in a Quest 3 or 3S VR headset or via the Meta Horizon mobile app.\n\nUp to eight people will be able to be in one instance of a Hyperscape world, according to a Meta blog post, and it hopes to increase that number in the future. Meta is also “moving rendering on-device” and adding audio to Hyperscape worlds.\n\nHowever, you might be waiting a bit to actually be able to invite your friends to a space. Meta’s blog post urges readers to “please sit tight” if they don’t have the feature yet, and Meta spokesperson Rachel Holm says it will roll out “gradually to all users over the next few months.” And according to Holm, once the feature rolls out to you, you’ll have to rescan a space to be able to create a shareable world.\n\nThe feature is all part of Meta’s vision of a metaverse that includes both digital real-world spaces as well as games. According to Meta:\n\nAs the metaverse continues to take shape, we think a vibrant mix of experiences is key. Some days you might want to immerse yourself in an otherworldly adventure, which is where our vast library of VR apps and worlds comes into play. And other days, you might want to visit a digital replica of a physical space you might not have the opportunity to see otherwise. Or you might want to spend quality time with friends someplace a little closer to home. That’s what Hyperscape makes possible. By bringing you together in realistic digital replicas of physical spaces with the people who matter most, Hyperscape can make your experiences in the metaverse more meaningful and fun. In the future, we’re excited to see what creators build by mixing styles and approaches.\n\nI visited some rooms scanned with the Hyperscape Capture app earlier this year, and I was impressed with how good they looked. If you want an idea what they’re like, check out this YouTube video; the level of detail is similar to what I saw in my own demos.\n\nUpdate, November 20th: Added that you’ll have to rescan a room to be able to invite people to it.",
  "summary": "Meta’s impressive, photorealistic digital replicas of real places built using its “Hyperscape” capture tech, which uses the cameras on a Quest 3 or Quest 3S VR headset to scan a room, have so far been solitary spaces. If you wanted to visit a virtual version of a room in your house (or of Gordon Ramsay’s [&#8230;]",
  "published": "2025-11-20T16:35:01-05:00",
  "url": "https://www.theverge.com/news/825705/meta-hyperscape-social-links-capture-scan-metaverse",
  "source": "The Verge"
}