{
  "title": "GOP Aide Who Said Men Knifed Her And Wrote 'TRUMP WHORE' On Belly Is Charged",
  "text": "LOADING ERROR LOADING\n\nA New Jersey woman’s story of being slashed, bound and labeled a “TRUMP WHORE” in writing on her body fell apart, officials said Wednesday, leading to charges that she staged the incident.\n\nNatalie Greene, 26, of Ocean City, New Jersey, was charged with conspiracy to convey false statements and hoaxes and of making false statements to federal law enforcement, the U.S. Attorney’s Office in New Jersey announced.\n\nAdvertisement\n\nGreene was working for Rep. Jeff Van Drew (R-N.J.) at the time, outlets determined. An unnamed co-conspirator had claimed it was Greene’s association with the GOP lawmaker that attackers mentioned during their alleged assault July 23, according to the report.\n\nOfficers arrived to find a crying Greene tied up with numerous cuts and “TRUMP WHORE” written on her stomach and Van Drew (called Federal Official 1 in the news release) “IS RACIST” on her back, the summary noted. She said she had been threatened at gunpoint, held down and cut numerous times, officers said.\n\nThe suspect said attackers scrawled \"TRUMP WHORE\" on her stomach in an incident officials now say was a hoax. U.S. Attorneys Office\n\nAdvertisement\n\nBut investigators say they discovered she had paid a body “scarification” artist to deliberately cut her face and body in a pattern she had arranged. They said they also found zip ties in Greene’s car that were similar to the ones used in the alleged attack and that her co-conspirator had searched “zip ties near me” on a cellphone.\n\nA conviction would include a penalty of up to five years in prison.\n\nGreene is out on bond, according to the announcement.\n\n“At the age of 26, my client served her community working full time to assist the constituents of the Congressman with loyalty and fidelity,” her attorney, Louis M. Barbone, wrote in a release to HuffPost and other outlets on Thursday. “She did that while being a full-time student. Under the law, she is presumed innocent and reserves all of her defenses for presentation in a court of law.”\n\nVan Drew’s office issued a statement on Wednesday.\n\n“We are deeply saddened by today’s news, and while Natalie is no longer associated with the congressman’s government office, our thoughts and prayers are with her,” the lawmaker’s office told a radio station. “We hope she’s getting the care she needs.”\n\nAdvertisement",
  "summary": "The alleged victim was said to have been brutalized in the anti-Trump attack because of her association with an N.J. lawmaker.",
  "published": "Thu, 20 Nov 2025 11:08:03 -0500",
  "url": "https://www.huffpost.com/entry/natalie-greene-charged-trump-whore_n_691f1905e4b00ed8a94f4805",
  "source": "Politics"
}