{
  "title": "Texas firmly out, Miami in limbo and the G5’s flavor of the week",
  "text": "The latest CFP rankings keep Ohio State at the top of the pile, while Texas Tech slides into the No. 5 spot in Week 13. (2:35)\n\nOpen Extended Reactions\n\nIt's time for Texas to pack up.\n\nThe Longhorns plummeted to No. 17 on Tuesday night in the College Football Playoff selection committee's third of six rankings, indicating that even if they run the table and punctuate their résumé with a win against No. 3 Texas A&M, they might still be locked out.\n\nNotre Dame, though, should buy some furniture and move in. At No. 9 -- ahead of No. 10 Alabama -- the selection committee continued to reward the two-loss Irish for how they're playing -- not who they're beating. No. 10 Alabama has four wins against CFP top-25 opponents, including the committee's No. 4 team Georgia, No. 14 Vanderbilt, No. 20 Tennessee and No. 22 Mizzou, which snuck back into the ranking this week. Notre Dame's only win against a CFP-ranked team is against No. 15 USC.\n\nWhile the changes at the top were minimal, No. 24 Tulane is now the flavor of the week in the Group of 5 race after Navy knocked South Florida out of the same spot.\n\nWith only three Saturdays remaining before Selection Day, there are still games that can change the picture entirely, which leaves hope for some teams hovering on the bubble (here's lookin' at you, Miami).\n\nThe Bubble Watch accounts for what we have learned from the committee so far -- and historical knowledge of what it means for teams clinging to hope. Teams with Would be in status below are in this week's bracket based on the committee's third ranking. For each Power 4 conference, we've also listed Last team in and First team out. These are the true bubble teams hovering around inclusion. Teams labeled Still in the mix haven't been eliminated, but have work to do. A team that is Out will have to wait until next year.\n\nThe conferences below are listed in order of the number of bids they would receive, ranked from the most to least, based on this week's committee ranking.\n\nWeek 13 CFP Projected Bracket\n\nJump to a conference:\n\nACC | Big 12 | Big Ten\n\nSEC | Independent | Group of 5\n\nBracket\n\nSEC\n\nWould be in: Alabama, Georgia, Oklahoma, Ole Miss, Texas A&M\n\nLast team in: Alabama. The loss to Oklahoma didn't knock the Tide out of the committee's top 12, but it put No. 10 Alabama in must-win mode and will keep them ranked behind the Sooners. The Tide have only one SEC loss and still have the best chance of any team to reach the conference championship game (71.6%), according to ESPN Analytics.\n\nFirst team out: Vanderbilt. No. 14 Vandy jumped ahead of the three-loss Longhorns despite the head-to-head loss to Texas, but remains a long shot for the field as an at-large bid. The Commodores would need to beat Kentucky and Tennessee -- plus hope there is some chaos above them. Maybe -- maybe -- if Bama loses to Auburn in the Iron Bowl, Miami loses to Pitt, and BYU loses to Cincinnati -- it can open the door, but clearly multiple things need to work in their favor.\n\nStill in the mix: None.\n\nOut: Arkansas, Auburn, Florida, Kentucky, LSU, Mississippi State, Missouri, South Carolina, Tennessee, Texas\n\nBig Ten\n\nWould be in: Indiana, Ohio State, Oregon\n\nLast team in: Oregon. This could change quickly if Oregon loses at home to USC on Saturday, as there are questions in the room about the Ducks' No. 31 schedule strength. The Nov. 8 win at Iowa was impressive, but the Hawkeyes are now a four-loss team and dropped out of the top 25. The Ducks also have a double-digit home loss to Indiana, which is why their chances of reaching the Big Ten title game are only 12%.\n\nFirst team out: USC. Like Oregon, USC just boosted its résumé with a gritty, close win against a talented Iowa team that fell out of the ranking with its fourth loss. The Trojans' two losses were by a total of 12 points to Illinois and Notre Dame -- and were both on the road. USC has a critical win against No. 18 Michigan, which boosts its status and gives the Trojans a tiebreaker in the Big Ten standings. If USC can win at Oregon (and avoid an embarrassing home loss to UCLA), the Trojans can unseat the Ducks as the Big Ten's last team in. They would likely finish behind Notre Dame, though, because of the head-to-head result.\n\nStill in the mix: Michigan. The difference between No. 18 Michigan and No. 17 Texas is that the Wolverines are still mathematically eligible to reach the Big Ten title game with a 3.6% chance, according to ESPN Analytics. The Wolverines avoided elimination Saturday with a narrow 24-22 win at Northwestern. They still have a chance to beat the committee's No. 1 team in rival Ohio State, and nobody in the country would have a better win if that happens. If Michigan can run the table, it would have one of the best two-loss résumés in the country but would be ranked behind USC unless the Trojans lose again. If USC loses to Oregon, and Oregon loses to Washington -- and Michigan runs the table -- the Wolverines will have a strong case to be the Big Ten's third team in. The Week 2 loss to Oklahoma looks better now that the Sooners are a top-10 team.\n\nOut: Illinois, Iowa, Maryland, Michigan State, Minnesota, Nebraska, Northwestern, Penn State, Purdue, Rutgers, UCLA, Washington, Wisconsin\n\nBig 12\n\nWould be in: Texas Tech\n\nLast team in: Texas Tech. At No. 5, the Red Raiders are within arm's reach of a first-round bye and have the best chance of winning the Big 12 (69.5%), according to ESPN Analytics. Texas Tech has a bye this week but can clinch a spot in the Big 12 title game if both Cincinnati and Arizona State lose. The Oct. 18 loss to Arizona State won't keep Texas Tech out of the CFP if it finishes as a two-loss Big 12 runner-up, given how highly the committee has regarded Texas Tech to this point. The chances of that became even better after Arizona State appeared in the ranking at No. 25, easing some of the pain of that loss. The Red Raiders end the regular season at 4-7 West Virginia.\n\nAll of ESPN. All in one place. Watch your favorite events in the newly enhanced ESPN App. Learn more about what plan is right for you. Sign Up Now\n\nFirst team out: BYU. The Cougars put it all together during Saturday's dominant win against TCU, but they would be excluded from the playoff today in order to make room for one of the five highest ranked conference champions. BYU still has the second-best chance to reach the Big 12 title game (80.2%) behind Texas Tech (97.5%). They can clinch a spot with a win Saturday against Cincinnati and losses by both Arizona State and Houston. If BYU wins the league, it's a CFP lock. If BYU loses, though, it would depend on how close the game is. The selection committee is unlikely to reward BYU with an at-large bid if it plays as poorly as it did against Texas Tech during the regular season.\n\nStill in the mix: Arizona State, Cincinnati, Utah. According to ESPN Analytics, Utah still has an 11.9% chance to reach the Big 12 championship, followed by ASU (8.4%) and Cincinnati (1.9%).\n\nOut: Arizona, Baylor, Colorado, Houston, Iowa State, Kansas, Kansas State, Oklahoma State, TCU, UCF, West Virginia\n\nACC\n\nWould be in: Miami\n\nLast team in: Miami. The No. 13 Canes are listed here because they are the selection committee's highest-ranked ACC team and are still mathematically eligible to reach the conference championship game. Until the participants of that game are clear, the committee's highest-ranked ACC team will continue to appear here. With six teams still in contention, the most fair representative is the committee's. Still, Miami's best chance at reaching the CFP right now is through an at-large bid because the Canes only have a 7.1% chance to reach the ACC title game. To get that at-large bid, Miami still needs to beat both Virginia Tech and Pitt and hope for losses above it to move into the top 10. The ACC champion will earn the No. 11 seed and the Group of 5 champion will have the No. 12 seed, so Miami needs to jump to No. 10 by Selection Day. It's not inconceivable if Alabama loses to Auburn, BYU loses to Cincinnati and Utah loses to either K-State or at Kansas. It will take more than one of those things -- if not all three. The question will be if the committee ever revisits Miami's head-to-head win against Notre Dame in the season opener. The Canes would likely have to creep closer to the Irish in their ranking for them to be comparable enough to use that tiebreaker. Georgia Tech can clinch a spot in the game with a win against Pitt on Saturday, and Virginia can clinch with losses by Duke, Pitt and SMU.\n\nAllstate Playoff Predictor How will this season's top games affect the College Football Playoff chase? What are the current odds for the top four? The Allstate Playoff Predictor has the answers. Check back every week as the odds are updated following that week's games.\n\nFirst team out: Georgia Tech. The Yellow Jackets beat a 1-10 Boston College team by two points in spite of themselves and are a win away from a guaranteed appearance in the ACC championship game. They've also got a chance to earn a top-5 win in the regular-season finale against Georgia. If Georgia Tech doesn't beat Georgia, it would need to win the ACC to reach the playoff because a three-loss ACC runner-up is out.\n\nStill in the mix: Duke, Pitt, SMU, Virginia. Virginia has the best chance to reach the ACC title game (77.7%); SMU is third (38%), followed by Duke (11%), Miami and Pitt (7%).\n\nOut: Boston College, Cal, Clemson, Florida State, Louisville, North Carolina, NC State, Stanford, Syracuse, Virginia Tech, Wake Forest\n\nIndependent\n\nWould be in: Notre Dame. At No. 9 and ahead of two-loss Alabama, Notre Dame is winning the eye test, because it is ranked behind Alabama in both Strength of Record and Strength of Schedule. Alabama has the No. 4 schedule in the country, while the Irish are No. 29. Notre Dame's best wins are against USC, Navy and Pitt, with only No. 15 USC ranked this week. As long as the Irish end the season with wins against Syracuse and Stanford, their place in the playoff should be secure.\n\nGroup of 5\n\nWould be in: Tulane. The Green Wave have decent wins against Northwestern, Duke and Memphis, and the best combination of eye test and résumé of the current contenders. Tulane's No. 71 schedule strength is better than James Madison (No. 119), North Texas (No. 127) and Navy (No. 74). Tulane and North Texas are the most likely teams to play for the American Conference championship, but North Texas has the best chance to win the league (61.4%), according to ESPN Analytics.\n\nStill in the mix: James Madison, Navy, North Texas. Of these teams, JMU has the best strength of record (No. 24) and game control (No. 40) ranks, but the worst strength of schedule (No. 119). Navy has the best win -- against South Florida -- and the best loss (to Notre Dame), but lost to North Texas.\n\nBracket\n\nBased on the committee's third ranking, the seeding would be:\n\nFirst-round byes\n\nNo. 1 Ohio State (Big Ten champ)\n\nNo. 2 Indiana\n\nNo. 3 Texas A&M (SEC champ)\n\nNo. 4 Georgia\n\nFirst-round games\n\nOn campus, Dec. 19 and 20\n\nNo. 12 Tulane (American champ) at No. 5 Texas Tech (Big 12 champ)\n\nNo. 11 Miami (ACC champ) at No. 6 Ole Miss\n\nNo. 10 Alabama at No. 7 Oregon\n\nNo. 9 Notre Dame at No. 8 Oklahoma\n\nQuarterfinal games\n\nAt the Goodyear Cotton Bowl, Capital One Orange Bowl, Rose Bowl presented by Prudential and Allstate Sugar Bowl on Dec. 31 and Jan. 1.\n\nNo. 12 Tulane/No. 5 Texas Tech winner vs. No. 4 Georgia\n\nNo. 11 Miami/No. 6 Ole Miss winner vs. No. 3 Texas A&M\n\nNo. 10 Alabama/No. 7 Oregon winner vs. No. 2 Indiana\n\nNo. 9 Notre Dame/No. 8 Oklahoma winner vs. No. 1 Ohio State",
  "summary": "Trying to make sense of the constantly evolving playoff picture, conference by conference.",
  "published": "Thu, 20 Nov 2025 18:47:23 EST",
  "url": "https://www.espn.com/college-football/story/_/id/46988531/college-football-playoff-2025-bubble-watch-week-12",
  "source": "www.espn.com - TOP"
}