{
  "title": "Karoline Leavitt Doesn't Think Trump's Death Threats To Democrats Are A Big Deal",
  "text": "LOADING ERROR LOADING\n\nAsked about President Donald Trump’s unhinged social media post in which he boosted a message calling for the execution of members of Congress, White House press secretary Karoline Leavitt dismissed the threat, saying that no one should “defy” Trump.\n\nTrump reposted a message on his Truth Social page Thursday that said “HANG THEM GEORGE WASHINGTON WOULD !!” He wrote his own post that said, “SEDITIOUS BEHAVIOR, punishable by DEATH!”\n\nAdvertisement\n\nThe comments were in response to Democratic veterans in Congress who released a video urging members of the military not to follow unlawful orders.\n\nRep. Jason Crow (D-Colo.), one of the six Democrats in the video, said Wednesday that the group made the video out of concern for potential future illegal orders by Trump.\n\n“It’s called SEDITIOUS BEHAVIOR AT THE HIGHEST LEVEL,” the president wrote in a post. “Each one of these traitors to our Country should be ARRESTED AND PUT ON TRIAL. Their words cannot be allowed to stand - We won’t have a Country anymore!!! An example MUST BE SET. President DJT.”\n\nAdvertisement\n\nLeavitt dismissed Trump’s threats, saying that the real issue is Democrats telling service members not to follow unlawful orders.\n\n“Let’s be clear about what the president is responding to, because many in this room want to talk about the president’s response, but not what brought the president to responding in this way,” Leavitt told reporters. “You have sitting members of the United States Congress who conspired together to orchestrate a video message to members of the United States military … encouraging them to defy the president’s lawful orders. The sanctity of our military rests on the chain of command.”\n\nU.S. military service members have a right to refuse illegal orders and can be prosecuted for following “manifestly unlawful orders.”\n\nAdvertisement\n\nLeavitt argued that the video teaches service members “that you can defy [Trump] and you can betray your oath of office.”\n\n“That is a very dangerous message, and it, perhaps, is punishable by law,” she said. “I’m not a lawyer, I’ll leave that to the Department of Justice and Department of War to decide.”\n\nSen. Rand Paul (R-Ky.) told HuffPost that Trump’s death threats “might be overkill.”\n\n“I’m against hanging other senators, I know that’s outlandish,” Paul said. “You can ask me again next week, but I think hanging senators might be overkill.”",
  "summary": "The press secretary argued that President Donald Trump's social media messages about the death penalty aren't the real cause for concern.",
  "published": "Thu, 20 Nov 2025 15:19:30 -0500",
  "url": "https://www.huffpost.com/entry/karoline-leavitt-trump-death-threats_n_691f66e9e4b047290e293efb",
  "source": "Politics"
}