{
  "title": "Human-caused dust events are linked to fallow farmland",
  "text": "An average of more than 1 million acres of idled farmland a year is a significant contributor to a growing dust problem in California that has implications for millions of residents' health and the state's climate.\n\nA new study published in Communications Earth and Environment by UC Merced professors Adeyemi Adebiyi and John Abatzoglou finds that the Central Valley accounts for about 77% of fallowed land in California and is associated with about 88% of major anthropogenic, or human-caused, dust events.\n\n\"Idled farmland and dust are particularly concentrated in Kern, Fresno and Kings counties, where annual crops such as wheat, corn, and cotton are fallowed as part of agricultural practices or a combination of water and economic decisions,\" said Abatzoglou, a climatologist in the Department of Management of Complex Systems in the School of Engineering. \"When fields are unplanted, wind erosion can create dust.\"\n\nDust can be laced with chemicals and pathogens that cause severe respiratory illnesses or death. For example, Valley fever, caused by a fungus, relies on dust to spread. Particulate matter has also been linked to various forms of dementia, cardiovascular problems, COPD, asthma, and perhaps surprisingly, longer and more painful menstrual cycles. Vulnerable groups disproportionately bear these health impacts.\n\nIn addition to health problems, a significant reduction in visibility during dust storms has resulted in fatal traffic accidents. Dust storms can also reduce agricultural productivity due to the loss of fertile topsoil and abrasion of crops by airborne particles, which is particularly critical given the state's role as the leading agricultural producer in the United States.\n\n\"California, particularly the Central Valley, has not been considered an important dust source,\" said Adebiyi, who studies dust and its impacts as a member of the Department of Life and Environmental Sciences in the School of Natural Sciences and as an affiliate of the Health Sciences Research Institute. \"However, we're beginning to see, with recent events, that the Central Valley is a major contributor, and much of its dust comes from agricultural sources.\"\n\nAlthough researchers don't fully understand dust's effects on climate, they do know that when dust settles on the Sierra Nevada snowpack, it darkens the snow and encourages melting earlier in the year than usual. That impacts critical water resources for people around the state.\n\nFallowed acreage varies year to year, but the researchers found that the geographic coverage of these unfarmed lands expanded between 2008 and 2022, and that growth could be linked to an increase in dust activities.\n\nAlthough it is common to rotate crops and idle lands regularly, the expansion of unplanted lands is partly due to the Sustainable Groundwater Management Act, which requires farmers to limit the water they use yearly.\n\n\"The goal of the Sustainable Groundwater Management Act is clearly to balance groundwater, which is important for California's future,\" Adebiyi said. \"However, there are unintended consequences to nearby communities, such as potential dust that comes from farmland fallowed due to SGMA, and what is crucial are those mitigation efforts that can reduce wind erosion.\"\n\nThe researchers suggested farmers consider cover crops or ground cover that increases soil health and reduces dust.\n\nWidespread dust events are generally driven by weather, such as strong winds or storms, but dust becomes more likely when soil is dry and disturbed, the latter being human-caused, Abatzoglou said. Human activity, including construction and farming, heavily drives localized dust.\n\nContinued research, such as this study and another recent one that resulted in a report from a coalition called UC Dust, will help researchers better understand dust's impacts on a wide range of concerns and challenges.\n\n\"A better understanding of what likely dominates anthropogenic dust from agricultural sources may help us better represent the overall impacts of dust in other parts of the country and the world,\" Adebiyi said.\n\nOne of the biggest unknowns in simulating climate and health impacts of dust in the future is how anthropogenic dust may change.\n\n\"Because our study points to fallowed or idled farmlands as a dominant contributor, that may change how we estimate overall dust impact,\" he said.",
  "summary": "California Central Valley, which is known for the agriculture that produces much of the nation's fruits, vegetables and nuts, is a major contributor to a growing dust problem that has profound implications for people's health, safety and well-being.",
  "published": "Mon, 02 Jun 2025 15:47:22 EDT",
  "url": "https://www.sciencedaily.com/releases/2025/06/250602154722.htm",
  "source": "Latest Science News -- ScienceDaily"
}