{
  "title": "Some fans whistle as Lionel Messi's name is announced as Paris Saint-Germain's season hits new low",
  "text": "CNN —\n\nParis Saint-Germain’s miserable season went from bad to worse on Sunday as the team suffered a second straight home defeat with a 1-0 loss to Lyon.\n\nEven before the game kicked off, Lionel Messi bore the brunt of the frustrations of some PSG fans who whistled when his name appeared on the big screen during the announcement of the starting lineup.\n\nAfter Alexadre Lacazette missed a first-half penalty, Bradley Barcola’s goal 10 minutes into the second period was enough to earn Lyon the three points on a night that PSG rarely looked like threatening the visiting goal.\n\nLens’ 1-0 victory over Rennes and Marseille’s 1-1 draw with Montepellier means both teams are now just six points behind PSG at the top of Ligue 1, and even the domestic title may slip from the team’s grasp.\n\nThe reaction of some fans on Sunday must have felt a world away from the adulation and worship Messi received during his recent return to Argentina for friendlies against Panama and Curaçao as the country continued its World Cup celebrations.\n\nMessi’s arrival at the Parc des Princes was supposed to be the missing piece that would help PSG finally win the Champions League, the trophy the club’s Qatari owners crave the most.\n\nKylian Mbappé was also helpless to prevent the defeat. Sarah Meyssonnier/Reuters\n\nSo far, the only major trophy the team has won since Messi joined was Ligue 1 last season, a title – it’s fair to say – PSG would likely have won without him.\n\nMessi has 34 goal contributions in all competitions for PSG this season – 18 goals and 17 assists – second only to Mbappé’s 38 and head coach Christophe Galtier refused to lay the blame for the team’s failures at the Argentine’s feet.\n\n“I found it [the jeering] hard to listen to,” Galtier told reporters, per the Athletic. “There may be expectations for Messi and Mbappe to unlock difficult situations. Messi tries very hard, they didn’t all work out; but around him, the other players also need to do their jobs.”\n\n“We can’t expect everything from Leo and Kylian,” he added.\n\nUp next for PSG is a season-defining week as Galtier’s side travels to a Nice team that is unbeaten in 13 matches, before hosting Lens at the Parc des Princes.\n\nPSG has lost two of its three matches since being dumped out of the Champions League by Bayern Munich last month, and only limped past relegation-threatened Brest with a 90th minute Kylian Mbappé winner.\n\nAfter his team’s victory, Lyon head coach Laurent Blanc said the Champions League or bust mentality has been detrimental to PSG’s performances.\n\n“Paris’ problem is when the No. 1 objective of the Champions League is no longer accessible, it seems that the season no longer exists – and at all levels,” he told reporters.",
  "summary": "Paris Saint-Germain's miserable season went from bad to worse on Sunday as the team suffered a second straight home defeat with a 1-0 loss to Lyon.",
  "published": "Mon, 03 Apr 2023 11:02:06 GMT",
  "url": "https://www.cnn.com/2023/04/03/football/lionel-messi-psg-whistles-fans-spt-intl/index.html",
  "source": "CNN.com - RSS Channel - App International Edition"
}