{
  "title": "Microquasars emerge as the Milky Way’s most extreme particle engines",
  "text": "Milestone results released by the Large High Altitude Air Shower Observatory (LHAASO) on November 16 have finally clarified a decades-old puzzle in astrophysics: the unusual drop in cosmic ray counts above 3 PeV that produces what scientists call the \"knee\" in the cosmic ray energy spectrum.\n\nThe cause of this steep decline has remained mysterious since it was first identified nearly 70 years ago. Researchers long suspected that the feature reflects the highest energies that cosmic ray sources can reach, marking a shift in the spectrum from one power-law behavior to another.\n\nMicro-quasars emerge as the likely origin of the \"knee\"\n\nTwo new studies -- published in National Science Review and Science Bulletin -- now point to micro-quasars powered by black hole accretion as the leading explanation. These studies show that these compact systems act as extremely powerful particle accelerators within the Milky Way and can plausibly generate the energies associated with the \"knee.\" The findings also deepen scientific understanding of how black hole systems drive extreme physical processes.\n\nThe research team included scientists from the Institute of High Energy Physics of the Chinese Academy of Sciences (CAS), Nanjing University, the University of Science and Technology of China of CAS, La Sapienza University of Rome, and several additional institutions.\n\nLHAASO detects ultra-high-energy emission from five micro-quasars\n\nBlack holes in binary systems pull in matter from companion stars, creating relativistic jets that transform these systems into \"micro-quasars.\" LHAASO has now detected ultra-high-energy gamma rays from five such objects: SS 433, V4641 Sgr, GRS 1915+105, MAXI J1820+070, and Cygnus X-1. This marks the first time these sources have been systematically observed at such high energies.\n\nOne of the most striking results comes from SS 433, where the detected gamma rays overlap with a massive atomic cloud. This strongly indicates that the black hole accelerates high-energy protons which then collide with the surrounding material. Proton energies in SS 433 exceeded 1 PeV, and the total power reached approximately 1032 joules per second, a level comparable to the energy released each second by four trillion of the most powerful hydrogen bombs. Another micro-quasar, V4641 Sgr, produced gamma rays reaching 0.8 PeV, identifying it as another \"super PeV particle accelerator.\" The parent particles behind these gamma rays carried energies above 10 PeV.\n\nThese observations confirm that micro-quasars are capable of accelerating particles to PeV levels across the Milky Way. This resolves a long-standing tension in cosmic ray research: while supernova remnants are known to produce cosmic rays, both data and theory suggest they cannot account for the energies seen at and above the \"knee.\"\n\nLHAASO measures proton energies once thought impossible to isolate\n\nUnderstanding the full picture requires precise measurements of the energy spectra of different cosmic ray species and their individual \"knees.\" Measuring the spectrum of protons (the lightest nuclei) is the first and most crucial step. Yet protons in the \"knee\" energy range are extremely rare, and satellite detectors have limited coverage, making such observations extraordinarily challenging. Ground-based methods introduce atmospheric interference, which historically made it almost impossible to distinguish protons from heavier nuclei.\n\nUsing its advanced cosmic ray detection facilities, LHAASO developed multi-parameter analysis techniques that allowed researchers to identify a statistically large and highly pure sample of protons. This enabled a precise measurement of their energy spectrum that rivals the accuracy of satellite-based instruments. The results revealed an unexpected structure: instead of a smooth shift between power-law behaviors, the proton spectrum contains a distinct new \"high-energy component.\"\n\nMultiple cosmic accelerators shape the Milky Way's particle environment\n\nWhen combined with proton data from the AMS-02 satellite at lower energies and the intermediate-energy measurements from the DArk Matter Particle Explorer (DAMPE), the results show that the Milky Way hosts multiple types of accelerators. Each has its own characteristic energy limit. The \"knee\" marks the maximum energy reached by sources that produce the newly identified high-energy component.\n\nThe intricate structure of the proton spectrum suggests that PeV cosmic rays are largely produced by \"new sources\" such as micro-quasars, which can accelerate particles to significantly higher energies than supernova remnants. This ability allows them to generate the particles responsible for the \"knee\" and those that extend beyond it.\n\nBlack hole jet systems linked directly to the cosmic ray \"knee\"\n\nTogether, the discoveries form a consistent explanation. They resolve the long-debated origin of the \"knee\" and provide compelling observational evidence for the role of black hole systems in producing cosmic rays.\n\nLHAASO's hybrid detector array enables both the detection of high-energy gamma rays from cosmic accelerators and precise measurements of the cosmic rays that reach near-Earth space. This dual capability offers new insights into the acceleration limits of astrophysical sources and the spectral signatures they contribute. For the first time, scientists have been able to directly connect the \"knee\" to a specific class of objects: black hole jet systems.\n\nLHAASO, designed, built, and operated by Chinese scientists, has become a global leader in high-energy cosmic ray research due to its exceptional sensitivity in gamma-ray astronomy and precision cosmic ray measurements. Its achievements continue to expand understanding of the universe's most extreme processes.",
  "summary": "LHAASO has uncovered that micro-quasars, black holes feeding on companion stars, are powerful PeV particle accelerators. Their jets produce ultra-high-energy gamma rays and protons that exceed long-held expectations. Precise cosmic-ray measurements reveal a new high-energy component, suggesting multiple sources within the Milky Way. These findings finally tie the “knee” structure to black hole jet systems.",
  "published": "Sun, 16 Nov 2025 11:46:04 EST",
  "url": "https://www.sciencedaily.com/releases/2025/11/251116105513.htm",
  "source": "All Top News -- ScienceDaily"
}