{
  "title": "The hidden brain bias that makes some lies so convincing",
  "text": "Detecting dishonesty requires people to interpret social cues, judge intent, and decide whether someone's words are trustworthy. Scientists have long wondered how we sort through this kind of social information and how we decide if someone is being honest. A key question is whether people evaluate information in the same way when it comes from a close friend or from someone they barely know.\n\nTo explore this, Yingjie Liu from North China University of Science and Technology led a research team investigating how people judge information depending on the relationship they share with the communicator.\n\nStudying Deception Through Brain Imaging\n\nAccording to findings published in JNeurosci, the researchers used a neuroimaging method to observe brain activity in 66 healthy adults. Pairs of participants sat facing each other but interacted through computer screens, allowing the scientists to control the flow of information. Each message the participants exchanged had consequences that were described as either a \"gain\" or a \"loss.\" A \"gain\" referred to information that benefited both individuals in the pair, while a \"loss\" referred to information that produced a negative outcome. Contributing researcher Rui Huang explained, \"The key reason we chose 'gain' and 'loss' contexts is that they illustrate how people adjust decision-making in response to potential rewards or punishments.\"\n\nThe team discovered that people were more likely to trust false information during \"gain\" situations, and this behavior corresponded with activation in regions of the brain that process reward, assess risk, and interpret others' intentions. This suggests that the promise of a positive outcome can strongly influence whether a lie seems believable, even if the information should raise doubts.\n\nFriends Show Unique Brain Patterns During Deception\n\nOne of the most striking findings involved the role of friendship. When the person delivering the potentially deceptive information was considered a friend, both individuals showed synchronized brain activity. This synchrony shifted depending on the context. For example, brain regions involved in reward showed greater alignment during \"gain\" scenarios, while regions tied to risk evaluation became more synchronized during \"loss\" moments. This shared activity provided enough information for researchers to predict when a participant was likely to be deceived by a friend.\n\nWhy People May Trust Rewarding Lies\n\nTaken together, the results indicate that people may be especially vulnerable to believing lies when the information suggests the possibility of a \"gain.\" The study also highlights how the brain processes social information differently between friends, which may make it harder to accurately judge the truthfulness of what is being said. This combination of reward-driven thinking and interpersonal connection appears to influence how people weigh honesty, potentially leading them to accept false information more easily in certain situations.",
  "summary": "People are more likely to believe lies when there’s the possibility of a reward. Neuroimaging shows that the brain shifts into reward or risk mode depending on whether the context involves a gain or a loss. Friends show synchronized brain activity that can predict successful deception. Social bonds and incentives can subtly warp how we judge honesty.",
  "published": "Mon, 17 Nov 2025 07:38:54 EST",
  "url": "https://www.sciencedaily.com/releases/2025/11/251116105629.htm",
  "source": "All Top News -- ScienceDaily"
}