{
  "title": "UK is worst-performing market for JD Sports as youth unemployment hits sales",
  "text": "Unemployment among young people in the UK is hitting sales growth and profits at JD Sports, the owner of the trainer and sportwear chain has said, amid warnings about the high number of under-25s not in work, education or training.\n\nThe UK was the worst-performing market for JD Group, which also owns Blacks, Go Outdoors and a number of US and European sports chains.\n\nRégis Schultz, the chief executive, said JD was experiencing “pressures on our core customer demographic, including rising unemployment levels, as well as near-term volatility around consumer sentiment”.\n\nHis comments came as official figures on Thursday showed the number of 16- to 24-year-olds who are not in education, employment or training (Neet) remains stubbornly close to the highest level in a decade.\n\nDespite a modest decline in the three months to September to 946,000, down from 948,000 in the previous quarter, campaigners said the figures from the Office for National Statistics showed Britain was at risk of failing a whole generation of young people.\n\nThe figures mean one in eight young people are Neet amid a rapid increase in unemployment more broadly, with the official jobless rate at 5%, the highest level since the Covid pandemic. Last week the Guardian revealed that almost half of all jobs shed since Labour came to power were among the under-25s.\n\nBarry Fletcher, the chief executive of the Youth Futures Foundation, said: “This is a long-term problem that continues to negatively shape the lives of too many across the country.”\n\nThe squeeze on spare cash for young people contributed to a 3.3% slide in sales at established JD Group stores in the three months to 1 November. Sales were also down in the US and EU – by 1.7% and 1.1% respectively – amid similar pressures as well as a lack of new product launches to draw in shoppers and the slowdown in the trend for women’s vintage trainers.\n\nThe company has also suffered from a heavy reliance on Nike, which has been struggling to spur consumer interest recently with critics pointing to a lack of new ideas.\n\nskip past newsletter promotion Sign up to Business Today Free daily newsletter Get set for the working day – we'll point you to all the business news and analysis you need every morning Enter your email address Sign up Privacy Notice: Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on theguardian.com to send you this newsletter. You can complete full registration at any time. For more information about how we use your data see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nJD said annual profits would now be at the lower end of expectations, at about £853m, compared with a once-hoped-for £1bn. It was “taking a pragmatic approach” to its outlook for this financial year, due to “incrementally weaker macro and consumer indicators in recent weeks”.\n\nAarin Chiekrie, an equity analyst at the broker Hargreaves Lansdown, said: “Trading across the UK remains particularly weak, with recent changes to employer taxes and minimum wages bringing a handful of extra costs and challenges.”\n\nThe weak numbers came as another youth brand, Dr Martens, said consumers were “cautious right now” and “looking for deals” right across Europe and in the US. The British bootmaker said it was putting up prices on some items in the US in January to offset the impact of Trump’s import tariffs, which amounted to between £7m and £9m.",
  "summary": "<p>Lack of spare cash among under-25s feeds slide in sales with annual profits to be at lower end of expectations</p><p>Unemployment among young people in the UK is hitting sales growth and profits at JD Sports, the owner of the trainer and sportwear chain has said, amid warnings about the high number of under-25s not in work, education or training.</p><p>The UK was the worst-performing market for JD Group, which also owns Blacks, Go Outdoors and a number of US and European sports chains.</p> <a href=\"https://www.theguardian.com/business/2025/nov/20/uk-is-worst-performing-market-for-jd-sports-as-youth-unemployment-hits-sales\">Continue reading...</a>",
  "published": "Thu, 20 Nov 2025 15:59:50 GMT",
  "url": "https://www.theguardian.com/business/2025/nov/20/uk-is-worst-performing-market-for-jd-sports-as-youth-unemployment-hits-sales",
  "source": "The Guardian"
}