{
  "title": "US tariffs cast shadow over Nuevo Leon’s steel industry in Mexico",
  "text": "Mexican steel and aluminium exports to the US are down because of tariffs, hurting local small businesses.\n\nMonterrey, Mexico – For nearly the whole year, only one of the five machines at a metal products workshop in Apodaca, Nuevo Leon, in northern Mexico, has been operational. The small business was forced to drastically reduce its production capacity after United States President Donald Trump imposed tariffs on steel and aluminium.\n\n“It affected us greatly,” Jose David Garcia Torres, chief of operations at Maquinados Bera, told Al Jazeera. “Many companies decided to halt production, and our services were no longer needed. We were stopped for months, literally doing nothing.”\n\nThe US initially implemented 25 percent tariffs on steel imports in March and doubled that to 50 percent in June. In the first seven months of the year, the latest data available, Mexican steel and aluminium exports to the US fell 29 percent and 21 percent, in value, respectively, according to data from the US Department of Commerce.\n\nTariff negotiations are continuing after Mexican President Claudia Sheinbaum and Trump spoke by phone on October 25. A 90-day extension of tariff pause on most items other than steel, copper and aluminium, expected to expire on October 31, was extended for “a few more weeks”, Sheinbaum said.\n\nBelem Iliana Vasquez Galan, an economics professor at Colegio de la Frontera, a research institute in Monterrey, told Al Jazeera that these recent tariffs have a broad reach, encompassing all products containing steel and aluminium.\n\n“It’s not just the steel industry but also the automotive industry, the production of electronic goods, machinery, everything that includes some steel, aluminium or copper,” she said.\n\nAdvertisement\n\nNuevo Leon’s governor, Samuel Garcia, declared at a September trade show that the state’s steel and aluminium industry has been affected by tariffs applied under Section 232 of the Trade Expansion Act of 1962, which allows the US president to impose tariffs for national security interests. At the event, Garcia pledged support for major companies like Nemak and Ternium, which Al Jazeera couldn’t reach for comment.\n\nIn recent years, Nuevo Leon, known as Mexico’s industrial powerhouse, has grandly announced significant foreign investments, rebranding itself as a leading city in nearshoring. This was largely driven by the announcement of the construction of a Tesla Gigafactory in March 2023. This project, which brought immense pride to the region and the country, is now widely considered cancelled after Tesla CEO Elon Musk put it on hold in July 2024 due to uncertainty over trade policies between Mexico and the US and in the lead-up to the US elections that year. The Mexican government insists it is merely on hold.\n\nThis uncertainty has significantly impacted small companies that once believed the influx of foreign investment would benefit them directly.\n\n“If they’re receiving all those investments, I think it’s more for larger companies. We, the workshops, are more abandoned,” Garcia Torres said.\n\nPreviously, high production demand in Nuevo Leon had benefitted small workshops like Maquinados Bera, even those not directly connected to large corporations. “Before, it was like, ‘I have so much work, I’m at capacity.’ People would call you to offer work, not to ask for it,” Garcia Torres added.\n\nJorge Rodriguez, who runs a metalworks workshop in Cadereyta, a predominantly agricultural and livestock municipality 40km (25 miles) southeast of Monterrey, agreed there was a slowdown in orders in the months leading up to the presidential elections in both countries. However, work came to a standstill at the beginning of this year after Trump’s tariff announcements and the resulting climate of uncertainty.\n\n“Purchase orders have decreased significantly,” he said. “The companies I work for export their products. Their [exports] almost completely stopped, and I no longer manufacture anything for them.”\n\nEmmanuel Loo, Nuevo Leon’s deputy economy secretary, insisted the impact on the state’s industry has been minimal. Loo told Al Jazeera he views this new climate as an opportunity to strengthen local supply chains and increase global competitiveness.\n\n“What we’ve seen is a reorganisation of the steel production chain, in which Nuevo Leon industries have purchased from local industries,” Loo added.\n\nMade in Nuevo Leon\n\nFor some small businesses, tariffs meant halting production for large companies, such as machining bushings, pins for hoppers or creating all the fixtures and tooling needed to bend and assemble products. These businesses had to shift their focus to local individual demand and, in some cases, lay off workers.\n\nAdvertisement\n\nRodriguez told Al Jazeera that local demand has always existed, but industrial demand was so high that small businesses like his never prioritised it. This year, these smaller orders became their lifeline.\n\n“The money is in the industry, and it was good. But then the industry stopped, and we needed those people with smaller requests. They are smaller jobs, but ultimately they add up – 10, 15 orders – and then you can start paying salaries again,” he said.\n\nMaquinados Bera also sustained itself through small orders. Garcia Torres explained that, like some other businesses, it had to diversify its production and make machine parts it wasn’t accustomed to. “There was a person who asked us to make grills, and so we made them,” he said.\n\nThe Nuevo Leon government promotes local products, job creation and entrepreneur connections through its Made in Nuevo Leon initiative. Loo emphasised that the state is promoting tax incentives for companies that use local supply chains as well as loans for small and medium-sized businesses to invest in equipment and integrate into global value chains of key sectors like the automotive and high-tech industries.\n\nHowever, Vasquez said, integrating local small and medium-sized companies into global supply chains has always been challenging. Foreign companies’ high requirements in terms of both quantity and delivery time remain difficult for small businesses to meet.\n\n“Integration generally occurs solely for employment. In other words, the only benefit foreign companies bring is job creation,” she said.\n\nMade in Nuevo Leon has a lot in common with Plan Mexico, an initiative launched in January by Sheinbaum to boost Mexico’s global economic competitiveness and strengthen the domestic market. Analysts see a key challenge in ensuring domestic production finds a domestic market.\n\n“So how are you going to tell a company that currently allocates, let’s say, half of its exports to other markets to now sell in Mexico when there’s no market or when prices aren’t competitive?” Vasquez asked.\n\nThe challenges of creating conditions for domestic market growth in Mexico are intensifying as the United States-Mexico-Canada Agreement (USMCA) comes up for review next year. Loo told Al Jazeera in early October that the Nuevo Leon government is working with the US government to ensure Mexican aluminium and steel are treated equally under USMCA rules of origin, allowing them to be exported to the United States “virtually tariff-free”.\n\n“This is what we’re trying to do, not because the industry is being affected but because it’s a great area of ​​opportunity and competitiveness for Mexico as a country and region and for the steel and aluminium companies in our state,” he added.\n\nMexico’s integral role in US supply chains highlights the interwoven need for stronger supply chains.\n\n“We are at a crucial point in US-Mexico relations because the Mexican economy has always depended on the US economy and, through it, on international trade and foreign investment,” Vasquez said.\n\nAdvertisement\n\nTo protect its domestic industry, Mexico has applied temporary tariffs of up to 25 percent on steel imports from countries without a free trade agreement, such as China, Mexico’s second biggest trading partner after the US, a move many view as an attempt to placate Trump, as the US has been involved in a deep trade war with China.\n\nVasquez asks, “But how can Mexico benefit if it is also closing its doors to trade with the United States? In other words, it is neither allowing an agreement with China nor increasing its trade relationship with the United States.”\n\nMeanwhile, Garcia Torres and Rodriguez are beginning, albeit cautiously, to see glimmers of hope after months of uncertainty. All machines are now operating at Maquinados Bera. Although the orders are still minimal, they are starting to hear more about large companies returning to their previous production rhythms.\n\n“They [the companies] are telling me that things are improving,” Rodriguez said, “but I’m not getting excited any more until I see the purchase order. That’s when I’ll get excited.”",
  "summary": "Mexican steel and aluminium exports to the US are down because of tariffs, hurting local small businesses.",
  "published": "Thu, 20 Nov 2025 19:00:28 +0000",
  "url": "https://www.aljazeera.com/economy/2025/11/20/us-tariffs-cast-shadow-over-nuevo-leons-steel-industry-in-mexico?traffic_source=rss",
  "source": "Al Jazeera – Breaking News, World News and Video from Al Jazeera"
}