{
  "title": "China ran disinformation campaign against Rafale after Operation Sindoor: US report",
  "text": "FOLLOWING THE India-Pakistan border conflict in May in the wake of Pahalgam terror attacks, China initiated a disinformation campaign to hinder the sale of French Rafale aircraft in favour of its own J-35s, using fake social media accounts to propagate AI images of supposed “debris” from the planes that China’s weaponry destroyed, according to the latest US-China Economic and Security Review Commission report that was submitted to the US Congress on Wednesday.\n\nThe annual report offers the US Congress a bipartisan approach toward China policy. The report this year, which offers 28 recommendations across technology, economics and trade, and national security, also examines how China has used industrial policy to position itself to attain first mover advantage in the technologies of the future.\n\n“President Xi (Jinping) has also been explicit that he wants to make the world more dependent on China,” says the opening statement by the commission’s Chair Reva Price. “We can expect that China will continue massive, distortionary policy support for strategic sectors.” However, on China’s role in the May 7-10 military hostilities between India and Pakistan, the report says that the clash “drew global attention as Pakistan’s military relied upon Chinese weaponry and reportedly leveraged Chinese intelligence”.\n\n“The Indian Army claimed China helped Pakistan with ‘live inputs’ on Indian military positions throughout the crisis and effectively used the conflict as a testing ground for its own military capabilities; Pakistan denied these allegations, and China neither confirmed nor denied its degree of involvement.”\n\nIt also notes how China expanded its military cooperation with Pakistan in 2025, compounding its own security tensions with India. “While characterisation of this conflict as a ‘proxy war’ may overstate China’s role as an instigator, Beijing opportunistically leveraged the conflict to test and advertise the sophistication of its weapons, useful in the contexts of its ongoing border tensions with India and its expanding defence industry goals,” it says.\n\n“This clash was the first time China’s modern weapons systems, including the HQ-9 air defense system, PL-15 air-to-air missiles, and J-10 fighter aircraft were used in active combat, serving as a real-world field experiment,” it says. “China reportedly offered to sell 40 J-35 fifth-generation fighter jets, KJ-500 aircraft, and ballistic missile defence systems to Pakistan in June 2025 (post the conflict).”\n\nIn the weeks after the conflict, Chinese embassies hailed the “successes” of its systems in the India-Pakistan clash, seeking to bolster weapons sales, the report notes. It states “according to French intelligence, China initiated a disinformation campaign to hinder sales of French Rafales in favour of its own J-35s, and used fake social media accounts to propagate AI and video game images of supposed ‘debris’ from the planes China’s weaponry destroyed”. Consequently, the report says, Chinese Embassy officials convinced Indonesia to halt a purchase of Rafale jets already in process.\n\nStory continues below this ad\n\nIt also weighed in on how the Dalai Lama’s succession is poised to become a dispute between China and those committed to back the Tibetan-selected successor, including the US. “There will likely be two successors — one selected by the Tibetan Buddhist Gaden Phodrang Trust and one by the Chinese government,” it says.\n\nAlso read | PM unveils new doctrine, frames it part of global war on terror\n\nWhen Prime Minister Narendra Modi wished the 14th Dalai Lama on his birthday and a senior Indian Minister affirmed the Dalai Lama’s trust has sole authority to identify the 15th Dalai Lama, China made official complaints to the Indian government, urging it to avoid support for the 14th Dalai Lama’s “anti-China separatist activities under the guise of religion”. The search for and selection of the 15th Dalai Lama will have implications on the international stage, says the report.",
  "summary": "",
  "published": "Wed, 19 Nov 2025 22:50:35 +0000",
  "url": "https://indianexpress.com/article/india/china-ran-disinformation-campaign-against-rafale-after-operation-sindoor-us-report-10375267/",
  "source": "India | The Indian Express"
}