{
  "title": "Secret chemical traces reveal life on Earth 3. 3 billion years ago",
  "text": "A recent investigation has identified new chemical signs of ancient life in rocks that formed over 3.3 billion years ago. The same research uncovered molecular evidence that oxygen-producing photosynthesis began nearly a billion years earlier than scientists once believed.\n\nResearchers from the Carnegie Institution for Science led an international effort that combined state-of-the-art chemical techniques with artificial intelligence. Their goal was to uncover extremely subtle chemical \"whispers\" of past biology hidden inside heavily altered ancient rocks. By applying machine learning, the team trained computer models to recognize faint molecular fingerprints left by living organisms long after the original biomolecules were destroyed.\n\nSeaweed Fossils Offer a Window Into Early Complex Life\n\nMichigan State University's Katie Maloney, an assistant professor in the Department of Earth and Environmental Sciences, contributed to the project. Her work focuses on how early complex life evolved and shaped ancient ecosystems. Maloney provided exceptionally well-preserved seaweed fossils that are roughly one billion years old, collected from Yukon Territory, Canada. These fossils are among the earliest known seaweeds in the geological record, dating to a time when most organisms were visible only under a microscope.\n\nThe study, published in the Proceedings of the National Academy of Sciences, offers new understanding of Earth's earliest biosphere. It also carries major implications for exploring life beyond Earth. The same methods could be applied to samples from Mars or other planetary bodies to determine whether they once supported life.\n\n\"Ancient rocks are full of interesting puzzles that tell us the story of life on Earth, but a few of the pieces are always missing,\" Maloney said. \"Pairing chemical analysis and machine learning has revealed biological clues about ancient life that were previously invisible.\"\n\nWhy Early Biosignatures Are So Hard to Find\n\nLife on early Earth left behind only sparse molecular evidence. Fragile materials such as primitive cells and microbial mats were buried, squeezed, heated, and fractured as the planet's crust shifted over billions of years. These intense processes destroyed most original biosignatures that could have provided insight into life's earliest stages.\n\nYet the new findings show that even after original molecules vanish, the arrangement of surviving fragments can still reveal important information about ancient ecosystems.\n\nThis research demonstrates that ancient life left behind more signals than scientists once suspected -- faint chemical \"whispers\" preserved within the rock record.\n\nTo identify these clues, the team used high-resolution chemical techniques to break down both organic and inorganic material into molecular fragments. They then trained an artificial intelligence system to recognize the chemical \"fingerprints\" associated with biological origins. The researchers analyzed more than 400 samples, ranging from modern plants and animals to billion-year-old fossils and meteorites. The AI system distinguished biological from nonbiological materials with over 90 percent accuracy and detected signs of photosynthesis in rocks at least 2.5 billion years old.\n\nDoubling the Time Span for Detecting Ancient Life\n\nBefore this work, dependable molecular evidence for life had only been identified in rocks younger than 1.7 billion years. This new approach effectively doubles the period during which scientists can study chemical biosignatures.\n\n\"Ancient life leaves more than fossils; it leaves chemical echoes,\" said Dr. Robert Hazen, senior staff scientist at Carnegie and a co-lead author. \"Using machine learning, we can now reliably interpret these echoes for the first time.\"\n\nA New Way to Explore Earth's Deep Past and Other Worlds\n\nFor Maloney, who studies how early photosynthetic organisms reshaped the planet, the results are especially meaningful.\n\n\"This innovative technique helps us to read the deep time fossil record in a new way,\" she said. \"This could help guide the search for life on other planets.\"",
  "summary": "Researchers have discovered chemical traces of life in rocks older than 3.3 billion years, offering a rare look at Earth’s earliest biology. By combining advanced chemical methods with artificial intelligence, scientists were able to detect faint molecular patterns left behind long after the original biomolecules disappeared. Newly analyzed fossils, including ancient seaweed from Canada’s Yukon Territory, helped validate the method and deepen understanding of early ecosystems.",
  "published": "Tue, 18 Nov 2025 21:37:29 EST",
  "url": "https://www.sciencedaily.com/releases/2025/11/251118212035.htm",
  "source": "All Top News -- ScienceDaily"
}