{
  "title": "1994-batch officer Atish Chandra appointed Agri Secretary",
  "text": "THE CENTRE has appointed Atish Chandra, a 1994-batch Bihar-cadre IAS officer, as the new Agriculture Secretary. He will replace incumbent Devesh Chaturvedi, who is retiring next year on February 28.\n\nAn order to this effect was issued by the Department of Personnel and Training (DoPT) on Thursday. Chandra’s appointment has been approved by the Appointments Committee of the Cabinet (ACC).\n\nAccording to the order, Chandra, who is currently serving as Special Secretary in the Prime Minister’s Office, has been appointed as the Officer on Special Duty (OSD) in the Department of Agriculture and Farmers Welfare with effect from February 1, 2026. He will take over as Secretary, Department of Agriculture and Farmers Welfare, upon Chaturvedi’s superannuation on February 28. Chaturvedi was appointed as the Agriculture Secretary in August last year.\n\nChandra was empanelled as the Secretary earlier this year.\n\nThe ACC also approved the appointment of Manoj Joshi, a 1989-batch Kerala-cadre IAS officer, as the new Secretary, Department of Pharmaceuticals. Joshi, currently serving as Secretary, Department of Land Resources in the Ministry of Rural Development, will replace incumbent Amit Agrawal who has now been appointed as Secretary, Department of Telecommunications.\n\nThe Centre has also transferred Tourism Secretary V Vidyavathi, a 1991-batch Karnataka-cadre IAS officer, as the Secretary, Department of Empowerment of Persons with Disabilities. Srivatsa Krishna, a 1994-batch Karnataka-cadre IAS officer presently posted in his cadre, has been appointed as the new Tourism Secretary.\n\nTelecom Secretary Neeraj Mittal, a 1992-batch Tamil Nadu-cadre IAS officer, has been appointed as Secretary, Ministry of Petroleum and Natural Gas. Mittal will replace Pankaj Jain, a 1990-batch Assam-cadre IAS officer, who has been appointed as Member Secretary, Eighth Central Pay Commission.\n\nSunil Paliwal, a 1993-batch Tamil Nadu-cadre IAS officer presently working as Chairperson, Chennai Port Trust, has been appointed as the new Chairman of Inland Waterways Authority of India, under the Ministry of Ports, Shipping and Waterways.",
  "summary": "",
  "published": "Thu, 20 Nov 2025 21:44:34 +0000",
  "url": "https://indianexpress.com/article/india/1994-batch-officer-atish-chandra-appointed-agri-secretary-10377324/",
  "source": "India | The Indian Express"
}