{
  "title": "Moving to drop Dadri lynching case, UP govt cites family’s ‘changing statements, no enmity’",
  "text": "Inconsistent statements by Mohammad Akhlaq’s kin in naming the accused; the fact that no firearm or sharp weapon was recovered from the accused, and the lack of any enmity or hostility recorded between the accused and the victim – these are the key reasons the Uttar Pradesh government cited in its application to the court seeking to withdraw the case against all 19 accused in the case.\n\nOn September 28, 2015, a mob had gathered outside Akhlaq’s house in Bisada village after an announcement from the local temple alleged that he had slaughtered a cow. Akhlaq and his son, Danish, who tried to intervene, were dragged out of their home and assaulted until they fell unconscious. Akhlaq later died at a hospital, while Danish suffered severe injuries and underwent surgery.\n\nThe application by Brajesh Kumar Mishra, Joint Director Prosecution, Gautam Buddh Nagar, seeking to withdraw the case reads: “Both the complainants and the accused are residents of the same village, Bisada… Despite that, the complainant (Akhlaq’s wife) and other witnesses (Akhlaq’s son and daughter) have changed the number of accused in their statements.”\n\nThe prosecution, in an application filed under Section 321 of the Code of Criminal Procedure (CrPC), has sought to withdraw the case against all 19 accused. The provision allows a Public Prosecutor or Assistant Public Prosecutor to withdraw from a prosecution, with the court’s consent. The application also cites the right to equality under the Constitution guaranteed to every citizen, “whether it is the complainant, victim or accused” to withdraw the case.\n\nThe application states that in the first statement recorded by the police under Section 161 CrPC, the eyewitnesses did not specifically name any accused. However, in their statements under Section 164 CrPC, Akhlaq’s wife, Ikraman, on November 26, 2015, named 10 individuals as accused, while her daughter, Shaista, named an additional six individuals as accused. Subsequently, on December 5, 2015, Akhlaq’s son, Danish, named three more individuals in his statement.\n\nA statement under Section 161 CrPC is made before the police and is not admissible as evidence in a court. It is only to aid the police in the investigation, unlike a statement made under Section 164 CrPC, which is recorded by a magistrate under oath. The statement before a magistrate is key to the trial, and a witness is cross-examined and tested against this statement.\n\nThe application also states that “five sticks, rods (sariya), and bricks” were recovered by the police from the accused, indicating that “no firearm or sharp weapon was used in the incident”. The application adds that all the accused have been granted bail by the court during the trial. The application also notes that the case diary did not record that “enmity, opposition, or hostility existed previously between the complainant and the accused”.\n\nStory continues below this ad\n\nPolice had registered an FIR at Jarcha police station under IPC sections 302 (murder), 307 (attempt to murder),147 (rioting), 148 (rioting with deadly weapon), 149 (unlawful assembly), 323 (assault), 504 (intentional insult to disturb peace), among others.",
  "summary": "",
  "published": "Sun, 16 Nov 2025 22:50:34 +0000",
  "url": "https://indianexpress.com/article/india/moving-to-drop-mohammad-akhlaq-dadri-lynching-case-up-govt-cites-familys-changing-statements-no-enmity-10369676/",
  "source": "India | The Indian Express"
}