{
  "title": "Scientists find a molecule that mimics exercise and slows aging",
  "text": "A new study in the journal Cell from the Chinese Academy of Sciences and Xuanwu Hospital Capital Medical University explains how exercise helps the body stay youthful. The researchers also highlight betaine -- a metabolite produced in the kidney -- as an oral compound that can imitate many of the rejuvenating effects normally linked to physical activity.\n\nBetaine is a small molecule found in foods like beets and spinach, but the body also makes it on its own. In this study, it emerged as an important signal that helps coordinate the anti-aging benefits of long-term exercise.\n\nHow the Body Responds to Exercise\n\nThe research team followed 13 healthy men over six years to observe how the body reacts to both short-term and long-term exercise. Using multiomics tools that track genes, proteins, metabolites, and gut bacteria, the scientists compared the body at rest, after a single 5 km run, and after a 25-day running program.\n\nTheir results showed that the kidney plays a central role in managing the body's response to exercise. During sustained training, the kidney produced large increases in betaine, which helped send protective, anti-aging signals throughout the body.\n\nSolving the Exercise Paradox\n\nThe study also helps explain the \"exercise paradox,\" where a single intense workout causes stress but long-term training improves overall health. A short run triggered temporary inflammation and \"metabolic chaos,\" while regular training restored balance and strengthened the immune system.\n\nConsistent exercise improved gut bacteria, boosted antioxidant defenses, and reversed age-related changes in T cells by stabilizing DNA and adjusting epigenetic marks such as reducing ETS1 expression. The kidney also increased its production of betaine through activity of the enzyme CHDH. Remarkably, giving betaine alone created many of the same benefits as training, including better metabolism, improved cognitive function, reduced depressive-like behavior in older mice, and lower inflammation across the body.\n\nHow Betaine Reduces Inflammation\n\nThe researchers found that betaine binds to and blocks TBK1, a kinase that drives inflammation. By suppressing TBK1 and its downstream IRF3/NF-κB pathways, betaine helps silence chronic inflammation, also known as \"inflammaging.\"\n\nThis mechanism ties together the exercise paradox: short-term activity triggers survival pathways (IL-6/corticosterone), while long-term training activates the kidney-betaine-TBK1 system that promotes youthfulness. Because betaine is considered safe and effective, it may be useful for people who cannot exercise regularly. \"This redefines 'exercise as medicine',\" says co-corresponding author Dr. Liu Guang-Hui. \"This study gives us a fresh way to turn how our body works into something we can target with chemicals. It opens the door to geroprotective treatments that can tweak how multiple organs work together.\"",
  "summary": "Exercise appears to spark a whole-body anti-aging cascade, and scientists have now mapped out how it happens—and how a simple oral compound can mimic it. By following volunteers through rest, intense workouts, and endurance training, researchers found that the kidneys act as the hidden command center, flooding the body with a metabolite called betaine that restores balance, rejuvenates immune cells, and cools inflammation. Even more striking, giving betaine on its own reproduced many benefits of long-term training, from sharper cognition to calmer inflammation.",
  "published": "Thu, 13 Nov 2025 23:56:35 EST",
  "url": "https://www.sciencedaily.com/releases/2025/11/251113071620.htm",
  "source": "All Top News -- ScienceDaily"
}