{
  "title": "Wieambilla police shooting not ‘terrorism’ but driven by Train family’s shared ‘delusions’, Queensland coroner finds",
  "text": "A Queensland coroner has found that the three members of the Train family behind the 2022 Wieambilla shootings were not terrorists, but instead killed two police officers and a neighbour due to their shared “persecutory” delusions.\n\nOfficers Rachel McCrow and Matthew Arnold were killed by the trio of conspiracy theorists at the remote property about 270km west of Brisbane on 12 December 2022.\n\nThe killers, Gareth, Stacey and Nathaniel Train, also shot dead their neighbour, Alan Dare, before being killed in a shootout with police.\n\n8:31 Wieambilla shootings inquest: watch a reconstruction of events based on the evidence – video\n\nQueensland police had labelled the shootings an act of terrorism.\n\nBut on Friday, the Queensland state coroner, Terry Ryan, said “it is not possible to conclude” that the trio committed a terrorist attack.\n\nIn his findings, Ryan said the Trains were suffering from paranoid delusions.\n\n“They were psychotically unwell and driven by their persecutory beliefs,” he said.\n\n“They were … intent on killing the officers and if necessary intent on dying rather than being taken into custody.”\n\nSign up: AU Breaking News email\n\nHe said the weapons carried by officers who went to the Trains’ property – in response to a missing persons report filed about Nathaniel – “were no match” for the rifles used by the shooters who were in ambush positions.\n\n“Once the shooting commenced the officers’ Glocks [handguns] were woefully inadequate for defending themselves,” he said.\n\nRyan said the Train’s wrongly believed that they were being attacked when police arrived at the property.\n\n“They believed war had reached their gates and they had to defend themselves against the evil attackers in accordance with God’s will and, in that way, reach their own salvation … [as] they wrongly believed they needed to die,” he said.\n\nRyan found that at least some of the firearms and ammunition used by the Trains was lawfully obtained and that Nathaniel, a weapons licence holder, was suffering a significant mental illness.\n\nHe recommended that the Queensland government consider the feasibility of adopting mandatory mental health assessments for weapons licence holders.\n\nHe said it was unclear if better body armour would have prevented their deaths, and it was difficult to see how any officer could have been adequately equipped for the incident that unfolded.\n\nskip past newsletter promotion Sign up to Breaking News Australia Free newsletter Get the most important news as it breaks Enter your email address Sign up Privacy Notice: Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on theguardian.com to send you this newsletter. You can complete full registration at any time. For more information about how we use your data see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nBefore the shootings, Nathaniel Train – a former school principal – had been the subject of a missing persons report to New South Wales police, which their counterparts in Queensland were following up.\n\nRyan commended triple-zero operator Katherine Beilby for her actions during a two-hour phone call with Const Keely Brough, who was trapped at the scene and survived the shooting. The Trains had hunted the rookie officer and attempted to burn her out.\n\n“Ms Beilby should be commended for her calm demeanour over a very lengthy call and her level-headedness despite the terror that she felt at Const Brough’s predicament,” he said.\n\nRyan’s findings, which contained 10 recommendations, come after the inquest held five weeks of hearings last year.\n\nOutside the court, Judy McCrow, the mother of one of the officers killed, read a statement on behalf of the victims’ families.\n\n“These recommendations, of course, come too late for Matt and Rachel and Alan Dare, who we believe should still be alive today if better processes were in place,” she said.\n\n“We are initially disappointed with the coronial recommendations, but we need time to read, process and respond to the findings and ensure that as families, our concerns and issues that were raised during this process have been listened to and respected.”\n\nThe state’s police minister, Dan Purdie, said the government and the police service would closely consider all findings and recommendations.\n\n\n\n“We must learn every possible lesson from this tragedy to ensure it doesn’t happen again to honour those we lost – and to make Queensland safer,” he said.",
  "summary": "<p>Coroner’s report into deaths of Rachel McCrow, Matthew Arnold and Alan Dare released following five-day inquest</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/nov/21/australia-news-live-mark-dreyfus-republic-anthony-albanese-g20-south-africa-eu-trade-deal-nt-cyclone-darwin-airlines-powerbank-ban-nsw-politics-leadership-kellie-sloane-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>A Queensland coroner has found that the three members of the Train family behind the 2022 Wieambilla shootings were not terrorists, but instead killed two police officers and a neighbour due to their shared “persecutory” delusions.</p><p>Officers Rachel McCrow and Matthew Arnold were <a href=\"https://www.theguardian.com/australia-news/article/2024/aug/17/how-the-trains--brought-terror-to-wieambilla-shootings-ntwnfb\">killed by the trio of conspiracy theorists</a> at the remote property about 270km west of Brisbane on 12 December 2022.</p> <a href=\"https://www.theguardian.com/australia-news/2025/nov/21/wieambilla-qld-police-shooting-inquest-coroner-report-findings-queensland-ntwnfb\">Continue reading...</a>",
  "published": "Fri, 21 Nov 2025 03:01:16 GMT",
  "url": "https://www.theguardian.com/australia-news/2025/nov/21/wieambilla-qld-police-shooting-inquest-coroner-report-findings-queensland-ntwnfb",
  "source": "World news | The Guardian"
}