{
  "title": "Matt Bowen's ultimate guide to winning a fantasy football championship",
  "text": "Open Extended Reactions\n\nIt's playoff time in fantasy football. And now that we're here, it's about one thing and one thing only: scoring the most points in your head-to-head matchup each week. That's it.\n\nYou might be thinking, \"Isn't that what we were trying to do every week during the regular season, too?\" Of course, but we all know this means more. It's win-or-go-home time.\n\nSo, how do we set ourselves up for the win?\n\nI'm giving you my guide to the fantasy playoffs. But it's not about rankings or player projections. This is a guide built on strategies that will allow your team, the one you drafted back in August or early September, to make it to the championship stage.\n\nWith 14 million people playing fantasy football at ESPN this year, it's impossible for me to account for all league types. So, this column is mostly centered on 10- and 12-team leagues. If you're in deeper or shallower setups, you might need to make slight adjustments to the advice below, but rest assured there is something for everyone in here. Tricks for the waiver wire? Yeah, we'll look at those. Managing quarterbacks, too. You might need more than one to win a title. The top insurance backs are here -- and I ranked them. Plus, I have notes on what defenses to stream, in addition to some thoughts on how to free up roster space.\n\nRemember, this is playoff football. This is not a time to be nice or to make members of your league happy. Your job is to advance. It's the business of winning now. And I can help.\n\nMake sure you roster multiple quarterbacks\n\nAdding C.J. Stroud to your bench before you need him could pay off big if you find yourself short a quarterback in December. Logan Bowles/Getty Images\n\nGenerally speaking, the quarterback is the most reliable scorer in your lineup from week to week. Let's get that out up front here. Now, I rarely roster multiple quarterbacks during the regular season in 10- and 12-team leagues, other than when injuries strike or when I'm picking up a one-week rental because my starter is on a bye.\n\nHowever, my strategy changes for the playoffs. The way I see it, you simply can't go into the playoffs with just one passer. It's an unnecessary risk. And an avoidable one. Even if you roster Josh Allen, Patrick Mahomes, Drake Maye, Matthew Stafford or Lamar Jackson, the best scorers in points per game this season at the position, you still need to prepare for an injury. And if you don't have a viable backup, someone who can potentially get you 15-18 points, you could be going home early -- all because you wanted to hold on to that WR4 you drafted back in August (the one who has been on your bench all season).\n\nAccounting for leagues of different sizes, here are a handful of available quarterbacks (rostered in under 50% of ESPN leagues) I would target right now.\n\nC.J. Stroud, Houston Texans (43.3% rostered): Stroud will miss his third straight game with a concussion, and his overall play this season has been up and down (15.1 PPG). When cleared to play however, Stroud fits as a solid No. 2 on your playoff roster. Stroud has scored 21 or more points, with multiple touchdown throws, in two of his past four games. And when he's on, Stroud is one of the most accurate passers in the league. Stroud does have some challenging playoff matchups (@ KC, AZ, LV, @ LAC), but I would make a move for him now -- while he is out -- before that roster percentage starts to climb.\n\nSam Darnold, Seattle Seahawks (47.9% rostered): Darnold isn't a hot name right now after the seven turnovers he has accounted for over his past two games. But as an insurance play? Sure. Darnold has a decent playoff schedule (MIN, @ ATL, IND, @ CAR), and he has posted five games with 16 or more points, Plus, his No. 1 target, Jaxon Smith-Njigba? Best wide receiver in football this season.\n\nJacoby Brissett, Arizona Cardinals (23.6% rostered): Brissett is averaging 21.3 points over his six starts this season, and he has multiple touchdown throws in each. Yes, the start to the playoff schedule is rough (LAR, @ HOU), but Brissett does get some much more manageable matchups in Week 16-17 (ATL, @ CIN). And he has upgraded this passing game since Kyler Murray went on IR.\n\nJ.J. McCarthy, Minnesota Vikings (48.5% rostered): McCarthy's poor footwork has led to accuracy issues since his return from an ankle injury in Week 9, plus his inexperience shows. However, McCarthy has a really solid playoff schedule (WASH, @DAL, @NYG, DET), an elite No. 1 in Justin Jefferson, and he can give you some upside as a runner.\n\nMarcus Mariota, Washington Commanders (16.0% rostered): Depending on the status of Jayden Daniels (elbow), Mariota fits as a dual-threat option in the lineup. Mariota has at least four carries in each of his past two games, and we are seeing more spread passing elements in the call sheet here. I would stay away from the Week 16 games versus the Eagles, but Mariota gets more favorable matchups in Weeks 14, 15 and 17 (@MIN, @NYG, DAL). Plus, Week 12 is the perfect time to scoop up Mariota, as the Commanders are on a bye.\n\nFind the right insurance backs\n\nSean Tucker had a breakout game in Week 11 and could be called upon to start again before the season is out. Gregory Fisher-Imagn Images\n\nRostering an insurance back -- to protect the RB1 and RB2 slots in your lineup -- is another box to check as we head into the fantasy playoffs. Specifically target those in offensive schemes that will go run-heavy or have balance in the call sheet.\n\nWe all know there won't be high-quality starting running back options on the wire during the playoffs. And depending on your record (which could push you down the waiver order) or your available free agent acquisition budget (FAAB), you could strike out. That's trouble if your No. 1 goes down with an injury, and it could cost you a playoff win. When looking at insurance backs, I focus on players who are the clear No. 2 for their team, because you don't want to target a back who is a part of a deep rotation. A lot of guesswork there. You want volume runners, too, backs who can handle double-digit carries with ease. Pass-catching traits? Yes, but screens and underneath throws work just fine here. You don't need an elite route runner out of the backfield. And those guys aren't sitting on the wire, anyway.\n\nHere are the five backs I would target as ideal insurance options -- all available in more than 60% of ESPN leagues -- and I've ranked them, too:\n\n1. Sean Tucker, Tampa Bay Buccaneers (35.6% rostered): We saw what Tucker can do in an expanded role, as he had 34 points in the Week 11 loss to the Bills. He can scoot, too. Tucker finished with 140 total yards and three touchdowns versus Buffalo, and it's clear he would be the lead back (over Rachaad White) if Bucky Irving were to miss time again. The Bucs have a very good playoff slate (NO, ATL, @ CAR, @ MIA). Go get him.\n\n2. Tyler Allgeier, Atlanta Falcons (33.1% rostered): Allgeier has already rushed for seven touchdowns this season, and his overall usage would spike if Bijan Robinson were to sit with an injury. The first three weeks of the playoffs feature defenses all outside the top-10 versus running backs (SEA, @ TB, @ AZ), while the top-rated Rams defense looms in Week 17.\n\n3. Brian Robinson Jr., San Francisco 49ers (22.2% rostered): The 49ers have a Week 14 bye, so that needs to be discussed here as Robinson would not be available for the first round of the fantasy playoffs. But if you have the roster space, Robinson will elevate into a prime role if Christian McCaffrey went down. Robinson has seen minimal work as the No.2 in San Francisco this season, however, he did average 11.1 PPG for Washington in 2024, and running backs produce in Kyle Shanahan's system. The Niners get the Titans', Colts' and Bears' defenses in the playoffs.\n\n4. Blake Corum, Los Angeles Chargers (11.2% rostered): Corum would be in-line to see a major boost in volume for a high-scoring Rams offense if starter Kyren Williams (15.8 carries per game) were to miss time. Corum has three games with 12 or more carries this season, and he can be a productive runner in Sean McVay's gap/zone scheme. The Week 15 matchup versus the Lions is tough, but the Rams do get positive games in Weeks 14, 16, 17 (@ AZ, @ SEA, @ ATL).\n\n5. Isaiah Davis, New York Jets (6.8% rostered): The No. 2 in New York behind Breece Hall, Davis fits as a strong insurance play in a run-heavy Jets' offense. Davis did score 17.9 points in the Week 8 game versus the Bengals, plus he can be deployed as a receiver out of the backfield. Davis gets a favorable playoff schedule, too (MIA, @ JAX, @ NO, NE).\n\nWant more pickup options for the playoffs? Check out Tristan H. Cockcroft's potential fantasy playoff hero RBs to stash.\n\nStream the tight end position\n\nThe tight end position is very fickle in fantasy football. We all know it. There are a handful of consistent players at the position, and then there's everyone else. It's one of the main reasons I wait till the end of drafts to take a flier on a tight end, knowing I can stream players throughout the season, and my approach stays the same in the playoffs. If you follow the same strategy or simply want to find more upside at tight end based on the matchups, here are three tight ends (available in over 40% of ESPN leagues) who can be streamed for the playoffs.\n\n1. Juwan Johnson, New Orleans Saints (41.8% rostered): Johnson scored 19.2 points in the Week 11 game versus the Panthers, and he has at least 10 in each of his past four. A seam stretcher, who can also make himself available underneath to rookie quarterback Tyler Shough, Johnson's playoff schedule (@ TB, CAR, NYJ, @ TEN) should lead to more weekly production.\n\n2. Theo Johnson, New York Giants (56.8% rostered): Johnson can flex outside to the boundary and work the dirty areas of the field, plus he has scored 10 or more points in three of his past five games. You won't have Johnson for Week 14 (bye), but he has the remaining playoff matchups (WASH, MIN, @ LV) to put points in your lineup.\n\n3. Dalton Schultz, Houston Texans (53.6% rostered): Schultz has some tougher matchups on the playoff slate (@ KC, AZ, LV, @ LAC), but his weekly usage is up. Schultz has seen eight or more targets in four of his past five games. Trust the volume.\n\nRoster two D/STs or stream the weekly matchups?\n\nJamel Dean (35) and SirVocea Dennis (8) have accounted for four of the Buccaneers' 10 interceptions so far this season. The Buccaneers are tied for fifth with 16 takeaways. Todd Rosenberg/Getty Images\n\nI'm a big believer in streaming defenses throughout the fantasy regular season. I hold on to a unit for a week or two, maybe more if that defense is taking the ball away consistently or hitting the QB. It's really all about playing the weekly matchups. And I'll carry that same philosophy into the playoffs. So, what defenses should you potentially target for the fantasy playoffs? With the help of my ESPN teammate Tristan H. Cockcroft, let's rank the five defensive streaming options, who are available in over 70% of ESPN leagues.\n\n1.Tampa Bay Buccaneers (21.7% rostered): The Bucs have recorded at least one turnover in six straight games, with two or more in five of the past six. Plus, under coach Todd Bowles, the Bucs are going to heat up the pocket with pressure schemes. And a heavy NFC South schedule in the fantasy playoffs works here, too (NO, ATL, @ CAR, @ MIA).\n\n2. Miami Dolphins (3.9% rostered): Earlier in the season, I would have said no chance on Miami as a defensive streamer. Nope. But this unit is playing better football now. Miami has scored at least seven points in each of their past two games (including 11 versus Josh Allen and the Bills in Week 10), plus they have two or more sacks in three of their past five. With some positive playoff matchups (@ NYJ, @ PIT, CIN, TB), Miami is an option.\n\n3. New York Jets (9.3% rostered): The splash plays are really missing from this defensive unit. So are the takeaways. But we are also playing matchups once you get into the tournament. That's why I have the Jets here (MIA, @ JAX, @ NO, @ NE).\n\n4. New York Giants (7.2% rostered): Like the Jets, the Giants have lacked the ability to create turnovers at a high rate, but they do have the edge rushers to hit the quarterback, recording at least two sacks in nine of 11 games played this season. The Giants have a Week 14 bye, so you'll have to stream another defense in their place, but the rest of the playoff schedule looks solid (WASH, MIN, @ LV).\n\n5. New Orleans Saints (2.1% rostered): The Saints could be a long shot, and I don't love the Week 14 matchup versus the Bucs, but the rest of the playoff slate looks really good (CAR, NYJ, @ TEN). And the Saints had 14 points versus Carolina in Week 10.\n\nNow, if you already roster one of the top-tier defenses, do you need to pick up a second unit for the playoffs? Let's say you roster the Texans, Broncos or Browns, all ranked in the top five of defensive PPG. Well, the Texans open the playoffs with a road matchup versus Patrick Mahomes and the Kansas City Chiefs. The Broncos see Kansas City again in Week 17. And the Browns, who get zero offensive support in Cleveland, which impact both field position and game tempo, host the Bills in Week 16. Going to stop Josh Allen when he is set up on short fields? Maybe.\n\nThe point here is to have options in the lineup. Yes, you could already roster a nasty defense, but if the matchup is shaky, you don't have to force them into the lineup if you have a second unit available with a better game that week. Theoretically, you want to keep both defenses for the other playoff matchups, and you also don't want to dump them so someone else in your league can just scoop them up on their way to a championship. So yes, If you have the roster space, it's OK to have two defenses.\n\nGet ahead of injury concerns in your lineup\n\nIf you have any key players whose playing status is in doubt -- the big red \"Q\" next to his name is staring you in the face -- it's wise to execute a backup plan early.\n\nThis is particularly true for anyone playing in the late-afternoon window on Sunday, Sunday night, or even worse, on \"Monday Night Football.\" We've all been there, right? Ankle, hamstring, whatever. Limited practices. Maybe the player will have to work out before the game. I did that a couple of times in my career. And if you take the early bus to work out at the stadium, it's most likely a 50-50 shot that you even get to put on a jersey. Not great.\n\nNow, if you already have a viable replacement on your roster, hopefully with a good matchup, then you plug that player into your lineup and go with it. That's easy. You're good.\n\nBut if you don't, and need to add a second tight end or another wide receiver (hopefully the backup to your starter who has that big red \"Q\"), then drop that luxury player on your bench (we all have them) and get on the waiver wire. This is more about being out in front of the situation. Pick up the insurance policy, as they might wind up in your playoff lineup. And guess what? If your starter can go and he winds up being active for the game, then you can cut that insurance policy. No harm there.\n\nPlus, that luxury player you were holding on to for 13 weeks that you dropped? He will probably still be there on the wire come Tuesday morning. You can bring him back ... to sit again.\n\nSetting your playoff lineup: ceiling versus floor\n\nAlec Pierce has big-play ability that has led to big games, but he carries risk in win-or-go-home scenarios. AP Photo/Martin Meissner\n\nI think this is a good discussion to have when looking at your playoff roster, because the goal here is to score the most points in your head-to-head matchup. That's really it.\n\nSure, you can maneuver your roster to get the highest projected total on the ESPN Fantasy app. I get it. And I've done it, multiple times this season. But those are just projections, and they don't always hit. So, what type of manager do you want to be? You can take the risk, filling your lineup with high-ceiling options.\n\nColts wide receiver Alec Pierce fits here. Pierce is leading the NFL with 20.9 YPC, and he has a catch of 30 or more yards in six of seven games played this season. Plus, Pierce has scored 14 or more points in three of his past four games. But Pierce is the vertical stretch target in the Colts route tree, and he doesn't see high-end target volume. If you are going all-in on boom/bust players, they need to hit. Or you're going home.\n\nYou can limit the risk, too, focusing on the higher-floor players in your lineup. Maybe you toss in one boom/bust player, such as a DK Metcalf or Troy Franklin. If they don't hit big, you have the safety of the rest of your higher-floor starters to balance this out.\n\nHow do I lean? I'm the higher-floor manager. Always have been. Give me consistent numbers in the lineup. Stuff I can count on. But if you want to lay all the cards down, I get that stance also.\n\nBe you. Win the week. And advance.\n\nWho are the high-floor and high-ceiling players this season? Check out the Fantasy Football Consistency Ratings.\n\nBe aware of the Week 14 byes and Christmas Day games\n\nWe've already mentioned some players who have the Week 14 byes, but there are more as the 49ers, Patriots, Giants and Panthers are all off during the first round of the fantasy playoffs. That means no Christian McCaffrey, George Kittle, Drake Maye, TreVeyon Henderson, Jaxson Dart, Rico Dowdle ... Rough. So, plan accordingly and make the necessary moves to have a viable option in the lineup if you roster those players.\n\nThere are three games on Christmas in Week 17, which feature some of the league's best offenses (DAL-WSH, DET-MIN, DEN-KC). You need to stay on top of injury reports and have backup plans due to the short week (games are played on a Thursday). Roster management could be critical here for leagues that use Week 17 as championship week.\n\nPut your injured/late game players in the flex spot\n\nA quick note here on setting your roster in the playoffs, as it could save you. Let's say you roster a wide receiver with an injury designation. Instead of putting him in your WR1/2 slot, move him to the flex. This gives you more options if he can't go on game day, as you won't be limited to just the wide receiver pool for replacement options.\n\nThe same goes for a player in the late window on Sunday or on Sunday/Monday night. The smart play here is to put that player in the flex spot in case something goes down. And for your guys playing on Thursday or Christmas games? Make sure those guys aren't clogging up your Flex spot.\n\nA pregame injury, sickness, more. It doesn't happen often, but I did see that during my time in the league. Better to be safe -- and protect your lineup.\n\nIf you have a roster spot available ...",
  "summary": "Even Jonathan Taylor can't do it all by himself. Fantasy managers have a role to play too.  Here's what to do.",
  "published": "Thu, 20 Nov 2025 19:30:00 EST",
  "url": "https://www.espn.com/fantasy/football/story/_/id/47023923/fantasy-football-playoffs-tips-strategy-pickups",
  "source": "www.espn.com - TOP"
}