{
  "title": "Fixing what's wrong with Liverpool, Barcelona, Juventus, more",
  "text": "Open Extended Reactions\n\nEverybody has an opinion, especially when it comes to Liverpool. The defending Premier League champions have lost five of six in league play to fall to eighth in the table, and they've lost seven of 10 in all competitions.\n\nMohamed Salah is suddenly looking his age, expensive signing Florian Wirtz isn't producing and expensive signing Alexander Isak has struggled with both fitness and finishing, the Premier League might be evolving more quickly than manager Arne Slot, the customary players-only meeting didn't seem to accomplish much, and there are plenty of signs that players are still grieving and struggling with the summer death of teammate Diogo Jota.\n\nIt almost seems like regression is inevitable at times. Manchester City collapsed for most of the winter last season after winning the league in 2023-24, and following Liverpool's best seasons under Jurgen Klopp, they had plenty of bumpy patches: two wins in seven, one in seven and two in eight in 2020-21 (after winning the Premier League) and one win in seven and zero in five in 2022-23 (after nearly winning the Treble). But with struggle comes a chorus of famous former players. It's \"crisis time,\" per Roy Keane. It's \"crisis mode,\" per Jamie Carragher. They don't have leadership, per Wayne Rooney. The toxicity of the situation can become all-consuming. Everything is bad, nothing is working, nothing is salvageable.\n\n- A week of World Cup miracles: Best stories, celebrations from qualifying\n\n- Ian Darke's Premier League stars: Haaland, Caicedo, Zubimendi\n\n- Modern classics: 25 of the best kits from the 21st century\n\nHere's where stats can offer some clarity. What's actually going wrong -- or at least, most wrong -- at Anfield? What do Slot and Liverpool need to most urgently address to steer out of the skid? And while we're here, what do stats say about some of Europe's other struggling squads?\n\nLet's find out.\n\nLiverpool\n\nCurrent Premier League standing: eighth (1.64 points per game, down from 2.21 last season)\n\nLiverpool haven't been able to stop much this season in defense, and that's the biggest hurdle between them and their trophy aspirations. Simon Stacpoole/Offside/Offside via Getty Images\n\nBiggest statistical weakness: defense. It's always been about the defense. To be sure, the attack has regressed despite Liverpool spending hundreds of millions of pounds on some of the brightest attacking talent in the world. They were comfortably first in goals scored and xG created last season, and now they're sixth in both categories. But they're ninth in xG allowed (13.9) and 12th in actual goals allowed (17), and that's what most needs addressing.\n\nFrom a pressure standpoint, Liverpool are hitting the same notes as last season. They rank sixth in the league in passes allowed per defensive action, second in combined progressive passes and progressive carries allowed and third in high turnovers forced; last year they were fourth, third and sixth, respectively. But they're bombing in two categories: transition defense and set pieces. They were fourth in xG allowed from counterattacks last season, and they're currently 17th, allowing 87% more per match.\n\nPerhaps predictably, they've fallen from third to eighth in xG allowed per shot. Meanwhile, after allowing just nine goals from set pieces last season (eighth in the league), they've already allowed a shocking seven this season (18th), including three from long throws.\n\nCombine that with a downturn in goalkeeper performance. In terms of goals prevented* they've gone from +0.10 per match from Alisson and Caoimhín Kelleher last season to -0.26 per match from Alisson and Giorgi Mamardashvili this season -- and you get a pretty clear picture. Liverpool have allowed at least two goals in seven of 11 league matches, and while they won the first two such matches with late heroics, they've lost the past five.\n\nWhen they allow one or fewer goals, they're a perfect 4-for-4 in the wins department. But they've managed to do so only four times.\n\n(*Goals prevented is a StatsPerform measure that compares the postshot xG value of your opponents' shots on target to the number of actual goals you allow.)\n\nplay 1:59 Nicol: Arne Slot should bench Mohamed Salah Steve Nicol explains why he thinks Liverpool's Arne Slot should bench Mohamed Salah.\n\nCritiques about the attack have always been correct to some degree. Salah has only four goals (three, minus one penalty) and two assists in 11 league matches when, at the same time last season, he had eight and six, respectively. Meanwhile, both Isak and Wirtz have been cursed by the xG gods. Wirtz has attempted shots worth 1.3 expected goals and completed passes worth 1.2 expected assists but has zero actual goals or assists, while Isak, managing only 253 league minutes thus far, has attempted shots worth 0.9 xG with no goals.\n\nThat part will change. But Liverpool's defense is more of a structural problem.\n\nCurrent LaLiga standing: second (2.33 points per game, up from 2.32)\n\nBiggest statistical weakness: continuity. Of the nine teams in this piece, eight have regressed in terms of domestic points per play. Barcelona are actually doing just fine in that regard -- they're on the same pace as last season, when they won LaLiga. Their Champions League form has been dented by a loss to Paris Saint-Germain and a wild 3-3 draw at Club Brugge, but their main problem domestically has been the fact that Real Madrid appear to have improved quite a bit: After netting 84 points last season, Barca's hated rivals are on pace for 98. That will certainly dampen the vibes.\n\nYou know what else will? Injuries.\n\nLamine Yamal (second in last year's Ballon d'Or voting) played 83.7% of Barca's LaLiga minutes last season and is at 58.6% in 2025-26. Raphinha (fifth), meanwhile, has gone from 83.2% to 35.6%, and Robert Lewandowski (17th) has gone from 78.4% to 41.6%. These three were unreal last season, combining for 89 goals and 44 assists in all competitions. About one-third of the way through 2025-26, they're at 16 and seven, respectively. Players like Fermín López (six goals and four assists), Ferran Torres (seven and one) and loanee Marcus Rashford (six and seven) have held things down, but Barca's attack has gone from otherworldly to merely very good.\n\nplay 1:49 Yamal situation 'playground stuff' from Barcelona and Spanish FA Julien Lauren believes the Lamine Yamal situation could be \"easily figured out\" if both Barcelona and the Spanish FA \"speak to each other\" to sort it out.\n\nIn a roundabout way, maybe this is encouraging. Barca are hitting similar notes as last season despite a total lack of continuity up front. For that matter, they've gotten fewer minutes from injury-prone midfielders Pedri and Gavi as well, and after seven players played at least 70% of league minutes last season, they're at only five so far this year.\n\nOf course, Real Madrid have suffered their own injury issues and are still setting a higher bar; Barca aren't keeping up. And while domestic opponents haven't been able to adjust particularly well to Hansi Flick's high defensive line in their second year of exposure to it, it has been an issue in the Champions League, where they're 30th out of 36 teams in xG allowed per shot, 22nd in xG allowed from counterattacks and 18th in goals allowed.\n\nStill, getting and keeping the right personnel on the pitch would help immensely. Unfortunately, that's something over which you don't have a ton of control.\n\nCurrent Premier League standing: 14th (1.09 points per game, down from 1.74)\n\nBiggest statistical weakness: goals. A pretty important stat. Newcastle play a more direct style than most of England's richest clubs, and it has generally served them pretty well. If done well, you won't attempt as many shots as your possession-hungry peers, but you'll attempt as many or more good shots. Newcastle averaged 2.4 shots per game worth at least 0.2 xG; only Liverpool averaged more. They attempted 26.9% of their shots with fewer than two defenders between the ball and goal, lowest in the league.\n\nThis season, following a well-publicized and stretched-out divorce with Isak, they added forwards Nick Woltemade and Yoane Wissa before the transfer deadline. Woltemade has had some bright, creative moments, scoring six goals in all competitions (far more than Isak, if nothing else). But he's averaging 1.6 shots per 90 minutes in all competitions -- dreadfully low for a center forward -- and Wissa has yet to play because of injury. Consequently, despite solid work from left-sided attackers Anthony Gordon and Harvey Barnes (eight goals and three assists in all comps), Newcastle's attack has disappeared.\n\nWhen your attacking numbers are far closer to West Ham's than Arsenal's, something has gone awry. Newcastle have scored just 11 goals in league play (17th), and while they've probably been privy to some bad finishing luck, they're just 12th in xG created, too. They're averaging just 1.5 shots per game worth at least 0.2 xG (10th), and only 20% of their shots have been attempted with fewer than two defenders in the way (10th). Despite their attempted directness, they're allowing more counterattacking opportunities than they're creating.\n\nInjuries are playing a role here -- only four players have seen the pitch for more than 71% of Newcastle's league minutes, and 21 have started at least once. But injuries are playing a role for lots of teams, and Newcastle are currently far closer to the relegation zone (two points above) than they are to a spot in the top five (six points behind).\n\nUnless the attack peps up a bit, making up ground will be awfully difficult.\n\nCurrent Serie A standing: sixth (1.73 points per game, down from 1.84)\n\nBiggest statistical weakness: shot quality. Like plenty of fired managers, Igor Tudor was done in at least a bit by some bad bounces. In his last four matches in charge at Juventus, against a solid run of opponents (AC Milan, Como, Real Madrid and Lazio), his charges allowed just four goals. But they scored zero despite creating shots worth 4.4 xG. While they probably deserved four or five points from those matches, they managed only a 0-0 draw with Milan.\n\nAll of ESPN. All in one place. Watch your favorite events in the newly enhanced ESPN App. Learn more about what plan is right for you. Sign Up Now\n\nIn their first four matches without Tudor -- one with interim Massimo Brambilla, three with new hire Luciano Spalletti -- both the schedule and the xG gods eased up. Against Udinese, Cremonese, Sporting CP and Torino, Juve scored six goals and managed two wins and two draws. But they still suffered from poor finishing -- those six goals came from shots worth 7.9 xG -- and their shot quality still lacked a bit. For the season they rank just 16th in Serie A in xG per shot (0.12).\n\nForwards Dusan Vlahovic, Jonathan David and Loïs Openda, who are paid millions of euros to put the ball in the net, are attempting just 3.5 shots per 90 minutes between them, and even worse, they're averaging just 0.11 xG per shot. Juve's creative players -- mainly Kenan Yildiz and Andrea Cambiaso -- have not been able to get them involved, and with just four goals from their 5.7 combined xG, they haven't finished the opportunities they've gotten either.\n\nJuve are in decent shape overall: Thanks primarily to wins over lower-rung opponents, they're only three points outside Serie A's top four. The early signs under Spalletti have been encouraging, but until their scorers both earn and finish better scoring opportunities, climbing the table will be difficult.\n\nCurrent LaLiga standing: eighth (1.42 points per game, down from 1.84)\n\nBiggest statistical weakness: defensive regression to the mean. They play a reliable style of ball in Bilbao: Defend first, defend second, defend third, and maybe score a goal on the counter at some point. They haven't allowed more than 50 goals in a LaLiga season since 2012-13, and they've allowed under 40 in four of the last six years.\n\nLast season, however, they were a little too good in this regard. Giving up just 29 goals in 38 matches allowed them to finish fourth and earn their first Champions League bid in 11 seasons. But these 0.76 goals per match (first in the league) came from an average of 1.01 xG (second); even by the standards of Athletic and goalkeeper Unai Simón, that's too much of a disparity. And sure enough, the xG gods have come for what they're owed this year. They're allowing lower overall shot quality -- 0.85 xG per match (first) -- but opponents are turning that into 1.1 goals (fifth).\n\nThe attack, meanwhile, has been beset by injuries. Primary attackers Iñaki Williams (only 62.7% of minutes this season), Nico Williams (49.7%) and Oihan Sancet (39.5%) aren't seeing much of the pitch, and Athletic have scored just four open-play goals in 12 league matches. They're seventh in the league, already eight points off the top-four pace, and Champions League play hasn't gone any better. They beat Qarabag but have lost three other matches by a combined 8-1.\n\nRandomness isn't fixable, unfortunately, and if they continue defending well, their league form should stabilize. But a return to the Champions League next season is looking unlikely.\n\nCurrent Serie A standing: 13th (1.18 points per game, down from 1.95)\n\nBiggest statistical weakness: absolute offensive stagnation. Replacing Roma-bound Gian Piero Gasperini was always going to be a tall task. With his swashbuckling attacking identity, his Atalanta teams overachieved against their spending numbers for many times in recent seasons, and manager Ivan Juric came into the job with a high bar to clear. That Atalanta have lost only three of their 15 matches in all competitions certainly suggests things could be going worse, but settling for an incredible eight draws in that span held them back, and two of those three losses came in the first nine days of November. On the 10th day, Juric was fired.\n\nJuric's Atalanta matched Gasperini's shot volume -- they were fifth in Serie A in shots per possession last season, and they're fifth again this year -- but the good shots have vanished. They've fallen from third to 12th in xG per shot. Lower shot quality can produce streakiness, and in their past eight matches in all competitions they've managed just four goals from shots worth 11.2 xG. Take Lazar Samardzic's two goals out of the equation, and everyone else has two goals from 10.6 xG.\n\nThat is, of course, unsustainably terrible, and new hire Raffaele Palladino, most recently of Fiorentina, will likely enjoy a new-manager bump simply thanks to progression toward the mean. But as with Juve, shot quality desperately needs to improve, and unlike Juve, they're now nine points off the top-four pace.\n\nCurrent Premier League standing: 19th (0.82 points per game, down from 1.71)\n\nBiggest statistical weakness: set pieces and no margin for error. Looking at full-season stats for a team that has already careened from a successful counterattacking manager (Nuno Espirito Santo) to a possession-and-pressing guy (Ange Postecoglou) back to a counterattacker (Sean Dyche) is probably a fool's errand, and it's probably not surprising to learn that looking at Forest's full-season numbers offer us almost no hint of style or quality.\n\nThat said, set pieces have been a rampant problem this season, and they haven't improved so far in Dyche's short tenure. They were a life hack for Forest's rousing seventh-place finish (and Champions League near-qualification) last season -- they scored 17 set-piece goals (first) and produced a +8 scoring margin from them (third). This season, they've scored just two set piece goals (17th) and allowed nine (20th) for a minus-7 margin (also 20th).\n\nplay 1:03 Dyche frustrated at lack of VAR intervention vs. Man United Sean Dyche reacts to Nottingham Forest's 2-2 draw vs. Manchester United in the Premier League.\n\nIn Dyche's three league matches, they're one of only seven teams to score zero times, and they've allowed three, including both goals in a 2-2 draw with Manchester United. The simple fact that they've earned four points and scored five goals suggests solid improvement under Dyche, but this aspect is still dragging them down, and they still have the second-fewest points in the league -- behind even Nuno's new team, a previously hapless West Ham.\n\nCurrent Bundesliga standing: 17th (0.50 points per game, down from 1.53)\n\nBiggest statistical weakness: a total lack of shot attempts. With the endlessly enthusiastic Bo Henriksen in charge, Mainz were the Bundesliga's Nottingham Forest, positioned for a shocking Champions League berth last season until fading late. Like Athletic Club, they got as far as they did in part due to good fortune on defense -- they were 10th in xG allowed (1.46 per game) but third in goals allowed (1.26) -- and that allowed them to get by with an attack that was slightly above average at best. The defense has regressed a little (1.59 xG allowed), but the fortune has completely vanished (1.80 goals allowed).\n\nYou can get by in the Bundesliga with a mediocre defense, but it certainly exposes your attack. Without Eintracht Frankfurt-bound Jonathan Burkardt (18 goals from shots worth 14.8 xG last season), and with predictable regression to the mean from Paul Nebel (10 goals from 5.8 xG last year, one from 1.4 this year), Mainz are creating almost nothing on the attacking end. They are last in the league in shots per possession (0.08), and despite playing a pretty direct style, they've attempted only 14.5% of their shots with fewer than two defenders between the ball and goal (second worst).\n\nGranted, this isn't incredibly different from last season, when they ranked 17th in shots per possession. But now neither the defense nor Nebel is overachieving.\n\nWith an xG differential that ranks 11th in the league, they're likely to eventually move up the table moving forward. Despite sharing the lowest point total in the league with Heidenheim, current Opta projections give them only a 13% chance of finishing in an automatic relegation spot. But good fortune covered up some weaknesses last year, and that fortune is well gone.\n\nFiorentina\n\nCurrent Serie A standing: 20th (0.45 points per game, down from 1.71)\n\nBiggest statistical weakness: finishing (and set pieces). Stop me if you've heard this one before. A team that seemingly overachieved in the table last season isn't getting the same breaks this time around.\n\nFiorentina finished sixth in Serie A in 2024-25, their best league campaign in nine years, but they did it with an unsustainably brilliant run of finishing: They scored 60 goals from shots worth only 49.7 xG, a 21% overachievement. Important creatives like left back Robin Gosens and midfielders Yacine Adli and Rolando Mandragora got in on the goal-scoring act a little too well, scoring 13 goals from shots worth 5.5 xG.\n\nThis season, with Adli off to Al Shabab, Mandragora and Gosens have scored a much more normal three goals from 2.7 xG, but the team's overall finishing has vanished. Fiorentina have generated 15.5 xG (fifth) -- they're first in the league in xG per shot! -- but have scored just nine goals (14th), a 42% underachievement. Star center forward Moise Kean is enduring an incredible slump, with two goals from shots worth 5.7 xG, and Fiorentina have endured a pair of 0-0 draws, a 1-1 draw, a 1-0 loss and three 2-1 losses. In one of those draws, against Torino, Kean somehow missed a tap-in header worth 0.98 xG.\n\nLike Forest, Fiorentina have also collapsed in the set pieces department: They allowed seven set piece goals last season and have already matched that in 2025-26. Their underlying numbers are solid enough that they probably aren't a genuine threat for relegation -- Opta puts their odds at only 15% -- but worse fortune, worse finishing and worse set piece defense have all but relegated them from a shot at another European competition next season.",
  "summary": "What do the stats say? Let's look at some clubs with notable worries, and what could be done.",
  "published": "Thu, 20 Nov 2025 18:24:51 EST",
  "url": "https://www.espn.com/soccer/story/_/id/47022574/liverpool-barcelona-nottingham-forest-juventus-fiorentina-fixing-biggest-issues-analysis-bill-connelly",
  "source": "www.espn.com - TOP"
}