{
  "title": "Ukraine Expected To Give Up Land, Some Arms Under U.S. Peace Plan: Report",
  "text": "LOADING ERROR LOADING\n\nLONDON/KYIV, Nov 19 (Reuters) - The U.S. has signaled to President Volodymyr Zelenskyy that Ukraine must accept a U.S.-drafted framework to end the war with Russia that proposes Kyiv giving up territory and some weapons, two people familiar with the matter said on Wednesday.\n\nThe sources, who asked not to be identified because of the sensitivity of the matter, said the proposals included cutting the size of Ukraine’s armed forces, among other things. Washington wants Kyiv to accept the main points, they said.\n\nAdvertisement\n\nSuch a plan would represent a major setback for Kyiv as it faces further Russian territorial gains in eastern Ukraine and with Zelenskyy tackling a corruption scandal, which on Wednesday saw parliament dismiss the energy and justice ministers.\n\nPresident Donald Trump and Russia's President Vladimir Putin talk, Friday, Aug. 15, 2025, at Joint Base Elmendorf-Richardson, Alaska. AP Photo/Julia Demaree Nikhinson\n\nThe White House declined to comment on the matter. U.S. Secretary of State Marco Rubio said on X that Washington “will continue to develop a list of potential ideas for ending this war based on input from both sides of this conflict.”\n\nAdvertisement\n\n“Ending a complex and deadly war such as the one in Ukraine requires an extensive exchange of serious and realistic ideas. And achieving a durable peace will require both sides to agree to difficult but necessary concessions,” Rubio said.\n\nA senior Ukrainian official earlier told Reuters that Kyiv had received “signals” about a set of U.S. proposals to end the war that Washington has discussed with Russia. Ukraine has had no role in preparing the proposals, the source said.\n\nZelenskyy, who was holding talks in Turkey on Wednesday with President Tayyip Erdogan, is due to meet U.S. Army officials in Kyiv on Thursday.\n\nAdvertisement\n\nIn comments on Telegram, Zelenskyy did not mention Washington’s framework but called for effective U.S. leadership to help bring the more than 3 1/2-year-old war to an end.\n\n“The main thing for stopping the bloodshed and achieving lasting peace is that we work in coordination with all our partners and that American leadership remains effective, strong,” Zelenskyy wrote after meeting Erdogan in Ankara.\n\nZelenskyy said only the United States and President Donald Trump “have sufficient strength for the war to finally come to an end.”\n\nAdvertisement\n\nThe Ukrainian president also said Erdogan had proposed different formats for talks “and it is important for us that Turkey is ready to provide the necessary platform.”\n\nSigns of a renewed push by Trump’s administration to end the war triggered the biggest jump in Ukraine’s government bond prices in months on Wednesday.\n\nNo face-to-face talks have taken place between Kyiv and Moscow since a meeting in Istanbul in July and Russian forces have pressed on with Moscow’s nearly four-year-old war in Ukraine, killing 25 people in strikes overnight.\n\nAdvertisement\n\nNo Change In Russia’s Position\n\nEfforts to revive peace negotiations appear to be gaining momentum although Moscow has shown no sign of changing its terms for ending the war.\n\nRussian President Vladimir Putin has long demanded Kyiv renounce plans to join the U.S.-led NATO military alliance and withdraw its troops from four provinces Moscow claims as part of Russia. Moscow has given no indication that it has dropped any of those demands and Ukraine says it will not accept them.\n\nRussian forces control about 19% of Ukrainian territory and are grinding forwards, while carrying out frequent attacks on Ukrainian energy infrastructure as winter approaches.\n\nAdvertisement\n\nTurkey, a NATO member that has remained close to both Kyiv and Moscow, hosted an initial round of peace talks in the early weeks of the war in 2022, the only such talks until this year when Trump launched a new bid to end the fighting.\n\nThe Kremlin said Russian representatives would not be involved in Wednesday’s talks in Ankara but that Putin was open to conversations with the U.S. and Turkey about the results of the discussions.\n\nLand In Exchange For Security Guarantees?\n\nOn Wednesday, citing a U.S. official with direct knowledge of the matter, Axios reported that the new U.S. plan envisaged Ukraine granting Moscow part of eastern Ukraine it does not currently control in return for a U.S. security guarantee for Kyiv and Europe against future Russian aggression.\n\nAdvertisement\n\nA European diplomat, commenting on the purported new U.S. proposals, said they could be another attempt by the Trump administration “to push Kyiv into a corner”, but added there could be no solution that did not take into consideration Ukraine’s position or that of Washington’s European allies.\n\nAnother European diplomat said the suggestion that Ukraine cut its army seemed like a Russian demand rather than a serious proposal.\n\nA U.S. delegation led by Army Secretary Dan Driscoll is in Kyiv on a “fact-finding mission”, the U.S. embassy in Kyiv said. Army Chief of Staff General Randy George is also in the delegation and he and Driscoll will meet Zelenskyy on Thursday, a person familiar with the matter told Reuters.\n\nAdvertisement",
  "summary": "Such a plan would reward Russia for the invasion of its neighbor.",
  "published": "Thu, 20 Nov 2025 05:09:34 -0500",
  "url": "https://www.huffpost.com/entry/us-peace-plan-would-mark-setback-for-ukraine_n_691ee5f9e4b00ed8a94f1e76",
  "source": "World News"
}