{
  "title": "Funeral held for former US vice president, Iraq War architect Dick Cheney",
  "text": "Bipartisan political figures convene to honour a US vice president who leaves a fraught legacy, but Donald Trump was notably absent.\n\nA bipartisan group of former United States presidents and officials has convened in the National Cathedral in Washington, DC, to honour the life of Dick Cheney, a vice president who passed away on November 3.\n\nA powerful figure in Republican politics, Cheney served under President George W Bush from 2001 to 2009. He died at age 84.\n\nHe is best remembered for helping to spearhead the invasion of Iraq and crafting key policies during the so-called “war on terror”, including some that led to human rights abuses.\n\nAt Thursday’s funeral, a range of top officials lined the pews to offer their respects.\n\nThey included former Vice President Kamala Harris, former President Joe Biden, ex-Secretary of State Hillary Clinton and former Vice President Mike Pence, who served during President Donald Trump’s first term.\n\nNotably absent was Trump himself: He and the current vice president, JD Vance, were reportedly not invited.\n\nCheney’s former boss Bush was among the speakers to pay tribute to the vice president for his legacy.\n\n“It’s something to be cherished when a man of his calibre has been your colleague and friend,” Bush said in his remarks.\n\n“We’re grateful for his good life, we honour his service, and we pray that somewhere up the trail we will meet him again.”\n\nThe sombre memorial made little mention of the war in Iraq, which Cheney played a central role in advancing through a campaign of false claims and deception.\n\nAdvertisement\n\nBorn in Nebraska and raised in Wyoming, Cheney was only 34 when he became chief of staff to President Gerald Ford. He would later spend a decade in the House of Representatives and serve as defence secretary to Bush’s father, George HW Bush.\n\nBut it was his time under the younger Bush’s presidency that would define his legacy.\n\nFollowing the attacks on the US on September 11, 2001, Cheney leveraged the vice presidency to promote an expansive vision of executive power.\n\nHe also advanced the false narrative that Iraq held “weapons of mass destruction” as justification for the US invasion of that country.\n\nDuring the US’s “war on terror”, he repeatedly defended measures such as torture, detention without due process, and domestic surveillance in the name of national security.\n\nUnder Bush and Cheney’s leadership, critics point out the US invasions of Iraq and Afghanistan destabilised the Middle East, leading to the deaths of hundreds of thousands of people.\n\nThe Iraq War ended in 2011, and the conflict in Afghanistan stretched on for two decades, closing in 2021.\n\nThe resulting violence across the Middle East caused 940,000 direct deaths, including 432,000 civilians killed in the fighting. Millions more died from indirect causes related to the conflict, including disease and lack of healthcare infrastructure.\n\nCheney has largely defended his track record as vice president, despite accusations from human rights experts that he oversaw a campaign of torture against US prisoners.\n\nWhen asked in 2014 about his support for “enhanced interrogation tactics” like waterboarding, he denied that they were torture at all.\n\nCheney added he would “do it again” and called those who carried out the interrogations “heroes”.\n\nDespite his role as one of the most influential vice presidents in US history, Cheney had largely fallen out of favour with the Republican Party over the last 15 years.\n\nHe became further estranged from members of his party as he emerged as a vocal critic of President Trump, calling the current leader a “threat to our republic”.\n\nCheney denounced, for example, Trump’s efforts to undermine the results of the 2020 presidential election, which he lost to Biden.\n\nIn 2024, Cheney supported then-Vice President Harris, a Democrat, over Trump’s re-election bid.\n\nHis daughter Liz Cheney served as one of two Republicans on a congressional committee investigating the attack on the US Capitol on January 6, 2021, which was led by Trump supporters in protest of his 2020 loss.\n\nShe was ultimately ousted from her seat in the House of Representatives in a primary challenge from a pro-Trump candidate. She later campaigned alongside Harris in the 2024 presidential race.\n\nAdvertisement\n\n“To be in my dad’s company was to know safety and love and laughter and kindness,” Liz said in her remarks at his funeral on Thursday.\n\n“He was a giant to the end, a lion of a man, who loved and served this great republic.”",
  "summary": "Former US presidents and national figures convene to honour man who leaves fraught legacy, but Trump was notably absent.",
  "published": "Thu, 20 Nov 2025 19:44:15 +0000",
  "url": "https://www.aljazeera.com/news/2025/11/20/funeral-held-for-former-us-vice-president-iraq-war-architect-dick-cheney?traffic_source=rss",
  "source": "Al Jazeera – Breaking News, World News and Video from Al Jazeera"
}