{
  "title": "The Dinner Party by Viola van de Sandt review – a formidable debut",
  "text": "Literature loves a dinner party. From Virginia Woolf’s Mrs Dalloway to more recent offerings such as Sarah Gilmartin’s The Dinner Party and Teresa Präauer’s Cooking in the Wrong Century, an intimate soiree provides the perfect recipe of claustrophobia and choreography into which a novelist can sink their teeth. The preparations are usually unduly stressful, the guest list dynamic unpredictable, the quantity of alcohol borderline obscene – in short, as a device it has all the ingredients for total, delicious carnage.\n\nThe latest entrant to this literary Come Dine With Me is Viola van de Sandt, whose debut The Dinner Party centres on Franca, a shy young woman from the Netherlands tasked with hosting a meal for her English fiance Andrew and his two male colleagues. To make matters more challenging, it is the hottest day of the year, the menu is rabbit (despite Franca’s vegetarianism) and her sous chef is their often violent pet cat.\n\nBefore we get to all this, though, the novel begins with the words “Stella says I should write a letter”, adding two further literary devices into the mix. For Stella is Franca’s therapist, with whom she now meets regularly to unpack the repercussions of that disastrous evening a year ago, while the entire novel is framed as a correspondence addressed to the enigmatic “Harry”.\n\nThrough this letter, and these therapy sessions, Franca’s backstory is revealed, from her grief-stricken childhood to her lonely student days in Utrecht, where she meets first Harry and later the handsome Andrew. Very soon she persuades herself that none of her problems “would matter if I became part of this beautiful, privileged man’s life”, so she drops out of university and follows Andrew back to the UK. There she half-heartedly applies for some internships, then spends her days lounging around his Kensington flat drinking and watching episodes of The Crown.\n\nThe queasy smells, unctuous textures and ‘nameless dread’ are like something from a horror story\n\nThere are echoes here of Natasha Brown’s astonishing debut Assembly, a searing examination of race and class, as well as Olivia Sudjic’s Asylum Road, in which a young Bosnian woman tries to outrun her traumatic past by immersing herself in the wealthy world of her British boyfriend. That said, the class politics are never really interrogated, while Franca’s “otherness” is barely remarked upon. Andrew, at least before the dinner party, seems a bit arrogant but broadly fine, while Franca gives little sense of what she would like to be doing instead – there are vague references to becoming a writer, though as Harry says: “I can’t work out if it’s something you really want, or if it’s what you want to want.”\n\nIf the themes and characterisations are slightly muted (at one point Franca refers to herself as “bland, beige béarnaise”), the novel is much bolder in its repeated references to the dinner party’s climax, or as Franca puts it to Stella: “the culmination, the denouement […] That business with the knife.” Meanwhile, the party itself is described in intensely visceral prose, from the cannellini beans that resemble “fat maggots” to the rabbits whose “flesh glistens, seems to crawl”, everything pungent and putrid and rotting in the heat: “The fridge is dead: the butter is swimming in its dish, and the milk has curdled. The knife lies on the counter.”\n\nIt is here that Van de Sandt is at her strongest, the queasy smells, unctuous textures and “nameless dread” like something from a horror story. The description of Franca stuffing a cavity is positively grotesque, while, over the course of the evening, Franca’s own body is slowly torn apart – first shredded by the cat’s vicious scratches, then blistered by a dropped cigarette, then violated by a terrible act.\n\nThe tension builds and builds to its bloody climax; by contrast, the present-day sections see Franca – thanks to her sessions with Stella – slowly building towards a new sense of calm, finding solace in the mundane pleasure of refurbishing her one-bedroom Berlin flat. The combination is sometimes jarring, like two different recipes spliced together, but this formidable debut offers plenty to savour.",
  "summary": "<p>An intimate soiree builds to a horrific climax in this visceral novel about a young woman tasked with hosting a meal for her fiance</p><p>Literature loves a dinner party. From Virginia Woolf’s Mrs Dalloway to more recent offerings such as Sarah Gilmartin’s <a href=\"https://www.theguardian.com/books/2021/sep/25/dinner-party-a-tragedy-by-sarah-gilmartin-review-familys-subtle-poison#:~:text=A%20novel%20about%20a%20monstrous,the%20damaged%20psyches%20that%20develop.\">The Dinner Party</a> and Teresa Präauer’s <a href=\"https://www.theguardian.com/books/2025/aug/25/the-best-recent-translated-fiction-review-roundup\">Cooking in the Wrong Century</a>, an intimate soiree&nbsp;provides the perfect recipe of claustrophobia and choreography into which a novelist can sink their teeth. The preparations are usually unduly stressful, the guest list dynamic unpredictable, the quantity of alcohol borderline obscene – in short, as a device it has all the ingredients for total, delicious carnage.</p><p>The latest entrant to this literary Come Dine With Me is Viola van de Sandt, whose debut The Dinner Party centres on Franca, a shy young woman from the Netherlands tasked with hosting a meal for her English fiance Andrew and his two male colleagues. To make matters more challenging, it&nbsp;is the hottest day of the year, the menu is rabbit (despite Franca’s vegetarianism) and her sous chef is their often violent pet cat.</p> <a href=\"https://www.theguardian.com/books/2025/nov/19/the-dinner-party-by-viola-van-de-sandt-review-a-formidable-debut\">Continue reading...</a>",
  "published": "Wed, 19 Nov 2025 09:00:11 GMT",
  "url": "https://www.theguardian.com/books/2025/nov/19/the-dinner-party-by-viola-van-de-sandt-review-a-formidable-debut",
  "source": "The Guardian"
}