{
  "title": "Big announcement under PM Fasal Bima Yojana: Crop insurance to cover losses due to wild animal attacks, paddy inundation from 2026 kharif season",
  "text": "The Ministry of Agriculture and Farmers Welfare on Tuesday announced that it has now recognised the modalities for covering crop loss due to attack by wild animals and paddy inundation under the Pradhan Mantri Fasal Bima Yojana (PMFBY) from the Kharif season 2026.\n\n“Under the revised framework, crop loss due to wild animal attack will now be recognised as the fifth add-on cover under the localised risk category. States will notify the list of wild animals responsible for crop damage and identify vulnerable districts or insurance units based on historical data. Farmers will be required to report losses within 72 hours using the crop insurance app by uploading geotagged photographs,” the Ministry said in a statement.\n\nAccording to the ministry, the decision responds to “long-standing requests from several states” and is aimed at strengthening protection for farmers against sudden, localised and severe crop damage.\n\n“The modalities have been prepared in accordance with the PMFBY Operational Guidelines, ensuring a scientific, transparent and operationally feasible framework for implementation nationwide, and will be rolled out from Kharif 2026,” it said.\n\n“For years, farmers across India have suffered increasing crop losses due to attacks by wild animals such as elephants, wild boars, nilgai, deer and monkeys… Until now, such losses often went uncompensated as they were not covered under crop insurance,” the ministry said.\n\n“At the same time, paddy farmers in flood-prone and coastal states have been repeatedly affected by inundation during heavy rain and overflowing waterways. Paddy inundation was removed from the localised calamity category in 2018 due to concerns about moral hazard and the difficulty of assessing submerged crops. However, its exclusion led to a significant protection gap for farmers in districts prone to seasonal flooding,” it said. “Taking note of these emerging risks and challenges, the Department of Agriculture and Farmers’ Welfare constituted an expert committee.”\n\nAccording to the ministry, the committee’s recommendations have now been approved by the Union Agriculture Minister Shivraj Singh Chouhan.\n\nStory continues below this ad\n\n“With this important decision, farmers suffering localised crop damage will now receive timely and technology-based claim settlement under PMFBY,” it said.\n\n“This coverage is expected to significantly benefit farmers in states with high human–wildlife conflict, including Odisha, Chhattisgarh, Jharkhand, Madhya Pradesh, Maharashtra, Karnataka, Kerala, Tamil Nadu, Uttarakhand, as well as the Himalayan and North-Eastern States such as Assam, Meghalaya, Manipur, Mizoram, Tripura, Sikkim and Himachal Pradesh, where incidents of wild animal depredation are frequent and widespread,” the ministry said.\n\n“Reintroducing Paddy Inundation as a Localised Calamity Cover under PMFBY will especially benefit farmers in coastal and flood-prone states, including Odisha, Assam, West Bengal, Tamil Nadu, Kerala, Karnataka, Maharashtra and Uttarakhand, where paddy submergence is a recurring challenge,” it added.\n\nThe PMFBY was launched from Kharif 2016 with an aim to support production in agriculture by providing an affordable crop insurance product to ensure comprehensive risk cover for crops of farmers against all non-preventable natural risks from pre-sowing to post-harvest stage.\n\nStory continues below this ad\n\nSince its inception, the scheme has processed over 36 crore farmers’ applications and disbursed claims worth Rs 1.82 lakh crore, demonstrating its pivotal role in agricultural risk management and farmer welfare, as per the Agriculture Ministry officials.\n\nAccording to the officials, there were demands from states for change in the PMFBY norms to cover losses caused by wild animals. For instance, there were reports of Nilgai, wild boar and monkeys causing damage to Soybean, cotton, tur and sugarcane in Maharashtra; elephants and wild boar attacks on banana, arecanut, ragi and maize crops in Karnataka, elephant wild boar and monkey attack on banana, paddy and tubers in Kerala. Besides, the ministry also received reports of damage caused by wild animals in Uttarakhand, Odisha, Rajasthan and Jharkhand.",
  "summary": "",
  "published": "Tue, 18 Nov 2025 20:12:38 +0000",
  "url": "https://indianexpress.com/article/india/big-announcement-under-pm-fasal-bima-yojana-crop-insurance-to-cover-losses-due-to-wild-animal-attacks-paddy-inundation-from-2026-kharif-season-10373296/",
  "source": "India | The Indian Express"
}