{
  "title": "Blue Origin revealed some massively cool plans for its New Glenn rocket",
  "text": "One week after the successful second launch of its large New Glenn booster, Blue Origin revealed a roadmap on Thursday for upgrades to the rocket, including a new variant with more main engines and a super-heavy lift capability.\n\nThese upgrades to the rocket are “designed to increase payload performance and launch cadence, while enhancing reliability,” the company said in an update published on its website. The enhancements will be phased in over time, starting with the third launch of New Glenn, which is likely to occur during the first half of 2026.\n\nA bigger beast\n\nThe most significant part of the update concerned an evolution of New Glenn that will transform the booster into a super-heavy lift launch vehicle. The first stage of this evolved vehicle will have nine BE-4 engines instead of seven, and the upper stage four BE-3U engines instead of two. In its update, Blue Origin refers to the new vehicle as 9×4 and the current variant as 7×2, a reference to the number of engines in each stage.\n\n“New Glenn 9×4 is designed for a subset of missions requiring additional capacity and performance,” the company said. “The vehicle carries over 70 metric tons to low-Earth orbit, over 14 metric tons direct to geosynchronous orbit, and over 20 metric tons to trans-lunar injection. Additionally, the 9×4 vehicle will feature a larger 8.7-meter fairing.”\n\nThe company did not specify a timeline for the debut of the 9×4 variant. A spokesperson for the company told Ars, “We aren’t disclosing a specific timeframe today. The iterative design from our current 7×2 vehicle means we can build this rocket quickly.”\n\nCredit: Blue Origin A comparison of New Glenn 7×2, the Saturn V, and New Glenn 7.4 rockets. A comparison of New Glenn 7×2, the Saturn V, and New Glenn 7.4 rockets. Credit: Blue Origin\n\nOne source familiar with the company’s plans said the internal timeline would allow for the 9×4 variant of New Glenn to take flight as early as 2027.\n\nSuch a booster would be a notable vehicle, with a lift capacity nearly on par with NASA’s Space Launch System rocket. However, it would have a fully reusable first stage with a larger payload fairing and would likely cost less than one-tenth the estimated $2.2 billion cost of NASA’s super-heavy rocket.",
  "summary": "\"The iterative design from our current 7x2 vehicle means we can build this rocket quickly.\"",
  "published": "Thu, 20 Nov 2025 18:06:41 +0000",
  "url": "https://arstechnica.com/space/2025/11/blue-origin-says-its-just-getting-started-with-the-new-glenn-rocket/",
  "source": "Ars Technica - All content"
}