{
  "title": "We were not treated as parents, Covid inquiry told",
  "text": "We were not treated as parents, Covid inquiry told\n\n7 October 2024 Share Save Jim Reed Health reporter Share Save\n\nCovid Inquiry Tamsin Mullen was giving evidence to the Covid inquiry about the impact on maternity services\n\nA mother of premature twins has told the Covid inquiry she did not feel like she was treated as a parent after giving birth in the early stages of the pandemic. Tamsin Mullen said she was kept in a side room for 27 hours after giving birth by caesarean section while her sons were taken to neonatal intensive care. She said “rigid” visiting restrictions meant that, for the next month, only one parent was allowed to visit her newborn babies at a time. \"We needed the hospital to understand we were a family,\" she told the inquiry.\n\n“We didn’t feel like a mother and father to our children in the way we should have done.”\n\n‘In shock’\n\nThe Covid inquiry has been taking evidence about the impact on maternity services as part of its third section, or module, which is investigating the impact on the NHS and healthcare. Ms Mullen, a mother of three, was giving first-hand \"impact\" evidence on behalf of 13 pregnancy, baby and parent organisations. She found out she was expecting twin boys in 2019 and was considered high-risk. When pregnant with her first child, she was diagnosed with preeclampsia - a condition which can cause high blood pressure and lead to serious complications. Her pregnancy was being monitored closely with scans every week because of concerns about the development of one of the babies. Initially she said her husband was able to come with her to scanning appointments, but as Covid spread in March 2020, he was forced to wait in the car park outside after driving 50 miles from their home to the nearest hospital. “It was just before the first lockdown came into effect,\" she said. “I was very nervous. It was very difficult to do that alone knowing [the pregnancy] was high-risk.” In April 2020, Ms Mullen’s two sons were born prematurely, at 34 weeks, by caesarean section. Her husband was able to be with her in the operating theatre and then in the recovery room for an hour, before being told Covid restrictions meant he had to leave. Their two young boys then spent a total of 31 days in neonatal intensive care before they could be discharged. Ms Mullen said Covid restrictions meant only one parent could be with them at a time, even after they had been moved to a single room away from other babies.\n\nCovid Inquiry Tamsin Mullen (left) being sworn in at the Covid Inquiry\n\nThe hospital had shut off access to side rooms used for breastfeeding and Ms Mullen said she was told to use a toilet to express milk, something she did not want to do because of the infection risk. She said the restrictions were “baffling” when both parents lived together and were driving to hospital each morning in the same car. She was looking after both babies by herself in intensive care when hospital staff from outside the unit told her they had tested positive for a bacterial infection called MRSA. “I was holding our son who was on oxygen at the time,” she said. “I was in a state of shock so didn’t really say very much. They [the staff] left me and I was there on my own. “I didn’t know what it all meant, so I really panicked.” Later a doctor explained the form of MRSA involved was a less serious type that could be treated with soap and water. \"We didn’t feel like we were being treated as parents. It was like we were visitors, and we were visiting two patients,\" she said.\n\n24/7 unrestricted access",
  "summary": "Mum of premature twins says rigid restrictions on birthing wards during Covid were traumatic.",
  "published": "Mon, 07 Oct 2024 14:11:38 GMT",
  "url": "https://www.bbc.com/news/articles/c70z1ppyv5eo?at_medium=RSS&at_campaign=rss",
  "source": "BBC News"
}