{
  "title": "Two plant species invent the same chemically complex and medically interesting substance",
  "text": "The elucidation of the biosynthetic pathway of ipecacuanha alkaloids shows how two distantly related plant species could develop the same substance independently.\n\nPlants produce an enormous abundance of natural products. Many plant natural products are ancestry-specific and occur only in certain plant families, sometimes only in a single species. Interestingly, however, the same substances can sometimes be found in distantly related species. In most cases, however, only the end product is known and it is largely unclear how these substances are produced in plants. Ipecacuanha alkaloids occur in two distantly related plant species known as medicinal plants: in ipecac Carapichea ipecacuanha, which belongs to the gentian family, and in the sage-leaved alangium (Alangium salviifolium), which belongs to the dogwood family and is known from Ayurvedic medicine.\n\nEarlier studies had already shown that both species produce ipecacuanha alkaloids. In particular, the extract of ipecac (\"Ipecac syrup\") was a widely used pharmacy-only medication until the 1980s (especially in North America), used to induce vomiting in cases of poisoning. The active emetic substances are cephaelin and emetine, both of which are derived from the precursor protoemetine, but it was largely unknown how they produce these. In only two small studies had some enzymes been identified in ipecac, but most of the enzymes were unknown and no enzymes were known at all in Alangium.\n\nFor Maite Colinas, first author of the study and project group leader in the Department of Natural Product Biosynthesis at the Max Planck Institute for Chemical Ecology, Jena, the key questions were: \"The last common ancestor of these species lived more than 100 million years ago, so we hypothesized that the two species had independently developed ways to produce ipecac alkaloids. A key question was whether they had found the same or different pathways to produce these compounds, both chemically and enzymatically.\"\n\nInitially, the team found that ipecac alkaloids are present to some extent in all plant tissues of both species, but much higher amounts occur in young leaf tissues and in underground plant organs. By comparing tissues with high and low levels of ipecac alkaloids, genes that could be involved in the biosynthesis were identified. Further tests and genetic transformation of a model plant allowed the stepwise reconstruction of the biosynthetic pathway in both species. The pathway held a few surprises in store; contrary to expectations, the first step in the biosynthesis does not appear to be controlled by an enzyme, but instead occurs spontaneously. Another surprise was the involvement of an unusual enzyme. Its three-dimensional structure was completely different from all other enzymes that catalyze the same reaction, namely the cleavage of a sugar molecule. \"This class of enzymes is usually not involved in the production of natural products. This is probably also the reason why it was the last enzyme we identified in this study,\" reports Maite Colinas.\n\nInterestingly, the sugar-cleaving enzyme was detected in the cell nucleus, while the substrate is thought to be located in the vacuole. After the sugar has been cleaved, the substances are highly reactive and thus likely to be toxic. By spatially separating the substrate and enzyme, the plant avoids the presumed toxic accumulation of these toxic compounds. However, if a herbivore, such as a caterpillar, eats from the plant, the cells are destroyed, enzyme and substrate come together and the toxic substances are only formed as defensive substances when they are needed. Similar defense systems with spatial separation of enzyme and substrate have already been described for other natural products, for example for glucosinolates, saponins or monoterpenoid indole alkaloids. Plants repeatedly use the same defense mechanisms and use chemically completely different compounds.\n\nA comparison of the enzymes involved in the biosynthesis of the two plant species suggests that they have evolved the production of the same group of alkaloids independently of each other in the course of evolution. \"Since the biosynthesis of ipecac alkaloids appears to have evolved independently, this pathway may serve as a model for research into the evolution of natural product pathways. Downstream metabolites, particularly in Alangium (e.g. tubulosin), also have interesting pharmacological effects, but their specific effects have not been well studied due to their low abundance. Therefore, our research could help to produces these substances in larger quantities in the future, so that their pharmacological activities can be investigated in more detail,\" explains Sarah O'Connor, head of the Department of Natural Product Biosynthesis at the MPI for Chemical Ecology, the significance of the study.\n\nIn further work, the final steps of the biosynthesis are to be elucidated, because so far, the entire metabolic pathway has only been demonstrated up to the central intermediate protoemetin, but the steps to the end products are still missing.",
  "summary": "The biosynthesis of the great variety of natural plant products has not yet been elucidated for many medically interesting substances. In a new study, an international team of researchers was able to show how ipecacuanha alkaloids, substances used in traditional medicine, are synthesized. They compared two distantly related plant species and were able to show that although both plant species use a comparable chemical approach, the enzymes they need for synthesis differ and a different starting material is used. Further investigations revealed that the biosynthetic pathways of these complex chemical compounds have developed independently in the two species. These results help to enable the synthesis of these and related substances on a larger scale for medical use.",
  "published": "Tue, 03 Jun 2025 11:48:18 EDT",
  "url": "https://www.sciencedaily.com/releases/2025/06/250603114818.htm",
  "source": "Latest Science News -- ScienceDaily"
}