{
  "title": "Extreme-pressure experiment reveals a strange new ice phase",
  "text": "The Korea Research Institute of Standards and Science (KRISS, President Lee Ho Seong) has captured the first-ever observation of water repeatedly freezing and melting at ultrahigh pressures above 2 gigapascals (2 GPa) while remaining at room temperature. These rapid changes were recorded on a microsecond (μs, one-millionth of a second) timescale.\n\nThis achievement led to the identification of a completely new crystallization pathway for water and the discovery of a previously unknown ice phase. The newly recognized structure has been named Ice XXI, making it the 21st crystalline form of ice.\n\nHow High Pressure Creates New Forms of Ice\n\nWater typically turns into ice when its temperature drops below 0 °C, but pressure can also drive crystallization. Under the right pressure conditions, ice can form at room temperature or even at temperatures higher than its usual boiling point. For example, water compressed beyond 0.96 GPa at room temperature transforms into Ice VI.\n\nDuring freezing, the hydrogen-bonded network among water molecules becomes distorted and reorganized in complex ways. These shifts produce a wide range of ice structures depending on the surrounding pressure and temperature.\n\nA more detailed understanding of how these molecular rearrangements occur, and the ability to control them under extreme conditions, could pave the way for creating entirely new materials that do not exist naturally on Earth.\n\nA Century of Ice Research Reaches a New Milestone\n\nOver the past 100 years, scientists have identified 20 distinct crystalline ice phases* by adjusting pressure and temperature. These phases appear across a massive range of more than 2,000 K in temperature and over 100 GPa in pressure. The zone between ambient pressure (0 GPa) and 2 GPa is considered one of the most complex regions of water's phase diagram, where more than ten different ice phases cluster together.\n\nThe Space Metrology Group at KRISS managed to create a supercompressed liquid state in which water remained liquid at room temperature despite being pressurized to more than 2 GPa, which is over twice the pressure normally required for crystallization. This was made possible with a dynamic diamond anvil cell (dDAC**), a high-pressure instrument developed at KRISS.\n\nConventional diamond anvil cells (DACs) increase pressure by tightening bolts, a process that often introduces pressure gradients and mechanical disturbances that trigger premature nucleation. The KRISS dDAC minimizes these issues by reducing mechanical shock and cutting the compression time from tens of seconds to only 10 milliseconds (ms). This allowed water to be pushed deeply into the Ice VI pressure range while remaining liquid.\n\nCapturing the Birth of a New Ice Phase\n\nIn collaboration with international partners, KRISS scientists used the dDAC together with the European XFEL (the world's largest X-ray free-electron laser facility) to monitor the crystallization of supercompressed water with microsecond precision. These observations revealed complex, previously unseen crystallization pathways at room temperature. The transitions occurred through a new ice phase, Ice XXI, marking the first global identification of the 21st crystalline form of ice.\n\nThe researchers also determined the detailed structure of Ice XXI and mapped the various pathways leading to its formation. Ice XXI shows an unusually large and intricate unit cell compared to other known phases. The crystal's geometry is a flattened rectangular lattice in which the two base edges are identical in length.\n\nA Large International Collaboration\n\nThis discovery involved 33 researchers from South Korea, Germany, Japan, the USA, and England, along with scientists at the European XFEL and DESY. The project was proposed and led by KRISS under the direction of Dr. Lee Geun Woo, who served as principal investigator (PI).\n\nThe KRISS team included Dr. Kim Jin Kyun (co-first author, postdoctoral researcher at KRISS), Dr. Kim Yong-Jae (co-first author, formerly postdoctoral researcher at KRISS and now at Lawrence Livermore National Laboratory), Dr. Lee Yun-Hee (co-first author, Principal Research Scientist), Dr. Kim Minju (co-author, Postdoctoral Researcher), Dr. Cho Yong Chan (co-author, Principal Research Scientist), and Dr. Lee Geun Woo (corresponding author, Principal Research Scientist). They led the experimental design, data collection, and structural analysis that enabled the first identification of Ice XXI. Their work represents a major advancement for high-pressure physics and planetary science.\n\nDr. Lee Yun-Hee said, \"The density of Ice XXI is comparable to the high-pressure ice layers inside the icy moons of Jupiter and Saturn. This discovery may provide new clues for exploring the origins of life under extreme conditions in space.\"\n\nDr. Lee Geun Woo added, \"By combining our in-house developed dDAC technology with the XFEL, we were able to capture fleeting moments that had been inaccessible with conventional instruments. Continued research into ultrahigh-pressure and other extreme environments will open new frontiers in science.\"\n\nNotes\n\n* Previously, ice phases from Ice I to Ice XX had been reported. Ice I appears in two structural forms: the hexagonal Ice Ih and the cubic Ice Ic.\n\n** The dDAC is a high-pressure device that uses a pair of diamonds and piezoelectric actuators to dynamically control and observe pressure changes in a microscopic water sample.\n\nThis research was supported by the 4000 K-class Rocket Engine Ultra-High Temperature Materials and Measurement Technologies Development Project of the National Research Council of Science & Technology (NST). The results were published in Nature Materials (Impact Factor: 38.5) in October.",
  "summary": "Researchers at KRISS observed water’s rapid freeze–melt cycles under ultrahigh pressure and discovered Ice XXI, the first new ice phase found in decades. Using advanced high-pressure tech and microsecond XFEL imaging, they uncovered complex crystallization pathways never seen before. Ice XXI’s structure resembles the high-pressure ice found inside Jupiter and Saturn’s moons, hinting at planetary science implications.",
  "published": "Sun, 16 Nov 2025 10:45:41 EST",
  "url": "https://www.sciencedaily.com/releases/2025/11/251115100051.htm",
  "source": "All Top News -- ScienceDaily"
}