{
  "title": "'Best display of season' but Chelsea rue missed opportunity",
  "text": "Having suffered plenty of past heartache at Barcelona's expense, Chelsea may have ordinarily celebrated a 1-1 draw with them in the Women's Champions League.\n\nBut this was a missed opportunity.\n\nChelsea were the better side on the night, dominating most of the first half and creating plenty of goalscoring opportunities.\n\nThey led for eight minutes before failing to clear a corner and allowing Ewa Pajor to pounce on the loose ball, cancelling out Ellie Carpenter's delicious opener.\n\nAustralian Carpenter should have scored the winner too but dragged her close-range finish wide with 10 minutes to go and only the keeper to beat.\n\nIt was perhaps in that moment manager Sonia Bompastor knew their chance to beat Barcelona had gone.\n\nSubstitute Catarina Macario also had a goal ruled out for a marginal offside, and when the full-time whistle eventually went, the Blues boss shook her head in frustration as her side dropped to sixth in the league phase table - two points behind their Spanish visitors in first place.\n\nThis was an impressive performance and a drastic improvement from their 8-2 aggregate defeat by Barcelona in last season's semi-finals - but their lack of ruthlessness ultimately proved costly and denied them the victory they craved.\n\n\"I think it is frustrating not to have won the game, especially when you look at the statistics and the chances we had,\" said Bompastor.\n\n\"We had opportunities to win so I'm frustrated for that reason, but overall there were also a lot of positives to take.\n\n\"We know in the Champions League and in the important games we need to be clinical. We have spoken about that and my players are trying so hard.\n\n\"I'm really pleased with the performance. Everyone worked hard and I think when we are playing at this level, we can put in performances like this one.\"",
  "summary": "Having suffered plenty of past heartache at Barcelona's expense, Chelsea may have ordinarily celebrated a 1-1 Women's Champions League draw - but this was a missed opportunity.",
  "published": "Thu, 20 Nov 2025 23:55:55 GMT",
  "url": "https://www.bbc.com/sport/football/articles/c2eme0mzj2ko?at_medium=RSS&at_campaign=rss",
  "source": "BBC Sport"
}