{
  "title": "These families' health care costs will balloon if Congress doesn't act on the ACA",
  "text": "These families' health care costs will balloon if Congress doesn't act on the ACA\n\ntoggle caption Chris O'Donnell, Bixon family, Genna Boatright, Ezra McKay and Kristine Weidner\n\nThe government shutdown has ended without resolving a fight over health insurance. Congress failed to extend enhanced tax credits that have helped millions of Americans on Affordable Care Act plans cover their plan costs since 2021.\n\nSenate Republicans have promised a vote on the enhanced subsidies before the end of the year. But open enrollment for these plans is already underway and consumers are facing sky-high prices and little certainty about whether they'll get relief.\n\nAnd making matters worse, insurers have raised prices on these plans because they predict that without the tax credits, healthier people may not sign up in 2026, leaving them a sicker, costlier pool of customers. Premiums on the marketplaces are rising by an average of 26% next year, according to health policy organization KFF. That's the largest rate increase since 2018.\n\nSponsor Message\n\nThere's less than a month to go before the Dec. 15 deadline to sign up for a plan that begins Jan. 1. If Congress doesn't act before then, some people may have to choose between paying far more than they're comfortable with or forgoing insurance altogether.\n\nHere are their stories:\n\nShe \"can't swing\" an extra $1,000 a month\n\nAmy Jackson, Butler, Mo.\n\ntoggle caption Amy Jackson\n\nAmy Jackson, 56, works in medical billing at an independent urgent care center. She buys coverage on the ACA marketplace because her employer is too small to have health benefits. She says her current premiums are affordable for her at $275 a month but will go to $1,250 in 2026 without the tax credit.\n\nGoing without insurance is really not an option for her. In October, she was diagnosed with breast cancer. So she's rushing to get in as much treatment as she can before the year ends, but she'll still need coverage for follow-up appointments next year.\n\nSince she works in the medical field, she says she knows the insurance industry is part of the problem here. But she says people like her need help now, and lawmakers need to understand that.\n\n\"For them, a thousand bucks is probably nothing. It's probably what they blow on dinner. But for me, that's half of my wage,\" she says. \"I just can't swing that.\"\n\nSponsor Message\n\n\"A very daunting amount of money\" for a retiree\n\nRobert Bixon, Boynton Beach, Fla.\n\ntoggle caption Bixon family\n\nA 61-year-old retiree, Robert Bixon, faces 2026 premiums of $4,500 a month to cover himself, his wife, and one of his sons. That's $54,000 a year, plus potentially spending up to $15,000 for their out-of-pocket maximum.\n\nBixon says he knew he'd have to pay for health care out of pocket after retiring from his career as a small business owner. \"But,\" he says, \"in my wildest dreams, I never thought a number close to $70,000 a year would be the cost that I'd be facing.\"\n\n\"It's a very daunting amount of money,\" he says.\n\nWhat scares Bixon even more is that prices could keep going up: \"Twelve months from now, we could be having the same conversation and I could be looking at another 20% or 30% increase.\"\n\n\"I wonder if I'm going to be able to live out my days and enjoy my retirement and not run out of money,\" he says.\n\nStill, Bixon isn't willing to risk living without insurance before becoming eligible for Medicare at 65. He has spent his entire adult life saving and investing for retirement and says he \"can't risk getting wiped out by long-term hospitalization.\"\n\n\"I just don't understand how the leadership in this country can find that acceptable for working-class Americans — people who started businesses, helped employ other people, paid taxes — now [are] looking at these kinds of health care costs,\" he says.\n\nFears losing access to treatment for his bipolar disorder\n\nEzra McKay, Memphis, Tenn.\n\ntoggle caption Ezra McKay\n\nEzra McKay, 26, works part-time as a bookseller. He was kicked off his mother's plan, and his employer won't give him enough hours to get on the employer plan. So he buys his own insurance on the ACA marketplace.\n\nHe has bipolar disorder and the insurance, which covers his doctors' visits and prescriptions, has been a game changer for his health.\n\nSponsor Message\n\nHaving that covered, he says \"has been such a relief. It's just made me feel important and valid, like I deserve to exist or something like that.\"\n\nBut without the subsidy, his premium for next year will go from $15 per month to $550, which is nearly half his monthly income.\n\nWithout insurance to cover his medication, McKay says, \"I would be in an extremely bad situation of having difficulty maintaining my job, maintaining my house, maybe even having a life-threatening situation, if I were to have a mental health crisis.\"\n\nHe says he is considering moving to California or Washington state, where state programs offer more secure coverage.\n\n\"Where along the lines did I not do the right thing?\"\n\nCatriona Johnson, Chapel Hill, N.C.\n\nBefore the ACA, 44-year-old Catriona Johnson had to live without health insurance for several years because she had a pre-existing condition. She was born with a congenital abnormality that required multiple surgeries in her abdomen and still requires her to use a catheter every day.\n\nShe says that the preventative care she got access to through ACA has increased her quality of health enough for her to earn her Master of Social Work degree.\n\nCurrently, she pays $442 a month for her premium with the tax credit, but that is set to go up to $666 next year. Her deductible will jump by $1,000.\n\nInsurance is critical for her as she requires ongoing medical care.\n\n\"I have no idea what I am going to do if I cannot afford care. Just go day by day, keep trying,\" she says.\n\nJohnson says she's always tried to do things right. Despite her serious health problems, she went to college and grad school and has a job. Still, she lives paycheck to paycheck as a contract social worker in private practice, with most of her credit card bills being medical-related — medical supplies, medications, doctors' appointments.\n\nSponsor Message\n\nShe wonders, \"Where along the lines did I not do the right thing?\"\n\nShe worries that the rise in costs for her health insurance will affect her credit, which already happened in her 20s because of medical debt. \"Everything I can't pay — on to the credit card, to worry about another day.\"\n\nTo cover an extra $1,300 a month, he'll stop contributing to retirement\n\nChris O'Donnell, Richmond, Va.\n\ntoggle caption Chris O'Donnell\n\nAfter he got laid off from his job this summer, Chris O'Donnell, 58, started a freelance business. He gets his health insurance through Virginia's ACA marketplace.\n\nHe and his wife currently pay $837 a month for their plan. Without subsidies, the 2026 cost will be $2155 — that's $1,300 more per month.\n\nO'Donnell says he plans to redirect the money he would have saved for retirement to cover the added premium costs. \"This is not the time to be zeroing out my retirement contributions, but what choice do I have?\"\n\nHis wife has diabetes and is a cancer survivor, so \"not having insurance is just completely out of the question,\" he says. \"Even if I wanted to go without health insurance, just the supplies for her insulin pump would cost $25,000 a year anyway, so I wouldn't actually be saving anything.\"\n\nHe and his wife are seriously considering retirement in a country where health care costs are more stable.\n\n\"If this is the new normal and then you figure, health insurance is going to go up 20% every year, then I don't know that long-term staying in this country is going to be sustainable for us,\" he says.\n\nWith the cost more than doubling, she might forgo health insurance\n\nCeleste Jameson, North Port, Fla.\n\ntoggle caption Celeste Jameson\n\nFor paralegal Celeste Jameson, 41, her monthly insurance premiums will more than double next year, from $266 to $593.\n\n\"I can't afford $593 a month. I just can't, on top of all of my other living expenses,\" Jameson told WUSF.\n\nSponsor Message\n\nAs a young adult, she suffered from severe abdominal and pelvic pain that went undiagnosed until just over 10 years ago, when she was finally able to get reliable health insurance through the ACA marketplace.\n\n\"I was in and out of hospitals with severe pain, ovarian contusions and everything, with no insurance,\" she said.\n\nThe bills piled up. She got into medical debt.\n\nIn 2014, after being rushed to the emergency room in \"probably the worst pain I'd ever had,\" a doctor diagnosed her with endometriosis, a condition where tissue similar to the lining of the uterus grows in other parts of the body.\n\nOnce she felt better, she was able to take on regular work as a paralegal. She credits her health insurance with finally helping her get the diagnosis that led to her improved health.\n\nShe has not yet renewed her insurance for next year.\n\n\"It scares me to know or to even imagine that I could be back where I was before 2014,\" she said.\n\n\"I'd rather eat nothing but PB&Js than give up my health insurance.\"\n\nKelly Badeau, Tucson, Ariz.\n\nKelly Badeau is facing monthly insurance costs of nearly nine times what she is paying now. She currently pays $94 per month for a silver ACA plan after the tax credits, and her 2026 plan will cost an estimated $900.\n\nBefore becoming self-employed 10years ago, she had \"bare bones\" insurance with a high deductible through an employer. Her current ACA silver plan \"is the best insurance I've ever had,\" she says.\n\nIt has allowed her to take a proactive approach to her health, including annual primary care visits, screenings like mammograms and a colonoscopy, and seeing an audiologist. \"With the ACA, I'm healthier both mentally and physically,\" she says.\n\nShe says she doesn't want to drop her current plan. \"I'd rather eat nothing but PB&Js than give up my health insurance,\" she says.\n\nSponsor Message\n\nShe sold her home last year and says she'll have to use some of that money to pay for health care.\n\n\"I will dip into my savings to make my payments next year,\" she says. \"I don't want this administration to think they can tank the ACA by making us suffer.\"\n\nBut Badeau worries that she might have to start cutting corners in her health if she has too many medical expenses and can't afford the co-pays. Her husband may need treatment for prostate cancer soon, and she's on hormone therapy for menopause and blood pressure drugs.\n\n\"I'm just trying to keep my head above water until I can get Medicare, but that's still many years from now,\" she says.\n\nShe worries she'll become disabled without health care\n\nGenna Boatright, Siren, Wis.\n\ntoggle caption Genna Boatright\n\nGenna Boatright, 40, has an aggressive case of rheumatoid arthritis and relies on medication to control it.\n\nShe is currently only paying $12 a month for her insurance premium because the enhanced subsidy covers most of her cost. But she says without the tax credit, her new premium costs will be $700, based on the numbers she's seeing in the marketplace.\n\n\"And that I absolutely cannot afford,\" she says.\n\nShe says her income changed this year, and when she went onto the marketplace to shop for plans, she was pushed to apply for Medicaid. But she was denied Medicaid coverage. So she's continuing to see what is possible and waiting to see if anything changes with the prices.\n\n\"The flood of overwhelm has been real,\" she says. She worries about how she will get coverage she can afford and is \"trying to make it through the days.\"\n\n\"I do worry that without insurance and specialty care and the medication that I'm on, how quickly I will become disabled,\" she says. \"And that's an absolutely terrifying prospect.\"\n\nSponsor Message\n\nAs a self-employed therapist, her ACA plan is her only option for insurance\n\nKristine Weidner, Branford, Conn.\n\ntoggle caption Kristine Weidner\n\nSelf-employed as a psychotherapist, Kristine Weidner, 62, says the cost of the plan she buys on the ACA marketplace will nearly triple in 2026. Her current high-deductible plan costs $589 a month, not including dental, and a comparable plan for 2026 will cost $1691 a month.\n\nShe's really worried about the cost and about meeting the deductible. \"If I include dental, it will cost more than my housing,\" she says.\n\nAnd she has \"no other option\" for health care. Going without insurance, she says, isn't a wise choice at her age.\n\nShe's also worried the rising costs may impact volume in her business as some clients may forgo insurance and not be able to afford her services.\n\n\"I may need to consider closing my business and returning to the public sector and employer-based insurance.\"\n\nNPR's Margaux Bauerlein and Selena Simmons-Duffin and WUSF's Kerry Sheridan contributed reporting.",
  "summary": "Millions of Americans face sharply rising costs for health care plans they bought through the Affordable Care Act marketplaces, unless Congress acts soon. Here's what's at stake for them.",
  "published": "Thu, 20 Nov 2025 12:13:15 -0500",
  "url": "https://www.npr.org/2025/11/20/nx-s1-5614949/aca-subsidies-health-insurance-costs",
  "source": "NPR Topics: News"
}