{
  "title": "The Pelvic Floor Is a Problem",
  "text": "I was settling into one of those airport activity tables with high stools and electric outlets at my flight’s gate, waiting for the agent to announce boarding, when I felt a gathering storm at the apex of my butt cheeks. This was my last flight after being away from home on a book tour in May. For the past two weeks, I hadn’t left my chair much, due to all the posting, podcasting, writing, and tense, nervous scrolling that releasing a book involves. But I’d moved just fine from plane to hotel to bookstore. I’d even made a point of walking to the bookstores from hotels and back, to indulge some kind of Walt Whitman–esque fantasy.\n\nBut now, at the last moment, alarm bells were going off. The pain felt as if I’d taken a hard hit to my tailbone, as I’d once done after going off a jump in an inner tube and landing ass-first on hard-packed snow. But there was no incident to ascribe the pain to. It had arrived unbidden. And now it not only hurt to sit down as I faced two hours of compulsory sitting, but the pain was growing with every minute.\n\nI spent the flight lurched forward in my seat, weight shifted all the way onto one leg, rocking back and forth as much as I could without looking like I was experiencing a religious hallucination. By the time I had to stand up, it was all I could do to not cry out—as bad as the pain was sitting down, standing up sent a radical guitar solo through my coccyx.\n\nAt that time, I was about four months postpartum from delivering my first baby, and had had a blissful recovery, all things considered. I had pelvic muscles of steel, thanks to over a decade of lifting heavy weights, a practice I continued until two weeks before giving birth. I had only been back to lifting for a couple of months—deadlifts, squats, bench, overhead press, here and there some rows or lat pull-downs—but everything had been going well.\n\nAt first I thought maybe the pain would disappear as quickly and mysteriously as it came. I knew that, just as the body goes through a loosening and expanding process to get ready for birth, it re-compacts itself slowly over several months after the baby is born. I figured that maybe my sudden sedentariness had healed my body too tight, like in Rookie of the Year. I began doing stretches I found online to try and pull my bones apart again—ankle crossed over knee and knee pulled to chest; sitting upright with legs splayed on the floor at right angles; knees crossed over each other like an overzealous lotus pose. Again, it seemed to help a little, but the pain persisted, and worsened enough to make me cry out every time I tried to sit for more than 10 minutes. This was a problem, because sitting was, in some sense, my livelihood—as a writer, I couldn’t get words down or read unless I could be still. Eventually, after weeks of lying around the house, I made an appointment with a physical therapist, who, after hearing about my problems, forwarded me on to a pelvic floor specialist.\n\nPelvic floors are not a part of the body that I grew up hearing about. And it wasn’t terribly long before my own pelvic floor episode that I learned we’ve all got one—old people, children, women, men. Most people’s familiarity with pelvic floor activity extends only as far as “Kegels,” a semimystical gripping motion that women are encouraged to practice in order to be good at sex, and more wrongly, to get a baby out of one’s birth canal. But Kegels only capture one small aspect of what the pelvic floor is capable of.",
  "summary": "Everyone’s suddenly obsessed with the pelvic floor—physical therapists, MAHA influencers, me. Could this deeply misunderstood body part really be the seat of so much modern dysfunction?",
  "published": "Thu, 20 Nov 2025 11:00:00 +0000",
  "url": "https://www.wired.com/story/the-pelvic-floor-is-a-problem/",
  "source": "WIRED"
}