{
  "title": "Day before restart of Manipur’s biggest tourism fest, protesters clash with security forces: ‘Restore free movement first’",
  "text": "A day before it is set to resume following a two-year hiatus due to the ongoing conflict in the state, Manipur’s biggest tourism festival — the Sangai Festival — ran into trouble, with protesters opposing the festival clashing with security forces in Imphal on Thursday. The clash left at least three people injured.\n\nThe Manipur Sangai Festival, which was held for the first time in 2010, was last held in November 2022. It was not held in 2023 or 2024, after the ethnic conflict broke out in Manipur in May 2023.\n\nThis year, after the state government resumed its second-largest festival, the Shirui Lily Festival in Ukhrul this May, it decided to bring the Sangai Festival back for its 12th edition.\n\nThe festival is scheduled to be a 10-day event from November 21 to November 30. Musical performances, including by renowned pop band BLUE, film screenings, a football tournament, polo and adventure activities, and traditional art, including music, dance and crafts, are scheduled to be part of the festival.\n\n‘Insensitive’\n\nHowever, the elaborate plans for the festival have been met with resistance by a section of people displaced by the conflict and civil society organisations based in the Manipur valley. Meitei civil society body COCOMI has called for a boycott of the event, calling “the State’s insistence on an extravagant festival” at this time “insensitive, misplaced and against the wishes of the people”. According to COCOMI, before any celebrations, the state must “restore the fundamental rights and freedom of movement of all citizens, ensure the safe return of all IDPs (internally displaced people) to their homes, re-establish peace and normalcy across Manipur, and stop all forms of coercion and suppression against civilian voices.”\n\nOn Thursday, COCOMI led a protest rally of displaced people and representatives of other civil society bodies, and marched towards Raj Bhavan carrying placards reading, “Security and justice before festival façade”, “no peace, no Sangai festival”, and “Fundamental rights before festival”. (Express Photo) On Thursday, COCOMI led a protest rally of displaced people and representatives of other civil society bodies, and marched towards Raj Bhavan carrying placards reading, “Security and justice before festival façade”, “no peace, no Sangai festival”, and “Fundamental rights before festival”. (Express Photo)\n\nOn Thursday, COCOMI led a protest rally of displaced people and representatives of other civil society bodies, and marched towards Raj Bhavan carrying placards reading, “Security and justice before festival façade”, “no peace, no Sangai festival”, and “Fundamental rights before festival”. The protesters were stopped by security forces at Palace Gate in Imphal East district.\n\nAs the protesters tried to force their way through the security barricade, a scuffle broke out, prompting the security forces to use baton charges and teargas shells to disperse the crowd. The resulting scuffle left at least three protestors injured.\n\nCrucial step forward: Govt\n\nStory continues below this ad\n\nAmid the objections to the festival, the state government has maintained that it is a crucial step towards reviving activities in the state. In an “appeal to the people of Manipur” for support to the festival, Chief Secretary Puneet Goel wrote that “economic revival, tourism promotion, youth empowerment and community harmony are vital pillars for bringing Manipur back onto a sustained path of growth”.\n\nReiterating the relief packages and rehabilitation work underway for displaced people, he wrote, “While relief and rehabilitation of IDPs is the top priority for the State Government, holding of Sangai Festival is also important for economic acceleration and to provide market linkages for local artisans, entrepreneurs, craftsmen and farmers, boosting trade and investment. The government is simultaneously pushing major developmental projects to create jobs and enhance the ease of living.”",
  "summary": "",
  "published": "Thu, 20 Nov 2025 14:06:11 +0000",
  "url": "https://indianexpress.com/article/india/day-before-restart-of-manipurs-biggest-tourism-fest-protesters-clash-with-security-forces-restore-free-movement-first-10376760/",
  "source": "India | The Indian Express"
}