{
  "title": "‘Said it in flow…’: Madhya Pradesh minister apologises for calling Raja Ram Mohan Roy ‘British agent’",
  "text": "Madhya Pradesh Higher Education Minister and BJP leader Inder Singh Parmar on Sunday apologised for his remarks on social reformer Raja Ram Mohan Roy, whom he had termed a “British agent” during a speech on Saturday.\n\nParmar had made the controversial remarks in Agar Malwa district during an event to mark the 150th birth anniversary of tribal icon Birsa Munda. At the event, he had claimed that English education was being used as a cover for religious conversions during the era of British colonial rule.\n\n“I was present at a public event in Agar on the birth anniversary of Bhagwan Birsa Munda. I was discussing his life and discussing the British conspiracy. I mistakenly and in the flow said something offensive about social reformer Raja Ram Mohan Roy, and I regret it. I repent for it. I personally respect Raja Ram Mohan Roy,” Parmar said in an apology video shared on his X handle on Sunday morning.\n\nParmar’s remarks against Roy drew sharp criticism from Congress leaders in Madhya Pradesh as well as the Trinamool Congress in West Bengal. Furthermore, it has been learnt that senior BJP leaders reached out to Parmar, advising him to issue an apology to “contain any backlash from his comments”. The quick damage control exercise has also come in the wake of the upcoming Assembly elections in West Bengal in 2026, with the BJP hoping to unseat the ruling TMC.\n\nThe TMC pounced on Parmar’s statement to mount an attack on the BJP. Many senior leaders issued statements accusing the BJP of “defaming Bengal and the towering icons who shaped our civilisation”.\n\nWest Bengal minister and Trinamool leader Shashi Panja accused the BJP of “consistently insulting” the state and its icons.\n\n“When you cannot match the intellect of Bengal, you then insult Bengal. We worship him (Roy), women worship him because Sati got abolished due to his protest. He was a true reformer, while the BJP says that he was a fake reformer… Consistently, the BJP has been insulting the icons of Bengal who are Bengal’s soul, our pride. They are India’s pride,” Panja said.\n\nStory continues below this ad\n\nTrinamool Congress Rajya Sabha MP Ritabrata Banerjee alleged that the “BJP’s hatred for Bengal’s icons knows no bounds”.\n\n“The same Raja Ram Mohan Roy, who abolished the practice of Sati, has been called a British agent by the BJP… This isn’t the first time they insulted Bengal’s pride… Every act exposes the BJP’s Bangla virodhi mindset,” he said.\n\nIn his controversial speech on Saturday, Parmar had claimed that the British created “fake social reformers” to serve their agenda, and named Roy among them.\n\n“Raja Ram Mohan Roy was a British agent. He worked as their broker in the country. There was a vicious cycle of religious conversions that he started,” Parmar had said, adding, “If anyone had the courage to stop it and protect tribal society, it was Birsa Munda.”\n\nStory continues below this ad\n\nThe minister further claimed that during the British era, missionary schools were the only educational institutions available, and that they used education as a cover for religious conversion. He said Birsa Munda recognised this pattern and left missionary education to fight for his community and against British rule.\n\nThis is not Parmar’s first brush with controversy over historical interpretations. Earlier, he had claimed that Portuguese explorer Vasco da Gama got to India by following an Indian merchant named Chandan. “We have been taught the wrong history,” he had said.",
  "summary": "",
  "published": "Mon, 17 Nov 2025 01:42:58 +0000",
  "url": "https://indianexpress.com/article/india/said-in-flow-madhya-pradesh-minister-apologises-for-calling-raja-ram-mohan-roy-british-agent-10369621/",
  "source": "India | The Indian Express"
}