{
  "title": "Asaduddin Owaisi’s sharp attack on CM Yogi Adityanath after UP govt moves to withdraw Akhlaq lynching case",
  "text": "Asaduddin Owaisi of the AIMIM slammed the Bharatiya Janata Party-led Uttar Pradesh government on Thursday, days after the Yogi Adityanath administration decided to withdraw the Mohammad Akhlaq mob lynching case against the accused, alleging that it always stood with the guilty. Taking a swipe at Yogi Adityanath, the AIMIM chief said the Chief Minister makes big statements about law and order; but this is the true face of the BJP — “it will always stand with the guilty”.\n\nIn a post on X, Owaisi wrote, “According to the government, this decision is in the interest of ‘social harmony’,'” and added that harmony is impossible on the foundation of injustice.\n\nWhat is Mohammad Akhlaq mob lynching case?\n\nThe case dates back to 2015, when the 50-year-old UP man was lynched by a mob over rumours of alleged cow slaughter and storing its meat at his home in Bisada, Dadri. On November 15, the Uttar Pradesh government decided to withdraw the case against the accused. All 15 accused facing trial in the case are currently out on bail.\n\nOwaisi also mentioned that Akhlaq’s kin has not yet recovered from trauma and remarked that no one has been punished. He wrote in roughly translated Hindi, “In 2015, Akhlaq was lynched in Dadri on the false accusation of possessing beef. At that time, Indians didn’t even know what lynching meant. Today, lynching has become commonplace. Akhlaq’s family witnessed his lynching with their own eyes; they still haven’t recovered from that trauma. In ten years, no one has been punished. Now @myogiadityanath has decided that the cases against Akhlaq’s killers will be withdrawn.”\n\nA mob had gathered outside Akhlaq’s house on September 28, 2015, following an announcement from the village temple that he had allegedly slaughtered a cow. While Akhlaq and his son tried to intervene, they were dragged out of their house and assaulted until they were unconscious. While his son survived after suffering major head injuries, Akhlaq died at a hospital in Noida.\n\nRegarding the withdrawal of the case, Bhag Singh Bhati, Additional District Government Counsel (ADGC), Gautam Buddha Nagar, told The Indian Express earlier, “We filed the withdrawal application, issued by the government in connection with Akhlaq Ahmed’s case, before the competent court on October 15. The court has not yet passed any order on the application and has fixed December 12 for hearing the matter.”\n\nPolice had registered an FIR at Jarcha police station under IPC sections 302 (murder), 307 (attempt to murder),147 (rioting), 148 (rioting with deadly weapon), 149 (unlawful assembly), 323 (assault), 504 (intentional insult to disturb peace), among others. In 2015, the Gautam Buddha Nagar police filed a chargesheet against 15 people, naming Vishal Rana, son of a local BJP leader, and cousin Shivam as the main conspirators who led the mob to Akhlaq’s house and assaulted the family.\n\nStory continues below this ad\n\nThe meat recovered from Akhlaq’s house was also sent to a forensic laboratory in Mathura for examination, which had stated in its report that it belonged to a “cow or its progeny”. Akhlaq’s family, however, had alleged that the samples were switched.",
  "summary": "",
  "published": "Thu, 20 Nov 2025 11:22:03 +0000",
  "url": "https://indianexpress.com/article/india/asaduddin-owaisis-sharp-attack-on-cm-yogi-adityanath-after-up-govt-moves-to-withdraw-akhlaq-lynching-case-10376372/",
  "source": "India | The Indian Express"
}