{
  "title": "‘A tapestry of stone’: the first Ismaili Centre in the US rises in the heart of Texas",
  "text": "On a hot autumn day in southern Texas, monarch butterflies flit around the gardens of Houston’s new Ismaili Centre. Fragile and gaudy, they are on their way south to overwinter in Mexico, travelling up to 3,000 miles in a typical migration cycle, an epic feat of insectile endurance.\n\nTheir combination of delicacy and stamina is an apt metaphor for the Ismaili Centre, a building that has taken seven years to realise and is designed to last for a century or more. It’s a place where Houston’s 40,000-strong Ismaili Muslim community, one of the largest in the US, can practise their faith but it’s also a venue for shared activities.\n\nIts architect is Farshid Moussavi, who elegantly eludes being pinned down to a signature style. Her buildings can be florid, like the John Lewis store in Leicester, wrapped in a gorgeous glass epidermis of ornamental curlicues, or they can be laconic, like the extension to the Zabludowicz Collection in London, contained in a monastically austere box made of long, thin Roman bricks.\n\nEach time she embarks on a project there is a sense of starting anew, rather than relapsing into stylistic cruise control. “Each project is different,” she says, “because it deals with different circumstances and a different set of possibilities”.\n\nMoussavi has built in America before. Cleveland’s Museum of Contemporary Art, completed in 2012, is a glittering cuboid pavilion, a kind of tailored Dark Star sheathed in black stainless steel. The Ismaili Centre could not be more different. Enveloped in what Moussavi describes as a “tapestry of stone”, it is conceived as an ensemble of spaces which subtly abstracts and refines the essence of Islamic architecture.\n\nTraces of Persian tradition are evident in the perforated stone screens and in the eivans, or open-columned verandas, designed to provide shade and shelter in Houston’s sizzling climate. Acting as social spaces and viewing platforms, they invite movement between inside and out, accentuating the building’s permeability. Simple yet expansive moves are augmented by thoughtful details, conjuring a building that feels tranquil and timeless, rather than enslaved to the vagaries of fashion.\n\nAs the seventh Ismaili Centre to be opened in four decades, Houston forms part of a global network that extends from Dushanbe in Tajikistan to Vancouver on Canada’s west coast, reflecting the geographic and cultural plurality of the Ismaili diaspora. Originating in the ninth century as a Shia Muslim sect and now with around 12 million adherents in over 70 countries, Ismailis are guided by a hereditary spiritual leader, or imam.\n\nThe current incumbent is Prince Rahim, Aga Khan V, who succeeded earlier this year on the death of his father, Prince Karim, Aga Khan IV. The latter was an especially active patron of architecture, establishing the triennial Aga Khan awards for architecture in 1977, intended to honour buildings and development projects of exceptional quality across the Muslim world and its wider diaspora.\n\nView image in fullscreen A softly glowing lantern … the Ismaili Centre, Houston, at night. Photograph: Iwan Baan\n\nAs places for spiritual reflection, cultural exchange and public dialogue, each Ismaili Centre is a set-piece project, freighted with the architectural ambitions of its particular era. But while the one in London, designed by genteel modernist Hugh Casson and inaugurated by Margaret Thatcher in 1985, is characterised by a slightly self-conscious appropriation of Islamic motifs, Moussavi’s Houston iteration is a more nuanced distillation of geometric and spatial possibilities set within a luxuriant garden landscape.\n\n“The idea was not to resort to representational mimicry,” explains Moussavi. “If you look at the architecture of the Muslim world, it varies hugely with geography. So our project has been about using architectural instruments, such as geometry and the use of light, order, repetition and structure as ways to create certain kinds of spatial experiences. The aim is not to evoke nostalgia, but to look forward: a renewal rather than a reproduction.”\n\nMost obviously, the geometric device of a triangular grid threads its way through the five-storey building and its gardens. Unifying structure and ornament, the triangular motif also pops up in screens, light fittings, floors and furniture. “I love that this deep sense of order becomes intuitive,” says Moussavi, “and that the idea of playing repeatedly with a triangle generates a kind of experiential serenity and simplicity, as it does in minimalist art.”\n\nThough she is not a member of the Ismaili community, the transmigration of Muslim culture mirrors the arc of Moussavi’s early life, which extends from the Caspian Sea all the way to Dundee, where she initially studied architecture. Brought up in Sari, in northern Iran, her family came to the UK in 1979 following the Iranian Revolution. She founded her current practice, Farshid Moussavi Architecture, in 2011 and currently combines a Harvard professorship with her role as “town architect” of Lewisham, a new pilot scheme developed by London mayor Sadiq Khan aimed at uplifting high streets and improving public spaces.\n\nWithin an hour’s drive of the Gulf of Mexico, Houston may have a reputation for incubating alpha male oil barons and astronauts, but today it’s one of America’s most diverse cities. Occupying around the same area as London, but with a quarter of its population, Houston is a typically strung-out and sprawling North American conurbation. Here, the car is king.\n\nFrom this perspective, the Ismaili Centre appears as a super-crisp volume of stone and glass, with overhanging roofs, like giant hat brims, shading the eivans. But after dark, the opacity of the stone dissolves into a pixelated mass as light percolates through it, transforming the building into a softly glowing lantern.\n\nThe stone carapace is a non-structural screen made from small square pieces threaded together by steel tension rods. “It’s as if you’re weaving a carpet on a loom,” explains Moussavi, “so it’s something quite light and delicate despite it being in stone.” Certain pieces have triangular or scallop-shaped cut-outs, so the “weave” of the stone screen changes according to the function of the spaces it encloses.\n\nIn the main event hall, scallop-shaped cut-outs at seated height gradually transition to triangular ones, allowing views out, but also admitting sunlight. “The shadows are really amazing,” says Moussavi. “It suddenly becomes a room full of patterns.”\n\nView image in fullscreen Boundless in spirit … the prayer hall (jamatkhana). Photograph: Iwan Baan\n\nPerforated screens also enclose the main atrium, whirling around a central void, as your eye is drawn ever upwards to a square oculus framing a chunk of sky. Public functions, such as a cafe, black box theatre, exhibition gallery and event hall are arrayed around this core space, with private offices and meeting rooms set on the topmost floors.\n\nThroughout, various shades of blue predominate, from teal to sky and duck egg, a colour that holds special significance in Persian architecture. Here, however, the blue connects the building with the heavenly Texan sky, as well as the legacy of Islamic architecture. The blue soffits of the external eivans extend inward, bringing the sky closer and reinforcing a sense of openness.\n\nAt the heart of the building is the jamatkhana, or Ismaili prayer hall, a voluminous column-free space capable of accommodating 1,500 people. Its ceiling comprises two layers of gauzy aluminium lit from behind, so it shimmers lightly, almost dematerialising, while a patterned ivory carpet, a colour uniquely associated with the Persian city of Nain, covers the floor.\n\n“We thought the prayer hall should be somehow boundless in spirit rather than weighing on you,” says Moussavi. The intricate ceiling pattern recalls traditional Islamic jali screens generating a soft, seemingly infinite effect. Walls lined with American cherry wood are embellished with precisely pointillist Kufic script and instead of an ornately decorated mihrab, the direction of worship is indicated by a vertical band of light radiating from an illuminated niche.\n\nLandscape is integral to the project, as an optimistic expression of cultural continuity, but also as a work of resilient environmental engineering to mitigate the impact of heat and flooding. The topography of the long, sloping site echoes ancient Persian gardens stepping down to a river. Landscape architect Thomas Woltz undertook a year-long study across historic sites in Spain, Egypt, and India to explore the spatial, sensory and cultural aspects of Islamic gardens.\n\nWoltz’s planting strategy is designed as a “transect of Texas”, using exclusively native species, beginning with desert cacti and moving through the prairie to the Gulf Coast, mirroring the adaptability of the Ismaili community in new homelands. Conceived not as a static garden but as an evolving ecosystem, the site will bloom and mature over time. The migrating monarch butterflies will doubtless become regulars.\n\nOne especially resonant aspect of the project is how deeply it is rooted within the Ismaili community. Many locals assisted in the centre’s construction or donated materials in kind. Now open to the public, the building will be largely staffed by volunteers. “It really is a community project in every sense of the word,” says Moussavi. “We’ve provided the community with the hardware – the building itself – and now, I’m sure, the software, the people and activities, will bring it to life.”",
  "summary": "<p>Architect Farshid Moussavi is behind a tranquil and timeless new building where Houston’s 40,000-strong Ismaili Muslim community can come together. But how has she created something that looks so delicate out of stone?</p><p>On a hot autumn day in southern Texas, monarch butterflies flit around the gardens of Houston’s new Ismaili Centre. Fragile and gaudy, they are on their way south to overwinter in Mexico, travelling up to 3,000 miles in a typical migration cycle, an epic feat of insectile endurance.</p><p>Their combination of delicacy and stamina is an apt metaphor for the Ismaili Centre, a building that has taken seven years to realise and is designed to last for a century or more. It’s a place where Houston’s 40,000-strong Ismaili Muslim community, one of the largest in the US, can practise their faith but it’s also a venue for shared activities.</p> <a href=\"https://www.theguardian.com/artanddesign/2025/nov/20/first-ismaili-centre-in-the-us-farshid-moussavi-houston-muslim-community\">Continue reading...</a>",
  "published": "Thu, 20 Nov 2025 11:46:33 GMT",
  "url": "https://www.theguardian.com/artanddesign/2025/nov/20/first-ismaili-centre-in-the-us-farshid-moussavi-houston-muslim-community",
  "source": "The Guardian"
}