{
  "title": "Judge orders an end to Trump's troop deployment in D.C., calling it 'unlawful'",
  "text": "Judge orders an end to Trump's troop deployment in D.C., calling it 'unlawful'\n\ntoggle caption Al Drago/Bloomberg via Getty Images\n\nA federal judge on Thursday ordered an end to the monthslong National Guard deployment in Washington, D.C. to tackle crime, declaring that the use of troops was \"unlawful.\"\n\nIt's the latest legal resistance against President Trump's troop deployments in American cities as a means to suppress protests, combat crime or safeguard federal buildings and personnel, including ICE agents.\n\nIt comes just days after a Tennessee state judge issued a temporary block on the mobilization of Guard forces in Memphis, which was activated by the Tennessee governor at Trump's behest. Over the weekend, the Defense Department ordered hundreds of troops to leave Chicago and Portland, Ore. as federal courts kept those deployments at a stalemate.\n\nSponsor Message\n\nOn Thursday, U.S. District Judge Jia Cobb, who was appointed by former President Joe Biden, sided with District of Columbia Attorney General Brian Schwalb who had argued that the president undermined the city's autonomy, threatened public safety by stirring tensions between local residents and law enforcement and hurt the city's economy.\n\n\"The Court finds that the District's exercise of sovereign powers within its jurisdiction is irreparably harmed by Defendants' actions in deploying the Guards,\" she wrote.\n\nCobb put a pause on her order until Dec. 11 to allow the Trump administration time to appeal.\n\nIn a statement, White House spokesperson Abigail Jackson asserted that Trump was well within his authority to send the Guard to D.C.\n\n\"This lawsuit is nothing more than another attempt — at the detriment of DC residents — to undermine the President's highly successful operations to stop violent crime in DC,\" Jackson added.\n\nTrump sent hundreds of troops to D.C. without the mayor's consent in early August after declaring a \"crime emergency\" in the city. That claim has been repeatedly refuted by local Democratic leaders. Since then, Guard personnel have been largely tasked with patrols and beautification efforts like clearing trash, spreading mulch and pruning trees.\n\nAs of Wednesday, the deployment in the nation's capital includes over 2,100 Guard forces from D.C. and several states, including Louisiana, Mississippi, Ohio, South Carolina, West Virginia, Georgia and Alabama, according to the U.S. Army.",
  "summary": "U.S. District Judge Jia Cobb put a pause on her order until Dec. 11 to allow the Trump administration time to appeal.",
  "published": "Thu, 20 Nov 2025 17:12:46 -0500",
  "url": "https://www.npr.org/2025/11/20/nx-s1-5615399/dc-troops-deployment-blocked-trump",
  "source": "NPR Topics: News"
}