{
  "title": "Mexico Rejects Trump's Offer Of Military Strikes Against Cartels — Again",
  "text": "LOADING ERROR LOADING\n\nMEXICO CITY (AP) — Mexico’s president on Tuesday ruled out allowing U.S. strikes against cartels on Mexican soil, a day after U.S. President Donald Trump said he was willing to do whatever it takes to stop drugs entering the U.S.\n\n“It’s not going to happen,” Mexico’s President Claudia Sheinbaum said Tuesday.\n\n“He (Trump) has suggested it on various occasions or he has said, ‘we offer you a United States military intervention in Mexico, whatever you need to fight the criminal groups,’” she said. “But I have told him on every occasion that we can collaborate, that they can help us with information they have, but that we operate in our territory, that we do not accept any intervention by a foreign government.”\n\nAdvertisement\n\nSheinbaum said she had said it to Trump and to U.S. Secretary of State Marco Rubio and that they have understood.\n\n“Would I want strikes in Mexico to stop drugs? OK with me, whatever we have to do to stop drugs,” Trump said Monday, adding that he’s “not happy with Mexico.”\n\nMexican President Claudia Sheinbaum giveS a joint news conference with France's President Emmanuel Macron at the National Palace in Mexico City, Friday, Nov. 7, 2025. (AP Photo/Marco Ugarte) via Associated Press\n\nAdvertisement\n\nThe U.S. Embassy in Mexico shared a video through social platform X later Monday that included previous comments from Rubio saying that the U.S. would not take unilateral action in Mexico.\n\nMeanwhile, Mexican and U.S. diplomats were trying to sort out Tuesday what may have been an actual U.S. incursion.\n\nOn Monday, men arrived in a boat to a beach in northeast Mexico and installed some signs signaling land that the U.S. Department of Defense considered restricted.\n\nAdvertisement\n\nMexico’s Foreign Affairs Ministry said late Monday that the country’s Navy had removed the signs, which appeared to be on Mexican territory. And on Tuesday, Sheinbaum said that the International Boundary and Water Commission, a binational agency that determines the border between the two countries, was getting involved.\n\nThe signs, driven into the sand near where the Rio Grande empties into the Gulf of Mexico, caused a stir when witnesses said men in a boat arrived at the local beach known as Playa Bagdad and erected them.\n\nThe signs read in English and Spanish “Warning: Restricted Area” and went on to explain that it was Department of Defense property and had been declared restricted by “the commander.” It said there could be no unauthorized access, photography or drawings of the area.\n\nAdvertisement\n\nThe U.S. Embassy in Mexico and the Pentagon did not immediately respond to requests for comment.\n\nMexico contacted its consulate in Brownsville, Texas and then the U.S. embassy in Mexico City. Eventually, it was determined that contractors working for some U.S. government entity had placed the signs, Sheinbaum said.\n\n“But the river changes its course, it breaks loose and according to the treaty you have to clearly demarcate the national border,” Sheinbaum said during her daily press briefing.\n\nThe area is close to SpaceX Starbase, which sits adjacent to Boca Chica Beach on the Texas side of the Rio Grande.\n\nAdvertisement\n\nThe facility and launch site for the SpaceX rocket program is under contract with the Department of Defense and NASA, which hopes to send astronauts back to the moon and someday to Mars.\n\nIn June, Sheinbaum said the government was looking into contamination from the SpaceX facility after pieces of metal, plastic and rocket pieces were reportedly found on the Mexican side of the border following the explosion of a rocket during a test.\n\nThe area also carries the added sensitivity of Trump’s order to rename the Gulf of Mexico as the Gulf of America, which Mexico has also rejected.",
  "summary": "“It’s not going to happen,” Mexico's President Claudia Sheinbaum said Tuesday.",
  "published": "Tue, 18 Nov 2025 14:49:36 -0500",
  "url": "https://www.huffpost.com/entry/mexico-rejects-trumps-offer-military-strikes-against-cartels-again_n_691ccc93e4b0414d84d7c976",
  "source": "World News"
}