{
  "title": "Wolff sells £230m stake valuing Mercedes F1 at £4.6bn",
  "text": "Toto Wolff has sold 15% of his shareholding in the Mercedes Formula 1 team to American billionaire George Kurtz.\n\nKurtz, 55, is the founder of the cybersecurity firm Crowdstrike, which is a sponsor of Mercedes.\n\nThe deal values Mercedes F1 at $6bn (£4.6bn), a record for an F1 team. McLaren were valued at £3.5bn in a change of ownership structure in September.\n\nWolff's holding company owns one-third of Mercedes F1, so the shareholding he is selling equates to 5% of the team.\n\nWolff, who will net $300m (£230m) from the deal, will stay on as team principal and chief executive officer, while the governance of Mercedes F1 continues unchanged.\n\nKurtz, whose stake is coming out of his personal funds rather than his company's, said the valuation put on the team was \"in line with the market\", adding that \"if you look at sports [valuations] across the globe, they are all up\".\n\nKurtz said: \"Formula 1 is really at an inflection point where it is a thriving business.\n\n\"If you're making an investment like this, you believe that the sport is going to grow, F1 is going to grow and the team valuations are going to grow, and you're going to be able to contribute to that growth.\"\n\nKurtz will not be on the main board but will join the team's strategic steering committee, on which Ola Kallenius, the chairman of the management board of the Mercedes Group, Ineos chairman Sir Jim Ratcliffe and Wolff meet to discuss issues to do with the team.\n\nKurtz described his role as \"nothing more than a seat at the table to provide input and discussions\".\n\nWolff said: \"George's background is unusual in its breadth: he's a racer, a loyal sporting ambassador for Mercedes-AMG, and an exceptional entrepreneur.\n\n\"He understands both the demands of racing and the realities of building and scaling technology businesses. That combination brings specific insight that is increasingly relevant to the future of Formula 1.\"\n\nThe deal represents a more than seven-fold increase in the value of Mercedes F1 since Ineos bought its one-third stake for £208m in 2020.\n\nThe rise reflects the growth in valuations of F1 teams in the past few years as a consequence of the increasing appeal of the sport around the world.\n\nThis was also seen in the success of the F1 movie starring Brad Pitt, which was released last summer and has grossed more than $630m (£482m) at the box office. It is Pitt's most successful film and the most successful sports movie of all time.\n\nMercedes are second in the constructors' championship with three races remaining this season, starting with this weekend's Las Vegas Grand Prix.\n\nTheir lead driver George Russell has won two of the 21 grands prix this year and is fourth in the drivers' championship behind McLaren's Lando Norris and Oscar Piastri and Red Bull's Max Verstappen.",
  "summary": "Toto Wolff sells 15% of his shareholding in the Mercedes Formula 1 team to American billionaire George Kurtz, a deal which values the team at £4.6bn.",
  "published": "Thu, 20 Nov 2025 20:30:04 GMT",
  "url": "https://www.bbc.com/sport/formula1/articles/cwynyd1d062o?at_medium=RSS&at_campaign=rss",
  "source": "BBC Sport"
}