{
  "title": "The 15 Best Soundbars We’ve Tested in 2025: Sonos, Sony, Bose",
  "text": "Honorable Mentions\n\nPhotograph: Parker Hall\n\nThere are a lot of great soundbars, and we don’t have room to feature them all. Here are some others you might want to consider.\n\nMarshall Heston 120 for $1,300: Marshall's first soundbar surprised me in multiple ways. Its design is as luxe as anything on the market, with stylish gold control knobs and strips of vinyl that embody the Marshall Amplifier aesthetic. Its sound is well balanced and detailed, and it offers intriguing features like Dolby Atmos Music support. It's an impressive package, but a bizarre lack of dynamic punch in major action scenes and effects keeps me from putting it at the top of our list. It seems Marshall is holding something back with digital compression, keeping the bar from fully rocking the room. It's still an impressive system, but at $1,300, it's a tough ask.\n\nYamaha True X Surround 90a for $3,500: After a yearslong hiatus from the premium market, Yamaha is back with the flagship True X Surround 90A, a $3,500 Dolby Atmos soundbar system. It includes a wireless subwoofer and two fully wireless, portable surround speakers that double as stand-alone Bluetooth speakers, which is a nifty party trick. As you'd assume for the price, it delivers exceptional, detailed sound with superb surround channel clarity. It's also the first soundbar with Auro-3D processing. However, the setup is complex, it lacks enough HDMI ports and room correction, and its center-channel dialog clarity is disappointing out of the box. While its impressive precision will enthrall some, these omissions make it hard for us to recommend it over flagship models from Samsung and others.\n\nSamsung HW-Q990F for $1,700: Samsung's latest iteration of its fantastic, 11.1.4-channel Dolby Atmos hulk, the Q990F offers modest upgrades over previous models, including a new cube of a subwoofer for slightly cleaner, more musical bass. That and HDMI 2.1 support for connecting game consoles directly are the only real reasons to upgrade, which means we'll keep the similarly fantastic Q990C (at around half the price) until pricing comes down.\n\nLG S95AR for $1,200-$1,700: LG's latest 9.1.5-channel system offers minor upgrades over its predecessor, the ST95R, leaving few reasons to upgrade at full price. It remains among the top performers in its class, offering impressive clarity, swift and fluid immersion, and snappy setup and control with LG's continually improving ThinQ app. It's a solid value compared to competing multi-piece Dolby Atmos systems at full price, and it will get increasingly tempting as the price drops.\n\nSony Bravia Theater 9 for $1,200-$1,500: Sony’s follow-up to the powerful HT-A7000 flagship soundbar regresses in some key ways. There are fewer inputs (no more analog), a more mundane fabric-wrapped design, and minimal sound settings. The Theater 9's leaner frame equates to a less meaty and immersive soundstage, but this is still a Sony flagship soundbar, which means great musicality, superb detail, and advanced spatial imaging for 3D audio. Premium features like an HDMI 2.1 input for connecting modern game consoles and advanced integration with newer Sony TVs sweeten the deal, but at $1,400 (sometimes $1,500 in a post-tariffs world), it’s a pricey proposition.\n\nSonos Beam Gen 2 for $500: Sonos' stout little middle child is still among the most expressive and feature-packed options in its class, offering great musicality and impressive Dolby Atmos virtualization, along with all the networking options for which Sonos is prized. It's a bit on the pricey side at this point in its tenure, but if you can find it on sale, it's very much worth considering, especially now that Sonos has mostly solved its earlier app issues.\n\nVizio 2.1 Soundbar (SV210M) for $170: Vizio’s curvy little combo brings enticing value, with solid sound quality and some cinematic punch from the teensiest subwoofer you’ll ever see. There’s no optical input or remote included, but the Vizio app makes adjusting settings or swapping to Bluetooth simple enough. The main drawback is that dialog sometimes (but not always) gets lost, reducing the main draw of a cheap soundbar. That said, good musical chops and features like DTS Virtual X expansion make it worth considering on sale.\n\nSamsung HW-Q800C for $600-700: If Samsung's HW-Q990 everything bar is too rich for your blood, the two-piece HW-Q800C could be a good compromise. This bar offers a similar sound signature as Samsung's flagship bars and many of the same features, packed into a smaller bar-and-subwoofer combo for a notable discount–especially since it's now almost always on sale.\n\nSennheiser Ambeo Mini for $600-$800: This pint-sized luxury bar is great for those with money to burn in very small spaces. Sennheiser's built-in Ambeo virtualization technology brilliantly throws sound all around you for exhilarating TV shows and movies, and offers advanced features like support for Google Assistant and Alexa.\n\nThe Polk React for $134: This soundbar works if you want to get surround sound eventually but don’t have the cash right now. The Alexa-enabled soundbar is fine on its own, with surround speakers and subwoofers available from Polk if you want to upgrade.\n\nHow to Connect Your Soundbar AccordionItemContainerButton LargeChevron We’ve included a list of available connectivity options next to every soundbar on our list. Most soundbars will connect to your TV via optical or HDMI cables, though the optical input is starting to go away for newer models, including even pricey flagship options. In most cases, HMDI is the preferable connection anyway. If your TV and soundbar both have an HDMI ARC/eARC port (the cable port looks like regular HDMI, but it’s labeled ARC or eARC), connect it that way. It will allow you to use the volume buttons on your TV remote to control the soundbar’s volume. Also, make sure CEC is enabled. Use an optical cable only if HDMI isn’t available, as HDMI is also necessary for Dolby Atmos and other 3D audio formats. Finally, check your TV audio menus to make sure your TV’s internal speakers are set to off (so you don’t get any weird audio fluttering) and find the best spots to place your speakers and sub. Why You Need a Soundbar AccordionItemContainerButton LargeChevron We have yet to test a new TV that didn’t sound better with an audio accessory. That’s mostly due to the way televisions are designed. Great-sounding speakers are bulky, and as TVs have gotten thinner with shrinking bezels and sleeker designs, manufacturers have had a harder time building good speakers into them. You can spend as little as $100 to $150 on a new soundbar, and it’s essential to getting the most out of your TV experience. Our list of the top soundbars we’ve tested includes soundbars sold on their own and models that come bundled with a subwoofer and surround speakers at a wide variety of price points. Are Soundbars as Good as Speakers? AccordionItemContainerButton LargeChevron Stumble onto any A/V or home theater subreddit or forum and you’ll see a mob of people claiming even the idea of a soundbar matching up to a pair of speakers is heresy. The truth, as far as we’re concerned, is that it all depends on your individual wants and needs. If you’re looking for the most musical bang for your buck, especially when it comes to hi-res audio and vinyl record collections, a great pair of bookshelf speakers is likely your best value option. Even if you’re not keen on shopping for an amp and running speaker wires, our best bookshelf speakers guide offers plenty of powered/active pairs that include all the inputs and amplification built-in, like a soundbar system for audiophiles. That may not be the best option for everybody, though. If you’re just after something cheap and simple to soup up your TV sound, or conversely, a convenient way to explore exciting audio formats like surround sound and Dolby Atmos, a soundbar could be the perfect choice. Soundbars are affordable and hassle-free solutions, many of which offer sound and features that may match your needs better than a pair of speakers or a traditional home theater setup. We take no sides here, we just love good sound and great features. For many, a soundbar is the best way to get there. Do You Need a Subwoofer? AccordionItemContainerButton LargeChevron This is a question only you can answer, but there are a few points to consider before making a call, starting with your living space. If you live in a smaller apartment or multiplex, a subwoofer may not be the best choice due to both its size and its likelihood of arousing noise complaints. Larger modern soundbars have gotten increasingly good at reproducing convincing bass from a single bar, often utilizing multiple speakers in concert to bring more punch to lower frequencies without causing lots of boom and bombast. If you're less concerned about close quarters and looking for more cinematic punch, you should highly consider a soundbar with a subwoofer. Physics can only be stretched so far, and no multi-speaker system we’ve heard can match the punch and potency of a dedicated large driver and acoustic cabinet. Even many affordable soundbar models include a subwoofer. If you want full-throttle sound, we suggest considering going all in for a subwoofer, or at the very least a bar that allows you to add one later.\n\nPower up with unlimited access to WIRED. Get best-in-class reporting and exclusive subscriber content that's too important to ignore. Subscribe Today.",
  "summary": "Every television deserves a row of speakers to call its own. These are our favorite soundbars.",
  "published": "Wed, 19 Nov 2025 14:00:00 +0000",
  "url": "https://www.wired.com/gallery/best-soundbars/",
  "source": "WIRED"
}