{
  "title": "Thrashed in train for ‘not speaking in Marathi’, Maharashtra college student kills self",
  "text": "Image Credit: X\n\nMarathi row left Arnav in deep distress: Father\n\nMUMBAI: A 19-year-old first-year BSc student from Kalyan died by suicide Tuesday after he was harassed and assaulted in a local train by fellow commuters for speaking in Hindi and not Marathi, alleged his father.Arnav Khaire, a student of Kelkar College in Mulund, was travelling in a second-class compartment as his first-class season pass had expired.His father, Jitendra Khaire, has submitted a written complaint to Kolsewadi police in Kalyan (E), demanding action against those who allegedly harassed his son and “pushed him” to take the extreme stepBased on his complaint, police have started investigations. The incident took place Tuesday, when Arnav, as was his routine, was travelling by an Ambernath-Kalyan local to attend classes.In Jitendra Khaire’s complaint — based on his phone conversation with his son Arnav — he said, “On Tuesday, since Arnav’s first-class pass for the suburban train had expired, he purchased a general-class ticket and boarded a crowded general compartment at Kalyan railway station to go to college.”Due to the crowd, he accidentally brushed against a man and said in Hindi, ‘Please move ahead a little.’ The complainant alleged that some men nearby took objection to Arnav speaking in Hindi.“They asked why he wasn’t speaking Marathi, and whether he was ashamed of his own language.” Arnav told his father, ‘I told them I am Marathi, but they still argued and beat me.”Arnav also told his father the attackers tore his mask & that he was extremely scared and shaken by the incident. After the assault, he got off at Thane station, took another train, and reached Mulund.His father said the boy was in deep psychological distress after the incident. At college, after completing a practical exam, Arnav called his father saying, “Papa, I am not feeling well…” In the afternoon, after reaching home, he called his father again and informed him about the entire incident.Khaire told him he would file a police complaint. However, on Tuesday evening, when he reached home, the door was locked. With the help of his neighbours, he forced the door open and found his son had died by suicide. An ambulance was called immediately, but doctors at Rukminibai Hospital declared Arnav dead at 9.05pm.Khaire told TOI “The fear and mental stress caused by this incident pushed him towards suicide. I want a full investigation and justice for my son.”Kalyanji Ghete, assistant commissioner of police, Kalyan Division said, “We have formed a team who is probing the case”.",
  "summary": "A 19-year-old BSc student died by suicide after allegedly being harassed and assaulted on a local train for speaking Hindi. His father claims the incident, where commuters objected to his son's language, caused him extreme distress. Police have launched an investigation into the matter.",
  "published": "Fri, 21 Nov 2025 06:56:58 +0530",
  "url": "https://timesofindia.indiatimes.com/city/mumbai/papa-i-am-not-feeling-well-thrashed-in-train-for-not-speaking-in-marathi-19-year-old-bsc-student-kills-self-near-mumbai/articleshow/125475034.cms",
  "source": "Times of India"
}