{
  "title": "Transfer rumors, news: Man United eye Ajax young talent Mokio",
  "text": "Mark Ogden explains why there's optimism around Manchester United's transfer strategy after turning down the chance to sign Chelsea's Roméo Lavia. (1:12)\n\nOpen Extended Reactions\n\nManchester United are keeping tabs on 17-year-old Ajax star Jorthy Mokio, alongside Newcastle United and Eintracht Frankfurt while Rennes duo Jérémy Jacquet and Mohamed Meïté are on the radar of the Red Devils. Join us for the latest transfer news and rumors from around the globe.\n\nTransfers home page | Men's grades | Women's grades\n\nTOP STORIES\n\n- Messi 'first phone call' to make for Barcelona presidential candidate\n\n- Sources: Man United rejected Chelsea's Lavia, Nkunku in Garnacho deal\n\n- Real Madrid striker Mbappé ups PSG compensation claim to $300m\n\nAjax's Jorthy Mokio is highly regarded as one of the best young talents from the Eredivisie. (Photo by Stefan Koop/EYE4images/NurPhoto via Getty Images)\n\nTRENDING RUMORS\n\n- Highly rated Ajax star Jorthy Mokio is on the radar of Man United, Newcastle United, and Eintracht Frankfurt, according to Sacha Tavolieri of Sky Sports Switzerland. Mokio, 17, is under contract until 2027 but talks have stalled over new terms and he is reportedly looking to take the next step in his career. The defensive midfielder, who made his senior Belgium debut in March, can also play as a center back and left back, which makes him a valuable option to have.\n\n- Man United are also keeping tabs on Rennes duo Jérémy Jacquet and Mohamed Meite, according to The Sun. The report claims that a scout was spotted at Rennes' 1-0 win at Paris FC on Nov. 7 and revealed they were there to watch defender Jacquet, 20, who has played every minute so far this season, and 18-year-old striker Meita, who is considered more of a youth prospect. Arsenal and Crystal Palace were strongly linked with a move for Jacquet last summer, before he extended his contract with until 2029.\n\n- Al Ahli striker Ivan Toney is considering taking a 50% salary cut in order to move back to the Premier League to aid his chances of playing for England at the World Cup, according to TEAMtalk. Toney, 29, has scored 11 goals in 15 games this season, and 41 goals in 59 appearances in total since his £40 million move to Saudi Arabia from Brentford in 2024, but believes he needs to return to a higher level to give him any chance of making Thomas Tuchel's squad next summer. Tottenham Hotspur remain favorites to sign him, but face competition from Everton.\n\n- Crystal Palace believe Liverpool are the only club interested in signing center back Marc Guéhi in the January transfer window, according to Sky Sports. Guehi's contract runs until the end of the season and he's free to sign a pre-contract agreement with any club outside England from Jan. 1. Bayern Munich, Real Madrid and Barcelona are all reported to be keen, but Liverpool are expected to make the first move when the window opens as they have lost Giovanni Leoni to a long-term injury and there is uncertainty around Ibrahima Konaté's future.\n\n- Fiorentina's primary target for January is Chelsea's 19-year-old defender Josh Acheampong, according to Tuttomercatoweb. Acheampong has had chances in the first team but is reported to be open to a move away and the Serie A team are considering a loan with an option to sign him permanently. If they can't pull that off then Chelsea center back Axel Disasi, 27, is another target as he has been frozen out of the first-team squad.\n\nEXPERT TAKE\n\nESPN's resident scout Tor-Kristian Karlsen looks at Rennes' two young stars.\n\nIn only his first full year of his top-flight career, Jacquet has emerged as one of the most promising young center backs in France. What makes him stand out at this early stage is how complete he already looks. His standout traits are his game-reading and calmness; he is composed on the ball -- seven progressive passes per 90 minutes this season -- and measured when defending. He rarely overcommits, preferring to wait out the attacker and win the ball cleanly, either through an interception or controlled sliding challenge ... which has become a signature feature of his game. Jacquet moves fluidly, hits top speed quickly and consistently looks like he has an extra gear even when up against the speediest opponents. While at 6-foot-2 he isn't that imposing, he compensates with an impressive vertical leap and his 74% aerial win rate is the best in Ligue 1 among center backs with more than 1,000 league minutes this season. Then, at the other end of the pitch, Meïte is in the process of establishing himself as a No. 9 prospect. At 6-foot-4, the 18-year-old offers the classic physical profile of a target man and has won 75% of his duels off the ground this season, but he also has more mobility and finesse -- flicks, good touch, clever lay-offs -- than his size may suggest. Last season he was brought up from the reserves and produced two goals in 12 league games. This season he has continued to earn the trust of his manager, registering just short of 600 senior minutes and adding a small-but-steady stream of goal contributions while generating 13 shots (he's a high-volume shooter at 3.4 shots per 90) on target. The France U21 international's defining feature is arguably his penalty-box presence. He attacks crosses with confidence, uses his body intelligently to fend off opponents, and is able to find space to run on either side of the center backs. The fact he has already started high-profile games ahead of more established forwards reflects how highly Rennes rate him.\n\nOTHER RUMORS\n\nplay 1:54 Will Gabriel's injury impact the Premier League title race? Don Hutchison has his say on the Premier League title race, after the news of a thigh injury for Arsenal defender Gabriel.\n\n- Paris Saint-Germain are hoping to beat Manchester United, Arsenal and Real Madrid to the signing of Lille's 18-year-old midfielder Ayyoub Bouaddi for a fee of around €45 million. (Ekrem Konur)\n\n- VfB Stuttgart defensive midfielder Angelo Stiller would prefer to join Real Madrid over Manchester United. (Defensa Central)\n\n- Arsenal midfielder Ethan Nwaneri could leave on loan in January in an effort to get more games under his belt. (Daily Mail)\n\n- Barcelona goalkeeper Marc-Andre ter Stegen, 33, could move to Besiktas on loan in January, with a permanent option. (Sport)\n\nAll of ESPN. All in one place. Watch your favorite events in the newly enhanced ESPN App. Learn more about what plan is right for you. Sign Up Now\n\n- Bayern Munich and Barcelona are exploring the possibility of signing left back Alejandro Grimaldo from Bayer Leverkusen. The 30-year-old prefers a return to Spain, which suits Leverkusen, who would much rather he left for LaLiga than join their Bundesliga rivals. (Marca)\n\n- Chelsea goalkeeper Filip Jorgensen could leave the Blues in January after just 18 months at the club as he seeks more game time. (TalkSPORT)\n\n- Inter Milan are battling with Napoli over the signing of Genoa's 24-year-old midfielder Morten Frendrup, who they see as a more realistic target than Roma's Manu Kone. (Gazzetta dello Sport)\n\n- AC Milan are on the lookout for a defender in January, and top of their list -- should they fail to land 41-year-old Thiago Silva from Fluminense -- is Udinese center back Thomas Kristensen. The 23-year-old could be available for a fee of €20 million. (Gazzetta dello Sport)\n\n- Juventus have made contact with Lecce over young Portuguese defender Tiago Gabriel. The Bianconeri could offer a loan player in order to fend off competition from Brentford, who are reported to be lining up a €20 million bid. (Tuttosport)\n\n- Elche midfielder Rodrigo Mendoza is attracting interest from all over Europe, with Arsenal, Real Madrid, Valencia and Como all interested in the Spain U20 star. (Informacion)\n\n- Real Betis, Dinamo Zagreb, Mainz and Bologna are all monitoring the situation of Girona goalkeeper Dominik Livakovic, who is in search of more minutes to ensure he stays as Croatia No.1 ahead of the 2026 World Cup. (Ekrem Konur)\n\n- Spanish goalkeeper and free agent Vicente Guaita is closing in on a one-year deal with Parma, who are desperate for cover following an injury to regular No. 1 Zion Suzuki. (Fabrizio Romano)\n\n- Roma are considering a move for Tottenham Hotspur forward Mathys Tel who is reported to be unhappy in London following his move from Bayern Munich. The Giallorossi are also tracking Marseille midfielder Pierre-Emile Hojbjerg. (Gazzetta dello Sport)",
  "summary": "Manchester United are keeping tabs on rising young talent Jorthy Mokio from Ajax. Transfer Talk has the latest news and rumors.",
  "published": "Thu, 20 Nov 2025 22:57:34 EST",
  "url": "https://www.espn.com/soccer/story/_/id/47033078/transfer-rumors-news-man-united-eye-highly-rated-rennes-duo-jeremy-jacquet-mohamed-meite",
  "source": "www.espn.com - TOP"
}