{
  "title": "At least 41 dead as relentless rains flood Vietnam",
  "text": "At least 41 dead as relentless rains flood Vietnam\n\n4 hours ago Share Save Kelly Ng Share Save\n\nWatch: Rescuers wade through deadly floodwaters in Vietnam\n\nRelentless rains and floods have killed at least 41 people in central Vietnam since the weekend, while a search continues for nine still missing, state media reported. The deluge has submerged more than 52,000 homes and left half a million households and businesses without power, according to reports. Rainfall exceeded 1.5m (5ft) in several areas over the past three days, even rising beyond the 1993 flood peak of 5.2m in some parts. The worst-hit areas include the coastal cities of Hoi An and Nha Trang, as well as a key coffee production belt in the central highlands - where farmers are already reeling from a stalled harvest because of earlier storms.\n\nGetty Images The coastal cities of Hoi An and Nha Trang are among the worst-hit by the recent rains and flooding\n\nExtreme weather has battered Vietnam in recent months. Two typhoons, Kalmaegi and Bualoi, left a trail of deaths and destruction within weeks of each other. Natural disasters in Vietnam have wreaked damage amounting to $2bn between January to October this year, according to government estimates. Photographs published by local media show people stranded on roofs as floodwaters creep into their homes, while a video circulating online shows a suspension bridge in Lam Dong province getting torn off its anchors. The province has declared a state of emergency after landslides damaged major roads and highways. Traffic was completely halted after part of the Mimosa Pass, a key entry route into the popular tourist city of Da Lat, collapsed into a ravine, while a bus narrowly avoided falling into the gap, AFP news agency reported.\n\nGetty Images The deluge has submerged more than 52,000 homes and left half a million households and businesses without power\n\nTens of thousands of residents have been evacuated across the flood-affected regions. Military toops and police officers have been deployed to set up emergency shelters to relocate people to safety. A restaurant owner in Nha Trang told AFP his shops were submerged by about a metre of water. \"I am worried about our furniture in my restaurants and shops, but of course I cannot do anything now,\" said the restaurant owner, Bui Quoc Vinh. \"I don't think the water is going to recede soon, as the rain has not stopped.\" Authorities have warned of moderate to heavy downpours in central Vietnam through Sunday at least.",
  "summary": "The coastal cities of Hoi An and Nha Trang, and a key coffee-producing belt, are among the worst-hit.",
  "published": "Fri, 21 Nov 2025 01:50:48 GMT",
  "url": "https://www.bbc.com/news/articles/ceq0q3e2j17o?at_medium=RSS&at_campaign=rss",
  "source": "BBC News"
}