{
  "title": "Tamil Nadu CM Stalin accuses Centre of ‘revenge politics’: What we know about Madurai, Coimbatore Metro proposals",
  "text": "Ahead of Prime Minister Narendra Modi’s visit to Tamil Nadu, Chief Minister MK Stalin Wednesday accused the Central government of denying Metro rail services to Madurai and Coimbatore on “flimsy grounds”.\n\nTerming it a “revenge” against the Tamil Nadu’s democratic choice to elect an Opposition-party government, he said, “Pushing such a political custom, in which BJP ruled states get Metros for smaller Tier II cities while opposition ruled States are deprived, is a disgraceful approach. Tamil Nadu, the land of self respect, will never accept such a distortion of federal principles.”\n\n“The Union BJP government has denied Metro Rail for ‘Temple City’ Madurai and for ‘South India’s Manchester’, Coimbatore, on flimsy grounds,” Stalin wrote on X, adding, “They attempted to stall the Chennai Metro, and we overcame those malicious attempts and kept the project progressing. With the same determination, we will secure the Metro Rail that Madurai and Coimbatore need for their future growth.”\n\nFor Coimbatore, the Tamil Nadu government had submitted an ambitious proposal in phases, including two major corridors—Avinashi Road and Sathyamangalam Road—stretching 44 km at an estimated cost of Rs 9,424 crore. Early works were targeted for 2025, pending central approval.\n\nFor Madurai, planners conceived a 32 km corridor from Thirumangalam to Othakadai, with 27 stations, three of them underground. The project’s estimated cost is Rs 11,366 crore, with feasibility studies conducted between 2022 and 2024.\n\nBoth projects have been pursued aggressively for over a decade, with city planners, industrial associations, and elected representatives arguing that the rapidly growing industrial region of Coimbatore and the historic, densely populated Madurai require major capacity upgrades in public transportation.\n\nWhy the Centre blocked Metro projects\n\nEarliert this month, the Union government rejected the detailed reports on Metro Rail project, arguing that the cities lack the mandated 2-million population according to the 2011 census while The Metro Rail Policy, 2017, mentions that the population of a city is required to house a population of at least 2 million to plan a Metro Rail project.\n\nAccording to the last Census in 2011, Coimbatore’s population stood at 15.84 lakh, while Madurai’s was below 15 lakh, both falling short of the mandated criterion.\n\nStory continues below this ad\n\nTamil Nadu’s counter\n\nHowever, the state government argues that the figures are outdated and do not reflect the rapid growth of the past decade. The state government has argued that the Centre’s position ignored the economic importance of Coimbatore and Madurai, both of which have seen surging growth in manufacturing, textiles, education, and tourism. The state is also planning to revise and resubmit the DPRs with updated demographic data once the delayed Census process resumes. International lenders, including the Asian Infrastructure Investment Bank, have indicated interest in supporting the Coimbatore project.\n\nCentre’s recommendations\n\nOfficials in New Delhi have also questioned the ridership projections in the Tamil Nadu DPRs. The Madurai plan and the Coimbatore plan projected daily ridership levels that the Centre considered “unrealistic,” noting that Coimbatore’s estimated ridership of 5.9 lakh exceeded even the actual ridership of the Chennai Metro in 2025.\n\nThe Union Housing and Urban Affairs Ministry recommended alternatives such as expanded bus systems and Bus Rapid Transit System corridors, saying these were more aligned with the cities’ sizes.\n\nThe Tamil Nadu government and several urban planning experts have pushed back, pointing out that cities like Agra, Patna, and Bhopal received Metro clearance at similar population levels. The state sees this as evidence of what Stalin called “revenge politics”.\n\nStory continues below this ad\n\nThe state government has argued that the Centre’s position ignored the economic importance of Coimbatore and Madurai, both of which have seen surging growth in manufacturing, textiles, education, and tourism. The state is also planning to revise and resubmit the DPRs with updated demographic data once the delayed Census process resumes. International lenders, including the Asian Infrastructure Investment Bank, have indicated interest in supporting the Coimbatore project.",
  "summary": "",
  "published": "Wed, 19 Nov 2025 04:08:10 +0000",
  "url": "https://indianexpress.com/article/india/mk-stalin-narendra-modi-tamil-nadu-metro-revenge-10373654/",
  "source": "India | The Indian Express"
}