{
  "title": "Thousands of toxic sites across US face risk of coastal flooding",
  "text": "More than 5,500 toxic sites nationwide could face coastal flooding by 2100 due to rising sea levels, according to new research.\n\nThe study, published on Thursday in Nature Communications and led by scientists at the University of California, warns that if heat-trapping pollution continues unabated, rising seas will flood a wide range of hazardous facilities including those handling sewage, toxic waste, oil and gas, as well as other industrial pollutants.\n\nThe analysis relies on projections of a 1%-annual-chance flood – commonly called a 100-year flood – under two emissions scenarios: a high-emissions scenario and a lower-emissions scenario.\n\nAfter examining 23 coastal states and Puerto Rico, scientists found that flood risk is far from evenly distributed. Florida, New Jersey, California, Louisiana, New York, Massachusetts and Texas account for nearly 80% of the hazardous sites expected to be at risk by 2100.\n\nBy examining over 47,600 coastal facilities across the US, more than 11%, or 5,500 facilities are projected to be at risk of a 1-in-100-year or more frequent flood event by the end of the 21st century.\n\nThe study also noted: “Restricting greenhouse gas emissions to the low emissions scenario makes little difference in terms of the number of projected sites at risk in the near term (2050) but would reduce the number of at-risk sites from 5,500 to 5,138 (a reduction of 362 or 7% of sites) in the long term.”\n\nMoreover, it found that most of this risk is already locked in due to past emissions. By 2050, nearly 3,800 hazardous facilities are projected to face flooding threats.\n\nThe study found that under a high emissions scenario, over a fifth of coastal sewage treatment facilities, refineries and formerly used defense sites, roughly a third of power plants and over 40% of fossil fuel ports and terminals are projected to be at risk by 2100.\n\nIn addition to mapping toxic sites vulnerable to flooding, the study examined communities living nearby. It found that under a high-emissions scenario, neighborhoods with one or more at-risk facilities contain higher shares of renters, households in poverty, Hispanic residents, linguistically isolated households, car-less households, older adults and non-voters than neighborhoods without such sites.\n\nThe study added: “Racial residential segregation and the inequitable distribution of stormwater infrastructure further contribute to racialized patterns of flood risk across US cities.”\n\nPointing to the many health risks posed by floodwaters contaminated with industrial waste and sewage, Sacoby Wilson, a professor at the University of Maryland’s School of Public Health, outlined a range of symptoms during a press briefing about the study. These include rashes, burning eyes, headaches, fatigue and respiratory issues, as well as longer-term dangers such as cancers and organ damage to the kidneys and liver.\n\n“Based on this research, we see that you have underlying vulnerabilities that drive risk … Think about those communities that are overburdened by those industrial hazards … or agricultural hazards like CAFOs [concentrated animal feeding operations],” Wilson said. “And so you have compounding vulnerability when it comes to their socioeconomic status, in some cases, the role of racism … and also you have a hazard vulnerability, plus you have the geographic vulnerability based the proximity to the hazard.”\n\nResearcher Lara Cushing of UCLA’s Fielding School of Public Health said: “Flooding from sea level rise is dangerous on its own – but when facilities with hazardous materials are in the path of those floodwaters, the danger multiplies. This analysis makes it clear that these projected dangers are falling disproportionately on poorer communities and communities that have faced discrimination and therefore often lack the resources to prepare for, retreat, or recover from exposure to toxic floodwaters.”\n\nRachel Morello-Frosch, a researcher at UC Berkeley’s School of Public Health, said there were potential solutions “if policymakers are ready to move forward. And there is a clear need for disaster planning and land-use decision-making, as well as mitigation strategies to address the inequitable hazards and potential health threats posed by sea level rise.”\n\nThursday’s study comes as a number of the US’s east coast cities including New York, Baltimore and Norfolk are sinking, with subsidence linked to groundwater extraction, natural gas and building weight pressing into the ground.\n\nIt also follows a June study by the Union of Concerned Scientists that found rising sea levels, driven by climate warming, will threaten nearly 3 million Americans across 703 coastal communities. Critical infrastructure including affordable and subsidized housing, wastewater treatment facilities, schools, and hospitals could face monthly disruptive flooding by 2050, the study found.",
  "summary": "<p>Study finds rising seas could flood facilities handling waste, sewage, and oil and gas – and coastal states most at risk</p><p>More than 5,500 toxic sites nationwide could face coastal flooding by 2100 due to rising sea levels, according to new research.</p><p>The study, published on Thursday in Nature Communications and led by scientists at the University of California, warns that if heat-trapping pollution continues unabated, rising seas will flood a wide range of hazardous facilities including those handling sewage, toxic waste, oil and gas, as well as other industrial pollutants.</p> <a href=\"https://www.theguardian.com/environment/2025/nov/20/toxic-sites-us-coastal-flooding\">Continue reading...</a>",
  "published": "Thu, 20 Nov 2025 10:00:03 GMT",
  "url": "https://www.theguardian.com/environment/2025/nov/20/toxic-sites-us-coastal-flooding",
  "source": "The Guardian"
}