{
  "title": "DOJ Big Threatens Democrats Behind Video Telling Military To Defy ‘Illegal Orders’",
  "text": "LOADING ERROR LOADING\n\nDeputy Attorney General Todd Blanche strongly suggested Wednesday that the Department of Justice will investigate Democratic members of Congress who made a video telling military members to “refuse illegal orders.” (Watch the clips below.)\n\nBlanche told Fox News host Sean Hannity that such a probe would focus on their “intent” while indicating his mind was made up. The clip, he said, encourages troops and others to “defy a direct command from their superior. And that is wrong.”\n\nAdvertisement\n\n“And so what does the investigation look like?” Blanche asked. “I think they should be held to account. I think that those congressmen should be required to answer questions about why they did what they did, and the American people deserve that, and so does President Trump.”\n\nPressed by Hannity to determine whether the videomakers had broken laws regarding rebellion and insurrection, Blanche said, “I’m not convicting anybody tonight on this show.”\n\nBlanche said the matter required “a very close look” and promised that it would happen.\n\nAdvertisement\n\nIn a video that has outraged Trump allies, Sens. Elissa Slotkin (D-Mich.) and Mark Kelly (D-Ariz.) led four other military and intelligence community alums in Congress to urge service members to defy commands that break the law.\n\nThe lawmakers presumably referred to legally disputed federal incursions ordered by Trump into blue cities supposedly to fight crime.\n\n“This administration is pitting our uniformed military and intelligence community professionals against American citizens,” the Democrats said. “Like us, you all swore an oath to protect and defend this Constitution. Right now, the threats to our Constitution aren’t just coming from abroad. But from right here at home. Our laws are clear. You can refuse illegal orders. ... You must refuse illegal orders. ... We need you to stand up for our laws, our Constitution and who we are as Americans.”\n\nAdvertisement\n\n“I felt like I was watching a propaganda video by one of our enemies trying to recruit the military to become spies,” Blanche told Hannity, adding that Trump is doing nothing “illegal.”\n\nStephen Miller, Trump’s deputy chief of staff, called the video an act of “insurrection.”\n\n“I know the difference between defending our Constitution and an insurrection,” Kelly snapped back, “even if you don’t.”\n\nAdvertisement",
  "summary": "“I felt like I was watching a propaganda video by one of our enemies trying to recruit the military to become spies,” Deputy Attorney General Todd Blanche told Sean Hannity.",
  "published": "Thu, 20 Nov 2025 08:02:35 -0500",
  "url": "https://www.huffpost.com/entry/todd-blanche-doj-investigation-sean-hannity_n_691ef05ae4b0b763ab8e0e07",
  "source": "Politics"
}