{
  "title": "Venezuelans share their concerns amid U.S. military buildup near the country",
  "text": "Venezuelans share their concerns amid U.S. military buildup near the country\n\nAs Venezuela braces for potential U.S. military intervention, residents at the Colombia border tell NPR about their fears and hopes.\n\nA MARTÍNEZ, HOST:\n\nIn the Caribbean, the U.S. has assembled its largest military presence there in decades with more than half a dozen warships off the Venezuelan coast. While President Trump hasn't yet spelled out his plans for Venezuela, he has publicly said he is not ruling out military action. He also says he's willing to engage in talks with Venezuela's authoritarian leader, Nicolas Maduro.\n\nNPR's Carrie Kahn traveled to the Colombian-Venezuelan border to hear Venezuelan's concerns.\n\n(SOUNDBITE OF CARS HONKING)\n\nUNIDENTIFIED PERSON: (Non-English language spoken).\n\nCARRIE KAHN, BYLINE: It's an overcast and windy day at this busy border crossing outside the Northeastern Colombian city of Cucuta. Many people just came into Colombia for the day to buy things that they can't get in Venezuela, or too expensive, and you see them carrying bags and bags full of everything, from Christmas decorations to wood products to eggs.\n\nALFREDO VIVAS: (Non-English language spoken).\n\nKAHN: \"The economy is really tough now,\" says 61-year-old Alfredo Vivas.\n\n(SOUNDBITE OF CARTONS BEING WRAPPED)\n\nKAHN: He's wrapping up 12 large carton of eggs he just bought to sell back home in Venezuela. He makes this border egg run every two weeks, but says, lately, he can't charge too much. No one has money. I ask him if people are worried about a U.S. attack.\n\n\"No, not that much,\" he says.\n\nVIVAS: (Non-English language spoken, laughter).\n\nKAHN: \"What's scarier is staying in Venezuela,\" he jokes. Inflation is skyrocketing, estimated to top 500% this year. And many say, it's gotten too dangerous to speak your mind.\n\nLINDA: (Non-English language spoken).\n\nKAHN: \"There is no freedom of expression,\" says this woman, who asked we only use our first name, Linda. She's at the border helping her sister leave for Colombia. She's afraid Venezuelan authorities will see her talking to me.\n\nLINDA: (Non-English language spoken).\n\nKAHN: \"For sure they'll grab me and throw me into jail,\" she says, clutching her shivering chihuahua wrapped in a pink knit vest. She says she hardly goes out anymore. The situation is very tense these days, she says. Since President Nicolas Maduro declared victory in elections last year, widely discredited as fraudulent, he's cracked down hard on dissidents.\n\nNearly 8 million Venezuelans have fled the country during his more than a decade-long rule. There are no figures on how many have left recently. But Marta Duque, who runs a migrant shelter at a nearby Colombian border town, says she's seen an uptick since the U.S. buildup.\n\nMARTA DUQUE: (Non-English language spoken).\n\nKAHN: \"Relatives abroad are telling their Venezuelan loved ones to get out now and come to them where it's safe,\" she says.\n\nDUQUE: (Non-English language spoken).\n\nKAHN: \"At least until all this is over,\" she says, \"since no one knows when or what is going to happen.\"\n\n(SOUNDBITE OF SONG, \"EL PORTENITO\")\n\nBANDA LA BOCANA: (Singing in a non-English language).\n\nKAHN: At this huge supermarket in Cucuta, Venezuelan shoppers load carts with cooking oil and pasta. A steady stream also pick up money from relatives abroad at the Western Union kiosk. This man, who asked we only use his first name, Jose, out of fear of retribution, says he's thankful for Trump.\n\nJOSE: (Non-English language spoken).\n\nKAHN: \"There's no way Venezuelans can get out of this without force,\" he says. But he warns the prospect of a U.S. intervention in Venezuela is worrisome. \"No one wants another Iraq or Afghanistan here,\" he says.\n\nJOSE: (Non-English language spoken).\n\nKAHN: \"The day after is the problem,\" he says. \"We like to think we will be different.\" But he says that uncertainty has everyone scared. Carrie Kahn, NPR News, Cucuta, Colombia.\n\nCopyright © 2025 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\n\nAccuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.",
  "summary": "As Venezuela braces for potential U.S. military intervention, residents at the Colombia border tell NPR about their fears and hopes.",
  "published": "Thu, 20 Nov 2025 04:51:46 -0500",
  "url": "https://www.npr.org/2025/11/20/nx-s1-5613877/venezuelans-share-their-concerns-amid-u-s-military-buildup-near-the-country",
  "source": "NPR Topics: World"
}