{
  "title": "Trump signs bill ordering US justice department to release Epstein files",
  "text": "Trump signs bill ordering US justice department to release Epstein files\n\n8 hours ago Share Save Sakshi Venkatraman and David Willis, North America correspondent Share Save\n\nWatch: \"I'm all for it\", Trump says on calls to release Epstein files\n\nUS President Donald Trump says he signed a bill that orders the release of government files on the late convicted sex offender Jeffrey Epstein - a significant turning point in a months-long fight over the documents. The justice department now has 30 days to publicly share all information from federal investigations into Epstein. However, it can withhold files that relate to active criminal investigations or are deemed to invade personal privacy. In a major reversal, Trump dropped his opposition to the measure last weekend, after pushback from Epstein's victims and members of his own Republican Party. With his support, the resolution overwhelmingly cleared both chambers of Congress.\n\nUntil recently, Trump had dismissed the need to release the documents, calling it a Democrat-led \"hoax\" to \"deflect\" attention away from his party's work. That position was itself a change from the stance he took ahead of the 2024 election. \"Perhaps the truth about these Democrats, and their associations with Jeffrey Epstein, will soon be revealed, because I HAVE JUST SIGNED THE BILL TO RELEASE THE EPSTEIN FILES!\" he wrote. Although a congressional vote was not required to release the files - Trump could have ordered the release on his own - lawmakers in the House passed the legislation with a 427-1 vote. The Senate gave unanimous consent to pass it upon its arrival, sending the bill to Trump for his signature. The lone vote against the resolution in the House, the lower chamber, was cast by Louisiana Republican Clay Higgins, who objected to the scope of information that could be released. He said it could reveal and threaten \"thousands of innocent people\" who may have talked to investigators about allegations against Epstein. Under the law now signed by Trump, Attorney General Pam Bondi must release the documents within 30 days.\n\nThe files subject to release are from criminal investigations into Epstein, including transcripts of interviews with victims and witnesses, and items seized in raids of his properties. Those materials include internal justice department communications, flight logs, and people and entities connected to the late financier. But there are exceptions. The resolution allows the justice department to withhold any documents related to criminal investigations. After the estate documents were released last week, Trump said he would ask Bondi to investigate Epstein's ties to people who had apparently communicated with him. Bondi promptly said the justice department \"will pursue this with urgency and integrity\". One of the bill's architects, Republican Congressman Thomas Massie, said he had worries that the move would lead to some federal files being withheld. \"I'm concerned that [Trump is] opening a flurry of investigations, and I believe they may be trying to use those investigations as a predicate for not releasing the files. That's my concern,\" he said. Bondi can also withhold information that may identify victims or reveal their medical files, leading many to speculate that parts of the files will be redacted - although it remains unclear how heavy the redacting could be. \"I'm glad in the act itself they put specific language reinforcing the privacy rights of the victims here,\" said Christine Dunn, an attorney with Sanford Heisler Sharp McKnight who specialises in sexual violence and victims' rights. \"It's important to make sure that their privacy is protected and to avoid retraumatizing these victims,\" she said.\n\nWhite House: Epstein story 'a manufactured hoax'\n\nTrump had promised during his 2024 presidential campaign to make the files public, and early in the year his administration released thousands of pages of documents from the Epstein investigation, mostly flight logs. While Trump said more documents were coming, Bondi later announced in July there would be no further releases. That prompted lawmakers from both parties to introduce the resolution compelling the files' release. One of the resolution's key proponents was Republican Representative Marjorie Taylor Greene, one of Trump's fiercest political allies. She has publicly fought with Trump in recent weeks, as the US president maintained his opposition to the resolution up to a few days before the vote. After the resolution passed, Greene posted to say that she would read the name of any powerful person implicated in any released files aloud on the House floor. The anticipated files are different to the more than 20,000 pages of documents from Epstein's estate released by Congress last week, including some that mention Trump. Those include 2018 messages from Epstein in which he said of Trump: \"I am the one able to take him down\" and \"I know how dirty donald is\". Trump was a friend of Epstein's for years, but the president has said they fell out in the early 2000s, years before Epstein was first arrested. Trump has consistently denied any wrongdoing in relation to Epstein. Speaking to reporters on Monday night, Trump said Republicans had \"nothing to do with Epstein\". \"It's really a Democrat problem,\" he said. \"The Democrats were Epstein's friends, all of them.\" The family of Virginia Giuffre, who died by suicide earlier this year, said in a statement Trump signing the bill was \"nothing short of monumental\", for Giuffre and other survivors. \"As we look towards the next chapter, we remain vigilant. This work is not finished. Every name must be revealed, regardless of power, wealth, or party affiliation,\" her brother and sister-in-law, Sky and Amanda Roberts, said. Epstein was found dead in 2019 in his New York prison cell in what a coroner ruled was a suicide. He was being held on charges of sex trafficking. He had been convicted previously of soliciting prostitution from a minor in 2008. The once high-flying financier had ties with a number of high-profile figures, including Andrew Mountbatten Windsor, the brother of King Charles and former prince; Trump; Trump's former advisor Steve Bannon; and a cast of other characters from the world of media, politics and entertainment. On Wednesday, former Harvard president Larry Summers took a leave from teaching at the university while the school investigated his links to Epstein, revealed in a series of chummy email exchanges. Kayla Epstein contributed to this report.",
  "summary": "The bill gives the US Justice Department 30 days to release all the files in a searchable format.",
  "published": "Thu, 20 Nov 2025 22:26:31 GMT",
  "url": "https://www.bbc.com/news/articles/cly2y40lj5go?at_medium=RSS&at_campaign=rss",
  "source": "BBC News"
}