{
  "title": "Frida Kahlo self-portrait sells for $54.7m to set new auction record for a female artist",
  "text": "A 1940 self-portrait by famed Mexican artist Frida Kahlo has sold for $54.7m (£41.8m, A$84.7m) at a New York art auction, setting a new top sale price for a work by any female artist.\n\nEl sueño (La cama), or The Dream (The Bed), which depicts Kahlo asleep in a bed with a smiling skeleton wrapped in dynamite on the canopy above her, sold on Thursday night at a Sotheby’s auction of surrealist art after four minutes of bidding.\n\nThe price tag, which includes fees, surpasses the record held by Georgia O’Keeffe’s Jimson Weed/White Flower No. 1, which sold at Sotheby’s for $44.4m in 2014.\n\nSotheby’s has yet to identify the successful buyer of the painting.\n\nEl sueño (La cama) was forecast to fetch between $40 and $60m. The $54.7m sale smashes the record for Latin American art previously set by Kahlo’s painting Diego y Yo (Diego and I) in 2021 when it sold for $34.9m. That painting depicted the artist and her husband, the muralist Diego Rivera.\n\nHer paintings are reported to have sold privately for even more.\n\nView image in fullscreen El sueño (La cama) on display at Sotheby’s auction rooms in London in September 2025. Photograph: Kirsty Wigglesworth/AP\n\nThe self-portrait is among the few Kahlo pieces that has remained in private hands outside Mexico, where her body of work has been declared an artistic monument. Her works in both public and private collections within Mexico cannot be sold abroad or destroyed.\n\nThe painting comes from a private collection, whose owner has not been disclosed, and is legally eligible for international sale. Some art historians have scrutinised the sale for cultural reasons, while others have raised concern that the painting – last exhibited publicly in the late 1990s – could again disappear from public view after the auction. It has already been requested for upcoming exhibitions in cities including New York, London and Brussels.\n\nKahlo vibrantly and unsparingly depicted herself and events from her life, which was upended by a bus accident at 18. She started to paint while bedridden, underwent a series of painful surgeries on her damaged spine and pelvis, and then wore casts until her death in 1954 at age 47.\n\nDuring the years Kahlo was confined to her bed, she came to view it as a bridge between worlds as she explored her mortality.\n\nThe painting is the star of a sale of more than 100 surrealist works by artists including Salvador Dalí, René Magritte, Max Ernst and Dorothea Tanning.\n\nKahlo resisted being labeled a surrealist, a style of art that’s dreamlike and centres on a fascination with the unconscious mind.\n\n“I never painted dreams,” she once said. “I painted my own reality.”\n\nIn its catalog note, Sotheby’s said the painting “offers a spectral meditation on the porous boundary between sleep and death.”\n\n“The suspended skeleton is often interpreted as a visualization of her anxiety about dying in her sleep, a fear all too plausible for an artist whose daily existence was shaped by chronic pain and past trauma,” the catalog notes.\n\nIt has been a big week for art auctions in New York, with Sotheby’s selling $706m of modern art on Tuesday, including a painting by the Austrian artist Gustav Klimt selling for $236.4m to become the second most expensive work to sell at auction in history, and the most expensive work of modern art sold at auction. Rival auction house Christie’s also sold $690m worth of 20th-century art.\n\nAssociated Press contributed to this report",
  "summary": "<p>The 1940 painting of Kahlo asleep in bed has surpassed the record set by the  $44.4m sale of Georgia O’Keeffe’s Jimson Weed/White Flower No. 1 in 2014</p><p>A 1940 self-portrait by famed Mexican artist Frida Kahlo has sold for $54.7m (£41.8m, A$84.7m) at a New York art auction, setting a new top sale price for a work by any female artist.</p><p>El sueño (La cama), or The Dream (The Bed), which depicts Kahlo asleep in a bed with a smiling skeleton wrapped in dynamite on the canopy above her, sold on Thursday night at a Sotheby’s auction of surrealist art after four minutes of bidding.</p> <a href=\"https://www.theguardian.com/artanddesign/2025/nov/21/frida-kahlo-self-portrait-sells-547-million-new-auction-record-female-artist\">Continue reading...</a>",
  "published": "Fri, 21 Nov 2025 01:12:12 GMT",
  "url": "https://www.theguardian.com/artanddesign/2025/nov/21/frida-kahlo-self-portrait-sells-547-million-new-auction-record-female-artist",
  "source": "The Guardian"
}