{
  "title": "North Carolina officials say US Border Patrol has ended Charlotte operation",
  "text": "The administration of US President Donald Trump has targeted Democrat-led cities like Charlotte for a surge in immigration enforcement operations.\n\nOfficials in North Carolina have signalled that the federal immigration crackdown in the city of Charlotte has wound down, ending five days of immigration raids and protests.\n\nOn Thursday, Charlotte Mayor Vi Lyles said that the United States Border Patrol had seemingly ended its crackdown on the Democrat-led city.\n\n“It appears that U.S. Border Patrol has ceased its operations in Charlotte. I’m relieved for our community and the residents, businesses, and all those who were targeted and impacted by this intrusion,” she wrote on social media.\n\n“As we move forward, it is essential that we come together — not as separate groups divided by recent events, but as one Charlotte community.”\n\nThe Mecklenburg County Sheriff’s Office also said federal officials had assured Sheriff Garry McFadden that they had concluded “Operation Charlotte’s Web” and that no further operations would occur on Thursday.\n\n“It is important to clarify that while the ‘Charlotte’s Web’ operation has ended, U.S. Immigration and Customs Enforcement (ICE) will continue to operate in Mecklenburg County as they always have,” a statement from the sheriff’s department said.\n\n“ICE maintains full authority to detain, apprehend, and take into custody any undocumented immigrant in accordance with federal law.”\n\nThe operation began on November 15, when the administration of US President Donald Trump announced it was “surging resources” to Charlotte.\n\nIt justified the surge by accusing local officials of embracing “sanctuary” policies that allow undocumented people to “roam free on American streets”.\n\nAdvertisement\n\nDuring an update on Wednesday, the Department of Homeland Security (DHS) said it had made more than 250 arrests as of Tuesday night.\n\nImmigration efforts had also expanded to the state capital of Raleigh and surrounding areas during the operation.\n\nBut “Operation Charlotte’s Web” had faced fierce pushback from residents in Charlotte, the state’s largest city and a centre for tech businesses. More than 911,300 people call Charlotte home.\n\nHundreds of protesters, for example, gathered outside businesses like Manolo’s Bakery, which temporarily shut its doors to protect employees and customers from being targeted by the raids. Another protest took place outside a Home Depot where Border Patrol agents had gathered.\n\nStudents at East Mecklenburg High School, Northwest School of the Arts and other schools also staged a walkout in solidarity with the immigrant community.\n\nLocal media reported that school attendance on Monday dropped by nearly 15 percent, but it was unclear how many absences were due to protests, concern over immigration enforcement activity or seasonal trends like the flu.\n\nThe spike in immigration operations in the Charlotte area also raised concerns about human rights abuses, with locals recording scenes of car windows being smashed and individuals being tackled to the ground and bloodied.\n\nAs the surge of federal immigration operations winds down in Charlotte, a fresh wave of Border Patrol operations is expected in another southern city, New Orleans. That operation has been dubbed the “Swamp Sweep”.\n\nOther Democratic-led cities have also faced heightened immigration enforcement operations, leading to widespread concerns about the tactics being used and whether human rights are being upheld.\n\nThose cities include Los Angeles, Chicago, Memphis and Washington, DC.\n\nThe number of people in immigration detention hit a record high of 60,000 in August, as President Trump, a Republican, carries out a campaign of mass deportation across the US.",
  "summary": "The Trump administration has targeted Democrat-led cities like Charlotte for a surge in immigration enforcement.",
  "published": "Thu, 20 Nov 2025 20:56:58 +0000",
  "url": "https://www.aljazeera.com/news/2025/11/20/north-carolina-officials-say-us-border-patrol-has-ended-charlotte-operation?traffic_source=rss",
  "source": "Al Jazeera – Breaking News, World News and Video from Al Jazeera"
}