{
  "title": "Trump Might Actually Fulfill 1 Of His Campaign Promises",
  "text": "LOADING ERROR LOADING\n\nThe Trump administration announced Tuesday certain Education Department programs, and billions of dollars used to fund them, would be shuffled to other government agencies, in a move that experts say is an unnerving escalation of a war on public education.\n\n“The Trump Administration is taking bold action to break up the federal education bureaucracy and return education to the states,” Secretary of Education Linda McMahon said in a statement.\n\nAdvertisement\n\n“Cutting through layers of red tape in Washington is one essential piece of our final mission … Together, we will refocus education on students, families, and schools — ensuring federal taxpayer spending is supporting a world-class education system.”\n\nThe Department of Education’s website lists six new agreements with other federal government agencies that will begin administering functions that include workforce development programs, international students and funding for low-income schools.\n\nMcMahon framed the six agreements with the Department of Labor, the Department of Health and Human Services and the Department of State as a win for students and families who rely on federal education programs. Experts, however, warn the changes will likely be anything but.\n\nAdvertisement\n\n“It’s all a show and it’s a part of this attack on public education,” Jon Valant, an education policy expert at the Brookings Institution, told HuffPost.\n\n“They found this absurd roundabout way of superficially moving a lot of the department’s responsibilities,” Valant said. “The net effect of that is going to be waste, inefficiency, mistakes, and a lot of frustrated people.”\n\nIt’s unclear when and how the changes will take place, and if any experienced Education Department workers will be moved to other agencies.\n\nAdvertisement\n\nThe Education Department did not immediately respond to requests for comment.\n\n“I think they are going at the department in pieces and phases, and this is just one,” Valant said.\n\nEliminating the Department of Education has been a goal for the Republican Party since the agency was first established in 1980. On the campaign trail last year, Donald Trump repeatedly promised to shutter the agency; once he was back in the White House, he signed an executive order aiming to do just that.\n\nTrump can’t actually shut down the Education Department himself — he’d need Congress to act. But he has found different ways to strip the department of responsibility, including subjecting it to massive layoffs.\n\nBefore Trump began his second term, the Department of Education had nearly 4,000 employees and a budget of $80 billion. Now, nearly half its staff has been laid off and the Trump administration has proposed cutting $12 billion from its budget.\n\nAdvertisement\n\nDespite conservative insistence that the agency was responsible for indoctrinating children with liberal ideology, the department mostly handles funding for low-income schools, grants to rural schools and investigations into students’ civil rights complaints.\n\nThe largest program that’s moving is Title I, which provides funding for low-income schools in all 50 states. It is set to be housed under the Department of Labor.\n\n“Moving Title I and moving its oversight to Labor implies that schools exist solely as a workforce preparation and they don’t,” Valant said. “It’s an important part of K-12 schooling but we need schools to prepare students in society and democracy too.”\n\nAdvertisement\n\nThe program’s budget was $18.6 billion in fiscal year 2023, which is greater than the Department of Labor’s entire budget of about $14.6 billion.\n\n“The size and scale of what they’re able to handle is quite different,” Jared Bass, the senior vice president of education at the Center for American Progress, told HuffPost. “This is like Texas going to the state of Delaware and saying, ‘Can you run all my programs for me?’”\n\nAdvocates are concerned that workers at other agencies may not know the ins and outs of administering a large critical education program. “If they just hand [Title I] over to current Labor staff, they’ll have no idea how it works,” Valant said.\n\nAdvertisement\n\nShuffling programs to other departments will introduce more complexity for educators, who may suddenly have to navigate a web of different agencies.\n\n“What about if there’s an emergency like a natural disaster or another pandemic?” Bass said. “Instead of one agency for relief funding, now I have six that I have to go to.”\n\nThe Education Department has said that appropriated funding would continue to flow to states, but advocates are concerned that important matters may fall through the cracks as part of the transition.\n\nAdvertisement\n\n“There’s a cynical part of me that worries that if there’s severe understaffing or lack of oversight, there may not be many people concerned if we see that funds are being used,” Valant said. “They may find that to be a desirable outcome.”\n\nAnd although a future administration could undo these changes, Bass is worried about the damage even temporary changes could do.\n\n“I’m worried about the permanence of the damage to these programs,” he said. “These are real kids, families and students. They shouldn’t have to be guinea pigs when it comes to federal education programs.”",
  "summary": "Eliminating the department has been a goal for the Republican Party since the agency was first established in 1980.",
  "published": "Wed, 19 Nov 2025 17:52:09 -0500",
  "url": "https://www.huffpost.com/entry/trump-education-department-dismantle_n_691e3e0ae4b06f2a60cb8b4c",
  "source": "Politics"
}