{
  "title": "Hospitals knew a heart device led to more patients' deaths - but they kept using it",
  "text": "Hospitals knew a heart device led to more patients' deaths - but they kept using it\n\n12 November 2025 Share Save Michael Buchanan, Social affairs correspondent and Adam Eley, BBC News Share Save\n\nFamily handout Greg Marshall's Medtronic heart pump malfunctioned and he died three years later aged 26\n\nDozens of patients were put at risk after two of the UK's leading transplant centres continued fitting a heart device - despite knowing of concerns it had a higher mortality rate than its rival product. Concerns were raised by the NHS about the device in 2018. Of the patients who were subsequently fitted with the mechanical pump, half went on to die within three years. The mother of Greg Marshall - one of the patients who received the device after concerns were known and who subsequently died - told us she was \"disgusted and appalled\". The BBC has also learned that leading cardiologists at both hospitals were paid consultants for the device's manufacturer. The hospitals were aware of this.\n\nBoth hospitals - the Freeman in Newcastle and Harefield in London - continued to use the pump for years, and questioned the reliability of the data flagged by the NHS. The pump's manufacturer, Medtronic, eventually withdrew it on safety grounds. Patients with a weakened heart, who may be waiting for a transplant or deemed not suitable for one, can be offered a machine called an LVAD, a Left Ventricular Assist Device. It helps the heart pump blood around the body and, for many patients, this is their only chance of survival until a transplant becomes available. The device is implanted into the heart, with an external wire coming out of the body - usually at the abdomen - that connects to a controller and external batteries. LVADs have been life-savers for decades and, for a number of years, hospitals had a choice of two devices - the HeartWare HVAD, sold by the Irish-American company Medtronic, and the Heartmate III, sold by US manufacturer Abbott.\n\nMedtronic Medtronic withdrew the device from sale in June 2021 \"in the interest of patient safety\"\n\nIn October 2018, NHS Blood and Transplant (NHSBT), which oversees transplants in the UK, conducted a preliminary audit comparing how the two pumps had performed. A more detailed analysis followed in April 2019. The results were stark. Of the 119 patients who had received the Medtronic device, 45% - or 54 patients - had died within two years. In contrast, just 15% - 15 out of 97 patients - who were given the Abbott pump had died over the same period. Similarly, the number of complications - such as strokes or needing a new pump - were significantly higher for the Medtronic device. The audit said there were \"no significant differences\" between the types of patients who received each device. One of the UK's six transplant centres, the Royal Papworth Hospital in Cambridge, did not wait for the NHS analysis. It had picked up on the growing international concerns and had stopped using the Medtronic device in February 2018 \"after considering the results of two randomised controlled trials\", as their clinicians \"considered the Heartmate III as superior\". However, Harefield Hospital continued to solely use the Medtronic device until early 2021, shortly after the manufacturer had issued a safety notice. The Freeman Hospital continued until June 2021, when the manufacturer withdrew it from sale \"in the interest of patient safety\". The regulator, the Medicines and Healthcare products Regulatory Agency (MHRA), continued to approve the device for use after the 2019 analysis, though it had not been informed by the NHS of the data's existence. Throughout this time, patients fitted with the Medtronic device continued to die at a higher rate than those with the Abbott device. Between October 2018, when the first set of NHS data was produced, and June 2021, when Medtronic discontinued its pump, the mortality rate of the Medtronic device was two-and-a-half times higher than the Abbott device, figures released under the Freedom of Information Act show. Forty-nine percent of those who received the Medtronic device (39 of 80 patients) in that time died within three years. By comparison, 19% of recipients of the Abbott device (20 of 106 patients) died during the same timeframe.\n\nFamily handout Greg Marshall (seen here on the right, with brother Harrison and mother Tessa) suffered acute heart failure in 2019\n\nMedtronic decided to withdraw the device in June 2021 after growing evidence that its pump had a higher frequency of strokes and deaths compared with other devices. It also cited a specific malfunction where pumps would experience a delay or fail to restart after they were stopped. Greg Marshall, from West Yorkshire, was one of the patients fitted with the Medtronic device, unaware of the studies about its effectiveness compared with the rival product. A fit and healthy young man, he had ambitions of joining the Royal Marines but he suffered acute heart failure in 2019. \"It was a massive shock to us all,\" his mother Tessa Marshall remembers. By June of that year, Greg was offered the Medtronic device by the Freeman Hospital, several months after the first set of NHS data was known about. His family say they were not presented with the long-term risks associated with the device, though an existing patient was brought in to tell them of its benefits. Greg agreed to the surgery, but a significant complication in theatre - which the family say was never fully explained to them - led to a stroke. Greg lost movement down the left-hand side of his body, and his speech was significantly impaired. Over time, his health slowly began to recover, but a year later, in July 2020, the heart device suddenly stopped working. When he tried to restart it, it failed to switch back on. \"The pump was not pumping, and he just slowly went blue,\" Tessa says. Greg was rushed to hospital, but the device could not be fixed. He was told he could have it removed, but, terrified of having another stroke, he refused the surgery. The broken device remained inside him, switched off, as his heart continued to function for a further three years, during which time he was on a transplant waiting list. In September 2023, while in hospital, he unexpectedly went into cardiac arrest. By the time Tessa had reached the Freeman, Greg had died aged 26. His family, devastated by his loss, say they want answers. \"We said 'Look, Greg, this is the only option you've got, you have got to go with it,'\" said Tessa. \"I kick myself now, for not doing any more research.\" Three patients may have died of this failure, the NHS Trust in Newcastle told the Department of Health and Social Care in a letter seen by the BBC. The trust has since told the BBC the issue of the device failing to restart in patients first came to light in December 2020 - five months after Greg encountered the issue - when Medtronic published a safety notice.\n\nISHLT Prof Schueler said he \"always worked within GMC standards for good medical practice\"",
  "summary": "Almost half of patients given a heart pump, after the NHS had raised concerns about it, died soon after.",
  "published": "Wed, 12 Nov 2025 22:00:03 GMT",
  "url": "https://www.bbc.com/news/articles/cqjwg197855o?at_medium=RSS&at_campaign=rss",
  "source": "BBC News"
}