{
  "title": "Divide over fossil fuels phaseout can be bridged, Cop30 president says",
  "text": "Oil-producing countries need to acknowledge the rise of clean energy, and rich countries will have to provide more assurances on finance if the chasm between negotiating nations at Cop30 is to be bridged, the president of the summit has said.\n\nAndré Corrêa do Lago, the veteran Brazilian climate diplomat in charge of the talks, said: “Developing countries are looking at developed countries as countries that could be much more generous in supporting them to be more sustainable. They could offer more finance, and technology.”\n\nThis does not necessarily involve an increase in the headline amount of money to be provided directly from rich world coffers, set last year at $300bn (£230bn) a year by 2035. It could also come from better use of existing finance, Corrêa do Lago added.\n\n“You don’t need more money. You don’t need public money from developed countries. You need to leverage more dollars from each dollar that you have,” he said in an exclusive interview with the Guardian as the talks entered their crucial stage.\n\n“They can offer not only more resources in banks, in multinational development banks; put more public money in funds like the green climate fund or the global environment facility, but there are an increasing number of alternatives like debt-for-nature swaps and other [instruments].”\n\nThe divide over the “transition away from fossil fuels” has emerged as the biggest faultline at the Cop30 talks, now entering their final days in Brazil. On Tuesday, more than 80 countries demanded a roadmap to the transition as a key outcome of the summit, in what some campaigners described as a “turning point”.\n\nBut they are likely to face stiff opposition from petrostates such as Saudi Arabia and others who are dependent on fossil fuels. Decisions at “conference of the party” meetings require consensus, so even a handful of states could scupper the roadmap proposal.\n\n“Not only is [the divide] binary, but it is two extremes: one very favourable [to a phaseout] the other very unfavourable. There aren’t many countries that are indifferent,” said Corrêa do Lago.\n\nView image in fullscreen A demonstration at Cop30 in Belém calling for an end to the use of fossil fuels. Photograph: Fraga Alves/EPA\n\nBut countries could still come together, he added. “Like most of these negotiations, it is less binary than it looks,” he said, if countries could recognise their own internal contradictions, and face up to the global need for climate action.\n\nSome oil-producing countries oppose the fossil fuel phaseout, but so do some consumer countries. “Some countries, because oil is a very important source of revenue, and other countries because they evaluate that they still need to use coal for more years, have shown very clearly that this proposal is not acceptable to them,” Corrêa do Lago said.\n\nOil-producing countries also had hard truths to face up to. “They have to decide by themselves how they interpret the transition [away from fossil fuels],” he said. “They are already doing it. There is one statistic that shows that the use of oil will be reduced inevitably in the years ahead. [Electric vehicles are] reducing significantly the demand for oil, for gasoline and diesel.”\n\nHe urged all countries to examine their future in the context of the climate crisis. “All countries could engage in this exercise, which is to find its own path to transition towards net zero, which is what we have committed to,” he said.\n\nskip past newsletter promotion Sign up to Down to Earth Free weekly newsletter The planet's most important stories. Get all the week's environment news - the good, the bad and the essential Enter your email address Sign up Privacy Notice: Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on theguardian.com to send you this newsletter. You can complete full registration at any time. For more information about how we use your data see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nCountries can get over their internal contradictions, and take action on the climate in spite of them, according to Corrêa do Lago. Brazil embodies this: the country has recently become a major producer of oil and gas, but its president, Luiz Inácio Lula da Silva, has repeatedly insisted, at Cop30 and the summit of world leaders in Belém that preceded it, on the need to “move away from dependency on fossil fuels”.\n\nCountries should face up to these opposing internal forces rather than try to hide them, Corrêa do Lago urged. “This Cop is happening in a country that is at the same time a nouveau oil producer and exporter, and the champion of renewables.\n\n“The country where you have the largest tropical forests in the world and the country that has the largest meat producer in the world. Brazil is a microcosm of the world: we have many successes, and we still have great challenges [with poverty] and many things to do to improve the life of our population. We understand the challenges of wealth and the challenges of poverty. [Brazil] reminds us that every country in the world has contradictory circumstances.”\n\nLula is expected to return to Belém on Wednesday in an attempt to draw conflicted countries together. Corrêa do Lago said this would be done by listening to all countries’ concerns. “Brazil doesn’t want to do a top-down negotiation – Brazil wants to hear from countries which solutions they propose,” he said.\n\nCorrêa do Lago is a pragmatist, a climate diplomat since 2002 who believes the annual talks must evolve fast to keep up with the speed at which global heating is altering the planet. Arguments over the precise wording of promises and resolutions that have been rehearsed many times before can distract countries from the need to pursue action in the real world, he says.\n\n“The sense of urgency is what drove us to insist on implementation, because I think at this stage it’s irrelevant to be right. What is relevant is really to advance and make progress in implementation,” he said.\n\nThat could mean countries pushing ahead with “coalitions of the willing” to take immediate action, rather than waiting to gain consensus at a Cop. Brazil has drawn up an “action agenda” of issues that do not need formal Cop approval to go ahead.",
  "summary": "<p>Exclusive: André Corrêa do Lago says rise of clean energy must be acknowledged and rich countries need to do more</p><ul><li><p><a href=\"https://www.theguardian.com/environment/cop30\">Cop30: click here for full Guardian coverage of climate talks in Brazil</a></p></li></ul><p>Oil-producing countries need to acknowledge the rise of clean energy, and rich countries will have to provide more assurances on finance if the chasm between negotiating nations at Cop30 is to be bridged, the president of the summit has said.</p><p>André Corrêa do Lago, the veteran Brazilian climate diplomat in charge of the talks, said: “Developing countries are looking at developed countries as countries that could be much more generous in supporting them to be more sustainable. They could offer more finance, and technology.”</p> <a href=\"https://www.theguardian.com/environment/2025/nov/19/divide-over-fossil-fuels-phaseout-can-be-bridged-cop30-president-says\">Continue reading...</a>",
  "published": "Wed, 19 Nov 2025 16:43:39 GMT",
  "url": "https://www.theguardian.com/environment/2025/nov/19/divide-over-fossil-fuels-phaseout-can-be-bridged-cop30-president-says",
  "source": "The Guardian"
}