{
  "title": "Scientists recover 40,000-year-old mammoth RNA still packed with clues",
  "text": "Researchers from Stockholm University have -- for the first time ever -- managed to successfully isolate and sequence RNA molecules from Ice Age woolly mammoths. These RNA sequences are the oldest ever recovered and come from mammoth tissue preserved in the Siberian permafrost for nearly 40,000 years. The study, published in the journal Cell, demonstrates that RNA, along with DNA and proteins, can remain intact for extremely long periods and can reveal new details about long-extinct species.\n\n\"With RNA, we can obtain direct evidence of which genes are 'turned on', offering a glimpse into the final moments of life of a mammoth that walked the Earth during the last Ice Age. This is information that cannot be obtained from DNA alone,\" says Emilio Mármol, lead author of the study. Formerly a postdoctoral researcher at Stockholm University, he is now based at the Globe Institute in Copenhagen. During his time at Stockholm University, he collaborated with researchers at SciLifeLab and the Centre for Palaeogenetics, a joint initiative between Stockholm University and the Swedish Museum of Natural History.\n\nWhy Ancient RNA Matters\n\nUnderstanding how prehistoric genes functioned and were activated is crucial for learning more about extinct species. Scientists have spent years analyzing mammoth DNA to reconstruct their genomes and evolutionary relationships, but RNA has remained largely inaccessible. Because RNA breaks down quickly after death, many researchers assumed it could not survive long enough to be studied in animals that disappeared thousands of years ago.\n\n\"We gained access to exceptionally well-preserved mammoth tissues unearthed from the Siberian permafrost, which we hoped would still contain RNA molecules frozen in time,\" adds Emilio Mármol.\n\n\"We have previously pushed the limits of DNA recovery past a million years. Now, we wanted to explore whether we could expand RNA sequencing further back in time than done in previous studies,\" says Love Dalén, professor of Evolutionary Genomics at Stockholm University and the Centre for Palaeogenetics.\n\nThe Oldest RNA Ever Sequenced\n\nThe researchers identified distinct patterns of gene expression in frozen muscle tissue from Yuka, a juvenile mammoth that died almost 40,000 years ago. Among the more than 20,000 protein-coding genes in the mammoth genome, only a portion were active. The RNA molecules they detected coded for proteins involved in muscle contraction and metabolic responses to stress.\n\n\"We found signs of cell stress, which is perhaps not surprising since previous research suggested that Yuka was attacked by cave lions shortly before his death,\" says Emilio Mármol.\n\nThey also uncovered numerous RNA molecules involved in regulating gene activity within the mammoth muscle.\n\nAncient microRNAs Confirm Authentic Mammoth Signals\n\n\"RNAs that do not encode for proteins, such as microRNAs, were among the most exciting findings we got,\" says Marc Friedländer, associate professor at the Department of Molecular Biosciences, The Wenner-Gren Institute at Stockholm University and SciLifeLab.\n\n\"The muscle-specific microRNAs we found in mammoth tissues are direct evidence of gene regulation happening in real time in ancient times. It is the first time something like this has been achieved,\" he says.\n\nThese microRNAs helped confirm that the genetic signals truly originated from mammoths.\n\n\"We found rare mutations in certain microRNAs that provided a smoking-gun demonstration of their mammoth origin. We even detected novel genes solely based on RNA evidence, something never before attempted in such ancient remains,\" notes Bastian Fromm, associate professor at the Arctic University Museum of Norway (UiT).\n\nRNA Survives Far Longer Than Expected\n\n\"RNA molecules can survive much longer than previously thought.\"\n\n\"Our results demonstrate that RNA molecules can survive much longer than previously thought. This means that we will not only be able to study which genes are 'turned on' in different extinct animals, but it will also be possible to sequence RNA viruses, such as influenza and coronaviruses, preserved in Ice Age remains,\" says Love Dalén.\n\nIn the years ahead, the team hopes to integrate prehistoric RNA with DNA, proteins, and other preserved biomolecules.\n\n\"Such studies could fundamentally reshape our understanding of extinct megafauna as well as other species, revealing the many hidden layers of biology that have remained frozen in time until now,\" finishes Emilio Mármol.\n\nWoolly Mammoths and Their Disappearance\n\nWoolly mammoths once roamed the icy plains of Eurasia and North America, perfectly adapted to life during the last Ice Age (approximately 115,000-11,500 years ago). With their thick coats, curved tusks, and towering size, they grazed the vast steppes that stretched across the northern hemisphere. But as the climate warmed, the woolly mammoths gradually vanished, with the last small herds surviving on remote Arctic islands until just 4,000 years ago.",
  "summary": "Researchers have sequenced the oldest RNA ever recovered, taken from a woolly mammoth frozen for nearly 40,000 years. The RNA reveals which genes were active in its tissues, offering a rare glimpse into its biology and final moments. Surprisingly, the team also identified ancient microRNAs and rare mutations that confirm their mammoth origin. The finding shows that RNA can endure millennia—reshaping how scientists study extinct species.",
  "published": "Sat, 15 Nov 2025 23:54:56 EST",
  "url": "https://www.sciencedaily.com/releases/2025/11/251115095920.htm",
  "source": "All Top News -- ScienceDaily"
}