{
  "title": "Barnwell: Is Nick Sirianni the most scrutinized successful coach in NFL history?",
  "text": "Open Extended Reactions\n\nPhiladelphia Eagles fans are not easily pleased or placated for very long. These are the same fans who booed their own team off the field at halftime in Week 1 of the 2018 season ... two quarters into the team's first game after winning the city its first Super Bowl. Expectations are high, and judgment for the players and coaches who don't meet those expectations in the court of public opinion can be swift. This isn't a complaint or a criticism but merely a reflection of reality. Nobody should be naive about what they're getting into if they're stepping onto the field or running things off it in Philadelphia.\n\nEven by those standards, though, the roller coaster of emotions directed toward head coach Nick Sirianni is fascinating and remarkable. The Eagles have enjoyed nearly unprecedented success during Sirianni's tenure, making it to the playoffs in each of his first four seasons at the helm. He has made it to two Super Bowls and won one across that span. Eagles fans seemed to love Sirianni during the 2022 season and then again at the end of the 2024 campaign. But even midway through last year's Super Bowl-winning campaign, there were \"Fire Nick\" chants in the crowd, with the coach responding by seemingly shouting back at his own fans after a victory.\n\nSubscribe: 'The Bill Barnwell Show'\n\nEvery team has fans who get upset at the coaches, of course, and Eagles fans eventually grew tired of Andy Reid and ran him out of town, too. But even nationally, there isn't the same respect paid toward Sirianni as there is toward young coaches such as Sean McVay or Kyle Shanahan, even though Sirianni (arguably) has a better résumé than either coach -- or any of his other under-50 counterparts around the NFL.\n\nLet's take a closer look. I'm not here to judge anyone's feelings toward Sirianni inside or outside of Philadelphia, but there's something interesting about this situation. Is Sirianni actually off to a historically great start to his career? Why does he attract more skepticism than other successful coaches? Is that warranted? And could the 8-2 Eagles just sub Big Dom in and get double-digit wins every season?\n\nJump to:\n\nElite track record through five years\n\nHowie's part | The roster | The assistants\n\nHis real role | Fourth down | They should be better\n\nBad-team influence | Sideline antics\n\nThe verdict: How should we view Sirianni?\n\nSirianni's Hall of Fame track\n\nJust on a sheer, simple examination of Sirianni's résumé, it seems impossible to argue with the idea that he's off to the sort of start we associate with legendary head coaches. There's nobody else in this generation who has been more successful this early in his career than 44-year-old Sirianni.\n\nLet's start with the record. In the middle of his fifth year as an NFL head coach, Sirianni is 56-22, good for a .718 winning percentage. That's roughly the equivalent of winning a little over 12 games every year in the 17-game era. The only team with a better winning percentage since Sirianni's arrival in Philadelphia is Reid's team in Kansas City, which has gone 57-21 over that same span.\n\nReid is a veteran coach with decades of experience, though. Sirianni has been this good from the moment he took over. That sort of early-career success isn't unprecedented, but it's close. Among guys with at least 60 games across their first five seasons as an NFL head coach, Sirianni's .718 win percentage is the seventh best in league history through Year 5. The people ahead of him make for impressive company: Paul Brown (.887), Chuck Knox (.779), George Seifert (.775), Don Shula (.738), George Allen (.729) and John Madden (.721). That group includes four Hall of Famers, and it's coaches who did most or all of their work before the salary cap tightened league parity.\n\nJust behind Sirianni are the likes of Joe Gibbs (.699), Mike Tomlin (.688), Jim Harbaugh (.685), Mike Ditka (.685) and McVay (.680) -- superstar coaches in more modern times. Nobody who started his NFL coaching career after 1990 has begun that career with a better winning percentage through five seasons than Sirianni's.\n\nThere's one other coach I didn't mention between Sirianni and those legendary figures in the prior paragraph. Falcons coach Mike Smith might be the lone example from the 21st century who got off to this hot of a start and didn't earn the plaudits that the other coaches listed above received. Smith went 56-24 (.700) to start his career but won only one playoff game over that five-year span. And after going 10-22 in Years 6 and 7, the Falcons fired Smith from what would be his only head coaching job. So while it's rare for a head coach with Sirianni's sort of success to be treated as something short of a savant, it isn't unprecedented.\n\nIt's tough for me to compare Sirianni to Smith, though, when factoring in postseason success. We don't know what he'll do in this season's playoffs, but Sirianni has made it to two Super Bowls in his first four seasons, winning one. He has also made it to the postseason in each of his first four years and would become just the fifth coach in league history to make it 5-for-5 if the Eagles don't collapse down the stretch (league-best 99.6% chance to make the postseason, per ESPN's Football Power Index).\n\nThe list of coaches who have made it to the playoffs in each of their first four seasons and advanced all the way to two or more Super Bowls is one person long. He's the only coach in the Super Bowl era to pull that off. Brown won titles in the pre-Super Bowl era, while Bill Cowher is the only other coach to make it to the playoffs in each of his first four years and advance to at least one Super Bowl. (The Steelers came up short to the Cowboys.) Knox, John Harbaugh and John Robinson all made it to the playoffs in each of their first four years without winning a title over that time frame.\n\nplay 1:06 When will the Eagles' offensive struggles catch up to them? Dan Orlovsky joins \"Get Up\" to explain why the Eagles' lack of separation in the pass game might eventually come back to hurt them.\n\nAt the same time, Sirianni was able to start his playoff run in Philadelphia by taking advantage of a seventh seed in 2021 that wasn't available to many other coaches in prior seasons. Even so, if we limit this to coaches who have made three playoff trips in four years, Sirianni would still be in very rarefied air. Through four full years, here are the neighborhoods in which Sirianni resides:\n\nThree or more playoff appearances, two Super Bowl appearances: Gibbs, Sirianni and Tomlin\n\nThree or more playoff appearances, one Super Bowl win: Gibbs, Sirianni, Tomlin, Bill Parcells, Doug Pederson, Seifert and Barry Switzer\n\nGibbs and Tomlin each won one of those two Super Bowls. Seifert and Switzer both inherited teams that had won the Super Bowl literally in the season before their arrival. Tomlin's Steelers had won the championship two years before he was appointed as head coach.\n\nPederson is also on this list, which seems as if it should be addressed. Did Sirianni merely inherit a great situation from the prior coach? Well, it depends on how much we're willing to discount what was a rough 2020 season. Pederson's Eagles were good to great for most of his time there. The 2016 team went 7-9, but those Eagles were analytical darlings, leading them to be on the list of teams likely to improve in 2017. They won the Super Bowl and then posted back-to-back 9-7 records in 2018 and 2019, losing in the playoffs without an injured Carson Wentz both times. (Wentz played one quarter of the loss to the Seahawks in the 2019 wild-card round.)\n\nThe 2020 Eagles were a disaster, going 4-11-1 in a putrid NFC East. Wentz melted down, first growing frustrated with the organization's decision to use a second-round pick on Jalen Hurts before falling apart behind an injury-riddled offensive line. Veterans such as Malik Jackson, DeSean Jackson and Alshon Jeffery had disappointing years, and by the end of the season, things had grown completely toxic. Seemingly stuck with a choice between Pederson and Wentz, the organization chose to move on from both, trading Wentz to the Colts and firing Pederson, three years after his Super Bowl victory.\n\nEven that 2020 team, though, was better than it seemed. The Eagles finished a hair under six expected wins by their point differential, and combined with their brutal injury luck, they ended up on the likely to improve list again in 2021. The 2021 version of the Football Outsiders Almanac projected the Eagles for 7.3 wins. Philly found something leaning into the quarterback run game with Hurts, who exceeded expectations in his first full year as a starter, and went 9-8 against an easy schedule.\n\nIt's probably fair to treat the team Sirianni inherited as somewhere between the perennial playoff visitors of 2017-19 and the slop factory that was the 2020 edition. He joined a team in the middle of a retooling, if not a complete rebuild, and got it directly back into the postseason as the 7-seed. Then the Eagles leveled up again and came within a drive of winning Super Bowl LVII. And then, after a frustrating 2023 season (which we'll get to later), Sirianni's Eagles had one of the best seasons of the past 25 years, defying skeptics like me and stomping the league en route to a blowout win in Super Bowl LIX.\n\nThere are a lot of people who deserve credit for Philly's quick rise back to prominence after that 2020 season. Sirianni does seem like one of them. Why doesn't that always seem to be the case? I can see a few reasons. Let's run through them and see why there's a disconnect between Sirianni's résumé and the perception of him.\n\nArgument 1: It's all Howie Roseman!\n\nThe common thread between the Pederson and Sirianni eras in Philadelphia, of course, is the general manager. Eagles fans have buried their memories of chanting \"Fire Howie\" at Phillies games in the spring of 2021, but there's no denying that Roseman, 50, has played a meaningful role in building Philadelphia's two Super Bowl winners over the past decade.\n\nAfter he was deposed in a power struggle with Chip Kelly before the 2015 offseason, Roseman regained personnel control and quickly rebuilt an Eagles team that went philosophically sideways during Kelly's lone year as football czar. And although the 2020 season went haywire, Roseman helped right the ship immediately with Sirianni in 2021. The Eagles got meaningful draft capital for Wentz, cleared out what had been a clogged salary cap by moving on from veteran talent and then nailed their 2021 draft, using their top three picks on DeVonta Smith, Landon Dickerson and Milton Williams.\n\nI wrote at length about Roseman before the 2024 season, when he solidified his place in Eagles history with one of the best offseasons I can remember. The Eagles landed first-team All-Pros on both sides of the ball in Saquon Barkley and Zack Baun, fixed a hole at cornerback by drafting Quinyon Mitchell and Cooper DeJean with their top two picks, and nailed both their coordinator hires by bringing in Kellen Moore and Vic Fangio. Outside of the Bryce Huff and Devin White signings, Roseman did about as much in any one window as any general manager can to propel a team toward a championship.\n\nIn that column, though, I laid out how the perception of Roseman has changed over time, even while his philosophies have not. Moving up a spot or two in the first round is great when it's for Jalen Carter and less so when the Eagles land Andre Dillard. Jumping up and using a Day 2 pick in a trade for a cornerback is brilliant when it's for DeJean, but not quite as much when Roseman grabbed Kelee Ringo. Trading a first-round pick for A.J. Brown was a masterstroke; the fact that it came only after the Eagles were left at the altar as they were about to sign future Rams free agent disaster Allen Robinson in 2022 doesn't come up quite as often.\n\nNone of this is to say that Roseman is secretly bad at his job, of course, but just to serve as a reminder of how much variance there can be from year to year with the decisions general managers make in terms of personnel. Even really smart, thoughtful front offices make mistakes, sometimes with the most important decisions they'll make all offseason. General managers aren't as good as they look at their best and aren't as bad as they look at their worst.\n\nplay 2:06 Graziano: Eagles' O will have tougher time scoring without Lane Johnson Dan Graziano, Jeff Saturday and Domonique Foxworth explain why offensive tackle Lane Johnson's Lisfranc injury is a big deal for the Eagles.\n\nAnd when Roseman hired Sirianni, it's absolutely fair to say that the perception surrounding the longtime general manager was more toward the latter category than the former. The Eagles had just drafted Jalen Reagor ahead of Justin Jefferson in the first round of the 2020 draft. Roseman had been criticized for the decision to use a second-round pick on Hurts while Wentz was still on the roster, a move that had seemingly unsettled one star quarterback while landing a player some people didn't see as an NFL-caliber passer. Hurts struggled badly for most of his brief run after taking over for Wentz that season before famously being removed in the final game for Nate Sudfeld.\n\nThere was even a subset of the fan base who thought the real mastermind behind Philly's success had been Joe Douglas, who had left to become the Jets' general manager in 2019. (Douglas is now back in Philadelphia as senior personnel director.)\n\nThat 2020 team was in rough shape for other reasons. The Eagles had traded significant draft capital over the prior few seasons in deals for the likes of Ronald Darby, Jay Ajayi, Michael Bennett, Golden Tate and Darius Slay. And though some of those moves paid off during the title runs, the Eagles made only five picks in 2018 and 2019. The 2020 class didn't make much of an impact and would end up being disappointing outside of Hurts, who single-handedly redeemed picks on the likes of Reagor and Davion Taylor. And the contracts the Eagles had handed out after the Super Bowl victory to players such as Jeffery and Nigel Bradham hadn't aged well.\n\nThe hit rate has been much higher since 2021, in terms of draft picks and free agent signings. Roseman has parlayed trades with the Colts, Dolphins and Saints into significant extra draft capital, which has helped mitigate some of the cost of moving up and around on draft day and adding guys such as Brown and Jaelan Phillips via trades. Roseman obviously deserves credit for the picks and acquisitions the Eagles have made.\n\nBut doesn't Sirianni, too? We know that drafting is an almost impossible exercise, and where players land can have a significant impact on their chances of succeeding at the NFL level. The most important pick Roseman has made over the past five years is Hurts, and after struggling badly in his rookie season, Hurts made astronomical strides as a passer and became one of the league's most valuable quarterbacks under his head coach. Maybe that happens without Sirianni, but it seems realistic to ascribe at least some of the credit for the roster development and the success rate of the players Roseman has brought into the organization to his coach.\n\nArgument 2: Anyone can win with this much talent ...\n\nThere's no arguing that the Eagles are loaded. Roseman built one of the league's most exciting young cores on defense through the draft, which has allowed the organization to build the most expensive offense in NFL history in terms of cash spending during the 2023 and 2024 seasons. The Eagles have Pro Bowl-or-better talent at 10 of their 11 starting spots on offense, even if injuries and inconsistency mean all of those guys aren't always on the field and playing at that level simultaneously.\n\nThere are also coaches who clearly benefit from being tied to an elite quarterback. Zac Taylor went 40-27 between 2021 and 2024, but I don't think there were many people who attributed that success to Taylor as opposed to sending the majority of the credit to Joe Burrow. Mike McCarthy's win-loss record was more about Aaron Rodgers than whatever schemes the veteran coach was cooking up. Sirianni, on the other hand, has a quarterback who seemingly only Eagles fans believe is an elite quarterback. Hurts consistently wins games, but he also routinely ends up out of the top 10 when media members and even league insiders rank the best quarterbacks in football. I would argue Hurts is underrated, but this isn't a case where the public perception is that Sirianni has been carried by his QB to a gaudy record.\n\nAll of ESPN. All in one place. Watch your favorite events in the newly enhanced ESPN App. Learn more about what plan is right for you. Sign Up Now\n\nLet's be realistic here. No coach is going to win in the NFL without talent. Ask Bill Belichick the coach about what happened once Bill Belichick the general manager wasn't hitting on his draft picks or finding starters on the back of other teams' rosters every year. No coach was going to make Reagor a better wide receiver than Jefferson or coax great play out of Sudfeld. We'll never get to see what Hurts' career might have looked like after Year 1 under a different coach, or whether guys like Carter or DeJean might have become superstars just as quickly under the vast majority of other coaches.\n\nThere are plenty of veterans who have left other teams to join the Eagles under Sirianni, though, and it seems entirely fair to recognize how many of them got better after joining the Eagles (and/or got worse after leaving the organization). Some notable additions:\n\nDoes every free agent addition work out? Of course not. Don't ask Eagles fans about Huff or Nicholas Morrow. Does every player who leaves immediately struggle? No. Josh Sweat and Milton Williams are having great years away from Philadelphia. But there is a meaningful and significant number of players the Eagles have added who have elevated their game in green and white.\n\nIs that a product of great coaching? Sure! Is that a product of Sirianni's coaching? Well ...\n\nArgument 3: It's the other coaches\n\nSirianni has not lacked for notable assistant coaches during his time in Philadelphia, in part because teams keep hiring his coordinators away for head coaching roles after the Super Bowl appearances. Shane Steichen and Jonathan Gannon both earned lead jobs in Indianapolis and Arizona, respectively, after the 2022 season. Kellen Moore was one-and-done after landing the head coaching job in New Orleans. And Sirianni inherited legendary offensive line coach Jeff Stoutland from the Kelly and Pederson regimes, giving him one of the most respected and impactful positional coaches in football.\n\nAt the same time, it would be silly to pretend that all of the moves have panned out. Brian Johnson and Sean Desai were overmatched in the 2023 season, and Sirianni made the decision to promote Matt Patricia into the defensive playcaller role, which only made things worse. Kevin Patullo has quickly been blamed for the struggles of the 2025 offense, and given that both Johnson and Patullo were internal promotions from Sirianni's staff, the head coach has also borne some of the blame for either hiring the wrong guy or not being able to fix the offensive consistency issues himself.\n\nIt has been easy to credit other coaches for some of the successes I mentioned earlier. Fangio gets credit for having the vision to move Baun back to linebacker while molding Mitchell and DeJean into instant standouts at cornerback. Stoutland has brought Becton and the young offensive linemen through, which opened up holes for Barkley. Steichen's quarterback run scheme got the most out of Hurts. All of those things are true!\n\nAnd yet, it seems remarkable to believe that Sirianni didn't really have anything to do with any of those improvements. The Eagles' offense has always had elements of what Sirianni ran under Frank Reich in Indianapolis. They made major midseason improvements in 2021 (when they completely flipped the offense and leaned heavily into the run on early downs in October) and 2024 (when DeJean entered the starting lineup during the Week 5 bye and the defense went from being one of the worst to one of the best).\n\nAt the same time, Sirianni credited some of the 2021 improvement to Steichen taking over some of the playcalling responsibilities before ceding that job entirely to Steichen in 2022. Moore was the primary playcaller in 2024, although Sirianni admitted to calling plays from time to time. Sirianni has taken blame for some of the failings of the offense when it hasn't worked, which can be both a reflection on his performance and something many coaches believe to be sound leadership.\n\nAnd of course, when things haven't worked, it's fair to wonder if Sirianni has had the answers. The 2023 team faded badly down the stretch, although its problems were much worse on the defensive side of the ball than on offense. The offense has been frustrating for much of 2025, bailed out by the defense. (Though in a year of almost weekly remonstrations by fans, media members and Eagles players, the offense is still 15th in EPA per play.)\n\nAll of those things can simultaneously be true. It seems notable that Sirianni has continued to win and will likely make it to the playoffs in each of his first five seasons despite having the same offensive and defensive coordinator just once in back-to-back years. Steichen has had a great year in Indianapolis, but it's the first year where either he, Moore or Gannon has looked like an elite head coach since leaving the Eagles.\n\nAnd while those coordinators looked great after leaving the Eagles, things weren't as impressive going in. Steichen joined the Eagles after leaving the Chargers, where fans didn't want him to stick around and pinned Justin Herbert's development on Pep Hamilton. Gannon had never been a coordinator before and was wildly unpopular during his first season with the team, with Eagles fans furious about the defense's passivity and the coordinator's comment that he doesn't have a scheme. (He did.)\n\nplay 1:52 Stephen A.: The Eagles' defense beat the Lions down Stephen A. Smith details why he was impressed with the Eagles' defense after a dominant performance against the Lions.\n\nEven the imports who won the title in 2024 had question marks. Moore had essentially been fired in consecutive years by the Cowboys and Chargers before joining the Eagles, and while I felt those moves were unwarranted, Moore had a reputation as being too cute in playcalling or leaning too heavily into the pass.\n\nFangio's reputation around the league is legendary, but he had struggled as a head coach in Denver before being fired after one season in Miami, where the players openly celebrated his departure. Jevon Holland contrasted new coordinator Anthony Weaver to Fangio by saying the difference from the former was that Weaver was \"a good person,\" while Holland's father compared Fangio to the iPhone 1.\n\nSirianni didn't teach Fangio how to coach a defense, nor did he explain how running the ball worked to Moore. Is it possible that the combination of Fangio and Sirianni or Moore and Sirianni made those coaches better than they had been elsewhere, just as players also improved after coming into contact with the Eagles coach? That only seems realistic to me.\n\nArgument 4: We're not really sure what he does here\n\nI can see a case for this one, but I'd also argue that it's partly perception. Sirianni wasn't widely regarded as a hot young coaching candidate before joining the Eagles. He's an offensive mind who didn't call the plays in Indianapolis and hasn't been the primary playcaller since Year 1 in Philly.\n\nIf fans can't pin you to great plays on the offensive or defensive side of the ball, there isn't going to be much in the way of your visible impact on game day. Sirianni doesn't help by being (likely deliberately) muddled when he discusses his role within the offense. It's his scheme, but it's also the coordinator's scheme. Sirianni doesn't call plays, but he has a voice, and sometimes, he does call plays. That might work fine in the building, but that uncertainty is going to lead to complaints about Sirianni when the offense does struggle.\n\nOf course, there's more to building an offense (or a defense) than playcalling on Sundays, and it would be a shock if Sirianni didn't have a meaningful role there behind the scenes in terms of offensive architecture, infrastructure and game planning, as he did in Indianapolis. Players like Jason Kelce and Lane Johnson have raved about his work in helping review film during the week. Managing player emotions and usage, a delicate role for a team that has employed players like Brown and Gardner-Johnson over the past few years, also falls under Sirianni's purview. Fans don't see any of that, but there's much more to being a head coach than simply calling plays on Sundays.\n\nThere's one other thing Sirianni does very clearly have control over on Sundays and hasn't won him any fans in recent weeks ...\n\nArgument 5: He's wild on fourth down\n\nWhenever I hear smart coaches like McVay talk about analytics and how they let the \"flow of the game\" determine their calls, I sigh. Individual game dynamics might matter, but you can bake them into a decision-making model. Coaches are also great at seeing what the flow of the game has been, but they're not necessarily better than a model about predicting what the flow of the game is going to be. The Bears went against the numbers and punted to J.J. McCarthy up six in Vikings territory on Sunday, surely because McCarthy had looked awful for most of the day; he promptly marched down the field for a touchdown to take the lead. Football's a strange game.\n\nBreaking news from Adam Schefter Download the ESPN app and enable Adam Schefter's news alerts to receive push notifications for the latest updates first. Opt in by tapping the alerts bell in the top right corner. For more information, click here.\n\nMore than anything, though, the frustrating thing about coaches making excuses for why their particular game or situation caused them to ignore what the evidence suggested is that it's almost always an excuse to be more conservative or traditional. Ninety-nine times out of 100, when a coach says that the numbers might have said something but didn't tell the whole story, it's so they can do the more comfortable or familiar thing.\n\nA coach might say that their team failed on an earlier play in short yardage, that the weather was sloppy or that their defense was playing well as an excuse to punt or kick when the numbers said to be aggressive. You'll almost never hear them say the opposite -- that the numbers said to punt or kick, but since their team had been dominating in short yardage, the weather was great or since their offense had been so good all day, they ignored the numbers and were more aggressive than what the data suggested. If the coach is adjusting for the flow of the game, theoretically, they should be doing both.\n\nWell, Sirianni is one of the exceptions to that rule. I don't always support every decision, but you can't argue that the Eagles coach is very comfortable being aggressive. Two weeks ago against Green Bay, the Eagles tried to end the game by converting a fourth-and-6 from the Packers' 35-yard line with 33 seconds to go, a move both traditional observers and ESPN Analytics hated. Last week against Detroit, they failed on a fourth-and-1 from their own 29-yard line with three minutes to go while up by 10 points, a move that was much more defensible by the various models I've seen, if uncommon.\n\nI would suspect very strongly that Sirianni's aggressiveness is supported by the organization. The Eagles have been one of the most analytically inclined organizations from ownership on down over the past two decades. And while there were criticisms of Sirianni's decisions when they didn't work, that logic doesn't always stand up to scrutiny. Should Sirianni have trusted his defense and punted (or attempted a field goal) from the 35-yard line in a low-scoring game down six? Maybe. Wouldn't trusting your defense, though, be trusting that it can defend on a short field if the team doesn't pick up the first down? Indeed, the Eagles held up to win.\n\nWhile those moves didn't work, Sirianni's aggressiveness has paid off at times. Since 2021, Sirianni has added 43.7 points of EPA with his decisions on fourth down, the second most of any team in the NFL behind the Lions. Some of that is a product of the tush push, of course, but the Eagles both developed, perfected and have come to exploit the tush push under Sirianni. Great short-yardage teams in the past, like the Cam Newton-era Panthers, didn't get the most out of their schematic advantage.\n\nEven if we just focus on fourth-and-3 or more to take the tush push out of the equation, the Eagles are fifth in decision EPA and win probability created on fourth-down offensive plays over the past four years. Sirianni has generally been a positive on fourth downs for the Eagles, who famously went for (and converted) a fourth-and-goal from the 1-yard line at the end of the first half against the Patriots in the Super Bowl under Pederson. The aggressiveness is a feature, not a bug.\n\nplay 1:00 Yates: Jalen Hurts is a still a top-10 QB in Week 12 Field Yates details the rough fantasy stretch Jalen Hurts has been on, but says Hurts is still a top-10 quarterback against the Cowboys.\n\nArgument 6: The Eagles aren't as impressive as they should be\n\nThis season, the Eagles have struggled to separate from their competition at times, leading to a series of frustrating second halves and close fourth quarters in games they could or should be dominating. They became one of the many teams to blow a late lead to the Broncos this season. Even last year, during a much more dominant campaign, the Eagles lost to the Falcons and nearly blew leads against the Browns and Jaguars, two of the worst teams in football.\n\nOn the whole, though, have the Eagles lacked a killer instinct under Sirianni? Not really. Since the start of 2021, they have the fourth-best point differential. Their wins have been by an average of more than 11 points, which is 13th. The Cowboys are No. 1 by that metric over that same time frame, though, so I'm not sure I'd treat margin of victory in wins as a foolproof measure of how great a team is putting away opponents in meaningful moments. And it's unclear how much the betting market actually believes the Eagles suffer from this problem, but it doesn't show up there, either. The Eagles outperform the spread in their games by an average of just over one point, which is seventh in the league since the start of 2021.\n\nAnd of course, the Eagles have come up with decisive victories when things matter most. Sirianni's team has four playoff wins by three scores or more since he has taken over: the 38-7 and 31-7 victories over the Giants and 49ers in the NFC playoffs in 2022, respectively, and the 55-23 and 40-22 wins over the Commanders and Chiefs, respectively, to seal up the Super Bowl in 2024. They've also lost a pair of playoff games by 16 and 23 points to the Bucs, but the good outweighs the bad here.\n\nArgument 7: When they were bad, it poisoned the well of public opinion\n\nI do think there's some truth to this one. I don't recall there being much criticism or frustration toward Sirianni through the first 2½ years of his tenure, when the Eagles had made it to the Super Bowl and started Year 3 by going 10-1. There were underlying factors to be concerned about, but Sirianni had gone 32-8 in his prior 40 games. The Eagles were flying high.\n\nAnd then, well, everything collapsed in ugly fashion. The Eagles got blown out by the 49ers and suddenly couldn't stop losing. They lost five of their final six games, falling to teams like the 6-11 Giants and 4-13 Cardinals along the way. The defense looked hopelessly lost, and Sirianni's move to promote Patricia was widely panned. The Eagles blew a comfortable lead in the NFC East, and when they went on the road to Tampa Bay in the wild-card round, the Bucs beat them 32-9.\n\nIt was a roller coaster of a season, and it felt like Sirianni was along for the ride instead of being the person at the controls. Every coach has a bad game or two, but for a guy who has the sort of résumé we mentioned earlier, losing the plot so quickly and significantly without having to turn to a third-string quarterback or dealing with a brutal stack of injuries felt disqualifying. There were legitimate concerns that the Eagles were going to fire Sirianni, one year removed from a Super Bowl, despite the fact that he had gone 34-17 over his first three years in charge.\n\nDid that create a perception that Sirianni wasn't cut out for the role? Maybe. He obviously responded with the best possible season by winning the Super Bowl, but the credit mostly went elsewhere, to the players and Roseman and Moore and Fangio. They all deserve their plaudits for a fantastic year, but it felt like Sirianni's reputation was only rehabilitated to a certain level by the title win. And now, in a year when the Eagles are 8-2, it feels like public perception holds that the coach is the one holding the team back.\n\nHave other great coaches endured that sort of collapse? Sure. In reverse, Reid's Chiefs started 1-5 with a healthy Alex Smith in 2015 and then won 10 straight to finish the season. Tomlin's Steelers dropped from 8-2 to 10-7 a year ago. Jim Harbaugh's 49ers were 7-4 in 2014, lost four of their final five games and missed the playoffs, and Harbaugh lost his power struggle with Trent Baalke and sent the team into the coach carousel. It happens, although perhaps not as dramatically as it did for Sirianni.\n\nArgument 8: His sideline demeanor is bad\n\nI also, unfortunately, think it's this one. I'm not sure how NFL coaches are supposed to act, but I can certainly say that Sirianni's personality and histrionics as they come through on the sideline don't do him any favors. It feels like Sirianni is constantly trying to work the refs and overreacting when things don't go his or the Eagles' way. He feels a little more like a college basketball coach in that way than the demeanor you might typically think of with great NFL coaches (with someone like Jim Harbaugh as a rare exception). Belichick could be gruff and yell at the refs, of course, but he also gave off the vibe of having prepared for every single scenario. Sirianni seems more like the guy who's mad the dealer didn't give him the card he asked for in blackjack.\n\nDoes that matter? Not to me. It's mostly a product of perception. I'm reminded of what Baker Mayfield said a few weeks ago, about how he has never changed as a pro or as a person, but how the same attitude that was perceived as cocky or immature earlier in his career when he was struggling is now seen as moxie or being a dog because he's playing better and on a winning team.\n\nIs the same not true for Sirianni? I'm not sure he's appreciably different now than he was on the sideline a few years ago. In the times when Eagles fans have seen him as a great coach, Sirianni's behavior and personality have been tough, authentic and blue-collar, a representation of what the people in the stands want from the people representing them on the field. When the Eagles have disappointed, that same attitude has been unbecoming or childish.\n\nplay 1:32 Should fantasy managers start DeVonta Smith after a tough Week 11? Daniel Dopp breaks down the fantasy pros and cons for DeVonta Smith heading into Week 12.\n\nShould Sirianni have yelled at his own fans? Probably not. (I'm not sure Belichick was even aware that the Patriots had fans.) But that came at a point in the year where the Eagles were 3-2, having just been blown out by the Bucs before struggling with the Browns. Sirianni was 4-8 in his prior 12 games. If that same back-and-forth had happened in Week 16, with the Eagles having gone on a long winning streak, or in the divisional round, where the Eagles overcame a late comeback from the Rams in the snow, would there have been the same outrage about Sirianni's behavior? I'm very skeptical.\n\nSo ... how should we view Sirianni?\n\nI think Sirianni is a very good coach with pretty bad PR, some of which is self-inflicted. There's great infrastructure in Philadelphia, which goes a long way, but you have to really contort yourself to credit everyone around Sirianni for the Eagles' success without giving the head coach a meaningful dollop of praise for what the organization has accomplished since he was hired.\n\nIn terms of comparable coaches? Two come to mind. One on résumé alone is Joe Gibbs. Like Sirianni, Gibbs took over an organization in the Northeast that had generally been successful, only to change paths after one disappointing season. Gibbs was a 41-year-old first-time head coach with three years of coordinator experience, leaving him one year older than Sirianni when he took over. He coached a Washington team built around the offensive line and whose line coach (Joe Bugel) earned more praise than just about any other positional coach in football for what he did.\n\nGibbs won a title in his second season, but that was in a strike-shortened, nine-game campaign. Washington made it to the Super Bowl the following year, only to be blown out by the Raiders. It took Washington three years to win another playoff game, but with time, Gibbs proved himself to be a legendary coach, winning three Super Bowls across a 16-year career. Their personalities on the sideline couldn't be much different, but Sirianni's résumé most closely matches with Gibbs.\n\nThe other coach might be John Harbaugh, who has never necessarily gotten the credit he deserved for being so consistently successful in Baltimore. Like Sirianni and Gibbs, Harbaugh took over a lauded team after one disastrous, disappointing season. Much of the infrastructure was already in place to succeed. And some of the things people don't like about Harbaugh (typically his aggressiveness on fourth down) are something close to an organizational mandate, one Harbaugh typically has to wear in front of the public when things go wrong.\n\nBecause Harbaugh was hired away from the Eagles as a special teams coach, he doesn't call plays on game day, which also leads to murmurs about not understanding what he does or why he's so valuable to the Ravens. There's a reason, though, that Baltimore has been consistently successful throughout Harbaugh's tenure, even as the Ravens faded out of the Ray Lewis and Ed Reed era and into that of Lamar Jackson & Co.\n\nSirianni is only in Year 5, but unless he decides to quit or things completely collapse, he should be around for the next generation of Eagles football. By then, the fans might even like him again.",
  "summary": "The Eagles' head coach is 56-22 over five seasons, including two trips to the Super Bowl. Yet he's constantly under the microscope. Why?",
  "published": "Thu, 20 Nov 2025 13:28:03 EST",
  "url": "https://www.espn.com/nfl/story/_/id/47011446/2025-nfl-season-philadelphia-eagles-nick-sirianni-scrutiny-coaching-super-bowl",
  "source": "www.espn.com - TOP"
}