{
  "title": "Ariana Grande contracts Covid during Wicked: For Good press tour",
  "text": "Ariana Grande has tested positive for Covid amid the whirlwind press tour for Wicked: For Good, precluding some promotional appearances in New York.\n\nThe Grammy award winner and Oscar nominee posted an Instagram story on Thursday captioned “moments before Covid” along with a photo from her appearance on The Tonight Show With Jimmy Fallon from earlier this week. Grande, who plays Galinda/Glinda in the second part of Jon M Chu’s film adaptation of the hit Broadway musical, will reportedly miss a few upcoming press appearances, including a slot on The Kelly Clarkson Show.\n\nBoth Grande and Cynthia Erivo tested positive for Covid during the filming of the first movie, temporarily delaying production. Erivo reportedly contracted the virus days before shooting the climactic first-act number Defying Gravity, while Grande tested positive before filming the song Popular.\n\nGrande’s positive test was the latest hiccup for the full-court Wicked press blitz that has seen the cast hop continents by the day. Due to flight delays, Grande was unable to make the premiere in Brazil, triggering fan backlash she also addressed on her Instagram.\n\nDuring the tour’s stop in Singapore, a man jumped the barricades and attempted to grab Grande. Erivo immediately intervened, and the man was restrained by security.\n\nJohnson Wen, a 26-year-old Australian national with a history of disrupting public events and rushing stages, was summarily convicted of being a public nuisance and sentenced to nine days in jail.\n\nAn earlier this week, both Grande and Erivo skipped red carpet interviews at the film’s New York premiere after the latter lost her voice. (Grande decided to abstain from interviews in solidarity.)\n\nWicked: For Good is expected to break the first movie’s box office record for the opening weekend for a movie based on a Broadway musical; it made over $112.5m over US Thanksgiving weekend in November 2024. The second installment is tracking for an opening weekend north of $150m-$180m from 4,000 North American theaters, potentially giving it the best opening of the year, over A Minecraft Movie, which made $162m on its opening weekend in April, or the Lilo & Stitch live-action remake that made $146m in May.\n\nWicked: Part One went on to make $758m worldwide, making it the most successful film adaptation of a Broadway musical of all time. Both Grande and Erivo were nominated for Oscars for their roles as two unlikely best friends in a prequel to Frank L Baum’s The Wizard of Oz.\n\nIn a positive review for the Guardian, Peter Bradshaw praised Grande, who “is, as ever, delicate and doll-like as Glinda, though with less opportunity for comedy”, and called Erivo a “superstar among equals … bringing her black-belt screen presence to the role of Elphaba, and revealing a new vulnerability and maturity”.",
  "summary": "<p>Oscar-nominated star of two-part musical forced to cancel press stops as film is predicted to deliver year’s biggest box office opening</p><p><a href=\"https://www.theguardian.com/music/ariana-grande\">Ariana Grande</a> has tested positive for Covid amid the whirlwind press tour for Wicked: For Good, precluding some promotional appearances in New York.</p><p>The Grammy award winner and Oscar nominee posted an Instagram story on Thursday captioned “moments before Covid” along with a photo from her appearance on The Tonight Show With Jimmy Fallon from earlier this week. Grande, who plays Galinda/Glinda in the second part of Jon M Chu’s film adaptation of the hit Broadway musical, will reportedly miss a few upcoming press appearances, including a slot on The Kelly Clarkson Show.</p> <a href=\"https://www.theguardian.com/film/2025/nov/20/ariana-grande-covid-wicked-for-good-press-tour\">Continue reading...</a>",
  "published": "Thu, 20 Nov 2025 20:26:28 GMT",
  "url": "https://www.theguardian.com/film/2025/nov/20/ariana-grande-covid-wicked-for-good-press-tour",
  "source": "The Guardian"
}