{
  "title": "White House condemns Democratic lawmakers' video but backs off Trump's posts",
  "text": "White House condemns Democratic lawmakers' video but backs off Trump's posts\n\ntoggle caption Andrew Caballero-Reynolds/AFP via Getty Images\n\nWhite House press secretary Karoline Leavitt said Thursday President Trump does not actually want to see members of Congress executed despite his social media post earlier in the day, calling a video by some members \"seditious behavior, punishable by DEATH!\"\n\nTrump made a pair of posts on his site, Truth Social, in response to a video posted by Reps. Jason Crow, D-Colo., Chris DeLuzio, D-Pa, Maggie Goodlander, D-N.H., and Chrissy Houlahan, D-Pa., and Sens. Mark Kelly, D-Ariz., and Elissa Slotkin, D-Mich., where the lawmakers address members of the military and intelligence communities and said, \"You can refuse illegal orders,\" repeating the phrase several times before saying, \"You must refuse illegal orders.\"\n\nSponsor Message\n\nThe lawmakers, all of whom come from military backgrounds, said, \"This administration is pitting our uniformed military and intelligence community professionals against American citizens.\" The video, posted to Facebook, also says \"right now the threats of our Constitution aren't just coming from abroad but right here at home.\"\n\nAsked during the daily White House briefing if he wanted execute members of Congress, Leavitt said: \"No.\"\n\n\"The sanctity of our military rests on the chain of command, and if that chain of command is broken, it can lead to people getting killed. It can lead to chaos, and that's what these members of Congress who swore an oath to abide by the Constitution are essentially encouraging,\" Leavitt said.\n\nThe president also reposted a series of comments from users on Truth Social, including posts that said the Democrats should be hanged, the actions were an insurrection and they should all be indicted because of the video.\n\nIn the video Democrats didn't call out any specific actions that military or intelligence officials have been told to carry out, but they said that the Trump administration is \"pitting our uniformed military and intelligence community professionals against American citizens.\" They added that military and intelligence personnel swore an oath to protect and defend the Constitution.\n\nSponsor Message\n\n\"Right now the threats to our Constitution aren't just coming from abroad, but right here at home,\" they said. \"No one has to carry out orders that violate the law or our Constitution.\"\n\nThey ended the video by telling those in the military and intelligence officials, \"Don't give up the ship,\" referring to the famous last words of James Lawrence, a Navy Captain during the war of 1812, to keep fighting and not surrender.\n\nMembers of the military do swear an oath to the Constitution and are trained that \"following orders\" is not a defense for illegal acts.\n\nThe lawmakers issued a joint statement to Trump's response, saying in part, \"We are veterans and national security professionals who love this country and swore an oath to protect and defend the Constitution of the United States. That oath lasts a lifetime, and we intend to keep it. No threat, intimidation, or call for violence will deter us from that sacred obligation.\"\n\n\"Every American must unite and condemn the President's calls for our murder and political violence. This is a time for moral clarity,\" they said.\n\nHouse Democratic leadership — House Minority Leader Hakeem Jeffries, of New York, whip Katherine Clark of Massachusetts and Caucus Chair Pete Aguilar of California — called for Trump to remove the posts and for Republicans to condemn them.\n\n\"We unequivocally condemn Donald Trump's disgusting and dangerous death threats against Members of Congress and call on House Republicans to forcefully do the same,\" they wrote.\n\n\"We have been in contact with the House Sergeant at Arms and the United States Capitol Police to ensure the safety of these Members and their families,\" the statement adds. \"Donald Trump must immediately delete these unhinged social media posts and recant his violent rhetoric before he gets someone killed.\"\n\nTrump hasn't deleted the social media posts.",
  "summary": "The Democratic lawmakers said that members of the military can and must refuse illegal orders by their superiors.",
  "published": "Thu, 20 Nov 2025 13:23:08 -0500",
  "url": "https://www.npr.org/2025/11/20/nx-s1-5615190/trump-democrats-military-video-seditious",
  "source": "NPR Topics: News"
}