{
  "title": "One day of planning went into Covid school closures, inquiry hears",
  "text": "One day of planning went into Covid school closures, inquiry hears\n\n29 September 2025 Share Save Vanessa Clarke Education reporter Share Save\n\nGetty Images\n\nThe government did not start planning for the closure of schools until the day before the decision was made, the Covid-19 inquiry has heard. Up until 16 March 2020, focus had been on keeping schools open, so there were no contingency plans in place, according to evidence given by the former education secretary Gavin Williamson. Sir Gavin described a \"discombobulating 24-hour sea change\" in his written evidence, counsel to the inquiry Clair Dobbin KC said. Her opening statement came on the first day of the eighth session of the Covid inquiry, which will look at the impact of the pandemic on children and young people across the UK.\n\nThe inquiry also heard that Sir Gavin felt the closure of schools in January 2021 was \"not required\", but was \"a panicked decision made without children's interests front and centre\". However, Boris Johnson has rejected that description of the decision, with both due to be asked about it later in the session, Ms Dobbin told the inquiry. \"It is significant that there should be any dispute about whether planning for so seismic an event existed,\" she said. The Welsh government acknowledged there was \"inadequate planning\" to close schools, and the Scottish government has said there was also \"limited preparedness\".\n\nGetty Images Boris Johnson announced schools were closing in March 2020 and January 2021\n\nChair of the inquiry Baroness Hallett opened the session by saying the impact of the pandemic on children was \"severe and, for many, long-lasting\". Over the next four weeks, the inquiry will look at: The disruption to education\n\nChildren's emotional wellbeing and social interactions due to isolation\n\nHow the physical health and access to healthcare of children were impacted\n\nThe experiences of those with conditions like long Covid\n\nHow the role of professionals like social workers changed Questions are also expected to be asked about whether there is a link from the pandemic to the current high rates of absence in schools, and why so few vulnerable children attended school during the first lockdown. The decision about what services to close or open \"often prioritised adults or the economy over children's wellbeing\" with \"playgrounds closed in some areas while pubs were open\", Steve Broach KC, who was representing children's rights organisations, told the inquiry. Schools were closed to all pupils except those of key workers and vulnerable children for two periods during 2020 and 2021.",
  "summary": "This part of the inquiry is looking at the impact the pandemic had on children and young people.",
  "published": "Mon, 29 Sep 2025 16:31:19 GMT",
  "url": "https://www.bbc.com/news/articles/c9dx6ey37y3o?at_medium=RSS&at_campaign=rss",
  "source": "BBC News"
}