{
  "title": "Study: Kids’ drip paintings more like Pollock’s than those of adults",
  "text": "Not everyone appreciates the artistry of Jackson Pollock’s famous drip paintings, with some dismissing them as something any child could create. While Pollock’s work is undeniably more sophisticated than that, it turns out that when one looks at splatter paintings made by adults and young children through a fractal lens and compares them to those of Pollock himself, the children’s work does bear a closer resemblance to Pollock’s than those of the adults. This might be due to the artist’s physiology, namely a certain clumsiness with regard to balance, according to a new paper published in the journal Frontiers in Physics.\n\nCo-author Richard Taylor, a physicist at the University of Oregon, first found evidence of fractal patterns in Pollock’s seemingly random drip patterns in 2001. As previously reported, his original hypothesis drew considerable controversy, both from art historians and a few fellow physicists. In a 2006 paper published in Nature, Case University physicists Katherine Jones-Smith and Harsh Mathur claimed Taylor’s work was “seriously flawed” and “lacked the range of scales needed to be considered fractal.” (To prove the point, Jones-Smith created her own version of a fractal painting using Taylor’s criteria in about five minutes with Photoshop.)\n\nTaylor was particularly criticized for his attempt to use fractal analysis as the basis for an authentication tool to distinguish genuine Pollocks from reproductions or forgeries. He concedes that much of that criticism was valid at the time. But as vindication, he points to a machine learning-based study in 2015 relying on fractal dimension and other factors that achieved a 93 percent accuracy rate distinguishing between genuine Pollocks and non-Pollocks. Taylor built on that work for a 2024 paper reporting 99 percent accuracy.\n\nNor is Taylor the only one to find hidden physics in Pollock’s masterpieces. In 2011, an interdisciplinary article in Physics Today examined Pollock’s use of a “coiling instability” in his paintings. This is basically a mathematical description for how a viscous fluid folds onto itself like a coiling rope—just like pouring cold maple syrup on pancakes. The patterns that form depend on how thick the fluid is (its viscosity) and how fast it’s moving. Thick fluids form straight lines when being spread rapidly across a canvas but will form loops and squiggles and figure eights if poured slowly.",
  "summary": "The splatter master was more clumsy than graceful in his movements, which are key to his distinctive style.",
  "published": "Thu, 20 Nov 2025 05:00:26 +0000",
  "url": "https://arstechnica.com/science/2025/11/study-kids-drip-paintings-more-like-pollocks-than-adults/",
  "source": "Ars Technica - All content"
}