{
  "title": "Bihar: Nitish 10.0 takes oath; BJP gets 14 ministerial berths, JDU bags 8",
  "text": "JDU inducts only 8, none from core Kushwaha base, raises eyebrows\n\nNEW DELHI/PATNA: As the swearing-in ceremony ended at Patna's Gandhi Maidan Thursday, CM Nitish Kumar took PM Modi 's hand and lifted it with his to greet a large cheering crowd, marking the new dynamic in their relationship since the JDU president rejoined NDA in Jan 2024.The transformation could not have been starker compared to their headline-grabbing photo-op in 2009 at a NDA rally in Ludhiana, which brought out the JDU chief's unease with the then Gujarat CM.The sight at Gandhi Maidan was a metaphor of the ease in their ties, emphasised in the presence of Modi, Union ministers Amit Shah and Rajnath Singh besides the gamut of chief ministers from BJP and allies.Nitish took oath along with 26 ministers, 14 from BJP, eight from JDU and four from three other allies as NDA looked to accommodate a diverse social coalition in an acknowledgement of its varied support base. They include three women and 10 first-timers, including seven from BJP, with the party rewarding its traditional voting bloc and new additions, while JDU has repeated its old hands, most of whom seen as long trusted aides of Nitish.The sea of saffron and BJP flags were punctuated with the green of JDU and flags of other allies at Gandhi Maidan, with chief ministers from the governing alliance turning up to lend political grandeur to an occasion seen as a high watermark for Nitish Kumar.PM Narendra Modi's gesture of waving gamcha at the end of the ceremony captured the triumphant mood.The PM later lauded the new dispensation as a wonderful team that would take the state to new heights. \"Congratulations to Shri Nitish Kumar Ji on taking oath as Bihar's chief minister. He is an experienced administrator with a proven track record of good governance for many years,\" he said.While JDU's decision to induct only eight of its legislators, none from its core base of Kushwahas, into the government raised a few eyebrows, sources said the party would have more deliberation to fill in its quota when the Nitish cabinet, which can have a maximum strength of 36, is expanded, a neta said.Eight upper castes, six OBCs, seven EBCs, five Dalits and one lone Muslim in JDU MLA Zama Khan make up the new govt. Rajputs, whose share in the new assembly is the highest at 33 MLAs, have the maximum representation followed by two each from Bhumihars, Yadavs, Kurmis, including Nitish, Kushwahas and Nishads.BJP MLAs Samrat Choudhary, an OBC Kushwaha, and Vijay Kumar Sinha, an upper caste Bhumihar, have been retained as deputy CMs.RLM supremo Upendra Kushwaha turned to his son Deepak Prakash, who has little public profile and is not currently a member of either of the two legislators, to be his party's lone representative in govt. Kushwaha's wife Snehlata Kushwaha was elected an MLA in the poll.Santosh Kumar Suman, son of Union minister Jitam Ram Manjhi, will continue to represent HAM(S).BJP rewarded former Union minister Ram Kripal Yadav, a veteran of many difficult electoral battles who vanquished RJD's Ritlal Yadav in Danapur where party supremo Lalu Prasad Yadav held a rare roadshow, by inducting him as a minister.Its new faces include Shreyasi Singh, a former professional shooter, Sanjay Singh Tiger, and Rama Nishad. Nishad is the wife of Ajay Nishad, a former BJP MP who contested and lost on the Congress ticket in the 2024 Lok Sabha election, and her inclusion spotlights the party's efforts to cultivate Nishads, an important swing voting bloc in parts of the state.Old BJP hands like Mangal Pandey, Nitin Nabin and Dilip Jaiswal, who is also the state party president, joined seasoned JDU ministers like Bijendra Yadav, Shrawon Kumar, Vijay Kumar Chaudhary, Leshi Singh and Ashok Choudhary in govt.",
  "summary": "",
  "published": "Fri, 21 Nov 2025 04:17:38 +0530",
  "url": "https://timesofindia.indiatimes.com/india/bihar-nitish-10-0-takes-oath-with-14-mantris-from-bjp-8-from-jdu/articleshow/125474380.cms",
  "source": "Times of India"
}