{
  "title": "Trump's White House Tried To Slow-Walk A Vote On The Epstein Files. It Failed.",
  "text": "LOADING ERROR LOADING\n\nWASHINGTON, Nov 19 (Reuters) - The White House quietly lobbied senators to slow-walk a vote to force the release of investigative files on Jeffrey Epstein even as President Donald Trump publicly insisted his administration had nothing to hide and urged Congress to act, according to two sources with direct knowledge of the matter.\n\nThe effort unraveled on Tuesday when senators approved the measure passed by the Republican-controlled House of Representatives without the changes Trump aides had pressed for, exposing the limits of the president’s sway over his party on an issue that has bedeviled him since he returned to power this year. Trump announced in a social media post on Wednesday that he had signed the measure. His signature capped an extraordinary week that began with Trump reversing course Sunday night to urge House passage of a bill his administration had been trying to stall or head off for months. The measure compels the release of U.S. Justice Department files on Epstein, the late convicted sex offender and New York financier who fraternized with some of the most influential men in the country.\n\nAdvertisement\n\nThe US Capitol in Washington, DC, US, on Tuesday, Nov. 18, 2025. President Donald Trump's firm control of Washington showed signs of weakening Tuesday as nearly all House Republicans voted to compel the Justice Department to release its files on sex trafficker Jeffrey Epstein, whose earlier ties to the president have been the subject of intense scrutiny. Photographer: Graeme Sloan/Bloomberg via Getty Images Bloomberg via Getty Images\n\nPIVOT TO DAMAGE CONTROL\n\nBy late Sunday afternoon, top White House aides and the president had concluded their campaign to prevent the vote was failing, and they tried to pivot from prevention to damage control, said the sources, who were not authorized to speak publicly.\n\nWhite House aides ramped up their outreach to Senate leadership for amendments to the House bill, including redactions to protect victims, as a final effort to influence the measure, the two sources said.\n\nAdvertisement\n\nThey prepared for a period of “messaging and management” to slow the bill, encouraging senators to portray any delay as responsible oversight. They also circulated talking points tailored to vulnerable Republicans, urging them to frame the vote around transparency while quickly steering the conversation back to affordability issues that are expected to loom large in next year’s midterm congressional elections.\n\nWhite House spokeswoman Abigail Jackson said Trump had worried the focus on Epstein would distract from his other priorities.\n\n“President Trump has never been against releasing the Epstein files - rather, he has always been against Republicans falling into the Democrat trap of talking about this rather than focusing on the historic tax cuts signed into law, the fact that zero illegal aliens have entered our country in five months, and the many other accomplishments of the Trump Administration on behalf of the American people,” Jackson said.\n\nAdvertisement\n\nLIMIT TO TRUMP’S POWER?\n\nDespite weeks of strategizing and direct pressure on lawmakers - including a long delay in swearing in a newly elected Democratic lawmaker - congressional Republicans moved ahead against Trump’s wishes.\n\nThe fight has taken a toll on Trump’s public approval, which fell to its lowest point this year in a Reuters/Ipsos poll concluded on Monday. It found that just 44% of Republicans thought Trump was handling the Epstein situation well.\n\nAnother 60% of Americans believed the federal government was hiding information about Epstein’s death, and 70% believed it was hiding information about people involved in his sex crimes. A majority of Trump’s Republicans shared those suspicions.\n\nAdvertisement\n\nThe saga also soured relations with one of his strongest Republican supporters in Congress, Representative Marjorie Taylor Greene of Georgia.\n\nRep. Marjorie Taylor-Greene, R-Ga., right, comforts Haley Robson, center, during a news conference as the House prepares to vote on the Epstein Files Transparency Act, at the Capitol in Washington, Tuesday, Nov. 18, 2025. They are joined by survivors and family members who recounted their personal stories of Epstein. (AP Photo/J. Scott Applewhite) via Associated Press\n\nTrump socialized and partied with Epstein in the 1990s and 2000s before what he calls a rift, and later amplified conspiracy theories about Epstein to his own supporters. Now, many Trump voters believe his administration has covered up Epstein’s ties to powerful figures and obscured details surrounding his death in a Manhattan jail, which was ruled a suicide while Trump was president in 2019.\n\nAdvertisement\n\nEpstein pleaded guilty to a Florida state felony prostitution charge in 2008 and served 13 months in jail. The U.S. Justice Department charged him with sex trafficking of minors in 2019. Epstein had pleaded not guilty to those charges before his death.\n\nTrump has denied any wrongdoing and the investigative material to date has yet to reveal any specific compromising details, though House Democrats last week released a 2019 email from Epstein that cryptically contended Trump “knew about the girls.”\n\nThe intense focus on the Epstein files has fueled frustration within the White House and for Trump personally. The president this week lashed out at female reporters who pressed him on Epstein, calling one “a terrible person” and saying, “Quiet, quiet piggy” to another. Aides expressed exasperation over what they see as the Republican Party’s fixation on the issue - one, they fear, might persist no matter what files are released.\n\nAdvertisement\n\n“There is a misconception, embraced by many in the Republican Party, that the federal government is hiding information about Epstein,” a senior White House official said. “But that theory is simply not true ... the president has nothing to hide.”\n\n(Reporting by Nandita Bose in Washington; Additional reporting by Andrea Shalal; writing by Daniel Trotta; Editing by Scott Malone, Colleen Jenkins, Stephen Coates, Rod Nickel)",
  "summary": "The White House quietly lobbied senators to slow-walk a vote to force the release of investigative files on Jeffrey Epstein according to two sources with direct knowledge of the matter.",
  "published": "Wed, 19 Nov 2025 23:46:21 -0500",
  "url": "https://www.huffpost.com/entry/trump-white-house-vote-epstein-files_n_691e9b20e4b0d33fcd987970",
  "source": "Politics"
}