{
  "title": "Another glass ceiling breaks: Women soldiers soon in Territorial Army",
  "text": "In a first-of-its-kind move, the Army is planning to induct women soldiers in its Territorial Army (TA) battalions, aimed at gradually opening up greater opportunities for women in the force.\n\nThe Indian Express has learnt that the Directorate General of Territorial Army released additional vacancies for 2025-2026 for the Infantry Battalions TA Home & Hearth (H&H) last month.\n\nAccording to the TA website, there are 11 TA H&H battalions, eight of which were raised for Jammu and Kashmir and three for the North-East, in 2004-05.\n\nIn some of these TA H&H battalions, a section strength of vacancies has been earmarked for the induction of women candidates, among the total vacancies, it is learnt. A section usually comprises 10 soldiers.\n\nThis means a TA H&H battalion, which has around 750 to 1,000 soldiers, will now have a section of women soldiers.\n\nWhile this initiative initially entails inducting a section strength of women soldiers into some of the TA H&H battalions, plans are to expand it to all TA H&H battalions and subsequently increase their numbers.\n\nThe TA H&H battalions, comprising the local population, have been raised in the northern and eastern theatres for counter-insurgency and counter-terrorism operations. They assist the regular Army and civil administration in multiple tasks, such as intelligence gathering, road opening, and assistance in case of natural calamities, among others.\n\nStory continues below this ad\n\nAs of today, women are not allowed to join core combat arms of the Army such as Infantry, Armoured Corps and Mechanised Infantry. Some of the combat support arms, such as Corps of Engineers, the Regiment of Artillery and Corps of Signals and all services, have women officers. Only the Corps of Military Police inducts women as soldiers.\n\nThe latest decision to induct women soldiers into infantry battalions TA (H&H) will allow them to break yet another glass ceiling.\n\nExplained Why this matters Women are not allowed to join core combat arms such as Infantry, Armoured Corps and Mechanised Infantry. Some combat support arms have women officers. Only the Corps of Military Police inducts women as soldiers.\n\nThe TA is a citizen’s army of volunteers who willingly enrol in this arm to contribute to the nation’s defence. The TA provides the volunteers an ideal opportunity to receive military training in their spare time and to serve the nation in times of national emergency and internal disturbances.\n\nIn May this year, during Operation Sindoor, the Ministry of Defence had announced activating 14 of 32 infantry battalions of the Territorial Army for deployment across the country until February 2028.\n\nStory continues below this ad\n\nPresently, the TA has a strength of approximately 50,000 personnel comprising 65 Departmental TA units, such as Railway, IOC, ONGC and Non-Departmental TA units of Infantry Battalion (TA), including Home & Hearth Battalions, Ecological Battalion (TA) affiliated to various Infantry Regiments and Engineer Regiment (TA) for maintenance of Line of Control Fencing.\n\nA Composite Eco Task Force for the National Mission for Clean Ganga has also been raised. The Eco Task Force is dedicated to the development, preservation and maintenance of ecological balance and afforestation in difficult areas.\n\nMany celebrities, too, have either served or have been granted honorary ranks in the TA, among them Nana Patekar, Mohanlal, Kapil Dev, M S Dhoni, and Abhinav Bindra.",
  "summary": "",
  "published": "Sat, 15 Nov 2025 22:29:03 +0000",
  "url": "https://indianexpress.com/article/india/another-glass-ceiling-breaks-women-soldiers-soon-in-territorial-army-10368326/",
  "source": "India | The Indian Express"
}