{
  "title": "Graduate jobs under threat from AI, PwC boss says",
  "text": "Graduate jobs under threat from AI, PwC boss says\n\n4 hours ago Share Save Nick Marsh Business reporter, Singapore Share Save\n\nGetty Images\n\nThe growth of artificial intelligence (AI) may eventually lead to fewer entry-level graduates being hired, the boss of accountancy giant PwC has told the BBC. However, global chairman Mohamed Kande said AI was not behind recent job cuts at the firm, adding that the company actually needed to hire hundreds of new AI engineers but was struggling to find them. But some observers say the technology itself threatens thousands of junior jobs across the professional services industry. Speaking on the sidelines of a business summit in Singapore, Mr Kande also said big changes in the global economy, such as US President Donald Trump's sweeping tariffs, had been good for the firm's consulting business.\n\nHe also addressed the company's suspension in China last year over its work on the collapsed property giant Evergrande, promising that the same mistakes \"would not happen again\". Headquartered in London, PwC is one of the Big Four accountancy firms. It provides a range of services, such as financial auditing, consulting and tax advice for business clients around the world. According to Mr Kande, advising them on how to integrate AI into their operations will be at the heart of the firm's future business strategy, even as the rapidly advancing technology affects its own hiring plans. Firms who would have previously hired PwC consultants to sift through data and documents may now use AI models instead, turning weeks of costly work into mere minutes.\n\nWatch: 'It is a different set of people we are hiring now'\n\nEvery year, the company hires thousands of new graduates in entry-level positions - including 1,300 in the UK and 3,200 in the US last year - but it recently dropped long-term plans to continue increasing its headcount. In 2021, PwC said it wanted to hire 100,000 people over the course of five years - but Mr Kande said this would no longer be possible. \"When we made the plans to hire that many people, the world looked very, very different,\" he said. \"Now we have artificial intelligence. We want to hire, but I don't know if it's going to be the same level of people that we hire - it will be a different set of people.\" Last year, PwC cut more than 5,600 roles across its worldwide operation. The boss of the company's UK business has previously spoken about reducing graduate recruitment, admitting that AI was \"certainly reshaping roles\". At a global level, however, Mr Kande insisted that the AI boom was an \"exciting time\" for creating new jobs. \"We are looking for hundreds and hundreds of engineers today to help us drive our AI agenda, but we just cannot find them,\" he said.\n\nTrade turmoil 'good for us'",
  "summary": "The accountancy giant says artificial intelligence will eventually lead to fewer entry-level positions at the firm.",
  "published": "Fri, 21 Nov 2025 02:34:57 GMT",
  "url": "https://www.bbc.com/news/articles/cm272510e6jo?at_medium=RSS&at_campaign=rss",
  "source": "BBC News"
}