{
  "title": "‘Punishable by DEATH’: Trump threatens Democrats with sedition charges",
  "text": "The US president denounced Democratic lawmakers for calling on military members to reject any ‘illegal orders’ they may receive.\n\nUnited States President Donald Trump has floated the possibility of the death penalty for a group of Democratic Congress members who called upon the military and intelligence community to refuse illegal orders.\n\nHe also suggested he would be in favour of imprisoning the Democrats for their statement.\n\n“This is really bad, and Dangerous to our Country. Their words cannot be allowed to stand. SEDITIOUS BEHAVIOR FROM TRAITORS!!! LOCK THEM UP???” Trump wrote on Thursday, as part of a series of posts on his platform Truth Social.\n\nA follow-up message, published about 40 minutes later, contained only five words: “SEDITIOUS BEHAVIOR, punishable by DEATH!”\n\nThe Democratic Party quickly denounced the Republican leader’s remarks as “absolutely vile”.\n\nTrump’s threat came in response to a video published on November 18, containing clips of six Democratic senators and representatives, all of them veterans of the US military or its intelligence services.\n\nIn the video, the Congress members remind their colleagues in the armed forces and intelligence community of their duty to “refuse illegal orders”.\n\n“We know you are under enormous stress and pressure right now,” the Congress members said. “Americans trust their military, but that trust is at risk.”\n\nA red line for military members\n\nThe Uniform Code of Military Justice makes it illegal for service members to willfully disobey the orders of a superior officer.\n\nBut such orders are only lawful if they do not run “contrary to the Constitution, the laws of the United States or lawful superior orders”. An order that is “beyond the authority of the official issuing it” is also considered unlawful.\n\nAdvertisement\n\nAs a result, it is widely understood under US law that soldiers and service members have an obligation to reject orders they understand to be illegal.\n\nIn a landmark 1969 case known as United States v Keenan, a military court ruled, “Obedience to a lawful order is justified, but one in execution of a patently illegal order is not.”\n\nThe video Democrats released this week suggests that service members are facing such a situation today.\n\nIn a stitched-together statement featuring the voices of several Congress members, including Senator Mark Kelly of Arizona and Senator Elissa Slotkin of Michigan, the Democrats appeal to military and intelligence workers to stand up to illegal demands.\n\n“You must refuse illegal orders. No one has to carry out orders that violate the law or our Constitution,” the Democrats said in their collective statement.\n\n“We know this is hard, and that it’s is a difficult time to be a public servant. But whether you’re serving in the CIA, the Army, the Navy, the Air Force, your vigilance is critical. And know that we have your back.”\n\nRepresentatives Jason Crow of Colorado, Chris Deluzio of Pennsylvania, Maggie Goodlander of New Hampshire and Chrissy Houlahan of Pennsylvania also took part in the video.\n\nThey end their video with a popular slogan in the military: “Don’t give up the ship.” The phrase refers to the dying cry of a 19th-century US Navy captain, rallying his fellow sailors to fight until the end.\n\nOnline debate over video\n\nBut some Republicans have interpreted the video as a call to defy orders on political grounds.\n\nTrump’s homeland security adviser Stephen Miller, for instance, posted on social media that “Democrat lawmakers are now openly calling for insurrection.”\n\nDemocrats quickly fired back, arguing they were simply pointing to existing military law and court precedent.\n\n“This is the law. Passed down from our Founding Fathers, to ensure our military upholds its oath to the Constitution — not a king,” Slotkin said in response to Miller’s post. “Given you’re directing much of a military policy, you should buff up on the Uniformed Code of Military Justice.”\n\nCrow, meanwhile, called out policies he considers to be in violation of US law, including Trump’s decision to deploy military troops to police civilians and the recent bombing campaign against boats in the Caribbean Sea and eastern Pacific Ocean.\n\n“The President is trampling on the Constitution,” Crow wrote. “Stop politicizing our troops. Stop illegal military strikes. Stop pitting our servicemembers against the American people.”\n\nAdvertisement\n\nThe Posse Comitatus Act of 1878 restricts the use of the military for domestic law enforcement, and legal experts, including at the United Nations, have warned that the boat-bombing campaign runs afoul of the UN Charter, as well as international and domestic human rights laws.\n\n“These attacks — and their mounting human cost — are unacceptable,” Volker Turk, the UN’s human rights chief, said last month.\n\nHe added that the “extrajudicial killings” of alleged drug smugglers on the boats “find no justification in international law”. At least 83 people have been killed in the attacks.\n\nOn Thursday, however, White House Press Secretary Karoline Leavitt argued that President Trump has stuck to the letter of the law in all his orders to the military.\n\n“Every single order that is given to this United States military by this commander-in-chief and through this chain of command — through the secretary of war — is lawful,” she told a news briefing.\n\n“We do things by the books. And to suggest and encourage that active-duty service members defy the chain of command is a very dangerous thing for sitting members of Congress to do.”\n\nShe added that the Democrats “should be held accountable” for “ their dangerous rhetoric”.\n\nA history of threats against rivals\n\nThursday’s threats against the Democratic lawmakers is not the first time Trump has dangled the prospect of imprisonment — or even death — in front of political rivals.\n\nDuring his successful 2016 presidential campaign, Trump turned the possibility of jailing his political rival, Democrat Hillary Clinton, into a popular rallying cry.\n\nCrowds at his events would applaud him and chant, “Lock her up! Lock her up!”\n\nTrump had claimed that Clinton’s use of a private email server merited her incarceration, framing her actions as corrupt. “For what she’s done, they should lock her up. They should. It’s disgraceful,” he told a 2016 campaign event in North Carolina.\n\nEven after taking office, Trump continued to threaten his critics and perceived opponents with arrest. In 2020, for instance, he took to social media to push for the jailing of those involved in a 2016 investigation into alleged Russian election interference, which he considers a “hoax”.\n\n“Where are all of the arrests?” he asked. “Long term sentences would have started two years ago. Shameful.”\n\nDuring his most recent presidential bid, in 2024, he returned to the theme of incarceration, calling for the prosecution of then-President Joe Biden and his successor as Democratic nominee, Vice President Kamala Harris.\n\n“She should be impeached and prosecuted for her actions,” Trump said of Harris at a rally in Erie, Pennsylvania, blaming her for crimes committed by immigrants.\n\nTrump’s threats have also targeted members of his own party that he perceives as disloyal.\n\nRepublican Liz Cheney, for instance, investigated Trump’s actions during the Capitol riot on January 6, 2021. She was among a bipartisan group of lawmakers in the House of Representatives who recommended criminal charges for his actions.\n\nAdvertisement\n\nIn the 2024 presidential race, Cheney ultimately backed Harris over Trump, her fellow party member. In response to her public criticisms, Trump openly mused about her facing a firing squad.\n\n“She’s a radical war hawk. Let’s put her with the rifle standing there with nine barrels shooting at her. OK? Let’s see how she feels about it. You know, when the guns are trained on her face,” Trump said. His campaign later clarified he only meant to highlight Cheney’s hypocrisy.\n\nSince Trump returned to office for a second term in January, critics say he has attempted to follow through with some of his threats.\n\nIn September, for instance, Trump used social media to demand that Attorney General Pam Bondi prosecute three of his critics: Democratic Senator Adam Schiff, New York Attorney General Letitia James and James Comey, a former director of the Federal Bureau of Investigation (FBI).\n\n“We can’t delay any longer, it’s killing our reputation,” he wrote. “JUSTICE MUST BE SERVED, NOW!!!”\n\nSince that time, both James and Comey have faced criminal indictments. A third critic, former Trump adviser John Bolton, was also charged last month.\n\nAll three have argued their cases are a form of political retribution and are currently seeking to have the charges dismissed.\n\nTrump has long maintained that the greatest threat to the US is the “enemy from within”, an ambiguous phrase he has sometimes applied to Democratic rivals like Schiff.\n\nLast month, he told a gathering of top military leaders in Quantico, Virginia, that the “big thing” they would be handling from here forward is “the enemy from within”.\n\n“We have to handle it before it gets out of control,” he told the packed room of nearly 800 generals and admirals.",
  "summary": "The US president forcefully denounced Democratic lawmakers for calling on the military to reject any &#039;illegal orders&#039;.",
  "published": "Thu, 20 Nov 2025 17:14:02 +0000",
  "url": "https://www.aljazeera.com/news/2025/11/20/punishable-by-death-trump-threatens-democrats-with-sedition-charges?traffic_source=rss",
  "source": "Al Jazeera – Breaking News, World News and Video from Al Jazeera"
}