{
  "title": "What does the left want? A wealth tax. What will that accomplish? Very little | Aditya Chakrabortty",
  "text": "By this time next week you will be digesting the budget, you lucky thing. Yet even before Rachel Reeves has commended a single damn thing to the house, her efforts have been written off as a “shambles”, from a “chaotic” government that is Labour in name alone. Which prompts the question: what is the leftwing alternative?\n\nBecause there is one, on which agreement stretches from Labour backbenchers to many of their opponent MPs and far beyond. Whether you listen to Zack Polanski or Zarah Sultana, the TUC or the YouTubers, they all call for a wealth tax – stinging the rich to pay for schools and hospitals. Who could be against such a thing?\n\nMe, for one.\n\nI am all for making the wealthy pay their way and, as a creature of warm blood and soft tissue, I delight in anything that winds up some of the worst people. There must be merit in an idea that gets France’s Bernard Arnault chuntering about “a clearly stated desire to destroy the … economy” – this from the plutocrat (estimated net worth: £139bn) who declared, “As long as I’m not the richest man in the world, I won’t really be happy.” Trust me, dear reader, this is a whole Radox bath of pleasure I am forgoing.\n\nBut still, I can’t go along with the consensus emerging around a wealth tax. It is too much of a muddle, not just financially or economically but also politically. As with so many simple and shoddy ideas, it polls beautifully yet smacks of dishonesty. If the wealth taxers seriously want to tackle big money and vested interests, they are going to the gunfight not with knives, but toothpicks.\n\nLet us start with some context. Perhaps the best work in this field comes from the Wealth Tax Commission, which in 2020 gathered what it called “the largest repository of evidence on wealth taxes globally to date”. Over 50 experts gave evidence, from economists to the former head of HMRC. The commission recommended “a one-off wealth tax” – in essence, a giant and sudden raid by tax inspectors on couples with over £1m in assets (which would include a lot of homeowning households in nice neighbourhoods, who may not count themselves as rich). That would raise £260bn, or the equivalent of hiking the basic rate of income tax by 9p in the pound.\n\nA whopping sum, raised with shock and awe. But that isn’t what you’re hearing about on TV and podcasts now. The far more modest proposals from the left include a 1% annual levy on assets over £10m recommended by the Greens in their latest manifesto. The Wealth Tax Commission estimated that an annual 1.12% levy on assets over £10m would raise £10bn – handy, but in Whitehall terms hardly life-changing. And, experts pointed out, such sums could be raised without manufacturing a new tax but simply by tweaking the existing levies on the wealthy. It would not surprise me at all if next Wednesday the chancellor made some of those tweaks.\n\nThis isn’t much of a policy, it’s a pantomime – a pantomime of pseudo-radicalism in which the villains are some wankers on yachts and the solution is one simple trick, just like those dodgy internet ads used to offer. It just so happens it would yield about 1% of what the government spends in a year.\n\nWhere a few years ago leftwingers would argue for the government to borrow more, today YouTube radicals such as Gary Stevenson act as if John Maynard Keynes had never been born. Without a wealth tax, the UK will soon go bankrupt, he warns – an unlikely thing to happen in one of the richest countries in the world, with its own money-printing press. “Traders are about to bring down the government,” he told Guardian readers in January. Ten months later, we await the excitement.\n\nIf the Greens are serious about redistributing unearned wealth, they should widen their focus from Mr and Mrs Megabucks to well-to-do families across the country who, just by dint of being sufficiently old and/or lucky are sitting in houses that have rocketed in value since the late 90s. But chance would be a fine thing: next May, Polanski and his troops will be marching on inner-London councils such as Hackney, where an ordinary terrace house now fetches just shy of a million pounds, over three times the average across England. Far easier to claim the problem is all a few billionaires. So why not go the whole hog and make the Greens the anti-billionaire party, with a charter to remove oligarch influence from our political parties, our thinktanks, our media?\n\nskip past newsletter promotion Sign up to Matters of Opinion Free weekly newsletter Guardian columnists and writers on what they’ve been debating, thinking about, reading, and more Enter your email address Sign up Privacy Notice: Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on theguardian.com to send you this newsletter. You can complete full registration at any time. For more information about how we use your data see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nAs you can see, my worry isn’t the usual timorous one about how any tax on the super-rich will send them packing. Given how far the rich have had things their way over the past four decades, some evening up is in order. Concern over a deeply unequal society and a lopsided economy is where the wealth tax-ers and I start – but doing something about it requires deep-rooted changes to give more people a fairer share. Changes to the labour laws to encourage union organisation. Changes to corporations to give workers more of a stake. Vastly more social housing. The irony is that Labour leaders have flirted with such steps. Not just Jeremy Corbyn, but Ed Miliband and his call for “predistribution” – for citizens to have a greater share of assets before tax. On that showing, the Labour party that went to the polls in 2015 was more economically radical than the Greens and Your Party are a decade later.\n\nI offer these criticisms I hope constructively, with only a soupçon of teasing. Polanski and Sultana aren’t the politicians talking about ripping gold rings off the fingers of asylum seekers, conniving at the mass murder of Palestinians or cheering on the bulldozing of our planning system. In talking about wealth taxes, they have grasped an important political truth. The electoral future of a low-growth country like Britain doesn’t lie in promising voters that with some magic trick you can drive up GDP, but in accepting that the arguments that lie ahead are about the distribution of resources. That’s something the centrists on both the Tory and Labour benches have yet to grasp – which is why next week’s budget will be so painful.",
  "summary": "<p>Imposing a 1% levy on the super-rich isn’t a policy, it’s pantomime. Tackling inequality in Britain will require much more far-reaching changes</p><p>By this time next week you will be digesting the budget, you lucky thing. Yet even before Rachel Reeves has commended a single damn thing to the house, her efforts have been written off as a “shambles”, from a “chaotic” government that is Labour in name alone. Which prompts the question: what is the leftwing alternative?</p><p>Because there is one, on which agreement stretches from Labour backbenchers to many of their opponent MPs and far beyond. Whether you listen to Zack Polanski or Zarah Sultana, the TUC or the YouTubers, they all call for a wealth tax – stinging the rich to pay for schools and hospitals. Who could be against such a thing?</p><p>Aditya Chakrabortty is a Guardian columnist</p> <a href=\"https://www.theguardian.com/commentisfree/2025/nov/20/wealth-tax-left-super-rich-britain-budget-2025\">Continue reading...</a>",
  "published": "Thu, 20 Nov 2025 06:00:16 GMT",
  "url": "https://www.theguardian.com/commentisfree/2025/nov/20/wealth-tax-left-super-rich-britain-budget-2025",
  "source": "The Guardian"
}