{
  "title": "Rapper Nicki Minaj Calls For Protections For Christians In Nigeria At UN Event",
  "text": "LOADING ERROR LOADING\n\nRapper Nicki Minaj teamed up with the Trump administration on Tuesday to call for an end to the persecution of Christians in Nigeria.\n\n“I would like to thank President Trump for prioritizing this issue and for his leadership on the global stage in calling for urgent action to defend Christians in Nigeria, to combat extremism and to bring a stop to violence against those who simply want to exercise their natural right to freedom of religion or belief,” she said in her brief remarks at a United Nations event.\n\nAdvertisement\n\n“Today, faith is under attack in way too many places. In Nigeria, Christians are being targeted, driven from their homes and killed. Churches have been burned, families have been torn apart, and entire communities live in fear constantly simply because of how they pray,” she continued.\n\nPresident Donald Trump has said that there’s an “existential threat” against Christians in the country and has threatened military action.\n\nHowever, the situation in Nigeria is more complicated than Trump and other Americans have made it seem, numerous experts have claimed. The West African country has a nearly equal amount of Christians and Muslims, and both religious groups have faced attacks from extreme Islamist groups, CNN reported earlier this month.\n\nAdvertisement\n\nTrinidadian-U.S. rapper Nicki Minaj speaks during the panel discussion \"Combatting Religious Violence and the Killing of Christians in Nigeria\" at the US Mission to the United Nations in New York City, on Nov. 18, 2025. ANGELA WEISS via Getty Images\n\nRegardless, the controversial musician focused on attacks on Christians, while also claiming that Nigeria is home to a lot of Barbz, the nickname for her fanbase. At the conclusion of her speech on Tuesday, Minaj spoke directly to the Barbz.\n\n“Barbz, I know you’re somewhere listening. I love you so very much,” she said. “I want to make it very clear, once again, that this isn’t about taking sides. This is about standing up in the face of injustice. It’s about what I’ve always did for my entire career, and I will continue to stand for that for the rest of my life.”\n\nAdvertisement\n\nThe “Big Foot” rapper’s speech comes after she posted about the matter on X earlier this month:\n\n“No group should ever be persecuted for practicing their religion. We don’t have to share the same beliefs in order for us to respect each other,” she wrote.\n\nHer post included a screenshot from Trump’s Oct. 31 Truth Social post about the same subject.\n\n“Thousands of Christians are being killed. Radical Islamists are responsible for this mass slaughter,” he said in the post. “The United States cannot stand by while such atrocities are happening in Nigeria, and numerous other countries... We stand ready, willing, and able to save our great Christian population around the world!”\n\nThis is not the first time the White House and Minaj have crossed paths online. The White House posted a TikTok video with a sound featuring Minaj’s popular song “Beez In The Trap.” The video showed clips of Trump and first lady Melania Trump. In the comments, the rapper said, “This is pretty incredible.”\n\nAdvertisement\n\nOn Tuesday, Trump’s ambassador to the United Nations, Mike Waltz, explained how Minaj landed the speaking gig on Tuesday on “The Faulkner Focus.”\n\n“It was her responding to President Trump, but, you know — what an unlikely duo, but what an amazing duo,” Waltz said.",
  "summary": "Rapper Nicki Minaj says she wants to shine a spotlight on “the deadly threat” to Christians in Nigeria.",
  "published": "Tue, 18 Nov 2025 19:43:57 -0500",
  "url": "https://www.huffpost.com/entry/united-nations-nigeria-nicki-minaj_n_691d124ae4b073def3eeb257",
  "source": "World News"
}