{
  "title": "Dining across the divide: ‘We both came out thinking Zack Polanski is a breath of fresh air’",
  "text": "Andrew, 70, near Nottingham\n\nOccupation Retired acupuncturist and herbalist\n\nVoting record Has voted Labour for 50 years and is sick to death of them\n\nAmuse bouche Andrew was the first English person to be awarded an honorary doctorate from a Chinese university\n\nJonathan, 49, Nottingham\n\nOccupation Global programme manager for a technology company\n\nVoting record Always Conservative, except for 2024 when he voted Labour\n\nAmuse bouche Travels so much for work that he once went to Australia 10 times in 14 months\n\nFor starters\n\nJonathan I wasn’t sure quite what to make of him – he seemed a nice guy. I maybe thought his views were going to be stronger than they turned out to be.\n\nAndrew Look, we’ve got ourselves here a reformed Tory, and myself rather more to the left. But we’re both disaffected with where politics has gone in this country. We both recognise that the biggest problem we’ve got is this massive inequality, and neither of us think the parties we used to be aligned with are addressing it.\n\nJonathan He had hake and chips, I had haddock and chips. It was a posh fish and chip shop.\n\nThe big beef\n\nAndrew I was once a shop steward for Unison. Forty years of self-employment later, I’m no longer an expert. But I can see how important trade unions are, how they support and prop up democracy. He’s from a reasonably well-to-do, middle-class, Tory background. He remembers his parents and his grandmother saying: “Trade unions, they’ll bring the country down.” And I pointed out that it is absolutely necessary for people to have bargaining power. Socialism isn’t about the violent expropriation of people’s properties, it’s about a little bit of redistribution.\n\nJonathan Given what I see in the world today, especially in the US where people have no rights, workers definitely have to have a voice. When they don’t, their rights are eroded. But I don’t think what we had in the past worked that well. I’m a big fan of having workers on boards – but I’ve worked in Germany as well, where they have the workers’ council, and they have crazy stuff that they can’t get through, because the workers say no.\n\nAndrew You look at Bezos or Musk – do you think for one minute they would like unions? Of course they wouldn’t.\n\nJonathan We thought the same about Musk. I don’t think that’s the way the world needs to go, to have very, very rich people controlling the vast majority of the wealth. You need a society where people can achieve things. But the politics in the States is driven by oligarchs, and people saying: “This is all because of immigrants.”\n\nSharing plate\n\nAndrew One area where I think the state really should intervene is in our utilities. It always seemed mad to me that people have made billions of pounds in revenue off of our water, off of our electricity, off of our power.\n\nJonathan To have innovation, you’ve got to have some sort of catalyst. That’s a profit motive. But it can’t just go to a private equity company that strips it. That said, if it’s entirely nationalised, and there’s no profit motive, that’s not a workable solution, either. Those companies become bloated – there’s no incentive to efficiency, to do better.\n\nAndrew I agreed with him – British Rail was terrible. But the trains are terrible now, they’re just more expensive. The public are being rinsed and everybody’s sick of it.\n\nJonathan I certainly agree with Andrew on that. What’s happened with the water companies is terrible – but if you don’t control it, that’s the way it goes.\n\nFor afters\n\nAndrew We both came out saying: “Zack Polanski is a breath of fresh air.” We both recognise that no country can afford to have endless economic migrants, but all countries must be able to process people that land on our shores – sort out the people that need to be here.\n\nJonathan I’ve only read a few articles about what Polanski has said, but he seemed to be speaking a lot of sense to me. Greens have always been a bit fluffy, but Zack’s on to something.\n\nTakeaway\n\nAndrew We didn’t swap numbers, but if I bumped into him, I’d buy him a beer.\n\nJonathan We got on really well. We could both see where the other was coming from.\n\nAdditional reporting: Kitty Drake\n\nAndrew and Jonathan ate at The Cod’s Scallops in Nottingham.\n\nWant to meet someone from across the divide? Find out how to take part",
  "summary": "<p>They both liked the Greens’ Zack Polanski and disliked the tech oligarchs. But could they find common cause over the power of the unions?</p><p><strong>Andrew, 70, </strong><strong>near Nottingham</strong></p><p><strong>Occupation</strong> Retired acupuncturist and&nbsp;herbalist</p> <a href=\"https://www.theguardian.com/lifeandstyle/2025/nov/16/dining-across-the-divide-andrew-jonathan\">Continue reading...</a>",
  "published": "Sun, 16 Nov 2025 12:00:31 GMT",
  "url": "https://www.theguardian.com/lifeandstyle/2025/nov/16/dining-across-the-divide-andrew-jonathan",
  "source": "The Guardian"
}