{
  "title": "Gunmen Abduct Dozens Of Girls From High School In Nigeria",
  "text": "LOADING ERROR LOADING\n\nABUJA, Nigeria (AP) — Gunmen attacked a high school in northwestern Nigeria before dawn on Monday, taking 25 schoolgirls and killing at least one staffer, authorities said of the latest abduction of students in the region.\n\nNo group immediately claimed responsibility for abducting the girls from the boarding school in Kebbi state and their motivation was unclear.\n\nAdvertisement\n\nNigeria is facing a multidimensional security challenge, specifically from amorphous groups of armed bandits who specialize in kidnapping for ransoms — sometimes totaling thousands of dollars — and have been responsible for several high-profile abductions across Nigeria’s northern region. Kidnappings, attacks on villages and along major roads have become common because of the limited security presence.\n\nThose bandits are not connected to militant groups such as Boko Haram and the splinter group Islamic State West Africa Province, whose attacks on communities and government installations are motivated by religion.\n\nPolice said the schoolgirls were taken from their dorms at 4 a.m. Monday. Associated Press\n\nAdvertisement\n\nPolice said the boarding schoolgirls were taken from their dorms at 4 a.m. Monday. The school is in Maga, in the state’s Danko-Wasagu area, police spokesperson Nafi’u Abubakar Kotarkoshi said.\n\nThe assailants were armed with “sophisticated weapons” and exchanged fire with guards before abducting the girls, Kotarkoshi said.\n\n“A combined team is currently combing suspected escape routes and surrounding forests in a coordinated search and rescue operation aimed at recovering the abducted students and arresting the perpetrators,” the spokesperson said.\n\nAdvertisement\n\nKotarkoshi said one person was killed and another was injured, but a resident who said his daughter and granddaughter were abducted in the raid believes the death toll stands at two.\n\n“We were told that the attackers entered the school with many motorcycles. They first went straight to the teacher’s house and killed him before killing the guard,” said Abdulkarim Abdullahi Maga.\n\nPolice did not respond to an Associated Press call seeking confirmation of a second death.\n\nArmed groups have targeted school children in the region since 2014, when Boko Haram abducted 276 students from Chibok in Borno state. That abduction marked the beginning of a new era of fear, and dozens remain in captivity.\n\nAdvertisement\n\nSince the Chibok abductions, at least 1,500 students have been kidnapped, as armed groups increasingly find in abductions a lucrative way to fund other crimes and control villages in the nation’s mineral-rich but poorly policed region. In March 2024, more than 130 schoolchildren were rescued after spending more than two weeks in captivity in the Nigerian state of Kaduna.\n\nNonetheless, raids on schools have subsided in recent years as state governments implemented security measures in hot spots, including closing schools for an extended period of time.\n\n___\n\nFreelance journalist Mohammed Ibrahim in Kaduna, Nigeria, contributed.",
  "summary": "At least one staffer at the school was also killed, authorities said.",
  "published": "Mon, 17 Nov 2025 23:37:19 -0500",
  "url": "https://www.huffpost.com/entry/nigeria-school-girls-abducted_n_691bf625e4b0b8c5ce72d30b",
  "source": "World News"
}