{
  "title": "Ultra-processed foods quietly push young adults toward prediabetes",
  "text": "More than half of the calories people consume in the United States come from ultra-processed foods (UPFs), which include items such as fast food and packaged snacks that tend to contain large amounts of sodium, added sugars and unhealthy fats. While studies in adults have firmly connected these foods to type 2 diabetes and other chronic conditions, far less is known about how UPFs affect younger populations.\n\nResearchers at the Keck School of Medicine of USC have now completed one of the earliest studies to examine how UPF intake relates to the body's ability to manage glucose, a key factor for predicting diabetes. By monitoring changes over several years, the team gained a clearer picture of how long-term food choices can influence important metabolic functions.\n\nTracking Young Adults Over Time\n\nThe study followed 85 young adults for four years. During this period, the researchers found that higher consumption of UPFs was tied to an increased likelihood of developing prediabetes, an early stage of elevated blood sugar that can progress to diabetes. Young adults who ate more UPFs also showed signs of insulin resistance, a condition in which the body becomes less efficient at using insulin to manage blood sugar. The findings, published in the journal Nutrition and Metabolism, were supported in part by the National Institutes of Health.\n\n\"Our findings show that even modest increases in ultra-processed food intake can disrupt glucose regulation in young adults at risk for obesity. These results point to diet as a modifiable driver of early metabolic disease, and an urgent target for prevention strategies among young people,\" said Vaia Lida Chatzi, MD, PhD, a professor of population and public health sciences and pediatrics and director of the Southern California Superfund Research and Training Program for PFAS Assessment, Remediation and Prevention (ShARP) Center at the Keck School of Medicine, who is the study's senior author.\n\nWhy Early Adulthood Matters\n\nEarly adulthood represents a period when individuals have reached physical maturity and are forming routines that may continue for decades. Replacing heavily processed meals with whole foods such as fruits, vegetables and whole grains can lower the chance of developing type 2 diabetes in the future.\n\n\"Young adulthood is a critical window for shaping long-term health,\" Chatzi said. \"By focusing on young adults, we have an opportunity to intervene early, before prediabetes and other risk factors become lifelong conditions.\"\n\nIdentifying Early Signs of Prediabetes\n\nThe participants in the study were part of the Metabolic and Asthma Incidence Research (Meta-AIR) study, itself a segment of the larger Southern California Children's Health Study. The 85 volunteers, aged 17-22, provided dietary and health information during one visit between 2014 and 2018 and again roughly four years later.\n\nAt each appointment, participants listed everything they had eaten on a recent weekday and weekend day. Researchers grouped each food into one of two categories: UPFs (such as candy, soda, cereal, packaged spreads, flavored yogurts and many restaurant meals) or foods that were not ultra-processed. They then calculated the percentage of each person's total daily calories that came from UPFs.\n\nBlood samples were collected before and after participants drank a sugary beverage so the researchers could evaluate how effectively their bodies produced insulin in response to rising blood sugar. Statistical analyses were used to compare dietary shifts with markers of prediabetes while accounting for differences in age, sex, ethnicity and physical activity.\n\nBetween the baseline and follow-up visits, a 10% rise in UPF intake was linked to a 64% higher risk of prediabetes and a 56% higher likelihood of impaired glucose regulation. Participants who consumed more UPFs at the start of the study were also more likely to show elevated insulin at the follow-up visit -- an early indicator of insulin resistance, when the body compensates for reduced insulin effectiveness by producing more of it.\n\nReducing Ultra-Processed Foods for Better Health\n\nThe results underscore that UPFs pose significant risks for young adults, a demographic rarely examined in previous work.\n\n\"These findings indicate that ultra-processed food consumption increases the risk for pre-diabetes and type 2 diabetes among young adults -- and that limiting consumption of those foods can help prevent disease,\" said the study's first author, Yiping Li, a doctoral student in quantitative biomedical sciences at Dartmouth College who previously worked as a researcher at the Keck School of Medicine.\n\nThe researchers noted that larger studies with more detailed food tracking could help pinpoint which specific UPFs are most harmful for young adults. They also aim to explore how nutrients in these foods may influence insulin function and blood sugar control.\n\nStudy Contributors and Funding\n\nIn addition to Li and Chatzi, the study's authors include Elizabeth Costello, Sarah Rock, Zhanghua Chen, Frank Gilliland, Michael I. Goren, Jesse A. Goodrich and David V. Conti from the Department of Population and Public Health Sciences, Keck School of Medicine of USC, University of Southern California; William B. Patterson from the University of Colorado School of Medicine; Tanya L. Alderete from the Bloomberg School of Public Health, Johns Hopkins University; and Nikos Stratakis from the Barcelona Institute for Global Health (ISGlobal).\n\nThis work was primarily supported by the National Institute of Environmental Health Sciences (NIEHS) of the National Institutes of Health [P42ES036506, P30ES007048]. Funding for the Meta-AIR study came from the Southern California Children's Environmental Health Center grants funded by NIEHS [5P01ES022845-03, P30ES007048, 5P01ES011627]; the U.S. Environmental Protection Agency [RD83544101]; and the Hastings Foundation. Additional funding came from NIEHS [R01ES036253, R01ES029944, R01ES030364, U01HG013288, T32ES013678, U01HG013288, R01ES035035 and R01ES035056]; the European Union [The Advancing Tools for Human Early Lifecourse Exposome Research and Translation (ATHLETE) project: 874583]; the National Institute on Minority Health and Health Disparities [P50MD017344]; and the Horizon Europe Research and Innovation Program [Marie Skłodowska-Curie Actions Postdoctoral Fellowships: 101059245]. The content is solely the responsibility of the authors and does not necessarily represent the official views of the National Institutes of Health.",
  "summary": "Ultra-processed foods, already known for their links to health problems in adults, are now shown to harm young adults too, disrupting blood sugar regulation long before illness appears. A four-year USC study following 85 participants found that even modest increases in UPF consumption drove up the risk of prediabetes and insulin resistance, two early markers that pave the way for type 2 diabetes.",
  "published": "Mon, 17 Nov 2025 06:01:51 EST",
  "url": "https://www.sciencedaily.com/releases/2025/11/251116105619.htm",
  "source": "All Top News -- ScienceDaily"
}