{
  "title": "Families claim damages over carbon monoxide leak at primary school",
  "text": "Families claim damages over carbon monoxide leak at primary school\n\n12 minutes ago Share Save Andrew Picken BBC Scotland Share Save\n\nBBC The tower block of Balmuildy Primary School was where the most pupils and staff were affected by the leak\n\nA Scottish local authority is facing nearly 30 damages claims from families following a carbon monoxide leak at one of its primary schools. Earlier this year East Dunbartonshire Council was fined in the criminal courts after admitting breaching health and safety conditions at Balmuildy Primary School, Bishopbriggs in 2020. The council, which says it has a rigorous safety monitoring regime in place, is now contesting dozens of civil claims about the incident. But parents say they are worried about the long-term impact on their children and an investigation report into the leak obtained by the BBC has shed new light on what went wrong and how many more schools had missed vital safety checks.\n\nSpeaking anonymously in a statement provided by Thompsons Solicitors, one mother said she dashed to the school after receiving a call about the carbon monoxide (CO) leak. She said the scene was like something from a zombie film - youngsters vomiting, fainting and some lying on the floor sleeping. For weeks her children had complained of feeling extremely unwell when collected from Balmuildy Primary School, only to quickly recover once they were home. \"They sat in a building inhaling fatal levels of carbon monoxide which we have been told but for 'sheer luck' there was no fatalities due to the high level of CO detected,\" she said. \"Now as parents we are left with a feeling of guilt for not realising what was happening sooner and putting our children continuously in a place of danger. \"More concerningly now is not knowing the long-term side effects of this prolonged exposure.\" Another mother took her son to hospital after he complained of sickness, headaches and feeling dizzy. She said: \"He had blood taken and got told his symptoms were a result of carbon monoxide poisoning, but by this point it was starting to leave his system.\" \"This could have been serious for my son, as well as for the other children and the staff at the school. \"My son still suffers from headaches as a result of his exposure and the fact that it wasn't properly checked shows the incompetence of the council.\"\n\nHeadaches, nausea and sickness\n\nThe families affected by the leak claim they have been kept in the dark about what went on leading up to the school being evacuated. The council said it kept parents regularly updated but new details of the incident have now been revealed in a Health and Safety Executive (HSE) report released to the BBC under freedom of information laws. It reveals that on day one of the Balmuildy incident - 19 February 2020 - 35 pupils and four staff members, most of whom were located in the school's tower building, complained of headaches, nausea and sickness. Windows were opened and staff at the school asked the council to carry out tests.\n\nThese tests got under way the next morning but were initially checking for a gas leak, not CO. The report reveals a teacher had brought in a domestic CO detector that her father had given her when she explained the previous day's events to him. This detector's alarm went off indicating the presence of CO but there was a doubt that it was working properly, so a staff member went to the local B&Q and purchased more monitors, which also sounded an alarm. Scottish Gas Network were then called and as soon as its engineer entered the building his body worn gas detector sounded the alarm and he ordered the evacuation of the school.\n\nGetty Images Carbon monoxide is a colourless and odourless gas and can be deadly if inhaled in high concentrations so detectors are needed to sound the alarm if gas appliances, such as boilers, are not functioning properly\n\nThe sheriff court hearing into the incident heard that the boilers at the school had been tested in 2018 - with an earlier service taking place in 2017. But the HSE report states no gas safe certificate for the school was provided. The report also contains reference to paperwork that shows of the council's 43 schools, 12 had had no inspection conducted in as much as six years prior to the incident at Balmuildy. No records could also be found for another 10 of the 43 schools, \"indicating the possibility that these gas systems may have been left without inspection for a longer period\". Another witness statement in the HSE report stated there \"was no system in place for the pro-active management of the gas heating/boiler systems nor was there any system in place for safety inspections/checks to be completed\". The same witness said he was made aware of the problem in October 2019 and had instructed contractors to start doing safety checks, but schools in the Bishopbriggs area had still to be done at the time of the Balmuildy incident. In the weeks after Balmuildy, two other schools were also evacuated because of a carbon monoxide leak. The HSE report states that \"extensive repairs\" were carried out on some school boilers after all of the safety checks, which it suggests was \"indicative of a systemic failure to manage the ongoing repair and inspection program in a suitable and sufficient manner\".\n\nWhat went wrong?\n\nThe investigation by HSE gas safety experts found one of the boilers to be leaking CO in the school's plant room. The access hatch for a pipework service duct in this plant room was found to be open and unsealed and this provided a pathway for the CO to make its way into the rest of the school. The HSE report notes that East Dunbartonshire Council has now put in place a system that automatically flags when work or statutory testing is required. Patrick McGuire, senior partner at Thompsons Solicitors, said his firm had 29 cases related to the CO leak. He said: \"We are talking about some of the most basic checks that you or I would do on our gas boilers to make sure our own homes are safe. \"The families just want the truth and it is a sad state of affairs that they have had to come to Thompsons to try and get a straight answer from the council, but the council appears to not want to deal with this in an open and transparent way.\"",
  "summary": "A Scottish local authority is facing nearly 30 damages claims following a carbon monoxide leak at one of its primary schools.",
  "published": "Fri, 21 Nov 2025 06:20:44 GMT",
  "url": "https://www.bbc.com/news/articles/cly2y3wzyw4o?at_medium=RSS&at_campaign=rss",
  "source": "BBC News"
}