{
  "title": "Spanish PM calls for nation to heed past lessons on anniversary of Franco’s death",
  "text": "Spain has marked the 50th anniversary of Francisco Franco’s death with an absence of official events but a call from the prime minister to heed the lessons of the dictatorship and defend the democratic freedom “wrenched from us for so many years”.\n\nFranco, whose military coup against the elected republican government in 1936 triggered a civil war and brought about four decades of dictatorship, died in Madrid on 20 November 1975.\n\nAlthough the socialist government of the prime minister, Pedro Sánchez, has organised a year-long series of events to mark the post-Franco transformation, it ruled out any state acts on Thursday, the actual anniversary of the dictator’s death, to avoid accusations that it was seeking to celebrate his death.\n\nThe anniversary comes amid increasing concerns about the lack of knowledge about the dictatorship, especially among younger Spaniards. A poll last month revealed that more than 21% of those surveyed felt the Franco era was “good” or “very good”, while a poll on Thursday for El País found almost a quarter of Spaniards aged 18 to 28 felt that an authoritarian regime could sometimes be preferable to a democratic one.\n\nIn an opinion piece for the online newspaper elDiario.es, Sánchez hailed Spain’s “almost unique” democratic progress over the past 50 years, saying the country had “gone from being a repressive dictatorship to being a full democracy, and from being a poor and isolated country to one that is prosperous and integrated in the world”.\n\nBut the prime minister, who pointedly did not refer to Franco by name, also noted that “democracy didn’t fall from the sky”, adding that today’s freedoms had been secured by the determination and resilience of the Spanish people.\n\n“No democracy – including ours – is perfect,” he wrote. “Much remains to be done to forge the Spain we want and that we can be: a place of more opportunity; more rights and less inequality. Being conscious of all that is what will help us move forward and improve. And that is why it is precisely now – when some idealise authoritarian regimes and cling to the nostalgia of a past that never was – that we must step forward in defence of a freedom that was wrenched from us for so many years.”\n\nThe government has used historical memory legislation introduced three years ago to try to help Spain come to terms with its past. As well as redesignating the Valley of Cuelgamuros – previously known as the Valley of the Fallen, where Franco’s remains lay for 44 years – as a “place of memory”, it is compiling an inventory of the goods seized by the regime and is working to strip Spain of the last vestiges of Francoist symbols.\n\nView image in fullscreen The Valley of the Fallen, now known as the Valley of Cuelgamuros, which once held the remains of Francisco Franco. It contains the graves of more than 30,000 people from both sides of the Spanish civil war. Photograph: Violeta Santos Moura/Reuters\n\nThe government is also in the final stages of its attempts to shut down the Francisco Franco National Foundation, which exists to preserve and promote the dictator’s legacy.\n\nIn an interview with the state broadcaster, RTVE, on Thursday, the culture minister said his department was seeking to make sure that Franco’s official archive – currently in the possession of the foundation – was handed over to the state so it could be accessed by all Spaniards.\n\nskip past newsletter promotion Sign up to Headlines Europe Free newsletter A digest of the morning's main headlines from the Europe edition emailed direct to you every week day Enter your email address Sign up Privacy Notice: Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on theguardian.com to send you this newsletter. You can complete full registration at any time. For more information about how we use your data see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\n“The dissolution of the Francisco Franco Foundation raises the question of what happens with the archive,” said Ernest Urtasun. “We’ve already got a report, drawn up at the culture ministry, which is an inventory of the 30,000 documents in the dictator’s archive, and we have a report that proves that these documents are public documents that refer to the dictator as head of state and are therefore government property.”\n\nUrtasun said government lawyers were working to recover the archive, “which belongs to Spaniards and to researchers, so that everyone can document the repression and everything that’s there”.\n\nThe opposition conservative People’s party is boycotting the government’s initiative to celebrate 50 years of democracy, as is the far-right Vox party, which dismissed the programme as an “absurd necrophilia that divides Spaniards”.\n\nMore than 500,000 people perished in the civil war, while hundreds of thousands more were forced into exile. Reprisals continued well after Franco’s victory in 1939, and the bodies of more than 100,000 people killed during the war and in its aftermath are estimated to lie in unmarked mass graves.\n\nAfter the dictator’s death, Spain embarked on the transition back to democracy, holding its first free election in 41 years in 1977 and approving a new constitution in a referendum the following year.",
  "summary": "<p>Pedro Sánchez says his country must defend the democratic freedom ‘wrenched from us for so many years’</p><p>Spain has marked the 50th anniversary of Francisco Franco’s death with an absence of official events but a call from the prime minister to heed the lessons of the dictatorship and defend the democratic freedom “wrenched from us for so many years”.</p><p>Franco, whose military coup against the elected republican government in 1936 triggered a civil war and brought about four decades of dictatorship, died in Madrid on 20 November 1975.</p> <a href=\"https://www.theguardian.com/world/2025/nov/20/spanish-pm-calls-for-nation-to-heed-past-lessons-on-anniversary-of-francos-death\">Continue reading...</a>",
  "published": "Thu, 20 Nov 2025 13:34:58 GMT",
  "url": "https://www.theguardian.com/world/2025/nov/20/spanish-pm-calls-for-nation-to-heed-past-lessons-on-anniversary-of-francos-death",
  "source": "World news | The Guardian"
}