{
  "title": "Police failed to act on historic sex abuse claims against rapist Met officer",
  "text": "Police failed to act on historic sex abuse claims against rapist Met officer\n\n11 hours ago Share Save Daniel De Simone and Jo Adnitt BBC News Investigations Share Save\n\nSocial media\n\nWiltshire Police were told in 2016 that serial rapist David Carrick had abused his youngest victim but failed to take action, the BBC can reveal. Carrick, who was a Metropolitan Police officer, went on to rape five women before his arrest in 2021 and was jailed for life with a minimum term of 32 years in 2023. He was handed a further prison sentence on Thursday for abusing his youngest victim for 18 months, beginning in 1989, when she was 12 and he was a teenager. Speaking to the BBC, his victim Jo - not her real name - said the way her case was handled \"was disgraceful\". Wiltshire Police said the incident was \"a clear case\" of officers failing to properly investigate allegations made to them.\n\nA Hertfordshire Police investigation into Carrick, who was originally from Wiltshire, began in 2021 after a woman came forward to say she had been raped by him. He was eventually convicted of raping and abusing 12 women, who came forward to police once the inquiry began. But the BBC can reveal that Wiltshire Police were told in 2016 about Carrick's abuse of his youngest victim, who cannot be identified for legal reasons.\n\nAnother person - not Jo herself - contacted the force one night to report what happened decades before. When subsequently contacted by officers, the person said they had been drinking when they contacted police and had a poor memory about what happened years earlier. But Wiltshire Police failed to contact Jo herself and closed the investigation before it even began. They knew that Carrick was a Met Police officer, but did not tell their London counterparts about the reported abuse. Wiltshire officers also failed to search for Carrick in their own systems. Had officers done so, the search would have revealed he was already under investigation for a serious offence reported three days earlier.\n\nJo urges other women to not suffer in silence\n\nJo told the BBC the \"whole way it was handled was disgraceful\". She said that, had she been approached by officers in 2016, she would have told them everything. \"He'd have had five years of less offending if they'd spoken to me.\" She said Wiltshire Police should apologise to the women who were raped after 2016. \"If it was a member of the public, they would have probably done it a lot differently than a police officer.\" Jo wants Wiltshire Police to \"take accountability\" and make sure it never happens to anyone else, she said.\n\nIn a statement, Wiltshire Police \"apologised unreservedly to the person whose report we did not initially investigate as we should\". Two Wiltshire officers have since been found to have committed misconduct and given final written warnings.\n\nElsewhere, authorities had known about Carrick's abuse of Jo since 1990, when an NHS psychologist interviewed her. A letter from Carrick admitting the abuse was in his medical records, but police vetting didn't uncover it. He went on to join the Met in 2001. In his recent trial, the letter from Carrick was used as evidence. The BBC has separately seen a letter from an NHS psychologist, sent to a local GP practice in1990 who had spoken to Jo about the abuse. But there was no investigation into Carrick at the time.\n\nCPS Carrick penned this letter in August 1990 after sexually assaulting Jo",
  "summary": "In 2016, his local police force was made aware of sex abuse claims decades before he joined the Metropolitan Police.",
  "published": "Thu, 20 Nov 2025 19:21:01 GMT",
  "url": "https://www.bbc.com/news/articles/c1m3m2yg350o?at_medium=RSS&at_campaign=rss",
  "source": "BBC News"
}