{
  "title": "Scientists find a new way to help plants fight diseases",
  "text": "In a discovery three decades in the making, scientists at Rutgers and Brookhaven National Laboratory have acquired detailed knowledge about the internal structures and mode of regulation for a specialized protein and are proceeding to develop tools that can capitalize on its ability to help plants combat a wide range of diseases.\n\nThe work, which exploits a natural process where plant cells die on purpose to help the host plant stay healthy, is expected to have wide applications in the agricultural sector, offering new ways to protect major food crops from a variety of devastating diseases, the scientists said.\n\nIn a study published in Nature Communications, a team led by Eric Lam at Rutgers University-New Brunswick and Qun Liu at Brookhaven National Laboratory in New York reported that advanced crystallography and computer modeling techniques have enabled them to obtain the best picture yet of a pivotal plant protease, a protein enzyme that cuts other proteins, known as metacaspase 9.\n\n\"Understanding the shape and mode of activation for metacaspase 9 means we can now design long-sought tools to harness its known biological functions to protect plants from diseases and environmental stresses that could decimate crops,\" said Liu, a structural biologist in the Biology Department at Brookhaven.\n\nThe team has already started. Lam and Liu have filed for a provisional patent with the U.S. Patent and Trademark Office on technologies that can be developed from the discovery.\n\n\"This work could usher in much safer and effective treatments for our crops worldwide,\" said Lam, a Distinguished Professor in the Department of Plant Biology in the Rutgers School of Environmental and Biological Sciences and an author of the study.\n\nUsing Arabidopsis thaliana, an oft-studied plant also known as mouse-ear cress, the researchers employed a method known as X-ray crystallography at Brookhaven's National Synchrotron Light Source II (NSLS-II) to reveal the shape of metacaspase 9 at the atomic level. Knowing from previous research that the enzyme is activated by increased acidity, they observed and recorded how the enzyme changes shape when exposed to different concentrations of acid to reveal the key changes in the protein during its activation.\n\nTheir newly acquired complex understanding combines crystallography data with molecular dynamic simulations also completed at Brookhaven. This computer-based method allowed them to observe how the enzyme behaved and changed under different conditions. The team also performed laboratory experiments, including site-specific mutagenesis, a technique used by scientists to make precise changes to a specific part of a DNA sequence and validate the importance of specific parts of the protein that are needed for its activity.\n\nBy integrating this knowledge, the researchers discovered different parts of the enzyme act like either brakes or accelerators to ensure that it only will be active at an acidic pH.\n\nLam and his team have collaborated with Liu and his Brookhaven team for a decade in pursuit of a better understanding of the enzyme along with a related version, metacaspase 4. Lam has studied the process at the heart of the enzyme's pivotal role in plant health -- a phenomenon known as programmed cell death or cell suicide -- for the past 30 years.\n\nProgrammed cell death is a process where cells intentionally die as part of a natural and controlled mechanism, Lam said. It is the cell's way of committing suicide for the greater good of the organism. The process helps remove damaged or unnecessary cells, allowing an organism to stay healthy and develop properly. In plants, programmed cell death is crucial for fighting diseases and responding to stress.\n\nWork by other researchers has shown that metacaspase 9, which exists in plants but not in animals, is connected with programmed cell death and centrally involved in two major types of disease-causing agents for plants. When dealing with biotrophs, which are organisms that feed off living cells, metacaspase 9 helps kill infected cells to stop the disease. But with necrotrophs, organisms that kill plant cells before eating them, metacaspase 9 is hijacked into destroying the plant's own cells faster, which helps the invaders.\n\nThe researchers reason that strengthening metacaspase 9 may prevent biotrophic diseases. Conversely, jamming its function means the enzyme won't assist necrotrophs in killing healthy cells.\n\nAn example of a biotroph is the fungus-like oomycetes Phytophthora infestans, which caused the potato blight in Ireland and the ensuing famine in the mid-1800s. \"For many of the plant diseases, especially fungi, effective fungicide treatment options are few and, in many cases, environmental concerns are quite serious,\" Lam said. \"By creating hyperactive versions of metacaspase 9, we may protect plants from these biotrophs by causing cell death at the invasion site earlier, thus cutting off their food supply.\"\n\nThe research team has done just that, creating what Lam described as \"super-active variants\" of the enzyme that can be produced by plant genes when prodded to do so and could provide novel resistance traits to a slew of important diseases, such as powdery mildew and rusts.\n\nThe severe plant disease known as white mold is caused by the necrotrophic fungal pathogen Sclerotinia sclerotiorum, which can infect many crops. It is one of the diseases caused by fungal pathogens that could cause annual crop losses of between 10% and 20% of a total yield. This translates to financial losses of between $100 billion and $200 billion each year for agriculture, according to statistics compiled by the U.S. Department of Agriculture.\n\n\"To combat necrotrophic organisms that kill cells to feed on them, understanding how metacaspase 9 changes at the molecular level can help us create new agri- chemicals that block this enzyme efficiently without harming animals or the environment,\" Lam said. \"They could be used in agriculture to stop harmful necrotrophs from growing, leading to safer and more effective treatments for crops around the world.\"\n\nOther Rutgers researchers who contributed to this study include Zhili Pang, a postdoctoral associate in the Department of Plant Biology at the School of Environmental and Biological Sciences.\n\nHaijiao Liu of Brookhaven National Laboratory and Max Henderson of Stony Brook University in New York, graduate students who work under Liu's supervision, are the co-first authors on the paper. Qinfang Zhang of Stony Brook University also contributed to this study.\n\nThis work was funded by the U.S. Department of Energy's Office of Science and the National Science Foundation. The team used Highly Automated Macromolecular Crystallography (AMX) and Frontier Microfocusing Macromolecular Crystallography (FMX) beamlines at NSLS-II, a DOE Office of Science user facility.",
  "summary": "Laboratory could improve crop resilience In a discovery three decades in the making, scientists have acquired detailed knowledge about the internal structures and mode of regulation for a specialized protein and are proceeding to develop tools that can capitalize on its ability to help plants combat a wide range of diseases. The work, which exploits a natural process where plant cells die on purpose to help the host plant stay healthy, is expected to have wide applications in the agricultural sector, offering new ways to protect major food crops from a variety of devastating diseases, the scientists said.",
  "published": "Fri, 30 May 2025 12:39:47 EDT",
  "url": "https://www.sciencedaily.com/releases/2025/05/250530123947.htm",
  "source": "Latest Science News -- ScienceDaily"
}