{
  "title": "Punjab woman who failed to return from Pakistan has converted to Islam, married in Lahore: Police",
  "text": "Punjab woman missing Pakistan case: An Indian Sikh woman who travelled to Pakistan as part of a pilgrims’ group earlier this month has converted to Islam and married a Pakistani man she had known through social media for nearly a decade, Lahore police said on Saturday.\n\nSarabjeet Kaur, 48, from Amanipur village in Kapurthala district, was among nearly 2,000 Indian Sikh pilgrims who arrived in Pakistan on November 4 to participate in Guru Nanak Dev’s birth anniversary celebrations. When the group returned to India on 13 November, Kaur was reported missing.\n\nAccording to Lahore police, Kaur married Nasir Hussain, a resident of Farooqabad in Sheikhupura district, just a day after reaching Pakistan. A senior officer said she has taken the name Noor after converting to Islam.\n\nStory continues below this ad\n\n“The couple has gone into hiding and police are searching for them,” the officer told PTI, declining to comment on reports of intelligence agencies detaining the pair.\n\nA copy of the nikah nama, accessed by PTI, confirms the marriage. In a video circulating on social media, Kaur claims she married Hussain of her own free will, adding that she had been in touch with him on social media for nine years. She also stated she is a divorcee and wanted to start a new life with him.\n\nAppearing before a judicial magistrate, Kaur reiterated that she was not abducted and was “happily married”. She said she brought nothing from India apart from the clothes she was wearing.\n\nIndian investigation underway\n\nPunjab Police in India said an investigation into her disappearance is ongoing. Kapurthala ASP Dheerendra Verma said there is no official confirmation yet regarding her conversion. Officials confirmed she received her passport in January 2024.\n\nStory continues below this ad\n\nAnother officer claimed Kaur faces three previous cases of cheating and fraud—two in Kapurthala and one in Bathinda—though court proceedings in these cases are “almost over.”\n\nIn the video, Kaur alleges that unknown individuals entered Hussain’s home after the marriage, misbehaved with the couple and threatened them with false cases, prompting the two to flee. She appealed to the Pakistani authorities for protection.\n\nNot the first such case\n\nThis incident echoes a similar 2018 case involving Kiran Bala from Hoshiarpur, who went missing during a pilgrimage to Pakistan and later converted to Islam, marrying a Pakistani man and adopting the name Amna Bibi. She had left behind her three children in India.\n\nShiromani Gurdwara Parbandhak Committee (SGPC) officials said they only forward lists of pilgrims and that background checks are the government’s responsibility.\n\n(With Inputs from PTI)",
  "summary": "",
  "published": "Sat, 15 Nov 2025 17:07:32 +0000",
  "url": "https://indianexpress.com/article/india/married-free-will-indian-sikh-woman-converts-islam-pakistani-man-punjab-10368163/",
  "source": "India | The Indian Express"
}