{
  "title": "In first use of Act from 1950, Assam issues orders to 5 people: ‘Remove yourself from India within 24 hours’",
  "text": "In the first known invocation of the Immigrants (Expulsion from Assam) Act, 1950, since the state cabinet approved its implementation earlier this year, the Sonitpur district administration has issued orders directing five people – who had been declared foreigners by a tribunal this year – to “remove” themselves from India within 24 hours.\n\nFollowing the issue of these orders on Tuesday, police said their whereabouts are unknown and that they are “absconding”. Locals said they left the area and have not lived there for over a decade.\n\nThe five people – four women and a man, who are reportedly from two families – have been identified as residents of Dhobokata village in Sonitpur district. According to the orders issued to them signed by Deputy Commissioner (DC) Ananda Kumar Das, the border police had referred cases against them to the Foreigners Tribunal No. 2 in Sonitpur in 2006, which passed orders declaring them foreigners this year.\n\nAlso Read | How latest drive to deport illegal Bangladeshi immigrants stands out\n\nThe order states that the DC is of the opinion that, as “Declared Foreigners”, their “presence in Assam/India is detrimental to the interest of the general public and also for the internal security of the state”.\n\nInvoking the 1950 Act, the orders direct them to “remove yourself from the territory of Assam, India, within 24 hours from receiving this order via the Dhubri/Sribhumi/South Salmara-Mankachar route”, which leads to Bangladesh.\n\nThe orders further state that if they “default” on these directions, the government would take “appropriate action” to “remove” them from Assam.\n\nA team of Sonitpur police visited the village on Thursday. “They are absconding and their whereabouts are currently not known. We are searching for them, and once they are located, we will take appropriate action as per law,” Senior Superintendent of Police, Sonitpur, Barun Purkayastha told The Indian Express.\n\nStory continues below this ad\n\nZakir Hussain, a resident of a neighbouring village, said that locals have not known the whereabouts of the two families for years. “They came to the village from somewhere in Central Assam and settled here 19-20 years ago. They were viewed with suspicion, and there were issues, after which some locals reported them to the border police. They left the village around that time itself,” he said.\n\nThe Act\n\nIn September this year, the Assam cabinet approved standard operating procedures for the 1950 Act, which has been dormant since that year itself.\n\nThe IEAA 1950 was a legislation drafted by the Union Government of the time, following pressure from the then Assam government about the need for measures to check migration from then East Pakistan in the years following Partition.\n\nThe Act stated that if the central government was of the opinion that the stay of any person – who was ordinarily a resident of any place outside India and had come to Assam either before or after the commencement of the Act – in Assam “is detrimental to the interests of the general public of India or any section thereof or of any Scheduled Tribe in Assam”, it could direct such a person to “remove himself or themselves” from Assam or India “within such time and by such route as may be specified in the order”. It stated that the central government can delegate this power to any officer of the Centre or the Assam government.\n\nStory continues below this ad\n\nThe formal process of deportation entails a handover to the authorities of the other country after mutual verification that an individual is a national of the other country. Assam Chief Minister Himanta Biswa Sarma has, however, said that, under the 1950 Act, they will be able to “bypass diplomatic channels”.",
  "summary": "",
  "published": "Thu, 20 Nov 2025 08:18:09 +0000",
  "url": "https://indianexpress.com/article/india/act-1950-assam-issues-orders-remove-yourself-india-24-hours-10376008/",
  "source": "India | The Indian Express"
}