{
  "title": "Trump Teases Oval Office Showdown With Zohran Mamdani",
  "text": "LOADING ERROR LOADING\n\nPresident Donald Trump on Wednesday said he plans to host New York City Mayor-elect Zohran Mamdani for a meeting in the Oval Office this week.\n\nIn a Truth Social post, Trump wrote that Mamdani had requested the sitdown.\n\n“We have agreed that this meeting will take place at the Oval Office on Friday, November 21st,” Trump wrote. “Further details to follow!”\n\nAdvertisement\n\nThe much-anticipated faceoff comes on the heels of Mamdani’s victory in the city’s mayoral race earlier this month, where he defeated Trump-endorsed Andrew Cuomo, the former governor of New York, who ran as an independent after losing the Democratic primary to the 34-year-old democratic socialist.\n\nIn an interview with MS NOW’s Chris Hayes ahead of Trump’s announcement, Mamdani confirmed he had reached out to the White House to schedule a meeting with Trump.\n\n“I want to just speak plainly to the president about what it means to actually stand up for New Yorkers, and the way in which New Yorkers are struggling to afford this city,” Mamdani said when asked about his goal for the visit.\n\nAdvertisement\n\nNew York City Mayor-elect Zohran Mamdani talks to reporters at a news conference in New York, on Nov. 17, 2025. AP Photo/Seth Wenig\n\nMamdani had previously said he planned to call Trump before he takes office on Jan. 1, 2026, telling NBC New York last week that their relationship “will be critical to the success of the city.”\n\nThe incoming mayor, though, has made no secret of his intent to fight Trump if his policies jeopardize the interests of New Yorkers.\n\nAdvertisement\n\n“If anyone can show a nation betrayed by Donald Trump how to defeat him, it is the city that gave rise to him,” Mamdani said in his victory speech. “And if there is any way to terrify a despot, it is by dismantling the very conditions that allowed him to accumulate power. This is not only how we stop Trump, it is how we stop the next one.”\n\nHe added, “So Donald Trump, since I know you’re watching. I have four words for you: Turn the volume up.”",
  "summary": "The much-anticipated faceoff comes on the heels of Mamdani’s victory against the Trump-endorsed candidate in the race, Andrew Cuomo.",
  "published": "Thu, 20 Nov 2025 07:25:24 -0500",
  "url": "https://www.huffpost.com/entry/trump-announces-meeting-with-mamdani_n_691eea40e4b00ed8a94f2115",
  "source": "Politics"
}