{
  "title": "Early driver of prostate cancer aggressiveness",
  "text": "Researchers at the University of Michigan Rogel Cancer Center identified a gene that plays a key role in prostate cancer cells that have transitioned to a more aggressive, treatment-resistant form. The gene can be indirectly targeted with an existing class of drugs, suggesting a potential treatment strategy for patients with aggressive subtypes of prostate cancer.\n\n\"Patients whose prostate tumors lose reliance on the androgen receptor do poorly. Our results suggest a therapeutic approach for patients whose tumors have undergone that shift,\" said senior study author Joshi J. Alumkal, M.D., the Wicha Family Professor of Oncology at the University of Michigan Rogel Cancer Center.\n\nThe work advances earlier studies that found prostate cancer cells undergo a process called lineage plasticity, in which they become resistant to targeting the androgen receptor, a key target in prostate cancer. This transition away from dependence on the androgen receptor is a continuum with cancer cells taking on alternate identities from what is typical in most prostate cancers that rely on the androgen receptor.\n\nIn this new study, led by Zhi Duan, Ph.D., and published in the Journal of Clinical Investigation, the team examined which factors might be causing this transition to occur. They identified the gene PROX1, which plays a role in dictating cell identity in both normal cells and cancer cells. The team found that as prostate cancer cells transition to an alternate identity, PROX1 becomes more highly expressed.\n\nTheir studies implicating PROX1 began by examining patient tumor biopsies that had undergone lineage plasticity. PROX1 was the top upregulated gene. By examining hundreds of patient tumors along the continuum of lineage plasticity, they confirmed PROX1 as an early marker of lineage plasticity. Indeed, they found that tumors with low activity of the androgen receptor (called double-negative prostate cancer) in addition to tumors that completely lose expression of the androgen receptor (called neuroendocrine prostate cancer) turn on PROX1.\n\nIn additional experiments, the team showed PROX1 expression was inversely correlated with androgen receptor expression in prostate cancer patient tumor datasets. Adding PROX1 to prostate cancer cells also turned off the androgen receptor.\n\n\"We think PROX1 is regulating the androgen receptor. It may be one explanation for why the androgen receptor gets turned off when tumors undergo lineage plasticity and transition away from the typical glandular prostate cancer identity,\" Alumkal said.\n\nNext, the team eliminated PROX1 expression with genetic methods in both double-negative prostate cancer and neuroendocrine prostate cancer cells. The cells then stopped growing and began to die, suggesting that targeting PROX1 could be an effective way to control these tumors.\n\nOne challenge is that PROX1 is a transcription factor, meaning its function to turn on genes, and this type of protein is notoriously difficult to target with drugs. Looking for a workaround, the team turned to the company PROX1 keeps.\n\n\"We examined the proteins that bind to PROX1. Among the top partners were histone deacetylases, or HDACs. We felt like this was guilt by association. We hypothesized that HDACs might cooperate with PROX1 and that targeting HDACs might be like targeting PROX1,\" Alumkal said.\n\nHDACs are already known to play a role in cancer, and several HDAC inhibitors have been approved by the U.S. Food and Drug Administration for other cancers other than prostate.\n\nThe team found that PROX1-expressing prostate cancer cells were very sensitive to HDAC inhibitors and treatment with these drugs depleted PROX1 protein. As PROX1 expression decreased, the tumor cells died. The impact was similar to when the team genetically removed PROX1 from the cells.\n\n\"Our work implicates PROX1 as an important early driver away from androgen receptor dependence. HDAC inhibitors can block PROX1 and reduce survival of aggressive prostate tumor models that have transitioned away from androgen receptor reliance. Our results suggest this class of drugs should be prioritized for clinical trials in patients who have aggressive prostate cancer subtypes, for which there are few treatment options,\" Alumkal said.\n\nAdditional authors: Mingchen Shi, Anbarasu Kumaraswamy, Dong Lin, Dhruv Khokhani, Yong Wang, Chao Zhang, Fiana Flores, Eva Rodansky, Olivia A. Swaim, William K. Storck, Hannah Beck, Radhika A. Patel, Erolcan Sayar, Brian P. Hanratty, Hui Xue, Xin Dong, Zoe R. Maylin, Rensheng Wan, David A. Quigley, Martin Sjostrom, Ya-Mei Hu, Faming Zhao, Zheng Xia, Siyuan Cheng, Xiuping Yu, Felix Y. Feng, Li Zhang, Rahul Aggarwal, Eric J. Small, Visweswaran Ravikumar, Arvind Rao, Karan Bedi, John K. Lee, Colm Morrissey, Ilsa Coleman, Peter S. Nelson, Eva Corey, Aaron Udager, Ryan Rebernick, Marcin P. Cieslik, Arul M. Chinnaiyan, Joel A. Yates, Michael C. Haffner, Yuzhuo Wang\n\nFunding for this work is from National Institutes of Health grants CA251245, CA282005, CA186786, P30CA046592, T90DE030859, GM147365, CA214955-01A1, CA274336, P50CA97186, CA163227; U.S. Department of Defense grants W81XWH-22-1-0833, HT94252410252, W81XWH2110539; Joint Institute for Cancer Research, Prostate Cancer Foundation, Canadian Institutes of Health Research, Terry Fox Research Institute, Canadian Cancer Society, BC Cancer Foundation, Smith Family Scholar Award, Sheppard Family Foundation, Benioff Initiative for Prostate Cancer Research, Silver Family Innovation Foundation, National Science Foundation grant 2152776, Institute for Prostate Cancer Research",
  "summary": "Researchers have identified a gene that plays a key role in prostate cancer cells that have transitioned to a more aggressive, treatment-resistant form. The gene can be indirectly targeted with an existing class of drugs, suggesting a potential treatment strategy for patients with aggressive subtypes of prostate cancer.",
  "published": "Mon, 02 Jun 2025 22:54:06 EDT",
  "url": "https://www.sciencedaily.com/releases/2025/06/250602225406.htm",
  "source": "Latest Science News -- ScienceDaily"
}