{
  "title": "Two suicides, BLO protests threaten to disrupt SIR in Tamil Nadu, Kerala, Rajasthan",
  "text": "TWO DEATHS and multiple complaints from Booth Level Officer (BLOs) of “excessive workload and unreasonable demands and targets” are threatening to disrupt the Special Intensive Revision (SIR) of electoral rolls in at least three states — Kerala, Tamil Nadu and Rajasthan.\n\nIn Kerala, a political storm is simmering over the alleged suicide of BLO Aneesh George on Sunday. George, 44, the BLO for booth number 18 under Payyanur Assembly seat in Kannur district, was found dead in his house. No suicide note was recovered but his family and close friends alleged that George, an office attendant at a school, was under pressure to complete his job within the stipulated time, that is, by December 4. On Monday, BLOs in the state boycotted work protesting George’s “suicide”.\n\nVarious trade unions of state government employees held protests at the Chief Electoral Officer’s (CEO) office in Thiruvananthapuram and district collectorates, demanding that authorities refrain from exerting pressure on BLOs and consider postponing the SIR.\n\nStory continues below this ad\n\nGeorge’s death also triggered protests from the CPI(M) and the Congress, which have demanded postponing the SIR process until the third week of December, after the local body elections are over.\n\nMeanwhile, in his report on George’s death, Kannur District Collector Arun K Vijayan, who is also the district electoral officer, indicated that the BLO was not under any work pressure. The collector said 1,065 enumeration forms had been issued to George for distribution. Upon verification on November 16, it was found that only 50 forms remained to be distributed. The rest of the forms had been distributed, but were not digitally updated, the report states.\n\nIn Tamil Nadu, the Federation of Associations of Revenue Employees (FERA) said it will begin a statewide boycott of the SIR exercise from November 18 in protest against the workload and unreasonable targets that have left them juggling multiple assignments.\n\nIn a representation to the CEO of Tamil Nadu, FERA urged the removal of the severe work pressures and mental stress caused by the ongoing SIR exercise in Tamil Nadu. It also demanded more time for the revision, proper training for officials, additional staff and volunteers, an end to midnight review meetings and mandatory holiday work, and an honorarium equalling one month’s salary for the workload involved.\n\nStory continues below this ad\n\nSix officers involved in the exercise told The Indian Express that they are also burdened with monsoon and control room duties and other mandatory seasonal works. “Either you simplify the process or get an extension… These officers (BLOs) end up facing the heat from the public (because of the time frame) as well as immense pressure from the government,” said an officer.\n\nAccording to FERA’s declaration, from Tuesday onwards, all work related to the SIR, including receiving and distributing SIR forms, uploading them online (digitisation) and attending SIR review meetings, will be boycotted by all revenue department employees as well as departmental associations whose members serve as BLOs — noon-meal workers, anganwadi workers, municipal staff, teachers, and supervisors.\n\nIn Rajasthan’s Jaipur, where a government school teacher appointed as BLO allegedly died after jumping in front of a running train on Sunday, his family said roll revision workload and deadline pressure pushed him to take the extreme step. Mukesh Jangid, 45, a resident of Dharmpura village in Alwar district, worked at a government primary school in Jaipur.\n\nBindayaka police station in-charge Vinod Kumar told The Indian Express: “A suicide note was recovered from his body which stated that he was facing extreme work pressure from his supervisor. He was asked to complete his target of the SIR process or he will be suspended. He stated in the note that he wasn’t able to sleep at night for the last few days.”\n\nStory continues below this ad\n\nMukesh’s uncle Satyanarayan Dhangi told The Indian Express that he was working non-stop for 12 hours a day. “This is what forced him to kill himself. We want action against the people (responsible for his death) and some help for his family,” said Dhangi.\n\nThe Indian Express made multiple calls and sent messages to state CEO Naveen but did not receive any response.\n\nVipin Prakash Sharma, state general secretary of the Akhil Rajasthan Rajya Karmachari Sanyukt Mahasangh, said the constant push from the state, the district collector and the SDM is creating unnecessary pressure on field workers.\n\n“The quality of data should be prioritised over quantity. I appeal that no undue pressure be placed on BLOs during SIR,” said Sharma. A memorandum will be submitted to Chief Minister Bhajan Lal Sharma on Tuesday, urging officials to refrain from exerting too much pressure, said Sharma, adding that half-yearly exams are beginning and the absence of teachers from schools would affect students’ education.\n\nStory continues below this ad\n\nRajasthan Congress spokesperson Swarnim Chaturvedi demanded proper investigation and action against the persons responsible for his suicide.",
  "summary": "",
  "published": "Tue, 18 Nov 2025 01:30:50 +0000",
  "url": "https://indianexpress.com/article/india/two-suicides-blo-protests-threaten-to-disrupt-sir-in-tamil-nadu-kerala-rajasthan-10371492/",
  "source": "India | The Indian Express"
}