{
  "title": "Nectar wars between bumble bees and invasive ants drain the hive",
  "text": "When bumble bees come up against invasive Argentine ants at feeding sites, they may win a direct confrontation but still return to the colony with less food. These encounters can leave bees with fewer resources even when they appear to come out ahead in a fight.\n\nBumble bees already deal with significant challenges from pesticide exposure, shrinking natural habitat, and widespread diseases. Former University of California, Riverside entomology graduate student Michelle Miner questioned whether the added pressure from aggressive ants could be making things worse for these essential pollinators.\n\n\"With how important bumble bees are as pollinators, it made sense to try and understand more about what's going on in these tiny nectar wars, because they could have a big impact,\" Miner said.\n\nStudying Ant and Bee Interactions\n\nMiner's findings, published in the Journal of Insect Science, involved an extensive review of more than 4,300 individual behaviors recorded from over 415 bumble bees.\n\nThe experiments took place in the lab of UCR professor Erin Wilson Rankin. Six bumble bee colonies foraged in a shared arena where they could approach feeders that either had ants nearby or had no ants at all.\n\nArgentine ants, often called sugar ants, rely on biting rather than stinging. Their strength comes from their ability to gather in large numbers and overwhelm other insects.\n\n\"They can dominate a food resource just by showing up en masse,\" Wilson Rankin said.\n\nBees Avoid Ant Crowds but Still Risk Bites\n\nThe bees consistently chose to stay away from feeders with ants. As the number of ants increased, bees were less willing to feed there. More ants also meant a higher likelihood of bees being bitten. Although the bites were not deadly, the bees sometimes retaliated.\n\n\"We do see the aggression being bi-directional,\" Wilson Rankin said. \"Sometimes you'll see ant heads on the bee legs because they were feeding and in response to an attack, the bee bit the ant and decapitated it.\"\n\nWhile bumble bees can sting without dying (unlike honeybees), Miner never observed stinging behavior during these trials. Instead, bees relied on their mandibles to defend themselves.\n\n\"Mandibles are like teeth but not only used to chew,\" Miner said. \"They can flare open to handle flowers or crunch a foe.\"\n\nWinning Fights but Losing Foraging Time\n\nThe bees' larger size helped them prevail against individual ants in most direct confrontations during the lab study. However, this apparent advantage did not necessarily translate into a positive outcome for the entire colony.\n\nRather than returning immediately to forage after meeting an ant, bees frequently engaged in repeated aggressive exchanges.\n\n\"The ant presence induced prolonged aggressive exchanges,\" Wilson Rankin said. \"Even though that one bee might benefit from being aggressive in the short term, it may not be beneficial for the colony overall.\"\n\nEnergy Loss and Uncertain Colony Impacts\n\nOnce bees shift into attack behavior, they stop gathering food.\n\n\"They're wasting energy, they could be getting harmed, and they're not bringing food back,\" Wilson Rankin said.\n\nScientists still do not know how the colony responds when foragers return with less than expected.\n\n\"We do know that the youngest bees don't leave the colony. Once they're old enough to 'get their licenses' they go out and forage,\" Wilson Rankin said. \"We don't know if the colony sends out additional foragers when one comes back short. That's the next question it's important to answer.\"",
  "summary": "Bumble bees battling invasive Argentine ants may win individual fights but ultimately lose valuable foraging time, putting pressure on colonies already strained by habitat loss, disease, and pesticides. New research shows bees often avoid ant-occupied feeders, and while their size helps them win one-on-one clashes, these encounters trigger prolonged aggression that keeps them from collecting food.",
  "published": "Thu, 13 Nov 2025 09:12:29 EST",
  "url": "https://www.sciencedaily.com/releases/2025/11/251113071606.htm",
  "source": "All Top News -- ScienceDaily"
}