{
  "title": "Fugees rapper sentenced to 14 years in prison over illegal Obama donations",
  "text": "A United States district judge has sentenced Prakazrel “Pras” Michel, a member of 1990s hip-hop group the Fugees, to 14 years in prison for illegally funnelling millions of dollars in foreign contributions to former US President Barack Obama’s 2012 re-election campaign.\n\nMichel declined to address the court before Judge Colleen Kollar-Kotelly sentenced him on Thursday. The trial in Washington, DC, included testimony from former Attorney General Jeff Sessions and Hollywood actor Leonardo DiCaprio.\n\nThis week’s sentencing came after a federal jury convicted Michel on 10 counts, including conspiracy and acting as an unregistered agent of a foreign government, in April 2023.\n\nMichel obtained more than $120m from fugitive Malaysian financier Low Taek Jho – also known as Jho Low – and steered some of that money through straw donors to Obama’s campaign.\n\nLow is wanted for his leading role in the 1MDB scandal, in which billions of dollars were pilfered from Malaysia’s state investment fund in one of the largest financial frauds in history.\n\nSeveral senior financial figures and members of Malaysia’s government have been convicted for their role in the scandal, including disgraced former Prime Minister Najib Razak, who was handed a 12-year prison sentence in 2022, which was later halved.\n\nCourt documents, filed by Justice Department prosecutors on Thursday, said the 52-year-old Grammy-winning rapper “lied unapologetically and unrelentingly to carry out his schemes” as he syphoned illegal payments from Low to the Obama campaign.\n\nAdvertisement\n\nIt is illegal in the US for foreigners to donate to election campaigns, as well as to pay someone else to make a campaign contribution.\n\n“Prakazrel Michel betrayed his country for money. He funnelled millions of dollars in prohibited foreign contributions into a United States presidential election and attempted to manipulate a sitting president to serve a foreign criminal and a foreign power,” prosecutors said.\n\nProsecutors also said Michel had attempted to end a Justice Department investigation into Low and the 1MDB scandal, as well as “tampered with witnesses and then perjured himself at trial”.\n\nJudge Kollar-Kotelly was advised by prosecutors that federal sentencing guidelines recommended a life sentence for such crimes, urging her to take into account the “breadth and depth of his crimes, his indifference to the risks to his country, and the magnitude of his greed”.\n\nMichel’s lawyers downplayed the extent of his crimes, saying Low’s motivation for donating money was not to “achieve some policy objective”.\n\n“Instead, Low simply wanted to obtain a photograph with himself and then-President Obama,” Michel’s lawyers wrote.\n\nLow – who remains in hiding and claims innocence – courted America’s rich and famous during a years-long spending spree allegedly financed by funds stolen from 1MDB.\n\nNotably, he was one of the primary financiers of the 2013 film The Wolf of Wall Street, starring DiCaprio.\n\nDefence lawyer Peter Zeidenberg said Michel will appeal.\n\nHe labelled his client’s 14-year sentence “completely disproportionate to the offence” and “absurdly high” given such terms are typically reserved for deadly terrorists and drug cartel leaders.\n\nInstead, Zeidenberg recommended a three-year prison sentence for Michel.\n\nMichel, a Brooklyn native whose parents immigrated to the US from Haiti, was a founding member of the Fugees along with childhood friends Lauryn Hill and Wyclef Jean. The group won two Grammy Awards during their peak in the 1990s and sold tens of millions of albums.",
  "summary": "Justice Department prosecutors accused Grammy-winning rapper Pras Michel of betraying his country for money.",
  "published": "Fri, 21 Nov 2025 03:55:42 +0000",
  "url": "https://www.aljazeera.com/news/2025/11/21/fugees-rapper-sentenced-to-14-years-in-prison-over-illegal-obama-donations?traffic_source=rss",
  "source": "Al Jazeera – Breaking News, World News and Video from Al Jazeera"
}