{
  "title": "Why Herefordshire was the perfect stand-in for Shakespeare’s Stratford in the new film of Hamnet",
  "text": "The door creaks as I push it back and move forward into the gloom. The ceiling is vaulted and dark, but light falls in shafts of gold from the upper windows, revealing ancient stone carvings and tombs. It’s the right atmosphere for a ghost-hunt. I take a few steps and the door clicks, making me jump. Must be the wind.\n\nThe Guardian’s journalism is independent. We will earn a commission if you buy something through an affiliate link. Learn more.\n\nExploring old English churches is always a pleasure. There is no one to disturb you, and in the dim quiet will be a historical jaw-dropper: a centuries-old face carved in oak, a grisly tomb, an inscription to the dead hero of a forgotten battle. Each site is a mini detective puzzle, waiting to be unravelled, often with a helpful booklet available near the door. The spirits of those who have shuffled off this mortal coil hang in the dust motes, but here, in Weobley, Herefordshire, I am looking for someone specific.\n\nIt is a standard opener for any work on William Shakespeare to declare how few facts we know about the most famous playwright of all time. No matter, every snippet has launched a thousand academic careers, a swarm of novels, and dozens of films. The latest on the big screen is Hamnet, based on the bestselling 2020 novel by Maggie O’Farrell, and starring Jessie Buckley and Paul Mescal. The book conjures up the Elizabethan world of Shakespeare and his wife, Agnes (AKA Anne), at a time when plague is ravaging Warwickshire and filling their Stratford home with grief. In 1596, their 11-year-old son, Hamnet, dies, a tragedy that seems to have spurred his father into a burst of creative energy. When filming the adaptation of O’Farrell’s powerful literary evocation, some very special locations were needed, and the scouts found them in the Welsh borders and in Weobley.\n\nWandering through the town, it’s easy to see why this place was chosen to stand in for Stratford-upon-Avon: it’s a half-timbered heaven of rambling crooked buildings. Many of these were old before the Bard was born. In his era, chimney stacks were a modern addition and you can still see the join. I pass the two pubs, the Unicorn and Ye Olde Salutation Inn, each worthy of that fat rascal, Sir John Falstaff, lighting up the bar like “a candle, the better half burnt out”.\n\nView image in fullscreen Jessie Buckley and Paul Mescal in Hamnet. Photograph: Landmark Media/Alamy\n\nFarther down the hill, past innumerable leaning lintels and pot-bellied ancient windows, is the excellent small museum, presided over by archivist Sue, who is a mine of information on the place. The only Elizabethan exhibit I can find, however, is a silver sixpence found by a metal detectorist. At Sue’s suggestion, I set off for the church of St Peter & St Paul. As I approach it’s obvious that Weobley was not always so obscure: there’s the 185ft (56-metre) spire, supported by flying buttresses, built in the 14th century when the town was a big deal. The autumnal churchyard is rich in mushrooms and acorns, but what about Shakespearean resonances? Inside the church, walking slowly up the nave, I see the stone body of a knight lying on a plinth and there’s a name, Devereux.\n\nIf anywhere rivals Weobley for the Most Shakespearean crown, it would be Pembridge. Two pubs lean over the highway, like a pair of old codgers ‘fat-witted with drinking’\n\nNow I get a shiver. It’s a name that every Elizabethan knew, a name that haunted the Bard’s career and nearly brought disaster. One night in 1601, Shakespeare’s troupe, the Lord Chamberlain’s Men, were offered a handsome sum by supporters of Robert Devereux, the Earl of Essex, to stage his drama Richard II, which features the overthrow of a monarch. The morning after the performance at the Globe theatre in London, the earl rode into London with 300 armed men, determined to unseat Elizabeth I. The plan failed. Essex was beheaded, as were several members of the play’s audience. Anxious times for anyone involved in the production.\n\nView image in fullscreen The medieval church of St Peter & St Paul in Weobley. Photograph: NorthScape/Alamy\n\nI peer closer at the tomb, carved with the initials of generations of choirboys. This is Walter Devereux, died 1402. A quick online search reveals that Walter was not only a direct ancestor of the rebel Essex, but had fought alongside Richard II in Scotland, then jumped ship to support Henry Bolingbroke, the future Henry IV, only to die at the Battle of Bryn Glas, one of the “men of Herefordshire” butchered by Owain Glyndŵr’s army. This knight laid out before me is not named in either of Shakespeare’s Henry IV plays, but he must have known all of those characters who were (excluding the fictional Falstaff, of course).\n\nFrom Weobley I walk two miles through orchards, heavy with fruit, to Dilwyn where there’s another fine church, and a good pub, the Crown. From here I stroll on country lanes to Eardisland, another haven of the half-timber, the equal of Weobley. I then turn west, heading for Pembridge where I’m staying. Along the River Arrow, outside Eardisland, the path is blocked so I take off my boots and wade across the running brook, stopping halfway when a kingfisher streaks past me at waist height.\n\nHergest Ridge is part of the Offa’s Dyke Path and a classic route. Below is a labyrinthine world of winding lanes, ancient woodlands and meadows\n\nIf any town rivals Weobley for the “Most Shakespearean” crown, it would be Pembridge. Two pubs lean over the highway, like a pair of old codgers “fat-witted with drinking”; there’s a fine ancient market place, a church whose door is holed by civil war bullets, a gorgeous grocery shop and gaggles of higgledy-piggledy houses. Nearby is the Cider Barn restaurant, whose car park is crunchy with fallen walnuts and where guests are greeted with a delicious glass of local Black Fox cider.\n\nThat evening, in front of the log fire in Pembridge’s New Inn (it was new in Shakespeare’s time), I read up on Falstaff and discover that Shakespeare’s star comedian was based on the real-life Sir John Oldcastle, a man born at Almeley, five miles west of Weobley, and an exact contemporary of the Walter Devereux lying in Weobley church. The pair might have known each other, perhaps even fought at each other’s side, before Oldcastle turned heretic and got himself hanged. I love playing church detective and almost let out a whoop of delight, but I don’t think the wobbly shelves behind the bar could cope.\n\nView image in fullscreen Westonbury Mill Water Gardens. Photograph: Alex Ramsay/Alamy\n\nNext day I drive west, stopping at the wonderfully eccentric Westonbury Mill Water Gardens (good cafe) built by the late hydrogeologist Richard Pim, whose inspiration came partly from working in the Middle East and north Africa. Then I head through Kington to Hergest Croft Gardens (good cafe) where I start walking again. Hergest Ridge is part of the Offa’s Dyke Path and a classic route, the path following a direct line over the dome of Whet Stone hill, revealing vast panoramas of the surrounding countryside, including north to the battle site of Bryn Glas. Below the ridge is a labyrinthine world of winding lanes, ancient woodlands and meadows where Hamnet film scouts discovered Cwmmau, a substantial and almost untouched 16th-century farmhouse which stands in for Hewlands Farm, the childhood home of Agnes (the original is just outside Stratford and better known these days as Anne Hathaway’s cottage). Film location fees helped to fund essential conservation work on the farmhouse, which is managed by the National Trust and will reopen as a holiday cottage in December.\n\nAnd now my Shakespearean idyll is over – except I’ve forgotten to visit Sir John Oldcastle’s birthplace and play detective in the church at Almeley. There is nothing to be done except turn around and head straight back into the past. I have to admit, I like it there.\n\nAccommodation at the Old Bakehouse in Pembridge was provided by Sykes Cottages; from £513 for 7 nights, sleeps 4. Further information: visitherefordshire.co.uk/through-tudor-landscapes. Hamnet is in UK cinemas from 9 January 2026",
  "summary": "<p>Crooked buildings, welcoming inns, ancient woodlands … it’s easy to see why the location scouts chose this idyllic corner of England</p><p>The door creaks as I push it back and move forward into the gloom. The ceiling is vaulted and dark, but light falls in shafts of gold from the upper windows, revealing ancient stone carvings and tombs. It’s the right atmosphere for a ghost-hunt. I take a few steps and the door clicks, making me jump. Must be the wind.</p><p>Exploring old English churches is&nbsp;always a pleasure. There is no one to&nbsp;disturb you, and in the dim quiet will be a historical jaw-dropper: a&nbsp;centuries-old face carved in oak, a&nbsp;grisly tomb, an inscription to the dead hero of a forgotten battle. Each site is a mini detective puzzle, waiting to be unravelled, often with a helpful booklet available near the door. The spirits of those who have shuffled off&nbsp;this mortal coil hang in the dust&nbsp;motes, but here, in Weobley, Herefordshire, I am looking for someone specific.</p> <a href=\"https://www.theguardian.com/travel/2025/nov/17/why-herefordshire-was-the-perfect-stand-in-for-shakespeares-stratford-in-the-new-film-of-hamnet\">Continue reading...</a>",
  "published": "Mon, 17 Nov 2025 07:00:03 GMT",
  "url": "https://www.theguardian.com/travel/2025/nov/17/why-herefordshire-was-the-perfect-stand-in-for-shakespeares-stratford-in-the-new-film-of-hamnet",
  "source": "The Guardian"
}