{
  "title": "JNMF unveils Nehru Archive; 100-volume ‘Selected Works’ goes online in first phase",
  "text": "The Jawaharlal Nehru Memorial Fund (JNMF), run from the Teen Murti campus in New Delhi, on Thursday launched the Nehru Archive, to mark the first Prime Minister’s 136th birth anniversary this year. In the first phase, the ‘Selected Works of Jawaharlal Nehru’ has been made available online — with an entire set of 100 volumes, containing 35,000 documents — available free of cost for downloading.\n\nCongress general secretary Jairam Ramesh, a trustee of JNMF that carried out the exercise, said its second phase would entail efforts to locate letters to Nehru. “While the Selected Works contain many letters written by Nehru to various eminent personalities, the next phase would entail locating letters written to Nehru,” he said.\n\nThese would include, as per Ramesh, correspondence between Nehru and Rabindranath Tagore, Albert Einstein, Mahatma Gandhi, Maulana Azad, Rajendra Prasad, Sardar Vallabhbhai Patel, the Mountbatten family and between Nehru and Winston Churchill. For this, he added, some of the archives pertaining to these personalities have already been contacted — including the organisations holding papers pertaining to Churchill, Mountbatten and Einstein.\n\nThe archive runs parallel to the Jawaharlal Nehru archives currently being held by the Prime Ministers’ Museum & Library (PMML) at the same campus. The digital archive —aiming to be the authoritative resource on Nehru — also includes his Nehru’s speeches. The JNMF, a non-for-profit trust headed by Congress leader Sonia Gandhi, had announced the exercise on November 14 last year.\n\nThe idea is that it would be the “final authoritative and authenticated resource” on Nehru. Those behind the initiative say the data freely available from the archive will come in handy to dispel any false narratives about Nehru, even as Ramesh insisted that this is not a political exercise but an intellectual and historical one.\n\nRamesh said the Gandhi-Nehru, Sardar Vallabhbhai Patel-Nehru and Subhas Chandra Bose-Nehru correspondence is fairly comprehensive, but that is not the case with certain other correspondences such as Winston Churchill-Nehru and Rabindranath Tagore-Nehru. He said incorporating that would be of the biggest value to the Nehru archive.\n\nJNMF secretary Professor Madhavan K Palat said this online version would be of immense benefit to anybody who wishes to study any aspect of Indian history from the 1920s to the 1960s, the years when Nehru was a major leader of the movement for Independence and thereafter was prime minister of the country.\n\nStory continues below this ad\n\n“New items will be added in stages — photographs, audios, videos, books by Nehru, books and other publications on Nehru that appeared in his lifetime, any other documentation available in the public domain, the Hindi original of his speeches which had not been published in the Selected Works, and other similar items,” Palat added.\n\nAs reported by The Indian Express, during the Annual General Meeting (AGM) of the PMML, chaired by Defence Minister Rajnath Singh in February last year, a large part of the discussion centred on Nehru’s private papers in the PMML’s collection, of which 51 boxes were taken back by Congress leader Sonia Gandhi in May 2008.\n\nAccording to NMML records, the papers reclaimed include letters exchanged between Nehru and Jayaprakash Narayan, Edwina Mountbatten, Albert Einstein, Aruna Asaf Ali, Vijaya Laxmi Pandit and Jagjivan Ram.\n\nJNMF office-bearers say all public papers are part of the new archives, while anything considered private has been kept out. However, they added, if anyone offers access to any other correspondence pertaining to the life and times of the first Prime Minister, they would be happy to digitise it and make it accessible in due course.\n\nStory continues below this ad\n\nThe 100 volumes of ‘The Selected Works of Jawaharlal Nehru’ were put together by the JNMF over the last 50 years. The facsimiles of the original print version are also available alongside the digital text.",
  "summary": "",
  "published": "Fri, 21 Nov 2025 04:30:20 +0000",
  "url": "https://indianexpress.com/article/india/jnmf-nehru-archive-selected-works-jawaharlal-nehru-online-first-phase-10377635/",
  "source": "India | The Indian Express"
}