{
  "title": "Zelenskyy to negotiate with Trump over US-Russia peace deal requiring painful concessions",
  "text": "Volodymyr Zelenskyy has said he will negotiate with Donald Trump on a US-backed peace plan that called on Ukraine to make painful concessions in order to end the Kremlin’s invasion of his country.\n\nThe president’s office on Thursday confirmed he had received the draft peace plan, which was prepared by US and Russian officials, and that he would speak to Trump in the coming days about “existing diplomatic opportunities and the main points that are necessary for peace”.\n\nIn his nightly video address, Zelenskyy said Ukraine would do nothing to disrupt any diplomatic efforts.\n\n“Ukraine needs peace and Ukraine will do everything so that no one in the world can say we are upending diplomacy. This is important,” Zelenskyy said, adding that Ukraine would issue no “rash” statements.\n\n“The number one task for everyone is a constructive diplomatic process with America and all our partners. It is vital to have stable support for our army and all our planned defence operations and deep strikes.”\n\nThe cautious response from Ukraine’s presidential administration followed angry denouncements of the plan by some Ukrainian officials who called it “absurd” and unacceptable.\n\nAccording to reports, the sweeping 28-point proposal closely resembles demands made by Moscow soon after its full-scale invasion in early 2022. It was reportedly drawn up by Russian and US officials, with support from Trump. Kyiv was not consulted. One European diplomat said they learned of the plan only when they turned on the news.\n\nIt envisages Kyiv giving up Crimea and the Donbas region, while the frontlines of Kherson and Zaporizhzhia would be frozen along the current line of contact. Ukraine would agree to limit its army to 600,000 personnel, a reductions of hundreds of thousands.\n\nEuropean fighter jets would be based in Poland to protect Ukraine, but no Nato troops would be stationed in Ukraine and Kyiv would agree never to join the military alliance, according to the plan seen by Axios and AFP.\n\nNo foreign troops would be allowed on Ukrainian soil, a condition that rules out a post-deal peacekeeping force led by the UK and France. But the US would provide unspecified security guarantees, according to Axios. In addition, $100bn in frozen Russian assets would be dedicated to rebuilding Ukraine. There would also be a path to reintegrating Russia in the global economy, including the future lifting of sanctions, according to the Associate Press.\n\nUkrainian officials said the document amounted to the effective end of its existence as an independent country. It comes nearly four years after Russian troops tried and failed to seize Kyiv, and as efforts by the Trump administration to end the conflict remain stalled.\n\nZelenskyy held talks on Thursday with a high-ranking US military delegation, led by the army secretary Dan Driscoll.\n\nDriscoll – a former classmate of the US vice-president, JD Vance – arrived in Kyiv bearing important messages from the White House, US sources indicated. He is likely to travel to Moscow at the end of next week to discuss the plan with the Kremlin, they said.\n\nView image in fullscreen The US army secretary, Dan Driscoll, left, met the Ukrainian defence minister, Denys Shmyhal, in Kyiv. Photograph: AP\n\nAmerican diplomats said Donald Trump was trying to achieve peace “with an incredible sense of momentum”.\n\nHis administration was pursuing an “aggressive timeline” with the Ukrainians to reach an agreement, they added, and wanted to achieve this in the “shortest possible” period. The White House said the plan was “good” for both sides, rejecting concerns that it echoes many of Moscow’s demands.\n\nAfter an hour-long, one-to-one meeting between Driscoll and Zelenskyy, the chargé d’affaires at the US embassy in Kyiv, Julie Davis, said: “We have witnessed today a remarkable pace of diplomatic activity. We are going to continue these efforts today and tomorrow and keep at this.”\n\nOfficials in Kyiv were unimpressed. They said the proposal – reportedly drafted by Kirill Dmitriev, a close ally of Vladimir Putin, and Donald Trump’s special envoy Steve Witkoff – was a “provocation”, the aim of which was to stir up division and “disorientate” Ukraine’s allies, they added.\n\n“There are currently no signs that the Kremlin is ready for serious negotiations. Putin is trying to stall for time and avoid US sanctions,” said Oleksandr Merezhko, the chair of Ukraine’s foreign policy parliamentary committee.\n\n“It means capitulation, for Ukraine, for Europe and for America,” said Roman Kostenko, a Ukrainian commander and politician.\n\nView image in fullscreen Kirill Dmitriev, a Putin adviser and ally, ‘has spun this plan at a time when Zelenskyy is weak’, said one western diplomat. Photograph: Hamad I Mohammed/Reuters\n\nLast week, Trump named Driscoll as his new “special representative”. His mission to Kyiv included explaining the White House’s latest peace plan, as well as military meetings and discussions concerning battlefield innovation, a US official said. Two four-star generals travelled with him.\n\nKeith Kellogg, Trump’s special representative to Ukraine, has reportedly planned his departure, saying he would leave in January after a year in the post. Kellogg is regarded as being broadly sympathetic to Ukraine and has been consequently left out of direct US-Russian talks.\n\nThe White House’s renewed push to force Ukraine to make significant concessions in pursuit of “peace” comes at a difficult time for Zelenskyy, who is embroiled in the biggest political scandal since he became president in 2019.\n\nHis former business partner Timur Mindich and at least two government ministers are accused of involvement in a large-scale bribery scheme. Several deputies from Zelenskyy’s Servant of the People party have called on the president to dismiss Andriy Yermak, his powerful chief of staff.\n\nOne western diplomat said the Russians were seeking to take advantage of Ukraine’s domestic crisis.\n\n“It seems Dmitriev has spun this plan at a time when Zelenskyy is weak. The Russians are good at exploiting things,” they said. “It feels like every other Russian plan. I don’t think it’s going to fly with Ukraine.”\n\nThe diplomat said the Kremlin’s demands concerning the Russian language were a “hook” it could later exploit. The proposal did not offer the kind of security assurances Ukraine would need from the US and its European allies for any deal to stick, they added.\n\nEuropean leaders meeting in Brussels said they had not been warned in advance about the latest White House initiative.\n\nThe Trump administration no longer provided direct military aid to Kyiv, a fact that reduced its ability to impose a Moscow-friendly peace settlement on Ukraine, one source noted.\n\nThe EU’s foreign policy chief, Kaja Kallas, said Europe welcomed any efforts to achieve a long-lasting and just settlement of the war, but stressed: “For any plan to work, it needs Ukrainians and Europeans on board.”\n\nKallas said the Dmitriev-Witkoff proposal did not envisage Russia making any concessions. “We have to understand that in this war, there is one aggressor and one victim. If Russia really wanted peace, it could have agreed to an unconditional ceasefire already some time ago.”\n\nThe British government said it backed Trump’s desire to “bring this barbaric war to an end”.\n\n0:47 Moment Russian missile strikes apartment block in Ukraine – video\n\nBut it emphasised that “only the Ukrainian people can determine their future” and said Russia could end the fighting tomorrow by pulling out troops and ending its “illegal invasion”.\n\nUS efforts to broker peace have hit roadblocks since Trump met Putin in Alaska in August. The US president subsequently imposed sanctions on Russia’s oil industry, in an apparent attempt to push Putin to the negotiating table.\n\nTrump said last month that he was putting on hold his plan for a meeting with the Russian president in Budapest because he didn’t want it to be a “waste of time”.\n\nIn recent months Russia has increased its systematic attacks on Ukraine’s energy infrastructure, plunging much of the country into darkness. On Wednesday it bombed several western cities, including Ternopil, where 26 people, including three children, were killed in their homes.",
  "summary": "<p>Ukrainian president’s office issues statement after other officials condemn ‘absurd’ plan to end conflict</p><p>Volodymyr Zelenskyy has said he will negotiate with Donald Trump on a US-backed peace plan that called on Ukraine to make painful concessions in order to end the Kremlin’s invasion of his country.</p><p>The president’s office on Thursday confirmed he had received the draft peace plan, which was prepared by US and Russian officials, and that he would speak to Trump in the coming days about “existing diplomatic opportunities and the main points that are necessary for peace”.</p> <a href=\"https://www.theguardian.com/world/2025/nov/20/ukraine-us-russian-peace-proposal-is-absurd-and-unacceptable\">Continue reading...</a>",
  "published": "Thu, 20 Nov 2025 22:53:39 GMT",
  "url": "https://www.theguardian.com/world/2025/nov/20/ukraine-us-russian-peace-proposal-is-absurd-and-unacceptable",
  "source": "World news | The Guardian"
}