{
  "title": "All Kashmiris being looked at with suspicion after Delhi Red Fort blast, Omar says",
  "text": "Chief Minister Omar Abdullah on Wednesday said the people of Jammu and Kashmir are apprehensive about travelling outside the Union Territory as they are being seen as suspects for the violent acts of a few.\n\nSpeaking at an event in Kulgam, Abdullah said, “A few people are responsible for what happened in Delhi, but a perception is being created where all Kashmiris are being looked at with suspicion.”\n\n“In the prevailing circumstances after the blast near Red Fort on November 10, parents will not like to send their children outside. When we are looked at with suspicion, when we are defamed for someone else’s wrongdoing, then it is obvious that it will be very difficult for us to leave Kashmir,” he said.\n\nWeighing in on the situation, Abdullah said that he himself thinks twice before taking out his vehicle bearing J&K registration, in the national capital.\n\n“Today, even driving a J&K registration vehicle in Delhi is being seen as a crime. I wonder if I should take out my own car if there aren’t too many security personnel around me because what if I’m intercepted and asked for credentials,” Abdullah said.\n\n“If the people of J&K cannot leave for employment, then it is an even bigger responsibility on us to create job opportunities here,” the chief minister added.\n\nTaking a veiled dig at the Jammu and Kashmir Lieutenant Governor over security in the Valley, Abdullah said, “We were told that after 2019, the bloodshed of the past 30 to 35 years would not repeat. But it has not stopped. You have to ask those in charge of security.”\n\nStory continues below this ad\n\nAbdullah also met the families of two of the victims who lost their lives in the accidental explosion at Nowgam Police Station, extending his condolences to the bereaved families.\n\nAt Chancer village in Kulgam, he visited the house of Arshid Ahmad Shah, who worked as a photographer with the J&K Police Crime Branch. He also travelled to Hariparigam where he met the family of Javid Mansoor Rather, also a photographer with the Crime Branch.\n\nMeanwhile, the Director General of the J&K Police, Nalin Prabhat described the Nowgam incident as “an accidental explosion” due to the “unstable nature” of the chemicals being sampled for further investigation.",
  "summary": "",
  "published": "Wed, 19 Nov 2025 15:44:30 +0000",
  "url": "https://indianexpress.com/article/india/all-kashmiris-looked-suspicion-delhi-red-fort-blast-omar-abdullah-10374895/",
  "source": "India | The Indian Express"
}