{
  "title": "‘Chaotic’ culture in UK government led to more COVID deaths, inquiry finds",
  "text": "An inquiry commissioned in 2021 has found ex-PM Boris Johnson failed to act decisively to combat the global pandemic.\n\nThe “toxic and chaotic” culture at the centre of the United Kingdom’s government led to a delayed response to the COVID-19 pandemic that resulted in about 23,000 more deaths across the nation, a damning report from an inquiry into the government’s handling of the pandemic has found.\n\nThe inquiry, which former Prime Minister Boris Johnson ordered in May 2021, delivered a blistering assessment (PDF) on Thursday of his government’s response to COVID-19, criticising his indecisive leadership, lambasting his Downing Street office for breaking their own rules and castigating his top adviser Dominic Cummings. The inquiry was chaired by former judge Heather Hallett.\n\n“The failure to appreciate the scale of the threat, or the urgency of response it demanded, meant that by the time the possibility of a mandatory lockdown was first considered it was already too late and a lockdown had become unavoidable,” the inquiry found. “At the centre of the UK government there was a toxic and chaotic culture.”\n\nThe global pandemic, which began in 2020, killed millions of people worldwide, with countries enforcing lockdowns in an attempt to stop the spread of the virus.\n\nThe UK went into lockdown on March 23, 2020, at which time it was “too little, too late,” the inquiry found, revealing that if the nation had gone into lockdown just a week earlier, on March 16, the number of deaths in the first wave of the pandemic up to July would have been reduced by about 23,000, or 48 percent.\n\n“Had the UK been better prepared, lives would have been saved, suffering reduced and the economic cost of the pandemic far lower,” the inquiry found.\n\nAdvertisement\n\nA failure to act sooner again, as cases rose later in the year, also led to further national lockdowns, Hallett’s inquiry found.\n\nA campaign group for bereaved families said “it is devastating to think of the lives that could have been saved under a different Prime Minister”.\n\nThere was no immediate comment from Johnson on the inquiry’s findings.\n\nThe UK recorded more than 230,000 deaths from COVID, a similar death rate to the United States and Italy, but higher than elsewhere in western Europe, and it is still recovering from the economic consequences.\n\n“Mr. Johnson should have appreciated sooner that this was an emergency that required prime ministerial leadership to inject urgency into the response,” the inquiry found.\n\nFollowing the release of the inquiry’s findings, Sir Ed Davey called on Kemi Badenoch, the leader of the Conservative Party, to apologise on behalf of the Conservatives.\n\n“As this report is published, my thoughts and prayers are with all those who lost loved ones during the pandemic, and everyone who suffered,” Davey said. “This report confirms the abject failure of the last Conservative government.”\n\nEllie Chowns, a Green Party MP for North Herefordshire, said the British people were “let down” by their government.\n\n“Families and communities – especially children – are still living with the consequences. It’s vital to learn from this report, and invest far more seriously in pandemic preparedness, so that Britain can be secure and resilient if – or when – we are again faced with such a challenge.”\n\nThe first cases of COVID-19 were detected in Wuhan, China, in late 2019, and information from the country is seen as key to preventing future pandemics. As late as June 2025, the World Health Organization (WHO) said it was working to uncover the origin of the pandemic, with its work still incomplete, as critical information has “not been provided”.\n\n“We continue to appeal to China and any other country that has information about the origins of COVID-19 to share that information openly, in the interests of protecting the world from future pandemics,” WHO chief Tedros Adhanom Ghebreyesus said in June.\n\nIn 2021, Tedros launched the WHO Scientific Advisory Group for the Origins of Novel Pathogens (SAGO), a panel of 27 independent international experts.\n\nMarietjie Venter, the group’s chair, said earlier this year that most scientific data supports the hypothesis that the new coronavirus jumped to humans from animals.\n\nBut she added that after more than three years of work, SAGO was unable to get the necessary data to evaluate whether or not COVID was the result of a lab accident, despite repeated requests for detailed information made to the Chinese government.",
  "summary": "An inquiry commissioned in 2021 has found ex-PM Boris Johnson failed to act decisively to combat the global pandemic.",
  "published": "Thu, 20 Nov 2025 17:34:59 +0000",
  "url": "https://www.aljazeera.com/news/2025/11/20/chaotic-culture-in-uk-government-led-to-more-covid-deaths-inquiry-finds?traffic_source=rss",
  "source": "Al Jazeera – Breaking News, World News and Video from Al Jazeera"
}