{
  "title": "Light has been hiding a magnetic secret for nearly 200 years",
  "text": "Researchers at the Hebrew University of Jerusalem have found that the magnetic component of light plays a direct part in the Faraday Effect, overturning a 180-year belief that only light's electric field was involved. Their work shows that light can exert magnetic influence on matter, not simply illuminate it. This insight could support advances in optics, spintronics, and emerging quantum technologies.\n\nThe team's findings, published in Nature's Scientific Reports, show that the magnetic portion of light, not only its electric one, has a meaningful and measurable influence on how light interacts with materials. This result contradicts a scientific explanation that has shaped the understanding of the Faraday Effect since the nineteenth century.\n\nThe study, led by Dr. Amir Capua and Benjamin Assouline of the university's Institute of Electrical Engineering and Applied Physics, offers the first theoretical evidence that the oscillating magnetic field of light contributes directly to the Faraday Effect. This effect describes how the polarization of light rotates as it travels through a material placed in a constant magnetic field.\n\nHow Light and Magnetism Interact\n\n\"In simple terms, it's an interaction between light and magnetism,\" says Dr. Capua. \"The static magnetic field 'twists' the light, and the light, in turn, reveals the magnetic properties of the material. What we've found is that the magnetic part of light has a first-order effect, it's surprisingly active in this process.\"\n\nFor nearly two centuries, scientists attributed the Faraday Effect solely to the electric field of light interacting with electric charges in matter. The new study shows that the magnetic field of light also plays a direct role by interacting with atomic spins, a contribution long assumed to be insignificant.\n\nCalculating the Magnetic Contribution\n\nUsing advanced calculations informed by the Landau-Lifshitz-Gilbert (LLG) equation, which describes how spins behave in magnetic materials, the researchers demonstrated that light's magnetic field can generate magnetic torque within a material in a manner similar to a static magnetic field. Capua explains, \"In other words, light doesn't just illuminate matter, it magnetically influences it.\"\n\nTo measure the extent of that influence, the team applied their theoretical model to Terbium Gallium Garnet (TGG), a crystal commonly used to study the Faraday Effect. Their analysis revealed that the magnetic component of light is responsible for about 17% of the observed rotation in the visible spectrum and as much as 70% in the infrared.\n\nNew Pathways for Future Technologies\n\n\"Our results show that light 'talks' to matter not only through its electric field, but also through its magnetic field, a component that has been largely overlooked until now,\" says Benjamin Assouline.\n\nThe researchers note that this revised understanding of light's magnetic behavior could open doors for innovations in optical data storage, spintronics, and magnetic control using light. The work may also contribute to future developments in spin-based quantum computing.",
  "summary": "New research shows that light’s magnetic field is far more influential than scientists once believed. The team found that this magnetic component significantly affects how light rotates as it passes through certain materials. Their work challenges a 180-year-old understanding of the Faraday Effect and opens pathways to new optical and magnetic technologies.",
  "published": "Thu, 20 Nov 2025 09:59:00 EST",
  "url": "https://www.sciencedaily.com/releases/2025/11/251120091945.htm",
  "source": "All Top News -- ScienceDaily"
}