{
  "title": "Epilepsy is more common in patients with frontotemporal dementia than expected",
  "text": "According to a recent study, in patients with frontotemporal dementia (FTD), epileptic seizures are significantly more common than previously known. The discovery deepens understanding of the symptoms of this memory disorder and emphasises the importance of taking epileptic seizures into account in the treatment and monitoring of patients.\n\nCoordinated by Neurocenter Finland, this major project by the University of Eastern Finland and the University of Oulu examined the prevalence of epilepsy in patients with FTD. The research dataset is one of the largest in the world, and the results have been published in the prestigious JAMA Neurology journal.\n\nEpilepsy occurred years before the FTD diagnosis\n\nEpilepsy is known to be associated with Alzheimer's disease, for example, but data on the on the connection between FTD and epilepsy remains scarce. The newly published study fills this information gap and shows that epilepsy is considerably more common in patients with FTD than previously estimated.\n\nThe study analysed patient data from the university hospitals of Kuopio and Oulu from the period 2010-2021. Out of a total of 12,490 medical records, the study identified 245 patients with FTD and 1,326 patients with Alzheimer's disease. In addition to examining the prevalence of epilepsy in these patients, the prevalence was also examined in healthy controls.\n\n\"Our results show that epilepsy is considerably more common among those with FTD than those with Alzheimer's disease or in healthy controls,\" says Doctoral Researcher Annemari Kilpeläinen, the first author of the research article and a medical specialist in neurology.\n\n\"It is noteworthy that epilepsy occurred in some patients with FTD already ten years before their dementia diagnosis, and it was more common in all the examined stages of the disease than previous international studies have reported.\"\n\nThe prevalence of epilepsy was assessed at several time points from ten years before to five years after the dementia diagnosis. In patients with FTD, the prevalence of epilepsy increased over time, and five years after the diagnosis approximately 11% had epilepsy. In addition to epilepsy diagnoses, medications used for epilepsy were more common in patients with FTD, which strengthens the reliability of the results.\n\nEpilepsy might be left undiagnosed\n\nDiagnosing epilepsy in patients with FTD may be challenging as the symptoms of the disease may resemble epileptic seizures. This may lead to underdiagnosis and delays in treatment. However, untreated epilepsy can significantly worsen patients' condition.\n\n\"Identifying epilepsy is important because its treatment can improve patients' functional capacity and quality of life. Knowledge about the association between epilepsy and FTD raises new research questions: do these diseases share some pathophysiological mechanisms and could some FTD symptoms be caused by alterations in the specific electrical systems of the brain,\" says the project's principal investigator, Associate Professor and Director of UEF Brain Research Unit Eino Solje.\n\nAn extensive research project brings together different fields of science\n\nThe recently published study is part of an extensive project that combines exceptionally extensive real-life patient data with different kinds of unique registers. The project involves a strong cooperation between the University of Oulu and the University of Eastern Finland as well as different fields of science, including between researchers in the fields of medicine and law. Kuopio University Hospital and Oulu University Hospital are part of the international European Reference Network EpiCARE and recognised centres in the field of epilepsy treatment and research.",
  "summary": "According to a recent study, in patients with frontotemporal dementia (FTD), epileptic seizures are significantly more common than previously known. The discovery deepens understanding of the symptoms of this memory disorder and emphasises the importance of taking epileptic seizures into account in the treatment and monitoring of patients.",
  "published": "Tue, 03 Jun 2025 11:50:55 EDT",
  "url": "https://www.sciencedaily.com/releases/2025/06/250603115055.htm",
  "source": "Latest Science News -- ScienceDaily"
}