{
  "title": "Bush lauds Dick Cheney as a 'thinker and listener' at funeral",
  "text": "Bush lauds Dick Cheney as a 'thinker and listener' at funeral\n\n11 hours ago Share Save Share Save\n\nReuters\n\nDemocrats and Republicans have come together to mourn former US Vice-President Dick Cheney at his funeral in Washington DC. Cheney, who served under President George W Bush from 2001-09, died from complications of pneumonia and cardiac and vascular disease in early November. He was 84. Bush, a Republican, said in his eulogy: \"In a profession that attracts talkers, he was a thinker and a listener.\" Former President Joe Biden, a Democrat, also attended. Cheney was one of the most powerful vice-presidents in history, a key architect of Bush's \"war on terror\" after the 9/11 terrorist attacks, and an early advocate of the invasion of Iraq.\n\nWatch: George W Bush honours former Vice President Dick Cheney\n\nIn Thursday's ceremony at Washington National Cathedral, Bush revealed that during the difficult 2004 re-election campaign, Cheney had offered to step off the ticket. \"I arrived at the conclusion they do not come any better than Dick Cheney,\" Bush told mourners. He said Cheney was \"everything a president should expect as a second-in-command\". What Trump took from Dick Cheney's political playbook\n\nHeart attacks and a hunting accident: Five times Cheney became the story\n\nGetty Images George W Bush speaks at Cheney's funeral\n\nIn recent years, Cheney found himself out of favour in the Republican Party after he condemned President Donald Trump's refusal to accept the result of the 2020 election. Trump was also at loggerheads with Cheney's daughter, former Wyoming congresswoman Liz Cheney. His daughter paid tribute to him on Thursday, recalling her father's legacy. \"He knew the bonds of party must always yield to the single bond we share as Americans,\" she said. \"For him, a choice between defence of the Constitution and defence of your political party was no choice at all.\"\n\nGetty Images\n\nIn last year's White House election, both Cheneys endorsed the Democratic nominee, Kamala Harris. Harris was at the funeral, along with other former US Vice-Presidents Mike Pence and Al Gore. Trump and Vice-President JD Vance did not attend. Neither did former Presidents Barack Obama and Bill Clinton, both Democrats.",
  "summary": "Cheney died aged 84 from complications of pneumonia and cardiac and vascular disease in early November.",
  "published": "Thu, 20 Nov 2025 19:19:47 GMT",
  "url": "https://www.bbc.com/news/articles/c93x3er4l9zo?at_medium=RSS&at_campaign=rss",
  "source": "BBC News"
}