{
  "title": "Was Ferrari chairman unfair to Hamilton and Leclerc? - F1 Q&A",
  "text": "Are Ferrari chair John Elkann's comments that Lewis Hamilton and Charles Leclerc need to concentrate \"on driving and talk less\" after their poor results this season unfair? - Jordan\n\nJohn Elkann certainly caused a stir with his remarks the day after the Sao Paulo Grand Prix.\n\nIt's not clear what exactly provoked them, as Ferrari did not say.\n\nBut given they came less than 24 hours after Hamilton had said that his run of results in his first season at Ferrari were \"a nightmare, and I have been living it for a while\", it would not be unreasonable to suppose the seven-time champion might have been in Elkann's mind.\n\nAs far as Hamilton goes, this is typical of the sort of emotional remark he makes when he has had a disappointing race.\n\nRemember when he said after Hungarian Grand Prix qualifying that he was \"just useless\" and \"drove terribly\" and Ferrari \"probably need to change driver\"?\n\nHe didn't mean that then, not really. And Brazil should be seen in that context.\n\nAfter all, Hamilton went on to say: \"I believe there is something extraordinary up ahead in my life and in my destiny. I truly still believe in this team and what we can achieve together.\"\n\nWhich is, one might think, exactly the sort of message Elkann would want to hear.\n\nThe issue many people had with Elkann's comments was that their accuracy was questionable.\n\nHe singled out the mechanics for praise for \"basically winning the championship with their performance and everything that has been done on the pit stops\", on the basis they are leading the rankings for average pit-stop time., external\n\nFair enough, but then he said: \"If we look at our engineers, there's no doubt that the car has improved.\"\n\nWell, perhaps it has. But not relative to the opposition. Ferrari were 0.372 seconds off the pace on average in qualifying in the first half of the season, and so far in the second they are 0.472secs off.\n\nAs for the drivers, yes, Hamilton has been through the mill this year, but his performances have improved over the season, even if Brazil was a difficult race for him.\n\nBut Leclerc has been outstanding. And while he has pointed out regularly that the car is not quick enough, no-one would disagree with that, not even Elkann.\n\nFerrari are in F1 to win. Nothing less is good enough. That's just a fact. And Leclerc has been steadfastly loyal to the team.\n\nFerrari are briefing that Elkann's remarks should be seen as a spur for the team to do better. But it's hard to see how Leclerc and Hamilton would take especially kindly to them, however well meaning they were.",
  "summary": "BBC Sport F1 correspondent Andrew Benson answers your latest questions before the Las Vegas Grand Prix.",
  "published": "Tue, 18 Nov 2025 07:33:45 GMT",
  "url": "https://www.bbc.com/sport/formula1/articles/ce8gl3g5ze4o?at_medium=RSS&at_campaign=rss",
  "source": "BBC Sport"
}