{
  "title": "Undisciplined? Entitled? Lazy? Gen Z faces familiar flood of workplace criticism",
  "text": "Gen Z is undisciplined, apparently; entitled, some critics claim; and purportedly hates work. One viral column in the Wall Street Journal went so far as to suggest this entire generation was potentially “unemployable”.\n\nAs younger employees establishing themselves at work continue to face relentless criticism from the higher rungs of corporate America, those old enough to remember the arrival of the last generation could be forgiven for experiencing a sense of deja vu.\n\nMillennials were once derided as lazy, entitled, delusional, narcissistic and unreliable, too: many of the same accusations now leveled at gen Z.\n\n“Every generation tends to complain about the one next to us,” said Adam Grant, an organizational psychologist at Wharton Business School. “Everyone used to hate millennials, and now it’s gen Z.\n\n“We tend to compare [the younger generation] to our current selves, which is a mistake because most people are more narcissistic and self-centered at age 20 than they are at age 40. That’s part of development and maturity.”\n\nWhile this is a recurring cycle, in which each new generation faces scrutiny as they enter the workforce, this time it has been intensified, according to industry experts, by gen Z’s disillusionment with the institutions that they deem to have failed them.\n\nOlder generations also tend to directly compare their strengths with younger generations’ weaknesses, according to Grant – exaggerating the divide and often painting the younger generation in an unfairly negative light.\n\n“I think that narrative is a bullshit,” Jahnavi Shah, 25, said of the harshest accusations hurled at gen Z. “The generations before us, they were just all about work and then life would take a back seat. We are a really smart generation that hustles, but we also don’t want to burn out, and want to be paid adequately for the value that we bring in.”\n\nShah recently landed her first full-time role at a tech startup in San Francisco, California, after a seven-month search, and almost a thousand applications.\n\nPrevious generations “would cold-apply, and get interviews from big tech companies”, she said. “But with every application I sent, and every rejection that followed, I felt like I lost a little bit of me.”\n\nNadya Okamoto, 27, co-founder of August, an eco-conscious menstrual products company, also strongly disagrees with the criticisms leveled against gen Z. “If you look at a lot of the jobs that gen Z is known to do really well, like social media marketing, they weren’t jobs 20 years ago, so in this sense we’re obviously employable,” she said. “Gen Z gets a bad rep for entitlement – for wanting certain expectations, like work-life balance.”\n\nGen Z grew up watching institutions, both financial and political, fail to deliver on promises of stability and wealth, planting a deep lack of faith, said Grant – and, for many younger workers, any implicit trust between employee and employer is no more.\n\n“Gone are the times when you took a job with one employer, and you stayed there for 35 years, and you plan to retire there, and you expected them to take care of you,” said Grant. “If you look at the number of downsizing and mass layoffs that have happened, those are major betrayals [to the employees].”\n\nThis generation is different to its predecessors, in some respects. Flexibility, purpose and employees’ wellbeing matter more than overtime and promotions, according to Madeline Miller, a leadership and culture strategist. “The capitalist system is extractive, and gen Z are starting to say: ‘I’m tired and I’m going to get nothing out of this,’” she said.\n\n“There’s more ways to make money outside the corporate cog that grants freedom and flexibility, so we enter the workforce with much higher standards,” said Okamoto. “We realized we don’t actually have to be that burnt out any more and … American capitalism needs a change in which people are actually valued.”\n\nGen Z does not see the value in overtime and focuses on “smart work”, optimizing artificial intelligence tools to complete a 10-hour task in just five hours instead, according to Shah, the tech worker. A Deloitte survey published earlier this year found that over half of gen Z employees reported using AI regularly in their work.\n\nValues and priorities appear to be shifting, too. According to the Deloitte research, 89% of gen Z workers and 92% of millennials consider a sense of purpose to be very or somewhat important for their job satisfaction.\n\nCompanies that dismiss or write off gen Z staff ultimately put their overall performance at risk, according to Grant, who said both older managers and their younger staff can benefit from ditching stereotypes and learning from each other.\n\n“It is a new generation that comes in and holds up a mirror so you can see yourself more clearly and see how you may not have kept up with the way the world has evolved,” added Grant. “Older generations have a lot of knowledge and experience to offer. Younger generations have fresh perspectives and digital savvy. We want to cross-fertilize between the generations.”\n\nFor companies, this isn’t optional, according to Miller, who claimed that firms who fail to do so risk “imploding”.\n\n“Gen Z is going to transform the way we work completely,” she said. “Adapting means companies should become curious about gen Z, and integrate personal and professional development – rather than imposing existing structures, hierarchies and leadership models on them.”",
  "summary": "<p>A new generation of younger workers are being derided as delusional and unreliable, just as millennials were</p><p>Gen Z is<a href=\"https://www.foxnews.com/media/gen-z-hardest-generation-work-according-survey-they-lack-discipline-like-challenge-you\"> undisciplined</a>, apparently;<a href=\"https://www.bloomberg.com/opinion/articles/2023-05-30/let-s-agree-that-entitled-gen-z-is-a-force-for-good\"> entitled</a>, some critics claim; and purportedly<a href=\"https://www.thefp.com/p/why-gen-z-hates-work-gen-z-culture\"> hates work</a>. One viral column in the Wall Street Journal went so far as to suggest this entire generation was<a href=\"https://www.wsj.com/opinion/is-gen-z-unemployable-288d2ec9\"> potentially “unemployable”</a>.</p><p>As younger employees establishing themselves at work continue to face relentless criticism from the higher rungs of corporate America, those old enough to remember the arrival of the last generation could be forgiven for experiencing a sense of deja vu.</p> <a href=\"https://www.theguardian.com/money/ng-interactive/2025/nov/17/gen-z-workplace-criticism\">Continue reading...</a>",
  "published": "Mon, 17 Nov 2025 11:00:06 GMT",
  "url": "https://www.theguardian.com/money/ng-interactive/2025/nov/17/gen-z-workplace-criticism",
  "source": "The Guardian"
}