{
  "title": "Tripura Govt announces plan to fill 400 vacancies and upgrade two colleges to universities",
  "text": "The Tripura Government plans to fill 400 vacancies in various departments and upgrade two colleges to universities, Tourism Minister Sushanta Chowdhury announced on Tuesday after a Cabinet meeting headed by Chief Minister Manik Saha.\n\nThe minister said the Tripura Institute of Technology, an engineering college, would be upgraded to State Technical University and that Women’s College, a government-run degree college, would be upgraded to Women’s University.\n\n“The chief minister has declared that over 19,000 jobs were rolled out under different categories. The process will continue,” Chowdhury added while speaking to reporters at the Civil Secretariat.\n\nChoudhury also talked about some of the 400 vacancies planned to be filled. He said that 97 posts of auditor, investigator, and statistical investigators would be filled under the cooperation department on a fixed-pay basis through the Joint Recruitment Board of Tripura (JRBT). “The department concerned will soon send a proposal to the JRBT for filling these posts. All these are Group C posts,” he said.\n\nTwenty-eight posts of supervisors under ICDS projects will be filled through direct recruitment by the Tripura Public Service Commission (TPSC), said Choudhury, adding that 14 posts of mechanical, civil, electrical, and public health engineers under the urban development department would also be filled.\n\nEight faculty members and supporting staffers each will be appointed to the Tripura Film and Television Institute on a contractual basis. The faculty positions include those of an associate professor on screen acting, editor-cum-demonstrator, and senior technical officer.\n\nAlso, the Government will open 119 new anganwadi centres and appoint as many anganwadi workers and helpers.",
  "summary": "",
  "published": "Wed, 19 Nov 2025 13:56:58 +0000",
  "url": "https://indianexpress.com/article/india/tripura-govt-plan-fill-400-vacancies-upgrade-two-colleges-universities-10374752/",
  "source": "India | The Indian Express"
}