{
  "title": "Brother Wang, a global manhunt and the Chinese-Mexican drug nexus",
  "text": "Like so many great escapes, it involved a tunnel.\n\nOne night in July, in the Mexico City neighbourhood where he was under house arrest, Zhi Dong Zhang snuck through a hole into the property nextdoor and escaped from under the noses of the soldiers guarding him.\n\nZhang, an alleged drug trafficker, managed to get to Cuba and then reportedly all the way to Russia – only to be turned back. At the end of October, the Cuban government announced that it had arrested him. That same day, he was flown back to Mexico and extradited straight to the US.\n\nZhang’s daring escape is still shrouded with intrigue. But experts say his case underlines the deep and growing relationship between Chinese criminal groups and Mexican cartels.\n\n“It’s emblematic of how important Chinese networks have become to the core operations of Mexican criminal groups,” said Vanda Felbab Brown, an expert on organised crime at the Brookings Institution.\n\nZhang appeared in a Brooklyn court on Wednesday, where he was accused of smuggling tons of chemical precursors to make fentanyl, a synthetic opioid, for the Sinaloa and Jalisco cartels, the most powerful criminal organisations in Mexico.\n\nHe also faces charges for allegedly trafficking cocaine and crystal meth, and for laundering almost $100m through hundreds of shell companies and bank accounts in the US.Zhang pleaded not guilty to the charges at his arraignment\n\n“[Zhang] is what I would call a convergence target,” said Chris Urben, a former agent for the Drug Enforcement Administration. “He’s even better than a kingpin, because while kingpins sit at the top and only a few people communicate with them, he was involved in all of these things.”\n\nZhang – who went by aliases such as El Chino and Brother Wang – arrived in Mexico before the coronavirus pandemic, then married a Mexican and became a Mexican citizen. As someone culturally fluent in the underworlds of both countries, “he offered something that very few can”, said Urben, who now works for the investigations firm Nardello & Co.\n\nThat might explain why as-yet-unknown actors went to great lengths to help him escape.\n\n“It’s not like he got in a truck down to Guatemala,” said Urben. “He facilitated his release from jail. He was placed on home leave, completely set up for him to escape. And then he had this private jet to a country that’s in partnership with Russia and in some way China.”\n\n“It was the same old story of Mexico,” said Felbab Brown. “It wasn’t just his criminal genius that allowed him to escape. It was corruption.”\n\nBut in the end it didn’t work: Russia turned him away, then Cuba handed him over.\n\nFelbab Brown says that Zhang may have just been trying to get to any country that wouldn’t extradite him to the US. “But it could also be that he knew specific Russian criminal actors or spies or government actors that he was planning to rely on for protection,” she said.\n\nAs for the cooperation from the Cuban government, Felbab Brown says they may have been trying to “score some goodwill” with the US, having seen the pressure the Trump administration is exerting on Venezuela, nominally over drug trafficking.\n\nGiven the adaptability of criminal networks, the arrest of any single individual is unlikely to disrupt the supply of precursors to Mexican cartels for long, if at all. Nonetheless, his extradition gives US law enforcement the opportunity to harvest intelligence on all the networks in which he was involved.\n\nThe arrest has already drawn attention to the relationship between Chinese criminal groups and Mexican cartels, which has exploded over the last 10 years as they became the principal money launderers for cash from drug sales in the US, according to Urben.\n\nChinese criminal groups have a unique offer for money laundering, which relies on the fact that there are many people in China who want to get money out of the country but are restricted by capital controls, which limit them to the equivalent of about $50,000 a year.\n\nThe process might start with a Mexican cartel associate delivering cash from drug sales to a Chinese national who lives in the US. Once that person confirms receipt, Chinese brokers use associates in Mexico to pay the cartels in pesos. The money launderers then sell the dollars in the US to people in China who want to, for example, buy property in the US, and receive payment in yuan back in China.\n\nAll of this can happen near instantaneously and without any money crossing borders, making it harder to trace.\n\nAnd since the money launderers can impose the costs on the “captive” Chinese customers, they can afford to charge the cartels commissions as low as 1-2%.\n\n“I had an undercover team that investigated [the previous money-laundering techniques] for years,” said Urben. “It used to take like 10 days for the cartels to get their money and perhaps 7-10% in costs.\n\n“The Chinese changed the game.”",
  "summary": "<p>Alleged trafficker Zhi Dong Zhang escaped via a tunnel in Mexico before flying to Cuba and reportedly Russia but now finds himself on trial in a Brooklyn courtroom</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/2023/may/18/china-mexico-opioid-traficking-us-sanctions\">The China-Mexico fentanyl pipeline: increasingly sophisticated and deadly</a></p></li></ul><p>Like so many <a href=\"https://www.theguardian.com/world/2015/jul/14/mexico-el-chapo-reward-prison-escape\">great escapes</a>, it involved a tunnel.</p><p>One night in July, in the Mexico City neighbourhood where he was under house arrest, Zhi Dong Zhang snuck through a hole into the property nextdoor and escaped from under the noses of the soldiers guarding him.</p> <a href=\"https://www.theguardian.com/world/2025/nov/20/zhi-dong-zhang-mexico-drugs-china\">Continue reading...</a>",
  "published": "Thu, 20 Nov 2025 14:20:18 GMT",
  "url": "https://www.theguardian.com/world/2025/nov/20/zhi-dong-zhang-mexico-drugs-china",
  "source": "The Guardian"
}