{
  "title": "An accident and a scuffle in Jammu pit two officials, protesters against each other",
  "text": "A minor road accident in Jammu’s upmarket Gandhi Nagar area a week ago has put relations between civil and police officials in the Union Territory administration in the city on edge.\n\nWhile an FIR has been registered against Kashmir Administrative Service (KAS) officer Azhar Khan, on charges of criminal intimidation, Deputy Superintendent of Police Sunil Singh Jasrotia stands suspended as Sub-Divisional Police Officer (SDPO, Jammu South) and has been attached with the Police Headquarters, J&K, pending enquiry into his alleged manhandling of Khan in public.\n\nAfter the video of the incident went viral, a number of KAS officers went on leave demanding action against Jasrotia.\n\nThey threatened “mass casual leave in protest against the alleged assault and harassment of the officer”, and said Khan had been manhandled and booked in a “false and fabricated FIR”.\n\n“Such conduct undermines the dignity and safety of civil officers performing statutory duties and raises serious concerns about institutional protection. In solidarity with their colleague, the officers have resolved to proceed on mass casual leave with immediate effect until strict action is taken against the ‘erring officer(s)’ and mechanisms are put in place to prevent recurrence,” a letter by the KAS officials said.\n\nTo calm tempers, the UT administration first transferred SDPO Jasrotia to the J&K Police Headquarters and, when that did not end the protests, suspended him pending an inquiry.\n\nBut the suspension has now prompted counter-protests, with organisations such as the Yuva Rajput Sabha seeking action against Khan, currently posted as Block Development Officer (BDO), Nagrota, for triggering the whole sequence of events by causing the accident, because he was driving his vehicle on the wrong side of the road. Khan was on election duty as Nodal Officer (Transport) for the Nagrota Assembly constituency bypoll on November 10, when the accident happened.\n\nStory continues below this ad\n\nThe J&K Matador Union has also held demonstrations against Khan, accusing him of putting at risk the life of a driver and the passengers of a matador, by driving in the wrong lane, and thereafter threatening and assaulting the driver.\n\nSome police officials also say that action against the DySP, without Khan facing any official rap, sends the wrong message. “At least some departmental action should have been taken against Khan too.”\n\nAround noon on November 10, Khan’s vehicle and a matador were involved in a minor accident, after the former reportedly entered the wrong lane. As per videos of the incident, Khan then entered the matador to confront its driver, Murli, and there was an altercation, with the BDO asking the driver to step out. Khan also demanded that the driver pay for the damage to his car, while the latter argued that it was Khan who was responsible for what had happened.\n\nAs per Murli’s complaint, Khan “manhandled” and “intimidated” him.\n\nStory continues below this ad\n\nWhile the two were arguing, police personnel who were members of a party accompanying Jasrotia, who was near the spot, arrived. Jasrotia followed them as traffic built up on the busy stretch, and asked Khan to move his vehicle from the middle of the road.\n\nVideo grabs show that the two sides kept arguing, finally leading to Jasrotia ordering that both the vehicles be taken to the Gandhi Nagar Police Station. It was then that Khan seemed to approach Jasrotia and say something, prompting the SDPO to purportedly slap and kick him, as per the video.\n\nAt the police station, following a written complaint from Murli, police registered an FIR against Khan. This set off the series of protests now being waged on both sides.\n\nBoth Jasrotia and Khan refused to comment.",
  "summary": "",
  "published": "Tue, 18 Nov 2025 01:39:27 +0000",
  "url": "https://indianexpress.com/article/india/an-accident-and-a-scuffle-in-jammu-pit-two-officials-protesters-against-each-other-10371506/",
  "source": "India | The Indian Express"
}