{
  "title": "Fire prompts evacuations at U.N. climate talks in Brazil; 13 suffer smoke inhalation",
  "text": "Fire prompts evacuations at U.N. climate talks in Brazil; 13 suffer smoke inhalation\n\ntoggle caption Catherine Ellis/AP\n\nBELEM, Brazil — A fire briefly spread through pavilions being used for U.N. climate talks in Brazil and prompted evacuations Thursday on the next-to-last day of the conference, and officials said 13 people were treated for smoke inhalation.\n\nOrganizers said the fire was controlled in about six minutes. Fire officials ordered the evacuation of the entire site for the conference, known as COP30, and it wasn't clear when the talks would resume.\n\nBrazil's Tourism Minister Celso Sabino told journalists at the scene that the fire started near the China Pavilion, which was among several pavilions set up for events on the sidelines of the climate talks.\n\nThe fire quickly spread to neighboring pavilions, said Samuel Rubin, one of the people in charge of an entertainment and culture pavilion. He said nearby pavilions include many of the Africa pavilions and one aimed at youth.\n\nSponsor Message\n\nVideo showed huge flames in one of the pavilions, which are reinforced canvas or fabric structures that typically have three walls and a floor.\n\nPara state Gov. Helder Barbalho told local news outlet G1 that a generator failure or a short circuit in a booth may have started the fire.\n\nMuch of the summit venue in Belem was still under construction right up until the conference opened, with exposed beams, open plywood floors and metal meshed-in corridors leading nowhere outside the convention center. During a pre-summit event, drilling and jackhammering could be heard as world leaders delivered speeches and scores of workers in hardhats scurried around unfinished pavilions shrouded in plastic.\n\ntoggle caption Fernando Llano/AP\n\nGabi Andrade, a volunteer with COP30 from host city Belem, said she has been working on accreditations at the conference for the last three weeks. Thursday was her first free afternoon and she'd just gotten off her lunch break and was exploring the Singapore pavilion when the fire broke out.\n\nShe said she saw black smoke. A security guard grabbed her hand and showed her to the exit as she cried and screamed \"fire.\"\n\nBeneath the shock of the situation, she worried what this would mean for the Brazilian reputation, hosting the talks. \"It's so sad for us,\" she said. \"We all worked so hard.\"",
  "summary": "Officials say a fire that spread through pavilions being used for U.N. climate talks in Brazil has prompted evacuations on the next-to-last day of the conference.",
  "published": "Thu, 20 Nov 2025 19:35:12 -0500",
  "url": "https://www.npr.org/2025/11/20/g-s1-98669/fire-united-nations-climate-talks-brazil-cop30",
  "source": "NPR Topics: News"
}