{
  "title": "Engineers develop self-healing muscle for robots",
  "text": "A University of Nebraska-Lincoln engineering team is another step closer to developing soft robotics and wearable systems that mimic the ability of human and plant skin to detect and self-heal injuries.\n\nEngineer Eric Markvicka, along with graduate students Ethan Krings and Patrick McManigal, recently presented a paper at the IEEE International Conference on Robotics and Automation in Atlanta, Georgia, that sets forth a systems-level approach for a soft robotics technology that can identify damage from a puncture or extreme pressure, pinpoint its location and autonomously initiate self-repair.\n\nThe paper was among the 39 of 1,606 submissions selected as an ICRA 2025 Best Paper Award finalist. It was also a finalist for the Best Student Paper Award and in the mechanism and design category.\n\nThe team's strategy may help overcome a longstanding problem in developing soft robotics systems that import nature-inspired design principles.\n\n\"In our community, there is a huge push toward replicating traditional rigid systems using soft materials, and a huge movement toward biomimicry,\" said Markvicka, Robert F. and Myrna L. Krohn Assistant Professor of Biomedical Engineering. \"While we've been able to create stretchable electronics and actuators that are soft and conformal, they often don't mimic biology in their ability to respond to damage and then initiate self-repair.\"\n\nTo fill that gap, his team developed an intelligent, self-healing artificial muscle featuring a multi-layer architecture that enables the system to identify and locate damage, then initiate a self-repair mechanism -- all without external intervention.\n\n\"The human body and animals are amazing. We can get cut and bruised and get some pretty serious injuries. And in most cases, with very limited external applications of bandages and medications, we're able to self-heal a lot of things,\" Markvicka said. \"If we could replicate that within synthetic systems, that would really transform the field and how we think about electronics and machines.\"\n\nThe team's \"muscle\" -- or actuator, the part of a robot that converts energy into physical movement -- has three layers. The bottom one -- the damage detection layer -- is a soft electronic skin composed of liquid metal microdroplets embedded in a silicone elastomer. That skin is adhered to the middle layer, the self-healing component, which is a stiff thermoplastic elastomer. On top is the actuation layer, which kick-starts the muscle's motion when pressurized with water.\n\nTo begin the process, the team induces five monitoring currents across the bottom \"skin\" of the muscle, which is connected to a microcontroller and sensing circuit. Puncture or pressure damage to that layer triggers formation of an electrical network between the traces. The system recognizes this electrical footprint as evidence of damage and subsequently increases the current running through the newly formed electrical network.\n\nThis enables that network to function as a local Joule heater, converting the energy of the electric current into heat around the areas of damage. After a few minutes, this heat melts and reprocesses the middle thermoplastic layer, which seals the damage -- effectively self-healing the wound.\n\nThe last step is resetting the system back to its original state by erasing the bottom layer's electrical footprint of damage. To do this, Markvicka's team is exploiting the effects of electromigration, a process in which an electrical current causes metal atoms to migrate. The phenomenon is traditionally viewed as a hindrance in metallic circuits because moving atoms deform and cause gaps in a circuit's materials, leading to device failure and breakage.\n\nIn a major innovation, the researchers are using electromigration to solve a problem that has long plagued their efforts to create an autonomous, self-healing system: the seeming permanency of the damage-induced electrical networks in the bottom layer. Without the ability to reset the baseline monitoring traces, the system cannot complete more than one cycle of damage and repair.\n\nIt struck the researchers that electromigration -- with its ability to physically separate metal ions and trigger open-circuit failure -- might be the key to erasing the newly formed traces. The strategy worked: By further ramping up the current, the team can induce electromigration and thermal failure mechanisms that reset the damage detection network.\n\n\"Electromigration is generally seen as a huge negative,\" Markvicka said. \"It's one of the bottlenecks that has prevented the miniaturization of electronics. We use it in a unique and really positive way here. Instead of trying to prevent it from happening, we are, for the first time, harnessing it to erase traces that we used to think were permanent.\"\n\nAutonomously self-healing technology has potential to revolutionize many industries. In agricultural states like Nebraska, it could be a boon for robotics systems that frequently encounter sharp objects like twigs, thorns, plastic and glass. It could also revolutionize wearable health monitoring devices that must withstand daily wear and tear.\n\nThe technology would also benefit society more broadly. Most consumer-based electronics have lifespans of only one or two years, contributing to billions of pounds of electronic waste each year. This waste contains toxins like lead and mercury, which threaten human and environmental health. Self-healing technology could help stem the tide.\n\n\"If we can begin to create materials that are able to passably and autonomously detect when damage has happened, and then initiate these self-repair mechanisms, it would really be transformative,\" Markvicka said.",
  "summary": "Students recently unveiled their invention of a robotic actuator -- the 'muscle' that converts energy into a robot's physical movement -- that has the ability to detect punctures or pressure, heal the injury and repair its damage-detecting 'skin.'",
  "published": "Fri, 30 May 2025 15:18:49 EDT",
  "url": "https://www.sciencedaily.com/releases/2025/05/250530151849.htm",
  "source": "Latest Science News -- ScienceDaily"
}