{
  "title": "‘I, Nitish Kumar, solemnly swear…’: Nitish Kumar takes oath as Bihar CM for record 10th time",
  "text": "Bihar CM Nitish Kumar oath ceremony: Janata Dal (United) chief Nitish Kumar took oath as the Chief Minister of Bihar for a record 10th time Thursday. The swearing-in ceremony was held at the historic Gandhi Maidan in Patna. The ceremony was attended by Prime Minister Narendra Modi, Union Home Minister Amit Shah, BJP national president J P Nadda and several other top leaders of the NDA.\n\nThe Chief Ministers of several NDA-ruled states also attended the event.\n\nKumar is among the 10 longest-serving CMs in the country. At 74, Kumar also achieved another milestone of extending his 19-year stint as CM and breaking into the national top-10 list of longest-serving heads of government. His frequent switching sides in his political career earned him the nickname ‘Paltu Ram’, whereas he is also called ‘sushashan babu’ for good governance.\n\nStory continues below this ad\n\nThe Bharatiya Janata Party’s Dilip Jaiswal, Mangal Pandey, Sanjay Singh Tiger, Rama Nishad, Arun Shankar Prasad, Ram Kripal Yadav, Nitin Nabin and Surendra Prasad Mehta were sworn in as ministers.\n\nThe JD(U)’s Lesi Singh, Madan Sahni, Sunil Kumar, Mohammad Jama Khan, and Santosh Suman of the HAM(S) also took oath as ministers. While Deepak Prakash is from the Rashtriya Lok Morcha and Sanjay Kumar Singh and Sanjay Kumar are from the Lok Janshakti Party (Ram Vilas).\n\nGovernor Arif Mohammed Khan administered the oath of office and secrecy to them.\n\nOn Wednesday, Nitish was unanimously elected leader of the NDA at a meeting of its 202 legislators in the Central Hall of the Assembly. He was felicitated with a huge garland at the meeting where Union Minister and BJP Bihar in-charge Dharmendra Pradhan, LJP (RV) chief Chirag Paswan, RLM chief Upendra Kushwaha and HAM (S) patron Jitan Ram Manjhi were also present.\n\nStory continues below this ad\n\nMeanwhile, the Bharatiya Janata Party (BJP) named Samrat Choudhary and Vijay Kumar Sinha as the leader and deputy leader of the BJP’s legislature party, respectively.\n\nThe NDA stormed back to power in Bihar, winning 202 seats in the 243-member assembly, with the BJP bagging 89, JD(U) 85, Lok Janshakti Party (Ram Vilas) 19, Hindustani Awam Morcha 5 and RLM 4.",
  "summary": "",
  "published": "Thu, 20 Nov 2025 06:10:40 +0000",
  "url": "https://indianexpress.com/article/india/nitish-kumar-bihar-cm-record-10th-time-nda-jdu-10375489/",
  "source": "India | The Indian Express"
}