{
  "title": "Congress to protest in Delhi against SIR, directs state units to appoint booth agents",
  "text": "As the deadline for phase-II of the Special Intensive Revision (SIR) in nine states and three UTs nears, the Congress on Tuesday took stock of the party’s preparedness for the exercise and told the party units to appoint booth level agents (BLAs) at the earliest.\n\nThe party also announced a protest rally against the SIR exercise at Delhi’s Ramlila Maidan in the first week of December.\n\nThe party’s central leadership, including party chief Mallikarjun Kharge, Lok Sabha Leader of Opposition Rahul Gandhi and party general secretary (organisation) K C Venugopal, met the leaders from the states and UTs, for which SIR has been announced, at its headquarters and asked them to work in a “time-bound manner” to ensure BLAs are in place at the earliest. During the discussion it emerged that only one-third of the BLAs are in place in Uttar Pradesh.\n\nThe second phase of the SIR will cover nearly 51 crore electors with December 4 as the deadline for the completion of enumeration.\n\n“The high command was very clear that we need to work from the ground to ensure the party’s presence at the booth level,” said a source.\n\nThe high command is learnt to have told party leaders to submit complaints to district magistrate if they see any anomaly on part of the Booth Level Officers (BLOs).\n\nAfter the meeting, Venugopal said the Delhi rally will “expose the EC again” and accused the poll body of making “a sinister attempt” to “destroy democracy in the country”.\n\nStory continues below this ad\n\nAfter strongly opposing the SIR in Bihar, this will be the second time when Congress will hit the streets against the exercise. The united Opposition had last protested during the Monsoon session of Parliament in August.\n\nOn the feedback from the state leadership, Venugopal said the “feeling of the state units is that the EC is purposely trying to delete votes of some sections of society” as it was done in Bihar.\n\nCiting recent instances of suicide by BLOs, he questioned the need for the SIR when all political parties, except the BJP, are against it. Venugopal also mentioned the Kerala Assembly resolution seeking “postponement of the SIR exercise”.",
  "summary": "",
  "published": "Tue, 18 Nov 2025 21:48:21 +0000",
  "url": "https://indianexpress.com/article/india/congress-to-protest-in-delhi-against-sir-directs-state-units-to-appoint-booth-agents-10373324/",
  "source": "India | The Indian Express"
}