{
  "title": "55-million-year-old fossils reveal bizarre crocs that dropped from trees",
  "text": "The oldest known crocodile eggshells ever identified in Australia are giving UNSW researchers fresh insight into long vanished animals and the environments they depended on. These remains come from creatures that lived millions of years before the continent separated from the landmasses that became Antarctica and South America.\n\nIn the small southeast QLD town of Murgon, scientists have spent decades excavating what appears to be an ordinary clay pit in a local grazier's backyard. Beneath the surface sits one of Australia's earliest fossil-bearing locations, a site that provides a rare look into a time when the continent was still part of a much larger supercontinent.\n\nAn international research group led by the Institut Català de Paleontologia Miquel Crusafont (ICP), working with UNSW Sydney, has now identified these ancient crocodilian eggshells. The team confirmed they are the oldest ever recovered in Australia.\n\nThe fragments have been formally named Wakkaoolithus godthelpi. They once came from mekosuchine crocodiles, an extinct group that dominated waterways about 55 million years ago. Australia's modern freshwater and saltwater crocodiles only appeared far later, roughly 3.8 million years ago.\n\n\"These eggshells have given us a glimpse of the intimate life history of mekosuchines,\" says the study's, opens in a new window lead author Xavier Panadès i Blas. \"We can now investigate not only the strange anatomy of these crocs, but also how they reproduced and adapted to changing environments.\"\n\nUnusual Behaviors in Ancient Mekosuchine Crocodiles\n\nUnlike today's crocodiles, mekosuchines occupied a surprising range of ecological roles.\n\n\"It's a bizarre idea,\" says UNSW paleontologist Professor Michael Archer. \"But some of them appear to have been terrestrial hunters in the forests.\"\n\nEvidence from younger mekosuchine fossils supports this interpretation. These fossils were found in 25-million-year-old deposits at the Riversleigh World Heritage Area in Boodjamulla National Park on Waanyi country in northwestern QLD.\n\nSome river-dwelling species at Riversleigh reached lengths of at least five meters. Prof. Archer says some were likely semi-arboreal as well.\n\n\"Some were also apparently at least partly semi-arboreal 'drop crocs',\" he says. \"They were perhaps hunting like leopards -- dropping out of trees on any unsuspecting thing they fancied for dinner.\"\n\nEggshells as a Tool for Reconstructing Ancient Environments\n\nPanadès i Blas highlights the scientific value of eggshells in reconstructing ancient life.\n\n\"They preserve microstructural and geochemical signals that tell us not only what kinds of animals laid them, but also where they nested and how they bred,\" he says. \"Our study shows just how powerful these fragments can be. Eggshells should be a routine, standard component of paleontological research -- collected, curated and analyzed alongside bones and teeth.\"\n\nThe Murgon samples were studied using both optical and electron microscopes. The eggshell microstructure indicates that these crocodiles likely nested along the edges of a lake and adjusted their reproductive strategies as conditions shifted over time.\n\nCoauthor Dr. Michael Stein suggests that mekosuchines may have lost much of their inland habitat as the region dried. They would have been pushed into smaller waterways, where they had to compete with newly arrived crocodiles as well as cope with shrinking populations of their megafaunal prey.\n\nDr. Stein adds that the lake at Murgon was surrounded by dense forest.\n\n\"This forest was also home to the world's oldest-known songbirds, Australia's earliest frogs and snakes, a wide range of small mammals with South American links, as well as one of the world's oldest known bats,\" he says.\n\nA Fossil Site That Continues to Reshape Australia's Early History\n\nProf. Archer describes the Tingamarra deposit at Murgon as part of a far larger scientific story, revealing details about life before Australia became isolated.\n\nHe recalls uncovering an unusual crocodilian jaw fragment in 1975 in the Texas Caves of southeastern Queensland. Although it is now known to belong to a mekosuchine crocodile, the specimen initially confused him.\n\nThe jawbone looked reptilian but had teeth resembling those of dinosaurs. Seeking clarity, he brought the fossil to Professor Max Hecht, a reptile expert at the American Museum of Natural History.\n\n\"When he saw it, Max nearly dropped his coffee cup,\" Prof. Archer says. \"It closely resembled another kind of extinct croc with dinosaur-type teeth that had been found in South America. That was the first realization that crocodiles with teeth like this were also part of the older record in Australia.\"\n\nProf. Archer notes that he and his team have been working in Murgon since 1983, often literally digging in the backyard of enthusiastic residents.\n\n\"That year, UNSW colleague Henk Godhelp and I drove to Murgon, parked the car on the side of the road, grabbed our shovels, knocked on the door and asked if we could dig up their backyard,\" he says.\n\nAfter explaining the potential prehistoric material beneath the sheep paddock and mentioning that fossil turtle shells had already been found nearby, the property owners eagerly agreed.\n\n\"From subsequent excavations, that's where the eggshell pieces came from. And, quite clearly, from the many fascinating animals that we've already found in this deposit since 1983, we know that with more digging there will be a lot more surprises to come.\"\n\nHow Fossils Help Guide Modern Conservation\n\nFor Prof. Archer, these discoveries serve a dual purpose. They illuminate Australia's ancient past -- and they can also inform strategies to protect vulnerable species facing rapid environmental change today.\n\nHe has been part of a multi-institutional effort known as the 'Burramys Project', which aims to rescue the Mountain Pygmy-possum (Burramys parvus) from the brink of extinction.\n\nThis alpine species is under severe pressure from climate change. The team found that its ancient relatives thrived for nearly 25 million years in lowland temperate rainforests, including those that once covered the Riversleigh region between 25 and 12 million years ago.\n\nFrom this evidence, researchers concluded that the ancestors of modern Mountain Pygmy-possums probably followed rainforest habitats uphill during a warm and wet phase in the Pleistocene Epoch. When the alpine climate eventually cooled, the species developed survival strategies such as hibernation.\n\nA few years ago, Prof. Archer's group collaborated with Trevor Evans of Secret Creek Sanctuary and received support from multiple organizations, including the Prague Zoo in the Czech Republic, to establish a breeding program in non-alpine rainforest near Lithgow.\n\nToday, the Mountain Pygmy-possum population is thriving in that environment -- consistent with predictions drawn from the fossil record.\n\nAs climate change threatens more species, Prof. Archer says these findings show that not every story ends in decline.\n\n\"The Burramys Project is a demonstration that, at least in some cases, we can develop strategies to save endangered species,\" he says. \"Clues from fossil records matter,\" he says. \"Not just to understand the past, but also to help secure the future.\"\n\nThe newly named croc species, Wakkaoolithus godthelpi, honors the Wakka Wakka First Nations people whose Country includes the fossil site. The name also recognizes Henk Godthelp, a longtime member of the UNSW paleontology team alongside Prof. Archer, Professor Sue Hand and many other researchers and students.",
  "summary": "Scientists uncovered Australia’s oldest known crocodile eggshells, revealing the secret lives of ancient mekosuchine crocodiles that once dominated inland ecosystems. These crocs filled surprising niches, including terrestrial stalking and possibly tree-dropping ambushes.",
  "published": "Sat, 15 Nov 2025 02:32:26 EST",
  "url": "https://www.sciencedaily.com/releases/2025/11/251114041204.htm",
  "source": "All Top News -- ScienceDaily"
}