{
  "title": "BRICS Presidency: India to follow G20 model, take meetings, delegations to all states, UTs",
  "text": "For its year-long BRICS Presidency in 2026, India is going to follow the model of its 2023 G20 Presidency and take the meetings and delegations to all 28 states and nine Union Territories.\n\nWhile the leaders’ summit will be held later next year in New Delhi, around 100 other meetings, including ministerials, forums and working groups, which will be held across 60 Indian cities, The Indian Express has learnt.\n\nIndia will hold the Presidency of BRICS, which includes 11 member-states — Brazil, Russia, China, South Africa, Saudi Arabia, Egypt, United Arab Emirates, Ethiopia, Indonesia, and Iran — from January 1, 2026. There are 10 partner countries with India aiming to play a key role in developing the agenda for institutional reforms, climate finance, digital governance and amplifying the voice of the Global South.\n\nALSO READ | How BRICS is chipping away at the Western order\n\nHeads of state of all 11 member-states and partner countries will be invited for the Leaders’ Summit, likely to be held in August or September, said sources. There are likely to be two meetings of foreign ministers, one at the level of national security advisors, 4-5 sherpa or sous sherpa meetings, and around 20 ministerial meetings. Some of the key ministerial meetings will be taken to cities, including Bangalore, Hyderabad, Chennai, Chandigarh, Ahmedabad and Lucknow.\n\nAlso, there will be a dozen meetings at the level of heads of agencies, around 90 for working groups and expert groups, several meetings for forums, business chambers and even a few for parliamentary and political exchanges, as per the schedule being chalked out. These meetings will be spread out across the length and breadth of India, including all northeastern states and border states, said the sources. The final list is yet to be put out by the Ministry of External Affairs (MEA).\n\nThe BRICS meetings are likely to cover 60 cities, the sources said, adding that it will also showcase India’s diversity, tourism offerings, culture and heritage.\n\nThe idea, as per those aware, is to build and project a strong image of India during the BRICS Presidency, and permeate this among Indian citizens of all age groups, covering rural as well as urban areas. The idea is also to showcase Brand India to an overseas audience, especially the Indian diaspora as well as audience from the participating BRICS countries.\n\nStory continues below this ad\n\nA logo and theme are also being worked upon on the lines of the G20 Presidency. The theme for India’s G20 Presidency was ‘Vaisudhaiva Kutumbakam (the world is one)’, which had found a huge resonance amid ongoing global conflicts.\n\nIndia during its G20 presidency had organised around 200 meetings, which were spread across 60 cities. The sources said the same infrastructure and model can be used this time, while also incorporating learnings from 2023.\n\nThe MEA is presently in the process of hiring an external agency to “integrate, plan, deliver all promotional and branding activities related to India’s BRICS Presidency to the ministry”. Once that is done, a mega publicity blitz will be launched next month, in the run-up to the Presidency.\n\nA BRICS-themed Kite festival is also being planned, while for Diwali next year, BRICS logo may be projected through “ecological diyas” in key cities and state capitals. A special Republic Day tableau themed around BRICS is also being considered, besides a curated food festival showcasing cuisines from Indian states as well as member nations.\n\nStory continues below this ad\n\nAll key events next year, such as the Kerala boat festival, the sand art festival of Odisha and Goa carnival will also have adequate projection of the BRICS logo. The platform of each of the events and track meetings will be used to highlight India’s achievements in the space and start-up sectors, said the sources. A theme song will also be composed, to be sung by a well-known Indian musician.",
  "summary": "",
  "published": "Thu, 20 Nov 2025 21:39:15 +0000",
  "url": "https://indianexpress.com/article/india/brics-presidency-india-to-follow-g20-model-take-meetings-delegations-to-all-states-uts-10377329/",
  "source": "India | The Indian Express"
}