{
  "title": "How to Go Paperless in 9 Steps",
  "text": "Wanting to get rid of paper in your life is easy. Following through with that promise to yourself is hard.\n\nI've been mostly paperless for close to 15 years, and the trick to it for me was to think about it the same way I think about taking care of my teeth.\n\nStaying organized is a kind of hygiene. It's almost never a one-and-done cleanup job. So think about dental hygiene. We learn to brush our teeth twice a day, floss once a day, and see a dentist every six months to catch problems before they get worse. However, if you don't follow that schedule precisely, you can still have good dental hygiene. You just have to do enough. If you do almost everything you're supposed to, but you miss two days of flossing or are a few months late scheduling your next cleaning, your teeth won't suddenly fall out.\n\nWith hygiene (or any kind of maintenance), you don't have to be perfect; you just have to be good enough.\n\nGoing paperless is very much like that. Here, I want to share with you the plan I used to remove most paper from my life. It should help you get started, but know in advance that you don't have to stick to it exactly every moment of every day. You can mess up. You can forget. So long as you get into the habit most of the time, you'll find yourself mostly paperless in a couple of months.\n\n9 Steps for Going Paperless\n\nDecide where to keep digitized papers. A natural choice is to save them in a cloud storage service, such as Dropbox, iCloud, Google Drive, Microsoft OneDrive, etc. By saving them in the cloud, you always have a backup. If you save files locally to your device, you could lose them all if your device is destroyed, lost, or stolen.\n\nCreate an inbox. An inbox is nothing more than a folder where you will save newly scanned papers by default. If you are highly organized, you might have specific folders where you want to sort each paper you scan. That's great. But where will the files go when you're feeling lazy or strapped for time? By creating an inbox, you have a catch-all place where scanned files remain until you're able to sort them.\n\nPick a scanning app, and don't overthink it. At this point in time, the majority of scanning apps are all perfectly suitable for digitizing paper. (Scanning photos is another story and requires a specialized app or a scanner.) If your cloud storage service has a mobile app, chances are the app has a built-in scanner. Use that. For example, the one included in the Dropbox app works great. It turns your phone's camera into a scanner, with autofocus, auto edge-detection, cropping tools, and everything else you'd want in a basic scanner.",
  "summary": "You promised yourself you’d digitize every last receipt, document, and paper record. But the trick to getting rid of paper is to not worry about being perfect.",
  "published": "Thu, 20 Nov 2025 12:00:00 +0000",
  "url": "https://www.wired.com/story/how-to-go-paperless-in-9-steps/",
  "source": "WIRED"
}