{
  "title": "Everyday microplastics could be fueling heart disease",
  "text": "A research team at the University of California, Riverside has found that routine exposure to microplastics -- tiny pieces released from packaging, fabrics, and common consumer plastics -- may speed up the formation of atherosclerosis, the artery-narrowing condition associated with heart attacks and strokes. The effect appeared only in male mice, offering new insight into how microplastics may influence cardiovascular health in people.\n\n\"Our findings fit into a broader pattern seen in cardiovascular research, where males and females often respond differently,\" said lead researcher Changcheng Zhou, a professor of biomedical sciences in the UCR School of Medicine. \"Although the precise mechanism isn't yet known, factors like sex chromosomes and hormones, particularly the protective effects of estrogen, may play a role.\"\n\nMicroplastics Found Throughout the Environment and the Body\n\nMicroplastics are found widely in the modern environment, including in food, drinking water, and the air. They have also been detected inside the human body. Recent clinical studies have identified microplastics in atherosclerotic plaques and associated higher concentrations with elevated cardiovascular risk, although it was not clear whether these particles directly cause arterial injury.\n\n\"It's nearly impossible to avoid microplastics completely,\" Zhou said. \"Still, the best strategy is to reduce exposure by limiting plastic use in food and water containers, reducing single-use plastics, and avoiding highly-processed foods. There are currently no effective ways to remove microplastics from the body, so minimizing exposure and maintaining overall cardiovascular health -- through diet, exercise, and managing risk factors -- remains essential.\"\n\nStudy Design Using a Heart Disease Mouse Model\n\nIn their paper published in Environment International, Zhou and colleagues describe their use of LDLR-deficient mice, a common model for examining atherosclerosis. Both male and female mice were placed on a low-fat, low-cholesterol diet similar to what a lean and healthy person might eat.\n\nThe team then administered microplastics daily (10 milligrams per kilogram of body weight) for nine weeks. This amount reflects levels that could realistically be encountered through contaminated food and water.\n\nMicroplastics Intensify Plaque Formation in Male Mice\n\nThe results showed a sharp increase in atherosclerosis, but only in males. Male mice exposed to microplastics developed 63% more plaque in the aortic root, the segment of the aorta connected to the heart, and 624% more plaque in the brachiocephalic artery, a major vessel branching from the aorta in the upper chest. Female mice exposed to the same conditions did not show significant plaque progression.\n\nThe researchers confirmed that microplastics did not cause weight gain or increased cholesterol in either sex. The mice stayed lean, and their lipid profiles remained unchanged, indicating that traditional risk factors such as obesity or high cholesterol did not explain the heightened arterial damage.\n\nDisruption of Artery-Lining Cells\n\nThe study also showed that microplastics interfered with the function and makeup of cells lining the arteries. Using single-cell RNA sequencing, which identifies gene activity in individual cells, the researchers observed that microplastics altered several cell types involved in atherosclerosis. Endothelial cells -- the cells that form the inner lining of blood vessels and help regulate inflammation and circulation -- were affected the most.\n\n\"We found endothelial cells were the most affected by microplastic exposure,\" Zhou said. \"Since endothelial cells are the first to encounter circulating microplastics, their dysfunction can initiate inflammation and plaque formation.\"\n\nMicroplastics Enter Arterial Plaques and Alter Gene Activity\n\nFluorescent microplastics used in the study were found inside plaques and concentrated within the endothelial layer, consistent with reports from human samples that have revealed microplastics in arterial lesions.\n\nAnother key observation was that microplastics activated harmful gene pathways in endothelial cells from both mice and humans. This included genes associated with pro-atherogenic (plaque-promoting) activity, suggesting that microplastics trigger similar biological responses across species.\n\n\"Our study provides some of the strongest evidence so far that microplastics may directly contribute to cardiovascular disease, not just correlate with it,\" Zhou said. \"The surprising sex-specific effect -- harming males but not females -- could help researchers uncover protective factors or mechanisms that differ between men and women.\"\n\nFuture Research on Sex Differences and Microplastic Types\n\nZhou and his team emphasize that more work is needed to determine why males appear more susceptible. The group plans to investigate whether humans show similar patterns.\n\n\"We would like to investigate how different types or sizes of microplastics affect vascular cells,\" Zhou said. \"We will also look into the molecular mechanisms behind endothelial dysfunction and explore how microplastics affect male and female arteries differently. As microplastic pollution continues to rise worldwide, understanding its impacts on human health -- including heart disease -- is becoming more urgent than ever.\"\n\nZhou conducted the study with collaborators from UCR, Boston Children's Hospital and Harvard Medical School in Massachusetts, and the University of New Mexico Health Sciences.\n\nThe work received partial support from the National Institutes of Health.\n\nThe title of the paper is \"Microplastic exposure elicits sex-specific atherosclerosis development in lean low-density lipoprotein receptor-deficient mice.\"",
  "summary": "Microplastics—tiny particles now found in food, water, air, and even human tissues—may directly accelerate artery-clogging disease, and new research shows the danger may be far greater for males. In mice, environmentally realistic doses of microplastics dramatically worsened plaque buildup, altered key vascular cells, and activated harmful genes linked to inflammation and atherosclerosis, all without changes to weight or cholesterol.",
  "published": "Tue, 18 Nov 2025 23:33:39 EST",
  "url": "https://www.sciencedaily.com/releases/2025/11/251118220047.htm",
  "source": "All Top News -- ScienceDaily"
}