{
  "title": "Biafran separatist leader sentenced to life on terrorism charges by Nigerian court",
  "text": "The Biafran separatist leader Nnamdi Kanu has been sentenced to life in prison on terrorism-related charges by a court in the Nigerian capital, Abuja.\n\nJudge James Omotosho said prosecutors had shown that Kanu, who also holds British citizenship, had used his Indigenous People of Biafra group (Ipob) to incite attacks on security officials and civilians in south-east Nigeria and during anti-police protests in Lagos.\n\n“The court finds that the defendant, Nnamdi Kanu, is an international terrorist and must be treated accordingly,” Omotosho said.\n\n“His intention was quite clear as he believed in violence. These threats of violence were nothing but terrorist acts,” the judge had said earlier while convicting him.\n\nKanu, 58, who had dismissed his legal team and represented himself during the trial, was earlier ejected from court for “unruly” behaviour. “Which law states that you can charge me on an unwritten law? Show me,” Kanu said before he was removed from the court. “Omotosho, where is the law? Any judgment declared in this court is a complete rubbish.”\n\nThe Ipob leader was first taken into state custody in October 2015 and faced multiple charges, including treasonable felony. Eighteen months later, he was granted bail before disappearing until a controversial 2021 extradition from Kenya, which his supporters described as an extraordinary rendition.\n\nProsecutors had called for Kanu to face the death penalty.\n\nKanu sought to revive the short-lived state of Biafra, which seceded from Nigeria in 1967, sparking a civil war during which up to 3 million people died.\n\nAfter its troops surrendered in 1970, Biafra, which comprised the old Eastern Region – most of which is today’s south-eastern Nigeria – was reintegrated into the country.\n\nSeveral secessionist movements have sprung up to protest against what they see as political and economic marginalisation of the region, rallying members of the diaspora to donate to the agitation for independence, including training militia in the region’s forests.\n\nView image in fullscreen Nnamdi Kanu at the federal high court in Abuja, January 2016. In 2017, Ipob was proscribed as a terrorist organisation by the Nigerian government. Photograph: Afolabi Sotunde/Reuters\n\nIpob, seen as the most consequential of these movements, relied for long periods on Kanu’s oratory on the London-based Radio Biafra as a tool of campaign. During Kanu’s time in prison, a splinter group emerged, the Biafran Government in Exile (BGIE), whose self-declared prime minister, Simon Ekpa, was sentenced to six years on terrorism-related charges by a Finnish court in September.\n\nBoth groups have been accused of a campaign of terror in south-east Nigeria where militants regularly and violently enforce Mondays as “sit-at-home days”, banning business, schooling and other activity.\n\nAccording to the geopolitical risk consultancy SBM Intelligence, as many as 700 deaths have been linked to separatist militants since 2021, including a May 2024 incident where five soldiers and six others were killed in an ambush in Abia state. During the conflict, military personnel have also been implicated in multiple cases of human rights abuses.\n\nIn 2017, Ipob was proscribed as a terrorist organisation by the Nigerian government. Since then, Kanu has hired US lobby firms, including one owned by the ex-congressman Jim Moran. Reports in Nigeria have tied those efforts to the designation of Nigeria as a “country of particular concern” this month by Donald Trump, who threatened to attack Nigeria while citing unproven claims of a “Christian genocide” in the north.\n\nBefore the final verdict, it emerged that Kanu had written directly to Trump claiming that a “Judeo-Christian genocide” was under way in south-east Nigeria.",
  "summary": "<p>Judge says Nnamdi Kanu used his Indigenous People of Biafra group to incite attacks on security officials and civilians</p><p>The Biafran separatist leader Nnamdi Kanu has been sentenced to life in prison on terrorism-related charges by a court in the Nigerian capital, Abuja.</p><p>Judge James Omotosho said prosecutors had shown that Kanu, who also holds British citizenship, had used his Indigenous People of Biafra group (Ipob) to incite attacks on security officials and civilians in south-east Nigeria and during anti-police protests in Lagos.</p> <a href=\"https://www.theguardian.com/world/2025/nov/20/nigerian-court-convicts-biafran-separatist-leader-on-terrorism-charges-nnamdi-kanu\">Continue reading...</a>",
  "published": "Thu, 20 Nov 2025 16:24:29 GMT",
  "url": "https://www.theguardian.com/world/2025/nov/20/nigerian-court-convicts-biafran-separatist-leader-on-terrorism-charges-nnamdi-kanu",
  "source": "The Guardian"
}