{
  "title": "Secret translation of Nauruan president’s interview on NZYQ deal with Australia to stay suppressed for decade",
  "text": "A top secret translation of the Nauruan president’s public commentary on the NZYQ deal will remain suppressed for a decade after the Albanese government considered its release “inappropriate”.\n\nNauru declined to endorse an informal translation by Australia’s high commission of the 10-minute public interview uploaded to Facebook in February, nor did it provide its own translation, newly released documents reveal.\n\nThe interview in Nauruan with the Pacific nation’s president, David Adeang, was posted online shortly after Australia’s home affairs minister, Tony Burke, announced Australia had struck a deal with Nauru to send the first of about 350 members of the so-called NZYQ cohort there after the 2023 high court ruling freed them from indefinite detention.\n\nGuardian Australia reported on Adeang’s comments at the time using an informal translation from a Nauruan speaker – of which there are fewer than 10,000 worldwide.\n\nSign up: AU Breaking News email\n\nBut the informal translation held by the Australian government has been subject to extreme secrecy, after it was deemed too harmful to publicly release and later subjected to a 10-year suppression order by the federal and high courts as part of one man’s challenge against his deportation to Nauru.\n\nInternal government correspondence tabled in the Senate on Thursday showed officials from the foreign affairs and home affairs departments had discussed Adeang’s comments in the weeks after. In March, a home affairs director said foreign affairs had advised them not to release the transcript of Adeang’s interview to a Senate estimates hearing.\n\nThe foreign minister, Penny Wong, explained this week that the translation notes had been “taken hastily” by an official who was not an accredited translator and were “for internal purposes only”.\n\n“The government of Nauru has confirmed it will not provide any translation of the interview. I am informed the notes were taken hastily, for internal purposes only, by a staff member in the Australian high commission in Nauru who is not an accredited translator,” Wong said in a letter accompanying the release of correspondence.\n\n“The translation of Nauruan to English is the source of much debate in Nauru. As the government of Nauru has not provided its own translation, nor endorsed the above-mentioned notes as a true and accurate reflection of the interview, it would not be appropriate to release them and doing so would damage our bilateral relationship.”\n\nAustralia’s deal with Nauru is expected to cost more than $400m in the deal’s first year, and about $2.5bn over the deal’s 30-year lifetime.\n\nOne of the three men first announced for deportation – an Iranian refugee whose visa was cancelled after he was convicted of murdering his wife in the 1990s and who was placed in indefinite detention after serving his sentence – launched a challenge in the federal court against his removal.\n\nThe man, known in the courts as TCXM, sought to avoid being offloaded to Nauru by arguing he had serious health conditions and was not afforded procedural fairness.\n\nThe federal court judge dismissed the case and applied a suppression order over sensitive details of Australia’s arrangement with Nauru. The order includes the countries’ memorandum of understanding and the transcript of Adeang’s February interview in Nauru.\n\nTCXM’s appeal, which was moved to the high court, will be heard in December. But the transfer of other members of the NZYQ cohort remains opaque. Sources on Nauru say a number of people are being held in the RPC3 detention complex, but that they have not been sighted outside the centre.\n\nSuccessive Australian governments have imposed extreme secrecy around their offshore detention regime.\n\nThe Howard government issued an edict that “no personalising or humanising images” should be taken of asylum seekers, while Scott Morrison, as immigration and prime minister, repeatedly told reporters “we don’t comment on on-water matters”.\n\nThe Albanese government has repeatedly told the Senate it would not reveal the details of a multimillion-dollar “confidential bilateral agreement” it has signed with Papua New Guinea to hold asylum seekers and refugees formerly detained on Manus Island. “The release … could reasonably be expected to cause damage to the Australian government’s international relations,” the government said.\n\nThis month, Adeang arrived in Canberra for a series of meetings with government ministers not previously declared by either government – as most visits by heads of state are – leading to speculation around a “secret” visit, amid controversy around Australia removing NZYQ members to Nauru, and Australia’s contracts on the island.",
  "summary": "<p>Penny Wong says translation notes were ‘taken hastily’ by official who was not accredited translator and were ‘for internal purposes only’</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/nov/20/australia-news-live-volcano-java-labor-nature-laws-coalition-sussan-ley-anthony-albanese-nsw-leadership-spill-liberal-chaos-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>A top secret translation of the Nauruan president’s public commentary on the NZYQ deal will remain suppressed for a decade after the Albanese government considered its release “inappropriate”.</p><p>Nauru declined to endorse an informal translation by Australia’s high commission of the 10-minute public interview uploaded to Facebook in February, nor did it provide its own translation, newly released documents reveal.</p> <a href=\"https://www.theguardian.com/world/2025/nov/20/secret-translation-nauru-president-interview-nzyq-deal-australia-suppressed\">Continue reading...</a>",
  "published": "Thu, 20 Nov 2025 08:02:18 GMT",
  "url": "https://www.theguardian.com/world/2025/nov/20/secret-translation-nauru-president-interview-nzyq-deal-australia-suppressed",
  "source": "World news | The Guardian"
}