{
  "title": "Bihar CM Oath Ceremony Highlights: Nitish Kumar sworn in as Bihar CM; PM Modi says ‘leaders will take Bihar to new heights’",
  "text": "Nov 20, 2025 06:16 PM IST\n\nBihar CM Oath Ceremony LIVE: A mix of veterans, fresh entrants and social balancing\n\nAs Bihar's longest-serving Chief Minister Nitish Kumar took oath for a record tenth time on Thursday, his 26-member cabinet presented a mix of senior coalition leaders and 10 new entrants, with the focus on caste and regional balance.\n\nKumar, who has been in power for over 19 years, retained several veterans from his own Janata Dal (United) and ally BJP.\n\nAccording to the list, 10 of the 26 cabinet members are newcomers.\n\nKumar's cabinet retained senior BJP leaders Samrat Choudhary and Vijay Kumar Sinha, both of whom were deputy chief ministers in the previous government, while the JD(U) retained long-serving ministers Bijendra Prasad Yadav, Vijay Kumar Choudhary and Shrawon Kumar.\n\nThe BJP also brought back its former ministers — Mangal Pandey, Pramod Kumar, Surendra Prasad Mehta and Nitin Nabin. The saffron party's state chief, Dilip Jaiswal, who had resigned from the cabinet nearly two years ago in keeping with the party's 'one person, one post' policy, was back in the council of ministers.\n\nAnother minister who is back after a break is Narayan Prasad. He had lost his post in 2022 when the CM abruptly quit the NDA and was not re-inducted upon the JD(U) supremo's return to the BJP-led coalition last year.\n\nFrom smaller NDA allies, HAM(S) once again nominated Santosh Kumar Suman, son of former Chief Minister Jitan Ram Manjhi.\n\nThe new faces include shooter-turned-MLA Shreyasi Singh (BJP) from Jamui and Aurai MLA Rama Nishad (BJP), daughter-in-law of former Union minister Jaynarayan Nishad, seen as part of the party's outreach to the EBC Mallah community.\n\nDeepak Prakash, son of RLM chief Upendra Kushwaha, entered the cabinet despite not being a legislator. He is expected to be accommodated in the legislative council within six months.\n\nVeteran BJP leader Ram Kripal Yadav returned to prominence after defeating RJD's Ritlal Yadav in Danapur. Sanjay Kumar Singh and Sanjay Kumar have been inducted from LJP(RV), which secured two cabinet berths.\n\nThe cabinet comprises three women ministers—Lesi Singh (JDU) along with first-time ministers Shreyasi Singh and Rama Nishad. Jama Khan remains the lone Muslim representative.\n\nPolitical analysts say the composition of the cabinet highlights Kumar's attempt to maintain social balance within the ruling alliance. Of the 27 members, eight belong to upper castes, five are Dalits, one is Muslim, and 13 are from OBC/EBC categories.\n\nParty-wise, the BJP secured 14 berths, JD(U) eight, LJP(RV) two, while HAM(S) and RLM got one each.\n\nNotable absentees from the new cabinet include Nitish Mishra, Jiwesh Mishra, and Sanjay Saraogi, all of whom held ministerial roles in the previous government. Earlier in the day, Kumar was sworn in at a grand ceremony attended by Prime Minister Narendra Modi, Home Minister Amit Shah and CMs of several NDA-ruled states and senior alliance leaders.\n\nWith a tally of 89, the BJP emerged as the single largest party in the Bihar assembly. The maximum number of ministers permissible for the state cabinet, including the CM, is 36\n\nPTI",
  "summary": "",
  "published": "Thu, 20 Nov 2025 03:28:49 +0000",
  "url": "https://indianexpress.com/article/india/bihar-cm-nitish-kumar-oath-live-updates-swearing-in-govt-formation-10375444/",
  "source": "India | The Indian Express"
}