{
  "title": "From dismal Jan Suraaj show to retirement rumours: What Prashant Kishor said at first public address since Bihar poll drubbing",
  "text": "Jan Suraaj founder Prashant Kishor on Tuesday accepted full responsibility for the Jan Suraaj Party’s defeat in the Bihar Assembly elections, saying the campaign failed to bring about the “systemic change” it had promised. Addressing a press conference at the party’s Pataliputra camp office, Kishor said he would observe a day-long silent fast at the Bhitiharwa Gandhi Ashram on November 20 “as an act of atonement” for not meeting people’s expectations.\n\nOn party’s performance\n\n“We came to Bihar three years ago with the pledge of systemic transformation,” Kishor said. “We made an honest attempt but did not succeed. This failure is entirely mine. I take full responsibility for it. We could not bring about change, not even regime change. The people did not repose faith in us; the fault lies in our thinking or in the way we reached out to them.”\n\nExtending congratulations to the winning candidates, he said, “The people have chosen their own path and their own government. For us, this is a moment for self-reflection. To those whose expectations we could not meet, I offer my apologies.”\n\nKishor said that while the Jan Suraaj Party did not win votes, it had committed “no sin”.\n\n“Not getting votes is not a crime. We made mistakes, perhaps in strategy or communication, but we did not indulge in sins,” he said. “In a state where politics often revolves around caste and religion, we tried to talk about issues. We did not divide people by caste or religion. If others have committed those sins and won, they will have to answer for them, if not today, then tomorrow.”\n\nKishor announced that he would observe a one-day silent fast at the Gandhi Ashram in Bhitiharwa on November 20. Party workers across the state have been invited to join the optional collective fast from their respective locations.\n\nOn retiring from politics\n\nRejecting speculation about retiring from politics, Kishor compared his situation to the mythological Abhimanyu in the Mahabharata. “Even though Abhimanyu was surrounded and slain, the Pandavas eventually won,” he said. “Those who believe I will leave Bihar are mistaken. You are not defeated until you quit. We will not step back. We will work twice as hard as we did over the past three years.”\n\nStory continues below this ad\n\nKishor reiterated his resolve to continue Jan Suraaj’s outreach in villages and panchayats. “Our determination to reform Bihar is stronger than before,” he said. “We will keep fighting with full honesty and strength.”\n\nOn cash disbursals\n\nKishor levelled sharp criticism at the Bihar government, alleging that massive pre-poll cash disbursals under various livelihood programs amounted to “vote buying”. “For the first time in the country’s history, a state government spent or promised about ₹40,000 crore before an election,” he said. “Around 60,000 to 62,000 women in every Assembly constituency were given ₹10,000 each under the government’s self-employment scheme, with the assurance that if the ruling alliance returned to power, they would receive another ₹2 lakh within six months.”\n\nHe added that government functionaries, including Jeevika didis, ASHAs, and Anganwadi workers, were used to distribute the money and deliver the message. “Nearly ₹29,000 crore was disbursed through these networks. If the money was truly meant for employment generation and not just to buy votes, the government must now deliver the promised ₹2 lakh to all women who received ₹10,000,” Kishor said.\n\nHe urged Chief Minister Nitish Kumar to fulfil the promise within six months. “If the government fails to do so, it will become clear that money was not given under any scheme but merely to purchase votes,” he said. “If Nitish Kumar’s government provides ₹2 lakh each to 1.5 crore women within six months, I will retire from politics. If it does not, we will stand by these women and fight to secure their rights.”\n\nStory continues below this ad\n\nKishor announced a public contact number (91216 91216) for people to report if they do not receive the promised funds. “Those who were told they would get ₹2 lakh after voting for the government should contact us. We will accompany them to government offices and continue their fight,” he said.\n\n“We may not have a single MLA, but we have the people’s voice,” he said. “We will stand with every citizen who feels cheated, move from village to block to district, and continue to fight for truth and for Bihar’s future.”\n\nOn the EC\n\nKishor questioned the conduct of the Election Commission during the polls, especially regarding the timing of state welfare disbursals. “We are a small party, but the Opposition parties should discuss how effective the current Model Code of Conduct is,” he said. “If necessary, the matter should be taken to the Supreme Court.”\n\nHe compared recent polling practices to those during previous governments in Bihar. “During Lalu Prasad’s time, even Home Guards were kept away from election duties to maintain impartiality,” he said. “This time, the government used Jeevika workers who are under contract with the state to mobilise votes. That is a serious concern.”\n\nStory continues below this ad\n\nCiting the example of Madhubani constituency, Kishor pointed to what he claimed were voting irregularities. “In Madhubani, a candidate from Upendra Kushwaha’s party won with over a lakh votes, but many voters did not even know the party’s symbol. This raises questions about how such results were achieved,” he said. “We are not alleging fraud, but it is surprising and deserves investigation.”\n\nKishor said the coming formation of the new Bihar cabinet would test Chief Minister Nitish Kumar’s commitment to clean governance. “The people’s mandate is to form a government, not to loot or include corrupt ministers,” he said. “Prime Minister Narendra Modi and Amit Shah have promised development and jobs for Bihar’s youth. Our expectation is clear – form a cabinet free of tainted ministers, ensure employment, and stop migration.”\n\nReaffirming accusations of corruption made before the polls, he warned that Jan Suraaj would pursue legal remedies if ministers previously accused of wrongdoing were inducted again. “If those four leaders return to the government, we will approach the courts,” he said. “A case regarding unaccounted funds of ₹70,000 crore, flagged by the CAG, has already been filed in the Patna High Court.”",
  "summary": "",
  "published": "Tue, 18 Nov 2025 12:51:07 +0000",
  "url": "https://indianexpress.com/article/india/from-dismal-jan-suraj-show-to-retirement-rumours-what-prashant-kishor-said-at-first-public-address-since-bihar-poll-drubbing-10372693/",
  "source": "India | The Indian Express"
}