{
  "title": "Delhi school suicide: How a 'warning' over dance practice pushed teen to the brink; details emerge",
  "text": "Delhi suicide case\n\nDelhi Student Suicide Case: Massive Protest Outside School After Note Alleges Harassment By Teachers\n\nNEW DELHI: What should have been a routine school morning turned tragic for 16-year-old Shourya Patil's family. He had refused to perform a dance because of a sprained ankle — but warning from his teachers that morning pushed him to the brink.Shourya left the school through the back gate and never reached his designated pick-up point. “The next we heard was that he had jumped from the metro station,\" said a relative.A handwritten suicide note recovered from Shourya’s school bag blamed the teachers for his death.In it, he wrote, “The school staff said so much that I had to do it… My last wish is that action be taken against them so that no other student does what I did. I am sorry, but the teachers did this to me.”Also read: 'He slipped and fell, teacher said he did it intentionally': Father of class 10 student who died by suicide in Delhi He also expressed apologies to his family and requested that his organs be donated to those in need.The suicide note found in also mentioned the names of the teachers who allegedly humiliated him. \"My last wish is that action is taken against them, I don't want any other child to do something like me (sic),\" it said.Following the incident, the Delhi police registered an FIR against four teachers, who have been suspended.The suspension order instructed them to stay available for official communication and barred them from visiting the school or interacting with students, staff, or parents without written permission.A police team visited the school to speak with students and also retrieved CCTV footage connected to the incident. \"We have gathered information on the teachers mentioned in the FIR and will be issuing summonses for them to appear in the investigation,\" an officer said.A friend of Shourya said, \"He had faced issues for a long time. This wasn’t the first incident; many students had complained that St. Columbus School wasn’t good, and the teachers spoke harshly.\"Shaurya wanted to be a dancer and was very involved in the drama club to build his portfolio. But the drama teacher used to push and insult him, saying he was ‘overacting’ and shouldn’t act so much,\" she added further.",
  "summary": "A 16-year-old student, Shourya Patil, tragically died after reportedly jumping from a metro station, following a dispute with teachers over a dance performance due to a sprained ankle. A suicide note found in his bag blamed the school staff for his actions, leading to an FIR against four teachers who have since been suspended and barred from school contact.",
  "published": "Fri, 21 Nov 2025 09:37:10 +0530",
  "url": "https://timesofindia.indiatimes.com/city/delhi/delhi-school-suicide-case-how-warning-over-dance-practice-pushed-st-columbas-class-10-student-to-the-brink/articleshow/125476644.cms",
  "source": "Times of India"
}