{
  "title": "Outrage after Trump accuses Democrats of ‘seditious behavior, punishable by death’",
  "text": "Democrats expressed outrage after Donald Trump accused a group of Democratic lawmakers of engaging in “SEDITIOUS BEHAVIOR, punishable by DEATH” and that they should be arrested after they posted a video in which they told active service members they should refuse illegal orders.\n\nThe video, released on Tuesday, features six Democratic lawmakers who have previously served in the military or in intelligence roles, including senators Elissa Slotkin and Mark Kelly, and representatives Maggie Goodlander, Chris Deluzio, Chrissy Houlahan and Jason Crow.\n\n“Like us, you all swore an oath to protect and defend this constitution,” the lawmakers said in the 90-second video. “And right now, the threats to our constitution aren’t just coming from abroad, but from right here at home. Our laws are clear, you can refuse illegal orders, you can refuse illegal orders, you must refuse illegal orders. No one has to carry out orders that violate the law or our constitution.”\n\nThat seemed to prompt a furious response from the US president.\n\nOn Thursday morning, Trump wrote on Truth Social: “It’s called SEDITIOUS BEHAVIOR AT THE HIGHEST LEVEL. Each one of these traitors to our Country should be ARRESTED AND PUT ON TRIAL.”\n\nIn another post, he wrote: “This is really bad, and Dangerous to our Country. Their words cannot be allowed to stand. SEDITIOUS BEHAVIOR FROM TRAITORS!!! LOCK THEM UP??? President DJT.” In a third post, he added: “SEDITIOUS BEHAVIOR, punishable by DEATH!” He also reposted a statement that said: “HANG THEM GEORGE WASHINGTON WOULD !!”\n\nFollowing Trump’s statements on Thursday, House Democratic leader Hakeem Jeffries, Democratic whip Katherine Clark and Democratic caucus chair Pete Aguilar released a joint statement condemning the remarks.\n\n“Political violence has no place in America,” they wrote. “Representatives Jason Crow, Chris DeLuzio, Maggie Goodlander and Chrissy Houlahan and Senators Mark Kelly and Elissa Slotkin all served our country with tremendous patriotism and distinction. We unequivocally condemn Donald Trump’s disgusting and dangerous death threats against members of Congress, and call on House Republicans to forcefully do the same.”\n\nThe Democratic leaders also said that they had been in contact with the House sergeant at arms and the United States Capitol police “to ensure the safety of these members and their families”.\n\n“Donald Trump must immediately delete these unhinged social media posts and recant his violent rhetoric before he gets someone killed,” the statement added.\n\nThe lawmakers who appeared in the video also released a statement.\n\n“We are veterans and national security professionals who love this country and swore an oath to protect and defend the constitution of the United States,” they said. “That oath lasts a lifetime, and we intend to keep it. No threat, intimidation, or call for violence will deter us from that sacred obligation.”\n\n“What’s most telling is that the president considers it punishable by death for us to restate the law,” they continued. “Our service members should know that we have their backs as they fulfill their oath to the constitution and obligation to follow only lawful orders. It is not only the right thing to do, but also our duty.”\n\nThey added: “Every American must unite and condemn the president’s calls for our murder and political violence. This is a time for moral clarity.”\n\nChuck Schumer, the Democratic Senate minority leader, also condemned Trump’s remarks and posted on X: “Let’s be crystal clear: the President of the United States is calling for the execution of elected officials.”\n\nskip past newsletter promotion Sign up to This Week in Trumpland Free newsletter A deep dive into the policies, controversies and oddities surrounding the Trump administration Enter your email address Sign up Privacy Notice: Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on theguardian.com to send you this newsletter. You can complete full registration at any time. For more information about how we use your data see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nHe added: “This is an outright THREAT. Every Senator, every Representative, every American – regardless of party – should condemn this immediately and without qualification.”\n\nMike Johnson, the Republican House speaker, defended Trump’s claim that the Democrats had engaged in “sedition”, describing the video as “wildly inappropriate”, adding: “It is very dangerous, you have leading members of Congress telling troops to disobey orders, I think that’s unprecedented in American history.”\n\nJohnson also reportedly told the Independent that in what he read of Trump’s posts, Trump was “defining the crime of sedition”.\n\n“But obviously attorneys have to parse the language and determine all that. What I’m saying, what I will say unequivocally, that was a wildly inappropriate thing for so-called leaders in Congress to do to encourage young troops to disobey orders,” Johnson added.\n\n1:03 White House asserts Trump doesn't want to execute Democratic lawmakers – video\n\nDuring a White House press conference on Thursday afternoon, when asked by a reporter, “Does the president want to execute members of Congress?”, Karoline Leavitt, the White House press secretary, responded: “No.”\n\n“Let’s be clear about what the president is responding to,” Leavitt said. “You have sitting members of the US Congress who conspired together to orchestrate a video message to members of the US military, to active duty service members encouraging them to defy the president’s lawful orders.\n\nShe said: “The sanctity of our military rests on the chain of command, and if that chain of command is broken, it can lead to people getting killed, it can lead to chaos, and that’s what these members of Congress … are essentially encouraging.”",
  "summary": "<p>US president roundly decried for Truth Social post after lawmakers told military personnel to refuse illegal orders</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/live/2025/nov/20/donald-trump-jeffrey-epstein-justice-department-zohran-mamdani-news-updates-us-politics-live\">US politics live – latest updates</a></p></li></ul><p>Democrats expressed outrage after <a href=\"https://www.theguardian.com/us-news/donaldtrump\">Donald Trump</a> accused a group of Democratic lawmakers of engaging in “SEDITIOUS BEHAVIOR, punishable by DEATH” and that they should be arrested after they posted a video in which they told active service members they should refuse illegal orders.</p><p>The <a href=\"https://x.com/SenatorSlotkin/status/1990774492356902948\">video</a>, released on Tuesday, features six Democratic lawmakers who have previously served in the military or in intelligence roles, including senators Elissa Slotkin and Mark Kelly, and representatives Maggie Goodlander, Chris Deluzio, Chrissy Houlahan and Jason Crow.</p> <a href=\"https://www.theguardian.com/us-news/2025/nov/20/democrats-condemn-trump-military-video-post\">Continue reading...</a>",
  "published": "Thu, 20 Nov 2025 20:15:45 GMT",
  "url": "https://www.theguardian.com/us-news/2025/nov/20/democrats-condemn-trump-military-video-post",
  "source": "The Guardian"
}