{
  "title": "Former Chile President Michelle Bachelet gets Indira Gandhi Peace Prize",
  "text": "The Indira Gandhi Prize for Peace, Disarmament and Development for 2024 was Wednesday presented by Congress Parliamentary Party (CPP) chairperson Sonia Gandhi to Michelle Bachelet, the first and only woman President of Chile and a former chief of UN Human Rights.\n\nBachelet is a two-term President of Chile (2006-2010 and 2014-2018). During her term as the United Nations High Commissioner for Human Rights, Bachelet was critical of the Indian government, and in 2020, had called on the government of India to safeguard human rights of those defending them. She also expressed regret at legal constraints faced by NGOs. Bachelet had expressed concern over the use of the Foreign Contribution Regulation Act (FCRA), which, she said, was “open to abuse”, and “indeed actually being used to deter or punish NGOs for human rights reporting and advocacy that the authorities perceive as critical in nature”.\n\nBachelet was critical of Citizenship Amendment Act (CAA), and had said that “activists and human rights defenders have also come under mounting pressure” while participating in protests against the CAA in 2019-20. She had criticised the Indian government for using the provisions under the UAPA against activists.\n\nDuring her terms as President of Chile, she is known to have promoted the rights of all. She is also credited with education and tax reforms in the country. She has left a legacy with the creation of the National Institute for Human Rights and the Museum of Memory and Human Rights, and establishment of the Ministry of Women and Gender Equality. During her term, quotas were adopted to increase women’s political participation, and she is known to have worked for advancing LGBT rights.\n\nWhile handing over the prize to the Chilean leader, Sonia Gandhi said that Bachelet’s influence extended far beyond the borders of Chile and Latin America, when she was appointed as the first Director of UN Women Agency in 2010 and later as the UN High Commissioner for Human Rights.\n\n“Bachelet has seen at first hand, loss, oppression, torture and exile in her early years. It is a remarkable coincidence how both these two women were born and raised in times of strife. Their country, their people, their family and they themselves were victims of subjugation,” said Gandhi, drawing parallels between Indira Gandhi and Bachelet.\n\nThe Chilean leader’s father, Air Force Brigadier General Alberto Bachelet, died in prison after opposing Augusto Pinochet’s 1973 military coup.\n\nStory continues below this ad\n\nAfter accepting the prize, Bachelet paid tribute to Indira Gandhi. “She (Indira) believed that nations could prosper only if they lived in harmony with one another. This belief feels even more urgent in today’s fragmented world,” the Chilean leader said. “It is a true privilege to be once again in India, a country of extraordinary cultural richness, profound history, and vibrant diversity,” she added.\n\nSonia Gandhi said as India’s first and only woman PM, Indira Gandhi reshaped the country with her policies. She said the Indira Gandhi Prize for Peace, Disarmament and Development was instituted in 1985 in the memory of “one of the most extraordinary women leaders of our time”.",
  "summary": "",
  "published": "Wed, 19 Nov 2025 22:10:02 +0000",
  "url": "https://indianexpress.com/article/india/former-chile-president-michelle-bachelet-gets-indira-gandhi-peace-prize-10374946/",
  "source": "India | The Indian Express"
}