{
  "title": "This tiny quantum clock packs a billion-fold energy mystery",
  "text": "A team led by the University of Oxford has uncovered an unexpected contributor to entropy in quantum timekeeping: the act of measurement itself. In findings published on November 14 in Physical Review Letters, the researchers show that the energy required to read a quantum clock is far greater than the energy needed to run it. Their results point to new challenges and opportunities for developing next-generation quantum technologies.\n\nTraditional clocks, from pendulums to atomic oscillators, depend on irreversible processes to track time. At the quantum level, these processes become extremely weak or may barely occur at all, which makes reliable timekeeping far more complicated. Devices such as quantum sensors and navigation systems, which rely on precise timing, will need internal clocks that use energy sparingly. Until now, the thermodynamic behavior of these systems has remained largely unknown.\n\nInvestigating the Real Energy Cost of Time\n\nThe researchers set out to determine the true thermodynamic burden of keeping time in the quantum realm and to separate how much of that cost is caused by the act of measurement.\n\nTo explore this, they built a tiny clock that uses single electrons hopping between two nanoscale regions (known as a double quantum dot). Each hop serves as a clock-like tick. The team then monitored these ticks using two different techniques; one measured extremely small electric currents, while the other used radio waves to detect subtle changes in the system. In both approaches, the detectors convert quantum events (electron jumps) into classical information that can be recorded: a quantum-to-classical transition.\n\nA Billion-Fold Measurement Energy Surprise\n\nThe team calculated the entropy (amount of energy dissipated) generated both by the clock itself (i.e., the double quantum dot) and by the measurement devices. They found that the energy required to read the quantum clock (i.e., to convert its tiny signals into something measurable) can be up to a billion times larger than the energy used by the clockwork. This result challenges the long-held belief that measurement costs in quantum physics are negligible. It also reveals something striking: observation introduces irreversibility, which is what gives time its forward direction.\n\nThis finding overturns the usual expectation that improving quantum clocks requires better quantum components. Instead, the researchers argue that future progress depends on designing measurement methods that gather information more efficiently.\n\nRethinking Efficiency in Quantum Clock Design\n\nLead author Professor Natalia Ares (Department of Engineering Science, University of Oxford) said: \"Quantum clocks running at the smallest scales were expected to lower the energy cost of timekeeping, but our new experiment reveals a surprising twist. Instead, in quantum clocks the quantum ticks far exceed that of the clockwork itself.\"\n\nAccording to the researchers, this imbalance might actually offer an advantage. The additional energy used during measurement can provide richer information about the clock's behavior, not only counting ticks but capturing every minor fluctuation. This could make it possible to build highly precise clocks that operate more efficiently.\n\nCo-author Vivek Wadhia (PhD student, Department of Engineering Science) said: \"Our results suggest that the entropy produced by the amplification and measurement of a clock's ticks, which has often been ignored in the literature, is the most important and fundamental thermodynamic cost of timekeeping at the quantum scale. The next step is to understand the principles governing efficiency in nanoscale devices so that we can design autonomous devices that compute and keep time far more efficiently, as nature does.\"\n\nCo-author Florian Meier (PhD student, Technische Universität Wien) said: \"Beyond quantum clocks, the research touches on deep questions in physics, including why time flows in one direction. By showing that it is the act of measuring -- not just the ticking itself -- that gives time its forward direction, these new findings draw a powerful connection between the physics of energy and the science of information.\"\n\nThe study also involved researchers from TU Wien and Trinity College Dublin.",
  "summary": "Scientists built a tiny clock from single-electron jumps to probe the true energy cost of quantum timekeeping. They discovered that reading the clock’s output requires vastly more energy than the clock uses to function. This measurement process also drives the irreversibility that defines time’s forward direction. The insight could push researchers to rethink how quantum devices handle information.",
  "published": "Mon, 17 Nov 2025 21:49:45 EST",
  "url": "https://www.sciencedaily.com/releases/2025/11/251117091138.htm",
  "source": "All Top News -- ScienceDaily"
}