{
  "title": "Liz Cheney Takes A Swipe At Trump And MAGA During Father's Funeral",
  "text": "LOADING ERROR LOADING\n\nIn what appeared to be an indirect swipe at MAGA politicians within the Republican Party, former Rep. Liz Cheney (R-Wy.) stressed at her father’s funeral Thursday that while he himself was a member of the GOP, he would never prioritize the party over country.\n\nThe ex-lawmaker and eldest daughter of the late Dick Cheney delivered a powerful eulogy before a packed audience at Washington National Cathedral, which included, among other influential figures, two former presidents and all four living former vice presidents. President Donald Trump and Vice President JD Vance were reportedly not invited to the service.\n\nAdvertisement\n\nIn her eulogy, Liz Cheney spoke of how her father was inspired to pursue a career in politics after attending a speech by then-President John F. Kennedy at the University of Wyoming.\n\n“Though he was inspired to service by President Kennedy, Dick Cheney became a Republican,” she said. “But he knew that bonds of party must always yield to the single bond we share as Americans. For him, a choice between defense of the Constitution and defense of your political party was no choice at all.”\n\nThe White House did not immediately respond to HuffPost’s request for comment. The president has, however, spent the past several hours suggesting the execution of Democratic veterans urging military members to follow the law.\n\nAdvertisement\n\nDick Cheney, who served as George W. Bush’s vice president from 2001 to 2009, died on Nov. 3 at the age of 84. Despite his widely unpopular reputation of destabilizing the Middle East and serving as the architect of the Iraq War, Cheney was still considered a powerful conservative from a time when the Republican Party was not divided based on the degree of loyalty to the president.\n\nCheney’s death received a tepid response from the White House, with Trump not publicly expressing condolences and Vance on Thursday calling him “a guy who served his country.” Despite endorsing Trump’s 2016 campaign, Cheney grew increasingly critical of his fellow Republican — particularly after the insurrection at the Capitol by MAGA rioters on Jan. 6, 2021.",
  "summary": "The Republican ex-congresswoman said that while Dick Cheney was a powerful member of the GOP, he would never place party over country.",
  "published": "Thu, 20 Nov 2025 16:05:38 -0500",
  "url": "https://www.huffpost.com/entry/liz-cheney-swipes-trump-maga-father-dick-eulogy_n_691f606be4b071a086ba263e",
  "source": "Politics"
}