{
  "title": "India, Russia look to finalise new pacts during Putin visit",
  "text": "Weeks ahead of Russian President Vladimir Putin’s visit to India for the 23rd Annual India-Russia Summit, External Affairs Minister S Jaishankar and his Russian counterpart Sergey Lavrov held a meeting in Moscow to discuss details of the summit and also finalise a slew of pacts, including those on defence and mobility, that may be signed during the visit.\n\nIn his opening statement at the meeting, his sixth with Lavrov in a year amid the increasing pressure from Washington over India’s import of Russian oil, Jaishankar said they will exchange views on the complex global situation with the openness that has always characterised the bilateral ties.\n\n“I welcome this opportunity to meet again and our regular interactions — you mentioned six this year so far — have been greatly helpful in advancing our bilateral cooperation and also sharing perspectives on important regional, global and multilateral issues,” he said.\n\n“This particular occasion, for me, is all the more important as we prepare for President Putin’s visit to India for the 23rd Annual Summit,” he said.\n\nDuring President Putin’s visit, the two sides aim to finalise a number of bilateral agreements and also announce several new initiatives and projects. “We look forward to their (project) finalisation in the coming days. These will certainly add more substance and texture to our Special and Privileged Strategic Partnership,” said Jaishankar.\n\nAlthough the dates for Putin’s visit have not been officially announced yet, it is likely to happen in the first week of next month.\n\n“We will also exchange views on the complex global situation with the openness that has always characterised our ties. This includes the Ukraine conflict, as also the Middle East and Afghanistan amongst others,” Jaishankar said in his opening remarks.\n\nStory continues below this ad\n\nFollowing the imposition of 50% tariffs on India by the US President Donald Trump said last month, after a call with PM Narendra Modi, that they discussed trade and India’s move to cut purchase of Russian oil.\n\nExplained Big-ticket deals on the table\n\nHowever, New Delhi has reiterated several times that its import policies are guided entirely by the objective to safeguard the interests of the Indian consumer in a volatile energy scenario.\n\nOn Monday, Jaishankar said, “India supports recent efforts towards establishing peace. We hope that all parties approach that goal constructively. An early cessation of the conflict and the ensuring of an enduring peace is in the interest of the entire international community.”\n\nThe Foreign Minister is in Moscow to lead the Indian delegation at the meeting of the Council of Prime Ministers of the SCO, to be held Tuesday. President Putin is also scheduled to meet the leaders of the SCO during their visit. “India-Russia ties have long been a factor of stability in international relations. Its growth and evolution is not only in our mutual interest but also in that of the world,” Jaishankar said.\n\nStory continues below this ad\n\nMeanwhile, Putin’s close aide Nikolay Patrushev met NSA Ajit Doval in Delhi Monday to discuss bilateral ties.",
  "summary": "",
  "published": "Mon, 17 Nov 2025 23:30:36 +0000",
  "url": "https://indianexpress.com/article/india/india-russia-look-to-finalise-new-pacts-during-putin-visit-10371530/",
  "source": "India | The Indian Express"
}