{
  "title": "Scientists find a surprising link between lead and human evolution",
  "text": "A major international research effort is reshaping the long-held belief that lead exposure is primarily a modern problem. The new findings show that early human ancestors encountered lead repeatedly for more than two million years, suggesting that this toxic metal may have played an unexpected role in shaping the evolution of hominid brains, behavior, and possibly language.\n\nThe study -- published in Science Advances -- also offers a new angle on why modern humans ultimately surpassed Neanderthals. Lab-grown brain organoids with Neanderthal genetic variants reacted more strongly to lead than organoids with human genetics, hinting that Neanderthals may have been more vulnerable to lead's neurological effects.\n\nResearchers from the Geoarchaeology and Archaeometry Research Group (GARG) at Southern Cross University (Australia), the Department of Environmental Medicine at the Icahn School of Medicine at Mount Sinai Hospital (New York, USA), and the School of Medicine at the University of California San Diego (UCSD, USA) combined fossil chemistry, brain organoid experiments, and evolutionary genetics to uncover how lead factored into hominid history.\n\nEvidence of Ancient Lead Exposure in Fossil Teeth\n\nFor many years, lead toxicity was assumed to be closely tied to human industry, including smelting, mining, and the use of leaded petrol and paint. That view shifted when researchers analysed 51 fossil teeth from a range of hominids and great apes, including Australopithecus africanus, Paranthropus robustus, early Homo, Neanderthals, and Homo sapiens. The teeth showed clear chemical traces of intermittent lead exposure that stretch back nearly two million years.\n\nHigh-precision laser-ablation geochemistry performed at Southern Cross University's GARG Facility (located in Lismore, NSW) and at Mount Sinai's Exposomics laboratories revealed distinct 'lead bands' in the enamel and dentine. These bands formed during childhood and indicate recurring periods of lead intake from environmental sources (such as polluted water, soil, or volcanic activity) or from lead stored in the body's bones and released during times of stress or illness.\n\n\"Our data show that lead exposure wasn't just a product of the Industrial Revolution -- it was part of our evolutionary landscape,\" said Professor Renaud Joannes-Boyau, Head of the GARG research group at Southern Cross University.\n\n\"This means that the brains of our ancestors developed under the influence of a potent toxic metal, which may have shaped their social behavior and cognitive abilities over millennia.\"\n\nHow Lead Interacted With Early Brain Development\n\nTo understand the functional impact of this exposure, the team studied human brain organoids, which serve as simplified, lab-grown models of early brain development. They tested how lead affected two versions of a key developmental gene known as NOVA1, which regulates gene expression under lead exposure during neurodevelopment. The modern human version of NOVA1 differs from the variant seen in Neanderthals and other extinct hominids, although the reason for this evolutionary change was previously unclear.\n\nOrganoids carrying the Neanderthal-like NOVA1 variant showed substantial disruptions in FOXP2-expressing neurons in the cortex and thalamus when exposed to lead. These brain regions are essential for language and speech development. Organoids with the modern human NOVA1 gene showed far less disruption.\n\n\"These results suggest that our NOVA1 variant may have offered protection against the harmful neurological effects of lead,\" said Professor Alysson Muotri, Professor of Pediatrics/Cellular & Molecular Medicine and Director of the UC San Diego Sanford Stem Cell Institute Integrated Space Stem Cell Orbital Research Center.\n\n\"It's an extraordinary example of how an environmental pressure, in this case, lead toxicity, could have driven genetic changes that improved survival and our ability to communicate using language, but which now also influence our vulnerability to modern lead exposure.\"\n\nGenetic Insights Into the Rise of Modern Humans\n\nGenetic and proteomic data from the study showed that lead exposure in organoids with archaic gene variants disrupted multiple pathways tied to neurodevelopment, communication, and social behavior. The FOXP2 disruptions are especially noteworthy because of FOXP2's well-established role in speech and language. These results suggest that long-term pressure from environmental toxins may have nudged cognitive and communicative traits along different evolutionary paths in modern humans and Neanderthals.\n\n\"This study shows how our environmental exposures shaped our evolution,\" said Professor Manish Arora, Professor and Vice Chairman of Environmental Medicine.\n\n\"From the perspective of inter-species competition, the observation that toxic exposures can offer an overall survival advantage offers a fresh paradigm for environmental medicine to examine the evolutionary roots of disorders linked to environmental exposures.\"\n\nWhat Ancient Lead Exposure Means for Us Today\n\nAlthough modern lead exposure is mostly linked to industrial activities, it continues to pose a serious health threat, especially for children. The new findings show that human susceptibility to lead may be deeply rooted in our evolutionary past and shaped by interactions between genes and environmental conditions.\n\n\"Our work not only rewrites the history of lead exposure,\" added Professor Joannes-Boyau, \"it also reminds us that the interaction between our genes and the environment has been shaping our species for millions of years, and continues to do so.\"\n\nThe research drew on fossil teeth from Africa, Asia, Europe, and Oceania, using detailed geochemical mapping to trace childhood episodes of lead intake. In parallel, brain organoids containing either modern or archaic NOVA1 genes were used to study how lead affected brain development, with particular attention to FOXP2, a gene central to language. Genetic, transcriptomic, and proteomic analyses were combined to build a broad understanding of how lead may have influenced the evolution of hominid cognition and social behavior.",
  "summary": "Researchers found that ancient hominids—including early humans—were exposed to lead throughout childhood, leaving chemical traces in fossil teeth. Experiments suggest this exposure may have driven genetic changes that strengthened language-related brain functions in modern humans.",
  "published": "Sun, 16 Nov 2025 09:50:51 EST",
  "url": "https://www.sciencedaily.com/releases/2025/11/251115095930.htm",
  "source": "All Top News -- ScienceDaily"
}