{
  "title": "Sutton's predictions v singer Olly Murs",
  "text": "Murs is a talented footballer as well as a successful singer and has been a star of several Soccer Aid matches down the years - but he is not planning a serious comeback as a player.\n\n\"I actually played in a charity game the other night for a friend of mine,\" he told BBC Sport. \"My team was losing 3-1 when I came off in the 60th minute, and they went on to win 4-3, so you can read into that what you will!\n\n\"I still love football, but I injured my knee a few years ago and it still isn't where I want it to be. I wish I could play more but the unpredictability of the game means it's too risky for me in my career to do it properly again.\n\n\"Plus I am 41 now, and we are not all Cristiano Ronaldo, are we!? No, I am very happy not playing football and I am gearing up for the moment that my daughter or son decides to play instead.\"\n\nMurs and his wife Amelia Tank have two children, Madison and Albert, and he is ready to follow in his father's footsteps by becoming their coach.\n\n\"I won't force football on our kids but I've already told Amelia that if they do get the bug for it then I will have to go and get my coaching badges - and I will probably be managing their Saturday or Sunday football team,\" he said.\n\n\"I watched my nephews play a lot, and I really got into it, and I obviously owned a football club [non-league side Coggeshall Town] for a while too.\n\n\"My dad did it with us when I was a kid, which is probably where I get it from. He managed our team for two or three seasons and had great fun with it. That could could be the future for me as well, and I am looking forward to it!\"\n\nChris Sutton and Olly Murs were speaking to BBC Sport's Chris Bevan.\n\nThe AI predictions were generated using Microsoft Copilot Chat - we simply asked the tool to 'predict this weekend's Premier League scores'.",
  "summary": "BBC Sport football expert Chris Sutton takes on singer Olly Murs - and AI - with his predictions for this weekend's Premier League fixtures.",
  "published": "Thu, 20 Nov 2025 18:58:51 GMT",
  "url": "https://www.bbc.com/sport/football/articles/c4gp7glkdr3o?at_medium=RSS&at_campaign=rss",
  "source": "BBC Sport"
}