{
  "title": "Smoking cannabis with tobacco may disrupt the brain’s “bliss molecule”",
  "text": "People who use both cannabis and tobacco show measurable differences in brain activity compared to those who rely solely on cannabis, according to new findings from a McGill University team at the Douglas Research Centre.\n\nThese results may help clarify why people who combine the two substances more often experience symptoms such as anxiety and depression, and why attempts to quit cannabis tend to be more difficult for them than for people who avoid tobacco.\n\n\"This is the first evidence in humans of a molecular mechanism that may underlie why people who use both cannabis and tobacco experience worse outcomes,\" said lead author Rachel Rabin, Associate Professor in McGill's Department of Psychiatry and researcher at the Douglas.\n\n\"Identifying this mechanism is an important step toward finding targets for future medications to treat cannabis use disorder, especially among those that co-use tobacco. Right now, the only available treatments are behavioral therapies such as counseling,\" she said.\n\nCo-Use Common Even as Tobacco Use Declines\n\nIn Canada, roughly one in 20 people who used cannabis within the past year are considered at risk for cannabis use disorder. Among people who consume cannabis more often, the rate jumps to about one in three.\n\nThe researchers note that tobacco use is decreasing overall, yet the majority of cannabis users still report using tobacco as well. Rabin explained that most previous studies focused on each substance separately, leaving a major gap that this early-stage research is beginning to fill.\n\nChanges in the Brain's \"Bliss Molecule\" System\n\nPET scans showed that people who used both cannabis and tobacco had elevated levels of FAAH when compared to those using cannabis alone. FAAH is an enzyme that breaks down anandamide, a naturally occurring compound often described as the \"bliss molecule\" because of its influence on mood and stress responses. Higher FAAH levels mean lower anandamide levels, a pattern that has previously been linked to anxiety, depression and higher relapse rates among people trying to stop using cannabis.\n\nSmall Study Offers Early Clues\n\nThe analysis involved 13 young adults. Eight used only cannabis, while five used cannabis and smoked cigarettes every day. Cannabis use averaged slightly above one gram per day. Cigarette intake ranged from one to 12 per day.\n\nBecause the data was originally gathered for an unrelated project, there was no tobacco-only group for comparison. This means the changes could potentially be caused by tobacco alone, although the researchers believe the results point to a more complex interaction.\n\n\"What surprised us was how strong the effect was, and how different it was from those who only used cannabis, compared to those who used both tobacco and cannabis,\" said co-author Romina Mizrahi, Professor of Psychiatry and director of the McGill Research Center for Cannabis.\n\nNext Steps in Understanding Tobacco's Role\n\nThe team is now recruiting people who smoke cigarettes and people who vape nicotine for a follow-up project that will explore whether similar brain changes appear in the absence of cannabis.\n\n\"A preliminary investigation of tobacco co-use on endocannabinoid activity in people with cannabis use\" by Rachel Rabin, Joseph Farrugia, Ranjini Garani and Romina Mizrahi was published in Drug and Alcohol Dependence Reports.\n\nThe study received funding from the National Institute of Mental Health.",
  "summary": "Scientists found that people who use both cannabis and tobacco show a distinct brain pattern tied to mood and stress regulation. Their scans revealed higher levels of an enzyme that reduces a natural feel-good molecule in the brain. This imbalance may help explain why co-users experience more anxiety and struggle more when quitting.",
  "published": "Sat, 15 Nov 2025 23:15:04 EST",
  "url": "https://www.sciencedaily.com/releases/2025/11/251115095932.htm",
  "source": "All Top News -- ScienceDaily"
}