{
  "title": "Utah delegation in India, pitches rare earth collaboration",
  "text": "As Indian and US negotiators work to clear the sticking points on a trade deal, a Utah delegation comprising lawmakers and businessmen is holding discussions here about collaborating on critical minerals and hiring tech talent from India, pitching the state as the next Silicon Valley.\n\nRepublican Senator J Stuart Adams, part of the delegation, told The Indian Express: “There’s a real challenge right now with the ability to get critical minerals… It’s really important that there be multiple sources for the type of products that we need to allow a free market to exist.”\n\nChina is currently the dominant global supplier of rare earths.\n\nUtah has critical minerals and is starting to mine them, Adams said. “I believe India probably has access to some of them, and we are hopeful that we can help them mine those so that there will be multiple sources for those types of products… that brings stability to the world and allows us to have international security. At any point, if there’s only one source for any product, that doesn’t help world stability,” he said.\n\nThe delegation is spending two weeks in India travelling through Mumbai, Bangalore, Goa and Hyderabad, besides Delhi. It met state governments besides officials from the Ministry of Commerce, and discussed clean and sustainable energy, critical minerals, aerospace and defence, financial services and information technology.\n\nOn the trade negotiations, Adams said: “There are sensitive negotiations going on right now. I am optimistic that there will be an agreement, which will be positive for both countries and will also help bring national and international security.” India and the US had said that the negotiations may be finalised in the coming days and months.\n\nWhat critical minerals get traded from country to country will be determined in this trade agreement, said Adams. “We have the most critical minerals in the world, and some of them are the most rare critical minerals, existing in a form that is most easy to process. Utah has the most capacity for critical minerals among all 50 (American) states.”\n\nStory continues below this ad\n\nThe delegation members were also bullish on hiring Indian talent for tech companies back home, despite the recent H-1B fee hike by the Donald Trump regime, and a section of Republican lawmakers bringing legislation to end H-1B.\n\nJonathan Freedman, CEO of World Trade Centre, Utah, said: “The more collaboration we can have, the better and safer the world’s going to be… India is the most populous nation in the world. Many speak English. It’s a strong ally and so there are far more reasons to work together than not to work together. While there are obstacles, I am optimistic those will get figured out.”\n\nHe said: “It’s a really significant message that President Trump is sending Ambassador (Sergio) Gor to India… India has a savvy, young population that has unbelievable capacity and Utah has the same. We have the youngest population in the entire United States. We have a tech sector that is unbelievably capable, and is actually as good or better than Silicon Valley.”",
  "summary": "",
  "published": "Sun, 16 Nov 2025 13:24:14 +0000",
  "url": "https://indianexpress.com/article/india/utah-delegation-india-pitches-rare-earth-collaboration-10369372/",
  "source": "India | The Indian Express"
}