{
  "title": "Chelsea searches for new manager as Premier League breaks record for most sackings in a single season",
  "text": "CNN —\n\nIt was just six months ago that Graham Potter was deemed the man to usher in a fresh, exciting era at Chelsea.\n\nThe club’s new ownership group, led by American businessman Todd Boehly, had enticed Potter away from Brighton with the promise of managing one of the most lucrative teams in world soccer.\n\nMore than $600 million was spent on bringing big-name players to the club and Potter, one of the most exciting young managers in the Premier League, was to mold them into a winning machine.\n\nBut, on Sunday, the club announced that it had sacked its manager after an underwhelming spell in charge.\n\nPotter managed to win just 10 of the 28 league matches this season and leaves the team 11th in the Premier League table.\n\nIn recent weeks, players had looked a shadow of their former selves and many fans had lost confidence that Potter’s plan for the club could ever work.\n\nEventually, after previously sticking by its manager, Blues ownership agreed.\n\n“On behalf of everyone at the club, we want to thank Graham sincerely for his contribution to Chelsea,” the club’s co-owners Todd Boehly and Behdad Eghbali said in a statement.\n\n“We have the highest degree of respect for Graham as a coach and as a person. He has always conducted himself with professionalism and integrity and we are all disappointed in this outcome.”\n\nChelsea's position in the league has nosedived in recent weeks. Marc Atkins/Getty Images\n\nIn his previous role as Brighton manager, Potter was given time to stamp his identity on the squad.\n\nThe club was punching above its weight financially and, as a result, carefully selected new signings which would compliment Potter’s style of play.\n\nThe approach paid off as the team became an established Premier League outfit which has gone on to greater things this season – the Seagulls currently sit sixth in the league and in the UEFA Conference League qualification spot.\n\nAt Chelsea, it seemed the complete opposite.\n\nAs was the case under previous owner Roman Abramovich, the club expected instant results and used its financial weight to sign a number of high-profile names, including the likes of Enzo Fernández and Mykhailo Mudryk.\n\nDespite his impressive CV, Potter had never managed superstars and suddenly found himself in a changing room with multiple.\n\nThe scatter gun approach to recruitment also left the team lacking balance and organization with Potter failing to get a tune out of a team busting with talent.\n\nPremier League record\n\nIn truth, many had raised an eyebrow when Potter, inexperienced at the very top level, was chosen to replace Thomas Tuchel as manager.\n\nDespite falling out of favor with fans by the end of his tenure, Tuchel had guided Chelsea to the Champions League title in 2021 and is still considered by many as one of the best coaches in the world.\n\nThe German has gone on to sign with Bavarian giant Bayern Munich through the 2024/25 season and recently told reporters he needed “quite a bit of time to distance himself from Chelsea” because leaving the club had hurt him.\n\n“Todd [Boehly] said he would be different to Roman [Abramovich],” former Liverpool player and current pundit Jamie Carragher wrote on Twitter.\n\n“I feel for Graham Potter, but it was inevitable. You don’t change Tuchel for Potter. Ridiculous decision to start with.”\n\nWith 10 games left in the league and a Champions League quarterfinal against Real Madrid on the horizon, Chelsea still has plenty to play for.\n\nAssistant coach Bruno Saltor will take over on an interim basis, but Boehly and his team must now look for a long-term replacement capable – and willing – to bring order to Chelsea’s chaos.\n\nPotter’s sacking is yet another sign of just how transient managers can be in the top-flight of English football, especially when results aren’t instantaneous.\n\nThere has now been a record 12 sackings in the Premier League so far this season, with Potter leaving his position the same day Leicester boss Brendan Rodgers was sacked from his.\n\nThe previous record was 10 manager changes in a single season, set in four other campaigns, most recently in 2017/18.",
  "summary": "It was just six months ago that Graham Potter was deemed the man to usher in a fresh, exciting era at Chelsea.",
  "published": "Mon, 03 Apr 2023 14:46:53 GMT",
  "url": "https://www.cnn.com/2023/04/03/football/chelsea-graham-potter-manager-premier-league-spt-intl/index.html",
  "source": "CNN.com - RSS Channel - App International Edition"
}