{
  "title": "Tension simmering between allies BJP, Tipra Motha in Tripura; cases of arson, violence reported",
  "text": "Amid simmering tension between the ruling BJP and its ally Tipra Motha, some miscreants Thursday set ablaze a BJP activist’s house at Khumulwng in West Tripura district, headquarters of Tripura Tribal Areas Autonomous District Council (TTAADC).\n\nLater in the day, the police said they deployed adequate security in the area and assured that the situation was under control. However, no case was lodged till the time of filing this report.\n\n“Some miscreants tried to disturb law and order. We are patrolling the area, and adequate forces have been deployed. The situation is under control now. We appeal to those who are involved in such unruly activities… to refrain… or else, none will be let free and legal action will be taken,” said a senior police officer.\n\nMeanwhile, two cases were registered after a group of unknown miscreants attacked a BJP office and assaulted a woman in two separate incidents in the West Tripura district, said the police.\n\nAs per a suo motu case registered by the police, 60-70 unidentified people with their faces covered attacked a BJP office in Jampuijala with rods, lathis, etc, and damaged flags, festoons and furniture on Wednesday night. They also damaged a vehicle and a hut belonging to a local.\n\nUpon receiving the information of the attack, a team from the Jampuijala police station rushed to the spot and tried to intervene, but the miscreants attacked them.\n\nTo disperse the mob, the cops burst two smoke grenades. The mob fled but, on their way, allegedly attacked a local BJP supporter, identified as Suman Debbarma, 25. The victim received grievous injuries and has been admitted to the Takarjala hospital.\n\nStory continues below this ad\n\nIn another incident, a group comprising 20-25 people allegedly sexually assaulted a woman and damaged her house in West Tripura district on Wednesday.\n\nThe victim has complained that the miscreants were supporters of the Tipra Motha.\n\nAccording to the complaint, the miscreants fled after her neighbours came to the spot to rescue her after hearing her screams.\n\nA case was lodged at the police station concerned on Thursday under Sections 191(3), 190, 331, 74, and 324(2) of the Bharatiya Nyaya Sanhita based on the victim’s complaint.\n\nStory continues below this ad\n\nReacting to the incidents, BJP spokesperson Nabendu Bhattacharjee said, “There is an attempt to create an unruly situation. Administrative steps would surely be taken. Our party will also take all steps within the democratic framework.”",
  "summary": "",
  "published": "Thu, 20 Nov 2025 17:05:42 +0000",
  "url": "https://indianexpress.com/article/india/tension-between-allies-bjp-tipra-motha-tripura-arson-violence-10377010/",
  "source": "India | The Indian Express"
}