{
  "title": "Large-scale immunity profiling grants insights into flu virus evolution",
  "text": "A new study has shown that person-to-person variation in antibody immunity plays a key role in shaping which influenza (flu) strains dominate in a population.\n\nThe work, published today as a Reviewed Preprint in eLife, uses a high-throughput sequencing-based assay to quantify antibody immunity against circulating H3N2 flu strains in both children and adults. The editors describe this as an important study that advances our understanding of population-level immunity, and say that the strength of evidence is compelling. The work will be of interest to immunologists, virologists, vaccine developers and researchers working on mathematical modelling of infectious diseases.\n\nFlu viruses accumulate mutations that help them evade antibodies generated by the immune system after prior infections or vaccinations. This process means that people can be reinfected with the flu multiple times in their lives, and vaccines must be regularly updated to remain effective. The human immune response to flu is shaped by a variety of factors, including the strains an individual has previously encountered.\n\n“Differences in infection and vaccination histories within a group of people mean that population immunity to a specific variant of the flu is highly varied,” says co-lead author Caroline Kikawa, an MD/PhD student in the Department of Genome Sciences, University of Washington, Seattle, USA, and the Division of Basic Sciences and Computational Biology Program, Fred Hutch Cancer Center, Seattle, USA. “Understanding how this variety in antibodies across a population affects the evolutionary success of new flu strains has remained challenging, in part because conventional methods to quantify antibody levels are too slow and can only assess a handful of samples at a time.” Kikawa served as lead author of the study alongside Andrea Loes, Staff Scientist and Lab Manager at senior author Jesse Bloom’s lab, Division of Basic Sciences and Computational Biology Program, Fred Hutch Cancer Center.\n\nTo address this challenge, Kikawa, Loes and colleagues developed a high-throughput neutralisation assay to measure how well individual serum samples – the component of blood that contains antibodies – can block infection by a panel of different flu viruses. High-throughput refers to the assay’s ability to process large amounts of data simultaneously.\n\nThe team produced viruses expressing 78 distinct hemagglutinin (HA) proteins from 2023-circulating flu viruses and recent vaccine strains, and tagged each one with a unique genetic ‘barcode’. HA proteins are a part of the virus recognised by antibodies, and can rapidly change to evade the immune response. The team mixed these viruses with sera and used a technique called Illumina sequencing to quantify how well each virus was neutralised.\n\nUsing this approach, the researchers measured neutralisation titers – a measurement of how much serum is needed to neutralise the virus – against the 78 flu variants using 150 serum samples, from children and adults, collected in 2023 in the US. In total, they generated over 11,000 individual titer measurements, creating a detailed snapshot of population immunity at the start of the 2023–2024 flu season.\n\nThe results showed wide variation in neutralisation responses between individuals. For example, some of the sera collected from children strongly neutralised nearly all tested strains, while others had a much weaker response. Adults generally showed more consistent immunity, but still displayed considerable variation individually. Overall, the highest rates of neutralisation responses were found in a subset of children, consistent with the idea that neutralising antibody responses are highest to strains encountered during the first decades of life. It could also be that children are more prone to flu and could therefore be more likely to have recent immunological boosting. These findings highlight that immunity to the flu is highly personalised.\n\nTo evaluate how this variation affects virus evolution, the researchers compared neutralisation titers with the growth rates of each viral strain during the 2023 flu season. They used a statistical model called multinomial logistic regression to analyse how the frequency of each strain changed over time in the human population, and compared this to the fraction of serum samples that had low neutralisation titers against each strain.\n\nThey found that the strains that spread most successfully were those that escaped neutralisation in a larger fraction of the sera. Specifically, strains were more likely to grow in frequency when a high percentage of individuals had titers below a threshold, indicating weaker immunity against that strain. This suggests that large-scale sequencing-based neutralisation assays can help inform our understanding of flu virus evolution.\n\nThis relationship held when neutralisation was measured using individual sera, but not when the sera were pooled together. In some virus surveillance systems, pooled serum samples are used to estimate population immunity. However, this finding suggests that pooled measurements may fail to capture the full range of responses seen in individuals.\n\n“Our findings show that individual-level immune variation, not just average immunity across the population, is a key factor in determining which flu strains are most successful,” says Loes.\n\nWhile the study involved a large number of titer measurements, the authors note that the samples were collected from a limited set of locations and age groups. Most child samples came from a hospital in Seattle, while adult samples were drawn from vaccinated cohorts in Philadelphia and Australia. As a result, the dataset may not fully reflect global patterns of immunity.\n\n“This is nevertheless one of the largest datasets linking human antibody immunity to the success of flu virus strains in a population,” says senior author and HHMI Investigator Jesse Bloom, Professor in the Basic Sciences Division and Herbold Computational Biology Program at Fred Hutch Cancer Center, and Affiliate Professor of Genome Sciences at the University of Washington. “It provides a framework for understanding how diverse immune histories can affect viral evolution. These methods could complement existing surveillance systems and support vaccine composition decisions by providing more detailed insights into population immunity.”",
  "summary": "A new study shows how person-to-person variation in antibody immunity plays a key role in shaping which influenza (flu) strains dominate in a population.",
  "published": "Tue, 03 Jun 2025 11:46:34 EDT",
  "url": "https://www.sciencedaily.com/releases/2025/06/250603114634.htm",
  "source": "Latest Science News -- ScienceDaily"
}