{
  "title": "Dark matter acts surprisingly normal in a new cosmic test",
  "text": "Does dark matter behave according to the same physical rules that apply to ordinary matter? This question remains one of the major puzzles in modern cosmology, since this invisible form of matter (which neither emits nor reflects any light) is still hypothetical and extremely difficult to study directly. Researchers from the University of Geneva (UNIGE) and collaborating institutions aimed to see whether dark matter follows familiar behavior on the largest scales, or whether other forces might influence it. Their study, published in Nature Communications, indicates that dark matter appears to act much like ordinary matter, although they cannot yet rule out the possibility of an additional, previously unknown interaction. Because dark matter is thought to be five times more common than ordinary matter, even a small new insight helps clarify its role in shaping the Universe.\n\nOrdinary matter is affected by four known fundamental forces: gravity, electromagnetism, and the strong and weak forces within atoms. The question is whether dark matter responds to the same set of forces. While dark matter is invisible and difficult to detect, it may still follow these familiar laws or possibly be influenced by a fifth force that scientists have not yet identified.\n\nInvestigating How Dark Matter Moves Through Gravitational Wells\n\nTo explore this possibility, the UNIGE-led team examined whether dark matter sinks into gravitational wells the way ordinary matter does on cosmic scales. Massive objects distort the structure of space, forming these wells. Ordinary matter -- planets, stars and galaxies -- falls into them according to established physical principles that include Einstein's general relativity and Euler's equations. The team wanted to know whether dark matter behaves in the same predictable way.\n\n\"To answer this question, we compared the velocities of galaxies across the Universe with the depth of gravitational wells,\" explains Camille Bonvin, associate professor in the Department of Theoretical Physics at UNIGE's Faculty of Science and co-author of the study. \"If dark matter is not subject to a fifth force, then galaxies -- which are mostly made of dark matter -- will fall into these wells like ordinary matter, governed solely by gravity. On the other hand, if a fifth force acts on dark matter, it will influence the motion of galaxies, which would then fall into the wells differently. By comparing the depth of the wells with the galaxies' velocities, we can therefore test for the presence of such a force.\"\n\nDark Matter Appears to Follow Euler's Equations\n\nUsing this method on modern cosmological data, the researchers found that dark matter moves into gravitational wells in the same manner as ordinary matter, meaning it is consistent with Euler's equations. \"At this stage, however, these conclusions do not yet rule out the presence of an unknown force. But if such a fifth force exists, it cannot exceed 7% of the strength of gravity -- otherwise it would already have appeared in our analyses,\" says Nastassia Grimm first author of the study and former postdoctoral researcher at the Department of Theoretical Physics at UNIGE's Faculty of Science who has recently joined the Institute of Cosmology and Gravitation at the University of Portsmouth.\n\nWhat Comes Next in the Search for New Physics\n\nThese early findings represent an important step in refining our understanding of dark matter. The next key objective is to determine whether a subtle fifth force truly affects it. \"Upcoming data from the newest experiments, such as LSST and DESI, will be sensitive to forces as weak as 2% of gravity. They should therefore allow us to learn even more about the behavior of dark matter,\" concludes Isaac Tutusaus, researcher at ICE-CSIC and IEEC and associate professor at IRAP, Midi-Pyrénées observatory, University of Toulouse, co-author of the study.",
  "summary": "Dark matter may be invisible, but scientists are getting closer to understanding whether it follows the same rules as everything we can see. By comparing how galaxies move through cosmic gravity wells to the depth of those wells, researchers found that dark matter appears to behave much like ordinary matter, obeying familiar physical laws. Still, the possibility of a hidden fifth force lingers, one that must be very weak to have evaded detection so far.",
  "published": "Sun, 16 Nov 2025 03:57:55 EST",
  "url": "https://www.sciencedaily.com/releases/2025/11/251115095924.htm",
  "source": "All Top News -- ScienceDaily"
}