{
  "title": "Industry can’t wait any longer for a fix to its energy crisis. Ministers should get a move on | Nils Pratley",
  "text": "In the long list of budget submissions from the business world, here’s one the chancellor is probably disinclined to smile upon.\n\nMake UK, the body representing manufacturers, would like the government to expand its energy support scheme – the one unveiled in June as part of the shiny new industrial strategy – from 7,000 firms to 115,000 businesses. And it would like the promised savings in electricity bills to be backdated to April this year; as scheduled, the so-called British industrial competitiveness scheme, or BICS, is due to arrive only in April 2027.\n\nOne doubts Rachel Reeves will go there for three reasons. First, these things never get backdated. Second, broadening the scheme would obviously cost more and the government has pledged that other bill payers will not foot the bill – funding is instead supposed to come from “bearing down” on levies and costs in the energy system. Third, widening the scheme would run against the deliberate focus in the industrial strategy on just eight “priority” sectors, which include a few manufacturing industries (such as advanced manufacturing, life sciences and defence) but excludes many more.\n\nYet the spirit of Make UK’s call for the government to get a move on – and recognise that the energy crisis for industry is happening now – is spot-on.\n\nThe damning statistic that the UK has some of the most expensive industrial energy prices in the developed world is familiar. It is repeated with every act of deindustrialisation in the UK, from the Port Talbot steelworks to the Grangemouth oil refinery to this week’s news of the planned closure of ExxonMobil’s 40-year-old ethylene plant near Cowdenbeath in Fife. Those tales usually involve complicating factors (Exxon seems to be engaged in a pan-European restructuring, for example) but a common theme, alongside rising carbon levies, is the sky-high cost of energy.\n\nYet it is only in the next few days that Peter Kyle, the business secretary, will announce the formal consultation of how the BICS scheme will be implemented – meaning how it could be funded, who will be eligible and what the promise of savings in electricity bills of “up to” 25% will mean. Five months to get from a detail-free announcement about “slashing” electricity bills for “thousands of businesses” to a consultation is far too long.\n\nThe big development in the meantime is that industrial companies, like non-industrial ones, can see what’s coming next April in their electricity bills. The answer for some is hefty increases as higher transmission charges start to kick in to fund the five-year, £80bn upgrade of the electricity grid, plus a bit on top to finance new nuclear capacity. Heavy users could face annual increases of £500,000, reckons Make UK.\n\nTo be fair to the government, about 500 firms in the most energy-intensive industries – think steel, chemicals, glass and paper – will be shielded under the separate and established “supercharger” scheme. Their discount on network charges is being increased from 60% to 90%, so their bills should fall. But that still leaves a lot of companies who are heavy energy users – just not the “most intense” – in the eye of the storm.\n\nIn these circumstances, another of Make UK’s requests feels entirely reasonable: if backdating BICS is a non-starter, then fast-track the scheme to happen in April to coincide with the first blast of network-related costs. Waiting until 2027 is too late.\n\nskip past newsletter promotion Sign up to Business Today Free daily newsletter Get set for the working day – we'll point you to all the business news and analysis you need every morning Enter your email address Sign up Privacy Notice: Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on theguardian.com to send you this newsletter. You can complete full registration at any time. For more information about how we use your data see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nBack in the summer, the government was full of high-minded ambition about “powering Britain”, cutting electricity prices by up to £40 a megawatt hour for the 7,000 firms to “move us from being an outlier to right in the middle of the pack”. Kyle is due to speak at the Confederation of British Industry next week. Aside from explaining what the “up to” will mean in practice, he should say whether the scheme can be implemented sooner than 15 months from now.\n\n“The clock is ticking on tackling our eye-watering energy costs and it is now a case of political will rather than any technical constraints to addressing these,” says Make UK’s boss, Stephen Phipson. Fair comment. The government’s scheme, as it stands, is limited – but it should not take half a parliament to get it up and running. Get a move on.",
  "summary": "<p>Make UK’s call for the government to recognise that the energy crisis for industry is happening now is spot-on</p><p>In the long list of budget submissions from the business world, here’s one the chancellor is probably disinclined to smile upon.</p><p>Make UK, the body representing manufacturers, would like the government to expand its energy support scheme – the one unveiled in June as part of <a href=\"https://www.theguardian.com/politics/2025/jun/23/uk-industrial-strategy-the-key-points-and-whats-missing\">the shiny new industrial strategy</a> – from 7,000 firms to 115,000 businesses. And it would like the promised savings in electricity bills to be backdated to April this year; as scheduled, the so-called British industrial competitiveness scheme, or BICS, is due to arrive only in April 2027.</p> <a href=\"https://www.theguardian.com/business/nils-pratley-on-finance/2025/nov/20/industry-cant-wait-any-longer-for-a-fix-to-its-energy-crisis-ministers-should-get-a-move-on\">Continue reading...</a>",
  "published": "Thu, 20 Nov 2025 17:55:54 GMT",
  "url": "https://www.theguardian.com/business/nils-pratley-on-finance/2025/nov/20/industry-cant-wait-any-longer-for-a-fix-to-its-energy-crisis-ministers-should-get-a-move-on",
  "source": "The Guardian"
}