{
  "title": "Document Threatens Immigrant Children With 'Prolonged' Detention",
  "text": "LOADING ERROR LOADING\n\nA newly uncovered document flagged last week in a federal court filing threatens undocumented immigrant children in government custody with “prolonged” detention if they choose to exercise their legal rights rather than voluntarily depart the United States.\n\nThe document also says children could face immigration consequences if they pursue a legal pathway to remain in the United States by requesting to see a judge, or expressing a fear of returning to their home country. And it raises the possibility of them being transferred to Immigration and Customs Enforcement, and potentially being deported, if they turn 18 while in U.S. government custody.\n\nAdvertisement\n\nAnd, significantly, it threatens the arrest, deportation and potential criminal charges of a child’s sponsors ― such as family members, who normally take children out of government custody once they’re vetted by authorities ― if the sponsors are undocumented.\n\nThe document misrepresents the law and threatens to undermine immigrant children’s legal rights to pursue immigration cases in the United States, according to the attorney who flagged it as part of a federal lawsuit.\n\nIt’s unclear how widely the document has been distributed or, indeed, whether any children have directly been given the information it contains.\n\nAdvertisement\n\nAfter this story was published, Hilton Beckham, a spokesperson for U.S. Customs and Border Protection, referred to the document in a statement as an “advisal document provided to unaccompanied children” that “explains options available under the Immigration and Nationality Act on their path forward.” Beckham disputed that the assertions in the document were threats or misrepresentations of the law.\n\nBut its contents show the lengths the Trump administration is going to pressure immigrants ― even children, who get additional legal protections ― to leave the country “voluntarily,” in the process abandoning any legal effort to stay here lawfully.\n\nThe document is “quite alarming and disturbing,” said Suchita Mathur, senior litigation attorney with the American Immigration Council, one of the groups involved in the legal challenge against the Trump administration in which the filing surfaced. The challenge concerns the administration’s recent practice of turning 18-year-olds over to ICE custody once they age out of the government’s network of shelters for unaccompanied immigrant youth.\n\nAdvertisement\n\nMathur told HuffPost on Wednesday that plaintiffs in the case had heard from Trump administration attorneys, who told them, “Our clients have informed us that the document is a CBP document.”\n\n“It is clearly part of the administration’s attempt to intimidate and bully young people out of exercising their statutory rights,” Mathur added. “While it’s no surprise to see this administration weaponizing detention to punish noncitizens, the barely-veiled threats and misinformation in the document against a particularly vulnerable population is still shocking.”\n\nDuring the second Trump administration, children have spent months ― up from days or weeks in previous administrations ― in government custody. Rather than being detained by ICE, undocumented migrant children considered “unaccompanied” are placed in the custody of the Office of Refugee Resettlement, which is housed within the Department of Health and Human Services. ORR shelter styles vary, with some being group homes while others are more akin to juvenile detention, but children in ORR custody are generally not free to leave.\n\nAdvertisement\n\nEmily G. Hilliard, a spokesperson for the Department of Health and Human Services, referred HuffPost to CBP, “as this is part of their initial processing.”\n\nBeckham claimed in her statement that it was “blatantly false” to say the government was misrepresenting immigration law or threatening unaccompanied children.\n\n“CBP’s duty is to follow the law and protect children. Many unaccompanied minors are brought to the border by smugglers and face real risks of exploitation, which is why providing a clear, lawful advisal is essential. It ensures they understand their rights and options — and for many who were trafficked or coerced, returning home to their family is the safest path,” the statement added. “CBP will continue to apply the law, disrupt smuggling networks, and ensure vulnerable children are fully informed of their choices.”\n\nAdvertisement\n\nThe lengthy stays in ORR shelter custody result in part from the administration’s new requirement that sponsors who hope to take custody of immigrant youth submit certain specific identity and proof-of-income documents ― increasing the risk that the sponsors will interact with immigration agents and face arrest, detention and potential deportation if they are undocumented. The administration is currently being sued over the process by which it issued those new rules for sponsors.\n\n“These children are in an inherently coercive environment and are being implicitly encouraged to waive their legal rights, without the guidance of an attorney,” said Neha Desai, managing director for children’s human rights and dignity at the National Center for Youth Law, one of the groups suing the administration over the new requirements for sponsors.\n\n“The current administration has repeatedly demonstrated, in increasingly disturbing ways, that it is willing to flout protections put in place decades ago by a bipartisan Congress, and endanger children’s lives for political gain.”\n\nAdvertisement\n\nOn Nov. 11, a staff member at a shelter for unaccompanied migrant youth shared the document with attorney Marie Silver of the National Immigrant Justice Center, an organization that provides legal services to youth at the shelter. The guidance was among the charging documents related to a child being housed at the shelter.\n\nSince then, “shelter staff have shared with us that additional children have arrived with this document among their paperwork,” Silver said in an email Thursday. HuffPost has not been able to confirm the extent of the document’s use.\n\nSilver flagged the document as part of ongoing litigation in federal district court in Washington, D.C., over the Trump administration’s recent practice of transferring children who “age out” of these shelters directly to ICE custody when they turn 18. (NIJC is among the groups suing over the practice.)\n\nAdvertisement\n\nThe judge in that case has issued a temporary restraining order instructing the administration to comply with a 2021 ruling that authorities consider the “least restrictive setting available” for children aging out of ORR custody. The administration has responded by saying those teenagers ought to be subject to the same new mandatory detention policy it has applied to undocumented people across the country, with rare exceptions for “urgent humanitarian reasons or significant public benefit.”\n\n“This advisal completely misstates ― or at least dramatically misrepresents ― the immigration laws that apply to unaccompanied immigrant children,” Silver wrote in the filing.\n\n“You have been identified as an unaccompanied minor,” the document reads. “This information is intended to provide clarity about the steps involved.”\n\nAdvertisement\n\nThe document goes on to assert that if an unaccompanied immigrant child ― who the government refers to as “UACs,” or “unaccompanied alien children” ― voluntarily returns to their country of origin “within 72 hours,” there will be “no administrative consequence, and you will still have the opportunity to apply for a visa, through legal means, in the future.” This fits the administration’s (often-misleading) attempts to pressure undocumented people to leave the United States and abandon any ongoing legal effort to stay here.\n\nIf the child seeks a hearing with an immigration judge, or indicates a fear of returning to their home country ― which can trigger additional protections ― the document says they can “expect the following”:\n\nYou will be detained in the custody of the United States Government, for a prolonged period of time.\n\nIf your sponsor in the United States does not have legal immigration status, they will be subject to arrest and removal from the United States. The sponsor may be subject to criminal prosecution for aiding your illegal entry.\n\nIf you cannot substantiate your claim of fear of returning to your country, you can be barred from legally applying for a visa.\n\nIf you turn 18 years of age while in U.S. Government custody, you will be turned over to Immigration and Customs Enforcement for removal (deportation) from the United States. This can result in being barred from applying for a visa in the future.\n\nYou can read the document below (scroll to the bottom):\n\nSilver wrote that she believed the document “will cause significant distress and confusion among unaccompanied immigrant children, who are apprehended by immigration officials alone without their parents, and who are frequently survivors of violence and trauma.”\n\nGiven that stress, she continued, children might be so afraid of the government’s “consequences” that they will be unable to exercise their rights, in the form of seeking asylum or other protections against deportation.\n\nAdvertisement",
  "summary": "The Trump administration is turning the screws on kids who’ve arrived in the United States without adults accompanying them.",
  "published": "Thu, 20 Nov 2025 06:00:17 -0500",
  "url": "https://www.huffpost.com/entry/document-threatens-unaccompanied-immigrant-youth-with-detention_n_69177e18e4b0191be9d5181d",
  "source": "Politics"
}