{
  "title": "305 best Christmas gifts for 2025: truly brilliant presents tried, tested and handpicked by the Filter UK",
  "text": "Don’t you just love Christmas shopping? There’s a massive thrill in finding a present you know they’ll love and won’t have thought to ask for, but the pressure is enough to drive any sane person to hibernation.\n\nThe Guardian’s journalism is independent. We will earn a commission if you buy something through an affiliate link. Learn more.\n\nWe’ve gone the extra (2,000) miles to help you find the perfect gifts: we’ve tested out the latest products to see which ones are worth the hype (and which aren’t); trawled shops in person; enlisted babies (OK, their parents), tweens and teens to test out toys and give us their must-haves; tasted the good, bad and the did-I-really-put-this-in-my-mouth; and rounded up some of the products that were tried and tested by us this year.\n\nSo from hand warmers and hot sauce to Indian whisky and an everything shower, here are the most covetable, joyful, quirky, fun and genuinely useful presents around. Merry Christmas!\n\nStocking fillers\n\nEmbroidery kit\n\nA far cry from your usual twee embroidery, this Charlie Brown mini kit will delight anyone over 50, as well as kids. Designed for beginners, and it’s made in Scotland.\n\nCocktail charms, set of two\n\nUtterly charming and utterly pointless – exactly how Christmas should be. These humorous cocktail charms will elevate your 11am Christmas Day cosmopolitans.\n\nCeramic garlic plate\n\nThis textured ceramic plate makes grating garlic or ginger into a paste a doddle – plus it’s far more attractive (and easier to clean) than a garlic crusher.\n\nRefillable lip balm\n\nAs loved by beauty columnist Sali Hughes. Welsh designer Andrea Garland’s refillable lip balms fit inside unusual vintage and antique pill, snuff and sewing boxes.\n\nPull-up resistance bands\n\nIf they’re an avid gym-goer, these versatile resistance bands can be used for upper-body exercises and will give them a helping hand for achieving a pull-up.\n\nBookmark\n\nWe love the sentiment on this Pause brass bookmark – literally and emotionally. An elegant way to never lose your place.\n\nPlaited phone strap\n\nIf you’re struggling for a present for a young person who loves their phone, or indeed an older person who keeps forgetting where they put their phone (that’ll be us), this Native Union phone strap hits the spot. Made from 100% recycled polyester, it clips to their existing phone case.\n\nGlasses lanyard\n\nKnow someone who’s always losing their specs? This elegant leather lanyard is made from vegetable-tanned leather using offcuts from this east London brand’s handbag production. They can create one in any colour, so pick to suit your giftee. Perfect for sunglasses, too.\n\nMangelwurzel seeds\n\nYes, it looks like an alien, but this viral heirloom vegetable – a cross between sugar beet and beetroot – will certainly get little ones into growing their own.\n\nChilli jam peanut butter\n\nThis collab between Yumello and heritage condiment-maker Tracklements is a grownup’s peanut butter and jam. They’ll be eating this straight out of the jar (speaking from experience).\n\nHair sectioning clips\n\nFor the long-haired people in your life; these robust clips will section hair for styling, and keep it out of faces while washing and applying products.\n\nMini panettone\n\nFortnum’s classic panettone is a tasty mix of fruity, buttery and sweet. This miniature version is perfect for a stocking – it’ll be gone before breakfast.\n\nTyre pressure gauge\n\nFor the responsible car owner in your life: this Michelin bibendum tyre pressure gauge is cute, retro and useful.\n\nNio pre-mixed negroni\n\nNio’s neatly packaged pre-mixed drinks make for a flawless no-fuss cocktail every time. Wrap up their favourite tipple, whether it’s a negroni, margarita or espresso martini.\n\nTravel jewellery case\n\nIn Oliver Bonas’s trademark punchy colours, this travel jewellery case would be even better with a piece of jewellery inside.\n\nRechargeable hand warmers\n\nWinter swimmers, teachers on playground duty, parents of Sunday football kids … Anyone who stands around outside a lot will love these rechargeable hand warmers.\n\nLuxury hand cream bar\n\nMade from 100% natural ingredients, including cocoa butter, beeswax and coconut oil, this leaves winter hands feeling nourished. The storage tin is also pretty cute.\n\nFootball beer mats\n\nInspired by Premier League teams, these creative mats take the names of club legends and reimagine them as beer brands – a cut above usual football merch.\n\nFlamingo claw clip\n\nThe gen Z in your life will adore one of these wild animal claw clips – from a wild horse to a turtle, there are too many to choose from.\n\nAnker Nano portable charger\n\nFor that friend who insists on streaming Netflix at lunchtime and then wonders why their phone dies before they’re home, this dinky 5,000mAh Anker model from our test of the best power banks will save them the horror of a red-battery icon. It doesn’t even need a cable because of its fold-out USB-C connector.\n\nMulti-tool\n\nFrom a bottle opener to a screwdriver, this tool has a stated 11 functions, but you could probably find more uses for it. Perfect for a belt loop.\n\nTony’s Chocolonely gingerbread milk chocolate\n\nA festive Tony’s – complete with a tree-shaped decoration, with a hole for hanging, at the centre of the bar.\n\nBeans socks\n\nFrom the much-loved artist David Shrigley, these bold orange socks are (possibly) a love letter to the humble baked bean, in Shrigley’s trademark naive typeface.\n\nIron-on patch\n\nChannel their inner Bowie with this iron-on patch (other designs are also available) – and encourage a make-do-and-mend mindset, too.\n\nTrinket dish\n\nDon’t we all need more of this in 2025? Perfect for trinkets, keys, jewellery, olives …\n\nFor more interiors inspiration, see our guide to the best home gifts\n\nRope keyring\n\nA cool design, and the carabiner clip means it can be attached to a bag or rucksack. Jess Cartner-Morley-approved, too.\n\nApple AirTag\n\nThis Bluetooth item locater is for the key-loser in your life – attach to theirs and they’ll always be able to locate them. Works for children who have a habit of wandering off, too.\n\nBingo game\n\nKnow your anchor hitch from your reef, or not? Play bingo, learn how to tie some classic knots and support the RNLI.\n\nPaper Pups origami set\n\nNo mess, no walking, no vet bills: is this set of 50 fold-your-own paper dogs actually better than the real thing?\n\nTerry’s Chocolate Orange\n\nNo stocking is complete without an orange. Ideally, you’ll get the kids’ vitamin C in early with a real one, but a Terry’s will go down a treat.\n\nIce cube tray\n\nCocktails like negronis and old fashioneds aren’t complete without a giant ice cube (we don’t make the rules), and with these silicone trays they can have eight ready to go.\n\nPistachio truffles\n\nThere’s lots of chocolate treats out there, but when Lindt combines delicious pistachio paste with its melt-in-the-mouth Lindor truffles, you know they’re going to be a winner.\n\nPickled cornichons\n\nMove over olives, pickles are the new piquant flavour we want in our dirty martinis. Give these fancy Fortnum & Mason cornichons to someone who loves snacking on pickles, and adding their brine to cocktails.\n\nGuinness Nitrosurge\n\nThis gadget, when paired with special Nitrosurge cans, is designed to achieve a gloriously smooth pint of Guinness in the comfort of their own home.\n\nEco ball for dogs\n\nGive your dog something satisfying to chew that doesn’t leave bits of plastic all over the garden (and in their poor tummies) with this strong rope toy, one of our favourite gifts for pets. Handmade in the UK from 100% unbleached cotton, it’s free of glues and dyes and will even help to clean your pup’s teeth and gums.\n\nMeat thermometer\n\nTake the guesswork out of their Sunday roasts with this Heston Blumenthal-branded meat thermometer.\n\nFood\n\nJingleberry jam, 250g\n\nNo, a jingleberry isn’t a thing. This is essentially a festive strawberry jam, handmade in Italy, infused with cinnamon, cloves and nutmeg. We sampled it on toast and can report it’s deliciously aromatic and naturally not-too-sweet.\n\nTajin margarita rimmer, 120g\n\nTake margarita-loving friends’ homemade cocktails up a level with this simple-to-use glass rimmer full of the beloved Mexican seasoning.\n\nThe Crisp Sommelier by Neil Ridley\n\nKnow anyone who doesn’t like drinks and crisps? Nope, us neither. This book is a lighthearted guide to pairing wine, beer and non-alcoholic drinks with crisps.\n\nMilk chocolate Santas, 100g\n\nBored of giving chocolate coins? Handmade in West Sussex, these organic, Fairtrade mini Santas were a hit with our panel of chocoholics, kids and adults both. Not cheap but delicious with no ultra-processed nasties.\n\nLost Explorer mezcal, 70cl\n\nHandcrafted with 100% agave, Lost Explorer mezcal is incredibly smooth with fruity hints and a subtle smokiness – we even enjoyed sipping this neat.\n\nPeppadew chipotle crunch, 120g\n\nThis chipotle crunch chilli oil is the perfect balance of sweet, spicy and smoky. We loved it with eggs, noodles, and tacos …\n\nStill GIN, 70cl\n\nFilter drinks expert Joanne Gould sampled 50 gins – and this bottle from Snoop Dogg and Dr Dre was a surprising winner. Smooth and gentle enough to drink straight up (though, as Joanne writes, presumably the manufacturers would approve of a little juice).\n\nBoustany by Sami Tamimi\n\nThe first solo cookbook from Sami Tamimi, Ottolenghi co-founder and co-author of Jerusalem and Falastin, is full of the colourful, flavour-packed food you’d expect. Every dish is vegetarian, and many are vegan (or easily adaptable) too.\n\nDesi Daru mango vodka, 70cl\n\nThis beautifully presented vodka is a favourite at top London restaurants and makes a fine gift for a cocktail lover. Combining English wheat-based vodka with sumptuously sweet Indian Alphonso mangoes, a shot of it adds a fragrant twist to an Aperol spritz.\n\nGuinness-roasted coffee beans, 227g\n\nGuinness already has coffee notes, so combining the two is a match made in heaven. While roasting the beans, the temperature is briefly increased to 232C (the same used for roasting barley for Guinness), resulting in a pleasantly bitter and smooth coffee with a similar malty taste to Guinness. We tried sipping it as an espresso shot alone and with some cold milk and ice to emulate a nice chilled pint.\n\nPasta scented candle, 250ml\n\nLike walking into a kitchen where someone has just mixed fresh pasta with salted butter. This candle is a fresh take on the gourmand scent trend – perfect for a pasta-obsessed loved one.\n\nHot sauce gift set\n\nSauce Shop’s Original Hot was one of chilli queen Thomasina Miers’s favourite hot sauces when she tested them for the Filter. This set of five adds even more excitement with flavours such as “truffalo” and pineapple habanero, bound to liven up any Christmas leftovers.\n\nChristmas biscuits\n\nStuffed full of an assortment of buttery biscuits, this gorgeous tin is also a musical carousel that spins to the tune of “the Twelve Days of Christmas”, a much more show-stopping gift than your standard packet of biccies.\n\nRococo mint dark chocolate thins\n\nA cut above After Eights, these thins combine 62% dark chocolate with peppermint for a post-Christmas lunch treat that’s just the right amount of bitter and sweet.\n\nRampur double cask whisky, 70cl\n\n“India may not be the first place you think of for whisky,” Joanne wrote in her roundup of the best, “but think of India you should.” Distilled for almost a century, this whisky’s flavour comes from Himalayan groundwater and a rapid ageing process due to the extreme weather.\n\nGinger biscuits, 400g\n\nSweet and spiced ginger biscuits that pair perfectly with a cup of tea. The contents won’t last long, but they can keep the tin for ever.\n\nBocconcini di Fichi, 200g\n\nPlump figs stuffed with almond and candied orange peel and coated in white chocolate – and beautifully packaged. A truly grownup gift.\n\nGinger truffles, 110g\n\nWe’re sure these posh chocolates would look gorgeous on the Christmas tree – but our tester didn’t make it that far, as she scoffed down these decadent, surprisingly punchy truffles in one sitting.\n\nBanoffee pie Irish liqueur\n\nBailey’s too savoury for you? This liqueur is strictly for those with a sweet tooth: with banana and caramel notes, it’s an indulgent gifts. Serve over ice.\n\nCheese Explorer box\n\nFor friends who take dairy seriously, this tasty selection of four cheeses from Pong opts for quality over novelty, including Alex James’s Blue Monday and French sheep’s cheese Perail.\n\nMake your own cheese kit\n\nAnd for friends who take their dairy even more seriously, this kit offers a fun and simple way to dip their toes into soft cheese-making, whether it’s mozzarella, halloumi and paneer. The rennet is vegetarian-friendly, too.\n\nHow I Cook by Ben Lippett\n\nCook Ben Lippett has become known on social media for his approachable but elevated take on home cooking. His debut cookbook is full of food that makes you want to get in the kitchen, whether it’s a tingly Chinese-inspired pork ragu or whisky-and-pepper clam frites. A perfect gift for every skill level.\n\nGerman breweries beer gift set\n\nGift a taste of, er, Germany, with this trio of expert-selected beers, accompanied by a beer snack and a pint glass to drink them all from. Prost!\n\nPasta maker\n\nThe Marcato 150 is an Italian icon and a worthwhile investment for anyone likely to make you fresh pasta in the future.\n\nFortnum’s rose pouchong sparkling tea\n\nThis alcohol-free, black-tea-based fizz with fruity and floral notes feels special enough to raise a toast with.\n\nFor more, read the best non-alcoholic prosecco, champagne and sparkling wines\n\nCaso electric wine cooler\n\nIf they love hosting or just take their wine seriously, this tabletop wine cooler can be set to a specific temperature, ensuring a perfectly chilled glass every time.\n\nSeasoning bundle\n\nThese versatile seasonings will add oomph to their meals. The Popeth Everything bagel-style blend goes perfectly with eggs, toast and stir-fries, while the Pawb herb and spice mix adds smoky depth to roast veg or spag bol.\n\nSmoked chipotle honey\n\nFor a sweet, smoky lift to anything you’re making, whether it’s fresh pasta or plain toast. We love that it comes in a squeezy bottle, so your recipient can feel a bit cheffy.\n\nHand coffee grinder\n\nWhether they’re French press, filter or espresso drinkers, this manual grinder has 48 grinding degrees to achieve the perfect texture. Sleek, stylish and built to last, it would make a great gift for those who enjoy the ritual of making coffee.\n\nSalad dressing bundle\n\nA bundle of All Dressed Up’s most popular dressings, perfect for jazzing up salads, marinating meats or using as a base sauce for rice or noodles. We love using the miso and sesame sauceto marinate chicken for ramen.\n\nAlcoholic cocktail gummies\n\nA box of tasty gin cocktail sweets, all with 5% ABV – meaning these may become their favourite new way to enjoy a tipple.\n\nCitizens of Soil olive oil\n\nOlive oil is the new wine, at least in the world of pressies. A beautifully designed bottle of high-quality extra virgin is at least as expensive as a bottle of vino but longer-lasting and more useful.\n\nBean gift box\n\nWhether they’re a bean-fanatic or not, everyone could benefit from eating more of the protein-rich, high-fibre legumes. This gift box comes with a jar of Bold Bean Co’s baked beans and queen chickpeas (once they try these, they’ll never go back to tins) and a recipe book filled with creative and delicious bean recipes.\n\nBuild your own food gift box\n\nWhen off-the-shelf just don’t won’t do. These hampers allow you to select what your recipient will love most – whether that’s brownies, olives or honey – plus a selection of other accessories, such as socks, scarves and reusable coffee cups.\n\nKids (from 0-100)\n\nBaby suede clogs\n\nRidiculously cute, and with a helpful ankle strap to keep them on newly walking feet, these will keep tiny toes warm this winter.\n\nSensory ribbon ring\n\nA gorgeous, tactile toy for little ones, made from wood and ribbons. Tried and tested on a baby class – and helps with hand-to-eye coordination, too.\n\nBead maze\n\nTots will love having their very own bead maze at home, far from the grabbing hands of their soft play friends. They can let their imaginations run wild as they spin and slide the brightly coloured beads, while parents will appreciate that it’s made from sustainably sourced wood and small enough to take on trips.\n\nFor more ideas, see our guide to the best toys and gifts for newborns and babies\n\nWooden vehicles\n\nOne of the few surviving photos of Filter writer Jane Hoskyn as a baby features her bare bum (no, you’re not seeing it) and a bright green plastic car. She grew up to be a steadfast non-driver, but boy, did she love that car, such is the magic pull of plastic toys. Wean your own kids on to wooden cars with this exquisite construction set, one of the very best sustainable gifts for kids and compatible with wooden tracks, including Brio.\n\nYoto Player\n\nThe Yoto Player “is easily the best toy I’ve ever bought for my children,” wrote our toy tester Zoë Phillimore. Offering lullabies and white noise for babies or books such as Harry Potter, Roald Dahl and Lottie Brooks, it’s a gift that will take years for them to grow out of.\n\nLeapfrog 100 words book\n\nThis interactive electronic book features 100 words to help children develop their language skills in an engaging way. You can switch between English and French, too. A great distraction while you’re on the go.\n\nFor more young kids’ gifts, see our best toys and gifts for one-year-olds\n\nT rex transporter\n\nA T rex that encourages your child to tidy up their cars after them – what’s not to like? It fits more than 20 cars in its belly – our tester’s child is obsessed.\n\nWooden coffee shop\n\nThey can set up their own coffee shop with this cute wooden set. Hipster attire optional.\n\nStoneware bowl\n\nThis robust, stoneware children’s bowl, with a delightful dragonfly print, is 100% more charming than most kids’ tableware.\n\nJellycat egg and soldier plushie\n\nTeen-approved, this egg and soldier Amuseable is guaranteed to delight adults, too.\n\nClothbound books\n\nPuffin’s clothbound editions are collectible modern classics, published to mark Puffin’s 85th anniversary. The collection includes everything from Matilda and The Story of Tracy Beaker to Diary of a Wimpy Kid and Charlotte’s Web.\n\nMagna-Tiles\n\nA great gift if you want “fewer, better-quality toys”, according to childcare expert Laura Moore-Williams, and it allows for hours of varied play. These were a big hit with our play testers.\n\nMarble Rush set\n\nCleverly sticking to any surface, including windows and walls, this marble set is suitable for ages six and up – and is bound to entertain your child for much longer due to the construction possibilities.\n\nLunch bag\n\nThese gorgeous roll-top lunch bags are made from 100% recycled materials (including seven recycled plastic bottles). Make them the envy of their classmates or colleagues.\n\nLego orchid\n\nOne for big kids of all ages. And once it’s complete, it will make an excellent addition to a shelf – and no one needs to remember to water it.\n\nEco litter picker\n\nA beautiful object in its own right, this foldable litter picker (kids and adult sizes available) has a solid grabber and is made in the UK from traceable marine plastic.\n\nGame tablecloth\n\nThis Clothkits classic game tablecloth follows the same pattern as a 70s original, and is still printed in the UK. From snakes and ladders to chess and ludo, it still provides as much entertainment as it did 40 years ago.\n\nCard shuffler\n\nRidiculous, yes – and that’s what we thought too when we first came across this. But after a recent weekend playing Uno with friends, everyone put this on their Christmas list. Surprisingly satisfying, it’s a great present for any regular card game players, and handily eliminates any arguments over bad shuffling. Also genuinely useful for anyone with arthritic fingers and dexterity problems.\n\nImpossible Creatures: The Poisoned King by Katherine Rundell\n\nOfficially a children’s book, but if it’s anything as brilliant as Rundell’s Impossible Creatures, this sequel is one the grownups will be begging to read together at bedtime.\n\nChoose Love coat\n\nBuy the gift of a thick winter coat for a refugee in a displaced community. Give it in your name, or in that of a loved one.\n\nWavelength party game\n\nTwo teams (or just two of you) take turns to guess each other’s answers to clues in this engaging party game. It’ll either lead to arguments when you fail to read your partner’s mind accurately enough, or – more likely – keep the family going when your social batteries are down to their last.\n\nSushi checkers game\n\nA novelty take on a classic game, this game of checkers will set sushi-fanatics’ mouths watering.\n\nFlip 7 card game\n\nSeriously addictive and refreshingly simple to understand, this high-stakes card game is an amped-up version of blackjack and is bound to be a hit with friends and family alike.\n\nSounds Fishy game\n\nA simple concept – trying to fish out the truth from a sea of lies – demands on-the-spot inventions, a la Would I Lie to You, and had our tester’s family all in hysterics. Warning: your mum can always tell when you’re lying.\n\nNintendo Switch 2\n\nA brand new games console has been a hit with teenagers and kids since they came into existence – and the Switch 2 is on more than one grownup Filter writer’s Christmas list.\n\nBackpack\n\nA classic unisex backpack with a flap closure, stylish clasp and interior bottle pocket. Comes in a rainbow of colours.\n\nLego Game Boy\n\nBuild your Game Boy (and your Game Pak), and then you get to play with it afterwards. Stock is already on back order, so make sure to be quick if you want to get this in time for Christmas. (This is 18-plus, supposedly, so one for big kids.)\n\nPastel sherpa blanket\n\nFor sleepover midnight feasts or snuggling on the sofa, this brightly coloured blanket is lined with soft fleece.\n\nPersonalised Cadbury’s chocolate\n\nFor a more special take on Christmas chocolate, personalise a bar.\n\nFujifilm Instax Mini 12\n\nThe Instax is just as much fun as Polaroid cameras always have been, but with better results than back in the 90s. Just try not to acknowledge that, for modern-day teenagers, this is a historical artefact.\n\nFor more inspiration, read the best gifts for 13-year-olds\n\nColorgram puzzle\n\nBased on Archimedes’ 2,000-year-old brain-teaser, this wooden puzzle is harder than it looks. Made from pine wood from sustainably managed forests, the colours are to die for.\n\nEngraved heart charm\n\nThis sterling silver dangle charm can be engraved; perfect for necklaces or bracelets. Ideal for a secondary schooler.\n\nFor more ideas, see our guide to the best Christmas gifts for 11-year-olds – picked by 11-year-olds\n\nHeatless curling ribbon\n\nHair curling is all the rage with tweens this year, and this curling ribbon will let them experiment without causing any lasting damage.\n\nSamsung Fit 3 smartwatch\n\nFor such a budget tracker, the Fit 3 does a good impersonation of a smartwatch – and it’s certainly techy enough for a teen.\n\nSol de Janeiro set\n\nEvery tween and teen we know on the Filter adores this body spray brand. Spritz the Season was handpicked by one of our 11-year-olds, too.\n\nNike Air Force 1 LE\n\nWhile anyone born in the 80s is of course deeply cringe, this iconic trainer of the era has managed to make a comeback.\n\nChameleon board game\n\nCelebrity Traitors withdrawal symptoms? Yep, us too. You could give the board game or the card game, but the Filter’s resident board game expert recommends the OG bluffing game, The Chameleon (she also recommends the Race Across the World game – full of frustrating setbacks, just like the show).\n\nOwala Freesip water bottle\n\nThe bottle of the year: colourful, customisable and voted best overall in the Filter’s test of the best water bottles. Fully worth the gen Z hype.\n\nPhone case\n\nMade from 50% recycled plastic, Otterbox cases are rated by the Guardian’s tech editor, Samuel Gibbs, for the sturdy protection they offer. This fun case will be appreciated by Francophiles of all ages.\n\nHere are some handy tips to help their smartphone last longer, too\n\nPlayStation Classic console\n\nParty like it’s 1995 with this facsimile of the original PlayStation console. It comes preloaded with 20 games, including Grand Theft Auto and Tekken 3 (no Tomb Raider, sadly) and is pretty much plug-and-play, so they can be gaming before Santa has even left the building.\n\nPersonalised baby knit cardigan\n\nThis cardigan with knitted lettering on the back is one of the best items I’ve ever seen on Etsy, and amazing value for a gift a new parent will treasure for ever. You can have any colour and wording you like, and it comes in kids’ sizes up to age 10 – or even an “adult size” (still a bargain at £45). Allow at least two weeks for delivery.\n\nFor more, read our guide to the best gifts for newborns\n\nSnowsky Echo MP3 player\n\nThe best presents are either things the person wanted for ages but could never find, or things they would never have bought in a million years but are completely delighted by. This budget MP3 player is firmly in the latter category – and was our favourite budget option from testing. Sound quality is great, and its Walkman retro charm is pressie-perfect for those who remember (and taps into the retro tech trend for those who haven’t heard of cassettes).\n\nKitchen\n\nDe la Mer side plates\n\nThese hand-painted side plates from &Klevering – a brand known for its playful colour – are perfect for picky bits: for the crockery obsessive in your life.\n\nCeramic lemon juicer\n\nHandmade in Yorkshire, this stoneware lemon juicer is a beautiful object in its own right.\n\nPitcher jug\n\nJonathan Adler’s Le Dinnerware collection is inspired by French bistros, with a good dose of tongue in cheek. This pitcher could double up as a chic vase.\n\nLakeland Only Pan\n\nReminiscent of a certain Instagrammable pan but for less than half the price, Lakeland’s Pfas-free Only Pan is aesthetically pleasing with a super-slippery non-stick surface that performed brilliantly in our tests. The spoon rest on top of the lid is a nice touch, too.\n\nCeramic salad bowl\n\nCasaLatina works directly with artisans across Colombia and Venezuela to sell their handmade products. This salad bowl, hand-painted in Antioquia, Colombia, would make a gorgeous gift for those who love to host.\n\nRecipe notebook\n\nA gift for someone who takes their cheffing seriously, this notebook has space to record 85 recipes as well as blank lists for jotting down everything from dinner thoughts to ingredient ideas.\n\nPizza cutter\n\nThis cutter will make the pizza maker in your life look like a pro – whether they’re cutting homemade Neapolitan margheritas or a Dr Oetker.\n\nMicroplane bamboo grater\n\nAny foodie will love this Microplane grater, which comes with a container to catch their gratings – and a lid to store them. It made light work of our parmesan, garlic, nuts and lemon rind.\n\nSet of six coffee mugs\n\nTreat the coffee drinker in your life to these 70s-style ceramic cups. Too pretty to store away.\n\nG-80 santoku knife\n\nThis gift means business: the Global G-80 santoku knife – Meera Sodha’s go-to – is adept at slicing and dicing whatever they cook, and might even outlast them.\n\nStripe oven mit\n\nPure kitschy joy in oven glove form, from the Brooklyn-based brand Dusen Dusen.\n\nApron\n\nA grownup apron for a grownup chef, complete with checked borders and a cute embroidered shellfish, in Fortnum’s iconic turquoise.\n\nSpoon rest\n\nLe Creuset’s spoon rest is a little luxury that will add a cheerful pop of colour to their kitchen counter. Choose from a range of gorgeous shades.\n\nMicrowave toastie maker\n\nThis genuinely brilliant gadget from Morphy Richards was a surprise favourite from our test of toastie makers. It has metal plates that slot inside a silicone case, so they can “toast” croissants, bagels and sandwiches in their microwave.\n\nChambord cafetière\n\nOur favourite cafetière from testing, Bodum is the benchmark against which all French presses will be judged. They’ll love you for this one.\n\nM&S x Tom Kerridge butcher’s block\n\nThis sturdy wooden chopping board is the perfect replacement for their battered plastic model (and you can buy almost four of these for the same price as Tom Kerridge’s £195 beef wellington).\n\nSardine corkscrew\n\nAdd a touch of whimsy to their evening wine or beer with this fun fish-shaped corkscrew and bottle opener, complete with a tinned sardines storage box.\n\nHario V60 coffee dripper\n\nElevate their morning cup with some barista-style coffee. This ceramic version of the Hario V60 makes for a prettier gift than the plastic original.\n\nPersonalised wooden spoon\n\nMore and more of us are moving away from plastic in the kitchen, and the ability to personalise these wooden spoons makes it a little more heartfelt.\n\nChef’s press\n\nThis ingenious cooking weight presses your food down against the pan, maximising contact and helping achieve a crispier, better sear, whether you’re cooking steak, fish fillets, bacon or even vegetables and toasties.\n\nWhetstone\n\nUsing a whetstone is easier than you might think – and a great way to make your kitchen knives last longer. This affordable double-sided design is a good place to start.\n\nTefal Choppeo food chopper\n\nA thoughtful gift for a time-pressed person – we found it very easy to use. Plus, the sage green is very easy on the eye.\n\nCold brew coffee maker\n\nCold drinks are eminently un-Christmassy (even wine gets the hob treatment), but this stylish bottle will be welcomed by any coffee lover who’s already got the best cafetière and espresso machine. Designed by expert baristas, it makes a far better iced coffee than pouring a hot brew on ice.\n\nNinja Blast portable blender\n\nNinja’s great-looking little blender was one of our favourites from testing. It charges via USB, then slips into a bag or pocket for use on the go. At 450ml it’s big enough to whip up nearly a pint of soup or smoothie at the gym, on a hike or in the kitchen at work – they’ll be the envy of colleagues.\n\nGnocchi paddle\n\nFor a serious chef who has everything, this gnocchi paddle may not be entirely necessary, but isn’t that what gift giving is all about?\n\nCrave salad set\n\nAdd interest to their winter greens with these colour-splashed salad spoons, as recommended in our guide to the best interiors gifts.\n\nPhilips draft beer machine\n\nFor those in the Venn diagram of “loves beer” and “loves gadgets”, Philips’ PerfectDraft machine cools kegs to the perfect temperature for the ultimate pub cosplay.\n\nButter dish\n\nThis striped butter dish will add some sunny colour to their kitchen, even in the depths of winter.\n\nOoni Karu 12 pizza oven\n\nThe ultimate splurge gift for wannabe pizza chefs, this multi-fuel oven from Ooni allows them to experiment cooking with wood, charcoal or straightforward gas.\n\nSmeg Mini milk frother\n\nWe dare you to find a better-looking milk frother than this – and it doesn’t just look good, it produces fabulously frothy hot or cold milk at the touch of a button. We were very impressed with its barista-style cold foam for our iced coffee.\n\nPestle and mortar\n\nNot only will a pestle and mortar make their food – especially curries – taste better (hence why it’s Margot Henderson’s top kitchen gadget), but this beautiful marble design will look great on any kitchen worktop.\n\nMatcha whisk\n\nMatcha connoisseurs swear by the thinner strands (known as tines) on Japanese-made whisks, and this gift set includes a handmade porcelain bowl as well as a whisk holder and teaspoon.\n\nHome\n\nCandles, set of four\n\nThese Hay candles are so pretty that your recipient may never want to burn them. Pair with some on-trend chrome candle holders (£6.99) if you’re feeling generous.\n\nCushion\n\nThe hand-stitched design of this quilted cushion from Toast gives it a cosy feel, tempered by a colour palette that stops it looking twee. The ideal gift for an interiors-loving homebody.\n\nRechargeable light\n\nWe all know the big light is an interior design mood killer, so give the gift of instant cosy vibes with this sleek blue rechargeable lamp from Dusk.\n\nFor more, read our guide to getting cosy\n\nBud vase\n\nThis Jackson Pollock-inspired rainbow-splatter vase with an eco resin base will look beautiful on display, whether or not your recipient has a flower to put in it. Give it to your own best bud.\n\nFor more, see our 15 colourful pick-me-ups to elevate your everyday guide\n\nZodiac dinner plate\n\nIt might be called a dinner plate but, if you ask us, this Maison Flâneur one is far too nice to eat from. This would look beautiful hung on a wall, put on a plate stand or as part of a table centrepiece.\n\nPersonalised bound notebook\n\nYou can’t go wrong with a beautiful, personalised notebook. Papier is a tasteful online source with options to customise by paper type, binding style and cover wording.\n\nBedside carafe\n\nThis duo-tone carafe adds a cheerful pop of colour to a bedside table and ensures your giftee never has to get up in the night for a glass of water.\n\nTea towel/print\n\nFounded by sisters Kemi and Lara, the Cornrow curates fashion and homewares celebrating the Black experience. All the products are worth a browse, but we love this Afromuses Woman linen tea towel (that can double as an art hanging) with a print by Turner prize-winning artist Chris Ofili.\n\nCocktail shaker and glasses\n\nThis gold and green glass cocktail set will take their stash from “collection of half-drunk bottles” into a bougie bar area.\n\nSmiley lamp\n\nFor those nostalgic for 90s happy house, or who just might appreciate a bit of kitsch on their bedside table, this lamp should do the trick.\n\nFor more retro-inspiration, see our best 90s Christmas gifts guide\n\nClip-on reading light\n\nThis is a gamechanger gift for bookworms who love to read in bed but hate getting up to switch off the light or struggle to read with a dim bedside lamp. Their sleeping partners will welcome it just as much.\n\nskip past newsletter promotion Sign up to The Filter Free weekly newsletter Get the best shopping advice from the Filter team straight to your inbox. The Guardian’s journalism is independent. We will earn a commission if you buy something through an affiliate link. Enter your email address Sign up Privacy Notice: Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on theguardian.com to send you this newsletter. You can complete full registration at any time. For more information about how we use your data see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nThrow\n\nMarks & Spencer is particularly good at quietly stylish soft furnishings. This woven cotton throw in lovely faded rust tones will warm up a bed, armchair or sofa.\n\nTour poster\n\nThis print from the 1983 Serious Moonlight tour is peak 80s Bowie. The perfect gift for anyone who has failed to get tickets to the V&A’s David Bowie Centre in London.\n\nTable tennis table\n\nDo they love game time but don’t have the space for a permanent table? This neat design by Decathlon is slim enough to pack away.\n\nCustomisable napkins\n\nGet these linen napkins embroidered with your recipient’s favourite dishes, Christmassy or otherwise.\n\nRoberts Revival Petite 2 digital radio\n\nThis retro-style radio by Roberts is portable, digital and has an alarm function so they can wake up to their favourite station. This sunny colour would also add some much-needed cheer to gloomy mornings.\n\nSee more in our guide to making mornings better\n\nAmber and sandalwood candle\n\nJapanese store Muji is known for its high-quality, reasonably priced home fragrances – and this amber and sandalwood candle was one of our tester’s favourite candles. You can also buy refills. Although pricer gift options, Cornish Sea Salt’s Sea Salt and Smoky Sea Salt candles combine “citrussy bergamot with resinous oud and fir needle” to a relaxing and indulgent effect.\n\nFor more, see our guide to the best scented candles\n\nServing bowl\n\nThis terracotta serving bowl is hand-thrown by Manchester-based Frances Savage, who trained in Stoke-on-Trent and Tuscany.\n\nDartboard and darts set\n\nIf Luke Littler has inspired a newfound passion for darts (or just shouting 180), this budget dart board will be the perfect gift.\n\nLong reads book\n\nRemember MrBeast, the world’s biggest YouTube star? The British Museum revelations? How Emmanuel Macron deals with Donald Trump? This collection of the Guardian Long Reads is the perfect gift for them to curl up with, off screens.\n\nTracey Emin mug\n\nAn exclusive (if not original) Tracey Emin for your mum’s morning coffee.\n\nLumie sunrise alarm\n\nTake the pain out of their morning alarm with this reading light, night light and sunrise alarm clock in one (voted best in our test). The Lumie Spark 100 mimics a 30-minute sunrise by cycling through light colours and brightness levels, while its sunset feature reverses gently back through the cycle to help them fall asleep.\n\nFor more, see our guide to the best sunrise alarm clocks\n\nFootball commentary chart\n\nFor the fan with everything except a win for years, this clever wall art reproduces veteran commentator Clive Tyldesley’s matchday notes for one of hundreds of games from his decades in headphones. Have the chart personalised or framed for an extra few quid.\n\nHalf-and-half double duvet\n\nSlumberdown’s Made For You Two duvet is 10.5 tog on one side and 4.5 tog on the other, so tailor made for a couple that shares everything except a temperature preference while they sleep. A great-value, thoughtful (ever-so-slightly self-serving) gift for your other half.\n\nBobbin photo frame\n\nThis gorgeous wooden photo frame adds an element of design to any space – no matter your recipient’s taste in decor.\n\nGlass lamp and diffuser\n\nThis pretty Habitat lamp works with any diffuser oils to fill the room with a delicious scent and an optional subtle mist. Just be wary of giving this to someone with pets, since – like any electric diffuser – it emits particles that a cat or dog may ingest when they lick their fur.\n\nFleece electric throw\n\nSure, blankets make decent presents … but to really show you care, give them one with a built-in heating system. Our test of the best electric blankets includes all manner of designs, including this cosy sofa hugger from Dunelm that’s ideal for one person and could save them a fortune on heating bills.\n\nCocktail print\n\nWhether they’re a tequila enthusiast or a negroni connoisseur, get them a fun retro-style print of their favourite drink. It will add some joy to their home and show how well you know them.\n\nDaily grind ceramic travel cup\n\nThis cute, handmade ceramic cup will add style to their morning matcha or coffee. We love the built-in hole for sipping, just like a classic to-go cup.\n\nConnex cable adaptor hub\n\nWe all know the inconvenience of having lots of electronics, all with different charging ports: this convenient little hub switches seamlessly between Lightning, micro-USB, USB-C and USB-A, meaning they’ll never need to carry multiple chargers again.\n\nGarden\n\nTool roll\n\nA tasteful and practical way to stash away your kit by the MVPs of beautiful gardening gear, Niwaki.\n\nGardening gloves\n\nDesigned by a former Blue Peter gardener (alas, not Percy Thrower, for those old enough, but rather Clare Cooke), these fabulous faux leather Donkey gloves (colour: international orange) are comfy enough to wear all day. Perfect for a pruning aficionado.\n\nHori hori knife\n\nAs seasoned gardeners will know, a hori hori (or soil knife) is a far better tool than a trowel for weeding, digging and other bed management – and it’ll make your giftee feel like Mick “Crocodile” Dundee. This one by Niwaki comes in a beautiful canvas holster.\n\nWild bird gift set\n\nFor the person in your life who knows a whitethroat from a warbler, this selection of seedy treats is an all-you-can-eat buffet for garden birds – all the more important in the winter months when food is scarce.\n\nNocturnal wildlife camera\n\nWhen the Filter’s Jane Hoskyn got one of these night-sight cameras and watched the first video it recorded, “The sight of foxes and hedgehogs visiting my garden made me wild with joy. If that’s roughly the response you’d like from your loved one, it’ll cost you less than £40 and comes with a 32GB SD card.” Pop in a few AA batteries, so it can be used straight away.\n\nBypass secateurs\n\nSometimes you get a lot more than you pay for: these budget secateurs by Spear & Jackson have a carbon steel blade, making for a durable and smooth cut that your green-fingered loved one will truly appreciate.\n\nFor more, see our guide to the best secateurs\n\nPersonalised gardening tool belt\n\nThis buffalo leather gardening tool belt comes with a beautiful patina thanks to the leather it’s crafted from, which is tough enough to safely house sharp tools but will soften with use. It can also be personalised.\n\nStanley Aerolight travel mug\n\nIt doesn’t spill a drop or let a bead of steam escape, keeps drinks hot for hours, has a lifetime guarantee and comes in a range of subtle shades – plus bright pink, which at least makes it hard to lose. Perfect for the coffee-drinking commuter or allotment holder in your life.\n\nFor more, see our guide to the best travel mugs and reusable coffee cups\n\nZZ plant in pot\n\nWhether you call it a ZZ plant, a fern arum or a Zamioculcas zamiifolia, this east African native is one of the hardest house plants to kill. Its roots store water so it doesn’t need much looking after, and its glossy foliage grows up instead of out, so it’s perfect even in small spaces.\n\nHouseplant monitor\n\n… and if a loved one’s approach to houseplant watering is asking, “Do you think it looks a bit sad?” every so often, they may find this bit of tech handy, eliminating guesswork on light, humidity and soil dryness.\n\nThe New Romantic Garden by Jo Thompson\n\nStar garden designer Jo Thompson’s book – The New Romantic Garden – celebrates her gloriously decadent English garden planting style; the ideal gift for a gardening obsessive to get lost in on winter evenings – and start planning for spring.\n\nMini plant snips and pouch\n\nFor the houseplanter in your life, a set of winningly sharp pruners with a protective pouch in a range of colours.\n\nGalvanised seed organiser\n\nHelp your allotment-keeper stay on schedule with their seed planting – and beautifully, too.\n\nHand garden brush\n\nFrom a patio to a front step, help them keep it all clean with this brush, made from FSC-certified wood.\n\nSharpening tool\n\nGive the gardener in your life the gift of sharp tools – for under a tenner. Perfect for a stocking.\n\nBeauty\n\nCoastal Walks perfume\n\nThis unisex scent, handmade in Norfolk, is refreshingly sharp, with notes of pine, lemon and bergamot. Comes in a handbag-size mini as well as larger sizes. If you’re passing, visit the brand’s exquisite stores in the east of England and central London.\n\nFlat Lay Co makeup bag\n\nThis makeup bag opens up flat to eliminate the need for the endless rummage for a product. Plus the patisserie-inspired pattern will leave you drooling.\n\nThe Inkey List de-puff power duo\n\nThis set pairs the Filter’s favourite budget eye cream with reusable silicone eye patches to maximise its de-puffing power and absorption. The patches come with a storage tin so they can be rinsed and reused.\n\nElizabeth Scarlett turtle conservation eye mask\n\nFilter writer Jane Hoskyn was a late convert to the power of eye masks to help you sleep. “Most are a bit too utilitarian to give at Christmas, but this beautifully embroidered mask with silky blue pouch makes a gorgeous gift,” she says. All sales help fund turtle conservation.\n\nChanel rouge baume\n\nThe lipstick effect is alive and well, with affordable luxuries flying off the shelves as people seek a self-care boost. This hybrid lip balm, gloss and lipstick in classic Chanel packaging slightly stretches the “affordable” part, but it’s guaranteed to spread a little joy.\n\nSelf-grip rollers\n\nGive the gift of massive bouncy hair with these self-grip rollers that do much less damage than other styling tools. Our beauty columnist Sali Hughes notes how young women don’t always bother taking them out before they hit the town.\n\nGisou honey hair mask\n\nGisou’s frizz-vamoosing hair mask is not the cheapest, but our tester Sarah Matthews found it masterful at keeping hair frizz-free, even on muggy, rainy days. Its delicious honey scent and honeypot-shaped tub make it a lovely gift.\n\nMylee nail wraps\n\nGel wraps are the perfect gift for mani-fans who want nice nails without the price tag. Jess Cartner-Morley-approved, Mylee’s flexible stickers come in loads of shapes, patterns and colours, including multicolours.\n\nGlaze Supergloss\n\nGloss is great for maintaining hair colour and shine between salon visits, so it’s one of our favourite at-home beauty treatments. This wonderfully hydrating Glaze gloss comes in 16 colours, is free of ammonia and sulfates and not tested on animals.\n\nSilk’n LED face mask\n\nLED face masks aren’t cheap – this is our favourite budget pick – but you’ll be giving the gift of a winter glow-up. Light therapy can help smooth skin and reduce the appearance of imperfections. The Silk’n is comfy to wear and targets various skin problems.\n\nStriped bathrobe\n\nStepping out of a warm bed into winter’s chilly air is tough without a cosy dressing gown within reach. This soft, absorbent robe is made from sustainably sourced zero-twist cotton and looks gorgeous, right down to the tips of its kimono-inspired sleeves.\n\nCharlotte’s Magic Body Cream\n\nWonderfully refreshing, intensely hydrating and maybe just a little too pricey to buy for yourself, this lightweight body moisturiser from makeup-artist-to-the-stars Charlotte Tilbury is among the Filter’s favourites, containing peptides and other powerful ingredients to help smooth, soothe and plump mature skin.\n\nBaByliss hot brush\n\nThe Air Power Volume styler from BaByliss is kinder to hair than the rotating brushes of old, and much more versatile. This large, oval-shaped hot brush is a Filter favourite from testing, able to quickly dry and style damp hair or give dry hair a new lease of life.\n\nJo Malone ginger biscuit cologne\n\nThe name ginger biscuit is misleading: this cologne is much sexier than that. Hints of ginger, nutmeg, cinnamon and roasted hazelnut add an intense warmth to sweet caramel, tonka bean and vanilla. And we love the bottle.\n\nLush quality treats gift box\n\nThe retro giant sweet tin is undeniably the main appeal here – we’re already planning to refill it with homemade goodies. But the contents also smell and feel delicious, from the Super Milk bath bomb to the gloriously festive-scented Yog Nog shower gel.\n\nNeom oil discovery set\n\nWe love Neom’s oils here at the Filter (RIP Hibernate, which seems to have been discontinued). Treat someone to this set of six 3ml essential oil blends, so they can find their own favourite.\n\nAesop Eleos hand balm\n\nThe newest hand cream from Aesop, this is a gloriously nourishing treat for dry hands – an energising, uncloying scent of cedar, patchouli and clove. Definitely one for all genders.\n\nNeal’s Yard face mask\n\nA good old-fashioned clay mask that always leaves our skin feeling brighter and softer. The scent of white tea is wonderfully rejuvenating.\n\nSilk hair ties\n\nThese mulberry silk hair ties glide through the hair without causing damage. The perfect purchase for those who take their hair care seriously.\n\nTweezerman glass nail file\n\nThis glass nail file comes with a handy travel case and feels much more luxurious than an emery board, plus it will last a lot longer.\n\nGlossier Balm Dotcom\n\nGlossier’s cult lip balm comes in lots of original gourmand scents (the limited-edition ginger snap sounds good enough to eat) and lovely tints to leave the lips looking and feeling nourished.\n\nClomana Beauty brush and sponge soap\n\nThis brush soap comes in the handiest tin with a textured rubber pad in the lid to help you get deep into the brushes. Just wet your brush or sponge, rub it on to the soap, then rinse and repeat.\n\nColor Wow Style on Steroids spray\n\nSince trying this, we refuse to buy any other hairspray; the volume is unmatched and easily achieved.\n\nWetBrush detangler\n\nKnow someone prone to knots? These detanglers are specifically designed to be used on wet hair, when it is at its most fragile.\n\nSuper Healthy Skin body creme\n\nSuper Healthy Skin body scrub\n\n“I buy this body scrub and body moisturiser for everyone (my mum asks for them for Christmas every year),” writes Guardian writer Kate Lloyd. “They’re luxurious, smell like a spa and aren’t as expensive as they feel.”\n\nEverything Shower set\n\nChange their “everything showers” from a regimented routine to a self-care moment. This set contains everything they need to step out of the shower feeling relaxed – and squeaky clean.\n\nSukin shower gel\n\nAn all-time favourite shower gel here: affordable, smells nice, paraben-free and good for sensitive skin. It feels much more indulgent than it costs.\n\nSerum concentrate sheet mask\n\nThe festival-goers at the Filter highly rate these Body Shop masks for that much-needed day-three lift.\n\nStill Bobbi memoir by Bobbi Brown\n\n“The US makeup artist on how she took on the beauty industry not once but twice and smashed it,” writes Sali Hughes.\n\nGrooming\n\nUndereye gel patches\n\nLate nights are a given during the festive season. Buff’s undereye gel patches are infused with charcoal, glycerin and carrageenan to combat puffiness and dark circles.\n\nRich face moisturiser\n\nHorace is known for skincare that’s budget-friendly and effective. This moisturiser is a winter saviour because of its rich formula, which is supercharged with shea butter, plum seed oil and sugar-derived humectants.\n\nVibrant Leather eau de parfum\n\nZara is the No 1 spot for an affordable fragrance. Some of its blends are reminiscent of the most popular men’s perfumes: Vibrant Leather smells similar to Creed’s £310 Aventus. It may not have the same staying power but, being 92% cheaper, it’s a great alternative.\n\nBody wash\n\nA fancy body wash is something you rarely buy yourself, so it’s perfect for any man in your life. Salt & Stone has five blends to choose from, but Santal & Vetiver is our top choice.\n\nSqualane cleanser\n\nIf your man isn’t a skincare fan, start him on a great, simple cleanser. The Ordinary’s squalane formula is designed for daily use on all skin types.\n\nAesop cedar and citrus lip salve\n\nNow we’re in chapped lips season, a quality balm is always well received. Aesop, as ever, has just the product: a gel-like formula that’s powered by grapefruit rind, cedar atlas and orange rind to soothe and soften.\n\nFor more, read our guide to the best lip balms\n\nPhilips OneBlade limited edition gift pack\n\nThere’s a lot to love about Philips’ OneBlade. It has a five-in-one adjustable comb designed to work on everything from long hair to stubble. They can use it wet or dry. They can shave in both directions thanks to the two-sided blade, and it comes with a travel case. The best part? You get all of that for less than £25.\n\nToiletry bag\n\nNow he’s got the toiletries, he’ll need the bag to match. Arket is great for these: this is made from a durable nylon canvas and has multiple pockets for extra organisation.\n\nMalin+Goetz bestsellers travel kit\n\nA stash of travel-size products is perfect for a frequent traveller – especially when they’re by Malin+Goetz, the NYC-based brand that is renowned for its gentle formulas designed for all skin types.\n\nBob the shower pack\n\nThis eco-conscious shower set includes two Bob bars – refillable solid body wash, a bit like soap – plus an exfoliating applicator and wall mount. Choose from various Bob bar varieties, such as the Gentleman, which is free from cosmetic fragrance allergens and the aromatic Evening Man.\n\nLe Labo beard oil\n\nThis much-loved NYC brand isn’t cheap, but it’s a gift guaranteed to be cherished. With sunflower, jojoba and grapeseed, as well as lavender, bergamot and more, this oil is designed to be nourishing and fragrant.\n\nSpotlight electric toothbrush\n\nElectric toothbrushes are the kindest of gifts. The Spotlight Sonic Pro is a minimalist stunner, and it was rated the best toothbrush in our tests.\n\nNatural deodorant\n\nNot the most subtle gift, but natural formulas tend to have fragrance as a higher priority – so think of this as an affordable scent. Patricks ND1 smells more like Tom Ford Neroli Portofino than the kind of spray you’d usually smell in a locker room.\n\nNivea Men anti-age serum\n\nSkincare that targets multiple concerns is a great buy. Enter Nivea’s Anti-Age Power Serum, which is enriched with hyaluronic acid and the skincare expert’s patented Luminous630 technology to target wrinkles and dark spots while brightening skin and adding moisture.\n\nWomen’s fashion\n\nStriped scarf\n\nClosed Loop Initiative is John Lewis’s circular fashion programme. This striped scarf in claret and butter yellow uses 100% recycled wool spun in the UK.\n\nRainbow star earrings\n\nBijoux de Mimi, a gen Z favourite, offers stylish, affordable, high-quality jewellery. This pair is a great gift for someone who loves to accessorise with colour.\n\nGold-plated necklace\n\nCrafted with 95% recycled materials and a waterproof finish, this necklace by Danish brand Pilgrim features a nature-inspired crystal pendant set in your choice of gold or silver. A thoughtful and sustainable gift.\n\nJungle was massive jumper\n\nWhile jungle music will never die, sadly the same can’t be said for our rainforests. This jumper from BBC Earth is certified organic cotton, and can be sent back if it wears out for the fabric to be reused.\n\nWishbone bangle\n\nHandmade in resin by Aussie brand Dinosaur Designs, this bangle comes in every colour under the sun and offers a choice of narrow, regular or wide fit.\n\nSocks\n\nGiving socks? Make them exciting: this playful polka-dot set from Damson Madder is anything but boring.\n\nStriped shoulder bag\n\nMade from recycled nylon, this shoulder bag is strong, stylish and zipped for extra security, featuring a handy inner pocket to keep your essentials in place.\n\nKnit your own bonnet\n\nGot a crafter in the family? Wool and the Gang have a great range of knitting and crochet sets. In this Damson Madder collab, you can create your own bonnet – windproof ties included.\n\nBespoke cap\n\nPick the colour, the thread and the words. With witty slogan tees having a comeback, personalised caps were surely next.\n\nBurgundy jumper\n\nOmnes, a London label championing circular and sustainable fashion, uses biodegradable, recycled or existing materials. This timeless burgundy knit is in the colour of the season.\n\nMother of pearl necklace\n\nWanderlust Life is a female-owned and B Corp-certified jewellery brand that creates simple, elegant and sustainable pieces. This choker, made from mother of pearl beads, is perfect for layering and can be personalised with a letter pendant for an extra £10.\n\nFamily birthstone ring\n\nGive your mum a ring embedded with the birthstones of all her grandchildren, and there won’t be a dry eye in the house. These slim rings are handmade from sterling silver with gold and rose gold colour options and teardrop gemstones, and they come in gift boxes to save you time on wrapping.\n\nFor more, check out our guide to the best thoughtful ideas for £50 and under that mums will love\n\nOvernight holdall\n\nKnow anyone who’d love to be stopped by complete strangers complimenting their baggage? That’s the effect this handsome holdall had when Jess Cartner-Morley gave it a whirl, but head-turning looks aren’t all it’s got to offer – it’s also an eco-friendly choice, made from 100% recycled polyester.\n\nDuckhead umbrella\n\nA bona fide design classic, built to last and far better looking than any budget brolly (in highly festive red). The Filter’s deputy editor, Monica Horridge, has had a Duckhead for two decades, having received it as a present from someone with outstanding foresight.\n\nFor more inspiration on forever presents, see our guide to the best thoughtful gifts that last\n\nPuffy shoulder bag\n\nUniqlo rivals Hermès in the cult bag world, but will devour significantly less of your Christmas present budget. This sizeable slouchy bag has two pockets each on the outside and inside, and comes in four handsome colours, including a gorgeous burgundy.\n\nFor more autumnal fashion ideas, check out our guide to the best women’s wardrobe updates\n\nSlippers\n\nPremium slippers that look fabulous, feel warm and don’t fall off your feet every time you try to move are the Christmas present every adult truly desires. With 90% recycled uppers and a 100% recycled footbed, these Hush Puppies won’t just upgrade their loungewear game, they’ll also minimise the carbon footprint of your gift giving.\n\nRolltop rucksack\n\nAdd some joy to the cold, dark mornings for the commuter in your life. This rolltop work bag is weatherproof, insanely comfortable, big enough to fit a laptop (and much more besides) and looks the business. Stubble & Co has added a few new colours to the collection.\n\nSweater stone\n\nA sweater stone – come again? This looks like a bar of soap, is made from recycled glass, and removes bobbles from jumpers just as well as electric fabric shavers. It’s safe to use on merino wool and cashmere, and will add years of life to favourite cardies.\n\nLeopard print pyjama top\n\nLeopard print pyjama bottoms\n\nA knockout pair of PJs will always win you points in the gift-giving stakes. This animal-print cotton poplin set is breathable, kind to skin and durable.\n\nFor more, see our guide to the best women’s PJs\n\nWrist warmers\n\nChannel Cameron Diaz in The Holiday with these 100% wool cream wrist warmers. Complete with a charcoal trim and stylish ribbing, these reached way past our wrists to keep our forearms toasty, too.\n\nEco mesh knickers\n\nEco-mesh bra\n\nUsing 85% recycled lace, Stripe & Stare’s Eco Lace range is as sustainable as it is sexy. We love the Brazilian knicker and triangle bra in alpine green for a set that’s classy, pretty and, most importantly, comfy.\n\nButter studs\n\nA full-fat treat for the ears. If they always have five sticks of butter in the fridge just in case they run out – or is that just us? – these cute gold studs are for them.\n\nHeattech socks\n\nUniqlo’s Heattech socks are a firm Filter favourite. This cute cable-knit pair is just the right side of festive.\n\nMarie Antoinette stylebook\n\nThis is the fashion show of the year – a fascinating look at the last French queen’s frocks and jewels, and her influence on fashion and culture to this day. This coffee table book is perfect for history and fashion buffs alike.\n\nCorduroy glasses case\n\n“Nice versions of the things you handle all the time – glasses case, keyring, wallet – are life’s real luxury,” says Jess Cartner-Morley. “This glasses case from Oliver Bonas is delightful.”\n\nMen’s fashion\n\nCord cap\n\nLike a woolly hat, a corduroy baseball cap keeps you warm in winter, but also works double duty in summer to protect you from the sun. Opt for Barbour’s dark brown design to score top country-core points.\n\nMerino socks\n\nMerino socks just make sense. Soft, antibacterial – meaning they resist odours – and temperature-regulating, they keep you warm while it’s cold and vice versa. Pairs’ pack of four even comes in a Christmas-gift-friendly box.\n\nGuinness T-shirt\n\nFrom #SplittingTheG on TikTok to the Netflix show House of Guinness and Percival’s collab with the brewery, Guinness has gone viral. So, if you know a fan of the Irish stout, now’s your chance to get them a T-shirt that says so.\n\nMule slippers\n\nWhen you’re shopping for slippers, avoid the old-fashioned silhouette and go for a Birkenstock-coded mule instead. The brand’s slippers would cost you about £100, but Autograph’s suede-shearling design is a great budget-friendly take.\n\nMerino crew-neck jumper\n\nKnitwear is best done classic – timeless silhouettes and natural fabrics. Uniqlo has a great selection, including this pure merino-wool crew neck. And if you really want to treat him, you can go for cashmere (£89.90) instead.\n\nFor more, see our guide to men’s knitwear\n\nLow-rise trunks\n\nNew underwear is always a winning gift on Christmas Day – and nowhere has a better selection than CK. They’re sold at most department stores, but Amazon tends to have the most competitive RRP for multipacks.\n\nElephant print pyjamas\n\nChelsea Peers is the brand to know for festive-season PJs. It has sets in all shapes and sizes, but our top pick for a gift is this After Hours Elephant print T-shirt with checkered trousers.\n\nCrop flannel shirt\n\nChecks are trending in the menswear world, and they’re almost impossible to get wrong as a gift. Topman’s is a strong choice with its soft, brushed fabric and modern, slightly cropped fit.\n\nWatch\n\nWatches are getting smaller – just look at the timepieces Paul Mescal and Joseph Quinn are wearing on the red carpet. Theirs are by Cartier, but luckily, Sekonda does a great dupe for a fraction of the price.\n\nLamb’s wool scarf\n\nHow could anyone be disappointed with a scarf? It’s warm. It’s one-size-fits-all. It’s good for a festive fit, and for £10 extra, you can even get this one monogrammed for them. Scottish knitwear pro Kiltane has a great lamb’s wool selection.\n\nLeather bi-fold cardholder\n\nIf you know any men who still carry a bulky wallet, it’s time to give them an upgrade. This sleek leather cardholder by Reiss has eight slots and a smart suede lining.\n\nClassic hoodie\n\nJanuary and February are the best months for hunkering down in a hoodie, so Christmas is the time to receive one. Weekday is the high-street store for a plain design that’s made well for a good price.\n\nGarment steamer\n\nLeft-field, but think of this as the gift of not-having-to-do-the-ironing. A steamer is an easier way of loosening wrinkles and helps to kill bacteria at the same time. The Philips Series 3000 is foldable, so it’s great for travelling, and only takes 30 seconds to heat up. Perfect for a time- and space-pressed friend.\n\nReversible belt\n\nWhen it comes to belts, it’s always good to have one in black leather and one in brown. With Levi’s reversible design, they get two in one – and the metal hardware takes the look up a notch.\n\nColour-block cotton-canvas tote\n\nWho doesn’t love a colourful tote? Whether he uses it for the food shop or a weekend away, it’ll bring him joy. Hay has a few colour combos to choose from, but the brown-navy-red takes first place.\n\nFingerless gloves\n\nEveryone needs a good pair of gloves to hand (sorry …) when winter hits. What we love about this fingerless option is that they won’t limit dexterity while keeping in the warmth – and the green stripe is a nice festive touch.\n\nMicro-stripe silk tie\n\nA great tie is a thoughtful gift for anyone who gets dressed up on the regular. Vintage is best, but Percival’s micro stripe tie is a great choice.\n\nFor more, see Peter’s guide to the best ties\n\nFitness, outdoor and wellness\n\nMarathon runner candle\n\nIf they’ve gone to the trouble of running a marathon, they deserve something to make them smile. Lots of other witty/rude designs available.\n\nAdjustable dumbbell kit\n\nThis versatile, space-saving fitness hack makes a great gift for anyone wishing to add strength training to their routine without forking out for a gym membership – or indeed leaving the house at all. Decathlon’s 20kg set comes in a storage case and contains two threaded bars with 12 plates made from 72% recycled iron.\n\nFor more fitness kit, see our guide to budget-friendly fitness hacks\n\nYeti Rambler bottle, 532ml\n\nFor an extra £8, Yeti will add a custom design or lettering to this powder-coated stainless steel drinking bottle, which now comes in additional seasonal colours, including moon dust and cape taupe. As well as looking great, its double-wall vacuum insulation keeps hot drinks hot and cold drinks cold until the last sip.\n\nTowelling robe\n\nFor what’s basically a towelling sheet with a hood, Finisterre’s Clearwater cotton changing robe manages to be chic and useful for anyone who needs to dry off quickly, whether they’re into wild swimming or just want to step out of the shower without freezing.\n\nWellies\n\nOur winters are getting wetter. Keep feet dry with a pair of ankle-length wellies – perfect for a city walk as well as a country stomp.\n\nFor more, read our guide on how to look good in wet weather\n\nLeggings\n\nFor the pilates enthusiast, these high-waisted leggings from Fabletics are soft, warm, size-inclusive and made from 71% recycled materials.\n\nFor more, read our pilates essentials\n\nWomen’s Berghaus reversible jacket\n\nA splurge, but show you really love her with this reversible jacket: high-pile fleece on one side and a water-resistant material on the other.\n\nMen’s Rapha Commuter jacket\n\n“No single garment is as vital for winter riding as a jacket,” as regular cyclist Simon Usborne wrote in our guide to winter cycling essentials. This version from Rapha will keep your favourite cyclist dry.\n\nWeighted eye pillow\n\nThe gentle weight of Yogipod’s eye pillow is intended to relax you by stimulating the vagus nerve. Perfect for those in need of winding down before sleep or to use when meditating.\n\nUnisex walking socks\n\nWhether they’re an avid hiker or just enjoy the occasional long walk, these merino wool socks, made in the UK, will keep their feet warm but not sweaty. Double win.\n\nDog lead\n\nA dog – officially a great form of exercise. Make walks more appealing with this durable lead: the two-tone designs have a comfy fleece-lined handle.\n\nFor more, read our guide to the best gifts for pets\n\nFlask\n\nFor outdoorsy couples, this sturdy, one-litre insulated Black+Blum flask – for hot and cold drinks – has a neat grab handle and two cups so its contents can be shared.\n\nSleep spray and candle kit\n\nWhen testing sleep remedies for the Filter, writer Jane Hoskyn rated this spray. This set pairs it with a lavender and camomile candle for extra wind-down vibes.\n\nAcupressure mat\n\nNo, it’s not a bed of nails. Stressed or achy friends and family will thank you for this linen and coconut acupressure mat. Best used for 20 minutes a day.\n\nFor more, read our guide to the best self-care gifts\n\nOS Maps subscription\n\nPhysical maps are all very well, but in the wind and rain, an Ordnance Survey (m)app will be sturdier. Phone signal and full battery not included, of course, but maps and routes can be downloaded in advance and used offline.\n\nFor more ideas, see our gift guide for runners\n\nWrist weights\n\nA gentle-but-effective way to boost not just your home workouts but any task: emptying the dishwasher, cleaning windows, washing the car …\n\nHot-water bottle\n\nThis cheerful-looking mustard-coloured waffle hot-water bottle is the winner of our upcoming test, taking well over an hour to drop even 1C.\n\nSealskinz beanie\n\nKeep them warm, dry and stylish in January’s dreck with this textured rib-knit beanie hat that combines a microfleece lining with a special “Aquasealz” material and actual Teflon to be breathable, insulating and waterproof all at once. For extra Christmas points, find them their perfect combination from three sizes and five colours, including olive green and a lovely mustard yellow.\n\nYoga bolster\n\nA bolster makes a wonderful gift for a yoga fan, but it’s a bit like buying someone a pillow – how firm will they want it? That’s no problem here because the buckwheat filling in this Yogamatters bolster can be adjusted until the firmness is just right. With a removable cover made from 100% organic cotton and compostable packaging, this is a genuinely eco-friendly pressie.\n\nBike bell\n\nStylish, universal (it wraps around any handlebar) and, according to our expert, is a more muted bell so less likely to startle pedestrians as you approach.\n\nFor more, see our guide to cycling safety essentials\n\nHeated cycling gloves\n\nAny cyclist whose hands run cold will have tried, at least once, to layer so many gloves that they look ready for a boxing match rather than a ride. And their fingers still freeze. Treat them to these waterproof heated gloves with an integrated element, adjustable heating levels and a rechargeable battery. Snow sports fans will love them, too.\n\nMusicozy sleep headphones\n\nPerfect as a non-slip headband for sweaty workouts, as well as doubling as an eye mask in bed (while listening to something sleep-inducing). A favourite from Filter testing this year.\n\nFor more, see our sleep aids guide\n\nCycling socks\n\nEvery adult wants socks for Christmas, and every cyclist wants Maap socks whose fluoro branding “is sure to get nods of approval at the traffic lights”, as Charlie Allenby wrote in our guide to the best cycling essentials. These cleverly designed socks have padded toes and ventilated tops and sides to keep their wearer’s feet fresh for miles.\n\nCamping hammock\n\nHammocks are a camping must-have, and this one looks so good they’ll want to string it across their garden between trips away. Of the 17 colourful designs, my favourites are the classy teal and the vivid purple and orange, but the giant stars and stripes may hit the spot for some.\n\nBialetti Express coffee maker\n\nA small coffee maker like this is the perfect treat to get a regular camper out of their tent in the morning – and is pretty enough to live on a kitchen worktop, too.\n\nWaterproof phone pouch\n\nWill suit outdoor swimmers, surfers or anyone out in the rain.\n\nFor more ideas, see our guide to the best Christmas gifts for swimmers\n\nLelo massage oil candle\n\nThis black pepper and pomegranate candle doubles as a heated massage oil. Light the candle to set the mood, blow it out once it’s burned for a couple of minutes, then let the oil cool slightly before using it. A great gift for a partner from whom you’re hoping for a festive body rub.\n\nReflective running jacket\n\nHand-picked by runner Jo Harley, in our gift guide for runners, this hi-vis jacket will keep the runner in your life visible.\n\nEndurance Peak 3 running headphones\n\nFor anyone itching to get back on the trails the moment their figgy pudding’s gone down, these comfortable, lightweight JBL earbuds will power even their longest, rainiest runs with rich bass, IP68 waterproof rating and a marathon-ready 10 hours of playback time in the buds alone.\n\nIllustrations by Sandra Navarro",
  "summary": "<p>We’ve tasted, sniffed and inspected more than 300 presents to bring you our ultimate Christmas gift guide – from must-have Lego and smoky mezcal to Meera Sodha’s favourite knife</p><p>Don’t you just love Christmas shopping? There’s a massive thrill in finding a present you know they’ll love and won’t have thought to ask for, but the pressure is enough to drive any sane person to hibernation.</p><p>We’ve gone the extra (2,000) miles to help you find the perfect gifts: we’ve tested out the latest products to see which ones are worth the hype (and which aren’t); trawled shops in person; enlisted babies (OK, their parents), tweens and teens to test out toys and give us their must-haves; tasted the good, bad and the did-I-really-put-this-in-my-mouth; and rounded up some of the products that were tried and tested by us this year.</p> <a href=\"https://www.theguardian.com/thefilter/2025/nov/15/best-christmas-gifts-ideas-filter-uk-2025\">Continue reading...</a>",
  "published": "Sat, 15 Nov 2025 06:00:09 GMT",
  "url": "https://www.theguardian.com/thefilter/2025/nov/15/best-christmas-gifts-ideas-filter-uk-2025",
  "source": "The Guardian"
}