{
  "title": "Keir Starmer defends trip to South Africa for G20 summit as budget looms",
  "text": "Keir Starmer has defended his decision to travel to South Africa for the G20 summit days before the budget and despite the planned absence of Donald Trump.\n\nThe prime minister will arrive in South Africa on Friday morning for two days of summit discussions and bilateral talks on topics including sustainability and economic growth.\n\nBut with his chancellor putting the final touches on a potentially controversial budget and Trump having said he has decided to stay away, No 10 insisted on Thursday that the prime minister’s latest foreign trip would be good value for British taxpayers.\n\nOn the way to Johannesburg, Starmer said: “If you want to deal with the cost of living and make people better off with good, secure jobs, investment from G20 partners and allies is really important.\n\n“Those discussions from those relations … are measured in real jobs back in the UK that are really important when the economy and the cost of living is the most important thing.”\n\nThe prime minister will attend a business event on Friday before going to the main summit on Saturday. But while he will host bilateral meetings with world leaders, he will not be able to meet Trump, who has said he is not attending after accusing South Africa of racially discriminating against the minority white Afrikaner community.\n\nSouth Africa has responded by accusing the US of “coercion by absentia”.\n\nCyril Ramaphosa, the South African president, told the B20 business summit on Thursday: “We are sovereign countries. And we need to be treated as equals.\n\n“Our sovereignty needs to be respected. We need to sit around the table as equals and having the same share of knowledge, the same share of capability, without any bullying the other.”\n\nAsked about Trump, Starmer said: “Obviously President Trump set out his position. I think it’s really important to be there and talk to other partners and allies so we can get on with the discussions around global issues that have to be addressed.”\n\nRussia’s Vladimir Putin and China’s Xi Jinping will also be absent from the summit.\n\nWhile South Africa and Russia maintain close ties, Putin is wanted by the international criminal court, to which South Africa is a signatory. Xi has skipped many international gatherings this year, delegating attendance at the Brics and Asean summits to China’s premier, Li Qiang.\n\nskip past newsletter promotion Sign up to First Edition Free daily newsletter Our morning email breaks down the key stories of the day, telling you what’s happening and why it matters Enter your email address Sign up Privacy Notice: Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on theguardian.com to send you this newsletter. You can complete full registration at any time. For more information about how we use your data see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nBritish officials say Starmer will also spend part of the trip trying to shore up support for Ukraine, as Trump draws up a peace plan that would force it to give up weapons and territory.\n\nThe prime minister was briefed on the outline of the plan when he met the German chancellor, Friedrich Merz, and the French president, Emmanuel Macron, for dinner in Berlin this week. They will have a chance to exchange further notes when they meet the Italian prime minister, Giorgia Meloni, and the Turkish president, Recep Tayyip Erdoğan, on the sidelines of this weekend’s summit.\n\nWhile Starmer works the international diplomatic circuit, his chancellor, Rachel Reeves, is finalising a budget likely to include billions of pounds in tax rises, including a freeze on income tax thresholds. The prime minister and the chancellor decided last week to abandon a plan to raise income tax rates, leaving Reeves looking at other ways to raise about £20bn extra in tax revenue.\n\nStarmer said: “Obviously the details of the budget will come on Wednesday. It’ll be a Labour budget with Labour values. It’ll be based on fairness.\n\n“We have to see this in the context of 16, 17 years now where we’ve had the crash in 2008, followed by austerity, followed by a not very good Brexit deal, followed by Covid, followed by Ukraine, and that’s why we have to take the decision to get this back on track.\n\n“I’m optimistic about the future. I do think if we get this right our country has a great future.”",
  "summary": "<p>PM says he aims to secure investment to help deal with cost of living and shore up support for Ukraine</p><p>Keir Starmer has defended his decision to travel to South Africa for the G20 summit days before the budget and despite the planned absence of Donald Trump.</p><p>The prime minister will arrive in South Africa on Friday morning for two days of summit discussions and bilateral talks on topics including sustainability and economic growth.</p> <a href=\"https://www.theguardian.com/politics/2025/nov/20/keir-starmer-defends-south-africa-g20-budget\">Continue reading...</a>",
  "published": "Thu, 20 Nov 2025 22:00:52 GMT",
  "url": "https://www.theguardian.com/politics/2025/nov/20/keir-starmer-defends-south-africa-g20-budget",
  "source": "The Guardian"
}