{
  "title": "Expert picks, best bets: How Tsarukyan can reenter title contention",
  "text": "Open Extended Reactions\n\nLightweight contenders Arman Tsarukyan and Dan Hooker will square off in the main event of UFC Fight Night at ABHA Arena in Doha, Qatar, on Saturday (1 p.m. ET on ESPN+, with prelims at 10 a.m. on ESPN+).\n\nTsarukyan is making his first Octagon appearance of the year after an injury forced him to withdraw from a title shot at UFC 311 in January. He has won each of his past four fights. Hooker also comes into the fight with some momentum, riding a three-fight winning streak. Neither fighter is in ESPN's divisional rankings.\n\nIn the co-main event, former welterweight champion Belal Muhammad looks to get back in title contention as he takes on rising contender Ian Machado Garry. Muhammad lost the belt to Jack Della Maddalena at UFC 315 in May. Garry picked up a unanimous decision win over fan favorite Carlos Prates in his last fight at a UFC Fight Night in April. Muhammad is ESPN's No. 3-ranked welterweight, and Garry is No. 5.\n\nMMA analysts and commentators provide their predictions for the main and co-main events, and ESPN betting expert Ian Parker adds insight on the value bets available on the card.\n\nLightweight main event\n\nExpert Pick Method Anthony Smith\n\nESPN MMA analyst\n\nTsarukyan Decision Din Thomas\n\nMMA coach\n\nTsarukyan Decision\n\nI'm not sure that Hooker can stop Tsarukyan's takedowns. Tsarukyan will be the better grappler out there, but if Hooker can defend the takedown attempts, he will beat Tsarukyan, just like he beat Mateusz Gamrot. Gamrot beat Tsarukyan -- but MMA math doesn't work. I expect Tsarukyan to work to dominant positions on the ground better than Gamrot did and win by decision. -- Anthony Smith\n\nTsarukyan is going to get a hold of Hooker, frustrate him and win by decision. Hooker is probably game enough not to get finished, but Tsarukyan will stay on him the entire time. Out of a 25-minute fight, I believe Hooker will get controlled on the mat for at least 18 minutes. -- Din Thomas\n\nBetting analysis\n\nThis looks good! Here's the BET link from Sach: Odds current as of Nov. 20. For more, see ESPN BET\n\nParker: Tsarukyan to win inside the distance. Tsarukyan is a near 5-to-1 betting favorite. Don't be surprised if he wins inside the distance here. While Hooker is extremely tough and durable, Tsarukyan has knockout power to go with his elite wrestling. I don't think Hooker will be able to hang for five rounds. Look for Tsarukyan to take Hooker down and get the fight done there.\n\nWelterweight co-main event\n\nExpert Pick Method Anthony Smith\n\nESPN MMA analyst\n\nMachado Garry Decision Din Thomas\n\nMMA coach\n\nMuhammad Decision\n\nI'm leaning toward Machado Garry here. Della Maddalena wrote the book on how to deal with Belal. Now, if Belal can get on the inside and take Machado Garry down, he can win this fight. But some of Belal's wins aren't aging very well. We were all super impressed when he beat Leon Edwards and Sean Brady, but those two just lost by knockout. And he lost to Della Maddalena, who was the new guy in the division. -- Anthony Smith\n\nIt's a tough one, but I'm going with Belal because of his work ethic and determination. I think he grinds Machado Garry out by getting close to him and avoiding taking big shots. He'll struggle to do it at times, but when he does get to the inside, he'll control him and win a decision. I think Belal will win two of the three rounds. -- Din Thomas\n\nBetting analysis\n\nParker: Muhammad to win (+220). This fight will come down to whether or not Muhammad can get the fight to the ground. I expect Muhammad's wrestling and pace to get Machado Garry down and win at least two of the three rounds. When fighting off his back, Machado Garry doesn't offer submission threats to Muhammad. If you want to take a safer route, consider taking the fight goes the distance and putting it in your parlay.\n\nParker's best bets on the rest of the card\n\nMenifield to win (+190). At almost a 2-1 underdog, I'm taking Menifield to get the upset. The fight would ideally stay on the feet and Menifield carries the heavier punches. Menifield has won his past two fights by decision which shows an evolution to his cardio and ability to win later rounds while Oezdemir has shown a decline in cardio in recent fights. If it gets past the first round, this goes in Menifield's favor.\n\nTopuria to win (-125). Almakhan is coming off a first-round KO over Brad Katona, while Topuria, the brother of lightweight champion Ilia Topuria, recently won in his UFC debut. I like Topuria here because he has more ways to win. If Almakhan doesn't take the first round, expect Topuria to use his boxing to close the distance and wrestle his way to victory.",
  "summary": "MMA experts give their predictions for a UFC Fight Night from Doha, Qatar, headlined by lightweight contenders Arman Tsarukyan and Dan Hooker.",
  "published": "Thu, 20 Nov 2025 10:01:30 EST",
  "url": "https://www.espn.com/mma/story/_/id/47024305/ufc-fight-night-expert-picks-best-bets-arman-tsarukyan-vs-dan-hooker",
  "source": "www.espn.com - TOP"
}