{
  "title": "'It felt like God's hand on my brain' - the day England were humbled by teenager",
  "text": "Agar could have been stumped on six off Swann, but got the benefit of a hairline decision.\n\n\"It felt pretty out and I was lucky I got my foot down just in time,\" he says. \"It could have gone either way.\"\n\nWhat followed was some of the most astonishing, elegant and clean ball-striking you could see from any Test batter, let alone a 19-year-old number 11 on debut.\n\n\"At the start Phil Hughes was taking more of the strike, then Boof [Lehmann] ran out a message for him to back me,\" recalls Agar.\n\n\"Every single ball I was on strike he would come down and say 'next ball, next ball, next ball'. He was even stronger on that the more runs I hit. It was a real lesson in how to stay present.\n\n\"Kevin Pietersen gave me a mouthful. I can't remember what he said, but I laughed at him. I was 19 and he was an experienced player trying to intimidate me. It didn't matter. I was out there batting 11, just trying to have a crack.\n\n\"Anderson and Stuart Broad had a word, there were chirps from Matthew Prior behind the stumps. They were into me, but never abusive. It was meant to make it uncomfortable, which is exactly what you should do to a 19-year-old out there for the first time.\"\n\nAnderson was driven back down the ground for four. Finn dropped short and was pulled through the leg side. Swann was lofted over long-off for six by a languid swish of Agar's blade.\n\nRuns flowed and England became ragged. Agar's score caught up with that of Hughes, Australia's number six. Agar's half-century came up in only 50 balls. \"Well done, young man,\" said television commentator Ian Botham.\n\n\"These are not the shots of a number 11,\" added Botham, as if he was being pranked by the whole of Australia as payback for his own Ashes exploits.\n\n\"It's hard to describe the feeling,\" says Agar. \"The occasion faded away. The only reference point I had was my family. I looked at them every ball.\n\n\"Ayrton Senna said it once about driving. He said it's like having God's hand on your brain.\n\n\"You don't know how it's happening, but it just happens. All of your knowledge and skill just comes out at one time, and that's what it felt like. It felt like God's hand on my brain, that all of my subconscious was being unlocked at once.\"",
  "summary": "BBC Sport's From The Ashes series concludes with the inside story of Ashton Agar's record-breaking introduction to Test cricket as a 19-year-old batting at number 11.",
  "published": "Tue, 18 Nov 2025 06:47:10 GMT",
  "url": "https://www.bbc.com/sport/cricket/articles/cdjrvjwxmlxo?at_medium=RSS&at_campaign=rss",
  "source": "BBC Sport"
}