{
  "title": "Ashes: Panesar hits back at Smith; calls Sandpapergate 'worst cheating in Aussie history'",
  "text": "Monty Panesar and Steve Smith\n\nGo Beyond The Boundary with our YouTube channel.\n\nLive Score:\n\nWTC Final: Steve Smith on future, facing South Africa and revised format\n\nPoll Who do you think won the battle of words between Monty Panesar and Steve Smith? Monty Panesar Steve Smith It's a tie\n\nThe first Test of the Ashes has begun with an unexpected off-field storm, as former England spinner Monty Panesar unleashed a blistering response to Australia's stand-in captain Steve Smith , escalating what has become the most unlikely feud of the series. Smith had earlier mocked Panesar's infamous Celebrity Mastermind appearance while reacting to the former cricketer's advice that England should needle the Australian skipper by resurrecting memories of the 2018 Sandpaper Gate scandal. The Australian star told reporters to “do yourself a favour” and watch Panesar's quiz-show errors — including mixing up Athens' location and calling America a city — calling it “pretty comical”.But Panesar struck back with ferocity in a Telegraph column, claiming he had “won the battle” and branding Smith's press-conference comments as proof of “mental vulnerability” ahead of a blockbuster series opener.“To think that he wanted to talk about me before one of the biggest days of his career… is flattering and nothing short of hilarious,” Panesar wrote. “I cannot believe he has dug out the old YouTube clip of my shocker and memorised it word by word.”Panesar conceded his Mastermind performance was “terrible” and “a shocker”, but insisted it was still preferable to Smith's own missteps. “We've both made mistakes, but at least mine was on a celebrity quiz show.His was on a cricket field, and we both have to live by them. It seems right now only one of us can.”The former spinner went further, saying if he ever confronted Smith, he would question whether the 36-year-old could “look himself in the mirror yet” after Cape Town 2018. “I would ask Steve whether he can actually admit he was part of Sandpapergate — the worst example of Australian cheating in history.”Panesar suggested Smith's reaction proved England had already succeeded in getting inside his head. “I am delighted to have got so far inside his mind… imagine how much damage Ben Stokes and his side are going to be able to do once play starts in Perth?”He even offered sledging scripts for England players: “If I was Jofra Archer, I'd be telling him ‘I'm swinging the ball even without sandpaper'; if I was Joe Root: ‘Fine or coarse paper, mate? Tell us the tricks of your trade.'”With both sides gearing up for the brutal on-field contest, the Panesar–Smith saga has added an unexpected psychological subplot to an already high-voltage Ashes opener.",
  "summary": "An off-field storm has erupted in the Ashes as former England spinner Monty Panesar fiercely responded to stand-in Australia skipper Steve Smith's mockery of his Celebrity Mastermind appearance. Panesar branded Smith's comments as proof of mental vulnerability, suggesting England had already gotten inside the Australian captain's head ahead of the series opener.",
  "published": "Fri, 21 Nov 2025 08:33:55 +0530",
  "url": "https://timesofindia.indiatimes.com/sports/cricket/news/my-mistakes-were-on-a-quiz-show-monty-panesar-hits-back-at-steve-smith-calls-sandpapergate-worst-cheating-in-aussie-history/articleshow/125475902.cms",
  "source": "Times of India"
}