{
  "title": "Rising soil nitrous acid emissions, driven by climate change and fertilization, accelerate global ozone pollution",
  "text": "Ozone pollution is a global environmental concern that not only threatens human health and crop production, but also worsens global warming. While the formation of ozone is often attributed to anthropogenic pollutants, soil emissions are revealed to be another important source. The Hong Kong Polytechnic University (PolyU) researchers have examined global soil nitrous acid (HONO) emissions data from 1980 to 2016 and incorporated them in a chemistry-climate model to unveil the pivotal role soil HONO emissions play in the increase of the ozone mixing ratio in air and its negative impact on vegetation.\n\nSoil microbial activities and agricultural practices, notably fertiliser application, release various gases from soil into the atmosphere. Previous studies found that soil HONO emissions contribute up to 80% of the atmospheric HONO mixing ratio. The interaction of HONO with other pollutants in the atmosphere is crucial to the chemical production of ozone. HONO also promotes ozone formation by elevating concentrations of its precursors nitrogen oxide (NOₓ).\n\nProf. Tao WANG, Chair Professor of Atmospheric Environment of the PolyU Department of Civil and Environmental Engineering, along with his research team, has compiled a dataset of soil HONO emission measurements from diverse ecosystems worldwide and pioneered a quantitative parameterisation scheme to quantify the impact brought by the emissions. The research made possible the comprehensive dataset measurements by integrating multiple variables, including climate factors like soil temperature and soil water content, and fertiliser type and application rates into the scheme. For unquantifiable factors such as microbial activities, land use and soil texture, the team applied diverse parameterisations based on latitude, longitude and land use data of the corresponding soil samples. The findings have been published in Nature Communications, with Dr Yanan WANG, PolyU Postdoctoral Fellow, and Dr Qinyi LI, Professor at Shandong University, being the co-first authors.\n\nGlobal soil HONO emissions continue to increase\n\nThe researchers found that soil HONO emissions have increased from 9.4 Tg N in 1980 to 11.5 Tg N in 2016. Using the chemistry-climate model to simulate the impact of these emissions on atmospheric composition, they discovered an average 2.5% rise annually in the global surface ozone mixing ratio, with localised increases reaching up to 29%. Such increases may lead to the overexposure of vegetation to ozone, adversely affecting ecosystem balance and the production of food crops. In addition, ozone damage will reduce the capacity of vegetation to absorb carbon dioxide, thereby further aggravating the greenhouse effect.\n\nThe team pointed out that soil HONO emissions are influenced by the combined effects of nitrogen fertiliser usage and climate factors like soil temperature and soil water content, resulting in seasonal and geographic variations. Global soil HONO emissions peak in the summer when soil temperature is higher and crops are in their growing season. The northern hemisphere was found to contribute to two-thirds of global emissions, with Asia being the largest emitter, accounting for 37.2% of the total. Emissions hotspots mainly clustered in agricultural areas in India, eastern China, central North America, Europe, African savannahs and South America.\n\nRegions with lower pollution levels are more affected\n\nNotably, the influence of soil HONO emissions on the increase of the ozone mixing ratio is more significant in low anthropogenic emission regions. This is because ozone formation is closely related to the concentrations of its precursors NOₓ and volatile organic compounds (VOCs) in air. Typically, NOₓ concentrations are lower while VOC concentrations are higher in areas with low anthropogenic emissions, placing these areas predominantly in a NOₓ-limited regime where ozone is more sensitive to NOₓ. An increase in NOₓ concentration will thus lead to a greater rise in ozone levels.\n\nWith the global trend in recent years of decreasing anthropogenic emissions, more regions are likely to shift towards a NOₓ-limited regime, driving up the impact of soil HONO emissions on ozone levels. Prof. Wang said, \"Climate change and the increasing use of fertiliser will lead to continued rise in soil HONO emissions, which may offset some of the benefits expected from reduced anthropogenic emissions. It is crucial to understand and manage soil emissions to foster sustainable development. We therefore recommend considering soil HONO emissions in strategies for mitigating global air pollution.\"\n\nAdvanced modelling techniques and diverse datasets\n\nIn the development of the robust parameterisation scheme, the research team integrated advanced modelling techniques and diverse datasets, including global soil HONO emissions measurement data from 110 previous laboratory experiments and data derived from the Modern-Era Retrospective Analysis for Research and Applications Version 2 (MERRA2) reanalysis. The research team also leveraged the Community Atmosphere Model with Chemistry (CAM-Chem) climate-chemistry model developed by the National Center for Atmospheric Research of the United States for simulating the impacts of soil HONO emissions on atmospheric chemistry and vegetation exposure risk.\n\nProf. Wang said, \"Our future research will focus on expanding the global observational network for soil HONO emissions, as well as on offering a deeper understanding of microbial roles in HONO emissions by soil. These two approaches can facilitate a more accurate assessment of ozone and other secondary air pollutants production caused by soil HONO emissions and their impact on vegetation. Further studies should also explore mitigation strategies to optimise fertiliser use, such as deep fertiliser placement and the use of nitrification inhibitors, with the aim of reducing soil HONO emissions while maintaining agricultural productivity.\"",
  "summary": "Ozone pollution is a global environmental concern that not only threatens human health and crop production, but also worsens global warming. While the formation of ozone is often attributed to anthropogenic pollutants, soil emissions are revealed to be another important source.",
  "published": "Fri, 30 May 2025 12:38:21 EDT",
  "url": "https://www.sciencedaily.com/releases/2025/05/250530123821.htm",
  "source": "Latest Science News -- ScienceDaily"
}