{
  "title": "The great number nine decline - where have England's strikers gone?",
  "text": "The decline of English strikers is down to several factors according to BBC pundit Chris Sutton, who passed the 10-goal mark himself in four separate Premier League campaigns, including a 25-goal haul with Norwich in 1993-94, and an 18-goal season with Blackburn that saw him take a share of the Golden Boot in 1997-98.\n\nOne reason is a lack of appearances. From the table above, only Welbeck, Watkins and Calvert-Lewin have started more than three league games this season, while Nketiah, Solanke and Barnes have not started any.\n\n\"If you look back at the 1990s, players like Jurgen Klinsmann and Dennis Bergkamp started arriving from abroad but the overall number of foreign strikers was much lower,\" Sutton explained.\n\n\"The number one striker of my era was Shearer but if you went through the teams, then there were so many brilliant English centre-forwards like Ian Wright, Les Ferdinand, Andy Cole, Teddy Sheringham, Robbie Fowler and David Hirst - you could add Stan Collymore and Dion Dublin to that list too.\n\n\"There was an unbelievable number of them, even before Michael Owen came through ahead of the 1998 World Cup, and all different types of striker too.\n\n\"One of the differences is that they were all playing every week, because how many English centre-forwards start for their clubs in the Premier League now? That's down to the quality which the clubs can attract from elsewhere.\n\n\"Another change we've seen is in the way teams are set up. I am not saying everyone was a rigid 4-4-2 back in my day, because that's nonsense, but far fewer sides play with two strikers now.\n\n\"In other ways, things have gone full circle, because if you look at teams like Manchester City, Arsenal and Manchester United, then the big number nine is back in fashion. There are plenty of strikers in the Premier League, just not many who are English.\"",
  "summary": "BBC Sport takes an in-depth look at why England lack centre-forward options behind Harry Kane - a far cry from when the likes of Les Ferdinand only won 17 caps.",
  "published": "Thu, 13 Nov 2025 06:13:20 GMT",
  "url": "https://www.bbc.com/sport/football/articles/cx2018n9dx5o?at_medium=RSS&at_campaign=rss",
  "source": "BBC Sport"
}