{
  "title": "Samoa PM suspends country’s only daily newspaper from press briefings amid dispute over coverage",
  "text": "Samoa’s only daily newspaper has been banned from attending press conferences with the Samoan prime minister, in a move that critics say threatens the democratic integrity of the Pacific nation.\n\nRelations between La’aulialemalietoa Leuatea Polataivao Fosi Schmidt and the Samoa Observer have deteriorated in recent weeks, with the prime minister accusing the newspaper of inaccurate reporting during his eight-week medical stay in New Zealand.\n\nThe temporary ban was imposed after the public removal of Observer journalist Marieta Heidi Ilalio from the prime minister’s weekly press conference on Monday.\n\nOn Monday night, La’aulialemalietoa announced the Samoa Observer would be barred from all future press conferences.\n\nHe accused the newspaper of inaccurate reporting while he was in New Zealand for a medical issue and said it had failed to uphold ethical standards.\n\nIn a statement, La’aulialemalietoa listed several examples of stories that he claimed were “published without sufficient factual verification or a chance for those involved to respond”.\n\nHe cited an editorial which “appeared to be aimed at creating discord during my absence”.\n\nHe also detailed an incident on 16 November where he claimed Samoa Observer staff had trespassed at his private residence. “Their approach was rude, arrogant, and invasive and lacked respect for personal privacy.”\n\nAfter declaring the temporary ban, La’aulialemalietoa said he remained “committed however to a free and vibrant press”.\n\nThe Observer responded with an editorial rejecting the prime minister’s claims and reaffirming its commitment to independent, public-interest journalism. It questioned the timing of the ban and said it appeared aimed at suppressing scrutiny rather than correcting inaccuracies.\n\nThe Samoa Alliance of Media Practitioners for Development (Sampod) described the ban as a disproportionate and harmful reaction to any concerns about media coverage.\n\nSampod representative Lilomaiava Maina Vai said the government has clear channels to raise complaints and resolve disputes.\n\n“There are legal avenues and the media council process that can address concerns about reporting,” she said. “Banning and targeting one newspaper is ill advised because it restricts the public’s access to information and undermines the role of the media in a democracy.”\n\nThe ban threatens to weaken accountability and risks encouraging hostile actions against journalists, Sampod said. The Pacific Freedom Forum and Journalists Association of Samoa also expressed concerns about the ban and its implications.\n\nTV, radio and online news outlets will continue to cover the prime minister’s briefings.\n\nThe former prime minister Fiame Naomi Mata’afa, leader of the opposition Samoa Uniting Party, condemned the ban as a deliberate effort to silence scrutiny.\n\nShe said no media outlet was barred during her prime ministership, regardless of whether coverage was critical. “Leadership requires openness, accountability and the ability to face difficult questions.”\n\nFiame raised concern over the lack of transparency regarding the prime minister’s medical absence and the rise in online hostility targeting the Samoa Observer, which she said risked normalising intimidation.\n\nFormer prime minister and leader of the opposition Human Rights Protection Party, Tuilaepa Aiono Sailele Malielegaoi, also criticised the ban.\n\n“This is bad. If you think the information [in an article] is wrong, you will not get sick from it, it is an opportunity to correct it and to expand on the information.”\n\nMarieta said she was taken aback by the directive.\n\n“I have never been asked to leave a press conference before, and for it to be done like that, I had no choice but to stand up and walk away,” she said.\n\n“It made me sad to see how my role as a journalist was undermined at that point.”\n\nThe ban has ignited a wider conversation about transparency, leadership accountability and media independence in the country.",
  "summary": "<p>Prime minister has accused the Samoa Observer of inaccurate reporting during his eight-week medical stay in New Zealand</p><p>Samoa’s only daily newspaper has been banned from attending press conferences with the Samoan prime minister, in a move that critics say threatens the democratic integrity of the Pacific nation.</p><p>Relations between La’aulialemalietoa Leuatea Polataivao Fosi Schmidt and the Samoa Observer have deteriorated in recent weeks, with the prime minister accusing the newspaper of inaccurate reporting during his eight-week medical stay in New Zealand.</p> <a href=\"https://www.theguardian.com/world/2025/nov/20/samoa-pm-bans-newspaper-press-conferences\">Continue reading...</a>",
  "published": "Thu, 20 Nov 2025 04:14:43 GMT",
  "url": "https://www.theguardian.com/world/2025/nov/20/samoa-pm-bans-newspaper-press-conferences",
  "source": "World news | The Guardian"
}