{
  "title": "Why are flights in the UK so often cheaper than taking the train?",
  "text": "Years ago, airline travel was the preserve of the wealthy, and this may be why it can still come as a surprise when getting on a plane looks like the money-saving choice compared with taking the train.\n\nWhen the personal finance comparison site Finder did some research this summer, it found flying within the UK was the cheapest option more often than taking the train. It then asked people what they thought of its findings. Louise Bastock, a money expert at the website, says respondents all said “trains should be cheaper as it is public transport and more accessible”, with some saying “it feels all wrong” when plane travel cost less.\n\nI picked a day in October and compared some costs. For lots of intercity trips the train was cheaper, but there were notable exceptions. On the day I looked, a trip from London to Edinburgh at midday on Thursday 2 October cost from £77.10 on a train and from £15 on a plane. Flights at other times the same day were available from below £20, while train tickets started above £40. The cheapest flights were from London Stansted, which purists may not consider London at all. A flight from Heathrow at 1.30pm started from £37.\n\nIt was a similar story for a trip from Newquay to Manchester the next day. Before 9pm train fares started at £113, while flights were advertised from £53. The same day, Glasgow to Bristol flights cost from £15 while train fares start at £56.50.\n\nIn all cases, the prices are different throughout the day, depending on when you buy your tickets, so it is clear that the fares are not just reflecting the cost of providing the service.\n\nView image in fullscreen Reserving a seat on a train is free; reserving one on the plane will cost. Photograph: John MacDougall/AFP/Getty Images\n\nWhen it comes to train travel, the operators’ main costs are leasing the actual trains, staffing and paying for the upkeep of the track. These total about 85% of the cost, then there’s fuel – either electricity or diesel – and business costs, such as running the HR department. The fuel is subject to VAT at 5% on diesel and 20% on electricity. I haven’t been able to find out exactly how much it costs to run a train from London to Edinburgh, but have been told that a ballpark figure would be “in the tens of thousands of pounds”. However, rail travel is subsidised, with the government supporting British train operating companies to the tune of £4.1bn in the year ending March 2024, according to the latest published figures.\n\nRunning an airline involves many of the same costs. There are vehicles to lease, landing slots to pay for, and staff on the trip - as well as to support its sale and provision. As a consumer, you also need to pay air passenger duty – this starts at £7 on domestic flights, and is included in the ticket price. Fuel accounts for a much bigger part of airlines’ costs, but they do not have to pay VAT or duty on it. Three years ago, the Campaign for Better Transport estimated that taxing fuel used in domestic flights at the same rate as petrol is taxed would make the government £1.5bn a year – that’s a cost the airlines do not face.\n\nIt’s important to remember that the ticket prices mentioned so far are all headline rates, and may not reflect how much you will end up paying if you require anything beyond a seat and space for a small bag. In its latest annual accounts, Ryanair said that while the average fare paid by passengers over the year was €46 (£41), its total revenue for each person once add-ons were included was almost €70.\n\nOn the LNER train from London to Edinburgh, you’re advised to limit the luggage you lug to three bags; on the cheapest flight – provided by Ryanair – there is a very strict limit of one bag measuring 40 x 30 x 20cm. If you need to add a suitcase, you will pay a fee on top – at the time I priced up the flights I was quoted £28 on top to take a 10kg bag on board (that fee also gave priority boarding and a reserved seat). This comes to £43, so the trip is still cheaper than by train (which was £77.10). But say you want to take your bike to use at the other end: on LNER it can come with you for free (subject to a reservation), while on Ryanair you will be charged £60. Reserving a seat on a train is free; reserving one on the plane will cost – and the price will depend on the desirability of your chosen row.\n\nEven if you don’t need luggage, a plane ticket may prove a false economy if your ultimate destination is the centre of a town or city. The train from London to Edinburgh leaves King’s Cross and arrives at Waverley – a station right in the heart of the Scottish capital. Taking Trafalgar Square as the centre of London, King’s Cross is 2.1 miles away, whereas Stansted is 39.4 miles away, while Edinburgh airport is 8.9 miles from Waverley station.\n\nLooking at the whole cost of reaching your destination from home may tip the balance – particularly when arriving at an airport late at night, when public transport has finished for the day, or the choices have dwindled to one bus an hour. This will typically mean a more expensive taxi ride to a central destination than arriving at a mainline station.\n\nUltimately, both industries are charging as much as people are willing to pay, and what they think will help them fill all of their services. Cheaper trains and flights in the middle of the day, when it’s quieter, attract travellers who don’t have a set time to arrive. According to a Ryanair spokesperson: “The £15 ticket on London-Edinburgh was a loss leader to stimulate traffic growth, as a £15 ticket is better than an empty seat.” And as the company’s figures for spending show, a full seat offers more chance of add-on purchases than an empty one.\n\nFrom an environmental point of view, there is no contest. According to research by Which?, a flight from London to Edinburgh emits more than double the CO2 of a train trip (although Ryanair disputes this – the spokesperson said it pays “no attention to any fake Which? surveys or ‘research’”).\n\nSo while the headline cost may be lower on some flights, when the other costs are added, you may end up seeing the train ticket as a better deal.",
  "summary": "<p>The environmental costs of flying are much higher, and the government subsidises rail travel, so what explains the baffling price difference when travelling domestically?</p><p>Years ago, airline travel was the preserve of the wealthy, and this may be why it can still come as a surprise when getting on a plane looks like the money-saving choice compared with taking the train.</p><p>When the personal finance comparison site Finder did some research this summer, it found flying within the UK was the cheapest option more often than taking the train. It then asked people what they thought of its findings. Louise Bastock, a money expert at the website, says respondents all said “trains should be cheaper as it is public transport and more accessible”, with some saying “it feels all wrong” when plane travel cost less.</p> <a href=\"https://www.theguardian.com/lifeandstyle/2025/nov/19/why-are-flights-in-the-uk-so-often-cheaper-than-taking-the-train\">Continue reading...</a>",
  "published": "Wed, 19 Nov 2025 11:00:33 GMT",
  "url": "https://www.theguardian.com/lifeandstyle/2025/nov/19/why-are-flights-in-the-uk-so-often-cheaper-than-taking-the-train",
  "source": "The Guardian"
}