{
  "title": "A Vampire Survivors roguelike deckbuilder spinoff is coming in 2026",
  "text": "Poncle has been pretty darn busy lately. Along with greenlighting a licensed Warhammer take on Vampire Survivors, bringing a VR version of the original game to the world and working on crossover expansions, the studio is making a brand-new game. Vampire Crawlers is a Vampire Survivors spinoff. Rather than running around the map to collect gems to level up and unlock or upgrade auto-firing weapons, Vampire Crawlers has a different format. It’s a dungeon-crawling roguelike deckbuilder.\n\nIt’s set in the same world as Vampire Survivors and each of the playable characters is in the original game. You’ll put together decks of attacks and other abilities to help you on your journeys through dungeons. There’s a card customization feature too.\n\nDevelopment of Vampire Crawlers started soon after Vampire Survivors hit early access and blew up in 2021. Poncle founder and CEO Luca Galante told Xbox Wire that this is hopefully the first in a series of spinoffs in which “the idea is to take some of the core pillars behind the development of VS and to apply them to existing genres.” Galante hinted that a Vampire Survivors sequel is in the works too.\n\nVampire Crawlers is expected to arrive in 2026. It’ll be available on Steam, Xbox Series X/S, PlayStation 5, Nintendo Switch, Android and iOS. The game will debut on Game Pass Ultimate and PC Game Pass.",
  "summary": "<div><div style=\"width: 100%; height: 0; padding-bottom: 56.25%;\"></div></div><p>Poncle has been pretty darn busy lately. Along with greenlighting a licensed <a class=\"link\" href=\"https://www.engadget.com/gaming/vampire-survivors-and-warhammer-join-forces-in-a-new-roguelite-game-161352281.html\" target=\"_blank\">Warhammer take on <em>Vampire Survivors</em></a>, bringing a <a class=\"link\" href=\"https://www.engadget.com/ar-vr/vampire-survivors-vr-asks-what-if-the-bullet-hell-was-on-your-face-190749256.html\" target=\"_blank\">VR version of the original game</a> to the world and working on <a class=\"link\" href=\"https://www.engadget.com/gaming/balatro-comes-to-vampire-survivors-in-the-form-of-a-free-expansion-183005013.html\" target=\"_blank\">crossover expansions</a>, the studio is making a brand-new game. <em>Vampire Crawlers </em>is a <em>Vampire Survivors </em>spinoff. Rather than running around the map to collect gems to level up and unlock or upgrade auto-firing weapons, <em>Vampire Crawlers </em>has a different format. It’s a dungeon-crawling roguelike deckbuilder.</p><p>It’s set in the same world as <em>Vampire Survivors </em>and each of the playable characters is in the original game. You’ll put together decks of attacks and other abilities to help you on your journeys through dungeons. There’s a card customization feature too. </p><p>Development of <em>Vampire Crawlers </em>started soon after <em>Vampire Survivors </em>hit early access and blew up in 2021. Poncle founder and CEO Luca Galante told <a class=\"link\" href=\"https://news.xbox.com/en-us/2025/11/20/vampire-crawlers-xbox-partner-preview/\" target=\"_blank\"><em>Xbox Wire</em></a><em> </em>that this is hopefully the first in a series of spinoffs in which “the idea is to take some of the core pillars behind the development of <em>VS </em>and to apply them to existing genres.” Galante hinted that a<em> Vampire Survivors </em>sequel is in the works too.</p><p><em>Vampire Crawlers </em>is expected to arrive in 2026. It’ll be available on Steam, Xbox Series X/S, PlayStation 5, Nintendo Switch, Android and iOS. The game will debut on Game Pass Ultimate and PC Game Pass. </p><p></p>This article originally appeared on Engadget at https://www.engadget.com/gaming/xbox/a-vampire-survivors-roguelike-deckbuilder-spinoff-is-coming-in-2026-183841289.html?src=rss",
  "published": "Thu, 20 Nov 2025 18:38:41 +0000",
  "url": "https://www.engadget.com/gaming/xbox/a-vampire-survivors-roguelike-deckbuilder-spinoff-is-coming-in-2026-183841289.html?src=rss",
  "source": "Engadget is a web magazine with obsessive daily coverage of everything new in gadgets and consumer electronics"
}