{
  "title": "Molecular link between air pollution and pregnancy risks",
  "text": "A new study by Emory University researchers, published Thursday in Environmental Science & Technology, found that exposure to the tiny particles in air pollution during pregnancy can disrupt maternal metabolisms, altering key biological pathways. These changes were associated with increased risk of various negative birth outcomes, including premature birth.\n\nThe study, which analyzed blood samples provided by 330 pregnant women from the Atlanta metropolitan area, is believed to be the first to investigate how exposure to ambient fine particulate matter (PM2.5) commonly found in air pollution affects the metabolism of pregnant women and contributes to increased risks of preterm and early term births.\n\n\"The link between air pollution and premature birth has been well established, but for the first time we were able to look at the detailed pathway and specific fine particles to identify how they are reflected in the increased risk of adverse birth outcomes,\" says Donghai Liang, PhD, study lead author and associate professor of environmental health at the Rollins School of Public Health. \"This is important because if we can figure out the 'why' and 'how' then we can know better how to address it.\"\n\nWhy This Matters\n\nPrevious research has shown pregnant women and fetuses are more vulnerable than other populations to exposure to PM2.5 -- which is emitted from combustion sources such as vehicle exhaust, industrial processes, and wildfires -- including increased likelihood of preterm births (less than 37 weeks of gestation), which is the leading cause of death globally among children under the age of five. Preterm birth is also linked to complications such as cerebral palsy, respiratory distress syndrome, and long-term noncommunicable disease risks, while early term births (37-39 weeks of gestation) are also associated with increased neonatal morbidity and developmental challenges. Approximately 10% of the preterm births in the world are attributable to PM2.5 exposure.\n\nKey Findings\n\nThis was the first study to uncover the specific pathways and molecules involved in energy and amino acid metabolism that may explain how exposure to PM2.5 contributes to preterm and early term births.\n\nThe researchers identified two substances -- cortexolone and lysoPE(20:3) -- as factors in the relationship between short-term air pollution exposure and elevated risk of early births, offering a potential mechanism through which air pollution triggers premature labor.\n\nThe study highlighted disruptions in protein digestion and absorption -- which are vital to fetal development and immune function -- as potential links between air pollution and early births, also offering new potential targets for prevention efforts.\n\nOf the 330 women who participated in the Emory study, 66 (20%) delivered preterm babies and 54 (16.4%) delivered early term babies, both of which are significantly higher than the prevalence in the general U.S. population.\n\nWhat The Experts Say\n\n\"As an air pollution scientist, I do not think air pollution is going away anytime soon. Even at lower levels, we continue to see harmful health effects, but we can't just ask people to simply move away from highly polluted areas,\" Liang says. \"So, from a clinical intervention standpoint, that's why it's critical to gain a better understanding on these pathways and molecules affected by pollution. In the future, we may be able to target some of these molecules to develop effective strategies or clinical interventions that could help reduce these adverse health effects.\"",
  "summary": "A new study found exposure to specific tiny particles in air pollution during pregnancy are associated with increased risk of various negative birth outcomes.",
  "published": "Tue, 03 Jun 2025 14:12:02 EDT",
  "url": "https://www.sciencedaily.com/releases/2025/06/250603141202.htm",
  "source": "Latest Science News -- ScienceDaily"
}