{
  "title": "IND vs SA: Shubman Gill released from squad; Rishabh Pant to lead India in Guwahati Test",
  "text": "Shubman Gill\n\nGo Beyond The Boundary with our YouTube channel.\n\nIndia batting coach Sitanshu Kotak shares key update on Shubman Gill's fitness ahead of second Test in Guwahati\n\nNEW DELHI: India Test captain Shubman Gill has been released from the squad ahead of the Guwahati Test and has already left for Mumbai on Friday. The youngster travelled with the side on November 19 but didn't turn up for training on November 20. It is learnt that he will be resting in Mumbai for the next two-three days before seeking specialist opinion from Dr Dinshaw Pardiwala. As of now, there is no trip planned to the BCCI Centre of Excellence (CoE) and more clarity is expected in the coming days.In Gill's absence, Pant will lead the side in the crucial second Test vs South Africa starting November 22. The team management will have to take some tough Playing XI calls and as TimesofIndia.com had reported, Sai Sudharsan and Nitish Kumar Reddy are frontrunners to be picked with Axar Patel likely to return on the bench. In the training session on eve of the match, only KL Rahul, Yashasvi Jaiswal and Sudharsan turned up as the rest took it easy.India lost the first Test at the Eden Gardens inside three days and a lot of focus has been on the playing surface since then. While Eden wasn't the ideal surface, Guwahati is expected to roll out a red soil pitch which will offer both turn and bounce. It may not be as unplayable as Eden but will keep the spinners in play.India batting coach Sitanshu Kotak spoke at length about the pitch for the opening Test and felt it wasn't something they expected.\"See, in the last match wicket, Gautam said that he took all the blame on himself. He said that he took the blame because he felt that he should not put the blame on the curators,\" Kotak said. \"Now, what happened in the last match, after a day, it felt like it was crumbling. There was a little bit of soil [that came up after the ball pitched]. All of you can see that. That was not expected. Even if the spin was expected, it was after 3 days or on the third day in the evening. Sometimes, the weather, sometimes, even the curators did not want it. I am telling you the truth. No one wanted it to be like this.\"",
  "summary": "India's Test captain Shubman Gill has been released from the squad for the Guwahati Test and is heading to Mumbai for rest and specialist consultation. Rishabh Pant will lead the team in Gill's absence, with Sai Sudharsan and Nitish Kumar Reddy being frontrunners for selection. The team management is also addressing concerns about the playing surface after the first Test.",
  "published": "Fri, 21 Nov 2025 10:08:33 +0530",
  "url": "https://timesofindia.indiatimes.com/sports/cricket/india-vs-south-africa/shubman-gill-released-from-india-squad-ahead-of-guwahati-test/articleshow/125477285.cms",
  "source": "Times of India"
}