{
  "title": "Experience: I found an old Rembrandt in a drawer",
  "text": "My father died 20 years ago, when I was 26, and my mother died 10 years later. I’ve always felt grateful that one of the things they passed on to me was a love of art. My dad, Alan Barlow, was a stage designer, a Benedictine monk and then, after marrying my mother, Grace – who was a GP – he became a full-time artist.\n\nIn his studio in Norfolk, there were two big Victorian plan chests, where he stored paper and sketches he had created. He was also an art collector and some of the drawers contained artworks he had bought but didn’t have wall space for. For a long time, I didn’t feel ready to go through everything in his studio. I always felt connected to him when I went in there.\n\nBut last year, after I moved from Norfolk to Cambridge with my wife and three children, we decided to sell my parents’ home. My sister and I spent days going through everything, and when I opened a drawer, I discovered a folder with lots of old prints.\n\nOne was a faint 24cm x 21cm etching of a man in rich fur robes, sitting at a table with weighing scales, as a boy kneels at his feet and offers him a bag of gold. I recognised Rembrandt’s distinctive style. I knew that Rembrandt created such prints by etching drawings on to copper plates and then running the plates through a printing press.\n\nAlthough we were thrilled to find out how special the picture is, we still didn’t want to put it on our wall\n\nThe print was unframed, and my father had never mentioned it. But he had written on the mount that it was a Rembrandt original. I assumed that meant it had been printed from Rembrandt’s original printing plate. I wasn’t particularly excited about that: many prints were made from Rembrandt’s plates after his death, so they are not especially rare or valuable. Also, it wasn’t something I wanted on my wall, because the image was unfinished – the face was missing. So I asked myself: do I want to keep this? I thought: nah.\n\nI bundled it up and took it to a local auction house, Cheffins, to be valued. I guessed it would be worth a couple of hundred pounds at most.\n\nA few months later, I received an email from a Cheffins art expert. He explained that when Rembrandt was creating his famous 1639 etching The Goldweigher, which featured Jan Uytenbogaert, Holland’s chief tax collector, the artist would make preparatory prints before finalising the etching on his copper plate.\n\nWhen the expert inspected my print of The Goldweigher, he discovered the paper had a watermark of a Strasbourg Lily – the same watermark found on other prints Rembrandt made. Viewing my etching under magnification, he found there were black chalk lines around Jan Uytenbogaert’s face, especially around his hair, that were likely to have been made by Rembrandt himself. This indicated that the picture I had found was a preparatory print of The Goldweigher.\n\nThat was a shock. It was so exciting to think that print I had found was something Rembrandt had worked on directly. My father was a great admirer of Rembrandt, and the idea that the artist had created a famous etching using a print that ended up in my dad’s studio felt very special.\n\nThe expert said that the print was worth “well into the thousands”, which was surreal. My wife and I didn’t go crazy – we just treated ourselves to a nice bottle of wine. Although we were thrilled to find out how special the picture is, we still didn’t want to put it on our wall, and I am sure there are collectors of Rembrandt out there who will treasure it. It will be sold at auction on 3 December by Cheffins and has now been estimated to sell for between £10,000 and £20,000.\n\nskip past newsletter promotion Sign up to Inside Saturday Free weekly newsletter The only way to get a look behind the scenes of the Saturday magazine. Sign up to get the inside story from our top writers as well as all the must-read articles and columns, delivered to your inbox every weekend. Enter your email address Sign up Privacy Notice: Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on theguardian.com to send you this newsletter. You can complete full registration at any time. For more information about how we use your data see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nMy sister and I will split the money. I am thinking of using my share to buy a painting by a contemporary artist, to remind myself of the day I discovered a Rembrandt in a drawer.\n\nIt was a painful day dismantling my dad’s studio, having to throw his things away. But finding the Rembrandt has connected me back to my dad. There was such a strong sense of him in that studio that I was struggling to let go of him. Now, I feel the last thing he did was to give me this once-in-a-lifetime experience – and an extraordinary final gift.\n\nAs told to Donna Ferguson\n\nDo you have an experience to share? Email experience@theguardian.com",
  "summary": "<p>I guessed it would be worth a couple of hundred pounds at most, but it was a preparatory print for his famous 1639 etching The Goldweigher</p><p>My father died 20 years ago, when I was 26, and my mother died 10 years later. I’ve always felt grateful that one of the things they passed on to me was a love of art. My dad, <a href=\"https://viewer.gutools.co.uk/news/2005/jun/17/guardianobituaries.artsobituaries2?CMP=Share_iOSApp_Other\">Alan Barlow</a>, was a stage designer, a Benedictine monk and then, after marrying my mother, Grace – who was a GP – he became a full-time artist.</p><p>In his studio in Norfolk, there were two big Victorian plan chests, where he stored paper and sketches he had created. He was also an art collector and some of the drawers contained artworks he had bought but didn’t have&nbsp;wall space for. For a long time, I didn’t feel ready to go through everything in his studio. I always felt connected to him when I went in there.</p> <a href=\"https://www.theguardian.com/lifeandstyle/2025/nov/21/experience-i-found-an-old-rembrandt-in-a-drawer\">Continue reading...</a>",
  "published": "Fri, 21 Nov 2025 05:00:03 GMT",
  "url": "https://www.theguardian.com/lifeandstyle/2025/nov/21/experience-i-found-an-old-rembrandt-in-a-drawer",
  "source": "The Guardian"
}