{
  "title": "Still on the right track? Researchers enable reliable monitoring of the Paris climate goals",
  "text": "Global warming is continuously advancing. How quickly this will happen can now be predicted more accurately than ever before, thanks to a method developed by climate researcher Gottfried Kirchengast and his team at the University of Graz. For the first time, this method enables reliable monitoring of the Paris climate goals and shows that temperatures are rising faster than expected in the latest IPCC report. The new findings have just been published in the scientific journal Communications Earth & Environment.\n\nIn the Paris Agreement of 2015, the international community of countries agreed to limit global warming to well below 2 °C, and preferably to 1.5 °C, compared to pre-industrial levels. This refers to the increase in global surface air temperature, inspected at any time of interest as an average over 20 years. The latest IPCC report expected the 1.5 °C threshold to be reached between 2030 and 2035. Climate researcher Gottfried Kirchengast from the Wegener Center and Institute of Physics at the University of Graz now has to revise this estimate: \"Our new results show that we will exceed this limit as early as 2028 -- with a standard deviation range of plus/minus two years. The benchmark record we have developed shows the global temperature rise with unprecedented reliability and therefore allows us for the first time to also propose an assessment scale to verify whether the Paris climate goals are being met or missed,\" the scientist points out.\n\nReference standard for global warming\n\nOver the oceans, conventional monitoring of global warming does not use the air temperature above the water surface, but rather the temperature of the top few meters of seawater, such as recorded directly by drifting buoys. This results in an uncertainty that could not be properly corrected so far. The researchers at the University of Graz have now succeeded in doing so. Based on the best available data sources from international climate centers, they computed a new benchmark record for the period from 1850 to 2024, complemented by predictions up to 2034 and scenarios to 2050. \"Our data show a six percent higher increase in global surface air temperature than the conventional monitoring,\" says Kirchengast. \"And we can distinguish the human-induced temperature increase from specific climate phenomena like El Niño and other natural fluctuations, and predict the annual mean temperature of any current year, such as now for 2025, as early as from August,\" adds the co-author of the publication, Moritz Pichler from the Wegener Center.\n\nCompliance assessment for the Paris Agreement\n\nBuilding on the reliable monitoring of global warming, the researchers propose a four-classes assessment scale to quantitatively gauge to what degree the Paris climate goals are being met or missed. \"This creates a completely new compliance assessment basis for the political and legal implementation of the agreement,\" explains Kirchengast. He suggests further standardization in the context of the World Meteorological Organization and the IPCC, to provide it as an official assessment method for the Paris Agreement member countries. \"It is important to provide clarity for the Paris climate goals so that policymakers and all of us know where we actually stand and what it needs to meet them,\" emphasizes the researcher, proposing as a complement to the 1.5° C goal that the imprecise wording 'well below 2 °C' be firmly defined as 'below 1.7 °C'. \"It is high time to make these internationally binding targets for limiting global warming truly measurable and verifiable in order to underpin the urgently needed climate action by a generally valid climate-physics foundation,\" concludes Kirchengast.",
  "summary": "Global warming is continuously advancing. How quickly this will happen can now be predicted more accurately than ever before, thanks to a method developed by climate researchers. Anthropogenic global warming is set to exceed 1.5 degrees Celsius by 2028 and hence improved quantification of the Paris goals is proposed.",
  "published": "Mon, 02 Jun 2025 15:53:40 EDT",
  "url": "https://www.sciencedaily.com/releases/2025/06/250602155340.htm",
  "source": "Latest Science News -- ScienceDaily"
}