{
  "title": "Look of the Week: Blackpink headline Coachella in Korean hanboks",
  "text": "Editor’s Note: Featuring the good, the bad and the ugly, ‘Look of the Week’ is a regular series dedicated to unpacking the most talked about outfit of the last seven days.\n\nCNN —\n\nBringing the second day of this year’s Coachella to a close, K-Pop girl group Blackpink made history Saturday night when they became the first Asian act to ever headline the festival. To a crowd of, reportedly, over 125,000 people, Jennie, Jisoo, Lisa and Rosé used the ground-breaking moment to pay homage to Korean heritage by arriving onstage in hanboks: a traditional type of dress.\n\nWhile the garments were shrugged off a few seconds into their opening track, “Pink Venom,” revealing each member’s custom black and pink Dolce and Gabbana outfit, fans across the world had already received the message. Screenshots of the moment quickly spread among Blackpink superfans, otherwise known as Blinks. “The way they stepped onto the biggest western stage in hanboks … literally proved their place at the top of the industry,” tweeted one Blink. “Blackpink really are in a league of their own.”\n\nDesigned by OUWR and Kumdanje, the hanboks were inspired by the Cheol-lik silhouette. Kumdanje/OUW\n\nAnother called the group “Korea’s cultural delegation” on Instagram, in reference to not only the hanboks but other visual cues incorporated into their show, such as one of the stage backdrops featuring an angular tiled roof reminiscent of traditional Korean architecture.\n\nIn recent years, Blackpink have enjoyed a meteoric rise to global fame. According to Guinness World Records, they are currently the most streamed female group on Spotify, and have the most-viewed music YouTube channel. Last year, they were the first female K-Pop group to reach number 1 in the UK and US album charts, and in 2020 their track “How You Like That” became the most viewed video on YouTube in 24 hours. (The group also wore modernized hanboks, designed by Kim Danha, in one of the music video’s scenes.) Their landmark set over the weekend was in fact a follow-up to another milestone: In 2019, they became the first female K-Pop group to ever play at Coachella or any other US festival.\n\nFrom the iconic Jean Paul Gaultier cone bra worn by Madonna for her 1990 Blond Ambition tour to Geri “Ginger Spice” Halliwell’s Union Jack mini dress, the right stage costume can live on forever in public memory. Particularly when worn at a career-defining moment. During another watershed Coachella performance — Beyonce’s 2018 headline set — the singer’s custom Balmain collegiate-style yellow hoodie was a joyful nod to Black culture, specifically historically Black colleagues and universities.\n\nThe group’s four black hanboks were custom created by South Korean pattern design brand OUWR and traditional Korean dressmakers Kumdanje. Inspired by the Cheol-lik silhouette, each garment was hand-embroidered with metallic traditional Korean motifs, including dan-cheong patterns and peonies (a symbol of royalty in Korea). “It was our pleasure and such an honor to be able to show the beautiful values of Korea and Hanbok together,” the designers wrote in a combined Instagram post. “Blackpink showed the beauty of Korea and dazzled the world.”\n\nThe stage design was another acknowledgement of Korean heritage. Frazer Harrison/Getty Images\n\nIn Korea, hanboks are still worn for special occasions and often seen on TV dramas. Many designers in the country have also created contemporary takes that are incorporated into everyday wear. At Seoul Fashion Week, JULYCOLUMN’s Fall-Winter 2023 collection drew on the hanbok’s voluminous silhouette to create shirts and structured jackets. Last September, Korean label BlueTamburin brought the garment to a Western audience by exclusively using traditional hanbok fabric to create its Spring-Summer 2023 collection at Milan Fashion Week.\n\nWhether you’re a devoted Blink or not, the looks marked a moment of Asian visibility, recognition of traditional craftsmanship and a powerful example of feeling seen through fashion — representing Korean culture and symbolically embracing both its past and future.\n\nAt the end of their performance, and having addressed the audience between numbers in English throughout their two-hour-long performance, Blackpink finished their set in Korean: “Until now, it has been Jennie, Jisoo, Lisa, and Rosé Blackpink. Thank you.”\n\nTop image: Blackpink performing at the first weekend of Coachella 2023, shortly after removing their hanboks.",
  "summary": "Bringing the second day of this year's Coachella to a close, K-Pop girl group Blackpink made history Saturday night when they became the first Asian act to ever headline the festival. To a crowd of, reportedly, over 125,000 people, Jennie, Jisoo, Lisa and Rosé used the ground-breaking moment to pay homage to Korean heritage by arriving onstage in hanboks: a traditional type of dress.",
  "published": "Tue, 18 Apr 2023 15:39:40 GMT",
  "url": "https://www.cnn.com/style/article/blackpink-coachella-2023-hanboks-lotw/index.html",
  "source": "CNN.com - RSS Channel - World"
}