{
  "title": "Amid hectic SIR activity, Goa zilla panchayat polls deferred by a week",
  "text": "THE ZILLA panchayat elections in Goa, which were earlier scheduled to be held on December 13, have been postponed by a week.\n\nAn order by the Department of Panchayati Raj and Community Development, published in the Official Gazette on Tuesday, stated, “The general election for the North Goa zilla panchayat constituencies and South Goa zilla panchayat constituencies scheduled on December 13, 2025 vide aforesaid notifications is rescheduled to December 20, 2025.”\n\nA senior government official said the decision has been taken due to “administrative reasons” for training of newly appointed returning officers, assistant returning officers and other staff engaged in the conduct of zilla panchayat elections. “A lot of new staff who have been drawn from various government departments need to be rigorously trained for the zilla panchayat elections duties. Some of the senior staff have already been engaged in the Special Intensive Revision (SIR) exercise. So, the state election commission proposed to the government to postpone the elections by a week,” the official said.\n\nThe development comes a week after Sanjay Goel, the Chief Electoral Officer of Goa, flagged administrative concerns, saying the Election Commission had written to the state government requesting that the zilla panchayat elections “ideally” be postponed till the completion of the SIR drive in the state. The SIR exercise began in Goa on November 4. Until Tuesday, 5.02 lakh enumeration forms, which is 42.42 per cent of the total 11.85 existing electors, have been collected and digitized.\n\nLast week, Goel said, “We had initially requested the government to postpone zilla panchayat polls until the completion of SIR process… because there are returning officers and assistant returning officers of zilla parishad, who are also our electoral registration officers and assistant electoral registration officers and, administratively, they cannot do both the duties.” He said the office had requested the government that if the zilla panchayat polls are to be held simultaneously during the time-frame of the SIR, separate officers be assigned duties as respective returning officers and registration officers for the polls and SIR.\n\nOpposition parties in Goa have been raising concerns regarding the timing of the SIR drive, claiming the process, being conducted simultaneously with the zilla panchayat elections, would jeopardise free and fair conduct of the polls.\n\nIn a letter to the Election Commission of India earlier this month, AAP national secretary Pankaj Gupta said, “We appeal to the Election Commission’s sense of reason and its constitutional commitment to amend the guidelines and provide for clear remedies for those citizens whose names are excluded from the draft roll and to ensure that the SIR exercise and zilla parishad elections are not conducted at the same time, but one after the other.”\n\nStory continues below this ad\n\nSenior Goa Congress leader Girish Chodankar had also questioned the timing and intent, claiming that “these simultaneous processes appear politically motivated and deeply suspicious”.",
  "summary": "",
  "published": "Wed, 19 Nov 2025 00:43:52 +0000",
  "url": "https://indianexpress.com/article/india/amid-hectic-sir-activity-goa-zilla-panchayat-polls-deferred-by-a-week-10373427/",
  "source": "India | The Indian Express"
}