{
  "title": "Kerala local body polls 2025: Two-phase polling, timeline and election process — here’s all you need to know",
  "text": "Kerala local body polls 2025: Kerala will vote in two phases to elect representatives to municipal corporations, municipalities, gram panchayats, block panchayats and district panchayats. Seven southern and central districts (Thiruvananthapuram, Kollam, Alappuzha, Pathanamthitta, Idukki and Ernakulam) will vote on December 9 while the seven others (Thrissur, Palakkad, Kozhikode, Malappuram, Wayanad, Kannur and Kasaragod) will vote on December 11.\n\nThe results will be declared on December 13. Currently, the Model Code of Conduct (MCC) is in force.\n\nStrength and scope\n\nThe elections will cover 23,576 wards and divisions. The state election commission’s voter list, published on October 25, shows 2.84 crore voters. The Election Commission of India’s existing data lists 2.78 crore voters.\n\nPolling officials are conducting a Special Intensive Revision (SIR) of rolls till December 4, with form distribution expected to be done by November 25. The state’s Chief Electoral Officer has directed districts to ensure there is no overlap between SIR duties and local poll duties.\n\nNomination schedule\n\nAccording to the state government notification issued on November 14:\n\nNovember 21: Last date for filing nominations\n\nNovember 22: Scrutiny of nominations\n\nNovember 24: Last date to withdraw candidature\n\nDecember 9 and 11: Polling days\n\nWhy this election matters\n\nThe outcome of this election will shape political momentum ahead of the 2026 Assembly elections. Local body results have often signalled voter mood, verdicts in 2010 and 2015 went against the ruling front, and the Opposition later won the 2011 and 2016 Assembly elections.\n\nThe CPI(M)-led LDF had made major gains in the 2020 local body polls. It won five of the six municipal corporations, 514 of 941 gram panchayats, 104 of 152 block panchayats, and 10 of 14 district panchayats. The UDF secured 45 municipalities and 377 gram panchayats. The NDA won two municipalities and 22 gram panchayats.\n\nStory continues below this ad\n\nThe 2025 local body polls come a year after the Lok Sabha elections, where the LDF again won only one seat, similar to its 2019 performance.\n\nBJP’s Thiruvananthapuram push\n\nThe BJP has released its first list of 67 candidates for the Thiruvananthapuram municipal corporation. Former DGP R Sreelekha and former athlete Padmini Thomas figure in the list.\n\nThe party is the principal Opposition in the corporation and is aiming for the council, which has 101 divisions. A win here would strengthen the BJP ahead of the Assembly elections, especially in Nemom, Vattiyurkkavu and Kazhakkoottam, constituencies where the party led in the 2024 Lok Sabha elections.\n\nThe area has been a strong BJP pocket since the 1980s, and the party won its first Assembly seat in the state from Nemom in 2016.\n\nStory continues below this ad\n\nSIR on\n\nAs part of the ongoing SIR, one crore enumeration forms have been distributed so far. The month-long process began on November 4, and Kerala Chief Electoral Officer (CEO) Dr Rathan U Kelkar said it would gather momentum with newly appointed booth level officers joining in the coming days. The CEO also urged voters to use the online facility to fill out the enumeration forms.\n\nBooth level officers will continue distribution of forms till November 25. BLOs are not assigned any duties linked to the local body elections, and officials involved in the polls will not handle BLO tasks. District collectors are holding daily reviews to monitor progress.",
  "summary": "",
  "published": "Sun, 16 Nov 2025 07:52:06 +0000",
  "url": "https://indianexpress.com/article/india/kerala-local-body-polls-2025-phase-timeline-election-process-dates-details-10368795/",
  "source": "India | The Indian Express"
}