{
  "title": "‘Sacred, finite national resource’: President Droupadi Murmu calls for innovation in farm water use",
  "text": "Observing that 80 per cent of the country’s water is used in agriculture, President Droupadi Murmu said on Tuesday that farmers and entrepreneurs should adopt innovative methods to maximise production while minimising water consumption.\n\nSpeaking at the presentation of the sixth National Water Awards and Jal Sanchay-Jan Bhagidari Awards, President Murmu said, “In our country, 80 per cent of water is used in agriculture. Therefore, the greatest emphasis needs to be placed on efficient water use in agriculture and continuous innovation.”\n\nMaharashtra won the Best State Award at the sixth National Water Awards, followed by Gujarat and Haryana.\n\nThe President said that efficient water use is a global imperative and emphasised that it is even more crucial for our country, as our water resources are limited compared to the population. She also highlighted that climate change is affecting the water cycle.\n\nPresident Murmu said that under such circumstances, the government and the public should work together to ensure water availability and water security.\n\nMurmu underscored the Jal Jeevan Mission’s expansion of household tap water connections as a major shift in India’s water landscape. “In 2019, less than 17 per cent of homes had tap water. Today, that number has increased to 81 per cent. Women and girls have benefited the most, with nearly 9 crore women relieved from the daily burden of fetching water,” she added.\n\nPresident Murmu urged the citizens, institutions and governments to treat water as a “sacred and finite national resource”. Murmu also noted that more than 35 lakh groundwater recharge structures have been constructed under the Jal Sanchay-Jan Bhagidari initiative launched last year.\n\nStory continues below this ad\n\nSpeaking on the occasion, Jal Shakti Minister C R Patil said that Prime Minister Narendra Modi had given the slogan ‘Catch the Rain’ in 2019. “Addressing an event held via video conference at Surat on September 6, 2024, he [Modi] urged to make the Jal Sanchay-Jan Bhagidari initiative into a movement… I am happy to share that people from different walks of life made contributions to this. Initially, our target was to create 10 lakh groundwater recharge structures by May 31, 2025. Today, I am proud to inform you that we have created over 35 lakh structures,” Patil said.",
  "summary": "",
  "published": "Tue, 18 Nov 2025 17:32:33 +0000",
  "url": "https://indianexpress.com/article/india/sacred-finite-national-resource-president-droupadi-murmu-calls-for-innovation-in-farm-water-use-10373123/",
  "source": "India | The Indian Express"
}