{
  "title": "Frida Kahlo painting sells for $54.7m, breaking record for female artists",
  "text": "A 1940 self-portrait by Frida Kahlo has sold for $54.7m and made auction history at Sotheby’s in New York.\n\nA haunting 1940 self-portrait by famed Mexican artist Frida Kahlo has sold for $54.7m, making it the most expensive work by a female artist to sell at auction.\n\nThe painting of Kahlo asleep in a bed, titled El sueno (La cama) – or in English, The Dream (The Bed) – surpassed the record held by Georgia O’Keeffe’s Jimson Weed/White Flower No 1, which sold for $44.4m in 2014.\n\nThe sale at Sotheby’s in New York on Thursday evening also topped Kahlo’s own auction record for a work by a Latin American artist.\n\nThe 1949 painting, Diego and I, depicting the artist and her husband, muralist Diego Rivera, went for $34.9m in 2021.\n\nHer paintings are reported to have sold privately for even more.\n\nThe self-portrait that broke records on Thursday is among the few Kahlo pieces that have remained in private hands outside Mexico, where her body of work has been declared an artistic monument.\n\nKahlo’s works in both public and private collections within Mexico cannot be sold abroad or destroyed. Because the painting sold on Thursday comes from a private collection, it is legally eligible for international sale. Sotheby’s said the owner who put the painting up for auction – and whose identity has not been disclosed – “astutely” purchased the piece also at auction in New York in 1980.\n\nThe buyer’s identity was also not disclosed.\n\n'El sueño (La cama)' by Frida Kahlo soars to $54.7 million, becoming the most valuable work by a woman artist ever sold at auction. Painted in 1940 during a pivotal decade in her career, marked by her turbulent relationship with Diego Rivera. pic.twitter.com/t6Sni7fIKT — Sotheby's (@Sothebys) November 21, 2025\n\nSome art historians had scrutinised the sale for cultural reasons, while others had raised concerns that the painting, which was last exhibited publicly in the late 1990s, could again disappear from public view after the auction.\n\nAdvertisement\n\nIt has already been requested for upcoming exhibitions in cities including New York, London and Brussels.\n\nThe piece depicts Kahlo asleep in a wooden, colonial-style bed that floats in the clouds. She is draped in a golden blanket and entangled in crawling vines and leaves. Above the bed lies a skeleton figure wrapped in dynamite.\n\nKahlo vibrantly and unsparingly depicted herself and events from her life, which was altered by a bus accident at 18.\n\nShe started to paint while bedridden, underwent a series of painful surgeries on her damaged spine and pelvis, and then wore casts until her death in 1954 at age 47.\n\nDuring the years Kahlo was confined to her bed, she came to view painting as a bridge between worlds as she explored her mortality.\n\n“I’m very proud that she’s one of the most valued women, because really, what woman doesn’t identify with Frida, or what person doesn’t?” her great-niece, Mara Romeo Kahlo, told The Associated Press news agency before the auction.\n\n“I think everyone carries a little piece of my aunt in their heart.”\n\nKahlo resisted being labelled a surrealist painter, a style of art that is dreamlike and centres on a fascination with the unconscious mind.\n\n“I never painted dreams,” she once said. “I painted my own reality.”\n\nThe new record for Kahlo’s painting came hours after a Gustav Klimt portrait sold for $236.4m, setting a new record for a modern art piece.\n\nKlimt’s Portrait of Elisabeth Lederer sold after a 20-minute bidding war, also at Sotheby’s in New York, on Tuesday.",
  "summary": "A 1940 self-portrait by Frida Kahlo has sold for $54.7m and made auction history at Sotheby’s in New York.",
  "published": "Fri, 21 Nov 2025 03:43:39 +0000",
  "url": "https://www.aljazeera.com/news/2025/11/21/frida-kahlo-painting-sells-for-54-7m-breaking-record-for-female-artists?traffic_source=rss",
  "source": "Al Jazeera – Breaking News, World News and Video from Al Jazeera"
}