{
  "title": "Woman jailed for 20 years over death of Australian surfer brothers and American man in Mexico",
  "text": "A Mexican court sentenced a woman to 20 years in prison for her involvement in the April 2024 killings of two Australian surfers and an American at a surfing hotspot in Baja California, judicial authorities said Thursday.\n\nThe victims were Australian brothers Jake and Callum Robinson, aged 30 and 33, respectively, and Jack Carter Rhoad, a 30-year-old US citizen.\n\nThe three had been camping in a remote beachside area when they were killed in what investigators believe was an attempt to steal their pickup truck.\n\nA Mexican judge in Ensenada sentenced Ary Gisell Silva, 23, who admitted during the trial that she had instigated and participated in the robbery of the tourists’ belongings, which subsequently led to the murder of the three surfers.\n\n“They have good phones and good tires” on their truck, the young woman allegedly told her three accomplices before they committed the murder, according to evidence gathered in the prosecutor’s investigation.\n\nSilva was found guilty of crimes related to “violent robbery”, according to the ruling published Thursday in the public records of the judicial authority of Baja California, bordering the United States.\n\nAccording to evidence presented by the prosecution, Silva was the first to make contact with the tourists and noticed they had valuables. That prompted her to urge her boyfriend and the other two men to commit the robbery.\n\nThe three other individuals have already been arrested and charged with murder, but they are being tried in separate proceedings.\n\nThe surfers were reported missing on 27 April 2024 while camping in Ensenada, where they had travelled from the United States to surf.\n\nAccording to the prosecution, the assailants “intentionally surprised the surfers and shot them with firearms, taking their lives on Sunday, April 28.”\n\nThe crime caused great indignation and sadness in their home countries, where an intense search campaign was launched in the media and on social networks.\n\nThe bodies were found on 3 May 2024, hidden in a cliff.\n\nOther foreign tourists visiting the Mexican Pacific region had already been targets of criminal attacks.\n\nIn November 2015, two other Australian surfers, Dean Lucas and Adam Coleman, were murdered and their bodies later burned while travelling through the state of Sinaloa.",
  "summary": "<p>Mexican woman Ary Gisell Silva, 23, admitted she instigated robbery of Jake and Callum Robinson, as well as American Jack Carter Rhoad</p><p>A Mexican court sentenced a woman to 20 years in prison for her involvement in the April 2024 killings of two Australian surfers and an American at a surfing hotspot in Baja California, judicial authorities said Thursday.</p><p>The victims were Australian brothers Jake and Callum Robinson, aged 30 and 33, respectively, and Jack Carter Rhoad, a 30-year-old US citizen.</p> <a href=\"https://www.theguardian.com/world/2025/nov/21/woman-jailed-for-20-years-over-death-of-australian-surfer-brothers-and-american-man-in-mexico\">Continue reading...</a>",
  "published": "Fri, 21 Nov 2025 03:29:46 GMT",
  "url": "https://www.theguardian.com/world/2025/nov/21/woman-jailed-for-20-years-over-death-of-australian-surfer-brothers-and-american-man-in-mexico",
  "source": "World news | The Guardian"
}