{
  "title": "Seriously Silly: The Life of Terry Jones by Robert Ross review – portrait of a Python",
  "text": "Terry Jones was a Python, a historian, a bestselling children’s author and a very naughty boy. He loved to play women in drag, started a magazine about countryside ecology (Vole), founded his own real-ale brewery and was even once a columnist for this newspaper, beginning one piece in 2011 like this: “In the 14th century there were two pandemics. One was the Black Death, the other was the commercialisation of warfare.” He even used to write jokes for Cliff Richard.\n\nIt would be tempting in view of all this to call him a renaissance man, except that Jones rather despised the highfalutin Renaissance, preferring the earthiness of medieval times: his first published book was a scholarly reinterpretation of Chaucer’s Knight’s Tale, arguing that the hero’s fighting and pillaging was being presented satirically by the poet as something deplorable. Later he raided the Norse myth-kitty for the beloved children’s book (and, later, film) The Saga of Erik the Viking. His illustrator told him that Vikings didn’t really wear those massive helmets with horns sticking out at the sides, but Terry insisted on them. Historical accuracy could only get you so far.\n\nThe spiritual heart of this biography, though, is the institution of the north London pub, in several of which Jones would happily chat about his latest projects to the author of this book, a friend and comedy historian. Many pints were quaffed, and it seems as though no showbiz minutiae emerging therefrom have been omitted in these pages. As an adoring account of the career of one of the men who ran away to join the Flying Circus, it could hardly be bettered, and is decorated with warm reminiscences from colleagues Eric Idle (“My finest time with Terry was playing Ratty to his Toad in his movie of The Wind in the Willows”), Michael Palin and Terry Gilliam.\n\nJones’s brain was flash-frozen and donated to science, which itself sounds like the beginning of another Monty Python sketch\n\nSeriously Silly begins with Jones’s early childhood in Wales, before the family moved – to his lasting disgruntlement – to Surrey. Thence he rises smoothly to Oxford, where the author identifies some early influences on his subject’s comic style. Graham Midgley, one of his English tutors, followed up his lecture “Minor Poets of the 18th century” with an addendum unimprovably entitled “18th-century poets More Minor Still”. Jones gets involved with the Oxford Revue, with transfers to London, and before the reader can blink he and Palin are jobbing comedy writers at the BBC. The other future Pythons heave slowly into view, all working on this and that in different combinations before they come together as a boyband of six.\n\nAfter an impressively productive and carnivalesque career, the book ends, as all biographies must do, in decline and ill-health, though not before Jones begins an affair with an Oxford student 40 years his junior, later to become his second wife. In his last years, frontotemporal dementia gradually deprived him completely of speech, but Ross would still join him to nurse a half of ale in the pub, and the moving contributions here from friends and family testify to what Ross calls his “power of loyal friendship”. Michael Palin says: “The loveliest of collaborations was working with Terry. It just sort of grew and grew through a friendship. Terry was a chum. That’s the word for it. It’s a special thing. A chum is different from a friend. And Terry was a chum.” Upon his final expiration, Jones’s brain was flash-frozen and donated to science, which itself sounds like the beginning of another Monty Python sketch.\n\nReaders may be particularly intrigued, indeed, by the stories here about Python or Python-adjacent projects that, thanks to the vagaries of TV and film commissioning, never happened. Jones originally considered making the film of Erik the Viking with the Muppets, which would surely have been magical. In the 1990s, there was talk of making Monty Python and the Last Crusade, “with the Pythons as aged knights and archive recordings of Graham as the voice of King Arthur’s ashes”. And now would be a good time to be able to watch the sadly aborted Monty Python’s Third World War, perhaps as a charm against having to experience it in reality.\n\nskip past newsletter promotion Sign up to Inside Saturday Free weekly newsletter The only way to get a look behind the scenes of the Saturday magazine. Sign up to get the inside story from our top writers as well as all the must-read articles and columns, delivered to your inbox every weekend. Enter your email address Sign up Privacy Notice: Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on theguardian.com to send you this newsletter. You can complete full registration at any time. For more information about how we use your data see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion",
  "summary": "<p>An affectionate biography of the polymath includes details of never-produced gems such as Monty Python’s Third World War</p><p>Terry Jones was a Python, a historian, a bestselling children’s author and a very naughty boy. He loved to play women in drag, started a magazine about countryside ecology (Vole), founded his own real-ale brewery and was even once a columnist for this newspaper, <a href=\"https://www.theguardian.com/commentisfree/2011/dec/06/iran-war-drums-terry-jones\">beginning one piece in 2011</a> like this: “In the 14th century there were two pandemics. One was the Black Death, the other was the commercialisation of warfare.” He even used to write jokes for Cliff Richard.</p><p>It would be tempting in view of all this to call him a renaissance man, except that Jones rather despised the highfalutin Renaissance, preferring the earthiness of medieval times: his first published book was a scholarly reinterpretation of Chaucer’s Knight’s Tale, arguing that the hero’s fighting and pillaging was being presented satirically by the poet as something deplorable. Later he raided the Norse myth-kitty for the beloved children’s book (and, later, film) <a href=\"https://guardianbookshop.com/the-saga-of-erik-the-viking-9780140322613/?utm_source=editoriallink&amp;amp;utm_medium=merch&amp;amp;utm_campaign=article\">The Saga of Erik the Viking</a>. His illustrator told him that&nbsp;Vikings didn’t really wear those massive helmets with horns sticking out at the sides, but Terry insisted on them. Historical accuracy could only get you so far.</p> <a href=\"https://www.theguardian.com/books/2025/nov/18/seriously-silly-the-life-of-terry-jones-by-robert-ross-review-portrait-of-a-python\">Continue reading...</a>",
  "published": "Tue, 18 Nov 2025 09:00:29 GMT",
  "url": "https://www.theguardian.com/books/2025/nov/18/seriously-silly-the-life-of-terry-jones-by-robert-ross-review-portrait-of-a-python",
  "source": "The Guardian"
}