{
  "title": "Common gene variant doubles dementia risk for men",
  "text": "New research has found that men who carry a common genetic variant are twice as likely to develop dementia in their lifetime compared to women.\n\nThe research, published in Neurology, used data from the ASPirin in Reducing Events in the Elderly (ASPREE) trial to investigate whether people who had variants in the haemochromatosis (HFE) gene, which is critical for regulating iron levels in the body, might be at increased risk of dementia.\n\nCo-author Professor John Olynyk, from the Curtin Medical School, said one in three people carry one copy of the variant, known as H63D, while one in 36 carry two copies.\n\n\"Having just one copy of this gene variant does not impact someone's health or increase their risk of dementia. However, having two copies of the variant more than doubled the risk of dementia in men, but not women,\" Professor Olynyk said.\n\n\"While the genetic variant itself cannot be changed, the brain pathways which it affects -- leading to the damage that causes dementia -- could potentially be treated if we understood more about it.\"\n\nProfessor Olynyk said further research was needed to investigate why this genetic variant increased the risk of dementia for males but not females.\n\n\"The HFE gene is routinely tested for in most Western countries including Australia when assessing people for haemochromatosis -- a disorder that causes the body to absorb too much iron. Our findings suggest that perhaps this testing could be offered to men more broadly,\" Professor Olynyk said.\n\n\"While the HFE gene is critical for controlling iron levels in the body, we found no direct link between iron levels in the blood and increased dementia risk in affected men.\n\n\"This points to other mechanisms at play, possibly involving the increased risk of brain injury from inflammation and cell damage in the body.\"\n\nCo-author Professor Paul Lacaze, from Monash University, said the findings could help improve outcomes for people at risk of developing dementia.\n\n\"More than 400,000 Australians are currently living with dementia, with around a third of those being men. Understanding why men with the double H63D variant are at higher risk could pave the way for more personalised approaches to prevention and treatment,\" Professor Lacaze said.\n\n\"This study is a great example of how diverse Australian research groups and universities can collaborate effectively to learn more about these progressive diseases and ultimately improve health outcomes for people around the world.\"\n\nThe ASPREE trial was a double-blind, randomised, placebo-controlled trial of daily low-aspirin in 19,114 healthy older people in Australia and the USA. Primarily undertaken to evaluate the risks versus benefits of daily low-dose aspirin in this cohort, it created a treasure trove of healthy ageing data that has underpinned a wealth of research studies.\n\nThe research was a collaboration between Curtin University, Monash University, The University of Melbourne, The Royal Children's Hospital, Murdoch Children's Research Institute and Fiona Stanley Hospital.",
  "summary": "New research has found that men who carry a common genetic variant are twice as likely to develop dementia in their lifetime compared to women.",
  "published": "Fri, 30 May 2025 12:41:12 EDT",
  "url": "https://www.sciencedaily.com/releases/2025/05/250530124112.htm",
  "source": "Latest Science News -- ScienceDaily"
}