{
  "title": "Madvi Hidma, top surviving Maoist leader behind 26 lethal attacks, killed in encounter",
  "text": "Madvi Hidma (51), the most wanted leader left within the Naxal ranks and the man responsible for some of the bloodiest attacks on security forces, was killed in an encounter in Andhra Pradesh on Tuesday morning.\n\nAmit Bardar, Superintendent of Police, Alluri Sitarama Raju district, told The Indian\n\nExpress that Hidma alias Santosh, his wife and four others were fleeing from Chhattisgarh when they were surrounded by security forces in the Maredumilli forest between 6 am and 7 am.\n\n“For the past few weeks, inputs from the Andhra Pradesh Special Intelligence Bureau have specifically indicated the movement of Maoists near the Andhra Pradesh-Chhattisgarh-Odisha border and, based on those inputs, we operated and got this success,” said a\n\ntop officer.\n\nHidma was a Central Committee member and leader of the Dandakaranya Special Zonal Committee, who rose through the ranks after being recruited as a child in Chhattisgarh. As a result, he commanded absolute loyalty from the cadre within the state. He carried a cumulative bounty of Rs 1.80 crore in six states — Rs 50 lakh in Maharashtra, Rs 40 lakh in Chhattisgarh, Rs 25 lakh each in Odisha, Andhra Pradesh and Telangana, and Rs 15 lakh in Madhya Pradesh.\n\nWhen Mallojula Venugopal Rao alias Sonu surrendered recently, a top security official had said the focus was now on capturing Hidma — alive or dead. “He is the party’s most deadly commander. The search will be on for him now,” the official had said.\n\nThe state had repeatedly appealed to him over the years to surrender, most recently through his mother.\n\nStory continues below this ad\n\nHidma was responsible for over two dozen deadly attacks, including the one in Tadmetla in 2010, which killed 76 CRPF personnel, and the 2013 Jhiram Ghati (Darbha) attack, which wiped out the Congress leadership in Chhattisgarh.\n\nThe exchange of fire on Monday morning occurred after the anti-Naxal Greyhounds and the local police started a combing operation late Monday night on receiving information about the movement of a large group of Maoists along the border of the three states, an official said. As per the information, the group was travelling through the forests.\n\nAccording to officials, Hidma had just 35-40 rounds of AK-47 rifle ammunition left when he was killed. “On the run from security forces, they did not have much to fight with. We usually recover large quantities of ammunition during such operations involving top Maoist leaders, but not in this case. This indicates that even a top leader like Hidma could not get hold of enough ammunition to stay in the fight,” an official said.\n\nTuesday morning’s anti-Maoist operation took place after a long period of limited Maoist activity in Andhra Pradesh. The state witnessed previous encounters in April and June. In the June 18 encounter, Gajarla Ravi, a Central Committee member on the National Investigation Agency’s most wanted list, and Aruna, the wife of senior Maoist leader Chalapati alias Appa Rao, were among three Maoists killed.\n\nStory continues below this ad\n\nWith Union Home Minister Amit Shah vowing to end the insurgency by next March, security forces have been pursuing Maoists in Chhattisgarh, where they are currently hiding in a few pockets of Bastar and Dandakaranya. Much of the top leadership, including former general secretary Basvaraj, and Central Committee members Katta Ramachandra Reddy, Kadari Satyanarayana Reddy, Gajarla Ravi, Chalpathi, Sahdev Soren, Balkrishna, and Narasimha, have been killed this year.\n\nIn neighbouring Telangana, dozens of Maoist leaders and scores of cadres have surrendered in recent months.\n\nHours after the encounter, security forces in Andhra Pradesh, including its anti-terrorist unit called the Organisation for Counter Terrorist Operations or Octopus, arrested 31 suspected Maoists and their sympathisers in Vijayawada, Krishna and NTR districts.\n\nAdditional Director General of Police Mahesh Chandra Laddha said that of the 31 persons arrested, nine are former personal security guards of General Secretary Devuji.\n\nStory continues below this ad\n\n“The rest belong to various Maoist battalions of South Bastar. Under pressure in Chhattisgarh, they have sneaked into Andhra Pradesh and are in hiding,” Laddha said.",
  "summary": "",
  "published": "Tue, 18 Nov 2025 05:48:55 +0000",
  "url": "https://indianexpress.com/article/india/madvi-hidma-top-surviving-maoist-leader-lethal-attacks-killed-encounter-10371983/",
  "source": "India | The Indian Express"
}