{
  "title": "Dermatologists criticise ‘dystopian’ skincare products aimed at children",
  "text": "Dermatologists have criticised an actor’s new skincare brand, calling it “dystopian” for creating face masks for four-year-olds, warning that the beauty industry is now expanding its reach from teenagers to toddlers.\n\nIt comes as a growing number of brands are moving into the children’s, teenage and young adult skincare market. In October, the first skincare brand developed for under-14s, Ever-eden, launched in the US. Superdrug has just created a range for those aged between 13 and 28.\n\nA number of brands have surged in popularity among very young social-media users, creating a phenomenon known as “Sephora kids”. These children share videos showcasing beauty products from Drunk Elephant, Bubble, Sol de Janeiro and similar brands.\n\nActor Shay Mitchell, who has 35.2 million followers and is famous for her role in the American mystery teen drama series Pretty Little Liars, has released a hydrogel skincare mask for children, saying it was “inspired” by her daughters. She said she wanted to create something “fun, gentle and safe”.\n\nThe co-founders of Rini, who include Esther Song and Matte Babel, describe the brand as “where skincare meets play”, with a mission to nurture “healthy habits, spark confidence, and make thoughtfully crafted daily care essentials and play products accessible to every family”.\n\nHowever, the trend has met a backlash from dermatologists and commenters online. Dr Emma Wedgeworth, consultant dermatologist at 55 Harley Street, central London, described it as “ridiculous”. She said: “I think these products are completely unnecessary. When we look at what we put on children’s skin, we must weigh up benefits and risks, and in this case there are no real benefits, yet we expose children to unnecessary risks.\n\n“It’s important that we set a good example for young people in how to maintain healthy skin, without drawing too much attention to appearance or creating scrutiny around how their skin looks. At this age, skincare should be purely functional: gentle cleansing, moisturising if the skin is dry and sun protection. A melting cleanser or fragranced products do not support the skin barrier in any meaningful way.”\n\nShe added that very young children are naturally unselfconscious, and “we don’t want to encourage them to focus on appearance or create anxiety about how their skin looks”. She said children’s skin is more sensitive, “and exposing them to multiple unnecessary chemicals increases the risk of irritation and sensitisation later on”.\n\nWedgeworth said: “There is nothing wrong with well-formulated products designed specifically for young skin, if they are genuinely based on scientific understanding of the differences between adult and child skin. The problem with some of these new ranges, including celebrity-driven brands, is that they are marketing-led, not science-led, and offer no real skin benefit.”\n\nDermatologist Amy Perkins posted on her Instagram to say: “Rini have marketed ‘gentle’ face masks to ‘restore’ young skin … They’re describing it as ‘where skincare and play meet innovation’ … and I find this eerily dystopian.” She said it was the beauty industry “expanding its reach from teens to toddlers”.\n\nRini products include everyday fragrance-free, animal-themed facial sheet masks for those four and above, costing £11 for a bundle. They are crafted from 100% pure cotton and include vitamin E, the website says.\n\nRini says on its website that its bath essentials, launching in 2026, are generally recommended for ages two and up. It adds that its play products “are also formulated to be safe for little ones, but you know your child best”. Rini has been approached for comment.\n\nIn October, Ever-eden became the first skincare brand developed by paediatric dermatologists specifically for those under 14. At the time, it said its launch marked the establishment of a generation alpha category – approximately one to 15 years old – rooted in science, safety and education.\n\nIt has a setting on its website that lets customers opt for products aimed at children aged three to eight, including a face cleanser and a cream with SPF 20, plus a free hairband, costing $48 (£36). This product, the site states, is formulated for children three and upwards and is dermatologist-tested, safe for sensitive skin, and vegan.\n\nThe company also sells a “kids' routine bundle”, retailing for $92 (£70), which includes a shampoo, conditioner, multi-vitamin face cream and wash. This is also aimed at those three and upwards. Ever-eden has been approached for comment.\n\nIn the UK, Superdrug has launched a range called POP for generation Z, those roughly between 13 and 28 years old, saying it closes a gap in the market for affordable skincare that is effective, barrier-safe and suitable for developing skin.\n\nEmma Monaghan, head of own brand and exclusives at Superdrug, said: “We identified a real gap in the market for skincare that meets the needs of younger consumers who are increasingly sophisticated in their routines but still value accessibility and trust. POP allows us to not just fill a space in the category, but it sets a new benchmark for how we speak to younger, skincare-aware shoppers.”\n\nThe range – which includes a cleansing balm, face wash, toner, moisturiser, serum and SPF – was developed with extensive testing on younger skin, Superdrug said, and co-created with a youth group to ensure every formula, design and message felt authentic to this audience.",
  "summary": "<p>Marketing or celebrity-led treatments for toddlers and upwards described as ‘ridiculous’ and lacking in skin benefit</p><p>Dermatologists have criticised an actor’s new skincare brand, calling it “dystopian” for creating face masks for four-year-olds, warning that the beauty industry is now expanding its reach from teenagers to toddlers.</p><p>It comes as a growing number of brands are moving into the children’s, teenage and young adult skincare market. In October, the first skincare brand developed for under-14s, Ever-eden, launched in the US. Superdrug has just created a range for those aged between 13 and 28.</p> <a href=\"https://www.theguardian.com/fashion/2025/nov/16/dermatologists-criticise-dystopian-skincare-products-aimed-at-children\">Continue reading...</a>",
  "published": "Sun, 16 Nov 2025 12:33:56 GMT",
  "url": "https://www.theguardian.com/fashion/2025/nov/16/dermatologists-criticise-dystopian-skincare-products-aimed-at-children",
  "source": "The Guardian"
}