{
  "title": "The EU indicates it won't accept the U.S.'s Russia-Ukraine peace deal",
  "text": "The EU indicates it won't accept the U.S.'s Russia-Ukraine peace deal\n\nThe U.S. has proposed a peace plan for Russia and Ukraine, but the EU has already indicated it won't accept the deal.\n\nJUANA SUMMERS, HOST:\n\nArmy Secretary Dan Driscoll met with Ukrainian President Volodymyr Zelenskyy in Kyiv today. A key part of that meeting was presenting a draft plan of a U.S.-Russia peace deal. It calls for Ukraine to give up all land in the eastern part of the country to Russia. The European Union already has indicated that it's troubled by this plan. One official called it capitulation. NPR's Tom Bowman is following this and joins us now. Hi there.\n\nTOM BOWMAN, BYLINE: Hey, Juana.\n\nSUMMERS: Tom, I have to say, this seems like it sort of came out of nowhere. So tell us if you can, how did this draft plan come about?\n\nBOWMAN: Yeah, it did. It was drafted by Trump's special envoy Steve Witkoff and his Russian counterpart, businessman Kirill Dmitriev, in Miami recently, and it was leaked, the Americans believe, by the Russians. I've been told about some parts of the plan by a source not authorized to speak. And again, the proposal appears to give Russia everything they want and more. Right now, the Russians control about 88% of the eastern Donbas region, and this proposal, Juana, gives them all that land.\n\nAlso, Britain and other European nations had planned on sending troops to oversee a peace agreement. That proposal says that will not happen. Those are among the reasons the French foreign minister said peace cannot be a capitulation. And it's likely other European allies will balk at this plan as well.\n\nSUMMERS: Well, what about President Zelenskyy? What has he had to say?\n\nBOWMAN: Well, after the meeting with Army Secretary Dan Driscoll, for an hour or so, Zelenskyy released a statement that was pretty conciliatory, saying they agreed to work on the plan's provisions to end the war. Another U.S. official not authorized to speak publicly tells us that Driscoll and Zelenskyy agreed - get this - on an aggressive timeline for signature. So it seems this is all moving quite quickly, despite the concerns of European allies. But it's important to note Zelenskyy has long ruled out any territorial concessions to Russia. It appears now, with very strong U.S. pressure on him, he's finally helped - you know, is going to help bring this war to an end.\n\nSUMMERS: Tom, as you mentioned, this proposal was drafted by Trump's envoy, Steve Witkoff. What comes next for him?\n\nBOWMAN: Witkoff is slated to join talks next week in Istanbul with Zelenskyy and Turkish President Erdogan, which will not only include peace talks but also prisoner exchange talks. Turkey has maintained contact with both Russia and Ukraine, but no Russian representative is expected to take part in those talks. I'm also told Army Secretary Driscoll and several U.S. generals could be meeting with Russian officials in the coming weeks to talk about this proposed peace plan.\n\nSUMMERS: Tom, one thing that sort of sticks out here is that we have the Army secretary in these high-level meetings with the head of state. It's not, say, Secretary of State Marco Rubio or even Vice President JD Vance. Is that typical?\n\nBOWMAN: No, it's not. I've never heard of a military service secretary leading such meetings. Now, Driscoll had already planned to be in Ukraine to talk with his counterparts about drones and lessons learned from the Ukraine war. So the White House asked him to help jump-start peace talks. And the sense is he could more easily relate to Ukrainian military officials, talk about their needs, since Driscoll is an Iraq combat veteran. He's also of - the former Yale School Law (ph) roommate of Vice President JD Vance, so that has helped his profile as well. I'm told they talk almost every day. And by the way, Juana, there's widespread speculation that if Defense Secretary Pete Hegseth leaves, Driscoll could be tapped to lead the Pentagon.\n\nSUMMERS: One last thing, quickly, Tom, you've mentioned that the war is almost entering its fourth year. What's the situation on the ground like now?\n\nBOWMAN: Well, Russia is pummeling Ukraine, including Kyiv, with rockets and drones. Russian troops are making some gains in the east. It's been a war of attrition for a long time. I recently asked a Western diplomat, what's the best scenario for Ukraine? And he said, freezing the battle lines in the east. But again, this proposal gives all the eastern land to Russia.\n\nSUMMERS: NPR's Tom Bowman, thank you.\n\nBOWMAN: You're welcome.\n\nCopyright © 2025 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\n\nAccuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.",
  "summary": "The U.S. has proposed a peace plan for Russia and Ukraine, but the EU has already indicated it won't accept the deal.",
  "published": "Thu, 20 Nov 2025 16:52:10 -0500",
  "url": "https://www.npr.org/2025/11/20/nx-s1-5615184/the-eu-indicates-it-wont-accept-the-u-s-s-russia-ukraine-peace-deal",
  "source": "NPR Topics: World"
}