{
  "title": "Abandoned at birth and looked after by humans, first Indian cheetah Mukhi becomes mother to 5 cubs",
  "text": "Abandoned by its mother at birth and doted on by wildlife officials at Madhya Pradesh’s Kuno National Park, India-born cheetah Mukhi has given birth to five cubs, officials said on Thursday.\n\nMukhi is the sole surviving cheetah cub born in India at Kuno, a landmark for the country’s cheetah reintroduction project. Born on March 29, 2023, to Namibian cheetah Jwala, Mukhi survived against extreme odds, including the death of its three siblings due to severe summer heat – a key challenge faced in adapting cheetahs to the Indian habitat.\n\nThe father of the cubs is also said to be of Indian origin.\n\nUttam Kumar Sharma, Director of Kuno National Park and Project Cheetah, told The Indian Express, “The Kuno staff did not plan for this. Mukhi had just begun its rewilding exercise and was let out of the bigger enclosure. We also saw three male cheetahs born to Asha stroll around its enclosure and saw a positive interaction, so we thought to let Mukhi out in the wild. Then we got the good news, and believe it was one of the males born to Asha that is the mate. It was a surprise because even the male cubs are young, and we thought they had not reached the age of sexual maturity.”\n\nMukhi had to overcome maternal abandonment shortly after birth, dehydration from extreme summer heat that claimed its three siblings, and a serious injury to the right forelimb that required intensive treatment and rehabilitation for over six weeks.\n\nIt was found weak and exhausted by the veterinary team in May 2023, which led to hand-rearing under strict protocols to ensure survival and development. The rehabilitation involved introducing live prey, such as hares, in an enclosure to stimulate and develop hunting skills crucial for independent survival in the wild.\n\nWildlife officials say Mukhi has been completely rehabilitated and has been hunting on its own. However, there is a fear of Mukhi’s role as a mother, as the abandoned cub never really learnt the hunting skill from its mother or was subjected to the biological pressures from the wild, something which has the officials concerned over how the next stock of Indian-born cheetahs will fare.\n\nStory continues below this ad\n\nSharma said, “Mukhi has made tremendous progress and hunts small chital on its own, which is why we have been letting it out of its big enclosure. We will now focus on whether it will be able to impart its hunting skills to the offspring and their progress. It’s too soon to comment on this.”\n\nChief Minister Mohan Yadav said the successful reproduction of an India-born cheetah is a strong indicator of the species’ adaptation, health, and long-term prospects in Indian habitats. “This significant step forward strengthens optimism about establishing a self-sustaining and genetically diverse cheetah population in India, further advancing the nation’s conservation goals,” Yadav said.\n\nAt present, India has 34 cheetahs, including 10 adults and 24 cubs. The big cat had been extinct in the wild in India before 20 individuals were transported from southern Africa in two batches in 2022 and 2023.",
  "summary": "",
  "published": "Thu, 20 Nov 2025 07:04:44 +0000",
  "url": "https://indianexpress.com/article/india/first-indian-cheetah-mukhi-becomes-mother-cubs-10375855/",
  "source": "India | The Indian Express"
}