{
  "title": "'He fixes what needs fixing' - why Raducanu turned to Nadal's ex-coach",
  "text": "With Petchey making it clear he was unwilling to sacrifice his role as a television commentator to coach on a full-time basis, Raducanu continued to assess her options.\n\nRoig's availability came to attention over the summer and the pair worked together in a covert trial following Wimbledon.\n\nRaducanu likes to learn and once put her high turnover of coaches down to asking \"provoking\" questions. She found Roig's sessions to be stimulating, challenging and instantly encouraging.\n\n\"Francis is very passionate for tennis,\" said Vilaro.\n\n\"What's amazing is he can watch a match on TV and he doesn't care about the result - he's checking how they are moving, the positioning and how they are hitting the ball. He's watching many specific things.\n\n\"When we created the academy he said, 'I want to do it but I don't want any paperwork. I just want to be on the court'. The court is his passion.\"\n\nRaducanu has already impressed Roig with her work ethic.\n\nIn his first tournament at the helm, the pair had multiple daily practices at the Cincinnati Open, where she confidently breezed past Serbia's Olga Danilovic before – more notably – pushing world number one Aryna Sabalenka to her limit.\n\nWhile Raducanu fell short of a shock, it was a promising performance which provides optimism for the US Open.\n\n\"I spoke to Francis after Raducanu beat Danilovic and before she played Sabalenka,\" said Vilaro.\n\n\"He said, 'It's amazing, I like working with this player a lot because she loves to be on court. We spent two hours training the return, the return plus second shot and what to do when the opponent attacks'.\n\n\"He enjoyed it a lot. The most important thing for him is having a player who loves being on court - and it looks like this is the case.\"",
  "summary": "Emma Raducanu recently appointed another full-time coach in Spaniard Francisco Roig - BBC Sport speaks to those who know him best.",
  "published": "Wed, 20 Aug 2025 07:06:58 GMT",
  "url": "https://www.bbc.com/sport/tennis/articles/c5ypke1n361o?at_medium=RSS&at_campaign=rss",
  "source": "BBC Sport"
}