{
  "title": "Small currents, big impact: Satellite breakthrough reveals hidden ocean forces",
  "text": "What if some of the smallest ocean currents turned out to be some of the most powerful forces shaping our planet's climate?\n\nThis question is at the center of new research co-led by Texas A&M University Department of Oceanography Associate Professor Jinbo Wang, whose work is featured on the cover of the April 17 issue of Nature. It's a big moment for Wang and his colleagues and the global science community -- marking a milestone in a billion-dollar, international water mission two decades in the making, and reflecting Texas A&M University's long-term strategy to grow its leadership in satellite oceanography and climate research.\n\nWang joined Texas A&M after working at NASA's Jet Propulsion Laboratory (JPL) in California for over nine years, where he helped lay the groundwork leading to this research alongside colleagues at JPL and France's space agency, CNES (Centre National d'Études Spatiales) and Caltech. The recent Nature paper builds on foundational work developed by these teams during the last two decades.\n\nWhat's An Eddy -- And Why Should We Care?\n\nAn eddy is like a mini whirlpool in the ocean. Picture swirling water behind a rock in a river -- eddies in the ocean work in a comparable way, only much bigger and more difficult to observe. Some stretch for hundreds of kilometers and help move heat, nutrients and energy across the globe. They are vital for climate, weather and marine life.\n\nWhile scientists have long studied currents of large eddies, the smaller ones -- called submesoscale eddies -- are notoriously difficult to detect. These currents, which range from several kilometers to 100 kilometers wide, have been the \"missing pieces\" of the ocean's puzzle -- until now.\n\nNew Eyes On The Ocean\n\nUsing data from the new Surface Water and Ocean Topography (SWOT) satellite, Wang and his collaborators at JPL, CNES and Caltech finally got a clear view of these hard-to-see currents.\n\n\"For the first time, we can directly observe small-scale ocean processes across the globe,\" Wang said. \"And it turns out they are a lot stronger than we thought.\"\n\nThis breakthrough comes from the SWOT satellite, which uses a Ka-band radar interferometer to measure subtle changes in sea surface height with millimeter precision. The instrument has revealed swirling patterns and internal ocean waves -- features that, until now, had never been captured at this scale from space.\n\n\"These smaller currents carry surprisingly large amounts of energy,\" Wang explained. \"They play a huge role in moving heat between the upper and deeper parts of the ocean and shaping how the ocean sustains its ecosystem and interacts with the atmosphere. That means they can influence marine food webs and weather patterns, like how hurricanes form and where they go, or how events like El Niño and La Niña develop. These are not just ocean features -- they connect directly to the climate systems that impact all of us.\"\n\nA Happy Surprise -- And A Global Breakthrough\n\nThis level of success wasn't guaranteed. While SWOT met its science requirements, many scientists -- including Wang -- were not sure it would be sensitive enough to measure these subtle sea surface changes. But the engineering team behind the satellite beat expectations.\n\n\"I was pessimistic about the expected outcome before the satellite launch,\" Wang said. \"But the satellite performed four times better than expected. That surprise is what made this breakthrough possible.\"\n\nWith better-than-expected data, the team showed that submesoscale motions -- especially the spiral-shaped eddies and long internal solitary waves -- are far more powerful and frequent than previously believed. These small but mighty movements stir up the ocean, helping mix warm and cold water, transport energy over long distance, which affects ocean circulation, eventually weather and climate. The study highlights the potential of these new data in helping scientists to improve their numerical models for climate predictions.\n\nGlobal Teamwork, Decades In The Making\n\nThis research was made possible by the SWOT mission, a $1 billion joint effort between NASA and CNES with contributions from the U.K. and Canadian space agencies. The mission development has involved a large international team and more than 20 years of planning, testing and innovation.\n\n\"We're building on work that started two decades ago,\" said Dr. Shari Yvon-Lewis, head of the Texas A&M Oceanography Department. \"Many people who helped design this satellite and the science have since retired. It's a tribute to long-term vision, teamwork and dedication.\"\n\nHiring Wang was a key part of Texas A&M's investment in expanding its expertise in satellite oceanography -- an area critical for understanding ocean physics and its role in the climate system. His experience at JPL and leadership in global collaborations like SWOT have positioned the university at the forefront of space-based ocean research.\n\nWang is also leading a NASA Ocean AI working group focused on how artificial intelligence and machine learning can help analyze existing and future satellite data and help future mission design. He is keen to contribute to the next big satellite mission.\n\nFor now, having his work featured on the cover of Nature is a moment to celebrate -- and a reminder of how much the ocean can teach us.\n\n\"This is just the beginning,\" Wang said. \"We finally have the tools to see what's been hiding in plain sight.\"",
  "summary": "While scientists have long studied currents of large eddies, the smaller ones -- called submesoscale eddies -- are notoriously difficult to detect. These currents, which range from several kilometers to 100 kilometers wide, have been the 'missing pieces' of the ocean's puzzle -- until now. Using data from the new Surface Water and Ocean Topography (SWOT) satellite, scientists finally got a clear view of these hard-to-see currents, and they are a lot stronger than anyone thought.",
  "published": "Fri, 30 May 2025 12:39:50 EDT",
  "url": "https://www.sciencedaily.com/releases/2025/05/250530123950.htm",
  "source": "Latest Science News -- ScienceDaily"
}