{
  "title": "Play-off pressure 'very much on Italy' - O'Neill",
  "text": "With Northern Ireland two games away from reaching the 2026 World Cup, manager Michael O'Neill has told his players not to \"waste this opportunity\".\n\nIt's certainly not a straightforward path to North America as they travel to Italy for their play-off semi-final on 26 March.\n\nShould they upset the Azzurri, Northern Ireland will travel to either Wales or Bosnia-Herzegovina five days later for a winner-takes-all final.\n\nItaly have not qualified for a World Cup since the 2014 edition in Brazil, with Northern Ireland absent from the big dance since 1986 when it was last held in Mexico - one of the three host nations next year alongside Canada and the USA.\n\nAlthough O'Neill's side has a young age profile, he has no doubt they can rise to the play-off challenge. Despite away defeats by Germany and Slovakia in the group phase, he also feels his side showed enough on the road to suggest they can spring the surprise.\n\n\"It's difficult to win away in international football and that is something this team still has to develop, but I take a lot of encouragement from the performances in Cologne and Slovakia where we were challenged and were missing key players in those games,\" he said.\n\n\"We still gave a really good account of ourselves and were in the game in Germany for 70, 75 minutes. We were in the game in Slovakia right to the end and felt a little big aggrieved by the nature of that result.\n\n\"We have to make the game as difficult as possible for Italy and it will be difficult for them with the expectation they carry into the game.\n\n\"If we can add to that with how we play the game and the level of our performance, then who knows. We have an opportunity to go to a World Cup and we have to do everything possible to try to take it. What I will say to them is 'don't waste the opportunity'.\"",
  "summary": "With Northern Ireland potentially two wins away from qualification for the 2026 World Cup, manager Michael O'Neill is urging his players not to \"waste this opportunity\".",
  "published": "Thu, 20 Nov 2025 16:47:04 GMT",
  "url": "https://www.bbc.com/sport/football/articles/crexe14x3qyo?at_medium=RSS&at_campaign=rss",
  "source": "BBC Sport"
}