{
  "title": "Mob vandalises shops in Nainital’s Haldwani amid tensions over cattle remains found near school",
  "text": "Following rumours that the head of a calf was found at the gate of a school near a temple in Haldwani in Nainital, a mob vandalised shops and other property in the area Sunday night. On Monday, the tense town saw massive police presence.\n\nAccording to police, a group assembled on Sunday night following the purported discovery of animal remains at Haldwani’s Banbhulpura.\n\nA complaint was filed by one Ravinder Gupta against an unknown person. However, the police personnel said they found from CCTV cameras that a dog was seen bringing the animal remains from the forest side. Primary facie, local enquiries indicate that after an animal gave birth in the forest area, the parts of the carcass were dragged outside, police said. Police have taken the remains for further examination and proceedings by the forensic unit.\n\nDespite this, a crowd gathered after the news of the discovery spread on social media. They vandalised stores and other property owned by the minority community in different parts of the city. Police resorted to a lathi charge and dispersed the crowd.\n\nSuperintendent of Police, Crime, Jagdish Chandra told The Indian Express that seven people were put under preventive detention on Sunday night under section 172 of the BNSS. “We are identifying the crowd and will make arrests soon. The probe to trace the carcass is also underway,” said the officer. Currently, the city has three deputy superintendents of police, officers from eight police stations and two companies of the Provincial Armed Constabulary, the SP said.\n\nAs per the FIR registered regarding the vandalism, some “anti-social elements” gathered a crowd and, while creating unnecessary disturbance in various parts of Haldwani city, allegedly committed stone-pelting and vandalism, damaged vehicles parked on the road, and also beat passersby.\n\n“Around 40–50 unknown miscreants, acting in concert, vandalised Shama Restaurant located on Bareilly Road and other shops located nearby and the vehicles parked on the road, and also pelted stones at the shops situated at Peeli Kothi in Haldwani city, and beat the local tempo driver and other persons, and by issuing threats to kill, attempted to spoil the atmosphere of the city and affected peace/law and order,” the FIR said.\n\nStory continues below this ad\n\nThe FIR, registered under Sections 115(2)/ 125/191(1)/ 191(2)/324(4)/351(2) of the BNS, mentioned 40-50 unknown persons as accused.\n\nThe law-and-order situation in Nainital district has come under scrutiny of the High Court multiple times this year. When zila panchayat members were allegedly abducted to keep them from taking part in the election for chairperson, the High Court had said the Senior Superintendent of Police had “failed miserably”. Earlier, a sexual assault incident by a man against a minor had resulted in large-scale vandalism by a mob, which was also taken cognizance of by the High Court, which is based in Nainital.",
  "summary": "",
  "published": "Mon, 17 Nov 2025 14:42:13 +0000",
  "url": "https://indianexpress.com/article/india/nainitals-haldwani-shop-vandalised-mob-tensions-cattle-remains-school-10371093/",
  "source": "India | The Indian Express"
}