{
  "title": "Tesla's 'Nvidia moment’: Elon Musk’s answer is robots and ...",
  "text": "Tesla’s self-driving at scale\n\n\n\n\n\nElon Musk Becomes First Man To Have $500 Billion Wealth\n\nOptimus: Elon Musk’s bold bet\n\n\n\n\n\nNvidia’s benchmark\n\n\n\n\n\n\n\n\n\nTesla CEO Elon Musk recently outlined what he feels will trigger dramatic revaluation of the electric vehicle marker stock, drawing parallels to chip manufacturer Nvidia’s meteoric rise. Replaying to the question of a user on social media platform X (formerly known as Twitter) Musk gave an answer on Telsa’s meteoric rise. A user on X recently asked the Tesla CEO that when will Tesla experience its own ‘Nvidia moment’. Replying to the user, Musk said that the company’s breakthrough moment will come with unsupervised self-driving at scale and, even more significantly, with the mass production of its Optimus humanoid robot.Elon Musk stressed on the fact that valuation of Tesla will witness a shift once its Full Self-Driving (FSD) technology achieves widespread deployment without any human intervention. He also defended Tesla’s relativity modest AI training spend. Musk noted that the company’s vehicles can generate vast amount of real-world driving data which is used to refine the system.Former Tesla AI chief Andrej Karpathy recently praised the FSD system, describing a drive in his HW4 Model X as “basically flawless” and likening it to riding a magnetic levitation train.Tesla CEO Elon Musk has repeatedly touted Optimus the humanoid robot. Musk believes that Optimus is Tesla’s future growth engine. He feels that Optimus will represent more than 80% of Tesla’s long-term value. Along with this, he also made some sweeping predictions about the potential of Optimus. Musk said that Optimus could:* Help countries like Japan address labor shortages* “Eliminate poverty” and enable universal income* Even serve as an “incredible surgeon”, providing advanced medical care universallyMusk has gone so far as to call Optimus an “infinite money glitch”, underscoring his belief in its transformative economic impact.The comments made by Musk comes at a time when Nvidia surpassed $5 trillion in market value overtaking both Apple and Microsoft. Nvidia CEO Jensen Huang has projected $500 billion in revenue, calling it unprecedented visibility for a technology company. Nvidia’s success has become a benchmark for investors seeking the next big AI-driven valuation surge.",
  "summary": "Tesla CEO Elon Musk believes the company's stock will see a dramatic revaluation driven by unsupervised self-driving at scale and the mass production of its Optimus humanoid robot. Musk highlighted Tesla's unique data generation for AI training and envisions Optimus addressing labor shortages and even performing surgery, potentially representing over 80% of Tesla's long-term value.",
  "published": "Thu, 20 Nov 2025 17:22:50 +0530",
  "url": "https://timesofindia.indiatimes.com/technology/tech-news/elon-musks-answer-to-teslas-nvidia-moment-is-robots-and-/articleshow/125462257.cms",
  "source": "Times of India"
}