{
  "title": "Russian authorities detain suspect over St. Petersburg cafe blast",
  "text": "A Ukrainian tank is seen near the frontline area amid the Russia-Ukraine war, in Bakhmut, Ukraine, on April 02. (Muhammed Enes Yildirim/Anadolu Agency/Getty Images)\n\nThe Ukrainian military has reported little change to the front lines but heavy fire from Russian forces at various parts of the front line in the Donetsk region.\n\nThe General Staff said that more than 45 enemy attacks had been repelled over the past day, with the focus on Lyman, Bakhmut, Avdiivka and Mariinka.\n\nIt said there were 17 air strikes and more than 20 strikes by multiple launch rocket systems.\n\n“In the Bakhmut direction, the enemy is trying to take full control over the city of Bakhmut and continues to storm it,” the General Staff said.\n\nWest of the city, Ukrainian defense forces repelled about 20 enemy attacks, according to the General Staff.\n\nOleksandr Syrskyi, commander of Ukrainian Land Forces, posted on Telegram that in Bakhmut he had met with “soldiers and commanders who destroyed the myth of invincibility of the Wagner fighters and Russian paratroopers.”\n\n“The enemy is weakening and trying to cover up its failures with new fakes about the capture of Bakhmut,” Syrskyi said.\n\nSyrskyi referenced the possibility of a future counter-offensive, saying that “the forward movement of our entire army depends on what every soldier is doing right now on their section of the front.”\n\nSome of the most intense fighting is to the northwest and west of the city of Donetsk – as the Russians continue months-long efforts to dislodge Ukrainian defenses in Avdiivka and Mariinka. The General Staff said that some 20 assaults had been repelled.\n\n“There are also some operational successes of our military in the Donetsk area. Our military have taken some positions. They have taken a more strategic and favourable position,” said Oleksii Dmytrashkivskyi, spokesperson for the military in that zone.\n\nHe also noted that Russian special forces had been introduced in the area.\n\n“The enemy is trying to attack our positions between Avdiivka and Marinka. These attempts do not stop. It should be noted that the enemy has suffered quite significant losses,” Dmytrashkivskyi said.\n\nHe also claimed that the Russians “don’t have the same amount of equipment and, as they themselves say, they are on a ‘diet’ of ammunition for assaults.”\n\nSocial media video showed both sides engaged in heavy fire in the Avdiivka area, which the Russians have surrounded on three sides.\n\nDenis Pushilin, the leader of the self-declared Donetsk People’s Republic, claimed that Russian forces were still advancing in the Avdiivka direction.\n\n“It is still premature to speak of encirclement, but the situation is being created, if not critical, then extremely difficult for the enemy… After clearing Kamianka, our units are moving further. There are difficulties both with the terrain, which must also be overcome, and there are also similarities with weather conditions. But these difficulties are mutual — both for the enemy and for us,” Pushilin said.",
  "summary": "",
  "published": "",
  "url": "https://edition.cnn.com/webview/europe/live-news/russia-ukraine-war-news-04-03-23/index.html",
  "source": "CNN.com - RSS Channel - App International Edition"
}