{
  "title": "New research uncovers the massive squid diet of Hawaiian pilot whales",
  "text": "How many squid short-finned pilot whales (Globicephala macrorhynchus) living off Hawaiʻi must eat each day, and whether the surrounding waters can support their needs, are key questions for conservation. Understanding these fundamentals helps scientists assess the stability of whale populations. A research team from the USA, Spain, Australia and Denmark reports in the Journal of Experimental Biology that individual whales in Hawaiian waters consume between 82 and 202 squid per day. When scaled up to the regional population, this adds up to about 88,000 tonnes of squid annually. Fortunately, this level of consumption remains small compared to the vast squid resources in the area.\n\nHow much energy a species must take in each day is an important indicator of its vulnerability if food becomes scarce. For short-finned pilot whales, which routinely plunge to depths of up to 1700m in search of squid, this information is especially valuable.\n\n\"These animals have been studied in locations around the world, but relatively little is known about them in Hawaiian waters,\" says William Gough (University of Hawaiʻi at Mānoa, USA). He and his colleagues set out to determine exactly how much squid Hawaiian short-finned pilot whales rely on.\n\nTagging Pilot Whales to Track Deep Diving Behavior\n\nTo gather the data, the team traveled into offshore waters and placed suction-cup tags on eight whales. Each tag recorded extensive information, including motion data, video footage from a lighted camera, hydrophone audio of echolocation clicks, and GPS coordinates.\n\n\"Short-finned pilot whales are fairly small and quick, so we really have to pick our moment,\" recalls Gough. He explains that the ideal position for the tag was directly behind the blowhole and oriented toward the head so it could capture feeding activity during deep dives.\n\nTo estimate each animal's size, the researchers also used a drone positioned 25m above the whales as they swam.\n\nEnergy Use During Dives and How It Translates to Squid Needs\n\nAfter retrieving the tags, which sometimes drifted as far as 50 miles before being recovered, Gough and his team documented 118 deep dives, with the whales reaching depths of up to 864m and averaging about 39 dives per day.\n\nBy analyzing tail-beat patterns as the whales descended, the researchers determined that the animals expend 73.8kJ/min during dives and 44.4kJ/min while resting at the surface. This led to a key question: how many squid must a whale consume to meet this daily energy demand?\n\nBy listening for distinct echolocation signals that indicate a whale catching a squid, the team estimated an average of about 4 squid captured per dive. Each squid provides roughly 560kJ of digestible energy.\n\nFrom these calculations, Gough concluded that a single whale needs between 82 and 202 squid each day, adding up to around 73,730 squid per whale per year.\n\nScaling Up to the Full Hawaiian Population\n\nTo understand broader ecological impact, the scientists then estimated the total squid intake for the regional whale community. With up to 8,000 short-finned pilot whales living around Hawaiʻi, the combined consumption reaches approximately 88,000 tonnes of squid annually. Despite the enormous scale of these numbers, the scientists report that the squid populations in Hawaiian waters are robust enough to support this demand.\n\n\"These results show that short-finned pilot whales are in relatively good shape in Hawaiʻi, having found an abundant and reliable source of food,\" says Gough, who remains optimistic about the species' outlook in the region.",
  "summary": "Hawaiian short-finned pilot whales are surprisingly voracious hunters, diving hundreds of meters beneath the Pacific to snatch squid in the dark. By tagging and tracking eight whales, researchers uncovered just how much energy these deep-sea forays require—and how many squid the whales must eat to stay fueled. Their calculations reveal that each whale downs dozens to hundreds of squid per day, adding up to a staggering 88,000 tonnes of squid consumed annually by the whole population.",
  "published": "Mon, 17 Nov 2025 02:45:37 EST",
  "url": "https://www.sciencedaily.com/releases/2025/11/251116105519.htm",
  "source": "All Top News -- ScienceDaily"
}