{
  "title": "Pancreatic cancer spreads to liver or lung thanks to this protein",
  "text": "A protein called PCSK9 determines how pancreatic cancer cells metastasize to different parts of the body.\n\nScientists at UC San Francisco have discovered how pancreatic cancer cells thrive in the lungs or liver, environments that are as distinct to cells as the ocean and desert are to animals. The spread of cancer cells to organs like these often produces the very first symptoms of pancreatic cancer. But by that time, the pancreatic cancer has spread out of control.\n\nThe findings, published May 21 in Nature, create new opportunities to treat pancreatic cancer, which is notoriously resistant to many therapies. The study was funded in part by the National Institutes of Health (NIH), the National Science Foundation (NSF), and the American Association for Cancer Research.\n\nIn the study, researchers wanted to know what allowed cells to survive in one place instead of the other. To do this, they analyzed data from MetMap, a project at the Broad Institute, an independent research organization, to find pancreatic cancer cell lines that had a tendency to colonize either the lung or the liver. Then, they looked for genomic differences that could reveal why, or even how, these cells preferred one organ over the other.\n\nTheir analysis turned up a protein called PCSK9 that controls how cells obtain cholesterol. When PCSK9 levels are low, pancreatic cancer cells consume nearby cholesterol, which is abundant in the liver. When PCSK9 levels are high, the cancer cells produce their own cholesterol. They also make molecules that protect them from damage by oxygen, a perfect adaptation to survival in the lungs.\n\nWhen the team forced pancreatic cancer cells that were destined for the liver to express PCSK9, the cells made a detour to the lungs.\n\n\"Cancers persist by adapting to live in new tissues and organs, and we found that pancreatic tumors use PCSK9 to adapt as they spread,\" said Rushika Perera, PhD, the Deborah Cowan Endowed Associate Professor of Anatomy at UCSF and senior author of the paper. \"It opens the door to fighting metastatic cancer growth by manipulating how cells acquire their cholesterol.",
  "summary": "Scientists have discovered how pancreatic cancer cells thrive in the lungs or liver, environments that are as distinct to cells as the ocean and desert are to animals. The spread of cancer cells to organs like these often produces the very first symptoms of pancreatic cancer. But by that time, the pancreatic cancer has spread out of control.",
  "published": "Tue, 03 Jun 2025 14:11:56 EDT",
  "url": "https://www.sciencedaily.com/releases/2025/06/250603141156.htm",
  "source": "Latest Science News -- ScienceDaily"
}