{
  "title": "India’s Longest CM List: Ten oaths, but Nitish Kumar still not the longest-serving Chief Minister",
  "text": "Longest Serving Chief Ministers in India: Nitish Kumar took oath as the Chief Minister of Bihar for the record 10th time on Thursday, days after the NDA, including Janata Dal (United), Bharatiya Janata Party and others, swept the Assembly elections with a record 202 seats. Despite his long run in office, Nitish doesn’t cut the top five longest-serving chief ministers. He ranks eighth, behind Pawan Kumar Chamling, Naveen Patnaik, Jyoti Basu, Gegong Apang, Lal Thanhawla, Virbhadra Singh and Manik Sarkar.\n\nPawan Kumar Chamling (Sikkim): Tenure – 24 years, 165 days\n\n1994 – 2019 (Continuous)\n\nPawan Chamling led Sikkim for over 24 years (1994–2019), becoming the longest-serving Chief Minister in India. A five-term chief minister from the Sikkim Democratic Front, he oversaw a period of political stability in the state. Chamling is often credited for pushing Sikkim into the country’s first 100% organic state.\n\nNaveen Patnaik (Odisha): Tenure- 24 years, 99 days\n\n2000 – 2024 (Continuous)\n\nNaveen Patnaik governed Odisha continuously for 24 years (2000–2024), making him one of India’s most enduring CMs. Founder of the Biju Janata Dal, he built a reputation for clean, low-key governance. The disaster-management model, under him, especially during cyclones, won national and global repute.\n\n\n\nJyoti Basu (West Bengal): Tenure- 23 years, 137 days\n\n1977 – 2000 (Continuous)\n\nJyoti Basu served as West Bengal Chief Minister for 23 years (1977–2000), one of the longest continuous terms in the country.\n\nBasu, the late CPI(M) leader, headed the Left Front government through successive mandates. He became a national figure, known for ideological clarity. He famously declined the prime ministerial post in 1996, calling it a “historic blunder” later.\n\nGegong Apang (Arunachal Pradesh): Tenue- 22 years, 250 days\n\nMultiple stints (1980s, 1990s, 2000s)\n\nGegong Apang ruled Arunachal Pradesh for over 22 years across multiple tenures, spanning from the 1980s to the 2000s. Apang, who was primarily associated with the Congress, later shifted political affiliations to the BJP.\n\nHe is considered one of the Northeast’s most prominent political survivors.\n\nStory continues below this ad\n\nLal Thanhawla (Mizoram): Tenure- 22 years, 60 days\n\nMultiple stints (1980s, 1990s, 2000s, 2010s)\n\nLal Thanhawla served as Mizoram CM for over 22 years across five non-consecutive terms.\n\nA senior Congress leader, he dominated state politics from the 1980s to 2018. Thanhawla is among the most experienced leaders to emerge from the Northeast.\n\nVirbhadra Singh (Himachal Pradesh): Tenure- 21 years, 13 days\n\nMultiple stints (1980s, 1990s, 2000s, 2010s)\n\nVirbhadra Singh held the office for over 21 years as CM across six terms, making him Himachal’s defining political figure. A Congress stalwart, he held sway over the state’s politics for nearly four decades. Singh’s legacy remains deeply tied to the Congress’s dominance in the hill state.\n\nManik Sarkar (Tripura): Tenure- 19 years, 363 days\n\n1998 – 2018 (Continuous)\n\nStory continues below this ad\n\nManik Sarkar governed Tripura for almost 20 years (1998–2018), one of the longest uninterrupted tenures in India. A CPI(M) stalwart, with a reputation of the “cleanest” CM with an austere lifestyle, is credited for emphasising welfare, literacy and public distribution reforms during his tenure. Sarkar’s fall in 2018 ended two decades of Left rule in the state.\n\nNitish Kumar (Bihar): Tenure- Approx. 19 years, 93 days\n\nMultiple stints (including his 10th term)\n\nThe 9-time chief minister of Bihar, Nitish Kumar, took oath for the 10th time at the Rajbhavan on Thursday. Nitish has been serving the chair since 2005, excluding the short period in 2014, when he installed Jitan Ram Manjhi to the post, after his party suffered a massive loss in the 2014 general elections.",
  "summary": "",
  "published": "Thu, 20 Nov 2025 06:50:48 +0000",
  "url": "https://indianexpress.com/article/india/ten-oaths-nitish-still-not-the-longest-serving-chief-minister-10375821/",
  "source": "India | The Indian Express"
}