{
  "title": "How does the disposable vape ban work, and how harmful is vaping?",
  "text": "How does the disposable vape ban work, and how harmful is vaping?\n\n9 September 2025 Share Save Share Save\n\nPeter Dazeley/ Getty Creative Disposable vapes have been found to damage the environment\n\nIt has been illegal for businesses to sell or supply disposable vapes in the UK since June. The government said the ban would reduce environmental damage and help cut the number of children and young people vaping.\n\nHow does the disposable vape ban work?\n\nThe ban on disposable vapes applies to both shops and online retailers. Those caught breaking the law in England face a minimum £200 fine, with a prison sentence of up to two years for repeat offences. Penalties are broadly similar in Scotland, Wales and Northern Ireland. Trading Standards can seize any single-use vapes being sold. Only reusable devices can be legally sold. They must have a rechargeable battery, a replaceable coil, and be refillable. Vapes should be returned to stores or recycling centres for specialist handling.\n\nHowever, waste firm Biffa told the BBC it had seen an increase in the number of vapes incorrectly mixed in with general recycling since the ban. It said this has caused an increase in fires. Vapes contain lithium-ion batteries, which can catch fire when crushed in bin lorries or at recycling centres. Biffa said it dealt with 60 fires caused by vapes and other small electrical items in June alone. Another of the UK's largest waste firms, Veolia, said vapes and other battery-operated items cause a fire every day in its lorries and facilities.\n\nBiffa A suspected vape fire at a recycling facility in Aldridge, Staffordshire in January\n\nWhy are disposable vapes bad for the environment?\n\nAlmost five million single-use vapes were thrown away each week in 2023, according to the Department for Environment, Food, and Rural Affairs (Defra). Vapes contain circuit boards which can leak toxic compounds such as cobalt and copper if they are not disposed off correctly, posing a risk to fish and marine mammals. These minerals and the lithium could - if properly recovered - be reused for green technologies such as electric car batteries or in wind turbines. However, recycling vapes is not straightforward because of their size and the way they are manufactured, making them difficult to take apart.\n\nHow else are vaping rules changing?\n\nVaping tax Vaping products are already subject to 20% VAT but, unlike tobacco, they do not attract a separate additional tax. However, a new vaping duty will start on 1 October 2026. It will be charged at a flat rate of £2.20 per 10ml vaping liquid. At the same time, tobacco duty will be increased to preserve the financial incentive for cigarette smokers to switch to vaping. The government's Tobacco and Vapes Bill - which is currently making its way through Parliament - will outlaw vape advertising and sponsorship. It will also restrict the flavours, packaging and display of vapes and other nicotine products. The British Medical Association (BMA) argued that vapes' bright colours and flavours such as bubble gum or candy floss made them attractive to children. Illegal vapes The government is also cracking down on iIlegal vapes, which are widely available and are much more likely to contain other harmful chemicals or drugs. More than six million illegal vaping products were seized by Trading Standards officers across England between 2022 and 2024, according to analysis by the BBC.\n\nHow many children and adults vape?\n\nAlthough it is illegal to sell or supply vapes to under-18s, the number of children vaping has increased sharply in recent years. Around 20% of 11 to 17-year-olds (1.1 million) in Great Britain have tried vaping, according to a 2025 survey by health charity ASH (Action on Smoking and Health). About 7% (400,000 children) said they currently vaped, with 3% (160,000) saying they vaped daily. Older children were more likely to vape. ASH found 2.8% of 11 to 17-year-olds said they smoked cigarettes and vaped.\n\nGetty Images The NHS says vaping should only be for adults quitting smoking\n\nAccording to the ASH survey, 10% of over-18s in Great Britain said they vaped, an estimated 5.5 million people. This was down slightly from 2024, suggesting vape use may be levelling off. Some 13% adults said they smoked, which has been at the same level since 2021. The survey found that 55% of current vapers were ex-smokers, while 40% still smoked.\n\nHow harmful are vapes to children and adults?",
  "summary": "The disposable vape ban is designed to reduce environmental damage and protect children's health.",
  "published": "Tue, 09 Sep 2025 11:56:48 GMT",
  "url": "https://www.bbc.com/news/articles/czxyny0w7wdo?at_medium=RSS&at_campaign=rss",
  "source": "BBC News"
}