{
  "title": "‘I think my mum’s going to like it’: Alexander Skarsgård on his gay biker ‘dom-com’ Pillion",
  "text": "Harry Melling knows the secret to being a good boot-licker. “You want to give a decent, satisfying, sexy lick,” says the 36-year-old actor, who has the umlaut eyes and nasal tones of Nicholas Lyndhurst. “Once you get to the toe-cap, you need to make sure they can really feel your tongue through the leather.”\n\nMelling, barely recognisable from his childhood role as wretched Dudley Dursley in the Harry Potter films, learned this new skill while preparing for the award-winning BDSM romcom Pillion. He plays Colin, a timid traffic warden who becomes the willing submissive to a taciturn biker named Ray. Listening intently to Melling’s boot-licking tips in this London hotel room are his Pillion partners-in-kink: Harry Lighton, the film’s 33-year-old writer-director, whose flat cap and smirk lend him a roguish look, and Alexander Skarsgård, 49, who plays Ray, and is dressed today in a slobby ensemble – red sweatshirt, blue tracksuit bottoms, black shoes – that fails to spoil his pin-up prettiness.\n\nIn the name of research, Melling and Lighton hung out with the Gay Bikers Motorcycle Club (GBMCC), some of whom appear in the film as members of Ray’s gang. “The organisation crosses over into leather culture but it isn’t focused on sex,” says Lighton. “We supplemented them in the film with people from the kink community. Have I told you about the weekend I spent with the GBMCC?” No, I tell him: we’ve never met before. “Yes, we have,” he jokes. “You just don’t remember.” Skarsgård chips in: “Harry was wearing a mask.”\n\nAs part of his GBMCC weekend, Lighton was taken on an eight-hour pillion ride. “I wanted to look hot but they gave me these dumpy safety leathers instead. I looked like a spaceman. My main preoccupation was that I wasn’t getting the Grindr photos I’d hoped for.” What did he have to do to prove his commitment to the bikers? His eyes twinkle: “Suck dick,” he says.\n\nWhile Lighton was speeding around the UK on the back of a bike and Melling was licking boots, Skarsgård was doing … not much. “I didn’t create any backstory,” he says. “It was great!” Colin discovers next to nothing about Ray, and neither do we: he is an enigma wrapped in a riddle and zipped into motorcycle leathers. “The material lent itself to just showing up and doing it,” the actor continues.\n\nView image in fullscreen Alexander Skarsgård as Ray in Pillion. Photograph: Courtesy of Picturehouse Entertainment\n\nThat may explain the tingling electricity between the two leads. “In our last scene together, there’s a look Alex gives me which I was not anticipating,” says Melling. “I almost felt as if I saw through Ray in some sense. It was a revelation. What happened still feels massively mysterious to me.”\n\n“I can dispel the mystery right now,” Skarsgård says matter-of-factly. “We shot that on a Friday afternoon and I had an evening flight back to Stockholm for the weekend. So the look was, like, ‘Dude. Don’t fuck this up. I’ve got to be in the car to Heathrow in three minutes.’” Spoken like a true dom.\n\nBefore production began, Lighton sent Melling a 20-page starter pack of references and images to help with playing Colin. Was there a Beginner’s Guide to Ray as well? Skarsgård looks blank.\n\n“I did send you one,” the film-maker says, “but I never heard back.”\n\nSkarsgård narrows his eyes. “Did you get a thank-you note from my assistant?” he asks, prompting much laughter.\n\n“I sent it direct to you,” Lighton replies, a touch forlornly. Then he turns to Melling. “You read yours,” he says.\n\n“Oh, you’re such a good boy,” sneers Skarsgård.\n\n“I’m a sub,” Melling says, smugly.\n\n“Well, I was already in my dom mode,” his co-star shoots back. “I was like: ‘I’m not reading this. Fuck off!’ That was my character development.”\n\nView image in fullscreen Harry Melling as Colin. Photograph: Ana Blumenkron/Courtesy of Picturehouse Entertainment\n\nOne of the miracles of Pillion is that it makes good on the promise of Lighton’s short films, including 2016’s Sunday Morning Coming Down (teenager finds a seaside glory hole) and 2017’s Wren Boys (same-sex marriage in prison), which had already earned him a reputation as a stylish queer storyteller. He was planning to make his debut feature about sumo wrestling when a producer sent him a copy of Adam Mars-Jones’s transgressive novella Box Hill, winner of the 2019 Fitzcarraldo Editions novel prize, with a view to adapting it. In the book, subtitled A Story of Low Self-Esteem and set in the 1970s, Colin is an 18-year-old closeted virgin when he trips over Ray in the Surrey beauty spot previously associated with the picnic scene in Jane Austen’s Emma. (There’s a picnic in Pillion, too, though the meat on offer is very different from the “cold collation” served in Austen’s novel.)\n\nIn the book, Colin is raped by Ray. Love then grows over the abuse like a cataract. “It has aspects of Stockholm syndrome,” Lighton says. For the film, he updated the setting, altered key details (Colin is now out and in his 30s) and removed the rape. “I wanted Ray to get consent from Colin in that first sexual encounter.”\n\nHe is referring to the blowjob that takes place in a dark alley near Primark on Christmas Day, with Colin kneeling in front of the strapping, impassive biker. “The three of us discussed that scene a lot,” recalls Skarsgård. “We tried a version that felt aggressive, but we all wanted to pull back from that.” Melling leans in. “I’m so glad we did,” he says, “because in terms of Colin’s entry point into the relationship, it opens up a whole other avenue.” Skarsgård takes up the idea: “Yeah, the audience needs to be with Colin on this, and not feel he was raped in an alley.” No one could accuse the film of stinting on raunchiness, but Lighton did make one snip to that scene. “Originally, there was a closeup of Ray’s bell-end,” he says. “But it would have punctured the tension and raised a laugh.”\n\nIn various drafts of the script, Lighton tried transposing the action to ancient Rome, or a modern-day cruise ship. I heard he even wrote a version set in space. “That’s not true,” he says. “But it could be great.” Skarsgård sounds excited: “BDSM in space suits! I love that. The only problem would be once they start to unzip … Brrffft!” He mimes his internal organs being sucked out. “Also, it would be quite hard to overpower someone in zero gravity,” says Lighton, cooling on the idea.\n\nWhy drive so far around the houses only to end up back with a queer motorcycle gang, just like in Box Hill? “I loved the DNA of the novel, but because it was my first film, I wanted to bend it out of shape to see how I could make it mine. Hubris took me to ancient Rome. It’s also how my writing process works; I get frustrated by something and chuck it all up in the air.”\n\nBesides, it’s not as if Pillion-with-gladiators is his maddest idea. Five years ago, he had a meeting with producers after being out late the night before. Bereft of inspiration, he reached for one of his childhood crushes: Groundskeeper Willie from The Simpsons. “He’s super buff and he’s got that big beard. I remember when he took his shirt off, I was, like: ‘That’s my guy.’ So I pitched them the live-action version of Groundskeeper Willie starring Michael Fassbender. They were kind of interested but they thought there might be a rights issue.” No kidding.\n\nLighton’s circuitous adaptation process did at least help him solve what he considered a narrative problem: Ray’s death, two-thirds of the way through the book. “It was only through writing the cruise ship version that I discovered I didn’t want to kill him off.” Film Ray survives. But what of Colin’s low self-esteem? “I think that’s still there. He’s sexually nervous, lives with his parents and doesn’t like his job. The difference is there’s an aspect of self-hatred in the novel, whereas I wanted to shift that into self-doubt so that when he jumps off the cliff into this new life, the catalyst is more of a positive force than a negative one.”\n\nView image in fullscreen Photograph: Courtesy of Picturehouse Entertainment\n\nThe trailer even features an approving quote describing Pillion as “feelgood”. As well it might for a movie that embraces the kink community without shame or judgment. Lighton has little tolerance for the “No Kink at Pride” discourse which accompanied the drift of LGBTQ+ festivals into the mainstream. “Now that Pride is a family event, there’s this idea that kinks are unsuitable to be seen in public. But Pride began as a call to arms for queer people, so it’s the marginalised ones, the kinksters, who should be given pride of place, not the families with five-year-olds. I feel proud to have made a film that celebrates people who exist on the outskirts, and treats them with empathy.”\n\nSkarsgård agrees. “There’s a risk when you tell a story about a subculture that you can paint too rosy a picture,” he says. “But what I love about this is that it’s so confidently warts-and-all. It’s funny, it’s sexy and you believe in the characters. We never wanted to pander to straight audiences but I also think my mum’s gonna like the film. We didn’t make it for her but she can enjoy it.”\n\nOne audience member to whom Lighton is nervous about showing Pillion is his twin brother. Though he describes him as “my best mate”, there is some intriguing historical tension between them. Their father, Sir Thomas Lighton, is a baronet. “It’s just a title,” the director says, not sounding overjoyed to be asked about it. Did he grow up in a palace? “I didn’t. Sorry to disappoint.” The baronetcy will pass eventually to Lighton Sr’s eldest son – not Lighton but his twin, who was born six minutes before him.\n\n“When did you find out about the title?” asks Melling.\n\n“I was seven or eight,” he says. “I thought I might kill my brother because that’s what you read about in history books. It used to piss me off that he’d get ‘Sir’ and I’d get nothing.”\n\n“I can call you ‘Sir’ if you want,” offers Skarsgård.\n\nTrailer for Pillion.\n\n“I’d rather have a military title like ‘Sergeant’,” says Lighton. “That’s hotter. Being a ‘Sir’ is a bit of an ick. Anyway, I’m over it now.”\n\nThe evidence suggests otherwise. In the film, Lighton has saddled Colin with a twin brother “who’s a bit of a flannel”. There was also a twin in his first short, Sunday Morning Coming Down. “He was a bit of a dick as well,” he laughs. It might seem as if he has made amends by giving his brother a brief walk-on part in Pillion as an amateur footballer. “Although I did cut his head off in the shot.” That’s quite the power play. If there isn’t a film to be made about all of this, I’ll eat my biker boot.",
  "summary": "<p>In May, Cannes went weak at the knees for Harry Lighton’s tale of BDSM and bootlicking in suburbia. Ahead of its release, the director and his stars reveal the explicit shots snipped from the final cut and discuss why Pride has become too sanitised</p><p>Harry Melling knows the secret to being a good boot-licker. “You want to give a decent, satisfying, sexy lick,” says the 36-year-old actor, who has the umlaut eyes and nasal tones of Nicholas Lyndhurst. “Once you get to the toe-cap, you need to make sure they can really feel your tongue through the leather.”</p><p>Melling, barely recognisable from his childhood role as wretched Dudley Dursley in the Harry Potter films, learned this new skill while preparing for the award-winning BDSM romcom Pillion. He plays Colin, a timid traffic warden who becomes the willing submissive to a taciturn biker named Ray. Listening intently to Melling’s boot-licking tips in this London hotel room are his Pillion partners-in-kink: Harry Lighton, the film’s 33-year-old writer-director, whose flat cap and smirk lend him a roguish look, and Alexander Skarsgård, 49, who plays Ray, and is dressed today in a slobby ensemble – red sweatshirt, blue tracksuit bottoms, black shoes – that fails to spoil his pin-up prettiness.</p> <a href=\"https://www.theguardian.com/film/2025/nov/21/i-think-my-mums-going-to-like-it-alexander-skarsgard-on-his-gay-biker-dom-com-pillion\">Continue reading...</a>",
  "published": "Fri, 21 Nov 2025 05:00:03 GMT",
  "url": "https://www.theguardian.com/film/2025/nov/21/i-think-my-mums-going-to-like-it-alexander-skarsgard-on-his-gay-biker-dom-com-pillion",
  "source": "The Guardian"
}