{
  "title": "Researchers use deep learning to predict flooding this hurricane season",
  "text": "The 2025 hurricane season officially begins on June 1, and it's forecast to be more active than ever, with potentially devastating storms whose heavy rainfall and powerful storm surges cause dangerous coastal flooding.\n\nExtreme water levels -- like the 15 feet of flooding Floridians saw during Hurricane Helene in 2024 -- threaten lives, wash away homes, and damage ecosystems. But they can be difficult to predict without complex, data-intensive computer models that areas with limited resources can't support.\n\nA recent study published in Water Resources Research by civil and environmental engineering graduate student Samuel Daramola, along with faculty advisor David F. Muñoz and collaborators Siddharth Saksena, Jennifer Irish, and Paul Muñoz from Vrije Universiteit Brussel in Belgium, introduces a new deep learning framework to predict the rise and fall of water levels during storms -- even in places where tide gauges fail or data is scarce -- through a technique known as \"transfer learning.\"\n\nThe framework, called Long Short-Term Memory Station Approximated Models (LSTM-SAM), offers faster and more affordable predictions that enable smarter decisions about when to evacuate, where to place emergency resources, and how to protect infrastructure when hurricanes approach. For emergency planners, local governments, and disaster response teams, it could be a game-changer -- and could save lives.\n\nAddressing the challenge of predicting floods with transfer learning\n\nPredicting when and where extreme water levels will strike -- especially during compound floods, when multiple flooding sources, like rain and storm surge, combine to intensify flooding -- is crucial for protecting vulnerable communities.\n\nHowever, conventional physical-based models rely on detailed information about weather patterns, ocean conditions, and local geography. Gathering and processing this data is time consuming and expensive, limiting the models' use to areas with long-term data records and high-powered computers.\n\nTo overcome these limitations, the research team developed LSTM-SAM, a deep-learning framework that analyzes patterns from past storms to predict water level rise during future storms. What makes this model especially useful is its ability to extrapolate from one geographic area's data to make predictions for another locale that doesn't have a lot of its own data. By borrowing knowledge and applying it locally, it makes accurate flood prediction more widely available.\n\n\"Our goal was to create an efficient transfer learning method that leverages pre-trained deep learning models,\" said Daramola. \"This is key to quickly assessing many flood-prone areas after a hurricane.\"\n\nTesting with coastal flood predictions\n\nThe researchers tested LSTM-SAM at tide gauge stations along the Atlantic coast of the United States, a region frequently impacted by hurricanes and other major storms. They found that the model was able to accurately predict the onset, peak, and decline of storm-driven water levels. The model was even able to reconstruct water levels for tide-gauge stations damaged by hurricanes, such as the station in Sandy Hook, New Jersey, which failed during Hurricane Sandy in 2012.\n\nResearchers plan on using the LSTM-SAM framework during the upcoming hurricane season, where they can test it as storms roll in nearly in real time. They've also made the code available in the GitHub repository of the CoRAL Lab, where scientists, emergency planners, and government leaders can download it for free. The program runs on a laptop in a matter of minutes and could be especially helpful for smaller towns or regions in developing countries where access to high-end computing tools or detailed environmental data is limited.\n\n\"Other studies have relied on repetitive patterns in the training data,\" Daramola said. \"Our approach is different. We highlight extreme changes in water levels during training, which helps the model better recognize important patterns and perform more reliably in those areas.\"\n\nAs the frequency of hurricane events and their socioeconomic impact is likely to increase in the future, the need for reliable flood prediction frameworks is of paramount importance. Advanced deep learning tools like LSTM-SAM could become essential in helping coastal communities prepare for the new normal, opening the door to smarter, faster, and more accessible flood predictions associated with tropical cyclones.\n\nOriginal study: DOI 10.1029/2024WR039054\n\nThis research was made possible by support from the National Science Foundation, CAS-Climate Program, and the Virginia Sea Grant Fellowship.",
  "summary": "Researchers have developed a deep learning model called LSTM-SAM that predicts extreme water levels from tropical cyclones more efficiently and accurately, especially in data-scarce coastal regions, to offer a faster, low-cost tool for flood forecasting.",
  "published": "Mon, 02 Jun 2025 15:49:01 EDT",
  "url": "https://www.sciencedaily.com/releases/2025/06/250602154901.htm",
  "source": "Latest Science News -- ScienceDaily"
}