{
  "title": "New research uncovers hidden divide in West Coast killer whales",
  "text": "New findings show that the transient killer whales living along the West Coast between British Columbia and California are actually divided into two separate subpopulations known as inner and outer coast transients.\n\nA study published in PLOS One used 16 years of information from more than 2,200 documented encounters to reevaluate long-standing ideas about these mammal-eating orcas. The results overturn earlier assumptions and point to a clear ecological split.\n\n\"I've been thinking about this possibility for 15 years,\" says first author Josh McInnes, who conducted the research as part of his masters at UBC's Institute for the Oceans and Fisheries (IOF). \"Now our findings show the West Coast transients are two distinct groups, split along an east-west divide. They eat different things, hunt in different areas and very rarely spend time with each other.\"\n\nEcotypes and Global Context\n\nKiller whales that frequent the West Coast fall into three recognized ecotypes: transients, residents and offshore. A fourth potential group, referred to as an 'oceanic' population, has also been proposed. Transients occur in six regions worldwide, and the West Coast transient population is the best studied, with its own identifiable genetic traits.\n\nResearchers previously suspected that this West Coast community might be divided along a north-south boundary. Instead, the new data reveal that the differences align more strongly with the inner and outer coastal environments these whales use.\n\n\"The inner coast killer whales are like city dwellers,\" said co-author Dr. Andrew Trites, IOF professor and director of the Marine Mammal Research Unit. \"They're experts at navigating busy, maze-like streets of nearshore inlets, bays and sheltered waterways -- whereas the outer coast killer whales are more like backcountry dwellers thriving in deep canyons and rugged underwater terrain along the edge of the continental shelf.\"\n\nSocial Network Mapping and Movement Patterns\n\nTo investigate these patterns, the research team analyzed social interactions using photo identification collected between 2005 and 2021. Images from scientific surveys and public sightings allowed researchers to match individuals and determine which whales were regularly seen together. \"We essentially drew friendship maps to see which whales spent time together, and then looked at where they were seen to figure out if they hung out in specific neighborhoods,\" said Dr. Trites.\n\nThe team found that inner coast transients, estimated at roughly 350 individuals, typically stayed about six kilometers from shore in relatively shallow areas such as the Salish Sea. Their diet centered on smaller marine mammals including harbor seals and harbor porpoises, and they usually traveled and foraged in groups of about five.\n\nOuter coast transients, numbering about 210 animals, were most often found within 20 kilometers of the continental shelf break, particularly near submarine canyons. These whales ventured as far as 120 kilometers offshore and covered large distances. Their prey included larger species such as California sea lions, northern elephant seals, gray whale calves and Pacific white-sided dolphins, and they typically hunted in groups averaging nine individuals.\n\nThe clear contrasts between the two groups may reflect the distinct marine environments they occupy or may be influenced by human activity in these regions, including the reduction or harvesting of key prey species.\n\nRare Interactions Between the Two Groups\n\nAlthough both groups use a broad range that stretches from Southeast Alaska to southern California, they rarely interact. Less than one per cent of sightings involved both groups at the same time. \"I have seen outer coast transients acting strangely around inner coast animals,\" said McInnes, co-founder of the Oceanic Research Alliance. \"One of the sightings reported a group of single male outer coast orcas slapping each other with their dorsal fins and charging at inner coast females.\"\n\nBecause offshore research is particularly challenging, scientists note that more subpopulations may exist in remote regions that have not yet been thoroughly surveyed.\n\nThe authors stress that their findings highlight how these transient killer whales move across jurisdictional boundaries and how conservation planning needs to account for their differing lifestyles. \"These two communities of transient killer whale inhabit very different worlds and lead distinctly different lives,\" said Dr. Trites. \"Protecting them will take more than a one-size-fits-all approach. Each needs a tailored plan that reflects their unique needs and the specific threats they face.\"",
  "summary": "Scientists confirmed that West Coast transient killer whales actually form two separate groups split between inner and outer coastal habitats. Inner-coast whales hunt smaller prey in shallow, maze-like waterways, while outer-coast orcas pursue large marine mammals in deep offshore canyons. The groups rarely interact, despite sharing a broad range along the Pacific Coast. Their contrasting lifestyles highlight the need for distinct conservation strategies.",
  "published": "Thu, 20 Nov 2025 23:40:28 EST",
  "url": "https://www.sciencedaily.com/releases/2025/11/251120002604.htm",
  "source": "All Top News -- ScienceDaily"
}