{
  "title": "Ottawa officials to cull ‘mindblowing’ influx of thousands of goldfish in pond",
  "text": "City officials in Canada’s capital city, Ottawa, plan to cull thousands of feral goldfish from a stormwater pond, a decision that reflects the pervasive spread of the species throughout the region.\n\nEarlier in the year, city staff removed 5,000 fish from the city’s Celebration Park. But as many as 1,000 more are believed to still be living in the water.\n\nUnder Ontario’s ministry of natural resources and forestry guidelines, fish can be euthanized through percussive stunning, electrical stunning or pithing.\n\n“The fact that we’ve had approximately 6,000 fish in this pond, in this year, is mind-blowing,” councillor Riley Brockington, who represents the area, told CBC News.\n\n“It’s just a number that’s difficult for me to wrap my head around.”\n\nFemale goldfish produce large amounts of offspring, with a single mature fish able to lay more than 100,000 eggs.\n\nView image in fullscreen Celebration pond in Ottawa Central Park neighbourhood. Photograph: Google Maps\n\nCarleton biology professor Steven Cooke told the national broadcaster the actual population of the Celebration Park shoal could far exceed official estimates, speculating that there could be millions of tiny young goldfish in the pond, undetected.\n\nThe scourge of goldfish – a species native to Asia and most commonly found in fish tanks – has become a growing problem as the fish are deliberately released by pet owners into increasingly warm waters.\n\nGoldfish can grow to immense sizes in large bodies of water, have few predators and reproduce rapidly. They displace native species and harm plant growth by churning up waters of ponds.\n\nWarming water temperatures from a changing climate have also created more hospitable environments for the populations as they spread through local waterways and into the Great Lakes.\n\nAuthorities in the Canada and the US have pleaded with aquarium owners to stop releasing pet fish into waterways. In Minnesota, officials removed nearly 50,000 goldfish from local waters. They warned that fish which might be only two or three inches long when they are released can grow to more than 1ft long.\n\nShelby Riskin, an ecologist at the University of Toronto, said that stormwater ponds have increasingly become a breeding ground for the cast-off fish and present a challenge when trying to restore local ecosystems.\n\n“There are these flooded areas - and I’m thinking of one in [Toronto’s Don Valley] that can seem no larger than a puddle - and yet at certain times of the year it’s just filled with goldfish,” she said.\n\nThe fish can thrive in turbid, oxygen-depleted environments, often outlasting and outcompeting local species.\n\n“You look and and just see the toxic vape packets floating by these animals. It often feels like that Jeff Goldblum quote from Jurassic Park – life really does always find a way.”",
  "summary": "<p>Scourge of goldfish has become growing problem as fish are released by pet owners into increasingly warm waters</p><p>City officials in <a href=\"https://www.theguardian.com/world/canada\">Canada</a>’s capital city, Ottawa, plan to cull thousands of feral goldfish from a stormwater pond, a decision that reflects the pervasive spread of the species throughout the region.</p><p>Earlier in the year, city staff removed 5,000 fish from the city’s Celebration Park. But as many as 1,000 more are believed to still be living in the water.</p> <a href=\"https://www.theguardian.com/world/2025/nov/20/ottawa-canada-goldfish\">Continue reading...</a>",
  "published": "Thu, 20 Nov 2025 17:07:15 GMT",
  "url": "https://www.theguardian.com/world/2025/nov/20/ottawa-canada-goldfish",
  "source": "The Guardian"
}