{
  "title": "Khashoggi’s widow wants the U.S. to pressure Saudi Arabia to return his remains.",
  "text": "President Trump at a dinner on Tuesday during the Saudi crown prince’s visit to Washington.\n\nThe world’s richest man. One of the world’s most famous soccer players. The president of soccer’s governing body. Dozens of executives from the finance, tech and energy sectors.\n\nThese are some of the guests who attended President Trump’s black-tie dinner for Crown Prince Mohammed bin Salman of Saudi Arabia at the White House on Tuesday evening.\n\nThe red carpet welcome for Prince Mohammed is an extraordinary moment in diplomatic relations with Saudi Arabia. It is his first visit to the United States since the 2018 killing of the Washington Post columnist Jamal Khashoggi, which U.S. intelligence determined the prince ordered. Prince Mohammed has denied involvement.\n\nAfter Mr. Khashoggi’s murder, some Western business executives and government officials backed out of Saudi Arabia’s global investment conference, including leaders of major American financial institutions. But by the following year, top deal makers were back at the event in Riyadh, the Saudi capital.\n\nOn Tuesday, Mr. Trump and the crown prince cast their partnership as one that would reap benefits for both countries. Already, Mr. Trump has agreed to sell F-35 fighter jets to the kingdom, and the prince has promised to invest nearly $1 trillion in the United States.\n\nA White House official shared a list of guests. Here are some of the notable attendees at the dinner, many of whom had business ties with Saudi Arabia:\n\nSoccer royalty\n\nImage Cristiano Ronaldo, a Portuguese national, is currently playing with the club team Al-Nassr in the Saudi Pro League. Credit... Kenny Holston/The New York Times\n\nCristiano Ronaldo\n\nMr. Ronaldo, 40, is one of the most famous soccer players in the world, and has won multiple accolades throughout a professional career that began in 2002.\n\nTies to Saudi Arabia: Mr. Ronaldo, a Portuguese national who has played in leagues in England, Spain and Italy, is currently plying his trade with the club team Al-Nassr in the Saudi Pro League. The Saudi government has invested billions of dollars over the years to attract world-class players, and Mr. Ronaldo is the league’s highest-paid player.\n\n— Minho Kim and Ryan Mac\n\nGianni Infantino\n\nMr. Infantino is the head of FIFA, international soccer’s governing body, and has served in the role for nearly 10 years. He has grown close to Mr. Trump as the United States prepares to co-host the World Cup in 2026.\n\nTies to Saudi Arabia: Mr. Infantino is also close to Prince Mohammed, and helped award Saudi Arabia the World Cup in 2034. FIFA’s president openly campaigned for the Saudi World Cup bid, pushed for Saudi investment in the sport and created rules for World Cup hosts that all but ensured that the Gulf State would get to hold the event.\n\n— Ryan Mac\n\nTech moguls\n\nImage Elon Musk has had a frosty relationship with Saudi leaders that has thawed in recent months. Credit... Kenny Holston/The New York Times\n\nElon Musk\n\nMr. Musk, the world’s richest man, is making his first visit to the White House since he left his role in the administration in dramatic fashion, lashing out at Mr. Trump. The two have reached something of a détente in recent months.\n\nTies to Saudi Arabia: Mr. Musk has had a frosty relationship with Saudi leaders that has thawed in recent months. For years, the billionaire has blamed the Public Investment Fund, Saudi Arabia’s sovereign wealth fund, for pulling out of his failed effort to take Tesla private, and has criticized the state’s position on “journalistic freedom of speech.” But Mr. Musk has also accepted Saudi investment in X, his social media site, and xAI, his artificial intelligence company. Humain, a state-backed A.I. company in Saudi Arabia, has hinted it would do deals with xAI.\n\n— Theodore Schleifer and Ryan Mac\n\nImage During a visit to Saudi Arabia in late 2024, Tim Cook pledged to open Apple stores there by 2026. Credit... Doug Mills/The New York Times\n\nTim Cook\n\nMr. Cook, the chief executive of Apple, was also one of the tech moguls in attendance at Mr. Trump’s inauguration.\n\nTies to Saudi Arabia:Apple has spent over $2 billion with companies in Saudi Arabia over the past five years, and during a visit to the country in late 2024, Mr. Cook pledged to open Apple stores there by 2026. The company has faced some blowback for hosting a Saudi app that allows men to track the movement of their wives and daughters. In 2019, Mr. Cook said he would investigate the app, but it is still available today.\n\n— Adam Sella\n\nImage Michael Dell, the chief executive of Dell, has overseen significant business deals with Saudi Arabia. Credit... Evan Vucci/Associated Press\n\nMichael Dell\n\nMichael Dell is the chief executive of Dell, one of the world’s largest tech companies.\n\nTies to Saudi Arabia: Dell Technologies has done significant business in Saudi Arabia, including opening a fulfillment center in Damman earlier this year. The facility “marks a significant milestone in our commitment to supporting Saudi Arabia’s ambitious vision for the future,” a Dell executive said. The company also signed a memorandum of understanding in February with Aramco, the state-owned oil company, to “explore opportunities” in a number of areas, including artificial intelligence. The company has also signed a similar memorandum with the Saudi Data and Artificial Intelligence Authority.\n\n— Jesse Drucker\n\nChuck Robbins\n\nMr. Robbins is the chief executive of Cisco Systems, one of the largest makers of computer networking equipment\n\nTies to Saudi Arabia: In May, Mr. Robbins visited Saudi Arabia to secure a deal with Humain, a Saudi AI start-up, that was announced during Mr. Trump’s visit to the country. (Jeetu Patel, another executive at the company, also visited Saudi Arabia on behalf of the deal.) Cisco’s partnership with Saudi Arabia stretches back to early 2018, before Mr. Khashoggi was murdered, when Cisco agreed to work with the Saudi Telecom Company to bring a 5G network to the country.\n\n— Adam Sella\n\nImage Jensen Huang, the chief executive of Nvidia, traveled to Saudi Arabia with President Trump in May. Credit... Eric Lee for The New York Times\n\nJensen Huang\n\nMr. Huang is the chief executive of the A.I. chip behemoth Nvidia.\n\nTies to Saudi Arabia: Mr. Huang traveled to Saudi Arabia with Mr. Trump in May, where he announced a partnership between his company and Humain, a Saudi Arabian A.I. firm. As part of the deal, Nvidia will sell about 18,000 of its latest chips to help power new data centers. At the time, a larger contract for A.I. technologies was also being discussed.The deal has raised concern inside and outside the White House about whether China could acquire the advanced technology, and whether the gulf region could one day supplant the United States as A.I. leaders.\n\n— Adam Sella\n\nTareq Amin\n\nTareq Amin is the chief executive of the Saudi-backed artificial intelligence firm Humain, which received roughly $1 trillion in funding from the country’s sovereign wealth fund.\n\nTies to Saudi Arabia: Mr. Amin, a Jordanian American, was an executive at Aramco, Saudi Arabia’s state-run oil company, until he was asked to run the A.I. firm by Prince Mohammed. When Mr. Trump visited Riyadh in May, Humain was given a preliminary go-ahead to buy 18,000 A.I. chips from Nvidia.\n\n— Minho Kim\n\nLisa Su\n\nMs. Su is the chief executive of AMD, the major computer chips company.\n\nTies to Saudi Arabia: Alongside Humain, the Saudi state-backed A.I. company, AMD has committed billions of dollars to fund A.I. data centers in Saudi Arabia and the United States. The company has said that partnering with Humain has driven “U.S. leadership in the global A.I. race.”\n\n— Ryan Mac\n\nBusiness executives\n\nDavid Ellison\n\nDavid Ellison is the chief executive of Paramount Global, the parent company of CBS, MTV and Hollywood’s oldest movie studio.\n\nTies to Saudi Arabia: Mr. Ellison is trying to buy Warner Bros. Discovery in what would be a major multibillion dollar media deal. Mr. Ellison’s father, Larry Ellison, the co-founder of Oracle, is backing those efforts, but the Saudi sovereign wealth fund could be part of the deal.\n\n— Lauren Hirsch\n\nImage Mike Wirth is the chief executive of Chevron, which has extensive business ties with Saudi Arabia. Credit... George Etheredge for The New York Times\n\nMike Wirth\n\nMr. Wirth is the chief executive of Chevron, the second-largest U.S. oil company.\n\nTies to Saudi Arabia: Chevron has extensive business ties with Saudi Arabia, where one of its corporate ancestors, Standard Oil of California, began exploring for crude oil nearly a century ago. Chevron now produces oil and natural gas on the kingdom’s behalf in the neutral zone between Saudi Arabia and Kuwait. Such partnerships between U.S. oil companies and foreign governments or state-owned energy companies are quite common. Chevron, which said it has “a long history of productive cooperation in the kingdom,” also has financial interests in chemicals plants there, and buys Saudi oil.\n\n— Rebecca F. Elliott\n\nJane Fraser\n\nMs. Fraser is the chair and chief executive of Citi, a large consumer and investment bank that is based in New York but does business in 180 countries.\n\nTies to Saudi Arabia: Last month, Ms. Fraser was named the co-chair of the U.S. Saudi Business Council, which encourages business ties between the two countries. Her bank has a longstanding client relationship with the kingdom, for which it has advised on a variety of deals over the years. In the type of move that has been encouraged as part of Prince Mohammed’s economic plans, Citi last year obtained a license to establish its regional headquarters in Riyadh.\n\n\n\n— Kate Kelly\n\nImage Stephen A. Schwarzman has traveled frequently to Riyadh to meet with his Saudi investors. Credit... Nina Westervelt for The New York Times\n\nStephen A. Schwarzman\n\nMr. Schwarzman is the chief executive and co-founder of Blackstone, a large New York-based private equity firm.\n\nTies to Saudi Arabia: Blackstone, which manages $1.25 trillion in assets, has been doing business with Saudi Arabia for many years. During Mr. Trump’s first state visit to the kingdom in 2017, Blackstone announced that the sovereign wealth fund would make an investment of up to $20 billion for a project Blackstone was launching to invest in U.S. infrastructure. Over the years, Mr. Schwarzman has traveled frequently to Riyadh to meet with his Saudi investors and to participate in the kingdom’s annual investment conference. More recently, a Blackstone-backed company called Air Trunk announced plans to help build data centers in Saudi Arabia.\n\n— Kate Kelly\n\nBrendan Bechtel\n\nMr. Bechtel is the chief executive of Bechtel, one of the largest construction companies in the United States.\n\nTies to Saudi Arabia: Bechtel’s business is booming in Saudi Arabia. Mr. Bechtel wrote last week in a Saudi newspaper that his company had worked on 300 projects in Saudi Arabia, from the Riyadh Metro and the Trans-Arabian Pipeline to gold mines and the World Expo 2030 site. “Our partnership has lasted through technological change, global upheaval, and 14 U.S. presidents. And it is still going strong,” he wrote.\n\n— Adam Sella\n\nImage Mary Barra’s presence at the dinner may reflect a desire to maintain good relations with Mr. Trump. Credit... Brett Carlsen for The New York Times\n\nMary Barra\n\nMs. Barra is the chief executive of General Motors, the largest U.S. automaker.\n\nTies to Saudi Arabia: Saudi Arabia is the largest car market in the Middle East. G.M. sells Chevrolet, GMC and Cadillac vehicles in a market dominated by Japanese, Korean and, increasingly, Chinese brands. Her presence may also reflect a desire to maintain good relations with Mr. Trump. His tariffs on imported cars and parts have cost G.M. and other carmakers billions of dollars in profits.\n\n— Jack Ewing\n\nImage William Clay Ford Jr. is also likely interested in maintaining good relations with Mr. Trump. Credit... Jana Rodenbusch/Reuters\n\nWilliam Clay Ford Jr.\n\nMr. Ford is the executive chairman of Ford Motor.\n\nTies to Saudi Arabia: Ford recently revamped its management team in Saudi Arabia and has reported brisk growth in the Middle East’s largest car market. But Mr. Ford is probably most interested in maintaining good relations with Mr. Trump, whose tariffs and other policies have had a significant impact on Ford’s business.\n\n— Jack Ewing\n\nTrump family members\n\nImage Donald Trump Jr. helps lead the family business, the Trump Organization, with Eric Trump, his younger brother. Credit... Gabriela Bhaskar/The New York Times\n\nDonald Trump Jr.\n\nDonald Trump Jr. is Mr. Trump’s oldest son, and helps lead the family business, the Trump Organization, with Eric Trump, his younger brother.\n\nTies to Saudi Arabia: Mr. Trump served as a liaison to Gulf States, including Saudi Arabia, for his father’s presidential campaign in 2016. After Mr. Khashoggi’s murder in 2018, he also spread an unsubstantiated claim that Mr. Khashoggi had been a terrorist sympathizer. The Trump Organization has a long history of business dealings with Saudi Arabia, ranging from real estate deals in the Middle East to hosting Saudi-backed golf tournaments at Trump properties. Since Mr. Trump’s return to the White House, his sons have also secured a flurry of new real estate deals, including three new developments in Saudi Arabia. More talks are ongoing.\n\n— Minho Kim and Adam Sella\n\nThe full White House list of guests:\n\nThe president of the United States and Melania Trump, the first lady\n\nPrince Mohammed bin Salman Al Saud, crown prince and prime minister of Saudi Arabia\n\nMohammad Abunayyan, chairman of the board of directors of ACWA Power\n\nBill Ackman, chief executive of Pershing Square Capital Management, and Neri Oxman\n\nPrince Badr bin Abdullah Al Saud, minister of culture\n\nPrince Faisal bin Farhan Al Saud, foreign minister\n\nPrince Abdulaziz bin Salman Al Saud, minister of energy\n\nPrincess Reema bint Bandar Al Saud, ambassador to the United States\n\nMusaad bin Mohammad al-Aiban, national security adviser and minister of state\n\nAdwa al-Arifi, assistant minister for sport affairs\n\nSalman bin Yousef al-Dossary, minister of media\n\nKhalid al-Falih, minister of investment\n\nMohammed al-Jadaan, minister of finance\n\nMajid bin Abdullah al-Kasabi, minister of commerce\n\nJeremy Allaire, chief executive of Circle\n\nLubna al-Olayan, chairwoman of the Saudi British Bank\n\nAbdulrahman Rashed al-Rashed, Saudi businessman\n\nAbdulrahman Hamad al-Rashed, Saudi columnist and former media executive\n\nYasir bin Othman al-Rumayyan, governor of the Public Investment Fund of Saudi Arabia\n\nPrincess Haifa bint Mohammed Al Saud, vice minister of tourism\n\nMohammad bin Abdulmalik al-Sheikh, minister of state\n\nSarah al-Suhaimi, chair of the Saudi stock exchange, Tadawul\n\nAbdullah al-Swaha, minister of communications\n\nMohammed bin Mazyad al-Tuwaijri, adviser to the royal court\n\nTareq Amin, chief executive of Humain\n\nCristiano Amon, chief executive of Qualcomm, and Adriana Gamba Amon\n\nBrian Armstrong, chief executive of Coinbase\n\nBret Baier, Fox News host, and Amy Baier\n\nMary Barra, chief executive of General Motors, and Tony Barra\n\nMaria Bartiromo, Fox television host\n\nBrendan Bechtel, chief executive of Bechtel\n\nMarc Beckman, chief executive of DMA United\n\nMarc Benioff, chief executive of Salesforce\n\nTreasury Secretary Scott Bessent\n\nAttorney General Pam Bondi and John Wakefield\n\nAlbert Bourla, chief executive of Pfizer\n\nGreg Brockman, president of OpenAI, and Anna Brockman\n\nStefan E. Brodie and Elizabeth Brodie\n\nDoug Burgum, interior secretary\n\nGen. Dan Caine, chairman of the Joint Chiefs of Staff\n\nCharles Cascarilla, chief executive of Paxos\n\nDerek Chang\n\nTim Cook, chief executive of Apple\n\nLarry Culp, chief executive of GE Aerospace, and Wendy Culp\n\nBryson DeChambeau, professional golfer\n\nMichael S. Dell, chief executive of Dell Technologies, and Susan Dell\n\nHala Altuwaijri, president of the Human Rights Commission in Saudi Arabia\n\nDavid Ellison, chief executive of Paramount Global\n\nWilliam Clay Ford Jr., executive chairman of Ford Motor, and Lisa Ford\n\nJane Fraser, chief executive of Citigroup\n\nJamieson Greer, U.S. trade representative, and Marlo Greer\n\nCharles S. Hallab, chief executive of the U.S.-Saudi Business Council\n\nJosh Harris, owner of the Washington Commanders, and Marjorie Harris\n\nDefense Secretary Pete Hegseth and Jennifer Hegseth\n\nJensen Huang, chief executive of Nvidia, and Lori Huang\n\nGianni Infantino, president of FIFA\n\nSpeaker Mike Johnson and Kelly Johnson\n\nKhaled Juffali, Saudi businessman and board member of the Saudi Central Bank\n\nAbdullah bin Saleh Kamel, Saudi businessman\n\nVimal Kapur, chief executive of Honeywell\n\nAlex Karp, chief executive of Palantir Technologies\n\nArvind Krishna, chief executive of IBM\n\nChristopher Landau, deputy secretary of state\n\nHoward Lutnick, commerce secretary, and Allison Lutnick\n\nKris Marszalek, chief executive of Crypto.com\n\nRepresentative Brian Mast, Republican of Florida\n\nSenator Dave McCormick, Republican of Pennsylvania, and Dina Powell McCormick, former deputy national security adviser to Mr. Trump\n\nBill McDermott, chief executive of ServiceNow\n\nSanjay Mehrotra, chief executive of Micron Technology\n\nStephen Miller, White House deputy chief of staff\n\nElon Musk, chief executive of Tesla\n\nAmin Nasser, chief executive of Saudi Aramco, the world’s largest oil company\n\nPhebe Novakovic, chief executive of General Dynamics\n\nScott O’Neil, chief executive of LIV Golf, and Lisa O’Neil\n\nMeredith O’Rourke, Mr. Trump’s lead campaign finance operative\n\nKelly Ortberg, chief executive of Boeing, and Valerie Ortberg\n\nRoss Perot Jr. and Sarah Perot\n\nSenator James Risch, Republican of Idaho, and Vicki Risch\n\nChuck Robbins, chief executive of Cisco\n\nJohn F.W. Rogers, executive vice president of Goldman Sachs and Deborah Lehr\n\nBrooke L. Rollins, agriculture secretary, and Mark Rollins\n\nCristiano Ronaldo, professional soccer player, and Georgina Rodríguez\n\nSecretary of State Marco Rubio and Jeanette Rubio\n\nDavid Sacks, Mr. Trump’s artificial intelligence and crypto czar\n\nCharles Schwab and Helen Schwab\n\nStephen Schwarzman, chief executive of Blackstone, and Christine Schwarzman\n\nJeffrey Sprecher, chief executive of Intercontinental Exchange, and Kelly Loeffler, administrator of the Small Business Administration\n\nScott Strazik, chief executive of GE Vernova\n\nLisa Su, chief executive of Advanced Micro Devices, and Daniel Lin\n\nJames Taiclet, chief executive of Lockheed Martin, and Carol Taiclet\n\nVlad Tenev, chief executive of Robinhood Markets\n\nDonald Trump Jr. and Bettina Anderson\n\nTiffany Trump and Michael Boulos\n\nJim Umpleby, chief executive of Caterpillar\n\nVice President JD Vance and Usha Vance, the second lady\n\nKathy Warden, chief executive of Northrop Grumman, and Charles Warden\n\nMike Wirth, chief executive of Chevron\n\nChris Wright, energy secretary\n\nStephen Wynn and Andrea Wynn\n\nEric Yuan, chief executive of Zoom\n\nLee Zeldin, Environmental Protection Agency administrator\n\nReporting was contributed by Ryan Mac , Kate Kelly , Lauren Hirsch , Jack Ewing , Katie Rogers , Rebecca Elliott , Minho Kim , Adam Sella , Jesse Drucker , Vivian Nereim and Theodore Schleifer .",
  "summary": "James Khashoggi, U.",
  "published": "Tue, 18 Nov 2025 20:22:23 +0000",
  "url": "https://www.nytimes.com/live/2025/11/18/world/trump-saudi-crown-prince-visit/jamal-khashoggi-widow-saudi-arabia",
  "source": "NYT > World News"
}