{
  "title": "Delhi car blast: Umar met Syria terror operative in Turkiye in 2022; Pak handler facilitated meeting",
  "text": "Calm And Radical: Dr Umar’s Pre-Blast Video Exposes Educated New Face Of Terror Behind Delhi Attack\n\nNew Delhi: Dr Umar un Nabi, the suicide bomber behind the Nov 10 Delhi car blast, had met a Syrian terror operative in Turkiye in 2022 along with co-accused Dr Muzammil Shakeel Ganai and Dr Muzzafar Rather, supposedly on the directions of their Pakistani handler Ukasha, sources connected with the investigation told TOI on Thursday.The agencies are trying to dig deeper into what transpired during the meeting. Muzammil, who was arrested by NIA Thursday with three other accused - Dr Adeel Ahmed Rather, Dr Shaheen Saeed and Mufti Irfan Ahmad Wagay - is expected to be interrogated by NIA to take forward the probe into international linkages of the conspiracy.Intelligence sources told TOI the three doctors - Umar, Muzammil and Muzzafar (Adeel Rather's brother) - had stayed in Turkiye for around 20 days. Though they had travelled there to see Ukasha, who is said to be based along the Afghanistan-Pakistan border, the meeting never happened, as per the accused. Instead, Ukasha directed them to meet the Syrian national.Muzaffar went on to travel via UAE to Afghanistan and is said to have joined al-Qaida.Sources said Umar was also keen to travel to Afghanistan from Turkiye but was told by Ukasha to return to India to execute Jaish's \"bigger\" terror plans there.He followed the direction, and it was only after his return that he joined Al Falah University and gave shape to the terror module that had been amassing explosives for future attacks when it was busted.\"Muzammil, Adeel and Umer were constantly in touch with three Pakistan-based handlers Faisal, Hashim and Ukasha via Telegram, who would give them instructions, radicalisation material and bomb making videos,\" an officer told TOI.NIA said on Thursday that the three doctors and Shopian cleric Mufti Irfan arrested by it had played a key role in the Delhi terror attack and were also conspiring to carry out similar pan-India strikes.Earlier, NIA had arrested Amir Rashid Ali, a plumber from Pampore, and Jasir Bilal Wani who hails from Qazigund. Amir had facilitated purchase of the vehicle used in the Delhi car blast and was aware of the suicide bombing plan. Umar had visited Pampore a week before buying the car to arrange the money and then travelled back to Haryana with Amir. Amir stayed with Umar for around a week, bought the car in his name, and then returned to Pampore days before the blast.Jasir is accused of being an active co-conspirator who had provided technical support for carrying out terror attacks by modifying drones into rockets for use in terror attacks.All the accused were earlier in custody of J&K police, which had, in a painstaking investigation that started with spotting of some Jaish posters in Nowgam, unravelled a chilling Jaish terror conspiracy involving highly-radicalised doctors working at Al-Falah University in Faridabad.",
  "summary": "'2 Co-Accused Also Present, Pak Handler Facilitated Meeting'",
  "published": "Fri, 21 Nov 2025 00:54:31 +0530",
  "url": "https://timesofindia.indiatimes.com/india/delhi-car-blast-umar-met-syria-terror-operative-in-turkiye-in-2022/articleshow/125471263.cms",
  "source": "Times of India"
}