{
  "title": "Immune system discovery reveals potential solution to Alzheimer's",
  "text": "A new way of thinking about Alzheimer's disease has yielded a discovery that could be the key to stopping the cognitive decline seen in Alzheimer's and other neurodegenerative diseases.\n\nUniversity of Virginia School of Medicine scientists have been investigating the possibility that Alzheimer's is caused, at least in part, by the immune system's wayward attempts to fix DNA damage in the brain. Their research reveals that an immune molecule called STING drives the formation of the harmful plaques and protein tangles thought responsible for Alzheimer's. Blocking the molecule protected lab mice from mental decline, the researchers say.\n\nAn important player in the brain's immune system, STING also may be a key contributor to Parkinson's disease, amyotrophic lateral sclerosis (ALS or Lou Gehrig's disease), dementia and other memory-robbing conditions. That means that developing treatments to control its activity could have far-reaching benefits for many patients facing now-devastating diagnoses.\n\n\"Our findings demonstrate that the DNA damage that naturally accumulates during aging triggers STING-mediated brain inflammation and neuronal damage in Alzheimer's disease,\" said researcher John Lukens, PhD, director of UVA's Harrison Family Translational Research Center in Alzheimer's and Neurodegenerative Diseases. \"These results help to explain why aging is associated with increased Alzheimer's risk and uncover a novel pathway to target in the treatment of neurodegenerative diseases.\"\n\nAlarming Trends in Alzheimer's\n\nAlzheimer's is a growing problem across the country and around the world: More than 7 million Americans are already living with the condition, and that number could top 13 million by 2050. That has researchers working frantically to find ways to better understand and treat the condition.\n\nThe causes of Alzheimer's remain murky, but scientists are increasingly coming to appreciate the role of the immune system in the disease's development. STING is part of that immune response; the molecule helps direct the clearance of viruses and stressed cells harboring DNA damage.\n\nWhile STING is an important defender of the brain, it can also become hyperactive and cause harmful inflammation and tissue damage. That had Lukens and his team eager to determine what part it could be playing in Alzheimer's. Blocking the molecule's activity in lab mice, they found, helped prevent Alzheimer's plaque formation, altered the activity of immune cells called microglia and redirected the workings of important genes, among other effects.\n\n\"We found that removing STING dampened microglial activation around amyloid plaques, protected nearby neurons from damage and improved memory function in Alzheimer's model mice,\" said researcher Jessica Thanos, part of UVA's Department of Neuroscience and Center for Brain Immunology and Glia (BIG Center). \"Together, these findings suggest that STING drives detrimental immune responses in the brain that exacerbate neuronal damage and contribute to cognitive decline in Alzheimer's disease.\"\n\nPromising Treatment Target\n\nWhile scientists have been investigating other molecules thought to be important in Alzheimer's, STING makes for a particularly attractive target for developing new treatments, the UVA Health researchers say. That's because blocking STING appears to slow both the buildup of amyloid plaques and the development of tau tangles, the two leading candidates for the cause of Alzheimer's. Other molecules lack that robust involvement, and, further, could be targeted only at very specific -- and very limited -- stages in the disease's progression.\n\n\"We are only beginning to understand the complex role of innate immune activation in the brain, and this is especially true in both normal and pathological aging,\" Thanos said. \"If we can pinpoint which cells and signals sustain that activation, we will be in a much better position to intervene effectively in disease.\"\n\nWhile Lukens' pioneering research has opened new doors in the fight against Alzheimer's, much more work will need to be done to translate the findings into treatments. For example, scientists will need to better understand STING's roles in the body -- such as in the immune system's response to cancer -- to ensure any new treatment doesn't cause unwanted side effects.\n\nBut those are the types of big questions that Lukens and his collaborators at the Harrison Family Translational Research Center are eager to tackle as part of their efforts to fast-track new treatments and, eventually, they hope, cures. (The center is part of UVA's Paul and Diane Manning Institute of Biotechnology, now under construction at Fontaine Research Park.)\n\n\"Our hope is that this work moves us close to finding safer and more effective ways to protect the aging brain, as there is an urgent need for treatments that can slow or prevent neuronal damage in Alzheimer's,\" Lukens said. \"Shedding light on how STING contributes to that damage may help us target similar molecules and ultimately develop effective disease-modifying treatments.\"\n\nFindings Published\n\nThe researchers have published their findings in Alzheimer's & Dementia: The Journal of the Alzheimer's Association. The research team consisted of Thanos, Olivia C. Campbell, Maureen N. Cowan, Katherine R. Bruch, Katelyn A. Moore, Hannah E. Ennerfelt, Nick R. Natale, Aman Mangalmurti, Nagaraj Kerur and Lukens. The scientists have no financial interest in the work.\n\nThe study was supported by the National Institutes of Health's National Institute of Aging, grants R01AG071996, R01AG087406 and RF1AG078684; the Alzheimer's Association, grant ADSF-21-816651; the Cure Alzheimer's Fund; The Owens Family Foundation; and The Harrison Family Foundation.",
  "summary": "A new way of thinking about Alzheimer's disease has yielded a discovery that could be the key to stopping the cognitive decline seen in Alzheimer's and other neurodegenerative diseases, including ALS and Parkinson's.",
  "published": "Mon, 02 Jun 2025 15:49:05 EDT",
  "url": "https://www.sciencedaily.com/releases/2025/06/250602154905.htm",
  "source": "Latest Science News -- ScienceDaily"
}