{
  "title": "What do we know about the Epstein files?",
  "text": "What do we know about the Epstein files?\n\n17 hours ago Share Save Tom Geoghegan and James FitzGerald Share Save\n\nGetty Images Jeffrey Epstein in Cambridge, Massachusetts, in 2004\n\nThe words \"Epstein files\" have been haunting the administration of US President Donald Trump for months as it grapples with a growing crisis over the crimes of late convicted sex offender and financier Jeffrey Epstein. Pressure was building from Trump's own supporters and from voices within his own Republican Party for more transparency on what the federal investigations into Epstein uncovered. After weeks of resisting release, Trump reversed course and urged Republicans to vote to open the Epstein files to public scrutiny. Both chambers of Congress - the legislative branch of US government - approved a measure that compels the US justice department to release all files pertaining to its investigation into Epstein. The following day, Trump announced in a social media post that he had signed a bill that approved the release of the files. Now, the justice department has 30 days to release all the files - except for those that relate to an active criminal investigation, identify victims of Epstein's abuse or invade their privacy, or contain images of physical and child sex abuse, death, or injury.\n\nWhat are the Epstein files?\n\nIn 2008, Epstein reached a plea deal with prosecutors after the parents of a 14-year-old girl told police in Florida that Epstein had molested their daughter at his Palm Beach home. Photos of girls were found throughout the house, and he was convicted of soliciting prostitution from a minor, for which he was registered as a sex offender. He escaped a heavy jail sentence as a result of the deal. Eleven years later, he was charged with running a network of underage girls for sex. He died in prison while awaiting trial and his death was ruled a suicide. These two criminal investigations amassed a vast trove of documents including transcripts of interviews with victims and witnesses, and items confiscated from raids on his various properties. The US Federal Bureau of Investigation (FBI) found over 300 gigabytes of data and physical evidence in its databases, hard drives and other storage, according to a 2025 memo from the justice department. While some of the files likely include materials gathered by prosecutors working at federal level and Florida state level to investigate Epstein, the justice department says there is a \"large volume\" of images and videos of victims and other illegal child abuse material. These files would not be released to the public, as the latest legislation passed by Congress allows the justice department to withhold information that identifies victims. There was also a separate investigation into his British co-conspirator and ex-girlfriend Ghislaine Maxwell, who was convicted in 2021 of conspiring with Epstein to traffic girls for sex. Both Epstein and Maxwell were also the subject of civil cases.\n\nWatch: \"It's exhausting\" - Epstein accuser talks to the BBC about files saga\n\nWhat has already been released on Epstein?\n\nAt various stages over the years, some materials have been put into the public domain. Last week, thousands of documents belonging to the Epstein estate were released by the House Oversight Committee, mostly emails. That was not the first tranche released by the House Oversight Committee since it subpoenaed Epstein's estate earlier in the year. An earlier release, in September, included a birthday book containing a note to Epstein bearing Trump's name, which he has denied writing. In February, weeks after Trump took office, the Department of Justice and the FBI released what they described at the time as the \"first phase of the declassified Epstein files\". A group of right-wing influencers were invited to the White House, but they were left disappointed when they realised that the 341 pages handed to them were mostly material already out there. It included flight logs from Epstein's plane and a redacted version of his contacts book containing the names of famous people he knew. In July, the Department of Justice and FBI said in a memo that no more material would be released. That is now poised to change.\n\nWhat happens now that Trump has approved release?\n\nThe vote in the House of Representatives was forced by a discharge petition getting its critical 218th signature to trigger action on the floor. Four Republicans and all 214 Democrats in the House signed the petition. The vote to release the files took place on 18 November and the bill passed 427-to-1 in the House. Republican lawmaker Clay Higgins of Louisiana was the sole no vote. A handful of legislators did not vote. Once the bill passed in the lower chamber of Congress, it swiftly moved to the Senate where it passed via unanimous consent - a procedure that speeds up the legislative process if there is no objection. It was then signed off by Trump. There are still several hurdles to the full release of the files. Attorney General Pam Bondi will be required to release all materials and documents related to Epstein and Maxwell within 30 days of the law being enacted. But Bondi has the power to withhold any information that could jeopardise a federal investigation or identify Epstein's victims. The document that went before the House states that the attorney general could withhold or redact personal information that \"would constitute a clearly unwarranted invasion of personal privacy\". Trump has repeatedly called for an investigation into senior figures among the Democrats. Republicans have said that they fear that investigations into Epstein's links could block or delay details in the files. Representative Thomas Massie said he was concerned that a \"flurry of investigations\" could be opened as a way to avoid releasing the information.\n\nGetty Images Epstein with Maxwell in 2005\n\nWho is named in the Epstein files?\n\nThe contents of the unreleased documents remain unknown. According to The Wall Street Journal, Trump was told by Bondi in May that his name appeared in FBI documents. He used to be friends with Epstein and the paper noted that being named in the files was not evidence of wrongdoing. A White House spokesman called the story \"fake\", although an unnamed official speaking to Reuters news agency said the administration did not dispute that Trump's name had been included. Existing materials in the public domain mention a number of high-profile figures connected to Epstein. Again, this does not imply any wrongdoing by those individuals. Dozens of names came up in a release of court documents in 2024, including Andrew Mountbatten-Windsor, the former prince and brother of King Charles III, former US President Bill Clinton and Michael Jackson. Both Clinton and the British royal deny any knowledge of Epstein's crimes. Jackson died in 2009. The release of those documents related to the case of Maxwell, who is serving 20 years in prison for child sex trafficking. Billionaire Elon Musk and Mr Mountbatten-Windsor were named in flight logs released in September. Mr Mountbatten-Windsor has previously strenuously denied any wrongdoing. Mr Musk has been quoted as saying that Epstein invited him to the island but he declined. The latest batch of emails belonging to the Epstein estate and released on 12 November also featured Clinton's former Treasury Secretary, Larry Summers, and Trump's former aide Steve Bannon. Summers later said he would be stepping back from public commitments, writing in a statement: \"I take full responsibility for my misguided decision to continue communicating with Mr Epstein.\" Mr Bannon, who is not accused of any wrongdoing, did not reply to the BBC's request for comment. Trump's name was also mentioned several times in that latest release. He has always denied any wrongdoing.\n\nWhat do we know about the Trump/Epstein relationship?\n\nTrump and Epstein appear to have been friends for a number of years, keeping a similar social circle. Previously released files show that Trump's details were in Epstein's \"black book\" of contacts. Flight logs also showed Trump flying on Epstein's plane on several occasions. They were pictured together at elite events in the 1990s, and photos published by CNN purport to show Epstein in attendance at Trump's wedding to then-wife Marla Maples. In 2002, Trump described Epstein as a \"terrific guy\". Epstein would later remark: \"I was Donald's closest friend for 10 years.\" According to Trump, they fell out in the early 2000s, two years before Epstein was first arrested. By 2008, Trump was saying that he had not been \"a fan of his\". The White House has suggested that their fallout was connected to Epstein's behaviour, and that \"the president kicked him out of his club for being a creep\". The Washington Post, meanwhile, has suggested that the breakdown in their relationship was due to their rivalry over some real estate in Florida.\n\nWhy are people so interested in Epstein?",
  "summary": "US President Donald Trump has approved a bill that orders the release of material from investigations into Epstein, the late sex offender.",
  "published": "Thu, 20 Nov 2025 13:22:38 GMT",
  "url": "https://www.bbc.com/news/articles/c20r07dg6kro?at_medium=RSS&at_campaign=rss",
  "source": "BBC News"
}