{
  "title": "Israeli cycling team taken over by Iniesta's company",
  "text": "The team formerly known as Israel-Premier Tech have been taken over by a branding company co-founded by Barcelona legend and World Cup winner Andres Iniesta.\n\nIt was announced on Thursday evening the team had changed ownership and registered as Swiss, following their Israeli owners being the subject of several pro-Palestinian protests and the loss of their title sponsor.\n\nThe team will now be known as NSN Cycling from 2026, and say they are \"a Swiss team with a Spanish structure\".\n\nIn a statement, which suggested they had been sold by the Israeli owners - although this has not been formally confirmed to BBC Sport after a request for comment - the team said they had made an \"acquisition of the team's [governing competition] licence, and subsequent role in the team's operations\".\n\nNSN, which stands for Never Say Never, is a company co-founded by Iniesta, and claims to \"connect global audiences through the power of sports and entertainment\".\n\nFormer title sponsor Premier Tech ended its association this month, despite the team initially agreeing to remove Israel from their name.\n\nThe team had agreed to the change in October after public pressure from the Canadian company, citing pro-Palestinian protests during the Vuelta a Espana in September - many of which were directed towards Israel-Premier Tech.\n\nCanadian rider Derek Gee also cancelled his contract with the team days before the Vuelta, citing \"serious concerns\".\n\nFour-time Tour de France winner Chris Froome signed for the team in 2020, but was released last week following serious injuries sustained in a training accident this year.\n\nCanadian-Israeli billionaire Sylvan Adams has been co-owner of Israel-Premier Tech since 2014, but recently stepped back from day-to-day operations following controversy surrounding the team during the Vuelta as a result of the Israel-Gaza conflict.\n\nThe conflict was sparked by a Hamas-led attack on southern Israel on 7 October, 2023, during which about 1,200 people were killed.\n\nIsrael responded by launching a military campaign in Gaza, during which more than 69,00 people have been killed, according to the territory's Hamas-run health ministry.",
  "summary": "The team formerly known as Israel-Premier Tech is taken over by a branding company co-founded by Barcelona legend and World Cup winner Andres Iniesta.",
  "published": "Thu, 20 Nov 2025 23:18:26 GMT",
  "url": "https://www.bbc.com/sport/articles/cy8v8ml1817o?at_medium=RSS&at_campaign=rss",
  "source": "BBC Sport"
}