{
  "title": "Jimmy Butler, Steve Kerr and the Warriors' quest to solve the Jonathan Kuminga puzzle",
  "text": "Open Extended Reactions\n\nJIMMY BUTLER WAS at a padel event in Marbella, Spain, when Jonathan Kuminga reached out in mid-September.\n\nButler had organized a player-led gathering to be held at his house in San Diego the following week. The veterans wanted everyone there, particularly Kuminga, who Butler planned to work with individually, believing in the human and the basketball talent.\n\n\"I f---ing love him,\" Butler told ESPN. \"I know he has fans, but I'm his No. 1. Because he got all the tools to be great. Somebody just needs to show him how to utilize these tools.\"\n\nKuminga had called Butler to break the news that negotiations with the Warriors remained stalled. A contentious restricted free agency was bleeding toward training camp. He wouldn't be in San Diego. His relationship with the franchise was too shaky and uncertain.\n\n\"Bro, that's fine,\" Butler recalled telling Kuminga from Spain. \"You got to do what's best for you. I understand the situation you're in. I don't think anybody on the squad got bad blood. I rock with you. I see a lot of myself in you.\"\n\nThe first four weeks of Kuminga's fifth season with the Warriors have mirrored much of his career. He flashed the tantalizing upside, helped them burst out to a 4-1 start and gained enough traction for coach Steve Kerr to publicly install him as an entrenched starter.\n\n\"I think he's ready,\" Kerr said. \"The way he's rebounding, the way he's attacking the rim, that's what makes him special. When he's playing to that talent, to that ability, it changes our team.\"\n\nBut turbulence is always around the corner.\n\nThe Warriors lost five of their next seven. Kuminga's turnovers spiked and performance dipped. Searching for rotation answers, Kerr demoted Kuminga back to a bench role, reopening old wounds.\n\n\"He feels like the scapegoat again,\" one team source said.\n\nStephen Curry, inactive or ineffective the previous seven games due to an illness, returned to condition and ripped off 46 and 49 points in San Antonio, beginning a three-game win streak just as Kuminga sunk into the background with knee soreness, drumming up another round of questions about his fit and future with the team.\n\n\"Him not being in the lineup ain't the reason that we're winning,\" Butler said. \"We're just playing better basketball. Roles are clearer. We're making shots. We're guarding. That ain't got nothing to do with him. If he was in the lineup, I still believe that we win these games.\"\n\nFor the Warriors to reach their ceiling this season, there's an internal belief that Kuminga, even in a condensed role, must shake off some of his built-up resentment and get back to the impact wing from the first couple of weeks, even if the long-term benefit for both sides is more about a bump in trade value than a partnership.\n\nHe doesn't become trade eligible until Jan. 15, which means at least two more months of a relationship enduring on a fractured foundation. For it to be quietly mended, there's a quiet acknowledgement by several in the organization and around Kuminga that one voice has the best chance of breaking through to guide everything to a stable place: Butler's.\n\n\"I feel like, in this league, he's one of the people that actually [has] been in my shoes throughout their career,\" Kuminga said. \"And knows what I've been going through.\"\n\nButler had Kuminga over to his house for dinner after a recent home game. He took Kuminga out again on the team's most recent road trip.\n\n\"I realize that he listens to me,\" Butler said. \"He respects me. And I don't ever take that for granted. But I'm always going to tell him the truth, too. And when JK doing some bulls---, I'm going to tell him we can't have that, man.\" Noah Graham/NBAE via Getty Images\n\nBUTLER AND KUMINGA have discussed Butler's career journey. That includes his early days in Chicago. There are differences. Butler played four years in college. He was 22 as a rookie. Kuminga turned 23 last month, days before his fifth NBA season.\n\nSo they arrived at dissimilar stages of development but reached similar conclusions. Butler wanted more offensively as he grew with the Bulls, but felt somewhat contained by the pecking order, unable to break past the established labels and opinions.\n\n\"I think everybody comes to that steppingstone moment in their career where you know that you can get over that hump,\" Butler said. \"Some people are like, 'Nah, you're not ready for that yet.' But you know better. I think that's where he is. I was at that point.\"\n\nFriction is natural, especially after a summer of business bickering grew bitterness on all sides. It's harder to get through the lows of an NBA season, as another team source put it, when the player feels like a \"human trade exception.\"\n\n\"[That ambition for more] is hard for a lot of people,\" Butler said. \"It's hard for teammates. It's hard for fans. It's hard for coaches. I definitely think he has the potential to be [a star].\n\n\"But with that, I think Draymond [Green] nailed it on the head. He said, 'Hey, you asked for this.' So all the talking that they talking -- good, bad, indifferent -- you can't let this s--- affect who you are. You can't let this s--- affect how you play.\"\n\nKuminga's 92-day contract stalemate ended 48 hours into camp. He signed and returned under the presumption of a fluctuating bench role. But Al Horford's reduced minutes and Moses Moody's preseason calf injury creaked open the door. Kuminga's attitude and camp performance earned him a starting nod on opening night.\n\nKerr had been skeptical all summer of lineup combinations that included Kuminga, Butler and Green. They were minus-36 in 105 minutes last season.\n\n\"I wasn't convinced until I was convinced,\" Kerr told ESPN. \"Even opening night didn't look good in the first half.\"\n\nKerr said he \"jumped\" the team at halftime of the opening night win in Los Angeles. His concerns about the team's spacing and offensive flow with Butler, Green and Kuminga were being realized. But it flipped in the third quarter.\n\nBreaking News from Shams Charania Download the ESPN app and enable Shams Charania's news alerts to receive push notifications for the latest updates first. Opt in by tapping the alerts bell in the top right corner. For more information, click here.\n\n\"It's about playing through Steph,\" Kerr said. \"I reminded the team that every time you set a ball screen on Steph or pin away for him and slip, that's when the flow happens. JK was brilliant [in that second half]. He got a backdoor layup on a slip, ran a split cut, popped out, knocked down a 3 and we win the game. So it's like, OK, that second half felt better, but it still didn't feel like, all right, I'm sure about this.\"\n\nThe Warriors were facing the Denver Nuggets two nights later. Kerr called Green between games and told him his \"gut\" was to start Quinten Post at center against Nikola Jokic, preferring to limit Green's exposure to the bruisers early in the season.\n\n\"Dray, this is the big center thing that we've talked about,\" Kerr recalled telling Green.\n\n\"Well, who does that take out?\" Green asked, according to Kerr.\n\n\"Probably Kuminga,\" Kerr said.\n\n\"Let me start at center,\" Green said. \"I want JK to keep the momentum.\"\n\nKuminga played 36 minutes in the win over the Nuggets in overtime. The Warriors closed well with an upsized lineup of Curry, Butler, Kuminga, Green and Horford -- a group that had never even been utilized together in practice. Kuminga guarded Jamal Murray down the stretch. It was the second of his 11 straight games with at least five rebounds.\n\n\"He'd done everything that we asked him to do,\" Green said. \"And when someone's doing everything you ask them to do, the reward can't be [pulling them from the starting lineup].\"\n\nIn the days after, Kerr went public with a plan to keep Kuminga as the fourth starter, no matter the matchup -- a signal to Kuminga that he was gaining the nightly trust and consistent role he so desperately craves.\n\n\"It means something to him,\" Kerr acknowledged at shootaround in Milwaukee before the team's sixth game.\n\nBut Kerr's improving belief that it could work, despite the odd fit, came from both conversations and actions from Kuminga and Butler. Kuminga was adamant all summer he learned a ton about playing next to Butler during the second-round playoff series against the Minnesota Timberwolves, where he stepped into the starting lineup with Curry injured.\n\n\"I don't think JK had really settled into the idea [last regular season] of attack the rim, avoid the midrange jumper until late in the shot clock and get to the dunker spot if Jimmy's got it and Draymond's not there,\" Kerr said.\n\nButler made it a point throughout training camp to take Kuminga aside and drill the nuances of the game. They started to hang together off the court. Kuminga views Butler's career path as aspirational -- a power wing that worked his way into a prominent scorer, never taking no for an answer.\n\nIn one of the more constructive conversations between Kuminga and Kerr prior to the season, Kerr said Kuminga told him: \"I want you to know I've been working on my Jimmy spacing. I'm ready to play with Jimmy. I know I can play with him.\"\n\nButler and Kuminga played 86 minutes together in the first five games and, in them, the Warriors outscored opponents by 40 points.\n\n\"[Kuminga] was determined to do it and Jimmy was determined to help him with it,\" Kerr said. \"For me as a coach, winning solves everything.\"\n\nTHE WARRIORS HAD two bad road losses to the Bucks without Giannis Antetokounmpo and the Indiana Pacers without a chunk of their rotation. The veterans didn't play well and Kuminga didn't guard well either night. Tension is always a losing streak away in the NBA.\n\nKuminga, team sources said, had voiced to Kerr a desire to be coached harder. There was even a meeting about it in their Sacramento hotel prior to the ninth game of the season and Kerr appeared to make it a point during the Kings game to call Kuminga over and get on him constructively several times.\n\nBut 4-1 became 6-6. Kuminga's knees began bothering him. His defensive juice and burst to the rim lessened. He went 1 of 9 shooting at home against the Pacers, missing all five of his 3s. Coaches dinged him for his perimeter shot selection as a reason for his minute reduction (season-low 20). Butler and Kuminga made sure to point to his eight rebounds as a sign of impact.\n\nCurry's illness forced him out of the lineup for three games. The offense slumped without him. Curry returned in Oklahoma City and struggled in 20 rusty minutes. The defending champs blew out the Warriors. Kuminga had five of the team's 21 turnovers. Kerr and the veterans decided it was time to alter strategy. Kerr landed on a new starting lineup that included Moody and Will Richard, and Green said it's harder to push back during a losing streak.\n\n\"We've got to put Steph, Jimmy and Draymond in a position to succeed,\" Kerr said. \"That's what wins in this league. Everyone has their best two or three players. How well can you support them and enhance them?\"\n\nButler is a believer that winning cures all. So he's been on Kuminga about improving winning habits -- defend with constant effort, rebound with force, limit turnovers, creatively get to the line, space properly and take a back seat when necessary.\n\nBut he has also voiced a belief in strategic tweaks that could make it easier for them to thrive on the court together when Curry is either on the bench or out of the lineup -- shifting to a more deliberate, methodical, isolation approach that should be more conducive to Butler's and Kuminga's skill sets.\n\n\"The second that Steph is in the game is completely different than when Steph is out and I'm in the game,\" Butler said. \"And if you're still trying to run the Steph stuff, it's not going to work. Nobody's overreacting to anybody. I'm not saying 'No, we should never do that.' All I'm saying is Steph is the ultimate cheat code.\n\n\"So it is not fair to anybody to say that they can't play with whatever lineup or whatever lineup. Because if the man is out there, anybody can play with him.\"\n\nKuminga missed the final four games of the road trip with knee tendinitis. There's a possibility he returns at some point during an upcoming, spaced-out five-game homestand that should include three or four traditional practices. That, Green said, could serve as an ideal time to integrate Kuminga back into the mix in an intentional manner.\n\n\"Guess what we can do when he's coming off the bench?\" Green said. \"Feature him. That's what he needs. But it takes some time. There's been no practice. He's got his knee. So let's get healthy and we'll put this together. It's a long season. He's going to help us win a f---ing ton of games.\"\n\nButler is presented with that idea.\n\n\"I think with that though, he has to understand it doesn't mean just score,\" Butler said. \"Because I don't mind taking the back seat to him and letting him do his thing. And I'm down there in the dunker spot, I'm setting screens. I don't mind. But you know what we better do?\"\n\nLimit turnovers?\n\n\"No,\" Butler said. \"We better f---ing win. That's it. Whatever we want to do, I'm fine with it. It better be towards winning. Cause that's all that I care about. I don't care about nothing else.\"\n\nTo win at the highest level in a competitive conference, Butler and Green believe they need an impactful version of Kuminga at crucial times. That's a common organizational thought. But it's increasingly falling on Butler to be the voice that guides it along.\n\n\"Well, it's because he's heard the same voices for what? Years,\" Butler said.\n\nHe reaches back to his past again.\n\n\"Can you just imagine being in a place where -- like, I get it -- are you wanted here or not?\" Butler said. \"That's the worst feeling, man. Can you imagine it? I had to deal with it at the later part [of my tenure] in Miami. It's like, damn, I've been here. What are we talking about? It's a s---ty place to be in. And no matter what you do, you don't feel like you're doing right.\n\n\"So he's got a lot of feelings, which is OK,\" Butler continued. \"I think I just got to stay on him, though. Let him know that I am in your corner. We all are in your corner. Just breathe. Breathe. We're not out to get you. I don't think anybody's out to get you. Fans or media, maybe. But the people in it, we are not out to get you, bro. I promise you. I promise.\"",
  "summary": "Butler has taken on a mentorship role with Kuminga, who is still trying to find his role with the Warriors.",
  "published": "Thu, 20 Nov 2025 23:03:31 EST",
  "url": "https://www.espn.com/nba/story/_/id/47028331/inside-jimmy-butler-warriors-quest-solve-jonathan-kuminga-puzzle",
  "source": "www.espn.com - TOP"
}