{
  "title": "IRCTC No Food option: Is water bottle still free in Rajdhani Express for passengers opting ‘No Meals’?",
  "text": "IRCTC no food option, Rail Neer complimentary bottle: Since the post-COVID period, Indian Railways has made onboard meal options optional for passengers. Those booking tickets online can either opt in or opt out of meals during the reservation process itself. Currently, food charges are included in the ticket fare of three premium trains — Rajdhani Express, Shatabdi Express and Vande Bharat Express.\n\nIRCTC food booking\n\nIn these trains, passengers must select whether they want onboard meals at the time of booking. However, even after declining meals initially, passengers still have the option to order food later during the journey.\n\nIRCTC food on train\n\nIf passengers opt for meals, the catering charges are added to the total ticket fare. If they decline, the meal charges are simply deducted from the fare.\n\nIs water bottle free in Rajdhani Express\n\nThere is a common confusion among passengers regarding the complimentary one-litre Rail Neer water bottle on Rajdhani and other premium trains. Since meals have become optional, many travellers are unsure whether opting for the ‘No Meals’ option means they will no longer receive the free water bottle.\n\nAlso Read | Indian Railways child ticket policy: IRCTC ticket booking rules parents must know before travelling with kids\n\nThis often raises the question of whether the complimentary bottle is linked to the meal choice or is provided to all passengers after boarding, regardless of their meal preference.\n\nSpeaking to IndianExpress.com, a senior IRCTC official confirmed that the water bottle is provided free of charge to all passengers, regardless of whether they opt for meals or not.\n\nStory continues below this ad\n\nIRCTC no food option removed? Check details\n\nLast month, there was confusion over whether Indian Railways had made meals compulsory on premium trains like the Rajdhani Express, Shatabdi Express and Vande Bharat Express. This came after several users claimed that the IRCTC app and website were requiring mandatory meal selection while booking tickets for these trains.\n\nHowever, in a conversation with IndianExpress.com, a senior railway official dismissed claims that the ‘No Food’ option has been removed while booking tickets on premium trains. The official added that the ‘No Food’ option is still available on the same page with only minor changes made to its placement. “Option to opt out is available on same page,” the official said.",
  "summary": "",
  "published": "Sun, 16 Nov 2025 08:50:17 +0000",
  "url": "https://indianexpress.com/article/india/irctc-no-food-option-is-water-bottle-free-in-rajdhani-express-10368952/",
  "source": "India | The Indian Express"
}