{
  "title": "Regional strength with national progress is Modi govt’s goal: Amit Shah",
  "text": "UNION HOME Minister Amit Shah on Monday said the Narendra Modi government’s goal is clear — regional strength along with national progress and India’s global leadership in every field.\n\nAddressing the 32nd meeting of the Northern Zonal Council here, Shah said all states should work in mutual coordination to resolve water-related problems.\n\n“Our goal is clear — regional strength along with national progress and India’s global leadership in every field, which will lead us towards the creation of a great India,” he said.\n\nChief Ministers Nayab Singh Saini (Haryana), Sukhvinder Singh Sukhu (Himachal Pradesh), Bhagwant Mann (Punjab), Bhajan Lal Sharma (Rajasthan), Rekha Gupta (Delhi), Omar Abdullah (J&K), Punjab Governor and Administrator of Chandigarh Gulab Chand Kataria, Lieutenant-Governors Manoj Sinha (J&K), V K Saxena (Delhi) and Kavinder Gupta (Ladakh) attended the meeting, officials said.\n\nThe Home Minister said the sectors of cooperation, agriculture and fisheries “can become important means of eradicating poverty and providing employment”.\n\nReferring to PM Modi’s mantra of ‘Sahkar Se Samriddhi (prosperity through cooperation)’, he said the cooperative sector holds immense potential for employment.\n\nHe said only through growth in employment — especially self-employment — along with GDP can the country realise the dream of a developed India.\n\nStory continues below this ad\n\nHe said the Ministry of Cooperation has initiated 57 measures across the country to strengthen the sector. These include computerisation of Primary Agricultural Credit Societies (PACS), establishment of three new national-level cooperative societies and the setting up of Tribhuvan Sahkari University, he said.\n\nThe Home Minister said the original spirit and the role of zonal councils is advisory, but in the last decade, they have been accepted as action-oriented platforms and have delivered results.\n\n“With follow-up, we have not only accepted issues between states, between regions and states, and between the Centre and state governments, but also created concrete pathways for their resolution,” he said.\n\nOn the recent Red Fort blast incident, he said: “Under the leadership of PM Modi, eliminating terrorism is our collective commitment… The culprits of the Delhi blast will be traced, brought before the country’s judicial system and given the strictest possible punishment.” —PTI Inputs",
  "summary": "",
  "published": "Mon, 17 Nov 2025 22:39:28 +0000",
  "url": "https://indianexpress.com/article/india/regional-strength-with-national-progress-is-modi-govts-goal-amit-shah-10371520/",
  "source": "India | The Indian Express"
}