{
  "title": "Gangster Anmol Bishnoi, accused in Baba Siddique murder case, lands in India; arrested by NIA",
  "text": "Anmol Bishnoi Deportation Update: The National Investigation Agency (NIA) on Wednesday arrested gangster Anmol Bishnoi, who is wanted as the ‘main plotter’ in the murder of Nationalist Congress Party (NCP) leader Baba Siddique in October last year. Anmol, the brother of jailed gangster Lawrence Bishnoi, was arrested in Delhi after being deported from the US, where his asylum application was turned down by a Louisiana court.\n\n“Absconding since 2022, Anmol is the 19th accused to be arrested for his involvement in the terror syndicate led by his jailed brother, Lawrence Bishnoi. Anmol was chargesheeted by the NIA in March 2023 after investigations in the case established that he had actively aided designated individual terrorist Goldy Brar and Lawrence Bishnoi in the commission of various acts of terrorism in the country during the 2020-2023 period,” an NIA spokesperson said.\n\nThe spokesperson added that Anmol continued to run terror syndicates and execute terrorist acts from the US for the Lawrence Bishnoi gang, using its operatives on the ground.\n\nInvestigations have revealed that Anmol had allegedly provided shelter and logistic support to the gang’s shooters and ground operatives. “He was also engaged in extortion in India from foreign soil with the help of other gangsters. The NIA continues to investigate the case as part of its efforts to destroy the nexus between terrorists, gangsters and arms smugglers, including their infrastructure and funding channels,” the spokesperson added.\n\nAnmol was deported in a chartered plane, along with two others who are wanted in Punjab. “Anmol had applied for asylum, and his application was rejected on Monday. After this, orders were issued to deport him, and central agencies in India were informed about his arrival,” a source said.\n\nWhile Anmol has several cases pending against him across the country, central agencies are focusing on his alleged role in the murder of Punjabi singer Sidhu Moosewala in May 2022, NCP leader Baba Siddique’s killing last year, and the firing outside actor Salman Khan’s house, among others.\n\nSiddique was shot outside his Bandra office on October 12, 2024, and the Mumbai Police named Anmol as the ‘plotter of the murder’ and declared him a wanted accused.\n\nStory continues below this ad\n\nThe NIA had named Anmol as an accused in two cases and announced a bounty of Rs 10 lakh. “There are 31 cases, including 22 in Rajasthan, and nine arrest warrants against Anmol. Lawrence Bishnoi gang has a criminal syndicate encompassing Punjab, Haryana, Rajasthan and Delhi. Anmol is among those believed to be managing the gang’s extortion operations,” an officer said.\n\nAnmol fled to the US on May 15, 2022, on a fake passport issued in the name of one Bhanu. Last year, however, the US Immigration Department found that one of the reference letters of a company, attached to his travel documents, was forged. A Red Corner Notice was issued against him on December 6, 2022.",
  "summary": "",
  "published": "Wed, 19 Nov 2025 08:51:38 +0000",
  "url": "https://indianexpress.com/article/india/anmol-bishnoi-key-accused-in-the-murder-of-ncp-leader-baba-siddique-lands-in-india-10373812/",
  "source": "India | The Indian Express"
}