{
  "title": "Humble & sweet, but a lion - the story of the first female £1m player",
  "text": "In 2022 Smith was playing at North Toronto Nitros. She ripped League1 Ontario up.\n\nBy the time the semi-professional league came to an end, she had scored 18 goals in 11 games and it would be the last time playing club football in her home country.\n\nThat summer she moved south of the border, to Penn State University in Pennsylvania. Again, her time there was fleeting.\n\nDespite arriving at Penn State with a serious cruciate ligament injury, sustained at the Under-20 World Cup, and a frail run of form, the calls from Europe arrived by the end of her freshman year.\n\n\"It was neat to watch her be able to be an 18-year-old because I don't think there's been a lot of times where she's been able to be her actual age,\" said former Penn State University head coach Dambach.\n\n\"Since leaving Penn State she has put herself out there and put herself in uncomfortable situations and I think through those she was able to really grow and develop.\"\n\nAnd so, one year on from that season in Canada, she had left college and moved to Portugal to join Sporting, despite heavy interest in France and England.\n\nBatlle y Font was instrumental in persuading Smith to move to the relatively obscure Portuguese league - and reaped the rewards.\n\n\"I won't say that our project is better than those clubs, obviously it's different,\" said the 30-year-old. \"I think she understood that we really wanted her.\n\n\"I think that she chose us because she understood that she would have the same rights and same duties as other players, but she would not be one more player.\n\n\"Once she made the decision, we never felt that she was looking at us as a minor club, compared to the other clubs interested in her.\"\n\nIt did not take her long to make an impression in Portugal.\n\n\"She was 18 and she was playing against experienced players and she would make a bit of a fool of them.\n\n\"When she played we would look at each other and say, 'how did we fool this girl to be here? How lucky are we?'\"\n\nAgain by the end of another fruitful season, she was packing her bags and Batlle y Font was receiving enquiries from multiple clubs in Europe.\n\n\"There were more clubs interested and, to be honest, with better offers than Liverpool, but not the kind of project that Olivia wanted,\" said Batlle Y Font. \"Once again, this shows how very grounded Olivia is.\"\n\nHer debut season in the WSL saw her score seven goals in 20 games for Liverpool, as well as being named the PFA young player of the year. When she arrived at Arsenal this summer, it was her third club in three years.\n\n\"I definitely think it's not comfortable, but you have to be comfortable being uncomfortable,\" said Smith, speaking to reporters in pre-season. \"And it's been quite tough for me personally, not knowing what's going to come next.\n\n\"Like my first season, I never expected to leave after one season, especially last season, only having one season in what I think is the best league in the world and then coming here.\n\n\"So it's certainly not easy, especially with my family so far away, but it does make transitions easier.\"",
  "summary": "Meet the person behind women's football's first £1m player, Arsenal's new superstar forward Olivia Smith.",
  "published": "Sat, 06 Sep 2025 06:32:15 GMT",
  "url": "https://www.bbc.com/sport/football/articles/cn82lx29558o?at_medium=RSS&at_campaign=rss",
  "source": "BBC Sport"
}