{
  "title": "Trump pleads not guilty to 34 felony counts",
  "text": "News outlets will not be allowed to broadcast former President Donald Trump’s arraignment on Tuesday in a New York state court, a judge said Monday night, but he will allow some photographers to take pictures in the courtroom before the proceedings formally begin.\n\nActing New York Supreme Court Judge Juan Merchan rejected the request by several media organizations, including CNN, for permission to broadcast the historic proceedings. Trump’s arraignment — like most arraignments in the Manhattan courthouse — is a public proceeding, but news cameras are not usually allowed to broadcast from inside the courtroom.\n\nHowever, the judge is allowing five pool photographers to take still photos at the beginning of the proceedings “until such time as they are directed to vacate the jury box by court personnel.”\n\nEarlier on Monday, Trump’s lawyers urged the judge to reject the media’s request for live cameras in the courtroom. The Manhattan District Attorney’s office told the judge they didn’t have a position.\n\nThe media outlets that tried to get cameras into the courtroom argued that “the gravity of this proceeding … and, consequently, the need for the broadest possible public access, cannot be overstated.”\n\nTrump is now in Manhattan ahead of the arraignment. A grand jury indicted the former president last week.\n\nThe arraignment is also expected to bring the unsealing of the criminal charges against Trump, which have not yet been seen by his lawyers or the public.\n\nThe indictment stems from Manhattan District Attorney Alvin Bragg’s investigation into hush-money payments, made during the 2016 presidential campaign, to women who claimed they had extramarital affairs with Trump, which he denies.\n\nTrump denies all wrongdoing and his lawyers said last week that they’ll fight to get the charges dropped.",
  "summary": "",
  "published": "",
  "url": "https://edition.cnn.com/webview/politics/live-news/trump-indictment-stormy-daniels-news-04-03-23/index.html",
  "source": "CNN.com - RSS Channel - App International Edition"
}