{
  "title": "Who is Rohini Acharya? Lalu’s daughter ‘quits politics, disowns family’",
  "text": "In a dramatic development, Lalu Prasad Yadav’s daughter Rohini Acharya said she was quitting politics and disowning her family. Acharya is one of Lalu and Rabri Devi’s nine children and a sibling of Tejashwi and Tej Pratap. Even though her decision may seem sudden and its timing strange — it comes just a day after the Rashtriya Janata Dal received a drubbing in the 2025 Bihar Assembly polls — tensions were brewing for quite some time.\n\nIt included the ouster of elder brother Tej Pratap and the rising sway held over political matters by key Tejashwi aide Sanjay Yadav.\n\nRohini Yadav: Who is Rohini Acharya?\n\nAcharya was in the news for donating a kidney to her father and RJD patriarch Lalu Prasad Yadav in December 2022.\n\nWhen Acharya, who lives in Singapore, contested last year’s general elections, she was known in her constituency as the “kidney dene wali beti” (the daughter who gave her kidney). Her seat was Saran, a constituency won by her father Lalu Yadav four times. Though she lost to now five-time parliamentarian Rajiv Pratap Rudy, her pitch struck a chord with the RJD’s support base.\n\nBihar election 2025: How Rohini Acharya got her name\n\nRohini was named thus because she was born in the ‘Rohini Nakshatra’ according to the Hindu calendar. Her surname came from a Patna-based gynaecologist. It was Dr Kamala Acharya who delivered Rohini but refused to take any fee from Lalu Yadav, according to an Express report. When pressed on by Lalu, the doctor made one request: Don’t give me the fee, give the newborn my name. Lalu agreed and the newborn came to be known as Rohini Acharya.\n\nOn Saturday, Acharya made the following post: “I am quitting politics and I am disowning my family…This is what Sanjay Yadav and Rameez had asked me to do…and I am taking all the blame”.\n\nRohini Acharya husband: Who is Rohini Acharya’s husband\n\nAfter completing her MBBS degree studies, Rohini tied the knot with Samresh Singh in 2002. Singh is a software engineer from Icchanbigha near Patna. The couple first moved to the US before shifting to Singapore, where they live along with their two children.\n\nHer wedding wasn’t without controversy.\n\nStory continues below this ad\n\nDuring the celebrations, some of Lalu’s kin are understood to have forcibly driven out brand new cars from Patna showrooms to welcome the “baraat”. Theyall the way to the city airport to receive the bridegroom and his father and ex-Income Tax commissioner Rao Ranvijay Singh.\n\nSanjay Yadav RJD: Who is Sanjay Yadav\n\nSanjay Yadav is the the RJD’s Rajya Sabha MP and he is known in party circles as a trusted aide of Tejashwi Yadav, the son and heir apparent of RJD supremo Lalu Prasad. What made Rohini unhappy was a picture of Sanjay occupying a seat at the front of a rally bus. That position is usually reserved for either party president Lalu Prasad Yadav or heir-apparent Tejashwi Yadav. Sanjay occupying the seat also showed his increasing sway in the party. So, Rohini shared a social media post critical of Sanjay, who belongs to a political family in Haryana, but was asked to do damage control by her family.",
  "summary": "",
  "published": "Sat, 15 Nov 2025 14:32:32 +0000",
  "url": "https://indianexpress.com/article/india/who-is-rohini-acharya-bihar-election-lalu-prasad-yadav-daughter-quits-politics-10367772/",
  "source": "India | The Indian Express"
}