{
  "title": "From shocking deaths to more wee donkeys: what we want from the return of Line of Duty",
  "text": "Mother of God, fella, they’re back at last. In a rare piece of good news for the beleaguered BBC, blockbuster drama Line of Duty is to return for a long-awaited seventh series. So long-awaited, in fact, that many fans feared it would never happen. Luckily, the police still need policing. Even the fictional Central police force.\n\nThe last run of creator Jed Mercurio’s corrupt cop thriller was the top-rated TV drama (excluding soaps) since modern records began in 2002, pulling in an average of 16 million viewers and a whopping 17 million for the finale over 28 days. The show’s three stars will now reprise their roles in a six-part comeback that begins filming in Belfast next spring.\n\nAs we return, anti-corruption unit AC-12 has been disbanded, rebranded as the Inspectorate of Police Standards. The dream team of Steve Arnott (Martin Compston), Kate Fleming (Vicky McClure) and Ted Hastings (Adrian Dunbar) are assigned “their most sensitive case so far”.\n\nDet Insp Dominic Gough is a charismatic officer, making his name for a string of takedowns of organised crime. However, he is accused of abusing his position of trust to act as a sexual predator. Is Gough guilty? Or is his case a deliberate distraction from a bigger threat?\n\nWe’re only interested in one thing and that’s catching bent coppers. Oh, and whether Line 0f Duty can recapture its magic after a five-year absence. Here are the (AC-)12 things we want to see from the revival …\n\n1. Cast a big-name antagonist\n\nView image in fullscreen Under investigation … Lennie James as DCI Tony Gates in the opening season of Line of Duty in 2012. Photograph: Alamy\n\nWe need a complex villain to keep us guessing. The previous six series have boasted top-tier talent as the team’s adversaries. In chronological order, Lennie James, Keeley Hawes, Daniel Mays, Thandiwe Newton, Stephen Graham and Kelly Macdonald have been investigated by our heroes. Who will play dodgy DI Gough? Casting should aim high. Matthew Macfadyen, Paapa Essiedu, Matt Smith, Adeel Akhtar or Andrew Scott, maybe?\n\n2. No more damp-squib reveals\n\nThe series six finale was widely derided when it unmasked the shadowy string-puller known as “H”. It turned out to be bumbling DSI Ian Buckells (Nigel Boyle), who wasn’t so much a criminal mastermind as an inept chancer who had failed upwards. Cue howls of disappointment from sofas nationwide. The new series is a chance to retrofit this anticlimax as a red herring, with hapless Buckells taking a hit for the real supervillain.\n\n3. Long interrogation scenes\n\nView image in fullscreen On the record … Sian Reese-Williams as Sgt Jane Cafferty gets the AC-12 treatment in series five. Photograph: Landmark Media/Alamy\n\nLine of Duty became renowned for its trademark interview scenes – claustrophobic cat-and-mouse showdowns that begin with a long beep from the recording device, before lasting up to 20 minutes. Suspected wrong ’uns are probed. Surprises are sprung. Shot in one take, they’re like rivetingly tense mini-plays. Plenty of these please.\n\n4. Strip back the storytelling\n\nThe last two series became too bogged down by interwoven plots, recurring side characters and the show’s own lore. Keep it simple. Follow a knotty main case, with one overarching storyline at most.\n\n5. LOA (lots of acronyms)\n\nLine of Duty became notorious for its liberal use of police jargon. The MIT are investigating the OCG. They’ve embedded a UCO and have a CHIS. RTC up ahead. Possible GSW. Put AFOs on standby and await sit-rep.\n\n6. Keep action realistic\n\nView image in fullscreen Eat lead? Martin Compston in season five. Photograph: Landmark Media/Alamy\n\nHigh-octane sequences sometimes got silly – remember gun-toting Vicky McClure clinging to the side of a lorry? – but such set pieces add adrenaline-pumping thrills. Armed response raids would go wrong. Prison vans would get rammed off the road. Police convoys would be hijacked by sinister black SUVs. Make them exciting but still plausible.\n\n7. Real-world resonance\n\nMercurio’s writing has often been at its best when close to the bone – whether it’s referencing Jean Charles de Menezes, Jill Dando, Jimmy Savile or Stephen Lawrence. As Mercurio wryly noted in the recent announcement: “Corruption in this country is supposed to have come to an end while Line of Duty was off-air, so I’ve been forced to use my imagination.” The new case sounds ripe for real-life parallels and righteous anger.\n\n8. Waistcoats, swears and Ted-isms\n\nView image in fullscreen Ted talk? Adrian Dunbar as Supt Hastings in season five. Photograph: Landmark Media/Alamy\n\nCocky Arnott wore estate agent waistcoats. Steely Fleming got one good swear per series (“Stop making a tit of yourself and piss off”). Warhorse Hastings dispensed homespun Ulster catchphrases (sucking on diesel, wee donkey, etc). These constants must not change.\n\n9. Be willing to kill off characters\n\nView image in fullscreen Terminated … Jessica Raine as DC Georgia Trotman in series two. Photograph: Alamy\n\nNot since Game of Thrones has a drama been so ready to ruthlessly dispatch its big players. Jessica Raine and Daniel Mays lasted just a single episode apiece. Countless others have gone to the great holding cell in the sky. Shock deaths raise the stakes and keep viewers guessing.\n\n10. A comeback for Carmichael\n\nView image in fullscreen Insufferable … Anna Maxwell Martin’s DCS Carmichael in season five, 2019. Photograph: Landmark Media/Alamy\n\nAnna Maxwell Martin went viral for her villainous turn as DCS Patricia Carmichael – an insufferably smug rival who had it in for Hastings and wanted to close down AC-12. Now she’s got her wish, let’s see her gloating – before getting her comeuppance.\n\n11. No box-set drop\n\nIt has become standard practice for the BBC to release its flagship dramas as iPlayer box sets. This would be a mistake with a show as suspenseful as Line of Duty. It should be a communal viewing experience, thriving on cliffhangers and sustained tension. Waiting for the next episode fuels fan theories and sparks debate. Eliminate the spoiler problem and make it event TV, like a fictional equivalent of The Traitors. But less farty.\n\n12. Don’t leave it so long next time\n\nIf the new series airs in late 2026 or early 2027, as predicted, it will be almost a six-year gap between series. Let’s not let such lengthy waits become standard. Ted Hastings will be well past retirement age, for a start. He didn’t float up the Lagan in a bubble.",
  "summary": "<p>Jed Mercurio’s police drama is getting a comeback – which gives it the chance to be TV’s greatest cop show once more. Here’s what it needs to do</p><p>Mother of God, fella, they’re back at last. In a rare piece of good news for the beleaguered BBC, blockbuster drama Line of Duty is to return for a long-awaited seventh series. So long-awaited, in fact, that many fans feared it would never happen. Luckily, the police still need policing. Even the fictional Central police force.</p><p>The last run of creator Jed Mercurio’s corrupt cop thriller was the top-rated TV drama (excluding soaps) since modern records began in 2002, pulling in an average of 16 million viewers and a whopping 17 million for the finale over 28 days. The show’s three stars will now reprise their roles in a six-part comeback that begins filming in Belfast next spring.</p> <a href=\"https://www.theguardian.com/tv-and-radio/2025/nov/20/what-we-want-from-the-return-of-line-of-duty-season-7-bbc\">Continue reading...</a>",
  "published": "Thu, 20 Nov 2025 14:45:43 GMT",
  "url": "https://www.theguardian.com/tv-and-radio/2025/nov/20/what-we-want-from-the-return-of-line-of-duty-season-7-bbc",
  "source": "The Guardian"
}