{
  "title": "Israeli Strikes Kill at Least 25 in Gaza Amid Cease-Fire, Officials Say",
  "text": "Gaza’s Civil Defense emergency workers said they had recovered 10 bodies after an Israeli strike on a building in Gaza City, in the north. Another woman was killed and two others were wounded in a strike in southern Gaza, according to he agency.\n\nAfter more than two years of devastating war, Israel and Hamas agreed to a truce in mid-October that had been brokered by the Trump administration, Egypt, Qatar and Turkey. But the cease-fire did not decisively end the war, and sporadic violence has erupted several times since the agreement was signed.\n\nAs part of the deal, Hamas turned over the remaining hostages it had held in Gaza in exchange for nearly 2,000 Palestinian prisoners. Israeli forces pulled back to a new withdrawal line that left them in control of about half of the enclave.\n\nThe Trump administration, along with other mediators, is trying to move ahead with the next steps in President Trump’s ambitious vision for peace in Gaza. That includes Hamas laying down its weapons, the deployment of an international security force and a full Israeli withdrawal.\n\nBut many observers fear the cease-fire could fall apart long before it ever reaches that stage.\n\nIsraeli forces have come under fire multiple times since mid-October, killing at least three soldiers. Blaming Hamas for the attacks, Israel has responded with great force, killing more than 280 Palestinians since the truce went into effect, according to Gaza’s health ministry. The ministry’s toll does not distinguish between civilians and combatants.",
  "summary": "Israel’s military said it had launched attacks across Gaza after Palestinian militants shot at its troops. The six-week-old cease-fire has been pierced periodically by bursts of violence.",
  "published": "Thu, 20 Nov 2025 14:18:22 +0000",
  "url": "https://www.nytimes.com/2025/11/19/world/middleeast/israeli-strikes-gaza-deaths.html",
  "source": "NYT > World News"
}