{
  "title": "Overdue jobs report shows employers added 119,000 jobs in September",
  "text": "Overdue jobs report shows employers added 119,000 jobs in September\n\ntoggle caption Frederic J. Brown/AFP via Getty Images\n\nHiring picked up in the early fall after a lackluster summer.\n\nAn overdue report from the Labor Department on Thursday showed U.S. employers added 119,000 jobs in September, while the unemployment rate inched up to 4.4%.\n\nThe report was released almost seven weeks behind schedule due to the government shutdown. And because the shutdown also delayed data-gathering, there won't be another jobs report until mid-December.\n\nWhile the newly released information is a bit stale, it may offer some clues about the pace of hiring and firing this fall.\n\nThe report paints a mixed picture of the job market. Hiring was strongest in health care and hospitality in September, while factories and warehouses cut jobs. Downsizing in the federal government also continued during the month, though state and local governments continued to add jobs.\n\nSponsor Message\n\nRevised data shows job growth in July and August was even weaker than initially reported, with 33,000 fewer jobs added during those months.\n\nLoading...\n\nFor months now, employers have neither added many new workers nor handed out a lot of pink slips. But Federal Reserve Governor Chris Waller worries that's about to change. Waller says his conversations with business leaders show the job market is close to stalling.\n\n\"Four to six weeks ago, we were still in this kind of no-hire/no-fire mode,\" Waller told a group of economists in London this week.\n\nBusiness leaders, he said, are \"starting to talk about layoffs. They're starting to plan for them in the future.\"\n\nAmazon recently announced 14,000 job cuts, and Verizon is cutting 15,000 workers.\n\nWaller wants the Fed to cut interest rates again when policymakers meet next month, to boost demand and prop up the labor market. But minutes from the last Fed meeting, released on Wednesday, show considerable disagreement among central bank policymakers.\n\nMany members of the Fed's rate-setting committee suggested it would be appropriate to hold interest rates steady for the rest of the year, noting that inflation has remained stubbornly above the Fed's 2% target. That's partly due to President Trump's tariffs. And some Fed policymakers think the import taxes will continue to put upward pressure on goods prices well into next year.\n\nOrdinarily, the Fed would have jobs numbers for October and November in hand before its next meeting. But because of the government shutdown, those reports won't be released until after the meeting, and some of the October data won't come out at all. It's also uncertain when or if the October inflation report will be published.\n\nThat said, Waller insists he and his colleagues are not flying blind. They've been listening to businesses like Target and McDonald's that say many of their customers are cautious with their spending right now. That could put more of a squeeze on the job market.\n\nSponsor Message\n\n\"You just go talk with firms that work with low- and middle-income households, they'll tell you point-blank, they're just not coming in the door,\" Waller said. \"And then these firms are not going to be hiring.\"\n\nWhile government data on consumer spending has also been held up by the shutdown, anecdotal reports suggest only the wealthiest families are spending freely these days, buoyed in part by the gains in their stock portfolios.\n\nThe unemployment rate is driven by two forces: the number of jobs employers want to fill and the number of workers available to fill those jobs.\n\nThe Trump administration's crackdown on immigration has limited the number of foreign-born workers, at the same time many native-born baby boomers are retiring. Some analysts argue that the limited supply of workers is largely responsible for the slowdown in hiring.\n\nWaller worries that the slowdown is driven more by a declining need for workers, which could result in higher unemployment in the months to come.\n\n\"There's definitely a reduction of supply,\" he said. \"But to me that is masking the reduction in demand, and that's what I'm concerned about.\"",
  "summary": "U.S. employers added 119,000 jobs in September, while the unemployment rate inched up to 4.4%. The report, which was delayed by the government shutdown, may hint at the pace of hiring and firing.",
  "published": "Thu, 20 Nov 2025 05:00:00 -0500",
  "url": "https://www.npr.org/2025/11/20/nx-s1-5611418/september-jobs-report-arrives-today-almost-seven-weeks-behind-schedule",
  "source": "NPR Topics: Business"
}