{
  "title": "Wicked: For Good is a soaring second act that brings it all full circle",
  "text": "is a reporter focusing on film, TV, and pop culture. Before The Verge, he wrote about comic books, labor, race, and more at io9 and Gizmodo for almost five years.\n\nWhen Jon M. Chu first announced that his big-screen Wicked adaptation would be split into two parts, there was concern about whether the original musical’s second act could be fashioned into a fully fleshed-out movie. Compared to the stage show’s lengthy first act, where all the musical’s most recognizable songs are front-loaded, the second act is shorter and moves at a much faster pace while picking up after a big time jump. It was easy to imagine Wicked: Part Two (the original title) being too disorienting and frenetic to work as a standalone feature. But Wicked: For Good proves that Universal made the right call by giving this epic fantasy more space to breathe and really dig into what makes its characters tick.\n\nThough it would have been understandable if Wicked: For Good immediately tried to fill you in on the previous film’s events, the new movie instead drops you right back into Elphaba (Cynthia Erivo) and Glinda’s (Ariana Grande) story five years after the former roommates’ last encounter. Thanks to the Wizard’s (Jeff Goldblum) newly appointed press secretary Madame Morrible (Michelle Yeoh), almost everyone in Oz has been convinced that there’s a murderous wickedness within Elphaba that makes her a singular threat to the entire country.\n\nAside from Glinda and her now-fiance Fiyero (Jonathan Bailey), the Wicked Witch of the West™ propaganda is easy for people to believe because they have all seen her cackling up in the sky while riding her broomstick and terrorizing Oz’s gun-toting soldiers. But what most humanoid Ozians fail to realize is that, while Elphaba has been busy causing mayhem and hiding out in the woods like an evil hag, it has all been part of her one-woman crusade to free the nation’s population of sentient Animals.\n\nThough Wicked: For Good builds on its predecessor’s sumptuous fairy-tale looks, it tells a much darker, politically charged story about revolution and the power of perception. Elphaba sees herself in the Animals who have been enslaved for being too smart for their own good and forced into lives of servitude. It pains her to see them building the Yellow Brick Road she helped conceptualize, but what hurts even more deeply is how many of the Animals, like a certain cowardly lion (Colman Domingo), see her as just another two-legged Ozian who will only bring them more pain and suffering.\n\nThough many of Wicked: For Good’s beats are pulled from the stage show, it often feels like screenwriters Winnie Holzman and Dana Fox are channeling the thorny energy of Gregory Maguire’s Wicked novel to paint a picture of Oz that resembles the US in 2025. Some of the movie’s most powerful moments focus on the idea that petty tyrants rely on stoking fear and hatred of people marked as others. Scenes of humanoid soldiers chasing Animals from their homes under the pretense of keeping Oz safe immediately evoke images of ICE agents descending upon immigrant communities. The Wizard and Morrible’s bigotry is focused on Animals for a while, but it isn’t long before their invective begins negatively impacting Munchkinlanders like Boq (Ethan Slater) and Elphaba’s sister Nessarose (Marissa Bode).\n\nWicked: For Good balances the heaviness of its political commentary with a healthy dose of clever humor that comes by way of its nods to the original Wizard of Oz’s story. A magical tornado introduces a new version of Dorothy Gale (Bethany Weaver), but her presence in Oz is frequently played for laughs as characters comment on how the foreign girl always seems to be butting her nose into other people’s business. The way Dorothy, her little dog, and their new crew of friends are almost always shot from behind or just leaving scenes as they open are some of the movie’s best running gags. They work as allusions to how The Wizard of Oz’s story ends, but also to remind you that Wicked isn’t really about them.\n\nImage: Universal\n\nOnce again, Erivo is a dramatic and musical force as she inhabits Elphaba with a more dynamic energy reflective of her embracing her Wicked Witch identity. But compared to the first film, Wicked: For Good spends much more time with Grande’s evolving Glinda, who struggles with the knowledge of how cursed her newfound fame as the Wizard’s preferred “witch” is.\n\nEven when Glinda and Elphaba are locked in a ridiculous slap fight, Grande and Erivo are electrifying together in a way that absolutely sells Wicked: For Good as a nuanced love story about two women who have transformed one another. The movie brings their stories to a close with the pitch-perfect poetry stage musicals live and die by — and despite being spread across two films, that story never overstays its welcome.\n\nWicked: For Good also stars Bowen Yang, Bronwyn James, Sharon D. Clarke, Dee Bradley Baker, and Scarlett Spears. The movie hits theaters on November 21st.",
  "summary": "When Jon M. Chu first announced that his big-screen Wicked adaptation would be split into two parts, there was concern about whether the original musical's second act could be fashioned into a fully fleshed-out movie. Compared to the stage show's lengthy first act, where all the musical's most recognizable songs are front-loaded, the second act [&#8230;]",
  "published": "2025-11-20T16:20:00-05:00",
  "url": "https://www.theverge.com/entertainment/825554/wicked-for-good-review",
  "source": "The Verge"
}