{
  "title": "Amazon scorpion venom shows stunning power against breast cancer",
  "text": "The venom of an Amazonian scorpion species may contain a compound capable of helping treat breast cancer, a disease that remains one of the top causes of death among women.\n\nResearchers at the University of São Paulo's Ribeirão Preto School of Pharmaceutical Sciences (FCFRP-USP) in Brazil have pinpointed a molecule in the toxin of Brotheas amazonicus that appears to attack breast cancer cells in a way similar to a widely used chemotherapy medication.\n\nThese early findings were generated through a collaboration with scientists from the National Institute for Amazonian Research (INPA) and the Amazonas State University (UEA), and were presented during FAPESP Week France in the Occitanie region of southern France.\n\n\"Through bioprospecting, we were able to identify a molecule in the species of this Amazonian scorpion that is similar to that found in the venoms of other scorpions and that acts against breast cancer cells,\" said Eliane Candiani Arantes, a professor at FCFRP-USP and the coordinator of the project.\n\nTurning Venom Components Into Biopharmaceutical Tools\n\nTeams at FCFRP-USP and partner institutions have long worked to clone and express bioactive molecules, including proteins from rattlesnake and scorpion venom. These efforts take place within projects supported by FAPESP and connected to the Center for Translational Science and Development of Biopharmaceuticals (CTS), housed at the Center for the Study of Venoms and Venomous Animals (CEVAP) at São Paulo State University (UNESP) in Botucatu.\n\nOne result of this research is CEVAP's patented fibrin sealant, described as a \"biological glue.\" It is produced from serinoproteinase enzymes extracted from snake venom (including Bothrops neuwiedi pauloensis and Crotalus durissus terrificus) combined with cryoprecipitate enriched with fibrinogen from buffalo, cattle, or sheep.\n\nWhen applied, these components form a fibrin structure resembling the body's natural clotting and tissue repair processes. The sealant has been investigated for use in nerve repair, bone healing, and restoring movement following spinal cord injury. It is currently undergoing phase three clinical trials, which represent the final evaluation stage required before approval of a new therapy.\n\nAdvancing Fibrin Sealant Technology Through Genetic Expression\n\nRecently, researchers cloned and expressed another rattlesnake serine protease known as cholinein-1. Its amino acid sequence differs from gyroxine, a toxin taken directly from rattlesnake venom and used in fibrin sealant production.\n\n\"Our idea now is to obtain this serine protease through heterologous expression [in a fragment or complete gene from a host organism that doesn't have it naturally] in Pichia pastoris,\" Arantes explained.\n\nUsing this same yeast species, first isolated in France in 1950, the researchers also plan to produce an endothelial growth factor called CdtVEGF. This molecule was originally identified in the venom of Crotalus durissus terrificus.\n\n\"This growth factor favors the formation of new vessels. If we combine it with colinein-1, we can create an improved fibrin sealant compared to the one being developed at CEVAP, with the possibility of expanding the industrial scale, since it can be obtained through heterologous expression,\" she said.\n\nThrough similar genetic expression approaches, the team identified two neurotoxins in scorpion venom with immunosuppressive effects. Working with collaborators at INPA and UEA, they also found a molecule named BamazScplp1 in the venom of Brotheas amazonicus that appears to have anti-tumor potential.\n\nLaboratory tests showed that the peptide's impact on breast cancer cells was comparable to paclitaxel, a commonly prescribed chemotherapy treatment. It primarily triggers necrosis, a form of cell death previously associated with molecules from other scorpion species.\n\n\"We also intend to obtain these molecules through heterologous expression,\" said Arantes.\n\nDeveloping New Cancer Therapies With Radioisotopes\n\nIn Campinas, in the state of São Paulo, researchers at a Research, Innovation and Dissemination Center (RIDC) funded by FAPESP -- the Cancer Theranostics Innovation Center (CancerThera) -- are pursuing a different therapeutic strategy. Their goal is to combine diagnosis and targeted treatment in a single approach.\n\nThis method originated in Germany and involves attaching various radioisotopes to molecules that target specific tumors. These tagged molecules can then be used in imaging and treatment.\n\n\"Depending on the type of radiation emitted by the isotope we attach to the molecule -- whether positron or gamma -- we can produce images of it using the tomography equipment available at CancerThera. When we document that an isotope captures too much of a particular molecule, we can replace it with another that emits more intense radiation locally and thus treat tumors,\" explained Celso Darío Ramos, a professor at the School of Medical Sciences at the State University of Campinas (FCM-UNICAMP) and one of CancerThera's lead researchers.\n\nOne group at the center focuses on identifying molecules that accumulate in different cancers, while the clinical team evaluates how known compounds might be repurposed.\n\n\"We've been studying known molecules from hematological cancers, primarily multiple myeloma, as well as other unknown molecules from head and neck cancer, liver cancer, sarcomas, lung cancer, colorectal cancer, and gastric cancer, among others. In addition, we've also been studying thyroid cancer, which has been treated with radioactive material, radioactive iodine, for many years, but some patients are resistant. That's why we're trying to identify another treatment possibility, with a different radioactive material, for these patients,\" Ramos told Agência FAPESP.\n\nA Personalized Cancer Vaccine Built From Dendritic Cells\n\nAnother experimental strategy is under development at the Biomedical Sciences Institute at the University of São Paulo (ICB-USP), where researchers are exploring an immunotherapy based on dendritic cells.\n\nThese cells are important components of the immune system, and their functioning is often compromised in cancer patients, explained José Alexandre Marzagão Barbuto, a professor at ICB-USP and the project coordinator.\n\n\"A few years ago it was discovered that it's possible to take monocytes from the blood cells of cancer patients and turn them into dendritic cells in the laboratory. But the dendritic cells produced in this way are often diverted to induce tolerance.\"\n\nTo address this issue, the team created dendritic cells from healthy donors and fused them with cancer cells from patients, producing a personalized vaccine designed to activate the immune system against the individual's own tumor.\n\nResults from studies involving various cancers, including more recent tests with glioblastoma patients, suggest that this strategy can be effective when the immune response it generates is properly controlled.\n\n\"The immune system interprets this vaccine, based on dendritic cells from a healthy donor fused with the patient's tumor cells, as a transplant and reacts violently,\" said Barbuto. \"We did the first studies on patients with melanoma and kidney cancer, and the results were very good, and others with glioblastoma. Now we're hoping to carry out a phase three clinical study.\"\n\nUsing AI to Improve MRI Predictions for Brain Cancer\n\nResearchers at the Cancer University Institute of Toulouse (IUCT-Oncopole) in France are also contributing to the understanding of glioblastoma. Their work investigates whether artificial intelligence applied to magnetic resonance imaging can reliably indicate whether chemotherapy patients have a DNA modification associated with treatment outcomes and survival.\n\nThe modification, known as \"MGMT promoter region methylation,\" influences how the MGMT protein is produced and regulated.\n\n\"MGMT methylation status is an important prognostic factor, but it requires biopsies that aren't necessarily representative of the entire tumor and can vary in recurrence,\" said Elizabeth Moyal, a researcher at IUCT-Oncopole and coordinator of the project.\n\nPartnering with computer scientist Ahmed Berjaoui from IRT Saint-Exupéry, the team adopted AI techniques originally designed for aerospace applications to help resolve these challenges.\n\n\"We've developed a model capable of predicting survival with high accuracy, ranging from 80% to 90%, and which surpasses other existing techniques,\" said Berjaoui.",
  "summary": "Scientists are turning venom, radioisotopes, engineered proteins, and AI into powerful new tools against cancer. From Amazonian scorpions yielding molecules that kill breast cancer cells as effectively as chemotherapy, to improved fibrin sealants and custom-grown bioactive factors, researchers are pushing biotechnology into uncharted territory. Parallel teams are advancing radiotheranostics that diagnose and destroy tumors with precision, while others forge experimental vaccines that train the immune system using hybrid dendritic cells.",
  "published": "Tue, 18 Nov 2025 02:27:48 EST",
  "url": "https://www.sciencedaily.com/releases/2025/11/251117095658.htm",
  "source": "All Top News -- ScienceDaily"
}