{
  "title": "Judge Isn’t Done With Trump Over Ignoring His Court Order",
  "text": "LOADING ERROR LOADING\n\nThe public could soon know who in the Trump administration knew about an alleged effort to ignore court orders barring the deportation of 137 men to a Salvadoran prison.\n\n“The bottom line is that the court has permitted me to go forward with my inquiry,” U.S. District Judge James Boasberg said Wednesday at the start of contempt proceedings that resumed inside a federal court in Washington, D.C..\n\nAdvertisement\n\nOnly a week ago, an appellate court ruled that Boasberg could properly resume a contempt inquiry into what the court called “shocking Executive Branch conduct” that began seven months ago after President Donald Trump invoked the Alien Enemies Act.\n\nThe invocation of the wartime authority, according to Trump, allowed him to lawfully deport migrants he deemed to be part of a criminal invasion of the U.S., namely those the administration claims are members of the Venezuelan gang Tren de Aragua.\n\nAfter invoking the 18th-century law, the administration filled up two planes with people it alleged were gang members and whisked them off to CECOT, a notorious prison in El Salvador.\n\nAdvertisement\n\nThose on the planes, according to their lawyers, were offered no chance at due process, including any opportunity to contest their removal or challenge claims that they were dangerous criminals. Boasberg blocked the administration from deporting noncitizens for at least two weeks but quickly learned from lawyers for the Justice Department that his order had been essentially rendered moot because planes he had ordered to be turned around were already in the air.\n\nBoasberg himself cannot hold the administration in contempt, and instead must make a referral to the Justice Department. From there, an independent prosecutor would be assigned to review evidence from the court.\n\nAdvertisement\n\nThat is what Boasberg is unfurling now.\n\nBoasberg told Justice Department lawyers on Wednesday that he is interested in hearing testimony from high-ranking government officials, including Deputy Assistant Attorney General Drew Ensign. He said he’d also like to hear from Erez Reuveni, a career prosecutor at the Justice Department who was abruptly fired after he admitted in court that the administration had mistakenly deported Maryland resident Kilmar Abrego Garcia to CECOT.\n\nReuveni, who served as the head of the DOJ’s Office of Immigration Litigation until his termination, blew the whistle on the department in June.\n\nIn a complaint filed with the DOJ’s Office of the Inspector General, Congress and the U.S. Office of Special Counsel, Reuveni alleged that Justice Department lawyers were explicitly instructed to say “fuck you” to judges who ruled against them. Reuveni also accused Ensign of misleading Boasberg “willfully” about the status of the deportation flights. The career prosecutor also alleged in his complaint that his emails to administration officials highlighting Boasberg’s order were ignored.\n\nAdvertisement\n\nReuveni alleged guidance to defy the courts was sent down from Emil Bove, Trump’s onetime personal lawyer-turned-deputy attorney general who was later confirmed to a lifetime judgeship.\n\nFlanked by his attorneys Todd Blanche, left, and Emil Bove, right, Donald Trump awaits the start of proceedings in Manhattan Criminal Court on May 28, 2024, in New York. Blanche is now U.S. deputy attorney general, and Bove has a lifetime seat on the 3rd U.S. Circuit Court of Appeals. AP Photo/Julia Nikhinson, Pool\n\nLawyers for the government, as well as attorneys for the deported men, will start filing proposals by Monday on how they believe proceedings should unfold, including which witnesses to call or who might be able to skate by with a written declaration to the court.\n\nAdvertisement\n\nThe American Civil Liberties Union is representing the deported men, and attorney Lee Gelernt told Boasberg on Wednesday that those deported are still suffering trauma and injury from their time at CECOT. Most of those sent to El Salvador and then later to Venezuela are only asking to have their day in court, he added.\n\nThey understand that they still may be subject to deportation, he said, but they want their due process and a chance to show they aren’t gang members, at the very least.\n\nAnd it’s been next to impossible to facilitate due process for these men from afar, Gelernt explained.\n\nAdvertisement\n\nMost have a “real fear” of talking about their case on the phone with lawyers.",
  "summary": "Some high-ranking officials could be called forward to testify.",
  "published": "Wed, 19 Nov 2025 18:09:44 -0500",
  "url": "https://www.huffpost.com/entry/contempt-for-trump-judge-resumes-probe-over-alien-enemy-act-deportations_n_691e3bbfe4b06f2a60cb89fe",
  "source": "Politics"
}