{
  "title": "COP30 climate talks evacuated after fire breaks out",
  "text": "COP30 climate talks evacuated after fire breaks out\n\nWatch: Fire breaks out at COP30\n\nThe talks were in the final hours of trying to agree on next steps to tackle climate change but the fire has disrupted negotiations and the talks remain closed.\n\nThe UN said the fire was extinguished after six minutes and 13 people were treated for smoke inhalation. It is not yet known what caused the blaze.\n\nBBC journalists saw flames and smoke in the pavilion area before they were rushed outside where fire engines raced past.\n\nThe UN climate talks COP30 have been evacuated due to a fire breaking out inside the venue in Belém, Brazil.\n\nThe fire appears to have started in one of the summit's country pavilions\n\n\"It was climbing the walls and onto the ceiling. People were screaming,\" Dr Harshita Umesh, who was giving a talk next to the place where they fire broke out, told BBC News.\n\n\"Then I ran, I think I tripped and fell.\"\n\nDr Umesh, who is a medical doctor, said that ambulance staff told her that first responders inhaled \"toxic fumes\" and were given oxygen masks to the site.\n\nEmergency medicine specialist Kimberly Humphrey, currently helping patients at the COP medical centre, told the BBC that the injuries are \"Mainly people with smoke inhalation, someone with a lung injury from smoke.\"\n\n\"People are pretty traumatised and shocked,\" she added.\n\n\"There's a huge panic, people have been running out of here, it's a very dramatic moment... UN security guards are telling us to leave,\" said BBC Climate Editor Justin Rowlatt shortly after the fire broke out.\n\n\"You can see huge columns of smoke rising up into the air through the hole that's been burnt in the top of the conference centre,\" he said.\n\nBBC journalists saw two ambulances driving towards the entrance more than 90 minutes after the fire started.\n\nA Brazilian security officer putting a chain through the gates of the venue with a chain told the BBC the premises must be evacuated and locked.\n\nAfter the fire broke out, orange flames burned a hole through the sheeting that covers the venue, which is in a former aerodrome. One video shows a man spraying a fire extinguisher at the fire before running away.\n\nOne eyewitness told the BBC that he believes an electrical fire was the cause.\n\nA woman was taken away in a wheelchair, but it is not clear if that was connected to the fire.\n\nHundreds of people were left sitting on the floor or on plastic chairs outside in high temperatures and humidity.\n\nThe fire is likely to delay the closing of a deal in the talks.\n\nA number of country delegations were forced to take shelter outside under the roof of a petrol station, a member of the UK delegation told the BBC. He said the fire halted negotiations.\n\nThe UN, which runs COP climate meetings, said the fire brigade is checking the venue to assess safety and that the summit has been temporarily taken over by Brazilian authorities.\n\nThousands of people are attending the UN climate talks, including members of delegations from around the world.\n\nNearly 200 countries are trying to agree on how to make progress in tackling climate change.",
  "summary": "Thousands of people are attending the UN climate talks in Brazil.",
  "published": "Thu, 20 Nov 2025 19:13:21 GMT",
  "url": "https://www.bbc.com/news/articles/ce9d9p5jrjgo?at_medium=RSS&at_campaign=rss",
  "source": "BBC News"
}