{
  "title": "Americans Are Absolutely Losing Their Minds Over Dr. Oz's Ridiculous 'Solution' To Rising Health Insurance Costs",
  "text": "LOADING ERROR LOADING\n\nIf you’ve had a chance to look into your health insurance options for 2026, odds are you’ve noticed costs going up. People who get their plans through the Affordable Care Act’s state exchanges are seeing premiums that are about 30% higher than what they paid this year.\n\nMediaphotos / Getty Images\n\nAdvertisement\n\nPeople who get insurance through their employers are likely to see higher costs as well. Premiums for company-sponsored health plans have risen around 6–7% on average.\n\nTwenty47studio / Getty Images\n\nWith other costs like groceries and housing putting pressure on Americans’ stretched budgets, Dr. Mehmet Oz, Administrator for the Centers for Medicare & Medicaid Services, shared some “advice” for people who want to lower their healthcare costs, and it’s going viral for all the wrong reasons.\n\nAndrew Harnik / Getty Images\n\nIn a Fox News appearance, Oz claimed that obesity is behind “probably a quarter of all healthcare expenses,” which doesn’t seem to be accurate. According to the Centers for Medicare & Medicaid Services, US healthcare spending totaled $4.9 trillion in 2023. The Centers for Disease Control states that obesity-related healthcare costs add up to about $173 billion a year.\n\nOz went on to say, “So if you really want to drop the cost of healthcare in America, get healthier.”\n\nTop Trump official Dr. Oz: If you really want to drop the cost of health care in America, get healthier. pic.twitter.com/G3PvRhzJsY — FactPost (@factpostnews) November 17, 2025\n\nAdvertisement\n\nIn response, some people are sharing stories that illustrate why “just be healthier” is so much easier said than done. Our health is really complex, and it’s possible to do all the “right” things and still get sick. This doesn’t make maintaining healthy habits any less worthwhile, but it’s just a fact of life that our health status isn’t entirely up to us.\n\nIt just comes off as pretty clueless advice, especially coming from an actual doctor.\n\nAdvertisement\n\nOthers pointed out that all the healthy habits in the world won’t pay the medical bills if you happen to be injured in an accident.\n\nAnd don’t even get me started on the costs of having a baby.\n\nAdvertisement",
  "summary": "\"Stuff like this does nothing...\"",
  "published": "Thu, 20 Nov 2025 16:05:19 -0500",
  "url": "https://www.huffpost.com/entry/dr-oz-healthcare-costs-advice_n_691f7982e4b071a086ba42cb",
  "source": "Politics"
}