{
  "title": "This Home Robot Clears Tables and Loads the Dishwasher All by Itself",
  "text": "Memo may not be the world’s fastest barista, but it is impressive—for a robot.\n\nI recently watched as Memo, a new home robot from a company called Sunday Robotics, made coffee in an open-plan kitchen in Mountain View, California.\n\nMemo looks like something out of Wall-E, with a gleaming white body, two arms, a friendly cartoonish face, and a red baseball cap. Rather than using legs as a fully humanoid robot would, Memo moves around using a wheeled platform and changes its height by sliding up and down a central column atop that platform.\n\nThe robot responded to a request for an espresso by rolling over to a countertop, and then using two pincerlike hands to slowly go through each step required to operate an espresso machine. It filled the porta filter with coffee grounds, tamped them down, slotted the porta filter into place and put a coffee cup below, pressed the buttons needed to start the machine, and finally retrieved the hot drink.\n\n“We want to build robots that free people from laundry, from the dishes, from all chores,” Tony Zhao, cofounder and CEO of Sunday Robotics, told me as the robot brought the coffee over to the person who requested it.\n\nMaking a cup of espresso might not seem spectacular, but the feat is ridiculously hard for a robot to do in a real, messy kitchen. It requires the ability to identify different objects, figure out how to grasp them reliably, and use those objects properly. Sunday is not only building its own hardware but also training the models that allow its system to learn. “We think the way to make a home robot is to be full-stack, and to vertically integrate,” Zhao says. “And that’s a very ambitious thing to do.”",
  "summary": "Sunday Robotics has a new way to train robots to do common household tasks. The startup plans to put its fully autonomous robots in homes next year.",
  "published": "Wed, 19 Nov 2025 17:00:00 +0000",
  "url": "https://www.wired.com/story/memo-sunday-robotics-home-robot/",
  "source": "WIRED"
}