{
  "title": "Infant botulism outbreak doubles; ByHeart confirms bacteria in formula",
  "text": "ByHeart announced on Thursday that its own testing identified the bacterium that causes botulism in its baby formula, which is linked to an ongoing infant botulism outbreak that has doubled since last week.\n\nAs of November 19, there have been 31 cases across 15 states—up from 15 cases in 12 states reported last week. All 31 cases so far have been hospitalized. No deaths have been reported.\n\nThe outbreak was announced on November 8, and ByHeart was, at first, unusually aggressive in deflecting blame for linked illnesses.\n\nThe link between infant botulism cases and ByHeart was first spotted by the California Department of Public Health (CDPH). The department is the world’s sole source of the infant botulism treatment BabyBIG, and, as such, is contacted when any infant botulism cases arise. CDPH started to notice a pattern of ByHeart exposure among the cases. While ByHeart products account for just 1 percent of infant formula sales, babies fed ByHeart formula accounted for 40 percent of infant botulism cases with dry formula exposure between August 1 and November 10. Soon, preliminary testing by the department identified the bacterium that causes botulism—Clostridium botulinum—in an opened can of ByHeart from one of the sick babies.\n\nChanging tune\n\nHowever, ByHeart didn’t buy it. In a video posted to social media the day the outbreak was announced, one of ByHeart’s co-founders, Mia Funt, said: “I want to make something really clear: There is no reason to believe that infant formula can cause infant botulism.” Funt claimed that “multiple regulatory bodies” have concluded that formula can’t cause infant botulism, and the US Food and Drug Administration has never found a “direct connection” between formula and infant botulism. She added that no “toxins” have been found in the formula.",
  "summary": "ByHeart said \"there's no reason to believe\" until its own testing found a reason.",
  "published": "Thu, 20 Nov 2025 22:33:27 +0000",
  "url": "https://arstechnica.com/health/2025/11/from-defiant-to-contrite-formula-maker-confirms-bacteria-amid-botulism-outbreak/",
  "source": "Ars Technica - All content"
}