{
  "title": "INDIA bloc: Cong reaffirms alliance commitment; vows stronger coordination",
  "text": "NEW DELHI: Amid the rumblings triggered by the opposition's comprehensive defeat in Bihar, Congress said it was committed to INDIA bloc and would double efforts to strengthen the national alliance.AICC general secretary K C Venugopal said the INDIA bloc was put together as an arrangement at the national level for like-minded parties to coordinate their efforts to counter BJP's regressive politics. \"Nothing has changed since it was formed. Congress is committed to INDIA and will make further efforts to boost its efficacy,\" he told TOI. The Congress manager also said the opposition would continue with its coordination in Parliament when the winter session gets under way on Dec 1.Doubts about the fate of the opposition alliance have surfaced on social media after the decimation suffered by the RJD-Congress combine in the recent Bihar elections , where it was roundly defeated by the JDU-BJP coalition. Some Congress netas too have advocated that in future, the party should move independently in Bihar by junking ally RJD. Some of the questions have also been stoked by the likelihood of Congress contesting the upcoming Bombay Municipal Corporation elections separate from NCP and Shiv Sena (UBT), which are its allies in Maha Vikas Aghadi.Venugopal, however, rubbished the speculations.Many Congress netas said the alliance was intrinsic to the politics of the party, as it would soon be fighting in Tamil Nadu as DMK's junior partner, and would go into the future Assam polls as part of a coalition that is already being stitched.Venugopal said municipal and panchayat elections were local contests, where decisions on alliances were made by local units based on political ground realities, like in BMC. \"But even there, the idea would be to defeat BJP,\" he said. The Kerala MP, who is a confidant of Rahul Gandhi, said while nothing had changed since the national alliance was formed, members were aware there would be differences in a few states, like West Bengal and Kerala. \"We will still fight separately in the two states. But the larger alliance will remain intact,\" he said.",
  "summary": "Amidst opposition setbacks, Congress reaffirms its commitment to the INDIA bloc, vowing to strengthen the national alliance. Despite local electoral divergences, the party emphasizes its dedication to coordinating efforts against the BJP's politics at the national level.",
  "published": "Fri, 21 Nov 2025 04:46:18 +0530",
  "url": "https://timesofindia.indiatimes.com/india/will-strengthen-india-bloc-says-congress/articleshow/125474486.cms",
  "source": "Times of India"
}