{
  "title": "New plant leaf aging factor found",
  "text": "\"ADFs are involved not only in leaf aging but also in disease response and plant growth control,\" Professor Inada explained. \"Further elucidation of the function of ADFs can help contribute to crop yield improvement and enhanced sustainability of agricultural production.\"\n\nThe Osaka Metropolitan University research team of Graduate School of Agriculture student Tomoko Matsumoto and Professor Noriko Inada and Graduate School of Science Professor Koichi Kobayashi discovered that thale cress (Arabidopsis thaliana) plants with the mutant Actin Depolymerizing Factor protein turn yellow sooner over time and in dark conditions compared to wild-type thale cress.\n\nResistance to disease should mean a longer life, but researchers have found that a mutant protein that helps a plant fight mildew might make it age sooner.\n\nMaterials provided by Osaka Metropolitan University . Note: Content may be edited for style and length.\n\nRELATED STORIES\n\nScientists explored the evolutionary success of leaf beetles, the most diverse herbivores on Earth. They showed that symbioses with bacteria have evolved repeatedly and independently in different ...\n\nAn international research team has described seven previously unknown species of leaf insects, also known as walking leaves. The insects belong to the stick and leaf insect order, which are known for ...\n\nA team or researchers reports the first Aging Fly Cell Atlas (AFCA), a detailed characterization of the aging process in 163 distinct cell types in the laboratory fruit fly. Their in-depth analysis ...\n\nA research group has found that sudden changes in the development of a nighttime cold-air pool over a small mountain basin in Japan are related to leaf expansion and leaf fall in mountain forests. ...\n\nAn international team of 114 scientists reports the most comprehensive study of aging and longevity to date of reptiles and amphibians worldwide. Among their many findings, they document for the ...\n\nNewly published research has used a critically endangered species to show how trees modify leaf function to best exploit prevailing light conditions. The findings revealed numerous leaf traits that ...\n\nThe First Hooved Reptile: Dinosaur “Mummies” Reveal a Shocking Evolutionary Twist\n\nA Massive Geomagnetic Superstorm Crushed Earth’s Plasma Shield\n\nNew Microwave Technique Could Turn CO2 Into Fuel Far More Efficiently\n\nDoctors “Astounded”: Long-Held Belief About Coffee and Heart Rhythm Was Wrong",
  "summary": "Researchers have discovered a protein that is involved in plant leaf aging.",
  "published": "Fri, 30 May 2025 12:42:54 EDT",
  "url": "https://www.sciencedaily.com/releases/2025/05/250530124254.htm",
  "source": "Latest Science News -- ScienceDaily"
}