{
  "title": "COP30: Draft of ‘political’ agreement on climate finance, trade measures released in Brazil",
  "text": "Countries at the 2025 United Nations Climate Change Conference (COP30) have been working to finalise a ‘political’ agreement, aiming to address long-standing concerns of various countries, including India, on climate finance and trade-related unilateral measures.\n\nA first draft of this ‘political’ agreement, a result of days of consultations facilitated by the COP30 hosts, Brazil, was released Tuesday, listing options for addressing each of these contentious issues. It reflected the wide divergences in the positions of different countries on these issues. Brazil said it hoped to resolve these differences by Wednesday, and a fresh draft was expected by evening.\n\nThe ‘political’ agreement, currently known by different names, is meant to address four issues that could not be accommodated on the conference’s official agenda due to the firm and divergent opinions of the countries on these issues.\n\nThe political agreement does not hope to resolve these issues. It will only acknowledge these concerns and create new processes or platforms within the formal climate negotiations to discuss and resolve them in the future.\n\nIndia, along with many other developing countries, has been raising two of the four issues for the past year. One pertains to the full implementation of Article 9.1 of the Paris Agreement, which states that developed nations “shall provide” financial resources to developing nations to address climate change.\n\nThe Paris Agreement is an international treaty adopted in 2015 to combat climate change by limiting global warming to well below 2 degrees Celsius, and preferably 1.5 degrees Celsius.\n\nContention of India and other developing nations\n\nThe contention of India and other developing countries is that a comprehensive agreement on climate finance reached in Baku, Azerbaijan, at the COP29 meeting last year had completely ignored this provision, and only addressed the obligation set in Article 9.3, which asks developed nations “to continue to take the lead in mobilising climate finance”.\n\nStory continues below this ad\n\nThe second issue that India, China and some other developing countries have been flagging relates to trade-related restrictive measures, such as the European Union’s Carbon Border Adjustment Mechanism (CBAM), which imposes tariffs on imported goods whose carbon footprint during manufacturing exceeds what is allowed for producers within the EU. India, China, and others have argued that CBAM is a discriminatory trade practice disguised as climate action.\n\nThe other issues are mainly concerns of developed nations, which want to see enhanced mitigation actions in pursuit of the 1.5 degrees Celsius global warming target and greater transparency in reporting on climate actions.\n\nWeaved into these four issues are demands to increase adaptation finance by at least three times from current levels by 2030 and to accelerate efforts to phase out fossil fuels at the earliest.\n\nTransitioning from fossil fuels\n\nOn Tuesday, more than 80 countries, led by European countries and small island states, issued a call for inclusion of a roadmap for a phase-out of fossil fuels in the political agreement being negotiated.\n\nStory continues below this ad\n\nThis roadmap is meant to build on the landmark agreement reached at COP28 in Dubai, which, for the first time in climate negotiations, mentioned “transitioning away from fossil fuels”. These countries argue that an accelerated phase-out of fossil fuels was essential to pursue the 1.5 degrees Celsius temperature target mentioned in the Paris Agreement.\n\nWith countries having widely divergent stands on these issues, an early agreement over the draft, as Brazil has been pushing for, seems extremely difficult. The first draft released Tuesday listed various options to address these concerns, but none of the country groups were satisfied.\n\nCOP30 President André Aranha Corrêa do Lago wrote a letter to all the parties Tuesday, asking them to continue with the process of Mutirao, which translates to a collective mobilisation of minds, hearts and hands, to reach an agreement by Wednesday.\n\n“We propose to complete a significant part of our work by tomorrow (Wednesday) evening, so that a plenary to gavel the Belém political package may take place by the middle of the week. In undertaking our mutirão, we propose we prioritize work on issues that are interrelated and interdependent, apart from issues that require technical work that can be treated autonomously,” Lago’s letter said.\n\nStory continues below this ad\n\nBrazil President Luiz Inácio Lula da Silva will be present at the conference Wednesday to facilitate the efforts to forge an agreement.",
  "summary": "",
  "published": "Wed, 19 Nov 2025 12:32:34 +0000",
  "url": "https://indianexpress.com/article/india/cop30-political-agreement-climate-finance-trade-measures-released-brazil-10374608/",
  "source": "India | The Indian Express"
}