{
  "title": "White House walks back Trump’s suggestion of executing Democrats, stands by ‘piggy’ insult to reporter– as it happened",
  "text": "From 2h ago 02.54 GMT Closing summary This concludes our live coverage of the second Trump administration for the day, but we will be back on Friday. Here are the latest developments: White House press secretary Karoline Leavitt said Donald Trump does not want to see Democratic members of Congress executed, after he posted that six Democrats who are service veterans were guilty of sedition, “punishable by DEATH!”, after they posted a video telling members of the military to “refuse illegal orders”.\n\nThe acting commander of the US Coast Guard told lawmakers that the display of swastikas and nooses will remain prohibited by the service, despite a new policy on harassment posted on a Pentagon website last week that removed the term “hate incident” and cast the symbols as merely “potentially divisive”.\n\nA federal judge temporarily halted Trump’s deployment of national guard troops to Washington DC.\n\nTrump and JD Vance were not invited to Dick Cheney ’s funeral.\n\nUkrainian president Volodymyr Zelenskyy said he will negotiate with Trump on a US-backed peace plan that calls for Ukraine to make painful concessions in order to end Russian president Vladimir Putin ’s invasion of his country.\n\nNydia Velázquez , a Democratic congresswoman from New York, announced on Thursday that she will not seek reelection in 2026 and instead retire at the end of her term.\n\nMahmoud Khalil , a Palestinian American activist and former Columbia University graduate student who was detained by US immigration authorities, sued the Trump administration for information on its communications with anti-Palestinian organizations prior to his arrest.\n\nThe Trump justice department sued California for allowing undocumented college students to pay in-state tuition for public universities. Share\n\n2h ago 02.42 GMT Coast Guard commander says swastikas and nooses remain banned, despite new policy calling them just 'potentially divisive' The acting commander of the US Coast Guard, Admiral Kevin Lunday, told lawmakers on Thursday that the display of swastikas and nooses will remain prohibited by the service, despite a new policy on harassment posted online this month which casts the symbols as merely “potentially divisive”. While a spokesperson for the Department of Homeland Security, which oversees the Coast Guard, described a Washington Post report on the change in policy as “fake crap,” the new harassment policy was spelled out in a document titled “Harassing Behavior Prevention, Response and Accountability,” that was cleared for public release and currently remains posted on a Pentagon website. “The terminology ‘hate incident’ is no longer present in policy,” the document, attributed to Rear Admiral Charles Fosse, the Coast Guard’s head of personnel, states. “Conduct previously handled as a potential hate incident, including those involving symbols widely identified with oppression or hatred, is processed as a report of harassment in cases with an identified aggrieved individual”. “The public display of divisive symbols and flags, including those widely identified with oppression or hatred, can undermine unit cohesion and marginalize segments of our workforce,” a later section states. But the policy no longer refers to the display of those symbols as a punishable hate incident. Instead, the policy document states: Potentially divisive symbols and flags include, but are not limited to, the following: a noose, a swastika, and any symbols or flags co-opted or adopted by hate-based groups as representations of supremacy, racial or religious intolerance, or other bias.” Following an uproar from lawmakers, including senators who are considering Lunday’s nomination to be the Coast Guard commandant, the admiral assured Lauren Underwood, a Democratic congresswoman from Illinois, that both the public and private display of swastikas and nooses will be barred. Share Updated at 02.43 GMT\n\n4h ago 01.35 GMT Trump sues California for third time in a week Donald Trump’s Justice Department sued California on Thursday for allowing undocumented college students to pay in-state tuition for public universities. “California is illegally discriminating against American students and families by offering exclusive tuition benefits for non-citizens,” Attorney General Pamela Bondi said in a statement. “This marks our third lawsuit against California in one week — we will continue bringing litigation against California until the state ceases its flagrant disregard for federal law.” California law does allow some students to qualify for in-state tuition rates, which are lower than out-of-state tuition, even if they technically qualify as non-residents. This includes students who have had “three full-time years or the equivalent at any combination” of California high school, California adult high school, or California community college. The California Dream Act, two bills passed in 2011, permits undocumented students to apply for, and obtain, state-based financial assistance, according to San Francisco State University. Undocumented students cannot receive federal financial aid for college. The Justice Department’s civil complaint alleges that California policy on undocumented student tuition is “unconstitutional” and wants a judge to “declare it illegal and permanently enjoin its enforcement.” Share Updated at 01.37 GMT\n\n4h ago 01.01 GMT New York City Mayor-elect Zohran Mamdani has commented on an anti-Israel protest outside a Manhattan synagogue this week. The protest outside Park East Synagogue on Wednesday was over an event inside that was promoting Jewish immigration to Israel, according to Haaretz. Some protesters chanted “death to the IDF” and “from New York to Gaza, globalize the intifada,” Haaretz reported. A representative for Mamdani said he “has discouraged the language used” at the demonstration and that “every New Yorker should be free to enter a house of worship without intimidation, and that these sacred spaces should not be used to promote activities in violation of international law,” Haaretz said. Share\n\n5h ago 00.30 GMT The White House on Thursday backed Donald Trump’s “quiet, piggy” comment to a female reporter last week, claiming that this controversial statement was in keeping with his commitment to frankness. “He calls out fake news when he sees it and gets frustrated with reporters who spread false information,” White House Press Secretary Karoline Leavitt said at a press conference, according to Reuters. “But he also provides unprecedented access to the press and answers questions on a near-daily basis.” Leavitt’s comment was in response to an inquiry about the incident that unfolded when Bloomberg’s White House correspondent asked Trump about the Jeffrey Epstein scandal during a question-and-answer opportunity aboard Air Force One. As the reporter, Catherine Lucey, tried to question Trump, he pointed and remarked: “Quiet. Quiet, piggy.” Reuters noted that Leavitt did not provide an example of false information that had been reported. Share Updated at 00.43 GMT\n\n5h ago 00.07 GMT New York governor Kathy Hochul joined other Democrats in praising New York Congresswoman Nydia Velázquez, the first Puerto Rican woman elected to Congress, following the longtime representative’s retirement announcement. “Congresswoman Nydia Velázquez is a trailblazer whose leadership has opened doors for generations of New Yorkers. As the first Puerto Rican woman elected to Congress, she has never forgotten where she came from, and she has never stopped fighting for the people she serves,” Hochul said in a statement about her Democratic colleague. “For more than three decades, she has led with unshakable purpose and delivered meaningful progress for women, veterans, immigrants and communities too often left behind,” Hochul also said. “We became friends when I served with her in Congress, and I’ve continued to seek her wisdom as Governor. I thank her for her service and wish her nothing but the very best in this next chapter. She will continue making a difference in everything she does.” Share\n\n5h ago 23.50 GMT Mahmoud Khalil, a pro-Palestinian activist and former Columbia University graduate student who had been detained by US immigration authorities, sued the Trump administration on Thursday for information on its communications with anti-Palestinian organizations prior to his arrest in March. The Center for Constitutional Rights, which is representing Khalil, said these organizations have taken credit for his detention. According to the Center for Constitutional Rights, evidence--such as testimony from an Immigration and Customs Enforcement (ICE) official-- indicates that Trump’s administration acted against Khalil and other activists based on information from these anti-Palestinian groups. “For months, shady organizations and individuals carried out a smear and harassment campaign designed to intimidate and silence me,” Khalil said in a statement provided by the Center for Constitutional Rights. “The public deserves full accountability for every bad actor who helped make that possible, including those at Columbia who fabricated and amplified these smears and opened the door for state retaliation against Palestinian speech.” Khalil is fighting the Trump administration’s push to deport him. Share\n\n6h ago 22.46 GMT Trailblazing Democratic congresswoman Nydia Velázquez to make way for 'a new generation of leaders' Nydia Velázquez, a Democratic congresswoman from New York, announced on Thursday that she will not seek reelection in 2026 and instead retire at the end of her term. Velázquez, 72, said in a statement that she had decided that it is time “for a new generation of leaders to step forward.” In 1992, she became the first Puerto Rican woman elected to Congress and has represented parts of Brooklyn into Queens ever since. View image in fullscreen Nydia Velázquez, a Puerto Rican-born Democratic congresswoman from New York, called for aid to victims of Hurricane Maria in Puerto Rico and the US Virgin Islands in 2017. Photograph: Tom Williams/CQ-Roll Call,Inc. Velázquez noted that she “grew up in a small town of sugar cane fields in Yabucoa, Puerto Rico” but moved to New York as a teenager to pursue a master’s degree. “New York took me in, welcomed me, and presented possibilities,” she added. “I fell in love with its energy and with the people who make this city what it is. In New York, I found my voice, discovered my purpose, and dedicated myself to the fight for justice and opportunity.” “New York’s recent mayoral election showed that American are hungry for change,” Velázquez wrote, in reference to the victory of Zohran Mamdani, the demicratic socialist she supported. The congresswoman pledged to “continue fighting for the city I love and for an end to Puerto Rico’s colonial status.” Michael Blake, a progressive who is challenging another New York City Democrat, Ritchie Torres, for a seat in Congress, responded to Velázquez’s announcement on social media by writing: “You are a guiding light & Inspiration Thank you for empowering generations to service”. Amanda Litman, co-founder of Run for Something, an organization that encourages young people to seek elected office, added: “A true force modeling selfless leadership - thank you for your service, Rep. Velazquez, and for making space for a new generation to step up.” Share Updated at 23.01 GMT\n\n7h ago 21.53 GMT Federal judge accuses border patrol chief Greg Bovino of 'outright lying' in testimony In a written opinion issued on Thursday, US district judge Sara Ellis accused Greg Bovino, the border patrol chief who has become the face of the Trump administration’s mass deportation efforts, of “outright lying” in testimony about the use of force against protesters in Chicago during immigration sweeps. “Turning to Bovino, the Court specifically finds his testimony not credible,” the federal judge wrote. “Bovino appeared evasive over the three days of his deposition, either providing ‘cute’ responses to Plaintiffs’ counsel’s questions or outright lying.” The judge then listed multiple examples of false claims from Bovino that were directly contradicted by video evidence reviewed in court. Ellis wrote [citations to specific pieces of video evidence have been removed for clarity]: When shown a video of agents hitting Rev. Black with pepper balls, Bovino denied seeing a projectile hit Rev. Black in the head. … In another video shown to Bovino, he obviously tackles Scott Blackburn, one of Plaintiffs’ declarants. … But instead of admitting to using force against Blackburn, Bovino denied it and instead stated that force was used against him. … Most tellingly, Bovino admitted in his deposition that he lied multiple times about the events that occurred in Little Village that prompted him to throw tear gas at protesters. As discussed further below, Bovino and DHS have represented that a rock hit Bovino in the helmet before he threw tear gas. … Bovino was asked about this during his deposition, which took place over three days. On the first day, Bovino admitted that he was not hit with a rock until after he had deployed tear gas. … Bovino then offered a new justification for his use of chemical munitions, testifying that he only threw tear gas after he “had received a projectile, a rock,” which “almost hit” him. … Despite being presented with video evidence that did not show a rock thrown at him before he launched the first tear gas canister, Bovino nonetheless maintained his testimony throughout the first and second days of his deposition…. But on November 4, 2025, the final session of his deposition, Bovino admitted that he was again “mistaken” and that no rock was thrown at him before he deployed the first tear gas canister. In a footnote, the judge pointed out that body-camera video revealed that, “in at least one instance, an agent asked ChatGPT to compile a narrative for a report based off of a brief sentence about an encounter and several images.” “To the extent that agents use ChatGPT to create their use of force reports, this further undermines their credibility and may explain the inaccuracy of these reports”, Ellis wrote. Share Updated at 23.09 GMT\n\n8h ago 20.51 GMT Here's a recap of the day so far The White House said today that Donald Trump does not want to see Democratic members of Congress executed. Earlier, the president fired off several posts on Truth Social accusing six Democrats of sedition, and saying that their behavior is “punishable by DEATH!”, after they posted a video telling members of the military that they are able to “refuse illegal orders”. Notably, Trump also shared posts that called for the Democrats to be removed from office, arrested, or killed. One user, who the president reposted, wrote: “HANG THEM GEORGE WASHINGTON WOULD !!” Today, press secretary Karolin Leavitt said that lawmakers in the video “conspired” to encourage active duty service members to “defy the president’s lawful orders”.\n\nThe six Democratic members of Congress who took part in the video, all of whom are veterans or worked in the intelligence community, said they would not be intimidated by the president’s comments. “Our service members should know that we have their backs as they fulfill their oath to the Constitution and obligation to follow only lawful orders. It is not only the right thing to do, but also our duty,” they wrote in a statement. Meanwhile, House Democratic leadership condemned Trump’s comments. “Political violence has no place in America,” said House minority leader Hakeem Jeffries, Democratic whip Katherine Clark and Democratic caucus chair Pete Aguilar said. “Donald Trump must immediately delete these unhinged social media posts and recant his violent rhetoric before he gets someone killed,” they added.\n\nUkrainian president Volodymyr Zelenskyy, has said he will negotiate with Donald Trump on a US-backed peace plan that called on Kyiv to make painful concessions in order to end the Kremlin’s invasion of his country. Zelenskyy’s office on Thursday confirmed that he had received the draft peace plan, which was prepared by US and Russian officials, and that he would speak with Trump in the coming days about “existing diplomatic opportunities and the main points that are necessary for peace”. In a statement, Zelenskyy’s office added: “We agreed to work on the points of the plan so that it would bring a worthy end to the war.”\n\nA federal judge temporarily halted Donald Trump’s deployment of national guard troops to Washington DC. District judge Jia Cobb, an appointee of Joe Biden, temporarily blocked the Trump administration from deploying troops to enforce the law in the nation’s capital without approval from its mayor. The ruling applies to the roughly 2,000 members of the guard who were deployed to DC, when Trump instituted a crime crackdown at the end of the summer. Her decision won’t take effect until 11 December, to allow the administration time to appeal.\n\nAlso today, Donald Trump and JD Vance were snubbed, by not being invited to Dick Cheney’s funeral. Cheney, the former vice-president to George W Bush, and a Republican defense hawk who became a fierce critic of the current US president, died earlier this month at the age of 84. At his service today, attended by several high-profile political figures, his daughter, Liz Cheney, delivered a eulogy. Without overtly attacking the president she alluded to her father’s role in her decision to lead the effort to hold Trump to account for his role in the January 6 insurrection by his supporters. A reminder that Cheney is the former Republican congresswoman who served as the vice-chair of the House January 6 committee and was deeply critical of Trump’s role in the Capitol riot.\n\nThe US jobs market added 119,000 jobs in September, according to the latest monthly jobs report, which was delayed by six weeks due to the shutdown of the federal government. Amid heightened uncertainty surrounding the strength of the US economy, the much-anticipated reading was stronger than the 51,000 jobs expected by analysts to be added in September. The unemployment rate, meanwhile, remained steady at 4.4%. Share Updated at 20.58 GMT\n\n8h ago 20.48 GMT Federal judge blocks Trump's deployment of national guard to DC A federal judge temporarily halted Donald Trump’s deployment of national guard troops to Washington DC. District judge Jia Cobb, an appointee of Joe Biden, temporarily blocked the Trump administration from deploying troops to enforce the law in the nation’s capital without approval from its mayor. The ruling applies to the roughly 2,000 members of the guard who were deployed to DC, when Trump instituted a crime crackdown at the end of the summer. Her decision won’t take effect until 11 December, to allow the administration time to appeal. Share\n\n9h ago 20.20 GMT Zelenskyy to negotiate with Trump over US-Russia peace deal requiring painful concessions My colleagues, Luke Harding and Andrew Roth, report that the Ukrainian president, Volodymyr Zelenskyy, has said he will negotiate with Donald Trump on a US-backed peace plan that called on Kyiv to make painful concessions in order to end the Kremlin’s invasion of his country. Zelenskyy’s office on Thursday confirmed that he had received the draft peace plan, which was prepared by US and Russian officials, and that he would speak with Trump in the coming days about “existing diplomatic opportunities and the main points that are necessary for peace”. “We agreed to work on the points of the plan so that it would bring a worthy end to the war,” Zelenskyy’s office said in a statement. The cautious response from Ukraine’s presidential administration followed angry denouncements of the plan by some Ukrainian officials who called it “absurd” and unacceptable. Zelenskyy’s public statement came as he held talks on Thursday with a high-ranking US military delegation, led by the army secretary Dan Driscoll. Zelenskyy to negotiate with Trump over US-Russia peace deal requiring painful concessions Read more Share",
  "summary": "<p>This live blog is now closed.</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/2025/nov/20/trump-news-at-a-glance-democrats\">Trump news at a glance: president says Democrats should be arrested for ‘seditious behavior’, drawing outrage</a></p></li></ul><p>The <strong><a href=\"https://www.theguardian.com/us-news/trump-administration\">Trump administration</a></strong> presented a new plan to roll back regulations in the <strong>Endangered Species Act (ESA)</strong> on Wednesday, a move experts fear will accelerate the extinction crisis if adopted.</p><p><a href=\"https://content.govdelivery.com/accounts/USDOI/bulletins/3fc00d6\">The proposed</a><strong><a href=\"https://content.govdelivery.com/accounts/USDOI/bulletins/3fc00d6\"> </a></strong><a href=\"https://content.govdelivery.com/accounts/USDOI/bulletins/3fc00d6\">changes</a> would allow the federal government more power to weigh economic impact against habitat designations, remove safeguards against future events – including the impacts from the climate crisis – and rescind the “blanket rule” that automatically grants threatened species the same protections as those designated as endangered.</p> <a href=\"https://www.theguardian.com/us-news/live/2025/nov/20/donald-trump-jeffrey-epstein-justice-department-zohran-mamdani-news-updates-us-politics-live\">Continue reading...</a>",
  "published": "Fri, 21 Nov 2025 02:54:53 GMT",
  "url": "https://www.theguardian.com/us-news/live/2025/nov/20/donald-trump-jeffrey-epstein-justice-department-zohran-mamdani-news-updates-us-politics-live",
  "source": "World news | The Guardian"
}