{
  "title": "AT&T Promo Codes and Bundle Deals: Save $50 in November",
  "text": "Major wireless carriers: A necessary evil if you travel a lot, have a family, or are just interested in coverage that’s reliably consistent and widespread. AT&T is the third-largest provider in the US (first for 5G), with the largest coverage map. I’ve had various AT&T plans for more than a decade, first for just myself and now for my whole family, even though I only get one cell bar at my house and have to stand in one 5-square-foot patch of yard to make a phone call. And have lost entire days of my life to fighting unexpected random charges and upsells. (Verizon is somehow worse.) But anyway! AT&T is fine, it has all the latest phones, and there are some legitimately good perks, like no roaming in Canada or Mexico with select plans. If you know you’re going to have to go with one of the big guys, don’t sign up without checking out the below discounts first.\n\nGet the New iPhone 17 Pro for $0 at AT&T\n\nRight now, you can get the Apple iPhone 17 Pro for $0 per month with an eligible trade-in, for a limited time only. The trade-in deal is only valid with an eligible device and an eligible unlimited plan (speed restrictions apply). Be sure to check the AT&T link above to see all terms and restrictions before making a purchase.\n\nSave Over $600 a Year With AT&T Fiber (No Promo Code Needed)\n\nAT&T Fiber claims to be the fastest internet network in America. You can find out for yourself (for less) with this new deal. When first time customers sign up for Fiber now, they’ll get 1 Gigabyte for only $37 per month. That’s over $600 in savings per year! Just act before it’s too late, as this deal expires on December 19.\n\nAre There AT&T Promos for Existing Customers?\n\nBut I already have AT&T, you might be saying—new deals never apply to me. Do you have AT&T internet, though? If, like me, you have AT&T for your phone plan and Xfinity or CenturyLink for internet, did you know you can save 20% off your AT&T bill every single month if you bundle your internet service with unlimited wireless? This applies to both current phone customers and current internet customers who don’t have both plans.\n\nAT&T wants to reward you for your loyalty: when you sign up for AT&T Fiber and eligible wireless plans, you can get up to $150 in AT&T Visa Reward Cards. Be sure to check out the AT&T deals page for more details on that offer, along with other great ways to save.\n\nAT&T Discounts for Professionals and Students\n\nOne of the reasons I went with AT&T in the first place is because my husband is a college professor and we get a generous 25% off our bill. This 25% discount applies for all teachers, as well as active military, veterans, first responders, and many medical professionals. Not one of the above? Students and union members can save $10 per line per month, and union members can also score 20% off accessories like cases, and stuff you used to be able to get with your phones, like chargers and cords.\n\nHow Can I Make My AT&T Plan Cheaper?\n\nNot a new customer; not in a place to bundle; and not a teacher/first responder, in the military, or a student? All is not lost on the discount front. You can save over $800 a year on AT&T Wireless when you bundle four unlimited wireless plans with your current internet plan. (Savings based on 20% discount on four voice lines with eligible internet service, plus $10/month discount with eligible AutoPay & paperless bill, which starts within two bills.)\n\nDon’t need four unlimited wireless plans? Check out if your employer offers a discount—a couple of mine have in the past, and you can save $10 per month per line on the unlimited plan. Check here to see if your workplace qualifies.\n\nYou can also get a discount on a new phone with an eligible trade-in, but the best deal yet may be the fact AT&T lets you try its wireless free for 30 days. Keep your current service and phone number while trying out AT&T’s network from your device—no catches or commitments. You don’t even need a credit card. It’s a great way to see if you get good service where you’ll be using the phone most.\n\nLastly, if none of these deals apply to you, you can wait for Cyber Monday later this year, on December 1), when AT&T is known to have some of its best deals on phones, watches, tablets, and accessories. No codes or coupons required.",
  "summary": "Whether you’re looking to upgrade your internet or get the latest phone, we’ve got you covered with our selection of AT&amp;T coupons and deals.",
  "published": "Thu, 20 Nov 2025 06:30:00 +0000",
  "url": "https://www.wired.com/story/att-promo-code/",
  "source": "WIRED"
}