{
  "title": "Discovery could boost solid-state battery performance",
  "text": "An emerging technology to make lithium-ion batteries safer and more powerful involves using solid rather than liquid electrolytes, the materials that make it possible for ions to move through the device to generate power.\n\nA team of University of Texas at Dallas researchers and their colleagues have discovered that the mixing of small particles between two solid electrolytes can generate an effect called a \"space charge layer,\" an accumulation of electric charge at the interface between the two materials.\n\nThe finding could aid the development of batteries with solid electrolytes, called solid-state batteries, for applications including mobile devices and electric vehicles. The researchers published their study in ACS Energy Letters, where it is featured on the cover of the March issue.\n\nResearchers discovered that the mixing of small particles between two solid electrolytes can generate an effect called a \"space charge layer,\" an accumulation of electric charge at the interface between two solid electrolytes depicted in this illustration.\n\nWhen the separate solid electrolyte materials make physical contact, a layer forms at their boundary where charged particles, or ions, accumulate due to differences in each material's chemical potential, said Dr. Laisuo Su, assistant professor of materials science and engineering in the Erik Jonsson School of Engineering and Computer Science and a co-corresponding author of the study. He said the layer helps create pathways that make it easier for ions to move across the interface.\n\n\"Imagine mixing two ingredients in a recipe and unexpectedly getting a result that is better than either ingredient alone,\" Su said. \"This effect boosted the movement of ions beyond what either material could achieve by itself.\n\n\"This discovery suggests a new way to design better solid electrolytes by carefully choosing materials that interact in a way that enhances ionic movement, potentially leading to better-performing solid-state batteries.\"\n\nThe research is a project of UTD's Batteries and Energy to Advance Commercialization and National Security (BEACONS) initiative, which launched in 2023 with $30 million from the Department of Defense to develop and commercialize new battery technology and manufacturing processes, enhance the domestic availability of critical raw materials, and train high-quality workers for industry.\n\n\"Solid-state battery technology is part of our next-gen battery chemistries research at the BEACONS center, and it is expected to enable advanced battery systems to improve the performance of drones for defense applications,\" said Dr. Kyeongjae Cho, professor of materials science and engineering, director of BEACONS and a co-corresponding author of the study.\n\nMost lithium-ion batteries currently used in consumer products contain liquid electrolytes, which are flammable and can present safety issues. Although conventional lithium-ion batteries are reaching the theoretical limit of how much energy they can store, Su said solid-state batteries show promise for generating and storing more than twice as much power as batteries with liquid electrolytes, and they are safer because they are not flammable.\n\nThe development of solid-state batteries faces challenges, however, because it is more difficult to move ions through solid materials. The researchers studied the performance of the solid-state electrolyte compounds lithium zirconium chloride and lithium yttrium chloride and proposed a theory to explain why mixing the materials increased ionic activity.\n\n\"The interface formed unique channels for ion transport,\" Su said.\n\nSu and fellow researchers plan to continue to study how the composition and structure of the interface leads to greater ionic conductivity.\n\nOther UT Dallas researchers who contributed to the work include Dr. Boyu Wang, first author of the study and a postdoctoral researcher with BEACONS; and Dr. Yue Zhou, associate professor of mechanical engineering.\n\nThe UTD team collaborated with two researchers from Texas Tech University: Dr. Zeeshan Ahmad, assistant professor of mechanical engineering and a co-corresponding author; and Md Salman Rabbi Limon, a doctoral candidate in mechanical engineering.",
  "summary": "Researchers have discovered that the mixing of small particles between two solid electrolytes can generate an effect called a 'space charge layer,' an accumulation of electric charge at the interface between the two materials. The finding could aid the development of batteries with solid electrolytes, called solid-state batteries, for applications including mobile devices and electric vehicles.",
  "published": "Mon, 02 Jun 2025 15:49:03 EDT",
  "url": "https://www.sciencedaily.com/releases/2025/06/250602154903.htm",
  "source": "Latest Science News -- ScienceDaily"
}