{
  "title": "Nitrogen loss on sandy shores: The big impact of tiny anoxic pockets",
  "text": "Denitrification in tiny anoxic pockets on sand grains could account for up to one-third of total nitrogen loss in silicate shelf sands.\n\nSome microbes living on sand grains use up all the oxygen around them. Their neighbors, left without oxygen, make the best of it: They use nitrate in the surrounding water for denitrification -- a process hardly possible when oxygen is present. This denitrification in sandy sediments in well-oxygenated waters can substantially contribute to nitrogen loss in the oceans.\n\nTO THE POINT:\n\nTiny environments: Microorganisms on sand grains create anoxic microenvironments.\n\nMicroorganisms on sand grains create anoxic microenvironments. Big impact: This allows their neighbours to carry out anaerobic denitrification in well-oxygenated sands.\n\nThis allows their neighbours to carry out anaerobic denitrification in well-oxygenated sands. Globally relevant: Overall, this reduces nitrogen in oceans, within well-oxygenated sands, worldwide for up to one third.\n\nHuman activities, such as agriculture, have dramatically increased nitrogen inputs into coastal seas. Microorganisms remove much of this human-derived nitrogen in coastal sands through a process called denitrification. Denitrification generally only occurs in the absence of oxygen. However, observations indicate that it also happens in oxygenated sands, via a thus far unknown mechanism. Scientists from the Max Planck Institute for Marine Microbiology in Bremen, Germany, now reveal how this happens: Bunches of microbes, unevenly distributed on the surface of sand grains, use up all the oxygen around them, thus creating anoxic microenvironments in which other microbes can carry out denitrification. The results are now published in the journal Scientific Reports.\n\nBig effects of tiny structures\n\nThe scientists used a method called microfluidic imaging, which allowed them to visualize the diverse and uneven distribution of microbes and the oxygen dynamics on extremely small scales. \"Tens of thousands of microorganisms live on a single grain of sand. We were able to distinguish oxygen-consuming and oxygen-producing microbial colonies located within micrometers of each other,\" explains Farooq Moin Jalaluddin from the Max Planck Institute for Marine Microbiology. The scientists could show that some microbes consume more oxygen than is resupplied by the surrounding pore water. Thus, anoxic pockets develop on the surface of the sand grains. These have so far been invisible to conventional techniques. However, their effects are dramatic: \"Our estimates based on model simulations show that anaerobic denitrification in these anoxic pockets can account for up to one third of the total denitrification in oxygenated sands,\" says Jalaluddin.\n\nGlobal important as a sink of anthropogenic nitrogen\n\nPermeable sands roughly cover half of the continental shelves on our planet, making them a very important habitat in many respects. The Max-Planck-scientists thus also calculated how relevant this newly researched form of nitrogen removal in the tiny anoxic pockets on single sand grains is on a global scale. \"We found that these anoxic microenvironments could account for up to one third of total nitrogen loss in silicate shelf sands,\" says co-author Soeren Ahmerkamp, who is now working at the Leibniz Institute for Baltic Sea Research Warnemünde. \"Consequently, this denitrification is a substantial sink for anthropogenic nitrogen entering the oceans.\"",
  "summary": "Some microbes living on sand grains use up all the oxygen around them. Their neighbors, left without oxygen, make the best of it: They use nitrate in the surrounding water for denitrification -- a process hardly possible when oxygen is present. This denitrification in sandy sediments in well-oxygenated waters can substantially contribute to nitrogen loss in the oceans.",
  "published": "Mon, 02 Jun 2025 15:53:28 EDT",
  "url": "https://www.sciencedaily.com/releases/2025/06/250602155328.htm",
  "source": "Latest Science News -- ScienceDaily"
}