{
  "title": "These are the animals people most want to see photographed",
  "text": "Editor’s Note: Call to Earth is a CNN editorial series committed to reporting on the environmental challenges facing our planet, together with the solutions. Rolex’s Perpetual Planet initiative has partnered with CNN to drive awareness and education around key sustainability issues and to inspire positive action.\n\nCNN —\n\nOriginally a term used by trophy hunters in Africa, the “Big Five” described the animals most challenging to shoot and kill: the lion, elephant, leopard, rhino, and buffalo. Nowadays, it is more loosely used to refer to some of Africa’s largest and most iconic animals.\n\nHowever, British photographer Graeme Green has reclaimed the narrative, creating a global “New Big Five” for wildlife photography. In 2021, 50,000 people around the world voted for the five animals they would most like to photograph, or see photographed, in the wild. Five animals were crowned the winners: the elephant, polar bear, lion, gorilla and tiger.\n\nThis week, sees the publication of “The New Big 5” photography book, which features images of those animals and other at-risk wildlife, from photography legends such as Ami Vitale, Steve McCurry and Paul Nicklen, and essays from famous conservationists and activists including like Jane Goodall and Paula Kahumbu.\n\nGreen says that the book celebrates wildlife and is a global call to action on issues impacting wildlife, including habitat loss, poaching, pollution and climate change.\n\nBritish photographer Graeme Green is the founder of the New Big 5 project, an international conservation initiative supported by photographers, conservationists and wildlife charities. Andrea Moreno/The New Big 5\n\nAnimals at risk\n\nGreen was on assignment in Botswana at least a decade ago when he came up with the idea for a project to encourage people to “shoot with a camera, not a gun,” he says.\n\n“I thought this would be a way to get people really focusing on wildlife, thinking about the wildlife they love, thinking about the animals that are at risk.”\n\nIn total, the book includes the work of 144 globally renowned wildlife photographers from Ecuador to India. Curating the images took nearly two years of work, says Green.\n\n“I think these are some of the most beautiful and creative images that I’ve seen put together in one book,” says Green. “These are the species that we are at risk of losing.”\n\n\"The New Big 5: A Global Photography Project For Endangered Wildlife\" by Graeme Green is out now. Graeme Green / The New Big 5\n\nAccording to the UN, nature is declining at an unprecedented rate, with around one million of the planet’s animal and plant species facing extinction. The “New Big 5,” all of which are threatened, act as ambassadors for what is happening in the natural world, says Green.\n\nAs well as being a powerful reminder of what we stand to lose, the book also points people towards potential solutions. Featured essays explore the benefits of rewilding and the importance of indigenous communities in conservation.\n\nA chapter on endangered species from bees to blue whales illustrates the alarming threat climate change poses to animals outside of the “New Big 5.” “That’s only the tip of the iceberg – I could have included thousands of pictures because that’s how serious the situation is,” says Green.\n\n\"In Indian forests, it's very difficult to get a proper picture of a running tiger, as they all are thick forests. I kept the camera settings fast enough to freeze the running tiger,\" said photographer Thomas Vijayan in a press release. Thomas Vijayan/The New Big 5\n\nJane Goodall, a leading conservationist who also wrote the afterword to the book, said in a press release that “we have a window of time during which we can start to heal some of the harm we have inflicted on the natural world, but only if we get together and take action now.\n\n“I hope the photos will lead people into the wonderful worlds of these iconic species. Then, perhaps, other people will become involved in helping to create a world where wildlife can flourish for future generations to enjoy,” she said.\n\n“The New Big 5: A Global Photography Project For Endangered Wildlife,” by Graeme Green, published by Earth Aware Editions, is on sale from April 4, 2023.",
  "summary": "Originally a term used by trophy hunters in Africa, the \"Big Five\" described the animals most challenging to shoot and kill: the lion, elephant, leopard, rhino, and buffalo. Nowadays, it is more loosely used to refer to some of Africa's largest and most iconic animals.",
  "published": "Tue, 04 Apr 2023 10:38:46 GMT",
  "url": "https://www.cnn.com/travel/article/new-big-5-wildlife-photography-book-c2e-scn-spc-intl/index.html",
  "source": "CNN.com - RSS Channel - App International Edition"
}