{
  "title": "Elon Musk’s X down today: How Twitter users reacted to global outage",
  "text": "Elon Musk’s X, formerly Twitter, was down for thousands of users worldwide Tuesday. User reacted to the outage which began at 4.48 pm IST, and peaked at 5.14 pm with 1,485 reports, according to Downdetector.com\n\nOne user @banf wrote, “X is down, Cloudflare is down. Pack up people, day is over.” The post was accompanied by a graph showing a surge in Cloudflare outages.\n\nAnother user Noorie (@nuradeeeen) posted, “X is down, can you reply this?”, asking if anyone was able to respond.\n\nAfia Dimple (@AfiaDimple_) said X went down, asking followers if they could see her tweet.\n\nGunther Eagleman (@GuntherEagleman) similarly posted, “Is X down? Can you see this post?”\n\nSoon after, even down detector stopped working. @immasiddx pointed out and explained, “X and many other platforms were down for a while due to a Cloudflare issue. The funny part? Even Downdetector was down.”\n\nCloudfare hit\n\nWeb infrastructure company Cloudflare has been hit with a major outage, which is the likely cause behind multiple websites across the internet facing crash reports.\n\nStory continues below this ad\n\nThe websites affected are Elon Musk-owned X, OpenAI’s ChatGPT, Anthropic’s Claude, and Perplexity, among several other services, according to outage tracker Downdetector.com.\n\nThe company first reported experiencing “an internal service degradation” at 5:18pm (IST). The incident comes nearly a month after a massive outage hit cloud services provider Amazon Web Services (AWS), taking down swathes of the internet.\n\nActing as a bridge between users and websites, Cloudfare handles an average of 81 million HTTP requests per second and serves over 63 million HTTP(S) requests per second on average, including millions of internet properties. In addition to this, it handles an average of over 42 million DNS requests per second.\n\nIt operates across 120 countries. Hence, any inconsistency in the web infra company can act as a potential single-point-of-failure for millions of users worldwide.",
  "summary": "",
  "published": "Tue, 18 Nov 2025 12:59:10 +0000",
  "url": "https://indianexpress.com/article/india/elon-musks-x-down-today-how-twitter-users-reacted-to-global-outage-10372654/",
  "source": "India | The Indian Express"
}