{
  "title": "Physicists reveal a new quantum state where electrons run wild",
  "text": "Electricity keeps modern life running, from cars and phones to computers and nearly every device we rely on. It works through the movement of electrons traveling through a circuit. Although these particles are far too small to see, the electric current they produce flows through wires in a way that resembles water moving through a pipe.\n\nIn some materials, however, this steady flow can suddenly lock into organized, crystal-like patterns. When electrons settle into these rigid arrangements, the material undergoes a shift in its state of matter and stops conducting electricity. Instead of acting like a metal, it behaves as an insulator. This unusual behavior provides scientists with valuable insight into how electrons interact and has opened the door to advances in quantum computing, high-performance superconductors used in energy and medical imaging, innovative lighting systems, and extremely precise atomic clocks.\n\nA group of physicists at Florida State University, including National High Magnetic Field Laboratory Dirac Postdoctoral Fellow Aman Kumar, Associate Professor Hitesh Changlani, and Assistant Professor Cyprian Lewandowski, has now identified the specific conditions that allow a special kind of electron crystal to form. In this state, electrons arrange themselves in a solid lattice yet can also shift into a more fluid form. This hybrid phase is called a generalized Wigner crystal, and the team's findings appear in npj Quantum Materials, a Nature publication.\n\nHow Electron Crystals Form\n\nScientists have long known that electrons in thin, two-dimensional materials can solidify into Wigner crystals, a concept first proposed in 1934. Experiments in recent years have detected these structures, but researchers had not fully understood how they arise once additional quantum effects are considered.\n\n\"In our study, we determined which 'quantum knobs' to turn to trigger this phase transition and achieve a generalized Wigner crystal, which uses a 2D moiré system and allows different crystalline shapes to form, like stripes or honeycomb crystals, unlike traditional Wigner crystals that only show a triangular lattice crystal,\" Changlani said.\n\nTo explore these conditions, the team relied on advanced computational tools at FSU's Research Computing Center, an academic service unit of Information Technology Services, as well as the National Science Foundation's ACCESS program (an advanced computing and data resource under the Office of Advanced Cyberinfrastructure). They used methods such as exact diagonalization, density matrix renormalization group, and Monte Carlo simulations to test how electrons behave under various scenarios.\n\nProcessing Enormous Amounts of Quantum Data\n\nQuantum mechanics assigns two pieces of information to every electron, and when hundreds or thousands of electrons interact, the total amount of data becomes extremely large. The researchers used sophisticated algorithms to compress and organize this overwhelming information into networks that could be examined and interpreted.\n\n\"We're able to mimic experimental findings via our theoretical understanding of the state of matter,\" Kumar said. \"We conduct precise theoretical calculations using state-of-the-art tensor network calculations and exact diagonalization, a powerful numerical technique used in physics to collect details about a quantum Hamiltonian, which represents the total quantum energy in a system. Through this, we can provide a picture for how the crystal states came about and why they're favored in comparison to other energetically competitive states.\"\n\nA New Hybrid: The Quantum Pinball Phase\n\nWhile studying the generalized Wigner crystal, the team uncovered another surprising state of matter. In this newly identified phase, electrons show both insulating and conducting behavior at the same time. Some electrons remain anchored in place within the crystal lattice, while others break free and move throughout the material. Their motion resembles a pinball ricocheting between stationary posts.\n\n\"This pinball phase is a very exciting phase of matter that we observed while researching the generalized Wigner crystal,\" Lewandowski said. \"Some electrons want to freeze and others want to float around, which means that some are insulating and some are conducting electricity. This is the first time this unique quantum mechanical effect has been observed and reported for the electron density we studied in our work.\"\n\nWhy These Discoveries Matter\n\nThese results expand scientists' ability to understand and control how matter behaves at the quantum level.\n\n\"What causes something to be insulating, conducting or magnetic? Can we transmute something into a different state?\" Lewandowski said. \"We're looking to predict where certain phases of matter exist and how one state can transition to another -- when you think of turning a liquid into gas, you picture turning up a heat knob to get water to boil into steam. Here, it turns out there are other quantum knobs we can play with to manipulate states of matter, which can lead to impressive advances in experimental research.\"\n\nBy adjusting these quantum knobs, or energy scales, researchers can push electrons from solid to liquid phases within these materials. Understanding Wigner crystals and their related states may shape the future of quantum technologies, including quantum computing and spintronics -- a rapidly evolving area of condensed-matter physics that promises faster, more efficient nano-electronic devices with lower energy use and reduced manufacturing costs.\n\nThe team aims to further explore how electrons cooperate and influence one another in complex systems. Their goal is to address fundamental questions that could ultimately drive innovations in quantum, superconducting, and atomic technologies.",
  "summary": "Electrons can freeze into strange geometric crystals and then melt back into liquid-like motion under the right quantum conditions. Researchers identified how to tune these transitions and even discovered a bizarre “pinball” state where some electrons stay locked in place while others dart around freely. Their simulations help explain how these phases form and how they might be harnessed for advanced quantum technologies.",
  "published": "Sun, 16 Nov 2025 10:56:25 EST",
  "url": "https://www.sciencedaily.com/releases/2025/11/251116105625.htm",
  "source": "All Top News -- ScienceDaily"
}