{
  "title": "She was pregnant and addicted to fentanyl. Getting to keep her baby saved them both",
  "text": "Eight months pregnant and in pain, Stephanie Rosell went to the Holy family hospital emergency room after an infection began spreading up her legs. Unemployed and homeless, estranged from her family, she lived in a shed she had built in a friend’s yard. She was also addicted to fentanyl.\n\nAs doctors treated her infection, she began to panic. Withdrawal was setting in. She leaned over the bed and vomited.\n\nStephanie finally broke down. “Listen, I gotta go. I have to go home and get high.”\n\nShe had used fentanyl before coming to the ER and had just enough time to get treated before she needed to go home to get high again. She thought she still had four weeks left to figure out how to get clean and have this baby.\n\nThe nurse had other ideas. She told Stephanie she was not going anywhere.\n\n“Yes, I am,” Stephanie said.\n\nBut the hospital refused to discharge her: the infection in her legs was serious, but doctors had discovered she also had an amniotic fluid leak. The nurse, Izzie, warned her: if she walked out, she and her baby would not survive.\n\nIzzie persuaded the doctor to give Stephanie controlled doses of fentanyl every few hours, knowing that withdrawal could endanger her and the baby. After delivery Stephanie would be switched to methadone, a medication that eases withdrawal and is commonly used in addiction recovery.\n\nFive days later, on 12 November 2022, Stephanie delivered a baby girl weighing 4lb 8oz – premature, small but alive.\n\nWhen the nurse asked if she wanted to hold her baby, Stephanie said: “No.” She was numb. Her epidural had failed, her last dose of fentanyl had been administered four hours before delivery.\n\nShe felt sick. Unprepared to be a mother. Undeserving.\n\nStephanie had tried to get clean several times during pregnancy, and felt horrible each time she failed. She felt worthless, berating herself for not being able to do the impossible. An OB-GYN told her to “just” stop using. Even her dealer refused to sell to her when she became visibly pregnant.\n\n“But I couldn’t,” she said. “I needed help.”\n\nView image in fullscreen Stephanie Rossell hangs up laundered shirts that family and guests are required to wear when visiting Maddie’s Place in Spokane, Washington. Stephanie is a mom who went through the organization’s program for moms and babies dealing with substance abuse and exposure.\n\nThe pervasive expectation that her love for her baby would make her quit only led to greater shame and self-abuse, a trigger for her to use again. Yet she could not simply will her addiction away, any more than she could will away a chronic disease.\n\nThe baby was taken to the NICU. When Stephanie finally saw her, she was hooked up to tubes and leads, so tiny she thought she would break her. Holding her for the first time, she felt nothing. “I just stared at her and was like, ‘What am I going to do with you?’” She still wasn’t sure she wanted to be her mother.\n\nAfter two days she decided to name her baby Izzie, after the nurse who had been so kind to her.\n\nHospital staff told her about Maddie’s Place, a new kind of care center in Spokane, Washington, where mothers and their drug-exposed newborns are treated together, not apart.\n\nIn much of the US, where a baby is diagnosed with neonatal abstinence syndrome (NAS) every 18 minutes, infants are still whisked to NICUs and medicated while their mothers face child-protection investigations. But a small, growing network of centers like Maddie’s Place is proving a simple point: when mothers and babies stay together, outcomes improve, foster placements fall and long-term costs decline.\n\nIt took Stephanie a while to gather the courage to call, but she finally did. After confirming she would be a good fit for the program, two staff members came to pick her up.\n\nShe stepped out of the hospital still in withdrawal, scared and uncertain about what would come next.\n\nAt Maddie’s Place, Stephanie still feared CPS would come take Izzie – even though she was not sure she wanted to keep her. The fear lingered: that at any moment, someone could walk in and take her baby away.\n\nFor the first two weeks, Stephanie kept to herself. “I didn’t really want anything to do with any of them,” she said. “I didn’t have a lot of trust at that point.”\n\nLife on the streets, she said, was about survival. Drugs came first; trust came last.\n\nStephanie had one close friend, but even that bond was fragile. The people she loved always found ways to hurt her. She did not know how to love herself, let alone anyone else.\n\nEvery day, staff from Maddie’s Place drove her to a clinic for methadone, administered in pill form. Slowly, she was starting to get clean.\n\nShe spent every minute outside treatment with Izzie, and could see that her baby was getting the specialized care she needed. Her girl had some trouble feeding at first, with intolerance to some formulas and pronounced gastrointestinal issues. She needed feeding therapy. She also had heightened sensory issues and required an occupational therapist – all common issues for babies born with NAS.\n\nIf this little kid could see that these babies deserve to be loved, then I could do this. I could be a mom Stephanie\n\nOne afternoon before Thanksgiving, Stephanie sat in the visitation area, where parents in active addiction can come for supervised visits with their babies. Katie Bunch-Smith, a peer support specialist, stopped by with her own five kids in tow to drop off cookies. They all gathered around Stephanie, who was sitting on the floor holding Izzie.\n\nThe children were wide-eyed, in awe of the tiny infant in Stephanie’s arms. “They had no care in the world. They didn’t care that I had used drugs with her. None of those things mattered to them,” Stephanie said. “They just were so excited to see this little baby.”\n\nShe keeps a photo of the moment. She is clad in black pants and a hoodie, a gray knit hat with a pompom on her head, sitting on the wooden floor with the door behind her. She is thin. Her head is tilted forward so you cannot see her face. She is holding Izzie up on her knee for the other kids to see and they are gathered around, fawning and reaching out to the baby.\n\nJacob, eight, asked the moms: “Where are all the dads?” The moms tried to explain that the dads were busy, called away to other tasks, that they would be there if they could.\n\n“When I have kids,” Jacob said, “I’m going to be the best dad ever. I’m gonna show them that they deserve to be loved.”\n\nStephanie and Bunch-Smith looked at each other. “I just lost it and fell apart,” Stephanie said. “If this little kid could see that these babies deserve to be loved, then I could do this. I could be a mom.”\n\nView image in fullscreen Stephanie reads a book to her daughter Izzie before bedtime.\n\nTools for treating drug-exposed newborns have existed for decades.\n\nThe Finnegan NAS scale was developed in 1975 by Dr Laura Finnegan to allow nurses to evaluate newborns and chart the severity of withdrawal symptoms, such as hypersensitivity to sound, light and touch.\n\nAt the time, NICU standard practice was to administer drugs to babies to ease their withdrawal, but low staffing meant that they were often left alone in their cribs to cry. Their mothers, having tested positive for drug use, were arrested and later sent back to the street. Others, shamed by their addiction, simply disappeared on their own.\n\nThe babies, more often than not, were funneled into the troubled foster care system.\n\nIn 2011, Rhonda Edmunds worked as a NICU nurse at Cabell Huntington hospital in Huntington, West Virginia. She and her colleagues began to notice an increasing number of babies born with NAS.\n\nThese babies often struggled to feed and suffered from diarrhea, gas and other gastrointestinal problems. Some arched and stiffened their backs, shook all over with tremors, or had low body tone. And the time they needed in the NICU was noticeably longer than other newborns – a concern for hospitals with limited staff and beds.\n\nEdmunds needed all the help she could get. She found a program in Kent, Washington, that had been treating babies with substance exposure for decades. Beginning in the 1980s, during the cocaine epidemic, foster mother Barbara Drennen had devised techniques for soothing newborns in substance withdrawal, bridging their time between the NICU and foster care.\n\nAt first Drennen cared for the babies in her home, but the demand allowed her to open a facility, Pediatric Interim Care Center, where she formalized treatment and eventually cared for more than 3,000 babies. Mothers could visit their newborns, but they were not housed on site.\n\nDrennen, who is now 83, is an encyclopedia of hands-on experience in infant abstinence syndrome. One of the greatest challenges she has faced over the past 25 years is the constant need to adapt to new drug epidemics.\n\nEach drug causes unique symptoms in babies. With heroin, the baby sways side to side and does not want to be touched in the early days. With methamphetamine, the baby can handle some stimulation, but has trouble eating.\n\nView image in fullscreen An infant cries while being swaddled at Brigid’s Path in Kettering, Ohio.\n\nDrennen invited Edmunds and her team for a visit. She taught them that the babies need their environment to be calm and controlled. Swaddling babies is helpful in order to have them concentrate on breathing and eating, and not “flailing around”.\n\nTherapeutic handling techniques include holding the baby in a “C” position and moving them up and down to comfort them (not swaying them from side to side). Anticipating their need for food or a clean diaper is also important to a baby’s self-regulation: they learn to distinguish those basic needs from the disruption of external stimuli or emotional impulses, and how to calm themselves.\n\nEdmunds took those newly acquired skills back to West Virginia, where the opioid epidemic was intractable; a mix of poverty, unemployment, limited healthcare and deep funding cuts has made the state’s overdose death rate among the highest in the country.\n\nIt was soon obvious that the care these babies needed could not be provided by the NICU. In 2014, Edmunds and her colleagues opened Lily’s Place in a former orthopedic office in Huntington – where staff and volunteers regulated babies’ stimulation by dimming lights, limiting noise and providing care around the clock. The local hospital started to refer newborns in need, and word spread.\n\nThe mother with the baby is treatment for the baby. The mother is the magic Lauren Jansson\n\nLily’s Place added something new: they began to treat mothers and babies, the “dyad”, together. This approach is slowly gaining wider attention and the approval of experts.\n\nLauren Jansson, a professor of pediatrics at Johns Hopkins school of medicine, told me that dyadic attachment is vital – and a solid bond starts with making sure the mother is doing well. Sending dysregulated mothers and babies out into the community is bound to fail. “What’s going to happen? The baby’s going to wind up in foster care with special needs or developmental problems. The mother ends up with mental health problems.” Or back on the street.\n\n“The mother with the baby is treatment for the baby,” Jansson said. “The mother is the magic.”\n\nEdmunds wanted to allow the early weeks of a newborn’s life to be motivation for mothers and fathers to get help and to access a recovery program so that they could be involved in their child’s life.\n\nIt was in the infants’ best interest, too. From experience, she knew babies recovered more quickly with close contact and attention from their mothers – a finding supported by medical research, which shows that both mother and child fare better together.\n\nA 2021 study by Johns Hopkins school of medicine, co-authored by Jansson, called dyadic care a “window of opportunity” to assess how mother and baby regulate and respond to each other. When mothers are encouraged to bond with their infants through skin-to-skin contact and pay close attention to their babies’ needs, both are able to better manage their own attention, emotions, physiology and behaviors. It is, according to Jansson, a necessary prerequisite for babies’ early learning.\n\nTo this end, Lily’s Place provided private rooms for mothers and their babies, coupled with support services that encouraged mothers to enter drug rehabilitation. Help was also on hand to navigate family court and to decipher opaque state and federal services – temporary financial assistance, food stamps and even the DMV – that would get them on their feet. Formula, toys, baby clothes, diapers and other items were also made available.\n\nLily’s Place’s success made waves. Today, there are five pediatric transitional care centers in the country, all in cities hit hardest by the opioid crisis. What began as one nurse’s experiment in Washington state soon spread: Brigid’s Path opened in Ohio in 2017, Jacob’s Hope in Mesa in 2019, Hushabye Nursery in Phoenix in 2020, and Maddie’s Place – where Stephanie stayed with her baby Izzie – opened in 2022.\n\nTogether, they form a small but growing network built on a radical idea: healing a baby means healing the mother, too.\n\nView image in fullscreen Stephanie watches as Izzie pretends to be Elsa from Frozen in her bedroom.\n\nAt Lily’s Place last August, recovering mothers gathered in the shade behind a five-unit residence to talk about how they fell into drug use – and how they were fighting their way out.\n\nThe women, and more than two dozen others I interviewed, all said the same thing in different ways: drugs had led to the belief they were not worth even the smallest acts of care. For many, addiction began in trauma, in its various forms: abuse, degradation, abandonment. Yet their resourcefulness and resilience rarely make it into the broader narratives about addiction.\n\nRebecca – a tall 36-year-old with meticulously kept long hair and carefully applied makeup – began smoking meth with her father, who sexually abused her. He cut and burned her; she showed me the scars running down her arms and legs. She spent decades drifting in and out of homelessness.\n\n“I have an 18-year-old and a 16-year-old,” she told me. “I lost them because when me and their father separated, I didn’t have anybody there for me.”\n\nLater, she was held captive by a man who tied her up and starved her. He set fire to the building they were squatting in before hanging himself in front of her.\n\nShe is clean now, and attends classes at Lily’s Place that help her manage her trauma and subsequent anger and anxiety. And she has visitation rights for her other two children, daughters ages 11 and seven.\n\nShayla, 26, another resident, grew up in Charleston in a household littered with drugs. Her grandparents lived nextdoor and adopted her. But her grandfather was controlling, and she seldom left the house. When her grandmother died, right after Shayla graduated from high school, her mother came back into her life.\n\n“My mother was the first one I did heroin with,” she told me. Because her parents had no boundaries, she modeled what she was familiar with and found herself in abusive relationships. “I started going down the wrong road and doing things for drugs, but I ended up getting pregnant.”\n\nIt is easy to see how birth control slips out of reach for these women – when there is no healthcare, when shame keeps you from the clinic, when you are fleeing violence, when you do not have a car, when survival narrows to one task: staving off withdrawal.\n\nShayla’s baby is eight months old and lives with a family member. She sees her once a week.\n\nAgain and again, their stories turned on loss: a parent, a child, a sense of worth. For Stephanie Rosell, it was her brother.\n\nView image in fullscreen Stephanie leaves work at Maddie’s Place to head home.\n\nFour weeks before her graduation from high school, Stephanie’s brother Andrew was killed in a traffic accident. A city recycling truck turned right on red and struck him in the crosswalk, trapping him beneath the vehicle. “When they took him out from underneath the truck, basically his insides exploded,” she said.\n\nHe was 16, just 14 months younger than her. Because their parents worked swing shifts, she had always looked after him, getting him ready for school or getting him bathed and into bed at night. When their parents separated, they became each other’s support system.\n\n“We fought like cats and dogs,” she said, “but we always had each other’s backs.”\n\nAfter his death, the family fell apart. Stephanie started using drugs to handle her pain. The next year, at 19, she got pregnant. She was devastated: she had never pictured herself as a mom. But she didn’t believe in abortion.\n\nI have always loved her. It’s not that I didn’t want her. I just didn’t know how to be her mom Stephanie\n\nAt the time, Stephanie was using what she called “party drugs”, but not harder drugs like opiates. She stopped using them during the pregnancy. “I was able to get sober because I was pretty clear-minded at that age,” Stephanie said. But she was still miserable, still beset with grief.\n\nShe gave birth to her daughter Elizabeth at the age of 20. For a year and a half, Stephanie labored to be a good mother. “I tried to be with her dad and have a family and do all the things, because I thought that’s what I was supposed to do,” Stephanie said. Then Elizabeth’s dad relapsed on meth. Stephanie, who had never dreamed of becoming a single parent, found herself with no help with childcare while struggling with postpartum depression.\n\nElizabeth was sick and inconsolable, and Stephanie did not know why. She sought help, but remembers doctors acting like she was “some idiot kid who didn’t have any business having a baby”. Repeatedly, they told her, wrongly, that nothing was the matter with her child. When she was around one year old, Elizabeth was diagnosed with kidney reflux so acute it “would have knocked a full grown man to the ground”.\n\nNights were the worst. Elizabeth could not sleep and wanted only to be held. Stephanie did not sleep for days. Eventually, she called her mother and said: “You need to come get her now or I’m going to put her in a closet and let her cry. I can’t do this.”\n\nAfter that, Stephanie’s life spiraled out of control.\n\nThe first time she used meth was with Elizabeth’s dad. They had an agreement with Stephanie’s mother that they could only see Elizabeth when they weren’t high. “It slowly progressed to where I had her less and less,” Stephanie said.\n\nGuilt and shame at failing to be a mother kept Stephanie away from her daughter, but she knew Elizabeth was cared for, clothed and safe. She would sometimes see her on birthdays, but they didn’t have much of a relationship until Elizabeth was 14.\n\n“I have always loved her,” Stephanie said. “It’s not that I didn’t want her. I just didn’t know how to be her mom.”\n\nView image in fullscreen Stephanie and Izzie having lunch in their kitchen.\n\nThe years ticked by. Stephanie worked off and on, but addiction kept pulling her under. Her use progressed from meth to heroin to fentanyl. Sometimes she was on the street or reliant on fleeting friends.\n\nWhen addiction takes over, you will do whatever it takes to get high. Some steal from friends and family, or trade sex for drugs. Stephanie stole from big box stores, and she was good at it. Dealers would give her a list and she would pick up laundry detergent, toilet paper, socks, dog food, whatever was on the list, and exchange her haul for drugs. She was caught only once, after bringing along a sketchy friend who drew attention. The charge was second-degree shoplifting.\n\nDuring the pandemic, Stephanie started to see a man she met at work, where she was doing traffic control flagging for road construction crews. They drank together, stayed in touch when he moved to Idaho, and again when he later relocated to Texas. When she decided to visit him, she made a plan to get off fentanyl on the way. She brought a few pills and a little heroin, thinking the long drive might help her taper as she switched to a drug she knew, one she believed she could handle.\n\nThat did not happen.\n\nShe was in Texas for six days when she had a car accident. A crash at 70mph into a concrete embankment that totaled her car, fractured her spine, broke her leg, shattered her heel and lacerated her kidney and liver.\n\nThe man she was visiting was the only person in the area she knew, and he was not eager to help her. She called her parents, who, though they were no longer married, drove the 2,600 miles together to pick her up.\n\nBut that was all they were willing to do. Back in Spokane, they told her she was on her own. “They dumped me off on my dope man’s back porch and were like, ‘Good luck!’” she recalled. She was still in a wheelchair.\n\nSix months later, she found out that she was pregnant again.\n\nView image in fullscreen Stephanie fastens Izzie into her car seat.\n\nWhile visiting Maddie’s place, I got to meet the babies staying there. The facility can care for 16 infants and mothers at a time – and they were at full capacity.\n\nI held sweet baby M in my arms and cooed quietly to settle him. He was fussy, whimpering periodically. I rocked his limp weight and smelled his satisfying baby smell. He was the third baby I held that day, more restless than the others, constantly turning his full head of black hair in the crook of my arm.\n\nHis mother, whom I will call Posey, bustled around the nursery with uncommon energy. She was preparing for her and her baby to go home that day.\n\nOpen gallery | 0\n\nPosey asked the cuddlers – employees and volunteers who care for infants with oversight from a full-time nurse – about a onesie. Otherwise, the room was quiet.\n\nEmma Jones, the communication’s manager, a master cuddler with a genius for social media, talked to me quietly as we stared at the babies. Jones’s skill had built a huge following. She shows the world what Maddie’s Place does, educates the public on the special needs of NAS babies, and garners donations: diapers, baby clothes, formula and money.\n\nAs I held baby M, feeling triumphant for finally soothing him, his mother sat beside me and took his small hand. She switched on a tiny buzzing nail file and tended to each finger with quick precision. He whimpered at the vibration. When she was done, she lifted him from my arms to change him. She moved briskly, not quite in sync with her baby.\n\nShe laid him down on the changing pad and as Posey pulled one limb after another out of his jumper, he wailed at the top of his lungs. His diaper was dry and did not need to be changed. Posey labored to show her mothering skills, knowing she had a nursery full of professional baby whisperers in the same room.\n\n“Come on buddy, just for Mommy, stop crying, just for once,” she said, picking him up and putting him on her shoulder. Still he wailed.\n\nWatching her, I thought of how hard it is to mother under scrutiny. I worried about how she was going to cope at home alone with her infant. I had known Posey for five minutes but the worry irrationally welled up within me.\n\nView image in fullscreen A bottle of formula is prepared for an infant in the nursery at Brigid’s Path.\n\nI am not the first person to wrongly stigmatize recovering new mothers. In the 80s, hundreds of mothers were arrested for using cocaine while pregnant. The wave of concern for the “crack babies” focused on exaggerated effects that drug use might have on the children of predominantly Black mothers, but never considered the effects of untreated addiction, poverty, racism or poor prenatal care.\n\nA similar discourse about “meth babies” arose when a wave of methamphetamine use spiked two decades later, with an accompanying wave of arrests. Writing about it at the time, the journalist Libby Copeland noted: “Legislators and prosecutors like to talk about sending pregnant drug abusers ‘a message,’ but you have to wonder what exactly the message is, if the threat of punishment does little to help women gripped by addiction.”\n\nToday, 17 states have established fetal rights, either by law or the courts. These laws, often gestated among anti-abortion groups, masquerade as concern for babies but serve as a punishment for mothers. In August 2025, women in Arizona who tested positive for prescribed treatment drugs such as Suboxone were having their children taken away.\n\nSometimes, foster care is the only answer. Yet for the 390,000 children living in foster homes today, the system can bring its own harms: higher rates of physical, emotional and learning challenges, especially for children from families struggling with poverty, addiction or racial inequities.\n\nThe numbers are staggering: roughly 75-80% of NAS infants discharged from hospital NICUs go into the system.\n\nThe pain of losing a child to foster care is familiar to Dona Couch. We met at Brigid’s Path in Kettering, Ohio. She was holding her five-week-old, Zurii, who cooed and looked at her. It was afternoon, with low light coming in the back windows. Two of Dona’s older girls, Raridy, 11, and Journii, two, romped and played around her.\n\nDona, 38, is calm and self-possessed, her long, light brown hair falling loosely around her shoulders. For the past two years she has worked at a smoke shop, where her boss held her job open through her maternity leave with Zurii.\n\nView image in fullscreen Dona Couch cheers for her daughter Raridy at a flag football game in Dayton, Ohio. Her daughter Journii, two, and Dona’s mother are along the sidelines.\n\nJournii’s birth was more complicated. Dona had been sober for six years when she was assaulted. Her cousin’s child’s father had thrown a piece of wood at her, shattering her right femur. She was rushed into surgery, and given pain medications which led to her relapse. She was still using when she found out she was pregnant with Journii.\n\nShe and the baby wound up at Brigid’s Path. At first, Journii was on meds, with tremors, a fever and she regularly vomited. “She would shake and scream and cry constantly,” Dona said. “You couldn’t console her.”\n\nBecause Dona was still using, she could not stay overnight with Journii. But she could stay for the duration of visiting hours every day. A family advocate supervisor, Lindsie Marsh, helped get Dona back into recovery. Journii went home with foster parents until Dona got out. (Dona and Journii’s former foster parents are still close.)\n\nThe old adage that mothers know how to mother is tacit here, but it’s realistically tempered with the knowledge that new mothers need help. They may not have had good role models, they may lack confidence. Just as lactation consultants coach new mothers through how to breastfeed, Brigid’s Path’s nurses and doctors can coach new mothers of NAS babies how to best provide care.\n\nView image in fullscreen Journii and Raridy, 11, have lunch while their mom, Dona, sweeps the kitchen floor.\n\n“We’re a downstream intervention for the baby, but our goal is to be an upstream intervention for the mom for the next pregnancy,” Lisa Jasin, Brigid’s Path’s clinical director, had told me that morning in the bright conference room. “That’s grace for the past, and hope for the future.”\n\nA year or so after Journii’s birth, Dona had wanted to get pregnant again. She was newly married to Darrell, Journii’s father. Her oldest daughters and Darrell had become an integrated family. Dona was still in recovery and began to ween off of Subutex, a prescription recovery drug similar to methadone. But she got pregnant sooner than anticipated.\n\nShe was afraid Zurii would have to go through withdrawal like Journii had. “It was a huge thing. I’d seen like five different doctors and they wouldn’t let me come off Subutex.”\n\nShe called Lindsie Marsh at Brigid’s Path, who told her: “Honey, it’s OK, we’re here if you need us.”\n\nJust because someone was an addict doesn’t mean they can’t be a good mother Dona Couch\n\nMarsh, a mother who had experienced addiction a decade earlier, knew intimately what Dona was going through because she had been there herself. “She believed in me when I didn’t believe in myself,” Dona told me.\n\nWith support, Dona followed her doctor’s orders and had a healthy pregnancy. She and baby Zurii transitioned from the hospital to Brigid’s Path, where Zurii’s early days were much less disrupted than Journii’s had been. After 10 days, both mother and baby were able to go home together.\n\n“Just because someone was an addict doesn’t mean they can’t be a good mother,” Dona told me. “And it doesn’t mean they don’t deserve to have their children. Our little family is very important and I strive to make sure we’re doing the right thing, trying to set an example for my girls.”\n\nView image in fullscreen Zurii (three months), Journii, Dona and Raridy, cuddle on the couch at home.\n\nBy treating the dyad, both mother and baby, Maddie’s Place reports that an astounding 95% of the parents who came through their doors are now in recovery and have custody of their children.\n\nYet translating that success into broader practice has proved difficult. As hospitals across the country experiment with new models for caring for infants with NAS, one of the most influential, and to some problematic, approaches has been Eat, Sleep, Console (ESC), a protocol that prioritizes soothing over medication.\n\nIn 2014, Dr Matthew Grossman at Yale University formalized ESC as a treatment model designed to dramatically reduce the use of pharmaceuticals for newborn withdrawal and to encourage near-constant hands-on care. But hospitals remain ill-equipped: most lack the low-stimulation spaces these babies need, as well as the staffing to support mothers staying at their side.\n\nSome clinicians now worry the pendulum has perhaps swung too far. Jansson, the Johns Hopkins pediatrician and dyad-care specialist, argues that widespread adoption of ESC has led to the undermedication of certain newborns who would benefit from pharmacological support in their first months of life.\n\nView image in fullscreen Dona embraces her daughter Raridy after a flag football game.\n\nA 2025 study found that more than 80% of NICUs now have policies referencing ESC, but only about half are putting those practices into effect – and only half of those allow mothers to room in with their infants. Even when hospitals want to adopt dyadic models, most simply do not have the staff, expertise or space to do so.\n\nJansson supports the kind of care provided at Maddie’s Place, but, she told me, the economic argument is hard to sell: the savings – in future costs for foster care, juvenile detention, abuse, learning difficulties and maternal relapse – are real but long-term, while hospital budgets are short-term.\n\nThe argument that Shaun Cross, CEO of Maddie’s Place, is taking to state and federal legislators is that pediatric transitional care facilities are more effective than the current hospital model. They are highly staffed and allow longer stays. Their peer team is formidable and made up of men and women who have lived through substance use, homelessness, incarceration, poverty, trauma and unemployment. This model fosters an inclusive, nonjudgmental community.\n\nOf course, this comes at a cost. And while Maddie’s Place has been extraordinarily successful at fundraising – garnering about $16m to date – not every facility has been so lucky.\n\nView image in fullscreen Raridy caresses Zurii at a flag football game.\n\nSome hope for funds came in 2018 when Congress passed the bipartisan Caring Recovery for Infants and Babies, or Crib Act, signed into law by Donald Trump that September, which allowed Medicaid to cover services provided by pediatric transitional care facilities. Only two states adopted the act.\n\nDuring the first Trump administration, Melania Trump visited Lily’s Place, and a mother from Brigid’s Path attended the State of the Union address. Several lawmakers have toured Maddie’s Place. But the spotlight has not translated into a sustainable funding model. Barbara Drennen’s Pediatric Interim Care Center in Washington recently lost their funding, in June. At Lily’s Place, funding has also been a problem.\n\nWhen I visited Brigid’s Path in Ohio, only one of its two nurseries was open. The facility had lost several grants and its state funding earlier that summer. Although Ohio had adopted the Crib Act to allow Medicaid reimbursement for residential care, the payments had not yet started. To bridge the gap, Brigid’s Path had to lay off nearly two dozen employees.\n\nYet all three of the centers I visited offer a clear financial advantage: their costs are far lower than an NICU stay. Still, when the funds did arrive at Brigid’s Path, the per diem rate, $559, will cover only a fraction of the center’s costs, and represents a portion of the $7,200 hospitals receive for the same babies.\n\nMaddie’s Place has shown similar savings. When adding up the costs for care alone, the price per baby for a stay at Maddie’s Place is tens of thousands of dollars cheaper than the NICU; they estimate $44,000 less.\n\nView image in fullscreen Zurii, Dona, Raridy, Dona’s husband, Darrel ,and Journii play on the couch at home.\n\nIzzie is really into Frozen right now, the animated children’s movie about Elsa, a snow princess with special powers she cannot control. The princess learns that only love will help her use her powers for good.\n\nIzzie likes to stand in the living room, wearing a blanket like Elsa’s cape, and fling her arms around singing: “Let it gooo!”\n\n“She’s so happy all the time, a little ball of love and joy,” Stephanie said with a smile.\n\nShe had a few developmental issues. It took her a little longer than usual to crawl; balance and walking have been challenges. But she is otherwise healthy, vibrant, growing and learning.\n\nWhen I ask Stephanie what most people do not understand about addiction, she tells me that too many still think that just telling drug users to stop will help them.\n\n“When you’re using, you already feel worthless,” Stephanie said. “I felt like the world’s worst person when I finally asked for help.”\n\nWhen I press her about why Maddie’s Place has a 95% success rate – why mothers and fathers who go through the program still have their babies and are now living normal, happy lives – she says it is because Maddie’s Place is not just about the babies.\n\nView image in fullscreen Izzie is pushed on a swing at a park by her mom, Stephanie.\n\n“A lot of times our new staff come in here and they want to work with the babies. They want to love these babies back to life, which is great. But the dyad is just as important.”\n\nShe pauses for a second.\n\n“The one thing I’ll scream so that everybody can hear me, is that we’re still humans. Just because we use, just because we were homeless, just because we couldn’t get clean while we were pregnant, does not make us any less of a human.”\n\nThe biggest misconception, she adds, is that Maddie’s Place simply hands babies back to drug addicts.\n\n“That’s not it. We’re changing lives and encouraging them to love themselves. We see people come in here as one person and leave as a whole other person.”",
  "summary": "<p>A baby is born in withdrawal every 18 minutes in the US, and most end up in foster care. At centers like Maddie’s Place, mothers stay with their infants – and leave together, in recovery</p><p>Eight months pregnant and in pain, Stephanie Rosell went to the Holy family hospital emergency room after an infection began spreading up her legs. Unemployed and homeless, estranged from her family, she lived in a shed she had built in a friend’s yard. She was also addicted to fentanyl.</p><p>As doctors treated her infection, she began to panic. Withdrawal was setting in. She leaned over the bed and vomited.</p> <a href=\"https://www.theguardian.com/lifeandstyle/ng-interactive/2025/nov/20/addiction-withdrawal-mother-baby-maddies-place\">Continue reading...</a>",
  "published": "Thu, 20 Nov 2025 12:56:04 GMT",
  "url": "https://www.theguardian.com/lifeandstyle/ng-interactive/2025/nov/20/addiction-withdrawal-mother-baby-maddies-place",
  "source": "The Guardian"
}