{
  "title": "Prime Minister Narendra Modi to deliver Sixth Ramnath Goenka Lecture today",
  "text": "Prime Minister Narendra Modi will deliver the Sixth Ramnath Goenka Lecture here Monday.\n\nThe lecture, named after the founder of the Express Group, invites speakers who have shaped change and inspired critical thought on the most pressing contemporary challenges and issues.\n\n“This lecture is not a ceremony but a commitment to the values of truth-telling, accountability, and the power of ideas,” said Viveck Goenka, Chairman, Express Group.\n\n“This is a time when power equations of the world are being upended, when nations are redefining both their place and purpose and when uncertainty and volatility are the keywords of our times. That’s why listening to the Prime Minister, representing the highest elected office in the world’s largest democracy, has a deeper resonance,” he said.\n\nGoenka said that the Prime Minister, speaking in Ramnath Goenka’s name, is “a reaffirmation that the dialogue between the state and the free press remains the heartbeat of a confident nation.”\n\nThe Sixth Ramnath Goenka Lecture is privileged to host Prime Minister Narendra Modi as he outlines the ideas that will shape India’s future. Watch live on https://t.co/XYlZoV4VGS on November 17. #RNGLecture @anantgoenka @360ONEWealth pic.twitter.com/Fixuz5DIDk — The Indian Express (@IndianExpress) November 16, 2025\n\nThe first in the Ramnath Goenka lecture series was delivered by Marianne Pearl, wife of The Wall Street Journal reporter Daniel Pearl, who was killed by terrorists in Pakistan. Since then, spea­kers have included RBI Governor Dr Raghuram Rajan, who was prescient in his articulation of India’s role in the global economy; President Pranab Mukherjee, who reflected on the power of a free press in a democracy; Chief Justice Ranjan Gogoi who urged the judiciary to be on the “front foot” to reinforce its moral and institutional leverage; External Affairs Minister Dr S. Jaishankar, who talked about moving away from the dogmas of Delhi to embrace the dramatically changing world; and, most recently, technologist and philanthropist Bill Gates, who laid out the contours of how technology is reshaping human lives and scripting social change.",
  "summary": "",
  "published": "Sun, 16 Nov 2025 22:50:31 +0000",
  "url": "https://indianexpress.com/article/india/prime-minister-narendra-modi-to-deliver-sixth-ramnath-goenka-lecture-today-10369663/",
  "source": "India | The Indian Express"
}