{
  "title": "Olive farmers face danger, neglect after Israel’s war in southern Lebanon",
  "text": "Marjayoun district, Lebanon – In his southern Lebanese hometown of Hula, a few metres away from the border with Israel, Khairallah Yaacoub walks through his olive grove. Khairallah is harvesting the olives, even though there aren’t many this year.\n\nThe orchard, which once contained 200 olive trees and dozens of other fruit-bearing trees, is now largely destroyed. After a ceasefire was declared between Hezbollah and Israel in November 2024, ending a one-year war, the Israeli army entered the area, bulldozed the land, and uprooted trees across border areas, including Hula – 56,000 olive trees according to Lebanon’s Agriculture Minister Nizar Hani. Israeli officials have said that they plan to remain indefinitely in a “buffer zone” in the border region.\n\nIsraeli forces are not currently stationed in what remains of Khairallah’s farm, but the grove is fully exposed to Israeli positions in Menora, on the other side of the border. That makes the olive farmer’s every movement visible to the Israeli army, and is why he has been so afraid to venture to his trees before today.\n\nHarvesting under fire\n\n“This was the place where my brothers and I lived our lives,” said Khairallah, as he walked next to the olive trees that he said were more than 40 years old. “We spent long hours here ploughing, planting, and harvesting. But the [Israeli] occupation army has destroyed everything.”\n\nKhairallah now has 10 olive trees left, but their yield is small for several reasons, most notably the lack of rainfall and the fact that he and his brothers had to abandon the orchard when war broke out between Hezbollah and Israel on October 8, 2023. Khairallah’s aim now is to begin the process of restoring and replanting his olive grove, the main source of livelihood for the 55-year-old and his four brothers.\n\nAdvertisement\n\nThe farm in Hula, which lies in the district of Marjayoun, once provided them with not just olives, but olive oil, and various other fruits. They also kept 20 cows on the land, all of which have died due to the war.\n\nBut with the presence of the Israelis nearby, getting things back to a semblance of what they once were is not easy, and involves taking a lot of risks.\n\n“Last year, we couldn’t come to the grove and didn’t harvest the olives,” Khairallah said. “[Now,] the Israeli army might send me a warning through a drone or fire a stun grenade to scare me off, and if I don’t withdraw, I could be directly shelled.”\n\nSystematic destruction\n\nLike Khairallah, Hussein Daher is also a farmer in Marjayoun, but in the town of Blida, about five kilometres (3.1 miles) away from Hula.\n\nHussein owns several dunams of olive trees right on Lebanon’s border with Israel. Some of his olive trees, centuries old and inherited from his ancestors, were also uprooted. As for the ones still standing, Hussein has been unable to harvest them because of Israeli attacks.\n\nHussein described what he says was one such attack as he tried to reach one of his groves.\n\n“An Israeli drone appeared above me. I raised my hands to indicate that I am a farmer, but it came closer again,” said Hussein. “I moved to another spot, and minutes later, it returned to the same place I had been standing and dropped a bomb; if I hadn’t moved, it would have killed me.”\n\nThe United Nations reported last month that Israeli attacks in Lebanon since the beginning of the ceasefire had killed more than 270 people.\n\nThe dangers mean that some farmers have still not returned. But many, like Hussein, have no choice. The farmer emphasised that olive harvest seasons were an economic lifeline to him and to most other farmers.\n\nAnd they now have to attempt to recoup some of the losses they have had to sustain over the last two years.\n\nAccording to an April study by the United Nations’s Food and Agriculture Organization (FAO), 814 hectares (2,011 acres) of olive groves were destroyed, with losses in the sector alone estimated at $236m, a significant proportion of the total $586m losses in the wider agricultural sector.\n\n“We used to produce hundreds of containers of olive oil; today, we produce nothing,” said Hussein, who has a family of eight to provide for. “Some farmers used to produce more than 200 containers of olive oil per season, worth roughly $20,000. These families depended on olive farming, honey production, and agriculture, but now everything was destroyed.”\n\nAbandoned\n\nThe troubles facing the olive farmers have had a knock-on effect for the olive press owners who turn the harvested olives into Lebanon’s prized olive oil.\n\nAdvertisement\n\nAt one olive press in Aitaroun, also in southern Lebanon, the owner, Ahmad Ibrahim, told Al Jazeera that he had only produced one truckload of olive oil this year, compared with the 15 to 20 truckloads his presses make in a typical year.\n\n“Some villages, like Yaroun, used to bring large quantities of olives, but this year none came,” Ahmad said. “The occupation destroyed vast areas of their orchards and prevented farmers from reaching the remaining ones by shooting at them and keeping them away.”\n\nAhmad, in his 70s and a father of five, established this olive press in 2001. He emphasised that the decline in agriculture, particularly olive cultivation in southern Lebanon, would significantly affect local communities.\n\nMany of those areas are still scarred from the fighting, and the weapons used by Israel could still be affecting the olive trees and other crops being grown in southern Lebanon.\n\nHussein points to Israel’s alleged use of white phosphorus, a poisonous substance that burns whatever it lands on, saying the chemical has affected plant growth.\n\nExperts have previously told Al Jazeera that Israel’s use of white phosphorus, which Israel says it uses to create smokescreens on battlefields, is part of the attempt to create a buffer zone along the border.\n\nBut if Lebanese farmers are going to push back against the buffer zone plan, and bring the border region alive again, they’ll need support from authorities both in Lebanon and internationally – support they say has not been forthcoming.\n\n“Unfortunately, no one has compensated us, neither the Ministry of Agriculture nor anyone else,” said Khairallah, the farmer from Hula. “My losses aren’t just in the orchard that was bulldozed, but also in the farm and the house. My home, located in the middle of the town, was heavily damaged.”\n\nThe Lebanese government has said that it aims to support the districts affected by the war, and has backed NGO-led efforts to help farmers.\n\nSpeaking to Al Jazeera, Agriculture Minister Hani said that the government had begun to compensate farmers – up to $2,500 – and plant 200,000 olive seedlings. He also outlined restoration projects and the use of the country’s farmers registry to help the agricultural sector.\n\n“Through the registry, farmers will be able to obtain loans, assistance, and social and health support,” Hani said. “Olives and olive oil are of great and fundamental value, and are a top priority for the Ministry of Agriculture.”\n\nBut Khairallah, Hussein, and Ahmad have yet to see that help from the government, indicating that it will take some time to scale up recovery operations.\n\nThat absence of support, Hussein said, will eventually force the farmers to pack up and leave, abandoning a tradition hundreds of years old.\n\n“If a farmer does not plant, he cannot survive,” Hussein said. “Unfortunately, the government says it cannot help, while international organisations and donors, like the European Union and the World Bank, promised support, but we haven’t seen anything yet.”",
  "summary": "Farmers risk lives harvesting olives under Israeli military surveillance in Lebanon&#039;s border regions.",
  "published": "Thu, 20 Nov 2025 21:06:53 +0000",
  "url": "https://www.aljazeera.com/features/2025/11/20/olive-farmers-face-danger-neglect-after-israels-war-in-southern-lebanon?traffic_source=rss",
  "source": "Al Jazeera – Breaking News, World News and Video from Al Jazeera"
}