{
  "title": "Ramnath Goenka Lecture Live Updates: We win elections because we are committed to development and welfare 24/7, says PM Modi",
  "text": "Prime Minister Narendra Modi delivers the sixth Ramnath Goenka Lecture. (Express photo)\n\nPrime Minister Narendra Modi on Monday addressed the Sixth Ramnath Goenka Lecture, where he underscored the significance of the recently concluded Bihar assembly elections and touched upon several other issues. Highlighting a key trend from the results, the Prime Minister said women voters outnumbered men at the polling booths, calling it a “true victory for democracy”.\n\nPM Modi said the mandate reflected not just political preference but the “height of aspirations” among the people of Bihar. “The people of Bihar have shown what their aspirations are, and they have placed their trust in those who they believe can deliver on those expectations,” he said.\n\nStory continues below this ad Lauding the economy, Modi said India is not just an emerging market, but an emerging model. Further, he said, “The country’s development must reach every section of society. We have seen over the past decades how some parties focused only on their own interests…. But our mission to build 12 crore toilets has restored dignity to those who were once forced to defecate in the open.” Speaking about the group’s founder Ramnath Goenka, Modi said he always stood by the truth and added that national interest remained his foremost priority. The lecture, named after the founder of the Express Group, invites speakers who have shaped change and inspired critical thought on the most pressing contemporary challenges and issues. Live Updates Nov 17, 2025 10:04 PM IST Ramnath Goenka Lecture Live Updates: We do not oppose English, PM Modi urges nation to be free from colonial mindset \"Which country criticises its own languages? Japan, China, Korea, they adopted many global ideas but never compromised on language. This is why our National Education Policy emphasises learning in local languages. We do not oppose English -- we support Indian languages. Macaulay’s crime in 1835 will complete 200 years in 2035, ten years from now. So today, through this platform, I urge the nation: Let the next 10 years be our resolve to free ourselves from this colonial mindset. These ten years are crucial.\" Nov 17, 2025 10:01 PM IST Ramnath Goenka Lecture Live Updates: Post-Independence, we neglected our heritage, says PM Modi \"Look at tourism. Every country where tourism thrives takes pride in its heritage. In India, post-Independence, the opposite happened, we neglected our own heritage. Without pride, there is no preservation; without preservation, heritage becomes ruins. Pride in heritage is essential for tourism growth,\" said PM Modi. Nov 17, 2025 09:56 PM IST Ramnath Goenka Lecture Live Updates: Lakhs of BJP workers nurtured party with their sweat, says PM Modi \"Friends, lakhs of BJP workers have nurtured the party with their sweat, and in many states like Kerala, West Bengal, and Jammu & Kashmir, even with their blood. For such a party, winning elections is not the only goal, serving people and winning their hearts is equally important,\" said PM Modi. Nov 17, 2025 09:55 PM IST Ramnath Goenka Lecture Live Updates: PM Modi recounts Ramnath Goenka receiving Jan Sangh ticket \"Someone once told me a story about Ramnath ji receiving the Jan Sangh ticket from Vidisha. Nanaji Deshmukh told him: 'You only need to come to file your nomination and later to collect your certificate after winning.' Nanaji and party workers fought the election on his behalf and ensured his victory. I mention this not to suggest that candidates should only come to file nominations, but to highlight the dedication of BJP’s countless committed workers,\" said PM Modi. Nov 17, 2025 09:13 PM IST Ramnath Goenka Lecture Live Updates: Blank editorial can challenge mindset that seeks to silence, says PM Modi on what Indian Express showed during Emergency “Ramnath Goenka ji bravely stood up to British rule. In one of his editorials, he wrote that he would rather shut down his newspaper than follow the ideals of the British. Similarly, when the country was pushed into the darkness of Emergency, he rose to resist that attempt to enslave the nation. This year also marks 50 years since the Emergency was lifted. And The Indian Express showed even then that a blank editorial can challenge a mindset that seeks to silence and subdue the people, said PM Modi. Nov 17, 2025 09:10 PM IST Ramnath Goenka Lecture Live Updates: PM Modi renames Congress. Watch video Nov 17, 2025 09:03 PM IST Ramnath Goenka Lecture Live Updates: Congress transformed into 'Muslim League Maowadi Congress', says PM Modi “For the past five decades, almost every region in India had been affected by Maoists. But unfortunately, the Congress chose to nurture those who do not believe in the Indian Constitution. Congress went on to embed ‘urban naxals’ within major institutions. The urban naxal–Maoist ecosystem that had taken root in the Congress 10–15 years ago has now transformed into the ‘Muslim League Maowadi Congress (MMC)’. And today, I say with full responsibility that the MMC has sidelined national interest for its own political gain,” says PM Modi. Nov 17, 2025 09:00 PM IST Ramnath Goenka Lecture Live Updates: Number of naxalites reduced significantly, says PM Modi Speaking about Bastar region in Chhattisgarh, PM Modi said the number of naxalites and terrorists has reduced significantly in the country. However, in the past five decades, it was unfortunate that the Congress favoured naxalites. They not only favoured the group dwelling in forests, but also those in urban areas as well, PM Modi added. Nov 17, 2025 08:50 PM IST Ramnath Goenka Lecture Live Updates: GDP growing near 7 percent, says PM Modi \"Our GDP is growing at near 7 per cent despite global instabilities; India is not just an emerging market but an emerging model too,\" says PM Modi. Nov 17, 2025 08:47 PM IST Ramnath Goenka Lecture Live Updates: Mission to build 12 crore toilets restored dignity, says PM Modi “The country’s development must reach every section of society. We have seen over the past decades how some parties focused only on their own interests.... But our mission to build 12 crore toilets has restored dignity to those who were once forced to defecate in the open.” Nov 17, 2025 08:41 PM IST Ramnath Goenka Lecture Live Updates: Bihar Election results taught a lesson, PM Modi tells states Referring to the states ruled by the Left, Right, and the Centre, PM Modi said the Bihar election results have taught us a lesson about the sort of government that we are running. Such an impact will be reflected in the upcoming elections as well, said PM Modi. Nov 17, 2025 08:32 PM IST Ramnath Goenka Lecture Live Updates: Bihar's historic voter turnout -- a victory of democracy, says PM Modi Its the victory of democracy that Bihar recorded a historic voter turnout, especially in the category of women, says PM Modi. Nov 17, 2025 08:30 PM IST Ramnath Goenka Lecture Live Updates: India not just emerging market, but a model, says PM Modi India is not just an emerging market, but an emerging model, says PM Modi. Nov 17, 2025 08:30 PM IST Ramnath Goenka Lecture Live Updates: National interest remained Ramnath Goenka’s foremost priority, says PM Modi Speaking about the group’s founder Ramnath Goenka, Modi said he always stood by the truth and added that national interest remained his foremost priority. Nov 17, 2025 08:29 PM IST Ramnath Goenka Lecture Live Updates: India sustained high growth rate in past four to five years, says PM Modi \"Although the past four to five years have brought significant global challenges, India has nevertheless sustained a high growth rate,\" says PM Modi Nov 17, 2025 08:25 PM IST Ramnath Goenka Lecture Live Updates: PM Modi begins address at 6th Ramnath Goenka Lecture Prime Minister Narendra Modi has begun his address at the Sixth Ramnath Goenka Lecture. Speaking about the group's founder Ramnath Goenka, Modi said he always stood by the truth. Nov 17, 2025 08:17 PM IST Ramnath Goenka Lecture Live Updates: Democracy survives through daily acts of courage, says Viveck Goenka \"In 75th year, we are reminded that democracy survives through daily acts of courage by leaders who listen, journalists who persist and readers who care, \" says Viveck Goenka, Chairman, Express Group. Goenka is delivering the welcome speech. Nov 17, 2025 08:14 PM IST Ramnath Goenka Lecture Live Updates: Viveck Goenka, Chairman, Express Group delivers welcome speech Viveck Goenka, Chairman, Express Group is delivering the welcome speech and he traces back the time when the founder Ramnath Goenka stood firm during the Emergency. Nov 17, 2025 08:04 PM IST Ramnath Goenka Lecture Live Updates: PM Modi at RNG Lecture | In pic Nov 17, 2025 07:59 PM IST Ramnath Goenka Lecture Live Updates: RNG Lecture to begin in few minutes Ramnath Goenka Lecture will begin in a few minutes. Stay tuned here for updates. Nov 17, 2025 07:33 PM IST Ramnath Goenka Lecture Live Updates: Forum for ideas that shape our national discourse, says PM Modi on RNG lecture Prime Minister Narendra Modi will deliver the sixth Ramnath Goenka lecture shortly and in a post on X, he wrote that he is glad to see this Lecture become a significant forum for ideas that shape our national discourse. Modi's post read, \"At around 8:15 PM this evening, will be delivering the sixth Ramnath Goenka Lecture in Delhi. This platform celebrates the life and work of one of India’s most respected media pioneers. Shri Ramnath Goenka Ji stood for courage and integrity in public life. Glad to see this Lecture become a significant forum for ideas that shape our national discourse.\" Nov 17, 2025 07:03 PM IST Ramnath Goenka Lecture Live Updates: RNG lecture to begin shortly Nov 17, 2025 06:39 PM IST Ramnath Goenka Lecture Live Updates: Where to watch the lecture? https://www.youtube.com/live/LMfSx0t0t2U?si=ul7T2vbXh0LQsxx3 Nov 17, 2025 05:43 PM IST Ramnath Goenka Lecture Live Updates: Dialogue between state and free press remains heartbeat of confident nation, says Express Group Chairman on PM Modi address Viveck Goenka, Chairman, Express Group, said that the Prime Minister, speaking in Ramnath Goenka’s name, is “a reaffirmation that the dialogue between the state and the free press remains the heartbeat of a confident nation.” “This lecture is not a ceremony but a commitment to the values of truth-telling, accountability, and the power of ideas,” he said. This is a time when power equations of the world are being upended, when nations are redefining both their place and purpose and when uncertainty and volatility are the keywords of our times. That’s why listening to the Prime Minister, representing the highest elected office in the world’s largest democracy, has a deeper resonance,” he added. Nov 17, 2025 05:28 PM IST Ramnath Goenka Lecture Live Updates: The Sixth Ramnath Goenka Lecture Prime Minister Narendra Modi is set to deliver the Sixth Ramnath Goenka Lecture shortly. The lecture, named after the founder of the Express Group, invites speakers who have shaped change and inspired critical thought on the most pressing contemporary challenges and issues. Nov 17, 2025 05:22 PM IST Hello and welcome to Ramnath Goenka Lecture Live blog! Prime Minister Narendra Modi is set to deliver the sixth Ramnath Goenka Lecture shortly. Stay tuned here for the latest updates from the lecture series.\n\nStay updated with the latest - Click here to follow us on Instagram\n\n© IE Online Media Services Pvt Ltd",
  "summary": "",
  "published": "Mon, 17 Nov 2025 11:41:56 +0000",
  "url": "https://indianexpress.com/article/india/pm-modi-ramnath-goenka-lecture-10370731/",
  "source": "India | The Indian Express"
}