{
  "title": "Streaming platform Twitch added to Australia's teen social media ban",
  "text": "Streaming platform Twitch added to Australia's teen social media ban\n\n3 hours ago Share Save Lana Lam Sydney Share Save\n\nGetty Images Twitch is the latest platform to be included in Australia's teen social media ban\n\nTwitch, a streaming platform popular with gamers, has been added to Australia's teen social media ban which starts next month. It joins other platforms such as Facebook, Instagram, Tik Tok and Snapchat that must ensure under-16s cannot open accounts and existing ones are closed from 10 December. Australia's internet regulator overseeing the ban said Twitch - owned by Amazon -has been included as its main purpose was \"online social interaction\" where users were encouraged to chat to each other about posted content. A Twitch spokesperson said Australians under 16 will not be able to open a Twitch account from 10 December, and from 9 January, existing under-16s accounts will be deactivated.\n\nOn her reasons why Twitch had been included, eSafety Commissioner Julie Inman Grant said it was \"a platform most commonly used for livestreaming or posting content that enables users, including Australian children, to interact with others in relation to the content posted\". No more platforms are expected to be added to the ban before the start date next month, Ms Inman Grant said. The government has previously said the ban is aimed at reducing the \"pressures and risks\" children can be exposed to on social media, including harmful content. Founded in 2007, Twitch is a popular livestreaming platform, where people typically play video games while chatting to viewers. Last year, it launched plans to share more of its revenue with creators as part of a shake-up, allowing streamers to make money through fans subscribing to their channel. The revenue is split equally between Twitch and the creator, after fees are paid. Twitch's policy forbids anyone under 13 to use its platform and users aged between 13 and the legal age of adulthood in their country can join if they have permission from their parent or guardian.",
  "summary": "It joins other platforms including Facebook, Instagram, TikTok and Snapchat in the ban that starts next month.",
  "published": "Fri, 21 Nov 2025 02:33:49 GMT",
  "url": "https://www.bbc.com/news/articles/cx2n2955g10o?at_medium=RSS&at_campaign=rss",
  "source": "BBC News"
}