{
  "title": "What's next for the NFL's international games?",
  "text": "The Jacksonville Jaguars have played in London each year from 2013, and twice in 2023.\n\nThey are the only team solely responsible for organising an international game so keep all revenues from the event, and team president Mark Lamping told BBC Sport that a Wembley game is more profitable than one in Jacksonville.\n\nBut rumours of the Jaguars one day relocating to London were quashed when the Florida franchise committed to a major renovation project of their own stadium costing $1.4bn (£1.1bn).\n\nWhile that work takes place, the capacity will be reduced in 2026 and the Jags must play elsewhere in 2027, reportedly in Orlando,, external so they have the option to play two games internationally in 2026 and three in 2027., external\n\n\"We haven't determined the number yet,\" said Lamping. \"First we have to determine where we'll play in 2027, then if there are scheduling difficulties, that may lead us one way or the other.\"\n\nTickets did not sell as quickly for this season's London games, but come gameday the attendances at Tottenham and Wembley matched previous years.\n\nDespite there being more international games, many European fans still travel to the UK. BBC Sport spoke to several Germans who attended a London game as they have never managed to get a ticket for a game in their home nation, such is the demand in their homeland.\n\n\"NFL fans across Europe are being served incredibly well,\" added Hodgson. \"There's lots of opportunities to visit different countries and watch NFL games, but I think there's [still] more than enough appetite for fans to come and visit us.\"",
  "summary": "After playing a record seven regular-season games overseas this season, where will the NFL's international expansion take the league from 2026?",
  "published": "Wed, 19 Nov 2025 06:46:11 GMT",
  "url": "https://www.bbc.com/sport/american-football/articles/cz0xzlz7k98o?at_medium=RSS&at_campaign=rss",
  "source": "BBC Sport"
}