{
  "title": "How Playboy cut ties with Hugh Hefner to create a post-MeToo brand",
  "text": "Editor’s Note: The views expressed in this commentary are solely those of the writers. CNN is showcasing the work of The Conversation, a collaboration between journalists and academics to provide news analysis and commentary. The content is produced solely by The Conversation.\n\nThe Conversation —\n\nHugh Hefner launched Playboy Magazine 70 years ago this year. The first issue included a nude photograph of Marilyn Monroe, which he had purchased and published without her knowledge or consent.\n\nHefner went on to build the Playboy brand off the backs of the countless women featured in its pages, whose beauty and performance of heightened feminine sexuality have entertained its readers for generations.\n\nApproaching its 70th anniversary in December, Playboy has radically shifted. With the magazine no longer in publication, the Playboy Mansion sold to a developer and London’s last remaining Playboy Club closing in 2021, what is the future for Playboy? The brand is changing to keep up with the post-#MeToo world.\n\nHefner passed away one month before allegations against film producer Harvey Weinstein surfaced in 2017 giving momentum to the #MeToo movement (which saw survivors of sexual assault and harassment speak out against their abusers).\n\nREAD MORE: Sex, love and companionship … with AI? Why human-machine relationships could go mainstream\n\nIn recent years, many have re-evaluated Hefner’s legacy and relationships with women. The 2022 docuseries “The Secrets of Playboy” (which aired on Channel 4 in the UK) detailed sexual misconduct accusations against Hefner from several ex-girlfriends, including model Sondra Theodore and TV personality Holly Madison.\n\nHugh Hefner and Pamela Anderson during Playboy's 50th Anniversary Celebration at New York Armory in New York City. Theo Wargo/WireImage/Getty Images\n\nHefner and Playboy’s relationship with women has been complicated. Playboy was an early supporter of abortion rights, helped fund the first rape kit and was at times an early proponent of inclusivity (for example featuring transgender model, Caroline “Tula” Cossey, in its June 1981 issue). But most women featured in Playboy have fit within a narrow beauty standard — thin, white, able-bodied and blonde.\n\nMeanwhile Hefner’s personal relationship with his much younger girlfriends reportedly followed patterns of control and emotional abuse. Ex-girlfriend Holly Madison described Hefner as treating her “like a glorified pet” in her 2015 memoir, “Down the Rabbit Hole.”\n\nHefner’s passing meant he evaded reckoning with the #MeToo movement. Playboy, however, responded, releasing a statement in which it affirmed support for the women featured in “The Secrets of Playboy” and called Hefner’s actions “abhorrent.”\n\nThe statement declared that the brand was no longer affiliated with the Hefner family and would be focusing on aspects of the company’s legacy that align with values of sex positivity and free expression.\n\nREAD MORE: The ‘milf’: a brief cultural history, from Mrs Robinson to Stifler’s mom\n\nToday, Playboy is a very different company from the one Hefner launched nearly 70 years ago. Roughly 80% of Playboy staff identify as women, according the company, and its motto has changed from “Entertainment for Men” to “Pleasure for All.” Shares in the company are publicly traded and 40% of its board and management are women.\n\nThe company has also moved towards more creator-led content through its app, Playboy Centerfold. Similar to subscription content service OnlyFans, Playboy Centerfold allows subscribers to view content from and interact with its creators, which it call “bunnies.”\n\nPlayboy \"bunnies\" in the West Indies, 1965. Daily Herald/Mirrorpix/Getty Images\n\nOn the app, creators — or bunnies — are able portray their own bodies however they wish, putting the power back in their hands. Perhaps Playboy’s future is no longer in serving the male gaze, but instead the very audience Hefner dismissed in his first letter from the editor:\n\n“If you’re a man between the ages of 18 and 80 Playboy is meant for you … If you’re somebody’s sister, wife or mother-in-law and picked us up by mistake, please pass us along to the man in your life and get back to your Ladies Home Companion.”\n\nThe bunnies next door\n\nThe stars of Playboy’s mid-2000s reality series, Holly Madison and Bridget Marquardt, are also enjoying a resurgence among fans.\n\n“The Girls Next Door” launched in 2004. The show focused on the lives of Hefner’s three girlfriends, Madison, Marquardt and Kendra Wilkinson. It became E’s best performing show and cultivated a new female audience for Playboy.\n\n“The Girls Next Door” was a story of complicated empowerment despite patriarchal interference. Its three female protagonists went from being known solely as some of Hefner’s many blonde girlfriends, to celebrities in their own right.\n\nThey each ultimately broke up with Hefner, leaving the Mansion and going on to lead successful careers.\n\nThe show’s depiction of Madison, Marquardt and Wilkinson as empowered, fun-loving and complex individuals, who found joy and agency through expressing their sexuality was perhaps what drew so many female fans to the show. However, amid the girls’ fight for agency, Hefner retaliated.\n\nBridget Marquardt and Hugh Hefner with Holly Madison and Kendra Wilkinson in 2008. Jeffrey Mayer/WireImage/Getty Images\n\nThe series shows that he maintained final say in every Playboy photograph of the girls, as well as imposing strict curfews and spending allowances.\n\nIn Madison and Wilkinson’s memoirs, “Down the Rabbit Hole,” and “Sliding into Home,” they claim that production consistently undermined them. They refused to pay them for the first season, didn’t credit them until season four and aired their uncensored nude bodies in foreign broadcasts and DVD releases without consent.\n\nREAD MORE: #MeToo in space: We must address the potential for sexual harassment and assault away from Earth\n\nFan interest in “The Girls Next Door” remains strong. In August 2022 Madison and Marquardt launched their podcast “Girls Next Level,” where they interview previous playmates and interact with fans. They also recap episodes from their own points of view, unpacking their experiences of working on the show.\n\nHaving reached 10 million downloads as of February 2023, the success of the podcast — 14 years after the last episode of “The Girls Next Door” — speaks to the cultural legacy of the Playboy brand. It also shows that despite Hefner’s original editor’s note, Playboy resonates with some women.\n\nPlayboy is now in a post-Hefner era, where the imagery of women found within old issues of Playboy can serve as inspiration for others to enjoy their own sexuality. Whatever the future has for the company, the concept of Playboy has become public property — be that in the appearance of Playboy bunny costumes each Halloween, the popularity of cheeky Playboy logo tattoos or branded lingerie and clothing.\n\nIn a post-#MeToo era, the women of Playboy are speaking up and taking over. With the mansion gates closed, the bunnies are finally reclaiming the brand as their own.\n\nCNN\n\nTop Image: Hugh Hefner with Playboy “bunnies” in London in 1966.",
  "summary": "Hugh Hefner launched Playboy Magazine 70 years ago this year. The first issue included a nude photograph of Marilyn Monroe, which he had purchased and published without her knowledge or consent.",
  "published": "Tue, 11 Apr 2023 07:10:28 GMT",
  "url": "https://www.cnn.com/style/article/playboy-the-conversation/index.html",
  "source": "CNN.com - RSS Channel - World"
}