{
  "title": "Beats the doomscroll! The best analogue Christmas gifts in the UK",
  "text": "All I want for Christmas is … to reclaim my attention span. Granted, it’s not the sexiest-sounding new year resolution, but for those who are addicted to scrolling, it’s basically the equivalent of 75 Hard.\n\nThe Guardian’s journalism is independent. We will earn a commission if you buy something through an affiliate link. Learn more.\n\nThe daily average for watching all types of screen is now almost 7.5 hours in the UK; almost 70% of young people have said social media makes them feel worse about themselves; and since I sat down to write this, I’ve checked my phone upwards of five times. So what to do?\n\nGen Z have taken matters into their own hands and turned to “cosy crafts” such as knitting and pottery; 90s nostalgia appears to be at an all-time high; even diehard gamers are resorting to old-school consoles in a bid to switch off. In an environment where virtually everything, from work to relaxation, involves wading around in the online world, the only truly novel Christmas gift seems to be screen-free.\n\nSo what do you get the person who has everything available at their fingertips, and deliverable within three to five working days? From analogue cameras to turntables, we’ve put in the hard yards for you, so you can get busy logging off. (After you’ve scrolled to the bottom of this article, naturally.)\n\nThe best analogue Christmas gifts\n\nPoetry diary\n\nI’d spend much less time dreading meetings if Google Calendar were interwoven with Seamus Heaney, John Keats, Mary Jean Chan and Sylvia Plath poems. For now, I’ll settle for Faber’s beautiful week-to-view A5 diary. It contains a selection of 40 poems from its catalogue each year – some of them seasonal; all of them delightful. Buy it for the poetry lover in your life – or better, buy it for someone you’re hoping to convert.\n\nSew it goes\n\nSewing machine\n\nPut down the Wundaweb, it’s time to learn how to sew. This beginner’s sewing machine from John Lewis isn’t strictly speaking analogue, as a machine, but with its retro design and 14 stitch options, it couldn’t be a more wholesome antidote to the endless scroll. “When did an essential life skill become a niche hobby?” I often wonder as I’m trying to roll up a pair of trousers (in a chic way, definitely not in a “these definitely don’t fit me” kind of way).\n\nThe best kind of subs\n\nMagazine subscription\n\nWho doesn’t love a good old-fashioned magazine? (All of us, apparently, given the implosion of the industry.) Anyway, there’s a magazine subscription to serve just about any interest – from cooking to photography – and every month it lands through their door, the recipient will think of you. In a bid to kick my habit of gawping at celebrity house tours on YouTube, I took out a subscription to biannual interiors magazine Apartamento, and it may just be the best thing I’ve ever bought.\n\nAt the art of everything\n\nArt Work by Sally Mann\n\nWhat does a day in the life of an artist look like? American photographer Sally Mann answers this, and more, in her book Art Work. It’s a meditation on the creative life that serves as part-memoir, part-advice manual for surviving everything from distraction to rejection.\n\nGalleries galore\n\nNational art pass\n\nLooking at art in person is scientifically proven to be good for you. King’s College London released a study that found that when 50 people, aged 18–40, looked at paintings in person, their stress hormones dropped by 22%. Additionally, a 2024 study commissioned by the UK government found that a population engaged with art and culture is broadly a healthier one.\n\nEnter the National Art Pass, which provides free entry to more than 250 galleries, museums and historic places, plus 50% off major exhibitions at places such as the National Gallery, the Tate and the V&A. You don’t have to be commutable to London either: it can be used across the country, from National Galleries Scotland to the Dylan Thomas Boathouse in Carmarthenshire. (Those based in London and the surrounding areas will probably get the most out of it, though.)\n\nRead and write\n\nNose in a Book reading journal\n\nHelp the Goodreads and BookTok addicts in your life make up their own minds about what they read with the help of a book journal. This one from Papier has a tracker to note the books you’ve borrowed (and lent), space to review 32 books and pages to write down your favourite books of the year. Any stationery lover will be enamoured.\n\nStow away those screens\n\nLockable storage box\n\nShort of getting your loved one to chuck their phone in a fountain, a lockable storage box is the best way of helping a screen addict come back down to earth. Whether it’s for family dinner or homework focus time, sometimes a cold-turkey approach is best. This lockbox from Lockabox is fridge- and freezer-proof, too, should things get really out of hand.\n\nA different type of tick-tock\n\nAlarm clock\n\nWhat if we didn’t start the day by staring into the screaming face of our iPhones? Newgate’s Ronnie alarm clock is a charming antidote to the wake-up-and-doom-scroll routine many of us are subscribed to. The design aficionado in your life will thank you for it.\n\nSound advice\n\nTurntable\n\nAs music nerds know, premium turntables usually don’t come with built-in speakers. (They don’t come cheap, either.) Victrola’s all-in-one record player, though, is a great gift for the medium-grade music fan in your life, and would make a brilliant first record player for anyone who doesn’t remember a time before Spotify. It’s easy to set up and Bluetooth-compatible, so you can connect it to external speakers if the built-in ones aren’t to your liking.\n\nScratch that stitch itch\n\nBeginner knitting kit\n\nskip past newsletter promotion Sign up to The Filter Free weekly newsletter Get the best shopping advice from the Filter team straight to your inbox. The Guardian’s journalism is independent. We will earn a commission if you buy something through an affiliate link. Enter your email address Sign up Privacy Notice: Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on theguardian.com to send you this newsletter. You can complete full registration at any time. For more information about how we use your data see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nIf you haven’t been following the rise of the knitfluencer – Kamala Harris’s stepdaughter Ella Emhoff is one; Game of Wool presenter Tom Daley is another – then I’m telling you that knitting is back, big time. Which is good news, considering it has several wellbeing benefits. Wool and the Gang does great starter kits for beginners: including this Smith scarf kit, which contains merino yarn and the pattern (needles can be thrown in at an additional cost).\n\nFor more, read our guide to knitting for beginners\n\nSnap shots\n\nPolaroid camera\n\nDisposable camera\n\nFor those who love the idea of going offline but are hooked on instant gratification, a Polaroid camera is the holy grail of gifts. Buy it for the aspiring Andy Warhol in your life and watch them flourish – or at least, drunkenly document the New Year’s Eve party. (You can’t beat a good disposable camera as a stocking filler, either – this one from Boots is on my Christmas list.)\n\nBored games\n\nBusy Ideas For Bored Kids\n\nFor when drawing a house gets a little old. Curb kids’ boredom and teach them about art at the same time with this little box of 50 ideas – from foil sculptures to surrealism – for them to do alone or with the help of an adult.\n\nPlot twist\n\nThe Collected Stories of Lorrie Moore\n\nA good short story is the best cure for a reading slump – the good ones contain the depth and complexity of a novel in just a couple of thousand words. Faber’s doorstop edition of Lorrie Moore’s collected stories is a joy to read, and a joy to give both newbies and longtime fans.\n\nDalí routine\n\nTate perpetual postcard calendar\n\nThe Tate perpetual postcard calendar is back for 2026 (and every year after that until the end of time). Each calendar comes with 24 postcards featuring different pieces from the Tate collection – from Lubaina Himid to John Singer Sargent – or you can go rogue and slot in your own postcards from your favourite exhibitions. (The gallery also claims that the entire calendar and its packaging materials are responsibly sourced.)\n\nLove at first bite\n\nLugma by Noor Murad\n\nLeafing through the glossy pages of a cookbook sure beats a beleaguered scroll through the internet’s many food blogs of a Sunday afternoon. Chef Noor Murad has co-authored a couple of Ottolenghi Test Kitchen books, but Lugma – Arabic for “a bite” – is her solo debut. A favourite of Filter deputy editor Monica Horridge, I’m considering it for the promise of easy cardamom pancakes with honey lime syrup, and cardamom and chipotle-rubbed lamb chops. (Never enough cardamom.)\n\nPiece out\n\nColorgram wooden puzzle\n\nA mathematical puzzle from about 250BC doesn’t exactly scream Christmas, but Boostology’s take on Archimedes’ (notoriously difficult) Ostomachion promises to be fun for all the family. Made up of 14 wooden pieces of various shapes, there are more than 500 ways of solving it. Sounds easy? Yeah right.\n\nPerfectly imperfect\n\nKintsugi repair kit\n\nThe ancient Japanese repair technique of kintsugi (meaning to join with gold) is about highlighting and celebrating an object’s flaws. Thought to have originated in the 15th century, it’s an extension of the Japanese philosophy of wabi-sabi, which finds beauty in the imperfect, impermanent and incomplete. This new kintsugi kit from Humade may not contain the Japanese tree sap used in ancient techniques, but it does contain a lovely bit of gold powder and some glue, so you can carefully piece back together both your attention span and your vases.\n\nForever flora\n\nPocket flower press\n\nTouch grass, as the kids say. Or flowers. Either helps. This pocket-sized flower press is a sure-fire way of adding a bit of excitement to the school run or dog walk, all while bringing us closer to nature. What’s not to like?\n\nFor more, read the Filter’s best Christmas gifts for 2025\n\nKate McCusker is a features writer, covering everything from housing to lifestyle trends. Perennially seeking ways to escape the internet, when she’s not working, she’s most likely staring into space or resisting the urge to lob her phone in a lake. She received the Scott Trust Bursary in 2023",
  "summary": "<p>These old-school presents, from Polaroid cameras to poetry diaries, are the ultimate antidote to digital overload</p><p>• <a href=\"https://www.theguardian.com/thefilter/2025/nov/06/best-90s-gifts-nostalgic-uk\"><strong>The best 90s Christmas gifts: 15 nostalgic picks</strong></a></p><p>All I want for Christmas is … to reclaim my attention span. Granted, it’s not the sexiest-sounding new year resolution, but for those who are addicted to scrolling, it’s basically the equivalent of <a href=\"https://www.theguardian.com/lifeandstyle/2025/jan/07/75-hard-viral-fitness-challenge-back-but-is-it-best-way-to-spend-january\">75 Hard</a>.</p><p>The daily average for watching all types of screen is now almost <a href=\"https://www.theguardian.com/media/2025/jun/25/adults-great-britain-time-mobiles-watching-tv-screen-ipa-survey\">7.5 hours in the UK</a>; almost <a href=\"https://www.theguardian.com/technology/2025/may/20/almost-half-of-young-people-would-prefer-a-world-without-internet-uk-study-finds\">70% of young people</a> have said social media makes them feel worse about themselves; and since I sat down to write this, I’ve checked my phone upwards of five times. So what to do?</p> <a href=\"https://www.theguardian.com/thefilter/2025/nov/19/best-screen-free-christmas-gifts-uk\">Continue reading...</a>",
  "published": "Wed, 19 Nov 2025 19:00:02 GMT",
  "url": "https://www.theguardian.com/thefilter/2025/nov/19/best-screen-free-christmas-gifts-uk",
  "source": "The Guardian"
}