{
  "title": "Scientists melt early protein clumps and shut down Alzheimer’s damage",
  "text": "Researchers at Tokyo Metropolitan University have turned to concepts from polymer physics to better understand a central feature of Alzheimer's disease: the formation of tau protein fibrils. Their work revealed that these fibrils do not appear suddenly. Instead, they emerge after large clusters of tau proteins begin to gather in solution, a process that resembles polymer crystallization. When the scientists disrupted these early clusters, the fibrils failed to form, suggesting a promising direction for new strategies against neurodegenerative conditions.\n\nAlzheimer's disease (AD) remains one of the most difficult medical challenges, especially as global populations continue to age. Scientists have long focused on pharmacology and traditional biomedical approaches. However, the complexity of AD has driven researchers to explore insights from other scientific fields that may open up new paths for understanding the disease and designing treatments.\n\nHow Polymer Behavior Helped Explain Tau Protein Fibrils\n\nLed by Professor Rei Kurita, the research team applied ideas from how polymers organize into crystals. Polymers, which are long chains of repeating molecular units, often do not crystallize by simply adding one chain at a time. Instead, they pass through intermediate precursor structures before forming an ordered crystal. Drawing on this concept, the scientists examined tau proteins in solution and found that fibril formation (fibrillization) is also preceded by a precursor stage. In this case, the precursor is a loose assembly of tau proteins measuring only tens of nanometers. Techniques including small angle X-ray scattering and fluorescence-based analyses confirmed the presence of these structures.\n\nA key discovery was that these precursors are not rigid but instead are soft, temporary clusters. The researchers were able to dissolve them by altering sodium chloride levels in the presence of heparin, a naturally occurring anticoagulant. When the clusters were disrupted or prevented from forming, the solution produced almost no tau fibrils. The team suggested that this effect occurs because increased concentrations of charged ions reduce how strongly tau proteins interact with heparin. According to their explanation, this change enhances electrostatic \"screening,\" making it more difficult for the molecules to find each other and form clusters.\n\nA New Therapeutic Direction for Alzheimer's and Beyond\n\nThese findings point to a potential shift in how scientists approach AD treatments. Instead of trying to break apart the final fibrils, therapies could aim at stopping the reversible precursor stage before harmful structures develop. This approach could influence not only AD research but also efforts to understand other neurodegenerative diseases, including Parkinson's disease.\n\nThis work was supported by JST SPRING Program Grant Number JPMJSP2156, JSPS KAKENHI Grant Numbers 22K07362, 25K21773, 24H00624, 22H05036, 23K21357, 25K02405, 23H00394, 23KK0133, and 20H01874, JST Moonshot R&D Program Grant Number JPMJMS2024, and AMED Grant Number 24wm0625303 and 25dk0207073.\n\nTau Protein Fibrils\n\nTau protein fibrils are abnormal bundles of tau proteins that assemble inside neurons when tau loses its normal shape and function. Under healthy conditions, tau works like a stabilizing support beam, helping maintain the microtubules that allow nutrients and signals to move through nerve cells. When tau becomes misfolded, it starts clumping together into long, fibrous aggregates known as fibrils. These structures interfere with the cell’s internal transport system and are strongly linked to the cognitive decline seen in Alzheimer’s disease and other neurodegenerative conditions. Because fibrils grow from smaller, early-stage tau clusters, researchers are increasingly focused on blocking these initial steps to prevent downstream damage.",
  "summary": "Researchers found that tau proteins don’t jump straight into forming Alzheimer’s-associated fibrils—first they assemble into soft, reversible clusters. When the clusters were dissolved, fibril growth was almost entirely suppressed. This reveals a promising new strategy: stop the precursors, stop the disease.",
  "published": "Sat, 15 Nov 2025 11:06:04 EST",
  "url": "https://www.sciencedaily.com/releases/2025/11/251115095914.htm",
  "source": "All Top News -- ScienceDaily"
}