{
  "title": "Rapist ex-Met officer given another life sentence",
  "text": "Rapist ex-Met officer given another life sentence\n\n19 hours ago Share Save Brian Farmer, at the Old Bailey and Danny Fullbrook Share Save\n\nHertfordshire Police David Carrick now must wait until 2055 before he can apply for parole\n\nConvicted rapist and former Met police constable David Carrick has received an additional life sentence. The 50-year-old was found guilty on Wednesday of sexually abusing a 12-year-old girl in the 1980s when he was 14 and raping a woman 20 years later. He had already been serving 36 life sentences with a minimum of 32 years after admitting 71 offences of sexual violence committed over a 17-year period. In a victim impact statement, the woman abused as a child told the court the trauma had \"followed me into adulthood\".\n\nCarrick was found guilty of five counts of indecent assault against her between April 1989 and August 1990. He was also convicted of two counts of rape against another woman, once in 2019 and once between December 2014 and April 2016, as well as additional counts of sexual assault and coercive and controlling behaviour against her.\n\nCarrick, seen here being arrested by police, shook his head repeatedly as the verdicts were read out\n\nProsecutor Tom Little KC said Carrick had to be treated as juvenile for the offences against the girl. He added mitigation was \"limited in its nature\" and the earliest date of parole had already been set at 2055, when he would be aged 78. Judge Mrs Justice McGowan said: \"The sentence I impose today will have little if any practical effect.\" She said Carrick had shown a \"lack of remorse\" and had \"cynically\" caused witnesses to attend court by denying the charges. \"Your behaviour as a sexual predator began when you were a child yourself,\" she told him, adding he had \"bullied and manipulated\" the woman.\n\nA statement from the woman abused as a child was read to the court by barrister Gareth Munday, representing the prosecution. It said: \"I don't believe David has any remorse... I don't think I will ever be able to trust anyone completely. \"The effects of these offences are not something I can simply move on from.\"\n\nPA Media David Carrick, sketched at an earlier court hearing in July, was found guilty of nine offences\n\nThe latest offences came to light after Carrick had pleaded guilty in 2022 and 2023 to other sexual offences. Carrick had denied the allegations, calling the now-adult woman a liar, and insisted sex with the second woman had been consensual. During the trial, jurors heard how Carrick had abused the young girl for about 18 months before she told her mother. Referencing this abuse, which took place when Carrick was a teenager, the judge said: \"They were the first examples to come to light of your disposition to commit predatory sexual crimes.\" The new sentence means Carrick, previously eligible for parole in 2054, must now wait until 2055.\n\nFollow Beds, Herts and Bucks news on BBC Sounds, Facebook, Instagram and X.",
  "summary": "David Carrick is sentenced for sexually abusing a 12-year-old girl and raping another woman.",
  "published": "Thu, 20 Nov 2025 11:47:56 GMT",
  "url": "https://www.bbc.com/news/articles/cy0y075nyw8o?at_medium=RSS&at_campaign=rss",
  "source": "BBC News"
}