{
  "title": "Research shows how solar arrays can aid grasslands during drought",
  "text": "New research from Colorado State University and Cornell University shows that the presence of solar panels in Colorado's grasslands may reduce water stress, improve soil moisture levels and -- particularly during dry years -- increase plant growth by about 20% or more compared to open fields.\n\nThe findings were published in Environmental Research Letters this week. The paper outlines the potential benefits and challenges when photovoltaic (PV) arrays are located in grassland ecosystems. The findings are particularly relevant when considering drought in the arid west and the potential for future climate change.\n\nWhile solar power systems are a key source of renewable energy, they reduce the amount of sunlight available for plant growth, which could impact these complex ecosystems in ways that reduce the wildlife they support, the carbon they store and the amount of forage they produce for livestock grazing. The work, based on four years of data from an agrivoltaics solar facility in Longmont, Colorado, represents the first effort to field test how co-locating solar and grasslands changes those dynamics.\n\nColorado's semi-arid grasslands often need more water than is available through precipitation in each season.\n\nThe team found that plants beneath and around the solar systems in that environment benefited from partial shading and additional water that collects on panels -- aiding in their fight to survive during the harsh summer months. They found that during a dry year, grass growth on the east side of panels was up to 90% more productive in some cases than the neighboring open site. During wet and normal years, this positive grass production response was reduced, but the east side of the panels still saw more grass production than the control site.\n\nCornell Postdoctoral Research Associate Matthew Sturchio is an author on the paper along with CSU University Distinguished Professor Alan Knapp. Sturchio was previously part of Knapp's team in the Department of Biology, and he is still an affiliated researcher at CSU.\n\nSturchio said the results demonstrate the potential of solar land use synergies in grasslands that support both needed renewable power generation and ecosystem stability.\n\n\"There have been several studies reporting improved plant and water relations from solar arrays,\" he said. \"However, this is the first analysis that shows how that pattern becomes more pronounced with increasing aridity or dryness like we see in Colorado.\n\n\"The most important takeaway here is that even though this solar array was designed to maximize energy generation -- not to promote beneficial environmental conditions for the grasses grown beneath -- it still provided a more favorable environment during a dry year.\"\n\nSturchio said those gains could increase if panels were instead designed to maximize their benefits depending on conditions. That may include changing their position to provide shade when air temperatures rise or configuring them to let more light in during key parts of the growing season.\n\n\"With small changes in array design, configuration and management, we may even realize untapped benefits, particularly those related to water use,\" he said.\n\nThe paper is part of ongoing research by the pair into agrivoltaics: a dual use approach where solar power infrastructure is designed and placed to also support livestock grazing or pollinator habitats in parallel. Those agricultural options don't require irrigation or machinery. However, because of their heavy reliance on rain to support plant growth, research like this is needed to understand how the addition of panels changes the environment overall.\n\nKnapp and his lab have been studying grasslands at CSU for decades, focusing primarily on how they cope with chronic water stress and drought. He said research in the paper focuses on perennial C3, \"cool season\" grasses that prefer wetter conditions. The next step will be to study the more common C4 grasses found in the plains of Colorado. Those plants flourish in warmer conditions with lots of sunlight.\n\n\"Those grasslands are even more water-limited than the ones we used in this study. Thus, we expect the capability of solar arrays to mitigate water stress may be even greater,\" Knapp said.\n\nSturchio added that solar panels may even provide an opportunity to restore grassland ecosystems by promoting diverse plant communities. He said building solar facilities in ecosystems that could benefit from their strategic placement is an obvious win-win.\n\n\"We hypothesize that grassland restoration in arid and semi-arid regions could benefit not only from the favorable conditions in solar arrays, but also from the environmental heterogeneity created by panels,\" he said. \"We are excited to test the functional underpinnings of that idea at the newly constructed Shortgrass Ecovoltaic Research Facility in Nunn, Colorado, very soon.\"",
  "summary": "New research shows that the presence of solar panels in Colorado's grasslands may reduce water stress, improve soil moisture levels and -- particularly during dry years -- increase plant growth by about 20% or more compared to open fields.",
  "published": "Mon, 02 Jun 2025 15:47:19 EDT",
  "url": "https://www.sciencedaily.com/releases/2025/06/250602154719.htm",
  "source": "Latest Science News -- ScienceDaily"
}