{
  "title": "Daily music listening linked to big drop in dementia risk",
  "text": "Listening to music after the age of 70 appears to be associated with a meaningful reduction in dementia risk. A research team from Monash University analyzed data from more than 10,800 older adults and found that people in this age group who regularly listened to music experienced a 39 percent lower likelihood of developing dementia.\n\nThe project, led by Monash honours student Emma Jaffa and Professor Joanne Ryan, examined how both listening to music and playing instruments relate to cognitive health in adults over 70. Their analysis showed that individuals who consistently listened to music, compared with those who never, rarely, or only sometimes did so, had a 39 percent reduced risk of dementia. Playing an instrument was also tied to benefits, with a 35 percent reduction in dementia risk.\n\nFindings Drawn From Large-Scale Aging Studies\n\nResearchers based their work on information from the ASPirin in Reducing Events in the Elderly (ASPREE) study and the ASPREE Longitudinal Study of Older Persons (ALSOP) sub‐study. The results were published in the International Journal of Geriatric Psychiatry.\n\nPeople who reported always listening to music demonstrated the strongest cognitive advantages. This group showed a 39 percent lower incidence of dementia and a 17 percent lower incidence of cognitive impairment, along with higher overall cognitive scores and better episodic memory (used when recalling everyday events). Those who both listened to and played music on a regular basis had a 33 percent reduced risk of dementia and a 22 percent reduced risk of cognitive impairment.\n\nMusic as an Accessible Activity for Brain Health\n\nMs Jaffa noted that the outcomes of the research \"suggests music activities may be an accessible strategy for maintaining cognitive health in older adults, though causation cannot be established,\" she said.\n\nThe findings come at a time when population aging is creating new public health challenges. Longer life expectancy has led to rising rates of age‐related conditions, including cognitive decline and dementia, which places increasing pressure on families and healthcare systems.\n\nLifestyle Choices May Shape Cognitive Aging\n\nSenior author Professor Ryan emphasized the urgency of exploring options to help delay or prevent dementia. \"With no cure currently available for dementia, the importance of identifying strategies to help prevent or delay onset of the disease is critical,\" she said.\n\nShe added that \"Evidence suggests that brain aging is not just based on age and genetics but can be influenced by one's own environmental and lifestyle choices. Our study suggests that lifestyle-based interventions, such as listening and/or playing music can promote cognitive health.\"",
  "summary": "Older adults who regularly listen to or play music appear to have significantly lower risks of dementia and cognitive decline. The data suggests that musical engagement could be a powerful, enjoyable tool for supporting cognitive resilience in aging.",
  "published": "Mon, 17 Nov 2025 09:31:10 EST",
  "url": "https://www.sciencedaily.com/releases/2025/11/251116105633.htm",
  "source": "All Top News -- ScienceDaily"
}