{
  "title": "Innovative immunotherapy shows promise against aggressive T cell cancers",
  "text": "A new type of immunotherapy that targets aggressive blood cancers shows promising results alongside manageable side effects, according to the results of an international phase 1/2 clinical trial led by researchers at Washington University School of Medicine in St. Louis.\n\nThe clinical trial evaluated the safety and efficacy of an innovative CAR-T cell immunotherapy that is specifically designed to attack cancerous T cells. Participants in the trial had been diagnosed with rare cancers -- T cell acute lymphoblastic leukemia or T cell lymphoblastic lymphoma -- and had run out of treatment options after standard therapy proved ineffective for them. With the new immunotherapy, most of the patients in the study who received the full dose of cells achieved full remission of their cancer.\n\nThe trial's results were published May 30 in the journal Blood.\n\n\"For patients with these rare and aggressive cancers, who have no other options, this has the potential to become a transformative advance in the field,\" said senior author John F. DiPersio, MD, PhD, the Virginia E. & Sam J. Golman Professor of Medicine at WashU Medicine, who first developed the therapy in his lab at WashU Medicine. \"The trial demonstrated a high likelihood of response to the therapy and even remission. This CAR-T cell treatment shows promise in becoming a 'bridge-to-transplant' therapy for patients who would otherwise not be eligible for stem cell transplantation, which is the only potentially curative treatment for these blood cancers.\"\n\nLarger studies with more patients and longer follow-up are necessary before the researchers can determine whether this new therapy could be curative on its own.\n\nThe current trial included 28 adult and adolescent patients with T cell acute lymphoblastic leukemia and T cell lymphoblastic lymphoma that either returned after several lines of therapy or that never responded to treatment. About 1,000 people are diagnosed with these cancers annually in the U.S. If the cancer does not respond to treatment or returns after initial treatment, patients survive only six months, on average, and less than 7% are still living at the five-year mark.\n\nThe therapy, called WU-CART-007, was developed by Wugen, a WashU biotech startup company founded by DiPersio and other WashU Medicine investigators, including Matthew Cooper, PhD, who co-founded the company when he was on the WashU Medicine faculty and now serves as Wugen's chief scientific officer. The researchers worked with WashU's Office of Technology Management (OTM) to launch the company in 2018. The clinical trial was conducted in Australia, Europe and multiple sites across the U.S. For the St. Louis site, the trial was conducted at Siteman Cancer Center, based at Barnes-Jewish Hospital and WashU Medicine.\n\nThe trial design included a dose-escalation phase, which determined the recommended dose of therapeutic cells that patients would receive for the second phase of the trial. Dose escalation helps determine the largest dose of CAR-T cells that patients can receive and still have manageable side effects. Thirteen patients received the full dose of 900 million CAR-T cells after undergoing a procedure to clear the patients' own immune cells. This procedure -- called lymphodepletion -- reduces immune cells, making room for the new therapeutic T cells to establish themselves and expand in number. Two of these patients died from their cancer or treatment complications, such as infection, during the study period.\n\nOf 11 patients who could be evaluated after treatment, the overall response rate was 91%, meaning 10 patients either showed no signs of cancer after treatment or their cancer cell burden was reduced significantly. Eight out of 11 patients (72.7%) achieved complete remission. At the study's data cut off, six who underwent a transplant remain in remission, with no evidence of disease, six to 12 months later.\n\n\"These response and remission rates -- ranging from 70%-90% of patients -- are much higher than we would expect from standard-of-care for this cancer type, which typically leads to remission in only 20%-40% of patients,\" said first and corresponding author Armin Ghobadi, MD, a professor of medicine and clinical director of the Center for Gene and Cellular Immunotherapy at WashU Medicine. \"These responses are remarkable because the patients in this trial had run out of options. They had very aggressive cancers return after several lines of therapy, including several who relapsed after an earlier stem cell transplant.\"\n\nMost patients (88.5%) experienced cytokine release syndrome as a side effect of the immunotherapy, and these cases were predominantly mild or moderate. Cytokine release syndrome is a common side effect of CAR-T cell therapy that occurs when large numbers of immune cells release chemicals that cause a full-body inflammatory response. About 19% of the patients experienced more-severe cytokine release syndrome. A small number of patients experienced rarer side effects, such as neurotoxicity syndrome and low-grade graft-versus-host disease. Adverse events were managed with additional therapies.\n\nOff-the-shelf cell therapy\n\nThe immunotherapy evaluated in the trial is considered a \"universal\" CAR-T cell therapy because -- harnessing CRISPR gene editing technology -- it can be produced from cells donated by any healthy individual and used to treat any patient with a T cell cancer. In contrast, approved CAR-T cell therapies are adapted from the patient's immune cells. The cells must be collected from the patient and shipped to a manufacturing facility to be made and then shipped back, a process that typically takes three to six weeks. In contrast, universal CAR-T cell therapies can be made ahead of time, stored frozen and be readily available \"off-the-shelf,\" greatly reducing the wait time before therapy can begin.\n\nUsing CRISPR gene editing tools, the production process deletes the T cell receptor from the donor cells, greatly reducing the risk of graft-versus-host disease, in which donor T cells attack healthy tissue. Removing another key antigen also prevents the CAR-T cells from attacking one another. The types of rare cancers in this study presented a unique challenge: the therapeutic cells and the cancer cells are both T cells, so steps must be taken to prevent the therapeutic T cells from mistaking one another for the cancer and causing CAR-T cell fratricide. All other approved CAR-T cell therapies target B cell cancers, which do not have this T cell self-targeting complication. After using CRISPR gene editing to modify the CAR-T cells to prevent these harmful side effects, the cells are further engineered to target a protein called CD7 on the surface of cancerous T cells to then destroy the cancer.\n\n\"A larger international clinical trial of this therapy is already underway,\" DiPersio said. \"We must complete this larger trial first, but we are hopeful this universal CAR-T cell therapy can become an approved treatment for patients with deadly T cell cancers.\"",
  "summary": "An international clinical trial shows an innovative CAR-T cell immunotherapy is promising against aggressive T cell cancers and has manageable side effects.",
  "published": "Fri, 30 May 2025 12:39:57 EDT",
  "url": "https://www.sciencedaily.com/releases/2025/05/250530123957.htm",
  "source": "Latest Science News -- ScienceDaily"
}