{
  "title": "Ukraine’s Zelenskyy receives ‘draft plan’ from US and expects to talk with Trump in coming days – as it happened",
  "text": "From 13h ago 16.15 GMT Zelenskyy expects to discuss peace plan options with Trump in coming days We are just getting a line from Reuters that the Ukrainian president, Volodymyr Zelenskyy, expects to discuss the diplomatic opportunities for ending the war in Ukraine with US president Donald Trump in the coming days, according to his office. Zelenskyy has reportedly received a draft peace plan from the US, and the two countries will jointly work on its further after Ukraine’s fundamental principles are also outlined, the agency reported. I will bring you the full quotes once we have them. Share Updated at 16.21 GMT\n\n13h ago 16.44 GMT Jakub Krupa The contrast between the tone of Zelenskyy’s official statement (17:28) and what Kyiv officials are actually thinking on the ground is striking (17:42). Ukrainians and their European allies will no doubt be making all sorts of representations in private to get to Trump and change the proposal. Share\n\n13h ago 16.42 GMT US-Russian peace proposal is ‘absurd’ and unacceptable, Kyiv officials say Luke Harding in Kyiv And back to Ukraine, a new US-Russian peace proposal to end the war in Ukraine has been dismissed as “absurd” and unacceptable by officials in Kyiv amid talks between Volodymyr Zelenskyy and a high-ranking US army delegation. They said the proposal reportedly drafted by Kirill Dmitriev, a close ally of Vladimir Putin, and Donald Trump’s special envoy Steve Witkoff was a “provocation”, the aim of which was to stir up division and “disorientate” Ukraine’s allies, they added. Ukrainian officials said the document amounted to Ukraine’s capitulation and an effective end to its sovereignty. It comes nearly four years after Russian troops tried, and failed, to seize Kyiv, and as efforts by the Trump administration to end the conflict remain stalled. One western diplomat said the Russians were seeking to take advantage of Ukraine’s domestic crisis. “It seems Dmitriev has spun this plan at a time when Zelenskyy is weak. The Russians are good at exploiting things,” they said. “It feels like every other Russian plan. I don’t think it’s going to fly with Ukraine.” Ukraine: US-Russian peace proposal is ‘absurd’ and unacceptable Read more Share\n\n13h ago 16.28 GMT Ukraine confirms receiving US draft peace plan, Zelenskyy will discuss key points with Trump The statement from the Ukrainian president’s office, posted on Telegram, confirms that Zelenskyy has received “a draft plan” which – as they stress – the US believes could unlock the talks. During today’s discussions with the US delegation in Kyiv, Zelenskyy “outlined the fundamental principles” important to Ukraine, with both sides agreeing to work on the draft further. “From the very first seconds of the Russian invasion, Ukraine has sought peace, and we support all meaningful proposals capable of bringing true peace closer,” the statement reads, explicitly endorsing US president Donald Trump’s overall efforts to end the war. It adds: “We are ready now, as before, to work constructively with the American side, as well as with our partners in Europe and around the world so that the outcome is peace.” Zelenskyy and Trump are expected to talk in the coming days to discusswhat more can be done, it says. Share\n\n13h ago 16.15 GMT Zelenskyy expects to discuss peace plan options with Trump in coming days We are just getting a line from Reuters that the Ukrainian president, Volodymyr Zelenskyy, expects to discuss the diplomatic opportunities for ending the war in Ukraine with US president Donald Trump in the coming days, according to his office. Zelenskyy has reportedly received a draft peace plan from the US, and the two countries will jointly work on its further after Ukraine’s fundamental principles are also outlined, the agency reported. I will bring you the full quotes once we have them. Share Updated at 16.21 GMT\n\n14h ago 15.54 GMT Ukraine peace deal 'can't be at price of giving up your country,' EU's Kallas warns Asked about any peace talks, Kallas repeats her key points by saying that “Ukrainian people are killed every day, and their infrastructure is bombed every day, and you know the winter is coming, so it’s clear that they are suffering the most [and] they want the suffering to end as fast as possible.” View image in fullscreen European Union foreign policy chief Kaja Kallas addresses the media after an EU general affairs meeting at the European Council building in Brussels. Photograph: Geert Vanden Wijngaert/AP “But at the same time it can’t be with the price of, you know, giving up your country, basically,” she says. “That’s why the work on the reparations loan has to continue, because it makes also Ukraine stronger,” she says. She then stresses once again that “Ukraine is fighting for their homeland, for their people, for their civilians,” and no government can agree to a deal “that … [benefits] the one who is doing the killing.” She says that Russia is putting forwards its peace proposals, because “they are afraid of this reparations loan [as] they are coming to the point where … they are running out of money, and … they want to show outside that they are super strong and everything, but actually, … that’s not the case.” “This gives us the reason to be strong, to keep on the course to support Ukraine, but also pressure Russia,” she says. And that ends the press conference. Share\n\n14h ago 15.40 GMT 'We haven't seen one single concession from Russia,' Kallas says as she insists 'pressure should be on aggressor' Kallas gets asked about what the EU can do to help Zelenskyy face pressure from Russia and the US. She repeats her earlier point that “the pressure should be on the aggressor” (16:24). “We haven’t seen one single concession from Russian side and they are the ones who have started this war, they are the ones who have invaded another country, they are the ones who are doing the killings of the civilians in Ukraine, … and they can also stop this war immediately. … “Our approach is to put the pressure on the aggressor to really stop this and this is the message that we are conveying to our other partners around the world. We also, you know, the discussions regarding reparations loan is also about … helping Ukraine to defend itself and sending a clear signal to Russia that they can’t outlast Ukraine.” Share\n\n14h ago 15.35 GMT Curiously, Kallas says the minister didn’t discuss in detail the financing issue for Ukraine, although “it was raised several times.” She says there is a group of countries supporting the reparations loan, and they “reiterated the urgency to move with that.” She then circles back to other available ways of hitting Russia, including through more sanctions on the shadow fleet. Share\n\n14h ago 15.33 GMT Kallas says that the latest round of sanctions had immediate impact on Russian ability to fund the war, with the revenues from oil coming via the Baltic and the Black seas dropping by 30% to “the all-time lowest” level. But she says “clearly we need to do more.” She also adds that the EU needs to do more to protect its critical infrastructure, including by doing more to tackle online recruitment of people hired by Russia to commit the acts of sabotage. Share\n\n14h ago 15.30 GMT Kallas gets asked about what Europe will do to really get a seat at the table, despite its rhethoric. She says: “Ministers in the room were quite … solid and, and I would say, calm about this, because we have seen this before, because … different peace plans cannot work if the Europeans and Ukrainians do not agree to this. That’s why we focus today’s discussions on what are we doing and what is our course of action.” She then repeats her earlier comments on the EU looking to potentially further target the Russian shadow fleet in the next round of sanctions. Share\n\n14h ago 15.28 GMT Kallas also briefly talks about Gaza, Asian, Sahel and EU enlargement. But I think we can safely assume the questions will be on Ukraine. Share\n\n14h ago 15.27 GMT Russia's actions 'increasingly brazen,' Kallas says in response to Polish rail sabotage incident Turning to the recent attack on Poland’s railway network, Kallas says that “Russia’s hybrid actions in Europe are increasingly brazen,” saying they amount to “state-sponsored terrorism.” “There are many ways we can respond, including additional sanctions and tackling online recruitment of saboteurs,” she says. Share\n\n14h ago 15.26 GMT Kallas continues by saying the EU has a two point plan to “weaken Russia” and “support Ukraine,” pointing to falling Russian tax revenues from oil as evidence that “sanctions are hitting Russia hard.” She says the ministers had “very intensive discussions” on future sanctions, specifically targeting Russia’s shadow fleet vessels, including through pre-boarding agreements with flag states. Share Updated at 15.36 GMT",
  "summary": "<p>Statement from Ukrainian president’s office says country supports all ‘meaningful proposals capable of bringing true peace closer’</p><p>In the last hour, <strong>Ukraine said it had received from Russia the remains of 1,000 people that Moscow said were killed Ukrainian soldiers,</strong> <strong>in the latest repatriation</strong> – a rare area of cooperation between the warring sides, AFP reported.</p><p>“Today, repatriation measures took place. <strong>1000 bodies, claimed by the Russian side to belong to Ukrainian servicemen, were returned to Ukraine</strong>,” Kyiv’s Coordination Headquarters for the Treatment of Prisoners of War said on social media.</p> <a href=\"https://www.theguardian.com/world/live/2025/nov/20/ukraine-russia-peace-plan-european-union-donald-trump-vladimir-putin-kaja-kallas-europe-live-news-updates\">Continue reading...</a>",
  "published": "Thu, 20 Nov 2025 18:44:33 GMT",
  "url": "https://www.theguardian.com/world/live/2025/nov/20/ukraine-russia-peace-plan-european-union-donald-trump-vladimir-putin-kaja-kallas-europe-live-news-updates",
  "source": "World news | The Guardian"
}