{
  "title": "Got a Pixel 10? Google’s Android Phone Can Now Share Files With Apple’s AirDrop",
  "text": "The caveat is that the iPhone user will need to switch AirDrop into the “Everyone for 10 Minutes” mode instead of \"Contacts Only\" mode. Google says this isn't some kind of workaround solution. It's a direct, peer-to-peer connection; your data isn't routed through a server, shared content isn't logged, and no extra data is shared. Naturally, iPhone owners will be able to send data back to Pixel 10 phones as well.\n\nGoogle has not worked with Apple on this cross-compatibility, as the company says it \"welcomes the opportunity\" to work with Apple so that this sharing function can work in the Contacts Only mode. “We accomplished this through our own implementation,” a Google spokesperson tells WIRED. “Our goal is to provide an easy and secure file-sharing experience for our users, regardless of who they are communicating with.”\n\nIn a security blog post, Google says the underlying strategy for what makes this new synergy between Quick Share and AirDrop work is the memory-safe Rust programming language. “These overlapping protections on both platforms work in concert with the secure connection to provide comprehensive safety for your data when you share or receive,” writes Dave Kleidermacher, vice president of Google's platforms security and privacy.\n\nGoogle tapped NetSPI, a third-party and independent penetration testing firm, to validate the security of the new sharing feature. The findings? The interoperability is “notably stronger” than other industry implementations. That's pretty important, considering what happened the last time someone tried to improve cross-compatibility between iOS and Android without Apple: The startup Beeper tried to make texts from Android phones show up as blue bubbles on iPhones and caused all kinds of drama.\n\nThe number of people who can actually use this feature is limited because it's only available on Google's latest Pixel 10 smartphones, which just launched this past August. However, Google says it's looking to expand the feature to more Android devices in the future.\n\nThis new feature in Quick Share is rolling out starting today to the Pixel 10 series, which includes the Google Pixel 10, Pixel 10 Pro, Pixel 10 Pro XL, and Pixel 10 Pro Fold. As it's rolling out, you may not see it immediately on your device. To use it, all you need to do is select something to share, whether it's a file, contact, or photo, choose Quick Share in the sharing menu, and make sure the iPhone owner has their AirDrop set to “Everyone for 10 Minutes Only.\" The iPhone will be able to see the Pixel 10 device and can receive or send data.",
  "summary": "You can now share deets (and other digital treats) across the mobile divide.",
  "published": "Thu, 20 Nov 2025 20:03:29 +0000",
  "url": "https://www.wired.com/story/pixel-10-can-now-share-files-with-apples-airdrop/",
  "source": "WIRED"
}