{
  "title": "Mamdani’s Win Is Inspiring A Wave Of Left-Wing Challengers In NYC",
  "text": "Rep. Adriano Espaillat first endorsed former Gov. Andrew Cuomo in New York City's mayoral race, but switched to back Mayor-elect Zohran Mamdani following the latter's victory in the primary. It's not protecting him from facing a primary challenger invoking Mamdani's win. Anadolu via Getty Images\n\nNew York City is the center of Democratic establishment power. The leaders of both the House and Senate Democrats are from there, oodles of party money are raised there and many of the consultants, public relations flacks and pollsters who work for top candidates live there.\n\nThis cycle, though, it’s also going to be the center of a Democratic insurgency. Following the triumph of progressive Assembly member Zohran Mamdani in New York City’s mayoral race, a slew of incumbent House Democrats representing the city are set to face stiff primary challenges from the left.\n\nAdvertisement\n\nThe latest longtime incumbent to get a challenge is Rep. Adriano Espaillat, the 71-year-old chair of the Congressional Hispanic Caucus. On Wednesday, 31-year-old investigator and activist Darializa Avila Chevalier announced she would challenge Espialliat in the Democratic Primary with the backing of Justice Democrats.\n\nIn an interview, Avila Chevalier said the left had little choice but to do everything it could to capitalize on Mamdani’s victory.\n\n“In organizing, we have a saying that the best way to prove to people that we can win is to win,” she told HuffPost. “Zohran winning is that first step. To not build on that, it would be deeply irresponsible for us to not continue with that momentum.”\n\nAdvertisement\n\nZohran proved New Yorkers are ready to turn the page on machine politics.#NY13 voters made that clear & it's why we're proud to endorse @DarializaforNY for Congress.\n\n\n\nThe Congress we deserve invests in babies not bombs, immigrants over ICE & renters not real estate developers. pic.twitter.com/rHaJb2gNqV — Justice Democrats (@justicedems) November 20, 2025\n\nAvila Chevalier joins a number of other more high-profile Democrats running against incumbents from the left. City Councilman Chi Osse has announced a challenge to Jeffries, and former state legislator and Democratic National Committee official Michael Blake is challenging Rep. Ritchie Torres. City Comptroller Brad Lander is seen as a near-lock to challenge Rep. Dan Goldman.\n\n“Justice Democrats is ready to build on the momentum from Zohran’s victory in New York to defeat NYC’s corporate machine incumbents in Washington,” said Usamah Andrabi, the group’s communications director. “We’re looking at every seat, but this was our first endorsement in New York this cycle because we believe it should be a priority for the national progressive movement as an overlooked opportunity to unseat another corporate incumbent backed by AIPAC and the real estate lobby.”\n\nAdvertisement\n\nWhat remains uncertain is how far Mamdani will go to support the candidates hoping to build on his victory. When asked if she hoped Mamdani would endorse her, Avila Chevalier dodged the question.\n\n“I’m really focused on trying to have a strong launch, but we are working on building a strong coalition, and once we have more news there, I’d be happy to share,” she said.\n\nMamdani has already signaled he’s not going to endorse every challenger who invokes him. On Wednesday night, the New York Daily News reported that Mamdani appeared at a Democratic Socialists of America meeting to argue against an endorsement of Osse, which he said would be a distraction and make it harder for him to implement his agenda.\n\nAdvertisement\n\nEspaillat originally endorsed former New York Gov. Andrew Cuomo in the mayor’s race but switched to back Mamdani in the general. Widely considered the most influential Latino politician in the city, Espaillat is a mainstream Democrat who waged a famous primary challenge of his own against long-time Rep. Charlie Rangel in 2014.\n\nAvila Chevalier’s critique of Espaillat echoes the cases made by other young progressive primary challengers around the country: the incumbent is too old, out of touch with the district, too close to Israel and to well-funded interest groups.\n\n“I think we deserve someone who sees the people of this district and see the struggles that they face every single day, not someone who is taking money from the landlords that are pricing them out of their homes and forcing them onto the street,” she said.\n\nAdvertisement\n\nThe district, which includes northern Manhattan and parts of the Bronx, is one of the most Democratic in the country. It voted for Mamdani over Cuomo by a 34-point margin in the general election. Avila Chevalier argues the district is ready for a progressive agenda, including swearing off corporate PAC money, support for abolishing ICE and cutting off aid to Israel.\n\n“Instead of bombing children in Palestine, we can be spending that money on our own kids right here in Harlem and Washington Heights and Kingsbridge,” she said, “and ensuring that they have the things that they need to have beautiful childhoods here in New York.”\n\nAvila Chevalier has been organizing in the district since she was a teenager, including working to remove a statue of J. Marion Sims, a widely-praised 19th-century physician who operated on enslaved women and girls without their consent, and working to secure the return of Mahmoud Khalil, a Palestinian rights activist whom the Trump administration tried to deport earlier this year.\n\nAdvertisement",
  "summary": "The latest progressive candidate to run is Darializa Avila Chevalier, who is challenging the chair of the Congressional Hispanic Caucus.",
  "published": "Thu, 20 Nov 2025 09:00:17 -0500",
  "url": "https://www.huffpost.com/entry/mamdanis-win-is-inspiring-a-wave-of-left-wing-challengers-in-nyc_n_691e7ba1e4b0d33fcd986732",
  "source": "Politics"
}