{
  "title": "The man who froze his wife and got a new girlfriend: a stranger, sadder tale than I expected | Imogen West-Knights",
  "text": "One of the last remaining fun things about the internet is getting to pass judgment on the goings-on in households that you would never hear about otherwise. On Reddit, for instance, there is a whole thriving sub for just this purpose called Am I the Asshole?, where people describe conflicts from their lives and ask strangers to adjudicate on them.\n\nThis week, a story on the BBC threw up a particularly juicy piece of other people’s business that has been sparking debates on Chinese social media. It starts in 2017, when Gui Junmin decided to cryogenically freeze his wife, Zhan Wenlian, after she died of lung cancer. She was the first Chinese person to undergo this procedure, which was paid for by a science research institute in Jinan, east China, that agreed with Gui to preserve his wife’s body for 30 years. Reports suggest Zhan herself consented to the process before she passed away.\n\nBut what has piqued the interest of nosy people across the world is the revelation that, in 2020, Gui began dating again. He now has a new partner, a woman named Wang Chunxia. People have asked: is this fair, to either woman? It would be quite a trip to be the wife: defrosted from the land of the dead, slowly working out what happened – and then discovering your husband found a new girlfriend in the time you’ve been on ice. The sheer social and ethical complexity of the situation would have me asking the doctors to stick me back in the freezer.\n\nMy first reaction to the broad strokes of this story was: leave the poor guy alone. His wife is dead and he found love again a respectful number of years after her passing. This is no crime. But there are more confusing details. Gui apparently told the Chinese newspaper Southern Weekly that his new partner, Wang, was not the new love of his life. Their relationship was only “utilitarian”, and he was prompted to seek out a new live-in partner after he had a severe attack of gout that left him bedridden for a few days. A frozen wife is all well and good, but she’s not going to be much use on the chicken soup front if he gets unwell again.\n\nskip past newsletter promotion Sign up to Matters of Opinion Free weekly newsletter Guardian columnists and writers on what they’ve been debating, thinking about, reading, and more Enter your email address Sign up Privacy Notice: Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on theguardian.com to send you this newsletter. You can complete full registration at any time. For more information about how we use your data see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nWe don’t, of course, have anything like all the details here. Maybe Wang is delighted with this arrangement. Maybe Gui does love her, but doesn’t want to say so and dishonour his late wife’s memory. Who knows. But I find it a sad story all round, what little we know of it, because at the heart of this headline-grabbing tale is that very human inability to know when to let go. If you read around, you can find quotes from Gui saying he agreed to the procedure because he didn’t fundamentally believe that his wife was truly dead – that she had just gone somewhere to rest for a while. The fact that he has started a new relationship, whatever his motivations for doing so, suggests that the inexorable process of moving on has begun.\n\nAll cryogenics strikes me this melancholy way, and to a lesser extent so do all biohacking efforts to maximise human lifespan. It is, I think, no accident that the world’s major cryogenics labs, Alcor and the Cryonics Institute in the US, were both started by people who wanted to preserve their own loved ones. (There are an estimated 500 people cryogenically frozen worldwide, mostly in the US.) There is also a tragically doomed side to it: after all, there is no proof that it will ever be possible to bring someone who has been frozen back to life. Sure, the human race may one day figure out how to do this. But it seems more likely to me that we won’t. Death is death. However long it takes you to get there, it is the non-negotiable end of the road.\n\nThis stuff is hard. Of course it is. When someone you love is dying, it’s only natural to feel like you’d do anything to keep them around. Doggedly deferring these moments of painful loss or persuading yourself that these moments can be avoided with the aid of experimental science is a fool’s game. May Zhan rest in peace, may Gui find a nicer way to talk about his new girlfriend, and may my own eventual trip to the undiscovered country be a one-way ticket with no layover in an ice box.",
  "summary": "<p>The story has sparked debates about cryogenics and fidelity. But it also tells us something deeper about our responses to loss </p><p>One of the last remaining fun things about the internet is getting to pass judgment on the goings-on in households that you would never hear about otherwise. On Reddit, for instance, there is a whole thriving sub for just this purpose called Am I the Asshole?, where people describe conflicts from their lives and ask strangers to adjudicate on them.</p><p>This week, <a href=\"https://www.bbc.co.uk/news/articles/c78z2m43ykjo\">a story on the BBC</a> threw up a particularly juicy piece of other people’s business<strong> </strong>that has been sparking debates on Chinese social media. It starts in 2017, when<strong> </strong>Gui Junmin decided to cryogenically freeze his wife, Zhan Wenlian, after she died of lung cancer. She was the first Chinese person to undergo this procedure, which was paid for by a science research institute in Jinan, east China, that agreed with Gui to preserve his wife’s body for 30 years. <a href=\"https://www.dailymail.co.uk/news/article-4803240/Man-dead-wife-s-body-frozen-hoping-d-come-back.html\">Reports suggest</a> Zhan herself consented to the process before she passed away.</p><p>Imogen West-Knights is a writer and journalist</p><p><em><strong>Do you have an opinion on the issues raised in this article? If you would like to submit a response of up to 300 words by email to be considered for publication in our<a href=\"https://www.theguardian.com/tone/letters\"> letters</a> section, please <a href=\"mailto:guardian.letters@theguardian.com?body=Please%20include%20your%20name,%20full%20postal%20address%20and%20phone%20number%20with%20your%20letter%20below.%20Letters%20are%20usually%20published%20with%20the%20author%27s%20name%20and%20city/town/village.%20The%20rest%20of%20the%20information%20is%20for%20verification%20only%20and%20to%20contact%20you%20where%20necessary.\">click here</a>.</strong></em></p> <a href=\"https://www.theguardian.com/commentisfree/2025/nov/20/man-who-froze-his-wife-and-got-a-new-girlfriend-cryogenics\">Continue reading...</a>",
  "published": "Thu, 20 Nov 2025 15:55:54 GMT",
  "url": "https://www.theguardian.com/commentisfree/2025/nov/20/man-who-froze-his-wife-and-got-a-new-girlfriend-cryogenics",
  "source": "The Guardian"
}