{
  "title": "A tiny worm just revealed a big secret about living longer",
  "text": "Curiosity about extending human life may be especially visible among certain tech enthusiasts today, but people have been fascinated by the idea of a lasting fountain of youth, or even immortality, for thousands of years.\n\nSome of the approaches most strongly supported by scientific evidence, such as strict dieting for health and longevity, can be difficult to follow consistently.\n\nExploring How Environment Shapes Longevity\n\nNew work from the laboratory of Scott Leiser, Ph.D., in the Molecular and Integrative Physiology Department at the University of Michigan Medical School, highlights notable links between a longevity-associated gene, environmental influences and behavior.\n\nThese findings help researchers move closer to uncovering the biological pathways that might be used to lengthen life while avoiding the uncomfortable aspects of current strategies.\n\nWorm Studies Reveal How Cues Affect Lifespan\n\nThe first study, published in PNAS, uses the model organism C. elegans (a widely studied worm species) to investigate how environmental signals and access to food influence longevity.\n\n\"Believe it or not, most of the central ideas and types of metabolism we study are conserved from worms to people,\" said Leiser.\n\nHe explained that both humans and worms release hormones, including adrenaline or dopamine, in response to what they sense around them. Neurons in worms react to their surroundings in much the same way, triggering physiological changes.\n\nPast research has shown that stress related to limited food availability can increase survival.\n\nEarlier work in flies by Scott Pletcher, Ph.D., Leiser's colleague at U-M, revealed that simply smelling food can counteract this survival benefit.\n\nTouch Interferes With Longevity Pathways\n\nLeiser, project leader Elizabeth Kitto, Ph.D., and contributor Safa Beydoun, Ph.D., questioned whether other sensory experiences, such as touch, might also reduce the life-extending outcomes of dietary restriction and, if so, what mechanisms might be involved.\n\nTo explore this, they placed worms on a layer of beads that mimicked the feel of the E. coli they normally encounter while feeding.\n\nThis gentle tactile cue was enough to suppress the activity of a longevity-related gene in the intestine (fmo-2) and reduced the lifespan extension usually produced by dietary restriction.\n\nLeiser had previously shown in 2015 that fmo-2 is both necessary and sufficient for lifespan extension in response to dietary restriction.\n\n\"The fmo-2 enzyme remodels metabolism, and as a result increases lifespan,\" he explained. \"Without the enzyme, dietary restriction does not lead to a longer lifespan.\"\n\nTheir experiments revealed that touch activates a neural circuit that alters signals from cells releasing dopamine and tyramine. This lowers the induction of intestinal fmo-2 and reduces the longevity benefits of restricted diets.\n\nPotential to Manipulate Longevity Mechanisms\n\nAccording to Leiser, the most significant implication for human health is that these circuits can potentially be adjusted.\n\n\"If we could induce fmo-2 without taking away food, we could activate the stress response and trick your brain into making you long-lived.\"\n\nBefore that is possible, however, researchers need to understand other roles that fmo-2 plays in living organisms.\n\nBehavioral Effects of the fmo-2 Enzyme\n\nIn a separate study published in Science Advances, the team found that the enzyme influences behavior in clear and measurable ways.\n\nWorms engineered to overexpress fmo-2 showed little reaction to positive or negative changes in their surroundings. They did not retreat from potentially dangerous bacteria, and after a short fast, they did not pause to feed the way typical worms would.\n\nWorms that lacked fmo-2 entirely also explored their environment less frequently than normal worms. Both of these behavioral changes stemmed from altered tryptophan metabolism.\n\n\"There are going to be side effects to any intervention to extend life-and we think one of the side effects will be behavioral,\" said Leiser.\n\n\"By understanding this pathway, we could potentially provide supplements to offset some of these negative behavioral effects.\"\n\nFuture Research Directions\n\nLeiser plans to continue investigating how the brain, metabolism, behavior and health interact, with the goal of supporting the development of drugs that target these natural pathways.\n\n\"Investigating all of the individual signals that our brain is responding to from the gut is a hot but not well understood area.\"\n\nAdditional authors: Ella Henry, Megan L. Schaller, Mira Bhandari, Sarah A. Easow, Angela M. Tuckowski, Marshall B. Howington, Ajay Bhat, Aditya Sridhar, Eugene Chung, Charles R. Evans",
  "summary": "Scientists studying aging found that sensory inputs like touch and smell can cancel out the lifespan-boosting effects of dietary restriction by suppressing the key longevity gene fmo-2. When overactivated, the gene makes worms oddly indifferent to danger and food, suggesting trade-offs between lifespan and behavior. The work highlights how deeply intertwined the brain, metabolism, and environment are. These pathways may eventually be targeted to extend life without extreme dieting.",
  "published": "Thu, 13 Nov 2025 07:16:13 EST",
  "url": "https://www.sciencedaily.com/releases/2025/11/251113071613.htm",
  "source": "All Top News -- ScienceDaily"
}