{
  "title": "Trump’s National Guard Blunder",
  "text": "I’m announcing a historic action to “Trump must go now.” Rescue our nation’s capital from crime, bloodshed, bedlam and squalor and worse. “D.C.’s shadow senator raising concerns about what this could mean for taxpayers.” We’re going to take our capital back. We’re taking it back. “The presence of the National Guard continues in the District.” “The question here is, what are they doing, necessarily.” “They just stand around and chitchat with each other.” “Troops are instructed to quote, prepare for a long-term, persistent presence.” “They seem bored to me.” We’re going to make it safe. The crime numbers are way down. “D.C. leaders contend there is no crisis pointing to crime rates now at a 30-year low.” “Troops are mostly absent from neighborhoods with the highest rates of crime, in Southeast and Northeast D.C.” “We haven’t seen any of that over here in Southeast D.C.” “This is not the answer, bringing the National Guard.” “They’re still patrolling areas like Metro stations and the National Mall.” “These are National Guardsmen who are standing around tourist sites.” “What I’ve seen them doing is standing around underneath the Washington Monument for photo ops.” “It seems like it’s more of a spectacle for those that are visiting.” “They’re here essentially for show. There is some kind of morbid humor around it all.” We’ve had some incredible results. It’s like a different place. “D.C. National Guardspeople are cleaning up the parks.” “Picking up trash and pulling weeds.” “Collected more than 500 bags of trash and gotten rid of three truckloads of plant waste. And I don’t think there’s anything wrong with that.” The results have come out — “And morale is falling fast.” “Most of them that I’ve talked to don’t really want to be here either.” We’re going to stay here for a while. We want to make this absolutely perfect. “Troops have been ordered to stay at least through next summer.” “Could stay in D.C. indefinitely.” “All right. What are we actually doing? What are we paying for as taxpayers?” “It costs a little bit more than one million dollars a day to have these National Guardsmen here.” “We do have some breaking news that we want to get to and it comes to us from our nation’s capital. The U.S. federal judge ruled that the deployment of the National Guard in Washington, D.C., is illegal.”",
  "summary": "A brief history of the National Guard in Washington.",
  "published": "Fri, 21 Nov 2025 01:39:27 +0000",
  "url": "https://www.nytimes.com/video/opinion/100000010537060/trumps-national-guard-blunder.html",
  "source": "NYT > Top Stories"
}