{
  "title": "In Bihar, seats with most deletions, additions of voters see NDA dominate",
  "text": "With the Bihar Assembly elections concluded, data published by the Election Commission (EC) on Wednesday shows that the NDA was the dominant force not only in the seats that recorded the most deletions as part of the Special Intensive Revision (SIR) of electoral rolls, but also those that saw the highest additions of new voters.\n\nIn four of the five Assembly constituencies that saw the most voter deletions over the course of the SIR, the NDA parties emerged as the winners. In Gopalganj, for instance, which saw the most deletions in the state at 56,793, the BJP won the seat for the fifth consecutive election.\n\nAmong the five seats with the most deletions, the BJP also won in Purnia (50,767 deletions) and Motihari (49,747), while the JD(U) won in Kuchaikote (43,226). The Opposition Mahagathbandhan’s Congress, however, won Kishanganj (42,940 deletions). Kishanganj and Purnia were the only two seats to see more than 50,000 deletions.\n\nOn the other hand, of the five seats that saw the fewest deletions – Darbhanga (2,859 deletions), Chanpatia (6,031), Bettiah (6,076), Dehri (6,219) and Mahua (6,302) – the BJP and Chirag Paswan-led Lok Janshakti Party (Ram Vilas) won two each and the Congress won one. While Darbhanga saw the lowest deletions across the state, no other constituency dropped below 5,000 deletions. Notably, in Mahua, it was RJD rebel and Lalu Prasad’s estranged elder son Tej Pratap Yadav who lost on a ticket of his newly founded Janshakti Janta Party.\n\nThe EC’s data on the seats with the highest additions of voters in the final electoral rolls shows that the Nautan constituency, which saw the most additions at 5,434 and is the only seat to add more than 5,000 new voters, was won by the BJP. Among the five seats that saw the most additions, the BJP won two, and the JD(U), LJP(RV) and Congress one each. The other seats with the highest additions are Thakurganj (4,728), Chenari (4,689), Araria (4,444), and Tarari (3,787).\n\nBut among the five seats that saw the fewest additions of new voters, the NDA won all five – three by the JD(U), and one each by the BJP and LJP(RV). All five of these seats saw fewer than 500 added voters, with the lowest additions recorded in Chhatapur at 179. The next fewest additions were recorded in Nirmali (316), Pipra (336), Bihariganj (438), and Simri Bakhtiarpur (470).\n\nThe EC also published data on the highest and lowest voter turnouts. In the five seats that recorded the state’s highest overall voter turnout—Kasba (81.97%), Barari (81.73%), Thakurganj (81.57%), Pranpur (81.17%), and Kishanganj (80.81%)—JD(U) won two seats, followed by the BJP, LJP(RV) and Congress at one each.\n\nStory continues below this ad\n\nBut in five seats with the state’s lowest voter turnouts—Kumhrar (40.22%), Bankipur (41.39%), Digha (42.84%), Biharsharif (55.22%) and Nawada (55.27%)—NDA won all five, with four going to BJP and one to JD(U). A breakdown of the female turnout shows that in five seats where women voted at the highest rates—Thakurganj (90.27%), Kochadhaman (89.22%), Pranpur (88.99%), Baisi (88.89%) and Amour (88.09%)—Asaduddin Owaisi-led AIMIM won three seats, while BJP and JD(U) won one seat each.\n\nIn all five of the seats that saw the lowest women’s turnout, the BJP emerged as the winner. These five seats are Kumhrar (39.13%), Bankipur (39.86%), Digha (41.46%), Biharsharif (54.83%) and Bhagalpur (55.42%).\n\nMeanwhile, of the five seats with the highest male turnout, the BJP won two, and the JD(U), LJP(RV) and Congress won one each. The NDA swept the five seats with the lowest male turnout – the BJP won three, while the JD(U) and LJP(RV) won one each.",
  "summary": "",
  "published": "Thu, 20 Nov 2025 02:30:06 +0000",
  "url": "https://indianexpress.com/article/india/in-bihar-seats-with-most-deletions-additions-of-voters-see-nda-dominate-10375251/",
  "source": "India | The Indian Express"
}