{
  "title": "Burrow looks 'outstanding,' trends toward return",
  "text": "Kirk Herbstreit joins Pat McAfee and weighs in on the mindset of a player such as Joe Burrow when it comes to returning from injury. (1:10)\n\nHerbstreit to McAfee: If Joe Burrow is healthy, he is going to play (1:10)\n\nOpen Extended Reactions\n\nCINCINNATI -- For the second straight day, Joe Burrow had a full practice.\n\nThe Cincinnati Bengals star quarterback took 100% of the team's reps Thursday, according to its injury report. During the portion of practice open to the media, he took snaps with starting center Ted Karras as all the quarterbacks and centers worked on the ball exchange. Burrow was the first quarterback to throw during position drills even with Joe Flacco practicing after taking Wednesday off because of a shoulder injury.\n\nNobody has yet declared whether Burrow, who is still on injured reserve, will return to the active roster and start Sunday's game against the New England Patriots.\n\nBut wide receiver Tee Higgins shared a glance that Burrow gave him, a side-eyed stare with a slight smirk.\n\n\"I don't know if that was a good or bad, but I assumed good,\" Higgins said.\n\nThe veteran wide receiver added that Burrow has looked as good as he did at the start of the season.\n\n\"Joe's been looking outstanding, man,\" Higgins said. \"He's slinging it deep, short routes. Everything's been pretty good.\"\n\nBurrow has not played since suffering a turf toe injury in his left foot during Week 2. Initially, he had eyed a Thanksgiving return for his first game back since successful surgery.\n\nBut this week's events indicate Burrow could be back even sooner.\n\nOn Wednesday, Burrow was a full participant at practice for the first time since the team opened his 21-day window to return Nov. 10. Flacco, who was acquired via trade earlier this season, has taken the past three Wednesdays off while he nurses a sprained AC joint in his throwing shoulder.\n\nThursday, the team's most extensive practice of each game week, has typically been when Flacco has his largest practice workload. But Burrow received the more favorable quarterback treatment ahead of a lighter practice scheduled for Friday. Burrow, a two-time Pro Bowler, will not be made available to speak to the media this week.\n\nIn an interview with radio station WLW earlier in the day, Bengals coach Zac Taylor cracked the door open for a potential return this week.\n\n\"I'm not there yet,\" Taylor said. \"One day at practice isn't going to lead to that decision yet. We'll use the time we have at our disposal and come with the best decision we can.\"\n\nTaylor will speak to reporters Friday afternoon following the last practice of the week. The Bengals (3-7) are looking to avoid their fourth straight loss and halt an eight-game losing streak to New England (9-2).\n\nIf Burrow plays, this will mark the second straight year he returns from an injury to face New England at home. Cincinnati lost to the Patriots in the 2024 season opener, Burrow's first game back from a season-ending wrist injury he suffered in 2023. Over the years, Burrow's teammates have stressed patience to make sure the franchise quarterback is as healthy as possible when he steps onto the field.\n\nAfter the past two days, it appears Burrow is at that mark.\n\n\"He needs to take as much time as he needs, but I mean, he looks good,\" Higgins said. \"If he's ready, then I'm ready. Take as much time as you need to get back to 100 percent, which I think he is [at] now.\"",
  "summary": "For the second straight day, Bengals quarterback Joe Burrow had a full practice, pointing toward a possible return Sunday against the Patriots.",
  "published": "Thu, 20 Nov 2025 23:07:46 EST",
  "url": "https://www.espn.com/nfl/story/_/id/47040163/bengals-burrow-full-participant-practice-2nd-day-row",
  "source": "www.espn.com - TOP"
}