{
  "title": "‘Youth once keen to become doctors, engineers now ready to turn suicide bombers’: Mehbooba asks Centre to reflect",
  "text": "Former Jammu and Kashmir chief minister and Peoples Democratic Party leader Mehbooba Mufti on Sunday called on the youth not to go down a path that would be dangerous not only for themselves, but for their families, for J&K and the entire country. She also asked the central government to reflect on what mistakes were made that the “youth who used to pick up stones and guns have become suicide bombers now”.\n\nReferring to the car bomb explosion near the Red Fort in Delhi on November 10, which is suspected to be linked to a terror module involving doctors from Kashmir, Mufti said, “When a doctor says that he wants to die, it is a serious matter for all of us.”\n\n“I have a request for the youth. You have to live your life. You have to live for Kashmir. Learn to live, don’t die. We don’t want your corpses, we want you,” Mufti said, while addressing party leaders.\n\nShe added, “I want to say again to the youth who do this: What you do is wrong in every way. It is dangerous not only for you, but it is also dangerous for your family, for Jammu and Kashmir, and for the whole country. You are taking such a big risk because you are ruining your loved ones’ lives. Moreover, the lives of many innocent people are at stake. This has been hurting me a lot for the last few days.”\n\nMufti cautioned the Centre, saying it needs to try to understand what made suicide bombers out of doctors. “When a doctor says he wants to die, this is a very serious matter for all of us… The youth who used to pick up stones and guns, now they have become suicide bombers. How did our youth come to this?” she asked.\n\n“That the youth, who were ready to become doctors and engineers, are now ready to explode themselves, is something that needs to be thought about… So, this will have to be considered by the people of the country, by the leadership. Where did we make a mistake? The central government has to think. You promised the youth here that you would take stones and guns from their hands and give them a laptop. But today, you have made that youth a suicide bomber. You had promised you would make Jammu and Kashmir safe, but you have made Delhi unsafe by your policies,” she said.\n\nReferring to the Centre’s decision to abrogate J&K’s special status in 2019, Mufti said, “You made such a big blunder in 2019, you snatched everything from the people of J&K.” She said the youth of J&K were being suffocated. “Don’t suffocate him (the youth of the J&K). When you shut down something, like a pressure cooker, it will come out from somewhere,” she said.\n\nStory continues below this ad\n\nReacting to the incident in Kulgam, where a 55-year-old man, a neighbour of one of the doctors allegedly part of the terror module, set himself on fire, Mufti said, “His son and brother were arrested and taken away. We don’t know whether he is involved or not, we will not decide. That will be decided by the investigation agencies.”\n\n“The people who saw it (the self-immolation), what will be its impact — that a father becomes helpless and puts petrol on himself and sets himself on fire,” she said.\n\nMufti claimed that the environment in the country has been made “poisonous” and that people are being divided along religious lines.\n\n“I don’t know if the people in Delhi understand this, or do they think that the more Hindu-Muslims (divide) there is, the more bloodshed there will be, the more polarisation there will be in the country, the more voters they will get? I think they should think again. The country is much bigger than a chair,” she said.\n\nStory continues below this ad\n\nShe said that “somewhere, that poisonous environment is also responsible for the youth of Kashmir taking a dangerous path”.",
  "summary": "",
  "published": "Mon, 17 Nov 2025 01:42:17 +0000",
  "url": "https://indianexpress.com/article/india/mehbooba-mufti-to-centre-reflect-on-why-youth-who-used-to-pick-up-stones-guns-have-now-become-suicide-bombers-10369625/",
  "source": "India | The Indian Express"
}