{
  "title": "AI vs superbugs: UK invests millions to tackle drug-resistant infections",
  "text": "Major UK project launched to tackle drug-resistant superbugs with AI\n\n3 days ago Share Save James Gallagher Health and science correspondent Share Save\n\nImperial Dr Andrew Edwards researching antibiotics in the laboratory\n\nThe UK is to use artificial intelligence (AI) to tackle the rising numbers of infections that have become resistant to treatment. The project - a collaboration between the Fleming Initiative and the pharmaceutical company GSK - is a battle between superbugs and supercomputers. It aims to speed up the discovery of fresh antibiotics and deliver new ways of killing other threats, including deadly fungal infections. Overusing antibiotics drives bacteria to evolve resistance to infections, which means new drugs are a priority.\n\nDrug-resistant infections are a growing problem – one known as \"the silent pandemic\". Superbugs are now thought to directly kill around one million people a year worldwide and contribute to the deaths of millions more. Those figures are predicted to continue to grow. The collaboration will spend £45m on six fields of research. \"This represents the single biggest investment in a UK antibiotic project I'm aware of,\" says Dr Andrew Edwards from Imperial College London. He will be targeting AI at a tricky group of infections, called Gram-negative bacteria, that includes well known bugs such as E. coli and Klebsiella pneumoniae. These species have an extra outer layer they use to control what gets in and out of a bacterium. Gram-negative species can block antibiotics from getting in and rapidly pump out those that penetrate the bacterial defences – making them tough to treat.\n\nImperial\n\nThe team will be performing experiments using molecules with different chemical structures and recording what can get inside and stay inside these bacteria. This data will then be fed into the AI so it can learn what it takes for an antibiotic to persist inside a Gram-negative bacterium. \"The sort of AI that people are using routinely today is built on the sum total of information on the internet - it doesn't just produce answers out of thin air,\" Dr Edwards told the BBC. \"If you want to make progress, you have to have data,\" he says. The aim is to convert years of research, if done by hand, into a simple job for a computer. Then once the chemical code has been cracked, it will guide scientists on how to modify potential antibiotics to bypass the organism's defences. Dr Edwards said there were cases coming out of the conflict in Ukraine now where infections could not be treated with any antibiotic. \"That means that limbs have to be amputated. I would say it's a glimpse into the future, but it's happening right now, it's a pretty horrific thought.\" So can AI outpace bacterial evolution? \"That's a very good question, I think what we've seen is that if we can get a few good antibiotics, then we'll be back on on the front foot and then I think we can keep things in check,\" says Dr Edwards.\n\nImperial",
  "summary": "The UK turns to artificial intelligence (AI) to reverse the rising numbers of infections that shrug off antibiotics.",
  "published": "Tue, 18 Nov 2025 06:10:18 GMT",
  "url": "https://www.bbc.com/news/articles/cp97ggrnn35o?at_medium=RSS&at_campaign=rss",
  "source": "BBC News"
}