{
  "title": "Rocket Lab Electron among first artifacts installed in CA Science Center space gallery",
  "text": "It took the California Science Center more than three years to erect its new Samuel Oschin Air and Space Center, including stacking NASA’s space shuttle Endeavour for its launch pad-like display.\n\nNow the big work begins.\n\n“That’s completing the artifact installation and then installing the exhibits,” said Jeffrey Rudolph, president and CEO of the California Science Center in Los Angeles, in an interview. “Most of the exhibits are in fabrication in shops around the country and audio-visual production is underway. We’re full-on focused on exhibits now.”\n\nOn Tuesday, the science center is marking the addition of the first artifacts to the Kent Kresa Space Gallery. Named for the former chairman and CEO of Northrop Grumman and former chairman of General Motors, the completed gallery will complement the Samuel Oschin Shuttle Gallery (featuring Endeavour) with three areas devoted to the themes of “Rocket Science,” “Robots in Space,” and “Humans in Space.”\n\nNow in place are a space shuttle main engine (SSME), a walk-through segment of a shuttle solid rocket booster, and a Rocket Lab Electron rocket.\n\nErecting Electron\n\n“The biggest thing we have put in—other than the space shuttle—was the Electron, which we think is really significant,” said Rudolph. “We’re really happy to show next-generation technologies from startup companies with new launch vehicles, particularly if the company is based in California. Our goal is to inspire and motivate the next generation, and we think that showing folks that there are still a lot of innovative things going on, happening in their backyard, is a really great opportunity to inspire kids and people of all ages.”\n\nCredit: California Science Center\n\nFounded in New Zealand in 2006 and now based in Long Beach, Rocket Lab developed the Electron as the first carbon-composite launch vehicle intended to service the small satellite market. It was also the first orbital-class rocket to use electric pump-fed engines. Having now flown 75 successful missions (including five suborbital flights), the Electron is the third most-launched small-lift rocket in history.\n\nOf course, “small” can be relative. At 59 feet tall (18 meters), one floor of the Kresa gallery was not enough.\n\n“The Electron rocket is actually at the center of a staircase, a section which is open all the way from level two, where you enter, to the lower level, which is 25 feet (7.6 meters) below. The Electron is standing up in that opening and it pretty much fills the whole thing,” said Rudolph.",
  "summary": "Filling space in the Samuel Oschin Air and Space Center's Kent Kresa Space Gallery.",
  "published": "Wed, 19 Nov 2025 21:14:42 +0000",
  "url": "https://arstechnica.com/space/2025/11/rocket-lab-electron-among-first-artifacts-installed-in-ca-science-center-space-gallery/",
  "source": "Ars Technica - All content"
}