{
  "title": "Express Exclusive: CBFC exemption pending, Peter Brook’s restored ‘The Mahabharata’ out of IFFI Goa",
  "text": "“It’s as if someone invited me for dinner and made other plans,” says Simon Brook.\n\nDays from now, Brook was to present a digitally restored version of his father Peter Brook’s acclaimed film The Mahabharata at the International Film Festival of India (IFFI) in Goa. However, the screening of the film, which was cited by the NDA government while rewarding Peter Brook with a Padma Shri in 2021, now stands cancelled owing to some issues pertaining to “CBFC exemption”, Brook tells The Indian Express over the phone from Paris.\n\nA CBFC exemption is an exemption from standard certification granted to films for screening in India by the Central Board of Film Certification (CBFC), which functions under the Information and Broadcasting Ministry.\n\nSources said it is usually a quick formality.\n\nAfter weeks of back and forth on the issue, which left him “feeling confused about the way forward”, Brook says he was finally informed over the weekend that since the film had not got CBFC exemption yet, and IFFI was to begin in days, the screening would not be happening this time.\n\nSources say the film was screened for an internal review committee twice before it was selected for the Restored Classics Section of IFFI. On October 30, IFFI posted on its X handle about showing the film on November 24, saying: “Discover how the 8K restoration of Peter Brook’s The Mahabharata (1989) redefines cinematic preservation and connects ancient epics to the modern world.”\n\nEmails sent to the offices of CBFC Chairman Prasoon Joshi and CBFC CEO Rajendra Singh regarding CBFC exemption, as well as to the Indian High Commissioner in London, did not get a response.\n\nBrook, who is also a filmmaker, says that it was in July this year, after the classic — digitally restored in 8K — was showcased and had its premiere at the Indian Film Festival in London, that he was contacted about a possible screening at IFFI. The film festival is the annual flagship event of the I&B Ministry.\n\nStory continues below this ad\n\nIn August, Brook got an official invite over email from the festival organisers, saying they wanted to screen The Mahabharata as the opening film in the Restored Classics section. It coincided with the birth centenary of Peter Brook, who passed away in 2022, and would have been a tribute to him.\n\nBrook says he was also invited to hold a masterclass during IFFI on the process of restoration, and for other appearances at the nine-day festival.\n\nBrook says he was more than happy to bring the film to Goa, with The Mahabharata last screened in India around two decades ago.\n\nAn international production released in 1989 and involving actors from 16 nationalities — including artist Mallika Sarabhai as Draupadi, and actors Georges Corraface, Vittorio Mezzogiorno and Bruce Myers in key roles — The Mahabharata had got rave reviews in India and abroad, for depicting the universal themes of the Indian epic.\n\nStory continues below this ad\n\nThe Mahabharata first began as a play, co-written and directed by Peter Brook, and staged between 1985 and 1989 as a nine-hour production. In 1989, a nearly six-hour abridged adaptation was made as a television miniseries, and later edited into a nearly three-hour cut for theatrical release.\n\nSimon Brook says he first realised there was a problem when, almost a month ago, he got an email from the organisers saying the film had not got a CBFC exemption yet, and things could not be taken ahead till it came.\n\nBrook says he wrote to IFFI organisers asking if he could do something to expedite the process, and also approached the Indian High Commission in London. High Commissioner Vijay Doraiswamy had attended the London premiere of the restored The Mahabharata in July.\n\nBrook has spoken about spending the past few years retrieving reels of the film from many places, and cutting no corners in its restoration, making The Mahabharata among the few European films to be restored in 8K.\n\nStory continues below this ad\n\nBrook says he has felt connected to The Mahabharata since his teenage years, when he accompanied his father on early research trips to India as a photographer. He has not lost hope about coming one day to India with it, he says. “Maybe next year, maybe to some other film festival.”",
  "summary": "",
  "published": "Tue, 18 Nov 2025 22:30:33 +0000",
  "url": "https://indianexpress.com/article/india/cbfc-exemption-pending-peter-brooks-restored-the-mahabharata-out-of-iffi-goa-10373322/",
  "source": "India | The Indian Express"
}