{
  "title": "Nowgam police station blast: What we know so far",
  "text": "What began as a routine case procedure of a terror investigation turned into a night of devastation in Srinagar on Friday. Shortly before midnight on November 14, explosives stored inside the Nowgam police station accidentally detonated during a forensic procedure, killing nine people, many of them police officials and staff and injuring several others. The cache, seized from a Jaish-e-Mohammad module, had grown increasingly unstable over time, with tragic consequences. Here is what we know so far about the Nowgam blast so far 1. Evidence from a terror case becomes the source of a deadly accident\n\nThe Nowgam police station on Srinagar’s outskirts had been holding a large cache of case property — more than 350 kg of ammonium nitrate and several hundred kilograms of chemicals, detonators, batteries and timers. All of it had been seized from a Jaish-e-Mohammad module linked to the Red Fort blast case and was transported from Faridabad after police raids across Haryana and Delhi.\n\nOn the night of 14 November, the material exploded inside the station, killing nine people and injuring several others. Officers on duty described a sudden, deafening blast that tore through the structure and sent shockwaves across the area.\n\n2. ‘SOPs were followed, but the material was unstable’\n\nPolice officers said the explosives had been packed in airtight containers and moved in small trucks, following standard procedure. A senior officer explained that all seized material, including weapons and explosives, has to be taken into the custody of the investigating police station for forensic examination and court proceedings.\n\nEach station has a malkhana, the storeroom for case exhibits. If something is too dangerous to keep there, it can be shifted to the court malkhana, officials said. In this instance, the material remained in the police station.\n\n3. Blast occurred during forensic sampling procedure\n\nThe Centre later said the blast occurred during a forensic sampling procedure.\n\nStory continues below this ad\n\nJ&K DGP Nalin Prabhat described it as an accidental explosion triggered by a large quantity of explosives that had become “unstable” over time.\n\n4. Faces behind the numbers\n\nOn 15 November, details of the victims emerged, including police personnel and staff associated with the J&K Police.\n\nThose killed include Inspector Peerzada Asrar-ul-Haq, SI with the Special Investigation Agency of the J&K Police; Muzaffar Ahmad Khan, Naib Tehsildar; Javid Mansoor Rather; Arshad Ahmad Shah, photographer with the Crime Branch; and Suhail Ahmad Rather, chowkidar of the Revenue Department.\n\n5. Government announces compensation\n\nThe J&K government has announced Rs 10 lakh ex gratia for the families of each of the deceased, to be released from the Chief Minister’s Relief Fund. Those severely injured will receive ₹1 lakh.\n\nStory continues below this ad\n\nChief Minister Omar Abdullah, in a post on X, said the administration would extend all required support to the affected families.",
  "summary": "",
  "published": "Sun, 16 Nov 2025 06:40:21 +0000",
  "url": "https://indianexpress.com/article/india/nowgam-police-station-blast-we-know-so-far-10368739/",
  "source": "India | The Indian Express"
}