{
  "title": "Massive hidden structures deep inside Earth may explain how life began",
  "text": "For many years, researchers have puzzled over two enormous and unusual features hidden deep inside Earth. Their size, shape and behavior are so extreme that traditional ideas about how the planet formed and evolved have struggled to explain them.\n\nA recent study in Nature Geoscience, led by Rutgers geodynamicist Yoshinori Miyazaki with a team of collaborators, presents a new interpretation that may finally clarify the origins of these structures and how they relate to Earth's long-term habitability.\n\nThese features, called large low-shear-velocity provinces and ultra-low-velocity zones, rest at the boundary between the mantle and the core nearly 1,800 miles below the surface. Large low-shear-velocity provinces are enormous masses of extremely hot, dense rock, with one positioned beneath Africa and the other under the Pacific Ocean. Ultra-low-velocity zones resemble thin, partly molten layers that cling to the core in puddle-like patches. Both strongly slow seismic waves, suggesting they contain materials or conditions unlike the surrounding mantle.\n\n\"These are not random oddities,\" said Miyazaki, an assistant professor in the Department of Earth and Planetary Sciences in the Rutgers School of Arts and Sciences. \"They are fingerprints of Earth's earliest history. If we can understand why they exist, we can understand how our planet formed and why it became habitable.\"\n\nClues From Earth's Magma Ocean Past\n\nAccording to Miyazaki, Earth was once encased in a global ocean of molten rock. As this ancient magma ocean cooled, many scientists expected the mantle to have developed distinct chemical layers, similar to how frozen juice separates into sugary concentrate and watery ice. However, seismic observations reveal no such clear layering. Instead, large low-shear-velocity provinces and ultra-low velocity zones appear to form complex, uneven piles at the bottom of the mantle.\n\n\"That contradiction was the starting point,\" Miyazaki said. \"If we start from the magma ocean and do the calculations, we don't get what we see in Earth's mantle today. Something was missing.\"\n\nLeaking Core Materials and a Long-Lost Magma Layer\n\nThe research team suggested that the missing factor is the core itself. Their model indicates that over billions of years, elements such as silicon and magnesium gradually escaped from the core into the mantle. This mixing would have disrupted the formation of strong chemical layers. It may also account for the unusual composition of the large low-shear-velocity provinces and ultra-low-velocity zones, which the scientists interpret as the cooled remains of a \"basal magma ocean\" altered by core-derived material.\n\n\"What we proposed was that it might be coming from material leaking out from the core,\" Miyazaki said. \"If you add the core component, it could explain what we see right now.\"\n\nHow Deep-Earth Processes Shape Planetary Habitability\n\nMiyazaki noted that the implications stretch beyond mineral chemistry. Interactions between the mantle and core may have influenced how Earth released heat, how volcanic activity developed and even how the atmosphere changed over time. This perspective may help clarify why Earth ended up with oceans and life, while Venus became extremely hot and Mars turned cold and barren.\n\n\"Earth has water, life and a relatively stable atmosphere,\" Miyazaki said. \"Venus' atmosphere is 100 times thicker than Earth's and is mostly carbon dioxide, and Mars has a very thin atmosphere. We don't fully understand why that is. But what happens inside a planet, that is, how it cools, how its layers evolve, could be a big part of the answer.\"\n\nA New Framework for Understanding Earth's Interior\n\nBy bringing together seismic observations, mineral physics and geodynamic simulations, the team reframed large low-shear-velocity provinces and ultra-low-velocity zones as essential records of how Earth formed. The study also suggests that these deep features may help fuel volcanic hotspots such as Hawaii and Iceland, creating a direct link between Earth's interior and the surface.\n\n\"This work is a great example of how combining planetary science, geodynamics and mineral physics can help us solve some of Earth's oldest mysteries,\" said Jie Deng of Princeton University, a co-author of the study. \"The idea that the deep mantle could still carry the chemical memory of early core-mantle interactions opens up new ways to understand Earth's unique evolution.\"\n\nThe researchers noted that each new insight brings them closer to reconstructing the planet's earliest chapters. Bits of evidence that once seemed isolated now appear to fit together in a more coherent story.\n\n\"Even with very few clues, we're starting to build a story that makes sense,\" Miyazaki said. \"This study gives us a little more certainty about how Earth evolved, and why it's so special.\"",
  "summary": "Scientists may finally be closing in on the origins of two colossal, mysterious structures buried nearly 1,800 miles inside Earth—hidden formations that have puzzled researchers for decades. New modeling suggests that slow leakage of elements from Earth’s core into the mantle prevented the planet from developing strong chemical layers after its primordial magma-ocean era.",
  "published": "Thu, 20 Nov 2025 11:32:45 EST",
  "url": "https://www.sciencedaily.com/releases/2025/11/251120002558.htm",
  "source": "All Top News -- ScienceDaily"
}