{
  "title": "Vasco Translator Q1 Review: Cloning Your Voice",
  "text": "The device has no moving parts, with just a 3.5-inch touchscreen that covers its face and a few buttons on each side. These include power and volume buttons, and the now standard pair of “talk” buttons—one to recognize your partner’s voice and one for your own. In many modes, you won’t need to use these, however. Like most handheld translators, the unit includes a preloaded SIM 4G card that gives it near-global usability. (Vasco says it works “in nearly 200 countries,” which is a lot, since there are only 195 widely recognized nations today.) 2.4-GHz and 5-GHz Wi-Fi are also available when you’re in range of a hot spot or at a hotel.\n\nThe 2,500-mAh battery charges via USB-C. Vasco claims that the Q1 offers “many hours of intensive use” and up to 160 hours on standby—though the battery will drain faster than you might expect even when it’s idling. “Many hours” in my testing was less than eight, but the 160-hour standby metric was roughly accurate.\n\nLanguage support is robust, but details vary based on how you use the device. For voice-to-voice translation, it supports 86 languages. For text-based translation, that goes up to 108. Oddly, photo-based translations work with 113 languages. Lastly, real-time call translation has support for just 53 languages. I’ll get to each of these in a bit.\n\nAfter a quick setup, the Q1 drops you into a straightforward interface that lines up its six functions, one over the other. In addition to the four modes mentioned above, the system offers a group chat feature that can support up to 100 participants in their own languages, and a basic learning mode that simply quizzes you on vocabulary, Duolingo style.\n\nChatty Cathy\n\nPhotograph: Chris Null\n\nMost users will likely spend the bulk of their time in conversation mode, which lets you carry on a one-on-one voice discussion with a real-life partner, each in the language of your choice. As is common for handheld translators, holding down one of two buttons—either the pair on the side mentioned earlier or another pair that appears on the touchscreen—lets you tell the Q1 who is talking.",
  "summary": "This new real-time interpreter can change your language while cloning your voice—sort of.",
  "published": "Wed, 19 Nov 2025 14:30:00 +0000",
  "url": "https://www.wired.com/review/vasco-translator-q1/",
  "source": "WIRED"
}