{
  "title": "Dems may have an advantage in the 2026 midterms. And, Trump defends Saudi crown prince",
  "text": "Dems may have an advantage in the 2026 midterms. And, Trump defends Saudi crown prince\n\nGood morning. You're reading the Up First newsletter. Subscribe here to get it delivered to your inbox, and listen to the Up First podcast for all the news you need to start your day.\n\nToday's stop stories\n\nPresident Trump yesterday defended Saudi Crown Prince Mohammed bin Salman when a reporter questioned him during a meeting with the two leaders in the Oval Office about the 2018 killing of Washington Post journalist Jamal Khashoggi. The CIA concluded that the crown prince approved the operation that led to Khashoggi's killing and dismemberment.\n\ntoggle caption Chip Somodevilla/Getty Images\n\n🎧 The crown prince also responded to the question about Khashoggi, acting regretful about the killing. His reaction was notably different in tone than Trump's, NPR's Danielle Kurtzleben tells Up First. The meeting between the two leaders resulted in a number of deals, including the U.S. agreeing to sell the Saudis tanks and F-35 fighter jets. The White House also announced that Saudi Arabia is pledging to invest $1 trillion in the U.S. The text for many additional agreements that the two countries say they have signed has not yet been released.\n\nBoth the House and the Senate have moved to compel the Justice Department to publicly release files related to convicted sex offender Jeffrey Epstein. The measure will now head to Trump's desk after a unanimous Senate vote yesterday. The president promised to sign the legislation, but told reporters that the intense focus on the files is a Democratic hoax.\n\n\n\nSponsor Message\n\n🎧 The information that comes out in the files could fuel new conflict in the debate surrounding the Epstein case, says NPR's Sam Gringlas. The legislation applies to unclassified documents, communications, or investigative materials held by the Justice Department, the FBI, and U.S. attorneys' offices involved in the cases. The president has pledged to put his focus on the Democrats whose names might appear in the files, which must be made public within 30 days of his signing the bill. Additionally, what the Justice Department decides to redact from the files could spark further questions from the public.\n\nA new NPR/PBS News/Marist poll finds that Trump's approval rating has hit a new low, 10 months into his second term. He and the Republican Party are getting most of the blame when it comes to the government shutdown, and people are overwhelmingly saying he needs to focus on lowering prices. There are signs that Democrats could reap the benefits of these critiques heading into the 2026 midterm elections. Here's a look at the poll results by the numbers.\n\n\n\n🎧 NPR's Domenico Montanaro highlights an interesting finding: When respondents were asked who they would vote for if the midterm elections happened today, Democrats had a 14-point advantage. The last time the gap was that wide was eight years ago during Trump's first term in office. A year after that, Democrats won 40 seats. The poll also revealed that people are generally dissatisfied with everything; respondents expressed little to no confidence in Congress, the media, political parties, the Supreme Court or the presidency.\n\nSponsor Message\n\nDeep dive\n\nNewsday LLC/Getty Images\n\nTrump floated the idea of a 50-year fixed mortgage, a concept that many observers, including some Trump supporters, hate. Critics complained that a 50-year fixed mortgage would leave Americans in debt for their entire adult lives. The idea might not solve the U.S. housing affordability problem, but is the idea as unconventional as it sounds? Here's what we know:\n\n\n\n🏠 Most homeowners ditch their mortgage early by refinancing or moving to a new location. The average American homeowner stays in their home for less than 12 years, according to a Redfin analysis.\n\n🏠 Long-term, fixed-rate mortgages allow for lower monthly payments and the ability to freeze housing costs, allowing homebuyers to refinance when it suits them.\n\n🏠 The problems identified with the 50-year mortgage idea are also evident in the 30-year mortgage. The motivation behind the proposal is to make homeownership more accessible for Americans, especially as prospective buyers face high prices and interest rates.\n\nPicture show\n\ntoggle caption Joey Palacios/TPR\n\nLatina grandmothers in their 70s and 80s in San Antonio, Texas, have come together to form a folklórico dance troupe known as Las Abuelitas De Oro, a name inspired by The Golden Girls. Folklórico is a traditional Mexican dance that combines regional dance with ballet techniques. It features intricate footwork and elaborate skirt movements. The troupe has gained popularity in the city because, despite their age, the members can perform the impressive movements for extended periods with great enthusiasm. They now offer free performances year-round throughout San Antonio and are dedicated to passing down their culture to new generations by teaching the traditional art form. Take a look at these photos, which showcase their culture. (via Texas Public Radio)\n\n3 things to know before you go\n\ntoggle caption PeopleImages/Getty Images/iStockphoto\n\nFriendsgiving is a typically potluck-style gathering with friends held near the date of Thanksgiving. The celebration can mean different things to different people. Here's a look at NPR's 'Word of the Week' and expert tips on how to celebrate Friendsgiving. The new \"Amped: Music Icons in Levi's Denim\" exhibition, located at Levi's headquarters in San Francisco, showcases how jeans reveal surprising insights into the lives and legacies of the artists who wore them, from Freddie Mercury to Beyoncé. The 36-unit Rainbow Road Apartments complex, inspired by a Nintendo Mario Kart game, is scheduled to open in Phoenix next month. Take a look at the building. (via KJZZ)\n\nSponsor Message\n\nThis newsletter was edited by Suzanne Nuyen.",
  "summary": "President Trump defends Saudi Crown Prince Mohammed bin Salman during a White House visit. And, a new NPR/PBS News/Marist poll reveals the president's low approval rating.",
  "published": "Wed, 19 Nov 2025 06:54:37 -0500",
  "url": "https://www.npr.org/2025/11/19/g-s1-98371/up-first-newsletter-saudi-prince-epstein-bill-trump-approval-rating",
  "source": "NPR Topics: World"
}