{
  "title": "Air-quality monitoring underestimates toxic emissions to Salton Sea communities, study finds",
  "text": "A newly published study finds that California's Salton Sea emits hydrogen sulfide, a toxic and foul-smelling gas, at rates that regularly exceed the state's air quality standards. The presence of these emissions in communities surrounding the Salton Sea are \"vastly underestimated\" by government air-quality monitoring systems, the researchers found.\n\nThe study, published in the journal GeoHealth, underscores the risk posed by hydrogen-sulfide emissions to communities already burdened by other environmental and socioeconomic stressors, the researchers say.\n\n\"The communities around the Salton Sea are on the front lines of a worsening environmental health crisis,\" said study co-author Mara Freilich, an assistant professor in Brown University's Department of Earth, Environmental and Planetary Sciences. \"Our study shows that hydrogen-sulfide emissions are not only more intense than previous monitoring captured, but they are systematically underreported -- especially when sensors are placed away from the lake or out of alignment with prevailing winds.\"\n\nLocated about 160 miles east of Los Angeles, the Salton Sea is California's largest lake. Though bodies of water had filled the basin previously, the current sea formed in 1905, when water from the Colorado River breached an irrigation canal and spilled into the Salton Sink. Since 1907, the lake has been maintained mostly by runoff from the surrounding basin, including agricultural runoff and wastewater that flows in but not out, making the Salton Sea more saline than the Pacific Ocean.\n\nIn the 1940s and 1950s, the area became a popular vacation destination, and new residents flocked to neighborhoods near the lakeshore. But during the second half of the 20th century, lake levels began dropping rapidly, partly because of a hotter and dryer climate and partly because of policies that diverted more water away from the valley. Increasing concentrations of salt and nutrients from agricultural runoff created algal blooms that deprived the lake of oxygen, killing fish and plant life. That desiccating organic matter emits hydrogen sulfide, which has been shown to cause headaches, nausea, fatigue, as well as long-term neurological and respiratory effects at even low levels of exposure, the researchers say.\n\nFor this study, researchers from Brown, the University of California, Los Angeles, Loma Linda University, and the University of California, Berkeley, worked with Alianza Coachella Valley, a local nonprofit community organization, to examine the causes of hydrogen-sulfide emissions from the lake. The researchers used data from weather stations and air-quality sensors installed by the South Coast Air Quality Management District (SCAQMD), a local government agency serving Southern California. Those data were combined with data from remote sensing observations as well as additional air-quality sensors the research team placed within the lake.\n\nThe study found that between 2013 and 2024, SCAQMD sensors in the communities of Indio, Mecca and the Torres Martinez Indian Reservation frequently showed hydrogen sulfide readings exceeding State of California standards. The exceedances were most likely in the summer and most pronounced at the Torres Martinez site, which is the closest of the three to the lake. In the month of August for each year from 2013 to 2024, Torres Martinez had an average of more than 250 hours of readings in excess of state standards.\n\nA comparison of wind direction data confirmed that exceedances tended to happen when the wind was blowing into communities from the direction of the lake. An additional sensor the research team placed in the shallow waters of the lake picked up consistently high hydrogen sulfide levels regardless of wind direction. That helps to confirm that the lake is indeed the source of hydrogen-sulfide emissions, and suggests that only a fraction of the total emissions is being captured by community-based regulatory sensors. Currently, only three of the numerous communities on the Salton Sea's long shoreline are monitored by regulatory agencies.\n\n\"Our results indicate that a significant portion of [hydrogen-sulfide] emissions remains unaccounted for, potentially being transported to communities without air monitoring stations,\" the researchers wrote.\n\nThe findings highlight the need for increased air-quality monitoring around the Salton Sea, the researchers say. There's also a need for further study of the public health consequences of these emissions.\n\n\"Community residents exposed to hydrogen sulfide are impacted not only in their physical health -- experiencing respiratory irritation, headaches and fatigue -- but as well in their quality of life,\" said Diego Centeno, study co-author who carried out this work as a researcher at Brown University and is now a Ph.D. candidate at UCLA. \"As the sea's shoreline continues to recede and sulfate concentrations increase, there is a growing concern that hydrogen sulfide will emit more frequently and at greater magnitudes.\"\n\nThe residents who live in the impacted communities are primarily Latinx and Indigenous (Torres Martinez Desert Cahuilla Indians) and already face elevated rates of asthma and other respiratory illnesses.\n\n\"This is a textbook case of environmental injustice,\" said Aydee Palomino, project manager for the Campaign for Thriving Salton Sea Communities at Alianza Coachella Valley and a study co-author. \"People in the Coachella and Imperial valleys are breathing in pollutants that are under the radar of traditional monitoring systems. Our work highlights the power of community science to expose these gaps and push for equitable solutions.\"\n\nThe research was supported by Burroughs Wellcome Fund, the Google Environmental Justice Data Fund and NASA. Freilich learned in March 2025 that the NASA grant supporting this work had been terminated. She said the unexpected termination has disrupted planned follow-up work, including efforts to share and discuss the findings with members of the affected community.",
  "summary": "Researchers showed that hydrogen sulfide, which is associated with numerous health conditions, is emitted from California's largest lake at levels far higher and more frequently than previously reported.",
  "published": "Mon, 02 Jun 2025 15:46:10 EDT",
  "url": "https://www.sciencedaily.com/releases/2025/06/250602154610.htm",
  "source": "Latest Science News -- ScienceDaily"
}