{
  "title": "‘My husband and daughter went down to the garage in case it flooded. Then I heard a strange noise’ – This is climate breakdown",
  "text": "Please enable Javascript to fully experience this interactive article.\n\nLocation Valencia, Spain\n\nDisaster Floods, 2024\n\nToñi García lives in Valencia. On 29 October 2024, devastating storms hit the Iberian peninsula, bringing the heaviest rain so far this century. The national alert system sounded at around 8.30pm local time; by then, however, flood waters had already broken through the city. Scientists say the explosive downpours were linked to climate change.\n\n\n\nI had been working with my husband, Miguel Carpio, for over 30 years. We would spend the day together, we would meet at work. With our daughter, Sara, and her boyfriend, we went everywhere – the gym, the dentist, the hairdresser – as a happy and close-knit family.\n\nView image in fullscreen Toñi Garcia in Benetûsser, a year after the storm in which her husband and daughter died. Photograph: Pablo Garcia/The Guardian\n\nIn my house, there wasn’t a pair of trousers, a dress or a sock that we didn’t buy together. In my family, there was never a day without an “I love you” or a hug.\n\nOn 29 October 2024, we left work at half past four in the afternoon and arrived home at around five to our apartment on the fourth floor of a building in Benetússer, on the outskirts of Valencia. Despite working for the regional government, we had received no warning about the rains that were falling in the interior of the Valencian community.\n\nBut my daughter – a nurse working at La Fe hospital on the intensive care ward – was scared. At half past six, she asked me from the balcony if the town could get flooded. I told her it was impossible. I’m 60 years old and I had never seen it flood. My elders had always led me to believe that it was impossible. Still, as a civil servant who knows the system, I knew that if there was any danger, the authorities would contact us via WhatsApp or text. I made her look at her mobile phone. She had no messages, no alerts. We asked my husband, who also had nothing.\n\nView image in fullscreen A flooded slum area in Picanya, near Valencia, on 30 October 2024. Photograph: José Jordan/AFP/Getty Images\n\nI tried to reassure her, saying: “Look, they haven’t warned us about anything, so nothing is going to happen.” My husband and I continued doing things at home. She stayed on the balcony, worried, and at exactly quarter past seven in the evening, she cried: “Mum, Dad, come, come.” We looked out and saw a very low tongue of brown water, less than 15cm deep.\n\nThe first thing we thought to do was to take the car on to the street in case water seeped into the underground garage. My husband went downstairs and my daughter, who drives a separate car, joined him. I stayed on the balcony and called my sister, who was in Valencia city, to tell her not to come over that night.\n\nBut not long after they went down, I heard a strange noise in the background. It was as if something heavy was being dragged on asphalt. I looked to the right and suddenly saw a huge wave carrying a wall of reeds. And that scared me, because right afterwards, water started coming in, very strong and with high pressure. It was dragging containers, and soon it was dragging cars. It lifted up all the cars that were parked on the street and started to carry them away. I hung up on my sister and immediately the power went out. We had no electricity.\n\nAbout the series This is climate breakdown was put together in collaboration with the Climate Disaster Project at University of Victoria, Canada. Read more. Production team\n\nI went down the stairs from the fourth floor to the garage, but I stopped at what we call the street courtyard, where the water was already 2.5 metres deep. I still had one more floor to get to the garage, but I couldn’t reach it. So I ran back up the stairs and called my daughter’s boyfriend. The two have an app on their phones so they can know where the other is at any time. He tried to find her, and at nine minutes past eight in the evening, he told me it was impossible: “We’ve all tried, all our friends. I can’t locate her.”\n\nI had been hoping that her mobile phone had fallen into the water, that she had lost it, that she and my husband had been safe in a higher area, that they had been able to get out of the garage. But they hadn’t. Before the Valencian regional government had even raised the alarm, the two of them and a neighbour had drowned. It wasn’t until late on the night of the 31st – with the help of a water-pumping truck and an expert team of divers – that they found them.\n\nI remember the sounds well. The water was rushing with tremendous force. It was like a raging sea, fierce, stopping at nothing. The level kept rising. After the ground-floor doors burst open, the walls were hit by cars and lorries that were being swept away by the water. The rumble of cars smashing into the pillars is a sound that I will never forget.\n\nView image in fullscreen Cars partly submerged in flood waters on the western outskirts of Valencia. Photograph: Gonzalo Arroyo Moreno/Getty Images\n\nNot only did 229 people die that day, but there were thousands of people who were saved by the skin of their teeth. People climbed up to the first and second floors. Schoolchildren were rescued by tying sheets together so they could scramble up. We also heard a woman and two men calling for help, who had probably been left clinging on to the fence. We tried to focus our torches on them from home, but they weren’t bright enough. We threw them sofa cushions, furniture, and a neighbour even threw them a tyre, but the water was so strong and rough that it was impossible. We didn’t see them grab hold, and about two and a half hours after I heard them, they stopped making any noise. I never found out what happened to them.\n\nThe morning after, we still had hope of finding my husband and daughter. But the lights weren’t working, we had no water, and the authorities weren’t answering our calls. It was a hellish situation of darkness, death and institutional silence. People were looking for their loved ones. Sara’s boyfriend’s family came to my house covered up to their chests in mud. I don’t know how they got there, because it was impossible to walk around or cross the street. There were rows of cars piled up, along with furniture and various objects. The situation was Dantesque. It was total, apocalyptic destruction. We couldn’t believe what we were seeing.\n\nI was one of the first members of a victim’s family to publicly denounce those responsible on television. I knew exactly who was responsible: the Valencian regional government. I reproached them for it, I denounced them publicly in the media, I asked for help, I asked for legal advice, I proposed that I would fight for my husband and my daughter and for all the victims until the end. I even suggested that if I did not see justice here in Spain, I would go to the European Union, to Brussels, and that is what I did, I went to the parliament. And to this day, I will continue to fight for what I believe they died unjustly for, because it was due to a lack of prevention.\n\nView image in fullscreen Water-ravaged cars piled up in Paiporta, near Valencia, a month after the floods. Photograph: Eva Manez/Reuters\n\nI always say that on 29 October 2024, like me, many families also died, when we lost our loved ones. It is very difficult to move on because we are broken, we are devastated with grief. We have lacked institutional support. We have not yet been able to mourn our loved ones because we are still fighting for them. We continue to demand the truth, which we still do not know. We demand justice. All those who failed us Valencians that day because they were not there to protect us should have resigned. Until that happens – and our struggle continues – it is impossible to mourn.\n\nI have been very fortunate because I have had the best people in my life. The ones who have made me happy. I have had the greatest gift in life, which has been them both. And they leave me with a legacy of wonderful memories. I insist that I feel lucky because I knew love, I knew affection.\n\nYesterday, I was with my psychiatrist. He had to increase the dose of the antidepressant I am taking. I told him that we have no life, that until this is over and they admit their mistake, we cannot mourn, we cannot be well, we cannot remember or commemorate them, or live our lives. Because we continue to fight. And now our priority is to continue fighting, for my family and for all those victims.\n\nFor all those people who do not have strength, I will find it.\n\nThe interview was conducted shortly before the first anniversary of the Valencia floods. Just a few days after the anniversary, Carlos Mazón, the conservative president of Valencia who was widely criticised for his handling of the disaster, resigned.",
  "summary": "<p>She was sure that there would be warnings if there was any danger. But then the floods came. This is Toñi García’s story</p><p><em>Location</em> Valencia, Spain</p><p><em>Disaster</em> Floods, 2024</p><p><em>Toñi García lives in Valencia. On 29 October</em><em> 2024, <a href=\"https://www.theguardian.com/world/2024/nov/05/at-least-89-people-remain-missing-after-floods-in-eastern-spain\">devastating storms</a> hit the Iberian peninsula, bringing the heaviest rain so far this century. The national alert system sounded at around </em><em>8.30pm local time; by then, however, flood waters had already broken through the city. <a href=\"https://www.bbc.co.uk/news/articles/c98eylqeg06o#:~:text=30%20October%202024,every%201C%20degree%20of%20warming.\">Scientists say</a> the explosive downpours were linked to climate change.</em></p> <a href=\"https://www.theguardian.com/environment/ng-interactive/2025/nov/20/valencia-storms-iberian-peninsula-this-is-climate-breakdown\">Continue reading...</a>",
  "published": "Thu, 20 Nov 2025 12:00:11 GMT",
  "url": "https://www.theguardian.com/environment/ng-interactive/2025/nov/20/valencia-storms-iberian-peninsula-this-is-climate-breakdown",
  "source": "The Guardian"
}