{
  "title": "40 Best Early Black Friday Deals on WIRED-Tested Gear (2025)",
  "text": "Black Friday and Cyber Monday are two of the biggest shopping holidays of the year. Falling on the Friday and Monday after Thanksgiving, it's safe to expect Black Friday deals on thousands of items big and small. As always, the WIRED Reviews team will be scouring the internet to find truly good deals on items we've actually hand-tested and would recommend to a friend. While the official sales have not yet started, there are already some great early discounts on reliable gear. Find our favorites below.\n\nDon't miss our other recent deals roundups about the REI Holiday Sale and the Home Depot Black Friday Sale.\n\nUpdated November 19, 2025: We've added 11 new deals to this post, removed any expired discounts, and ensured accuracy throughout.\n\nApple Watch SE 3 for $200 ($50 off)\n\nThe Apple Watch SE 3 is the best Apple Watch for most people. It has excellent value and most of the tracking metrics you'd want, like skin temperature sensing and sleep apnea notifications, in addition to common stats like steps, sleep, and workout efficacy. It doesn't have blood oxygen or ECG capabilities, but we like the watchOS 26 operating system, the long-lasting battery, and the very affordable price tag.\n\nApple MacBook Air (13-inch, 2025) for $750 ($249 off)\n\nThe 2025 MacBook Air is the best MacBook on the market right now, and this price matches the best we've tracked (and is $50 lower than we'd seen up until this month). It can handle the tasks you'd expect, including multiple Google Chrome tabs with applications running in the background. It also has an upgraded 12-MP webcam and a few different ports, including a headphone jack. We do recommend going for upgraded unified memory if you're a power user, and while it can handle some photo editing or other content creation, it's probably not the best choice if you'll be editing videos or other graphics-intensive tasks. But for just about anyone else, it's worthwhile, especially at this price.\n\nNothing Ear (a) for $89 ($20 off)\n\nThese ultra-stylish earbuds are the very best on the market. The Nothing Ear (a) are on sale for this price relatively often, but it's just $10 higher than the best we've tracked, and we've seen them sell out before when they do hit $79. The onboard touch controls and small, sleek charging case are nice, but the battery life and noise cancellation are nothing to sneeze at either.\n\nCozy Earth Bamboo Sheets for $246 ($62 off)\n\nThese decadent, soft sheets are silky, smooth, and slightly chilly when you first get into bed. WIRED reviewer and sheets expert Nena Farrell likens them to climbing in a puddle of melted butter—which sounds about as luxuriant and comfortable as falling asleep can possibly feel. They get warm in the night, so they're especially nice to have during the cooler months of the year, and they're deep enough to fit most mattresses. This deal is part of a larger sitewide sale at Cozy Earth—we also like its pajamas and slippers.\n\nNetvue Birdfy Plastic Smart Bird Feeder for $120 ($80 off)\n\nThe best smart bird feeder goes on sale pretty often, but this time of year usually brings it to the lowest price we'll see. Right now you can save on the base model without a solar panel (which you'd have to install separately anyway). It might be worth forking over the extra cash for a lifetime subscription to its AI-powered bird identification services, though there's a chance those lifetime subscription models will get cheaper on Black Friday. Otherwise, the subscription costs $5 per month. The feeder is easy to set up and use, with a 1080p wide-angle camera and an easy-to-clean, IP65 water-resistant plastic housing.\n\nDreamegg Sunrise 1 Alarm Clock for $60 ($40 off)\n\nOur favorite budget sunrise alarm clock gets surprisingly bright, and it has nine different colors of dimmable light to choose from. Also onboard are 29 different sleep sounds, and everything can be controlled on the clock itself rather than with a smartphone app or remote control. It doesn't have a sunset routine, but the sunrise routine in the morning can help rouse you from sleep gently and naturally—which will especially come in handy during this time of year, when it feels like sleep schedules and circadian rhythms just go out the window.\n\nGarmin Vivoactive 6 for $250 ($50 off)\n\nGarmin's Vivoactive 6 is the best Garmin watch for most people, and this price matches a low we've seen just a couple of times before. The entry-level tracker has onboard GPS, blood oxygen monitoring, and all the fitness metrics you'll need, including those that Garmin is known for (such as Training Readiness). AI fitness insights are useful, but you'll need a subscription to access them, though we don't think it's necessary if you don't want to pay $70 per year for it.\n\nTCL QM6K QLED TV for $498 ($150 off)\n\nOur expert reviewers test gear all year long, and in their opinion, the TCL QM6K QLED is the best TV money can buy right now. This low price matches the best we've seen. It has balanced performance, with natural-looking colors and great black levels. It's not the brightest on the market, but if you don't need an ultra-bright TV, it should perform well. The gaming features, Google TV interface, and Google Assistant are icing on the cake. Just make sure to pair it with a soundbar, as the built-in speakers aren't great.\n\nPower up with unlimited access to WIRED. Get best-in-class reporting and exclusive subscriber content that's too important to ignore. Subscribe Today.",
  "summary": "We found early Black Friday deals on WIRED-tested smart bird feeders, smartwatches, vacuums, and more.",
  "published": "Wed, 19 Nov 2025 19:48:24 +0000",
  "url": "https://www.wired.com/story/early-black-friday-deals-2025-1/",
  "source": "WIRED"
}