{
  "title": "'Nightmare Obscura' author explains how to take control of your dreams",
  "text": "'Nightmare Obscura' author explains how to take control of your dreams\n\nTONYA MOSLEY, HOST:\n\nThis is FRESH AIR. I'm Tonya Mosley. We've all had them - those unsettling dreams that jolt us out of sleep. Maybe you're back in high school, unprepared for a final exam or searching desperately for something that you've lost. Strange, vivid scenarios that feel real in the moment and leave us rattled when we wake up. My colleagues here at FRESH AIR are no exception. Here's what keeps some of them up at night.\n\nTERRY GROSS, BYLINE: I'm driving a convertible, and suddenly I'm thrown through the roof of the car into the sky, and I'm flying, which sounds very liberating. But unlike Superman, I feel powerless. I'm terrified. And then I wake up.\n\nUNIDENTIFIED PERSON #1, BYLINE: I'm walking in the airport. I'm trying to find my gate, and I can't seem to find it. And then I find myself at the end of the terminal, sort of like \"Truman Show\"-esque where he reaches the edge of the soundstage.\n\nUNIDENTIFIED PERSON #2, BYLINE: I'm on a cruise ship, and it's doing barrel rolls down the side of giant waves. Mind you, I've never been on a cruise ship.\n\nUNIDENTIFIED PERSON #3, BYLINE: My college contacts me to tell me there's been a mistake, and I'm missing a whole bunch of credits, so I didn't really graduate. And my nightmare is that I have to leave my life, move back halfway across the country, and I have to finish my degree.\n\nUNIDENTIFIED PERSON #4, BYLINE: My whole life, I've had dreams about losing my wallet. Now that I have a 6-year-old daughter, I dream about losing her.\n\nMOSLEY: If any of those feel familiar, you're not alone. Most of us will have at least one nightmare before the year is out. Some of us have them every month. And for millions of people - up to 6% of the population - nightmares are not occasional terrors but weekly torments that disrupt our lives. Yet despite how common they are, many of us still think of nightmares as random misfires of our sleeping brains, unsettling and ultimately meaningless. But what if we've been understanding them all wrong?\n\nMy guest today Michelle Carr is a dream scientist who runs the Dream Engineering Laboratory at the University of Montreal. And she's spent two decades watching people sleep, measuring their brain waves, tracking their heart rates and waking them up mid-nightmare to try to understand what's really happening. In her new book, \"Nightmare Obscura: A Dream Engineer's Guide Through The Sleeping Mind,\" Carr argues that nightmares aren't random at all. They're learned, which means they can be unlearned through lucid dreaming and what she calls dream engineering. Carr writes that we can actually rewrite our nightmares and break the cycle they can sometimes create. Michelle Carr, welcome to FRESH AIR. Michelle Carr, welcome to FRESH AIR.\n\nMICHELLE CARR: Hi. Thank you for having me.\n\nMOSLEY: OK, before we get to the premise of the book, I want to start with really the most basic question, and that is why do we dream, and why do some dreams turn into nightmares?\n\nCARR: Yeah, that's such a big question to answer. But over the past couple decades of dream science, we've started to uncover some of the - what we think are some functions of dreaming. And in particular, it seems like in dreams, we're kind of processing our recent experiences and memories, and especially those memories that are really emotional and important, so significant things that happen to us during the day. And during dreams, it seems like we're kind of reworking recent memories and maybe making associations to other things we've experienced in the past, trying to learn how to deal with these scenarios and how to adapt. And it seems like dreams are kind of preparing us, in a way, for what's to come the next day. So they seem like they're supporting some adaptation for humans.\n\nAnd why do they turn bad? Well, of course, we all experience stressful things and kind of difficulties and conflicts in our life. And when these are really more severe, when we go through trauma or severe adversity, this can trigger nightmares. Essentially, the emotional memory is so intense that it disrupts this function of sleep and jolts us out of sleep into wakefulness.\n\nMOSLEY: The purpose of dreams, I can't help but think that it almost sounds like therapy, like self-therapy, you know? We're processing with ourselves, you know, while we're sleeping.\n\nCARR: Yeah, that is something that some researchers have called it, that dreaming is a form of overnight therapy kind of helping us to deal with and to adapt to the difficult things that we face in life.\n\nMOSLEY: The problem is, sometimes we have no idea what they mean, you know? There's so much symbolism in them. It's not just straightforward.\n\nCARR: Yeah. I mean, I don't always necessarily even try to know what the dream means necessarily. It's more of just, like, an experiential process. And often, I like to think that they're helping us, even if we don't remember them, even if we don't know what they mean. It's kind of a natural process of the sleeping brain.\n\nMOSLEY: Your path is really interesting - your path into dream science - because it actually started with a personal experience you had - your first lucid dream in college. What happened during that experience that really changed the direction of your research?\n\nCARR: Yeah, when I was in college, I was actually still having something called sleep paralysis, which is where right when you're waking up from a dream, your body is still kind of physically paralyzed, and it's often a really frightening nightmare experience. And this happened to me once in college, and I was able to - rather than, like, really forcing myself to wake up, I was able to kind of relax and to stay asleep. And I felt like I woke up naturally. But what happened is I went into a lucid dream, which means I realized that I was still asleep, and I was dreaming my dorm room bedroom, essentially.\n\nIt was fully vivid, and it felt very realistic. And it was a really simple dream. I was just sitting in my dorm room, kind of looking around. But I was just so fascinated at how just moment by moment, my brain was producing this completely immersive simulation, and I was inside of it, experiencing it while I was asleep. And that just really fascinated me and, beyond that, inspired me. That lucid dreaming kind of helped me to get past this fearful sleep paralysis episode that I was having.\n\nMOSLEY: Right. You wanted to learn more, too, about why - like, why this happens to us and how we can use it for our benefit. Dream science is still pretty new, though, I mean, in the whole context of, you know, scientific research. And I think most of us have no idea how you even go about studying a dream. I mean, we might picture those sleep labs to test for sleep disorders. What's going on in your lab? What does it look like?\n\nCARR: Our lab is actually very similar to kind of a sleep clinic in that we - you know, we invite subjects into the lab. There's two bedrooms that really we try to make them look like comfortable bedrooms, like in a hotel with a typical - you know, a nice bed frame and a bedside lamp. And we try to make it kind of warm and homey rather than, you know, a hospital bed or something like that. And before the subjects go to sleep, we hook them up to a bunch of different electrodes - a bunch on their scalp to measure brain activity, some on their face measure their eye movements and their muscle tension. And we can even measure their respiration, their heart rate. So all sorts of signals essentially that we measure while the person is sleeping.\n\nAnd while they're sleeping, actually the experimenter is sitting in another room nearby. And we're watching, you know, a video of them and also watching essentially all of their brain and body activity on a screen. And we can interact with them through a two-way intercom, essentially waking them up when we want to collect dream content.\n\nMOSLEY: So you're waking people up, and I just think it's really interesting. You're not asking them, though, what are you dreaming about when you wake them up. You ask something very specific that you found is the key to recalling dreams really quickly.\n\nCARR: Yeah. Actually, so when dream science first came around, they did ask the question, what are you dreaming about? But over time, dream scientists realized that this was actually essentially limiting dream recall 'cause people have a really stereotypical and biased view of what a dream is. You know, we think of just these really narrative and elaborate and bizarre stories. Like, that's what a dream should be. But when we wake people up in the lab, we just ask them, can you tell me anything you were experiencing just before I called your name? And we ask them to lie still and to just allow any experience, any mental experience that they had to come back to mind. So it could be thoughts, it could be feelings that they were experiencing, or it could be a fully elaborate dream as well.\n\nMOSLEY: Let's take a short break. If you're just joining us, my guest is Michelle Carr, a dream scientist whose new book, \"Nightmare Obscura,\" explores why we dream, why some dreams turn into nightmares and how we can use the science of dreams to improve our health. We'll continue our conversation after a short break. This is FRESH AIR.\n\n(SOUNDBITE OF THEO BLECKMANN AND FUMIO YASUDA SONG, \"DIE ALTEN WEISEN\")\n\nMOSLEY: This is FRESH AIR. And today, we're talking to Michelle Carr, director of the Dream Engineering Laboratory and author of \"Nightmare Obscura.\" She spent hundreds of nights in sleep labs watching people dream, studying what happens in our minds, brains and bodies when nightmares occur and developing new techniques to help people influence their dreams - yes, you can do that - and stop the disruptive cycle of chronic nightmares.\n\nMichelle, you actually found something interesting in your research - that people who are prone specifically to nightmares also tend to be highly sensitive. So they're more creative, they're more perceptive, more empathetic. I mean, is that an overlooked upside to the issue of nightmares?\n\nCARR: Yeah, definitely. This was something that I found during my doctoral work. And it was kind of a surprise at the time. Although, I will say that other dream researchers had started to point to this before that many people who have nightmares, they just, yeah, it seems like they're just very highly sensitive people. Meaning they are really - they're very perceptually sensitive. They process the environment more deeply. And it's very highly correlated with things like creativity and just feeling things more deeply and aesthetic sensitivity.\n\nSo even of those people who have nightmares, sometimes they'll say even though I have nightmares, I use them as artistic inspiration. Or besides my nightmares, I also have really vivid lucid dreams, and I have a really vivid imagination. We actually looked at this in the lab. We asked people to just daydream for a few minutes. And what we saw is that the people who have nightmares, they were having these really bizarre and vivid and immersive daydream experiences. So they have a really prime access to their imagination, essentially.\n\nMOSLEY: I also want to make sure that we're clear. Nightmares are pretty typical. They're pretty normal for people. They vary. But there is a difference between a bad dream and a nightmare disorder that needs treatment. Can you briefly talk about that? I mean, you do encounter people who are basically just terrorized by sleep and going into nightmares.\n\nCARR: Yeah. Bad dreams are just less intense than nightmares. Sometimes we use the definition that to qualify as a nightmare, it really has to interrupt your sleep. Like, it jerks you out of sleep because it's so intense. And to qualify as a nightmare disorder, it really has to cause waking distress and kind of interfere with someone's quality of life.\n\nWe often see that people are really - they're unable to, like, concentrate during the day. They're constantly like, this nightmare keeps intruding into their mind. And they really are afraid of sleep. They avoid going to sleep. Anytime they have a nightmare, they want to get out of bed and avoid sleep as much as possible. So it really creates a more significant pathology. But bad dreams are completely common, and everyone has them occasionally.\n\nMOSLEY: Something that really surprised me about this is just how much the body shapes our dreams. I mean, because I think most of us think about it's happening in our mind. It's our subconscious. But the sounds, the sensations, what we typically experience during the day, our bodies, is also coming into play in our dreams. How much of dreaming is just the brain trying to make sense of all of what our bodies experienced during the day? Can you explain this?\n\nCARR: Yeah, I think this is still a really big open question in dream research. But it's definitely something that's become more and more of interest over time. Initially, there was kind of this view that while you're asleep, you know, your body is lying there still. And there was this view that dreams are something that just happens in the brain. It's just brain activity, and you're completely disconnected from your body.\n\nBut now we realize that that's really not true, that there's all sorts of activation happening in the body, and especially during REM sleep, which is when we have the most vivid dreams. So, you know, we see changes in heart rate. We see little muscle twitches, little contractions of muscles all throughout the body. And there's really rapid eye movements. You can see facial expressions even, emotional expressions. And over time, we're starting to see that there's some correspondence, that what we're dreaming is directly related to what is being experienced in the body to some extent.\n\nMOSLEY: You write about some of the bad dreams that are common among people, like falling. A common dream that people have are of their teeth falling out. It's one of those classic anxiety dreams that people have assigned all types of symbolic meaning to. But your research suggests something much more straightforward, specifically about this kind of dream, about teeth falling out. What's really happening?\n\nCARR: (Laughter) Yeah. Yeah, in general, there's all types of these bad dream themes that people all around the world will report. And what's funny is for some of them, like the dream of teeth falling out, it seems like there might just be a physical component, which is that a colleague of mine, they did research that showed that people who have this dream of their teeth falling out, they also have more dental irritation in the morning, meaning maybe their jaw or their mouth is sore. And that's because a lot of us grind our teeth or clench our jaw during the night. And so this dream might just be incorporating that physical sensation. You know, the mind is trying to make sense of why my jaw is drained, and it creates this bizarre dream of your teeth falling out (laughter).\n\nMOSLEY: So the answer might be just going to the dentist or getting that, like, (laughter) working through the grinding of your teeth, huh (laughter)?\n\nCARR: It might be. Yeah, I mean, I think there's always, you know, it's a balance. And this is kind of a recurring theme in my book is there's this real balance between the psychology and kind of the physical part of dreaming. So I think even if there is a physical explanation, the fact that one person would have a really distressing dream of their teeth falling out, whereas another person might just dream of, you know, eating delicious foods, there are, like, different ways that we can interpret these sensations. So there still might be a psychological component to how we experience this.\n\nMOSLEY: I'm very curious about how our sleep schedules or the lack of one spill into our dreams. Say you're working the graveyard shift or you're bouncing between shifts, and your body clock is completely thrown off. How might that show up in our dreams?\n\nCARR: I think definitely having an inconsistent sleep schedule or being sleep-deprived in any way can increase the incidence of nightmares. One thing we see is that people who consistently go to bed too late are more likely to have nightmares - and really anything that kind of, you know, disrupts your - the structure of your sleep essentially. What we see is when you have a consistent sleep schedule and you get enough sleep, your sleep is very kind of - we call it consolidated, and it follows a very specific pattern across the night. But when this is disrupted, you can - you know, the different sleep stages are going to get intermixed, and you're going to wake up a lot from sleep. And this can potentially cause bad dreams and even nightmares.\n\nMOSLEY: Right. 'Cause I think what I'm hearing from you and what I gather from your book is that really getting into REM sleep is so important. And not only for our sleep hygiene and health, but just overall our ability to recall dreams and mitigate nightmares.\n\nCARR: So REM sleep is actually where we're most likely to have nightmares. But really, all of the sleep stages, you know, having deep sleep and having REM sleep, which occur at different times in the night - you know, we have much more deep sleep early in the night, and then we have much more REM sleep closer to waking up. It's all really important, I think, for maintaining the functions of sleep for mental and emotional well-being. And when one is disrupted, you know, it can aggravate or interrupt the functions of another state.\n\nBut with nightmares, we especially see that they're most likely to happen during REM sleep, which is a really - it's a brain state that's quite - it's quite wake-like. It looks almost like wakefulness when we're looking at it - looking at the brain activity. And it's really - there's also a lot of emotional activation in the brain. And the body is almost experiencing wakefulness, but it's disconnected from (laughter) the typical waking world.\n\nMOSLEY: You lay out in the book stress dreams, and work dreams are often under that category. People are having dreams where they're over and over doing a task at work that they can't quite complete. You write that up to 75% of adults experience these kinds of reoccurring stress dreams. You call them dreams of inefficacy. Can you explain that?\n\nCARR: Yeah. So this is a very, very common, typical dream theme. So, you know, the vast - the majority of people who have had this kind of dream where you're trying again and again to accomplish a specific task - and often there's all sorts of obstacles that crop up in your way. So examples are, like, trying to get a flight on time or trying to get to an exam that you're supposed to be taking, or you realize you were meant to take it and you forgot to study. But this theme of, like, trying to accomplish a goal, and the whole dream just seems to be endless attempts and often not even succeeding.\n\nAnd we think that this is related to kind of maybe one of the broad functions of dreaming, which is to help us to rehearse different skills. This is - obviously, like, really important to waking life is accomplishing tasks and having goals and knowing how to work towards them and learning new skills. And we think that dreaming is just kind of reenacting these scenarios where the purpose is actually just to try, to practice and to reach towards the goal, and not necessarily to accomplish it (laughter).\n\nMOSLEY: That's so interesting. So when someone has a reoccurring work dream where they can't complete a task or they're perpetually failing, what is our subconscious actually trying to work through? Is it problem-solving, or is it more like the brain is just spinning its wheels? 'Cause it can feel like that sometimes.\n\nCARR: It does feel like that. I think both are possible. I mean, sometimes we do actually see a solution to a problem, a really creative one that comes up in dreams. And sometimes it seems to be just about the process, the process of trying to accomplish a task. So one thing that's been shown in research studies, actually, is a lot of people will have bad dreams about exams or about school or about their performance. And in one study, they looked at medical students who were taking a big exam. And they found that those students who had that classic anxiety dream of, like, showing up to the exam without a pencil or without having studied or they felt unprepared, even if the dream was really stressful and unsuccessful, those students performed better on the actual exam than the people who didn't have that dream.\n\nMOSLEY: Oh.\n\nCARR: Which supports this idea that it's - even if the dream is not successful, it's helping us to prepare in some way, either motivating us or just mentally rehearsing material that's related to the exam. In some way, it's adaptive.\n\nMOSLEY: Our guest today is Michelle Carr, a dream scientist who studies nightmares and what happens in the mind and the body when they occur. We'll be right back after a short break. I'm Tonya Mosley, and this is FRESH AIR.\n\n(SOUNDBITE OF HIOR CHRONIK'S \"WE ARE ALL SNOWFLAKES\")\n\nMOSLEY: This is FRESH AIR. I'm Tonya Mosley. And my guest today is dream scientist Michelle Carr. Her new book, \"Nightmare Obscura,\" explores the hidden world of dreams and nightmares. Carr has spent two decades studying sleep in laboratory settings, and her research has led to techniques in treating chronic nightmares and even teaching people how to lucid dream. Carr is the director of the Dream Engineering Laboratory and the Center for Advanced Research in Sleep Medicine, an assistant professor at the University of Montreal, and a former president of the International Association for the Study of Dreams.\n\nI want to switch gears and talk about how our childhoods impact our dreams and nightmares because your research actually shows that childhood adversity, even before age 6, can lead to nightmares that continue until adulthood. Can you explain what's happening in a young child's brain when they experience trauma that creates these lasting nightmare patterns?\n\nCARR: Yeah. So that's definitely something that we have found and other researchers as well, that even very early childhood adversity is strongly linked to frequency of recalling nightmares in adulthood. And there's even some theory that the actual themes of nightmares might still be related to childhood experiences. And, you know, one theory looks specifically at what's happening to children when they're very young and they're going through adverse experiences, that it changes certain kind of emotional - how the brain processes emotion, essentially. It almost - it matures or ages the brain more quickly than is normal. And because of this, it can encode or hold on to adverse memories in a way that's more vivid than we typically - like, most of us forget the vast majority of our really young childhood experiences.\n\nBut when we're exposed to adversity, we kind of - our brain quickly matures and tries to hold on to those more stressful experiences. And we think those might be related to the themes of nightmares and why nightmares keep recurring over time. This is still kind of an open question, but it's one that we're interested in exploring.\n\nMOSLEY: And when you talk about experiences, I mean, you're talking about going all the way back to this time period where we think we don't remember anything. So before ages 3 and under, so 3 1/2 and under. How is it possible that a trauma that we don't consciously remember still can create nightmares decades later?\n\nCARR: Yeah, it's something we still don't fully understand. But there is just a little bit of research suggesting that people who have had early adversity, they do have earlier memories, early recall for memories. And they do have - they remember their dreams from an earlier age, and from - they remember having bad dreams from an earlier age than is typical.\n\nSo, yeah, we don't fully understand it, but in some ways, it might just be we're encoding our emotional responses. So even if we don't have the exact memory of what happened, we remember the emotional response on kind of an implicit or a subconscious level, and maybe that's sprouting up in dreams. But this is all still pretty - you know, it's pretty speculative so far. But it's definitely something we're looking into because of how important that would be to know about, if these really early experiences are triggering nightmares even much later in life.\n\nMOSLEY: You give examples of adults whose nightmares trace back to events like their parents' separation or their parents' divorce. One person developed dreams of being cheated on. Another dreams of falling into emptiness. I've just always wondered, why do these dreams turn into symbolic transformations, meaning why doesn't the brain just replay the original event? Why is it using symbolism?\n\nCARR: Well, in the first place, dreams very rarely replay actual events. This is kind of one thing that we know, is that although our dreams incorporate fragments of experience - you know, you might incorporate a person that you saw or, you know - I don't know - something you - an interaction you had, it's just pieces of memory that are reassociated during dreams. And they make kind of novel experiences when you have them. So, in a way, I think this is just a natural process of dreaming to kind of break down our memories into little bits and pieces and then reassociate them into new things.\n\nSo with, like, a really emotional experience, one very important piece of that is just the emotion. And the emotion might be, I feel completely helpless and overwhelmed. And the dream takes that emotion and seems to associate it with other images, other experiences that the dreaming mind says, this makes me feel helpless and overwhelmed. And one of the examples that I love by this researcher, Ernest Hartmann - he found that after trauma, a lot of people will experience what's called the tidal wave dream. And this is a dream that you're in the ocean, and all of a sudden, a tidal wave is about to overtake you. And it's really - it's a symbol, but it just shows that absolute feeling of helplessness and of being overwhelmed and feeling powerless.\n\nMOSLEY: If childhood adversity - the traumas that you experience as a child - can create these lasting nightmare patterns, are there things that parents and caregivers can do? Are there ways to intervene when a child is having nightmares to prevent them from becoming these lifelong reoccurring themes that they dream about later in life?\n\nCARR: Definitely. The treatments for nightmares are - work just as well for children as for adults. So, you know, the basic techniques are to, you know, rewrite a nightmare. So if a child has this recurring bad dream, you could help them to come up with a new version of the dream that's more empowering and more positive. And with children, you might, you know, suggest using magic or inviting, you know, a fairy-tale character into the dream and make it creative and make it fun. You can do this with drawing as well. Kids can draw, like, a new, fun version of their dream. And you just help them to visualize and to practice imagining this - more pleasant dream practices before sleep. And that can help them to reduce nightmares. And children can also become lucid in dreams. There's some work on helping children to become lucid and to, you know, choose to fly away or choose to do whatever they want within the dreamscape.\n\nMOSLEY: Sometimes when someone has had a very vivid nightmare or a bad dream, they often describe it saying, I dreamed about this all night. But how long - realistically, how long do nightmares or bad dreams last? Are they quick, or do they last throughout the night truly?\n\nCARR: Oh, that's a good question. I don't know that we know for sure. But I would expect that most bad dreams and nightmares, they're going to be occurring within one sleep cycle. And usually, you know, at most, REM periods are reaching, like, 25, 30 minutes. So - but I would think most dreams - most bad dreams and nightmares are much shorter. They're kind of maybe five minutes or something, but I don't have...\n\nMOSLEY: Wow.\n\nCARR: ...Data on that. That's just my - from what I know about REM sleep and dreaming altogether, yeah.\n\nMOSLEY: Are there negative physical health effects from having nightmares that you found, especially those who have reoccurring nightmares?\n\nCARR: Yeah, there are some studies now suggesting that having, like, frequent and severe nightmares can have immediate and potentially long-term physical health consequences. In the first place, often when someone wakes up from a nightmare, their body is in a real state of distress. Maybe suddenly their heart is pounding and they're sweating, and they can't breathe or they're breathing really quickly. So, you know, that's a real physical state of distress.\n\nAnd we see some alterations in stress hormones that are produced in the morning right after a nightmare. People self-report that they have less physical energy and feel in poor physical health the day after a nightmare. And more recently, there's even some research finding that people who have frequent and severe nightmares, they also report having more cardiovascular problems, potential heart problems. And there's even suggestion recently, some findings showing links to earlier mortality, so earlier death rates.\n\nMOSLEY: You also talked about differences in people who - I don't know if you would call it acting out their dreams, but there are certain populations of people who have ticks or movements. What is happening when that happens? Does that kind of fall into the category of, like, dreaming, the physical aspects of dreaming as well?\n\nCARR: Right, yeah, there's something called dream enacting. And it can happen sometimes with nightmares or really emotionally intense dreams. Maybe, you know, from a really sad dream, you might wake up and you're actually crying. Or you might shout right at the end of a nightmare. So this can happen even in nonclinical conditions. But in one condition, and in particular called REM behavior disorder, people really, they start acting out their dreams a lot. And this often occurs in men over 60.\n\nMOSLEY: Oh.\n\nCARR: And it's actually an indication of, it's often - I mean, up to 90% of people who develop this sudden acting out of usually violent dreams, they might start punching or kicking while they're asleep. And they dream about these aggressive or violent things. And it's actually one of the earliest indications of someone developing neurodegeneration. So up to 90% of people who have REM behavior disorder, they will go on to develop some type of neurodegenerative disease - like Parkinson's, I think, is the most common - within a decade of diagnosis. So it's actually a really - it's an early indicator that something, you know, some kind of neurodegenerative process has begun in the brain. And it's resulting in this acting out of aggressive dreams, essentially.\n\nMOSLEY: That's so interesting. And it's primarily in men over 60?\n\nCARR: Yeah, I think the vast majority of cases, they suddenly occur in men over 60. It's like - well, I don't know percentages, but yes (laughter).\n\nMOSLEY: Let's take a short break. If you're just joining us, my guest is Michelle Carr, a dream scientist and author of \"Nightmare Obscura.\" We'll continue our conversation after a short break. This is FRESH AIR.\n\n(SOUNDBITE OF TODD SICKAFOOSE'S \"PAPER TROMBONES\")\n\nMOSLEY: This is FRESH AIR. And today we're talking to Michelle Carr, director of the Dream Engineering Laboratory and author of \"Nightmare Obscura.\"\n\nLet's talk a little bit about sleep engineering. Walk us through the progression. How do you help someone move from being overwhelmed by nightmares or bothered by bad dreams that keep them up at night to having some control over them?\n\nCARR: Yeah, there's a lot of different methods we can use that would fall under the umbrella of dream engineering, which is the study of ways and methods that we can use to influence the content of dreaming. You know, you can use visualization and kind of mental reflection just prior to sleep. Already that can influence the content of dreams. But increasingly, we're looking at ways to actually almost directly interface with someone's sleeping mind, you know, while they're in the lab. And to do that, we're starting to explore different types of sensory stimulation or even brain stimulation, ways of directly influencing the sleeping body and, kind of through the sleeping body, getting into someone's dreams (laughter).\n\nMOSLEY: What are some of the ways that you do that?\n\nCARR: So one of our approaches has been, it's something called targeted reactivation, which sounds complicated. But it's basically just we're pairing sensory cues with a specific learning task or lucid dream task prior to sleep. So people are basically associating different sensory cues, like a flashing light or a beeping sound, they associate those with a learning task. And then when they're in sleep, we re-present the sensory cues, so a flashing light, a beeping sound, while someone is dreaming.\n\nIn theory this is, through association, it's reactivating that memory. So what they were doing prior to sleep that's associated with that cue. And in some of our research, we're looking at actually trying to help people become lucid by using these sensory cues. Like, someone might notice their dream suddenly flashes red light or they hear this beeping sound in their dream. And we're hoping to remind them that they're dreaming. So remember you're in this experiment. We're presenting this flashing light to you, and this is a dream.\n\nMOSLEY: What's the equivalent of that at home, you know, someone preparing the sensories around their sleep before they go to bed?\n\nCARR: Yeah, there are already many techniques that can help you to have lucid dreams at home. And one of them does - it involves really paying attention to your sensory experiences. And specifically, you can try, you know, you're lying in bed, you're still, and your eyes are closed. But you try to cycle your attention through your different senses. So you try to pay attention to any visual experiences that you're having, even if your eyes are closed. And what are you hearing and what are you feeling in your body? And really paying attention. It's almost like mindfulness, is how I often think of it. You're aware of what you're experiencing. And this awareness, it's the same type of awareness that you're wanting to cultivate in the dream. So by doing this in wakefulness, you're more likely to later remember to become aware, remember to notice what you're experiencing when you're in a dream and become lucid.\n\nMOSLEY: You work so closely with sleep labs and with sleep hygiene. What do you think about the increase in the use of sleep trackers like smart rings?\n\nCARR: In general, I think a lot of people benefit from them. I mean, they can help you to keep a consistent sleep schedule and see how much sleep you're getting. The risk kind of come in that they're not always very accurate, although I think they will just get more accurate with time. But sometimes, you know, they misrepresent your sleep. And the thing is, they especially do this to people who have slightly different sleep than is typical.\n\nSo sleep trackers work really well on just normal sleep, let's call it. And if your sleep is slightly different, then it's going to be worse at judging your sleep accurately. And this can cause a problem because if you wake up and your sleep tracker tells you, you had bad sleep, you're actually going to feel worse. You're going to feel less rested, and you're going to - I mean, research shows people will even perform worse on cognitive tests just being told that they had poor sleep, even if it wasn't true.\n\nMOSLEY: Wow. Can you share a success story? Maybe someone who came to you with a nightmare or nightmares and was able to transform their sleep.\n\nCARR: Yeah. There are several examples. I guess one example was a subject who had this recurring nightmare of being chased by a really realistic tiger throughout her house. And she said she'd had this nightmare ever since she was a child. And she remembered, actually, when it was triggered when she was very young, and there was this experience of - her house had been broken into once, and that's what triggered this nightmare. And when she participated in one of our studies, over time, she was able to kind of rescript the dream through this kind of natural process of visualization. And the tiger transformed into a cartoon in one session. So it suddenly turned into this cartoon, and it reminded her of a childhood cartoon that she used to watch with this friendly tiger. So it was no longer so threatening.\n\nAnd what she realized just after that one experience is that ever since she was young, even though she didn't think about it too much, she had really always harbored this fear around being alone in her bedroom and going to sleep. And she really often avoided going to sleep because of it and didn't have a very good sleep schedule because of it. And just by shifting this one childhood nightmare that she had, it shifted her relationship to sleep. So after that, she said she was going to bed early, and she didn't feel this discomfort anymore that she always associated with sleep and dreaming.\n\nMOSLEY: Michelle Carr, this has been such a fascinating conversation. Thank you so much.\n\nCARR: Thank you for having me. I've really enjoyed this conversation.\n\nMOSLEY: Michelle Carr is the author of \"Nightmare Obscura.\" Coming up, TV critic David Bianculli reviews the second season of the Netflix show \"A Man On The Inside.\" This is FRESH AIR.\n\n(SOUNDBITE OF CHARLIE HUNTER'S \"MESTRE TATA\")\n\nCopyright © 2025 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\n\nAccuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.",
  "summary": "Sleep scientist Michelle Carr has spent years researching dreaming. She explains dream engineering, including  how sensory inputs like light, sound and vibration can influence the subconscious.",
  "published": "Thu, 20 Nov 2025 11:41:44 -0500",
  "url": "https://www.npr.org/2025/11/20/nx-s1-5609173/nightmare-obscura-author-explains-how-to-take-control-of-your-dreams",
  "source": "NPR Topics: News"
}