{
  "title": "JDU flags PM role in win, says Modi PM and Nitish CM is ‘Bihar dream’",
  "text": "A day after the NDA’s landslide win in the Bihar Assembly elections, JD(U) national working president Sanjay Jha on Saturday told The Indian Express in an interview that “for Bihar, having Modi as the PM and Nitish Kumar as the CM is a dream combination” and “there is no confusion within the NDA” on the CM question. Union Minister Chirag Paswan, whose party LJP (RV) won 19 of the 28 seats it contested as part of the NDA, too, said that he “personally” feels Nitish should continue to head the government\n\nJha said the “double-engine” government was one of the reasons for the party’s victory. “For Bihar, having Modi as the PM and Nitish Kumar as the CM is a dream combination. People thought this was Bihar’s moment. Both the 2024 and 2025 Union Budgets had significant allocations for Bihar. The PM was in Bihar almost every month in the past couple of years, launching or announcing some project. This played a role,” he said.\n\nAdvertisement\n\nAsked if Nitish would take oath as CM for a record 10th time, he said, “Things will be clear when the time comes. Internally, there is no confusion within the NDA.”\n\n‘The JD(U) national working president said the credibility of a leader was important. “The work that Nitish Kumar ji did in the past 20 years… delivering governance, progress and safety… that delivery is visible on the ground. So when he made promises, people believed they would be delivered,” he said.\n\n“The credit for this (decisive mandate) goes to Nitish Kumar. This party was formed in 1994 against the misrule of the RJD. It was erected with the blood and sweat of Nitish Kumar. All socialist parties became dynastic. Only Nitish Kumar did not promote family. Or else I wouldn’t have been here. Also, party workers have worked very hard,” said the JD(U) leader.\n\nAdvertisement\n\nAlso praising Chirag’s role in the win, Jha said the result was the outcome of the NDA contesting the election as a united force. “And it includes Chirag Paswan. Otherwise, crossing the 200 mark would not have been possible. So all alliance partners have contributed,” he said.\n\nEarlier in the day, Paswan told reporters at a press conference in Patna, “It is for the legislators to decide who should be the next CM or the Deputy CM. I personally feel that Nitish Kumar should continue to head the government.” He accused the Opposition of creating a “false narrative” that he was not on good terms with Nitish. In the 2020 elections, the Chirag-led LJP, then undivided, contested the election on its own and was blamed for damaging the JD(U) in several seats and causing it to drop to third on the tally list behind the RJD and the BJP.\n\nThe Hajipur MP, who met the CM earlier in the day to congratulate him on the NDA’s performance, said, “Representatives of my party today met Nitish Kumar to congratulate him on the victory. Yes, we too are looking forward to joining the government. Earlier, we used to say that we support the government but are not a part of it. But that was because we had no representation in the state legislature.”",
  "summary": "",
  "published": "Sat, 15 Nov 2025 22:31:33 +0000",
  "url": "https://indianexpress.com/article/india/jdu-flags-pm-role-in-win-says-modi-pm-and-nitish-cm-is-bihar-dream-10368323/",
  "source": "India | The Indian Express"
}