{
  "title": "Oneohtrix Point Never: Tranquilizer review | Alexis Petridis's album of the week",
  "text": "It should come as no surprise that the new album by Oneohtrix Point Never comes with a concept attached. They usually do. When not composing film soundtracks, or producing an eclectic range of other artists – the Weeknd, Anohni, Charli xcx, Soccer Mommy – Daniel Lopatin has released a string of acclaimed works, each with their own overarching idea.\n\nThe “hyperreal world music” of 2010’s Returnal was inspired by the fact that people now see more of the world than ever without actually leaving their homes. In 2015, Garden of Delete had an accompanying origin story about an adolescent humanoid alien called Ezra; 2018’s Age Of imagined artificial intelligence attempting to recreate human culture after humans themselves had been rendered extinct. Lopatin also has an all-consuming obsession with nostalgia and forgotten pop cultural artefacts: he’s made albums based around warped loops of 80s pop hits, preset sounds on obsolete synthesisers and recordings of US radio stations changing formats, discarding the musical genres in which they previously specialised in favour of the current vogue.\n\nView image in fullscreen The artwork for Tranquilizer. Photograph: Warp Records\n\nAll of which makes Tranquilizer very much in the Oneohtrix Point Never wheelhouse. It feels not unlike a sequel to Replica, released 14 years ago. On that album, Lopatin drew on sounds from a collection of bootleg DVDs he bought online compiling old TV adverts from the 80s and 90s. Tranquilizer is constructed from a cache of old sample CDs – pre-packaged collections of royalty-free sounds that used to be sold to musicians and producers in the 90s and early 00s – that Lopatin found uploaded to the Internet Archive. An extra frisson came when, after bookmarking the page for future use, he discovered that it had been deleted. It subsequently reappeared, but it underlined the shakiness of the assumption that everything is preserved for ever in some corner of cyberspace.\n\nThere was something disorienting about the music on Replica, not least its use of minute snatches of spoken word: you’d hear the intake of breath and the first syllable of a voiceover, but the rest of the sentence would never appear, just a tiny fragment of its opening, looping or juddering. There’s something similarly unsettled about Tranquilizer. Sample CDs were frequently compiled along genre lines, labelled for use in drum’n’bass, or hip-hop, or house: from the start, the sounds on Tranquilizer strongly suggest that the CDs Lopatin downloaded were intended for those making ambient or new age music. For Residue opens with the sound of the ocean, some big, Pink Floyd-y guitar chords, wordless breathy vocals and thick, warm electronic tones. Elsewhere, you hear such obvious 90s ambient signifiers as tinkling windchime-like tones, Satie-esque piano figures, slow-paced non-specific “tribal” drums, the crackle of old vinyl and snatches of muted trumpet that recall the sound of late Brian Eno collaborator Jon Hassell. The synthesisers at the end of Modern Lust, meanwhile, are a dead ringer for those used on the KLF’s landmark album Chill Out.\n\nOneohtrix Point Never: Dis – video\n\nDespite its title, Tranquilizer never feels particularly recumbent. Rather, it lulls the listener into a false sense of security with the familiarity of its sounds, then throws you for a loop. Sometimes the effect is straightforwardly unsettling, as when the patterns of the sounds on Bumpy run jarringly out of time, like a stuck record, or abruptly switch and change on Vestigel; or bend in pitch, lending a sickly, lightheaded air to Lifeworld. Sometimes the effect is overwhelming and euphoric: the shift during Rodl Glide, where a slow ooze of sound is dramatically replaced by full-on rave dynamics, or the sudden eruption of chattering synths midway through Dis. (In a startlingly Proustian period detail for listeners of a certain age, the track is also disrupted by the sound of speaker interference caused by an old 2G mobile phone.) Over five and half minutes, closer Waterfalls moves from windswept empty landscapes to busy urban propulsion, from passages that sound like the Japanese new age music collected on Visible Cloaks’ celebrated 2010 mix series Fairlights, Mallets and Bamboo to a burst of something that resembles an early 80s kids TV theme: the effect is heady and exhausting rather than relaxing.\n\nFor all the calm its source material was ostensibly intended to provoke, the record spends an hour in constant, agitated motion: chillout music transposed into an era where it’s increasingly difficult to chill out, where the constant bombardment of content and the dopamine hit of doomscrolling has made relaxing something we have to work at. Tranquilizer seems unlikely to help you calm down. It’s too kaleidoscopic and restless, too crammed with sounds: an album that demands – and repays – your full attention, rather than simply drifting by.\n\nThis week Alexis listened to\n\nGans – This Product Dub\n\nRaucous punky Brummie duo – and producer Ross Orton – rework a track from their debut album Good for the Soul into a potent, left-field dancefloor gem.",
  "summary": "<p><strong>(Warp)</strong><br />Made using a cache of Y2K sample CDs that Daniel Lopatin salvaged from the internet’s fringes, the kaleidoscopic result speaks to contemporary information overload</p><p>It should come as no surprise that the new album by Oneohtrix Point Never comes with a concept attached. They usually do. When not composing film soundtracks, or producing an eclectic range of other artists – the Weeknd, Anohni, Charli xcx, Soccer Mommy – Daniel Lopatin has released a string of acclaimed works, each with their own overarching idea.</p><p>The “hyperreal world music” of 2010’s Returnal was inspired by the fact that people now see more of the world than ever without actually leaving their homes. In 2015, Garden of Delete had an accompanying origin story about an adolescent humanoid alien called Ezra; 2018’s Age Of imagined artificial intelligence attempting to recreate human culture after humans themselves had been rendered extinct. Lopatin also has an all-consuming obsession with nostalgia and forgotten pop cultural artefacts: he’s made albums based around warped loops of 80s pop hits, preset sounds on obsolete synthesisers and recordings of US radio stations changing formats, discarding the musical genres in which they previously specialised in favour of the current vogue.</p> <a href=\"https://www.theguardian.com/music/2025/nov/20/oneohtrix-point-never-tranquilizer-review-uncanny-ambient-music-for-an-agitated-era\">Continue reading...</a>",
  "published": "Thu, 20 Nov 2025 12:00:09 GMT",
  "url": "https://www.theguardian.com/music/2025/nov/20/oneohtrix-point-never-tranquilizer-review-uncanny-ambient-music-for-an-agitated-era",
  "source": "The Guardian"
}