{
  "title": "NHS hours from PPE running out in Covid - Hancock",
  "text": "NHS hours from PPE running out in Covid - Hancock\n\nAsked about reports that some nurses had to wear binbags early in the Covid crisis, he said the NHS needed to “learn the lessons of what went wrong” and put in place “better stockpiles” for the future.\n\nHe stated there was never a “national shortage” of PPE for healthcare workers but “in some places, they did run out - and it was awful”.\n\nThe former health secretary was giving evidence for the third time at the Covid inquiry , about the impact on healthcare systems.\n\nThe NHS in England came within “six or seven hours” of running out of gowns and other protective equipment during the Covid pandemic, Matt Hancock has said.\n\nOn Thursday, the inquiry’s chair, Baroness Hallett, had to occasionally interrupt the hearing to tell bereaved families in the public gallery - some of whom were clearly highly emotional - to lower photographs of their deceased relatives.\n\nMr Hancock - who was health secretary at the start of the pandemic in 2020 - will be giving evidence over two days, as the inquiry investigates the impact on the NHS and healthcare across all four UK nations.\n\n'Left to die'\n\nEarlier, the former MP faced robust questioning about the squeeze on facilities many hospitals had endured at the peak of the two most significant waves of Covid.\n\nIn March 2020, Mr Hancock said he was “petrified” newly announced lockdown rules might not be stringent enough to avoid a repeat of scenes in northern Italy, where some Covid patients had struggled to access any care.\n\nBut while some hospitals in England came under “extraordinary pressure”, the wider NHS system was never overwhelmed, he added.\n\nMr Hancock was then asked about the case of Suzie Sullivan, who died of Covid in 2020.\n\nMedical notes written at the time stated Suzie was not suitable for a transfer to intensive care due to a pre-existing heart condition and having Down's syndrome. Her father, John, told an earlier session of the inquiry she was “left to die” because of her disability.\n\nMr Hancock accepted that a bed in intensive care could not be found for every individual patient who needed it at the height of the pandemic.\n\n“Of course there was enormous pressure, and of course, it has consequences,” he said.\n\nHe said, at times, staff ratios had to be stretched, meaning specialist critical care nurses had to look after six patients rather than give the one-to-one care they would in normal times.\n\nBut he added: “What we successfully avoided, was an overall rationing - to say, 'people, according to these characteristics, aren’t going to be cared for'.”\n\n“That’s what would have happened if we had let the virus get more out of control.\n\n“Did people get as good care as they would have done in normal times? Of course not. There was a pandemic,” he told the inquiry.\n\nAsked about the imposed visiting restrictions, which meant some relatives could not be with dying family members in their final hours, and elsewhere, expectant fathers could not attend ante-natal scans, he said “on balance” he believed the government got the rules “about right”.\n\n“Where I think we got it wrong, for instance, was the way that the funeral guidance was applied on the ground - it wasn’t as had been intended.”\n\nOther witnesses, including the first minister of Wales, Eluned Morgan, and Scotland’s former health minister Jeane Freeman, have suggested some of those restrictions, or they way they were implemented, might have gone too far.",
  "summary": "Former health secretary tells inquiry some healthcare settings did run out - \"and it was awful\".",
  "published": "Thu, 21 Nov 2024 16:58:34 GMT",
  "url": "https://www.bbc.com/news/articles/ce89k5j27z1o?at_medium=RSS&at_campaign=rss",
  "source": "BBC News"
}