{
  "title": "🏀 Men's CBB Power Rankings: Arizona is No. 1",
  "text": "Philon Jr. finishes with 24 points and five assists as the No. 11 Crimson Tide takes down the No. 8 Fighting Illini in a 90-86 thriller. (1:38)\n\nOpen Extended Reactions\n\nIt's hard to move a No. 1 team down if it doesn't lose -- especially when that No. 1 team just went on the road and knocked off another top-five or top-six team. It takes, frankly, a special résumé.\n\nBut that's what Arizona has accomplished through the first five games of its season, following Wednesday's true road win over UConn. Tommy Lloyd's team now has wins over Florida, UCLA and UConn, all away from home. According to ESPN Research, the Wildcats are just the third team in AP Poll history to have multiple wins over top-three opponents in their first five games of the season -- and the first since Kansas did it in the 1989-90 season.\n\nThe Wildcats have the most ranked wins in the country and the most impressive catalog of wins away from home, and they've shown the ability to beat teams playing different styles and with different players carrying the load.\n\nPurdue will look to boost its own profile and regain its perch atop the sport in December when it faces Iowa State and Auburn, while Arizona has contests against Auburn and Alabama on back-to-back weekends. Houston could also make an argument for the top spot if it wins the Players Era Festival next week in Las Vegas.\n\nFor now, though, Arizona's impressive collection of early wins gives the Wildcats the edge for No. 1.\n\nArizona is just the third team in AP poll history to have multiple wins over top-three opponents in its first five games of the season, per ESPN Research. AP Photo/Jessica Hill\n\nPrevious ranking: 4\n\nJaden Bradley developing into one of the best point guards in the country has been arguably the biggest game changer in Arizona's terrific start to the season. He took over late in the wins over Florida and UCLA, scoring 10 straight and 7 straight points, respectively. Against UConn, Bradley had a layup with 16 seconds left to put Arizona up 3. \"When you have a point guard who is selfless and also a baller and has big enough cojones to take and make those shots at the end of a game, it's pretty special,\" Lloyd said after the game.\n\nNext seven days: vs. Denver (Nov. 24)\n\nPrevious ranking: 1\n\nThe return of Trey Kaufman-Renn has been a massive boost for the Boilermakers, with the All-American candidate picking up where he left off last season. Kaufman-Renn was integral in last week's win at Alabama (19 points, 15 rebounds, 5 assists), then was again the most productive player on the floor against Akron (17 points, 15 rebounds). He now has grabbed 15 rebounds three times in his career: in last season's penultimate game and the first two of this campaign.\n\nNext seven days: Baha Mar Championship (vs. Memphis, vs. Texas Tech or Wake Forest)\n\nPrevious ranking: 2\n\nKingston Flemings wasn't the highest-ranked of the Cougars' freshmen heading into the season, but word out of Houston indicated he was likely to be the most productive in Year 1 -- and that's been true so far. He's averaging 17.3 points and 5.3 assists, shooting 40% from 3-point range, and went for 22 points, 5 rebounds and 7 assists in Sunday's win over Auburn. Per ESPN Research, he became just the fourth freshman in the past 30 seasons to have 15 points, 5 rebounds and 5 assists in consecutive games for the AP No. 1 team.\n\nNext seven days: vs. Rider (Nov. 20), Players Era Festival (vs. Syracuse, vs. Tennessee)\n\nplay 1:17 Houston Cougars vs. Auburn Tigers: Game Highlights Houston Cougars vs. Auburn Tigers: Game Highlights\n\nPrevious ranking: 6\n\nA win, in Chicago, over Illinois, less than two weeks after a win over St. John's at Madison Square Garden? Alabama is ahead of schedule. Labaron Philon Jr. bounced back from his up-and-down performance against Purdue to finish with 24 points, 5 assists and just 1 turnover, constantly putting Illinois' ball-screen defense in problematic situations. And the X factor for Nate Oats' team Wednesday was Tarleton State transfer Keitenn Bristow, who missed the first three games of the season with an ankle injury. Bristow came off the bench to post 10 points and 8 rebounds, giving the Tide a real boost with his motor.\n\nNext seven days: Players Era Festival (vs. Gonzaga, vs. UNLV)\n\nPrevious ranking: 3\n\nThe absence of Tarris Reed Jr. was a clear factor in the loss to Arizona on Wednesday, but the Huskies' rebounding issues against the Wildcats weren't necessarily a new development. The Huskies also struggled to prevent BYU from getting to the offensive glass in Saturday's win against the Cougars and are sub-200 nationally in offensive rebounding percentage. That is notable, given the Huskies have ranked in the top 25 nationally in offensive rebounding percentage in each of the past six seasons.\n\nNext seven days: vs. Bryant (Nov. 23)\n\nPrevious ranking: 5\n\nAmid all the hype surrounding Mikel Brown Jr. and the Louisville guards, the Cardinals are also getting incredible mileage out of their unheralded frontcourt. Germany native Sananda Fru has been quietly one of the best international additions of the season, scoring in double-figures in three of four games and averaging 11.3 points and 6.3 rebounds through the first couple weeks.\n\nNext seven days: at Cincinnati (Nov. 21), vs. Eastern Michigan (Nov. 24), vs. NJIT (Nov. 26)\n\nPrevious ranking: 11\n\nAfter Tuesday's Champions Classic, Kansas coach Bill Self was asked to compare this year's Duke team to last year's version, which the Jayhawks played around this same time a year ago. While he acknowledged that the 2024-25 roster had \"undeniable\" talent (see: Cooper Flagg), he had high praise for the 2025-26 group. \"I actually thought this year's Duke team was playing better than last year's Duke team in early November,\" Self said. \"I actually thought their execution and ball movement and all that stuff was better this time than it was last year at this time.\"\n\nNext seven days: vs. Niagara (Nov. 21), vs. Howard (Nov. 23)\n\nplay 1:15 Kansas Jayhawks vs. Duke Blue Devils: Game Highlights Kansas Jayhawks vs. Duke Blue Devils: Game Highlights\n\nPrevious ranking: 21\n\nIf Michigan State can shoot like it did in Tuesday's win over Kentucky, look out, Big Ten. The Spartans went 11-for-22 from 3-point range after going just 13-for-60 in their first three games -- they set a season-high in made 3s with more than 26 minutes left in the game. More importantly, coach Tom Izzo received the wing production Michigan State looked like it was lacking entering the season. Kur Teng had a breakout performance with 15 points, while Trey Fort contributed 13.\n\nNext seven days: vs. Detroit Mercy (Nov. 21), Fort Myers Tip-Off (vs. East Carolina, vs. North Carolina)\n\nplay 0:49 Highlight: Kentucky falls to Michigan State in Champions Classic The Wildcats shoot 35 percent from the field against the Spartans' 50 percent as they struggle to keep up in the 83-66 loss in Madison Square Garden.\n\nPrevious ranking: 9\n\nAs Florida's guards continue to get acclimated, the Gators' frontcourt will have to continue to carry them in the early season -- and it's been more than just Thomas Haugh and Alex Condon. Starting center Rueben Chinyelu had one of the best games of his career against Miami this past Sunday, finishing with 16 points, 10 rebounds and 2 blocks less than a week after a 10-point, 16-rebound performance against Florida State.\n\nNext seven days: vs. Merrimack (Nov. 21)\n\nPrevious ranking: 8\n\nThere aren't too many more explosive offenses than Alabama, but Illinois showed some real defensive deficiencies against the Crimson Tide on Wednesday night. Alabama scored more than 1.14 points per possession and created issues with its ball-screen actions throughout the game. Illinois guard Kylan Boswell is a terrific individual defender, but the majority of Brad Underwood's rotation isn't the quickest or most mobile laterally at that end of the floor. Labaron Philon Jr. is a special player, so caveats apply, but it's something to monitor.\n\nNext seven days: vs. LIU (Nov. 22), vs. UTRGV (Nov. 24)\n\nAll of ESPN. All in one place. Watch your favorite events in the newly enhanced ESPN App. Learn more about what plan is right for you. Sign Up Now\n\nPrevious ranking: 7\n\nTwo of the big keys for BYU moving forward will be the statuses of Keba Keita and Kennard Davis Jr. Keita left this past Saturday's game against UConn after a hard collision, while Davis was cited for driving under the influence and marijuana possession last week -- he was held out of the matchup with the Huskies due to a violation of team rules; his availability moving forward is in question. Upcoming games against Wisconsin, Miami and either Georgetown or Dayton will provide stern tests, especially if the Cougars are shorthanded.\n\nNext seven days: vs. Wisconsin (Nov. 21)\n\nPrevious ranking: 13\n\nMark Few is still figuring out his best lineup, and he opted for a new starting group on Monday against Southern Utah. He went with freshman point guard Mario Saint-Supery instead of Braeden Smith, who started the first four games, and opted for talented scorer Tyon Grant-Foster over top defender Emmanuel Innocenti. The competition wasn't the best barometer, but Saint-Supery was terrific with 16 points, 7 assists and 6 steals.\n\nNext seven days: Players Era Festival (vs. Alabama, vs. Maryland)\n\nPrevious ranking: 10\n\nWednesday's win against Middle Tennessee finally brought out the Yaxel Lendeborg that Michigan thought it signed up for when it landed the UAB transfer. Lendeborg had gotten off to a slow start in Ann Arbor, averaging 11.7 points and 6.3 rebounds in his first three games. But on Wednesday, he looked like the incredibly productive player he had been the past couple of seasons, finishing with 25 points, 12 rebounds and 3 assists, shooting 9-for-11 from the field and making a pair of 3s.\n\nNext seven days: Players Era Festival (vs. San Diego State, vs. Auburn)\n\nThe enhanced ESPN App Watch your favorite events in the newly upgraded ESPN App. Learn more about what plan is right for you. Sign Up Now\n\nPrevious ranking: 12\n\nAfter St. John's had problems getting consistent playmaking and creation from its backcourt in the Nov. 8 loss to Alabama, Rick Pitino made a lineup change against William & Mary last Saturday. Idaho State transfer Dylan Darling, who missed that game against the Tide with an injury, was given a starting spot -- he responded with a stellar performance of 13 points, 5 rebounds, 3 assists and 4 steals. Darling isn't as explosive as Ian Jackson or Joson Sanon, but could provide a better halfcourt initiator.\n\nNext seven days: vs. Bucknell (Nov. 20), Players Era Festival (vs. Iowa State, vs. Baylor)\n\nPrevious ranking: 14\n\nLuke Bamgboye's arrival at Texas Tech after transferring from VCU wasn't met with a huge amount of hoopla, but the 6-foot-11 England native was considered one of the elite rim protectors in the country last season. He missed the first three games of this campaign with an injury but returned to play 13 minutes against Milwaukee, blocking four shots in his brief debut. Bamgboye, who ranked second nationally in block rate last season, should dramatically upgrade Tech's interior defense.\n\nNext seven days: Baha Mar Championship (vs. Wake Forest, vs. Purdue or Memphis), vs. New Orleans\n\nPrevious ranking: 16\n\nNorth Carolina's 12-point win over Navy on Tuesday was arguably the Tar Heels' worst performance of the season thus far, but it was another example of Caleb Wilson's incredible start to his college career. The freshman finished with 23 points, 12 rebounds, 3 blocks and 4 steals, and was able to singlehandedly keep the Midshipmen at bay when they were cutting into the lead. He can also take flight.\n\nNext seven days: Fort Myers Tip-Off (vs. St. Bonaventure, vs. Michigan State)\n\nplay 0:18 Caleb Wilson with the massive stuff at the rim Caleb Wilson gets up for the rejection\n\nPrevious ranking: 18\n\nIowa State rolls into next week's Players Era Festival playing some of the best defense of the T.J. Otzelberger era. Under Otzelberger, the Cyclones have routinely ranked near the top of the charts in defensive turnover percentage, but they're taking it to a new level this season -- they now rank first nationally, forcing turnovers on 28.4% of their defensive possessions. And while it's boosted by a soft early-season schedule, their best performance in that area came against Mississippi State, which gave it away on 34.3% of its possessions.\n\nNext seven days: Players Era Festival (vs. St. John's, vs. Creighton)\n\nPrevious ranking: 20\n\nTennessee's schedule is about to level up after a soft opening slate of games. After Thursday's game against Tennessee State, the Volunteers head to the Players Era Festival. They should beat Rutgers, but then they face Houston and a to-be-determined third opponent in Las Vegas before rolling into more non-conference games against Syracuse, Illinois and Louisville. This stretch will be an opportunity for Nate Ament (19.8 PPG, 9.0 RPG) to cement his place among the other stars in a loaded freshmen class.\n\nNext seven days: vs. Tennessee State (Nov. 20), Players Era Festival (vs. Rutgers, vs. Houston)\n\nplay 0:18 Nate Ament throws down big flush vs. North Florida Ospreys Nate Ament throws down big flush vs. North Florida Ospreys\n\nPrevious ranking: 17\n\nArkansas struggled to beat Samford and Winthrop this past week, winning both games by a combined five points and needing a furious final-minute comeback to beat the Eagles -- not the ideal preparation for games against Duke and Louisville in the next two weeks. The Razorbacks' defense has been especially porous, allowing Samford and Winthrop to make a combined 25 3-pointers and score a combined 1.10 points per possession.\n\nNext seven days: vs. Jackson State (Nov. 21)\n\nPrevious ranking: 19\n\nDespite a close loss to Arizona on Friday, Bruins coach Mick Cronin opted for wholesale changes to his starting lineup against Sacramento State. Only Eric Dailey kept his place from Friday's game. \"The guys that started the game set the tone; that's what they did in practice yesterday when they won by 20,\" Cronin told media after the game. He still didn't seem pleased with certain facets of the 31-point win, particularly on the defensive glass, so time will tell if he returns to his usual five moving forward.\n\nNext seven days: vs. Presbyterian (Nov. 21), at California (Nov. 25)\n\nPrevious ranking: 23\n\nAnother team ready to jumpstart its schedule is Wisconsin, which has faced the No. 337 toughest slate so far, according to KenPom. But the Badgers now face a six-game stretch against teams all ranked inside the top 70 at KenPom: BYU, Providence, Northwestern, Marquette, Nebraska and Villanova. Wisconsin is still likely to be favored in all but one or two of those games, but we'll have a better idea of Greg Gard's team one month from now.\n\nNext seven days: at BYU (Nov. 21)\n\nPrevious ranking: 24\n\nIt hasn't taken long for Darrion Williams to show why he was such a sought-after player in the portal -- and a critical get for Will Wade and the Wolfpack. In his past two games, the Texas Tech transfer has totaled 60 points and 17 rebounds while shooting 21-for-34 from the field and 8-for-12 from 3-point range. They were the type of performances Williams produced down the stretch of last season, when he led the Red Raiders to the Elite Eight and averaged 23.7 points, 6.7 rebounds and 3.0 assists in his final three tourney games.\n\nNext seven days: Maui Invitational (vs. Seton Hall in the quarterfinals)\n\nplay 0:14 Darrion Williams nails the 3-pointer vs. UNC Greensboro Spartans Darrion Williams nails the 3-pointer vs. UNC Greensboro Spartans\n\nPrevious ranking: 22\n\nThrough the first four games of the season, Keyshawn Hall was looking like one of the elite transfers in college basketball. The well-traveled former UCF forward averaged 23.3 points and 11.0 rebounds in that stretch, tallying three double-doubles and scoring at least 20 points in each game. But he suffered what Steven Pearl called a lateral ankle and foot sprain in Auburn's loss to Houston and didn't play in Wednesday's win over Jackson State. His timetable to return is undetermined.\n\nNext seven days: Players Era Festival (vs. Oregon, vs. Michigan)\n\nPrevious ranking: 15\n\nKentucky has been the most disappointing team in the country through the first two weeks of the season, especially given the way the Wildcats handled Purdue in an October exhibition game. Jaland Lowe's injury has contributed to the struggles, but getting dominated in every facet by Michigan State a week after trailing by as many as 20 points against Louisville doesn't come down to absence of one player. The offensive issues are one factor, but the lack of fight on the defensive end and on the glass were arguably more concerning. Teams are simply getting too many open 3s, and Michigan State had its way on the offensive glass on Tuesday.\n\nNext seven days: vs. Loyola Maryland (Nov. 21), vs. Tennessee Tech (Nov. 26)\n\nPrevious ranking: Unranked\n\nWe don't have the exact stats to prove it, but there's a strong chance this is the first time Georgetown has appeared in ESPN's Power Rankings in more than a decade. The Hoyas are off to a 4-0 start, complete with a couple quality wins on the road at Maryland and at home against Clemson. The early-season start for Ed Cooley has been Arizona transfer KJ Lewis, who is averaging 19.0 points, 7.0 rebounds and 2.5 steals and finished with 26 points and 5 steals against Clemson.\n\nNext seven days: vs. Wagner (Nov. 22)\n\nDropped out: Ohio State Buckeyes (No. 25)",
  "summary": "The Wildcats added another statement win to their early-season résumé, headlining this week's top-25 risers.",
  "published": "Thu, 20 Nov 2025 23:07:46 EST",
  "url": "https://www.espn.com/mens-college-basketball/story/_/id/47027058/mens-college-basketball-power-rankings-top-25-arizona-uconn",
  "source": "www.espn.com - TOP"
}