{
  "title": "Overseas-trained doctors leaving the UK in record numbers",
  "text": "Record numbers of overseas-trained doctors are quitting the UK, leaving the NHS at risk of huge gaps in its workforce, with hostility towards migrants blamed for the exodus.\n\nIn all, 4,880 doctors who qualified in another country left the UK during 2024 – a rise of 26% on the 3,869 who did so the year before – figures from the General Medical Council reveal.\n\nNHS leaders, senior doctors and the GMC warned that the increased denigration of and abuse directed at migrants in the UK was a significant reason for the rise in foreign medics leaving.\n\n“It’s really worrying that so many highly skilled and highly valued international doctors the NHS just can’t afford to lose are leaving in their droves,” said Daniel Elkeles, the chief executive of the hospitals group NHS Providers.\n\n“We wouldn’t have an NHS if we hadn’t for many years recruited talented and valued people from all around the world. The diversity of the NHS workforce is one of its biggest strengths.”\n\nDr Amit Kochhar, chair of the British Medical Association’s representative body, said: “Doctors who trained abroad have long made up a significant sector of the NHS workforce, and medical care in the UK would have long since withered away without them.\n\n“But as we warned last month along with other trade unions, a sustained campaign of anti-migrant rhetoric is leaving many doctors with a migrant background considering if it is worth staying.”\n\nWes Streeting, the health secretary, voiced alarm this month that NHS staff were bearing the brunt of a return to 1970s and 1980s-style racism in Britain where it is “socially acceptable to be racist”.\n\nThe rise in overseas doctors quitting coincided with a levelling-off in the number coming to work in Britain, the medical regulator’s annual report on the state of medical education and practice in the UK for 2024 showed. The 20,060 who joined the UK medical register last year were only a few more than the 19,629 who did so in 2023 and formed the smallest increase since 2020.\n\nThe GMC’s findings have raised concern because the NHS is so heavily reliant on doctors from elsewhere – 42% of its entire medical workforce qualified overseas.\n\nDoctors are a “mobile workforce” with skills that are in demand around the world, said Charlie Massey, the GMC’s chief executive.\n\n“Internationally qualified doctors who have historically chosen to work in the UK could quite conceivably choose to leave if they feel they have no future job progression here, or if the country feels less welcoming,” he said.\n\n“Any hardening of rhetoric and falling away of support could undermine the UK’s image as somewhere the brightest and the best from all over the would want to work.”\n\nThe Royal College of Nursing last month highlighted a big recent surge in nurses suffering racist abuse at work.\n\nThe plateauing in foreign doctors coming to the UK may be because such medics are finding it harder to get a job, the GMC said. Only one in eight who became registered in the UK last year “connected to a designated body” – ie, got a post within the NHS – within six months, statistics showed. That was down on the one in five who did so in 2023 and one in four in 2022.\n\nThe shortage in places available for early-career doctors to start training in their chosen medical specialism has prompted the government to allocate more of them to UK-trained medics.\n\nBut the GMC’s report warns ministers that that approach, allied to the difficulty of finding a job, may prove misguided by discouraging overseas doctors from relocating to the UK.\n\n“It is vital that workforce policies across all four [UK] countries do not inadvertently demoralise or drive out the talent on which our health services depend”, wrote Massey and the GMC chair, Prof Carrie MacEwen.",
  "summary": "<p>Medical bodies warn that hostility towards migrants is behind a 26% rise in departures that imperils NHS </p><p>Record numbers of overseas-trained doctors are quitting the UK, leaving the NHS at risk of huge gaps in its workforce, with hostility towards migrants blamed for the exodus.</p><p>In all, 4,880 doctors who qualified in another country left the UK during 2024 – a rise of 26% on the 3,869 who did so the year before – figures from the General Medical Council reveal.</p> <a href=\"https://www.theguardian.com/society/2025/nov/21/overseas-trained-doctors-leaving-uk-record-numbers\">Continue reading...</a>",
  "published": "Fri, 21 Nov 2025 00:01:55 GMT",
  "url": "https://www.theguardian.com/society/2025/nov/21/overseas-trained-doctors-leaving-uk-record-numbers",
  "source": "The Guardian"
}