{
  "title": "How does Arsenal defence compare to Premier League's best?",
  "text": "There is some fierce competition for that crown but, statistically, the Gunners are right up there.\n\nNearly a third of the way through the campaign, they are conceding 0.45 goals per game. If they maintain that rate they will concede 17 goals over the 38 games.\n\nChelsea's 2004-05 title-winning side hold the record at 15, with Arsenal's vintage in 1998-99 conceding 17, but finishing trophyless.\n\nThe next tightest defence is the 2007-08 Manchester United side and Liverpool in 2018-19, who both conceded 22 goals.\n\nThere is a long way still to go for Arsenal, but if the backline of Jurrien Timber, William Saliba, Gabriel Magalhaes and Riccardo Calafiori - with keeper David Raya behind them - stay fit and solid, then they've got every chance of being talked about among this quartet.\n\nThat is a big if though, with fears Gabriel could be sidelined until January after being injured on Brazil duty, while Italy international Calafiori also has a problem that needs to be assessed.\n\nThe Gunners also have the best defensive record in Europe's top five leagues this term, with the fewest goals conceded, fewest shots on target faced and most clean sheets.\n\nThey have allowed only 21 shots on target in the Premier League this season, including three across their last five matches. Their average of 1.9 shots on target faced per game is the lowest since Opta's records began in 2003-04.\n\nYou have to go back to September and October 1987 for the last time Arsenal bettered this season's record of four successive league games without letting in a goal.\n\nThat came under manager George Graham in an era that inspired the famous \"1-0 to the Arsenal\" chant to serenade a team with the kind of defensive resilience that Arteta's men are replicating.\n\nSunderland's strikes, from Dan Ballard and an injury-time Brian Brobbey equaliser, denied them the chance to beat Manchester United's Premier League record of 14 consecutive clean sheets, achieved back in 2008-09.\n\nMeanwhile, Liverpool are the record holders for clean sheets in the Premier League era across all competitions, having gone 11 straight games without conceding under Rafael Benitez in 2005-06.\n\nFormer Arsenal centre-back Martin Keown, who was part of the club's 1998-99 side, wrote in his BBC Sport column: \"We can see with our own eyes how good the defence is.\n\n\"The only thing missing from their CV is trophies.\n\n\"If they could be champions, they reach that elite level alongside these past title-winning teams.\"",
  "summary": "Where do Arsenal's back four rank in terms of the best ever in the Premier League?",
  "published": "Thu, 20 Nov 2025 10:50:22 GMT",
  "url": "https://www.bbc.com/sport/football/articles/ced6ezpzpj9o?at_medium=RSS&at_campaign=rss",
  "source": "BBC Sport"
}