{
  "title": "Paradromics Gets FDA Approval to Trial Its Brain Implant in People",
  "text": "Brain implant developer Paradromics has received approval from the US Food and Drug Administration to test its device in an early-stage human trial, the company announced Thursday.\n\nThe Austin-based company is aiming to give a digital voice to people who have lost the ability to speak due to severe motor impairment. The trial will assess the long-term safety of the Paradromics device, as well as its ability to enable synthesized speech and text communication.\n\nParadromics is one of several companies—which include Neuralink, Synchron, Precision Neuroscience, and Cognixion—working on technology to control computers and other devices using brain waves. Known as brain-computer interfaces, or BCIs, these systems capture brain signals associated with movement intention and translate them into commands.\n\nThe Paradromics study is slated to begin early next year and include two individuals. After collecting data on the first two participants for six months, the company plans to ask the FDA to expand the study to include more volunteers.\n\n“It’s reasonable to think that someone will be communicating at 60 words per minute and be able to really sustain the conversation,” says Matt Angle, Paradromics’ CEO and founder, referring to a rate achieved by previous BCI trials led by academic groups. Normal speaking speed is between 120 and 150 words per minute.\n\nBCIs for speech restoration do not read a person’s inner thoughts. Rather, they decode certain signals from the brain’s motor cortex that are generated when a person tries to move their muscles to speak. Users are asked to attempt to say sentences out loud so that the BCI learns how to recognize those brain patterns associated with speaking.\n\n“They will just try to say words, and those words will appear very quickly on a screen. They’ll press play, and the words will be read in their own voice,” Angle says. Assuming that there is an existing recording of the participant’s voice, Angle says the company plans to generate a voice clone of that person using AI.\n\nEarlier this year, Paradromics briefly implanted its device in a person who was already undergoing brain surgery. Surgeons used an EpiPen-like instrument to insert and remove the implant. In that procedure, the device stayed in the brain for just 10 minutes and wasn’t used to restore speech. In the trial slated for next year, the device will be implanted long-term.\n\nParadromics’ implant, called the Connexus, is a metal disk smaller than the size of a dime with 421 microwire electrodes that rest in the brain tissue and record from individual neurons. By comparison, Neuralink’s implant is a quarter-sized chip that sits in the skull and has more than 1,000 electrodes across 64 tiny wires that are “threaded” into the brain by a custom-built robot. Neuralink has implanted at least 12 people around the world with its device.",
  "summary": "The Austin-based startup will test its high-bandwidth device to help restore speech in people with extremely limited movement.",
  "published": "Thu, 20 Nov 2025 13:00:00 +0000",
  "url": "https://www.wired.com/story/paradromics-gets-fda-approval-to-trial-its-brain-implant-in-people/",
  "source": "WIRED"
}