{
  "title": "Sources: Players unmoved by WNBA's proposal",
  "text": "Open Extended Reactions\n\nThe Women's National Basketball Players Association does not view the WNBA's latest collective bargaining agreement proposal as something that moves negotiations forward, sources told ESPN on Thursday, 10 days before the current CBA is set to expire.\n\nThe league's proposal, first reported by The Associated Press and confirmed by ESPN earlier this week, includes a revenue sharing component that, in combination with a base salary, would allow players to earn a maximum salary of more than $1.1 million, an average of more than $460,000 and a minimum of more than $220,000.\n\nIn 2025, the league's minimum salary was $66,079 and its supermax was $249,244.\n\nBut sources told ESPN the players' union does not believe the league's proposal includes a system where the salary cap and player salaries sufficiently grow with the business, a longstanding demand of the players since they opted out of the current CBA in October 2024.\n\nThe players do not want a fixed salary system and instead want one based more directly on revenue, such as in the NBA, where the salary cap is determined by basketball-related income (BRI).\n\nThe league previously said in a statement it has proposed \"significant guaranteed salary cap increases and substantial uncapped revenue sharing that enables player salaries to grow as the league's business grows.\" The union responded in a statement that said the proposal \"put lipstick on a pig and retread a system that isn't tied to any part of the business and intentionally undervalues the players.\"\n\nIn the current CBA, the salary cap increased annually by a fixed rate (3%), coming in at $1,507,100 in 2025, and a separate revenue sharing provision called for direct payments to players if the league hit certain revenue targets. That component has yet to be triggered over the course of the agreement.\n\nLast month, the two sides agreed to a 30-day extension -- through Nov. 30 -- on the current CBA, though both parties can terminate the agreement with 48 hours' notice. The league and union have continued to bargain over the past few weeks with a meeting as recent as Wednesday.",
  "summary": "The WNBPA believes the league's latest CBA proposal misses the mark and does not include a system where the salary cap and player salaries sufficiently grow with the business, sources told ESPN.",
  "published": "Thu, 20 Nov 2025 23:07:46 EST",
  "url": "https://www.espn.com/wnba/story/_/id/47042388/union-feels-wnba-cba-proposal-misses-key-demands",
  "source": "www.espn.com - TOP"
}