{
  "title": "Terror module crackdown: Accused doctor’s neighbour sets himself on fire after Kulgam police detain his sons, call him to station",
  "text": "A neighbour of one of the alleged members of the terror module linked to the Red Fort blast set himself on fire Sunday morning and was rushed to the Sheri Kashmir Institute of Medical Sciences (SKIMS) in Srinagar, where he is said to be in critical condition.\n\nBilal Ahmad Wani (55), a dry fruits seller, lived near the home of Dr Adeel Rather at Qazigund in south Kashmir’s Kulgam district. Rather is accused of being part of the terror module, and was arrested earlier this month from Uttar Pradesh’s Saharanpur, where he worked at a private hospital.\n\nWani’s family claimed that his son, college student Jasir Bilal, was picked up by police four days ago, and his brother, teacher Nabeel Ahmad, was picked up two days ago. On Saturday morning, the family said Wani was called to Qazigund police station. Wani returned home that night. However, his son and brother remain in police custody, the family claimed.\n\nA family member said Wani returned home visibly disturbed. “He (Wani) didn’t talk to anyone. He was very disturbed and could not even walk properly,” claimed the family member, adding, “In the morning (on Sunday), he got up and went outside. He took petrol from the car and sprinkled it on himself.” Wani then self-immolated and is critically injured, the family said.\n\nPolice in Kulgam, however, said they had not detained Wani as there was no case against him. “When his son was picked up, we called him and took details. We let him go at that moment only. None of his family members are being detained by Kulgam police,” said Kulgam Superintendent of Police Kulgam Anayat Ali Chowdhary.\n\nOn Adeel Rather, a member of Wani’s family said, “He is a neighbour and we know him. He was also a doctor, and people here would go to him.”\n\nReacting to the incident, former J&K chief minister and Peoples Democratic Party president Mehbooba Mufti said “this level of highhandedness only deepens wounds and breeds despair”.\n\nStory continues below this ad\n\nMufti said the “random” picking up of young men risks driving them towards “darker paths”.\n\n“Bilal Wani, an anguished father from Wanpoh Qazigund, has set himself on fire after his son Jasir Bilal and brother Nabeel Wani were detained by the police a few days ago. Petrified about their safety, he pleaded with the authorities to just see them, which was denied,” Mufti said in a post on X.",
  "summary": "",
  "published": "Sun, 16 Nov 2025 14:10:54 +0000",
  "url": "https://indianexpress.com/article/india/terror-module-crackdown-accused-doctors-neighbour-fire-kulgam-police-10369432/",
  "source": "India | The Indian Express"
}