{
  "title": "Ride the Cyclone review – teens sing for their salvation in cult musical",
  "text": "Well, this is a peculiar musical. Jacob Richmond and Brooke Maxwell’s cult hit, which began life in a fringe theatre in Canada in 2009, has the spirit of the circus woven into its fabric. It arrives in London, quirks and all, in a wonderfully eccentric production directed by Lizzi Gee.\n\nA story about six high-school choristers sent spiralling to their demise from a rollercoaster is hardly the most conventional ground for an all-singing, all-dancing show. But as we travel with them into a space between life and death, where they are forced to compete for a second chance on Earth, the narrative gradually slips away from its morbid trappings and celebrates life.\n\nLed by a fortune teller, The Amazing Karnak (Edward Wu), who moves with the stiffness of a wind-up toy and towers above the stage, the teens are instructed to come forward, one by one, to make their case. What follows is a spectrum of musical numbers, with each contestant presenting a condensed version of their life story.\n\nOcean (Baylie Carson), the squeaky queen bee, goes first with a song celebrating herself. Noel (Damon Gould) follows with a dreamlike fantasy of high kicks and corsets. Ukrainian rebel Mischa (Bartek Kraszewski) delivers a punchy rap. Ricky (Jack Maverick), who grew up mute, transforms into a sequin-wearing god in the 70s-inspired Space Age Bachelor. The nicest girl in town, Constance (a brilliant debut from Robyn Gilbertson), discovers her love for the world just as it’s too late. Jane Doe (Grace Galloway), who was decapitated in the crash and now wears a doll’s head, performs a haunting aria for the unknown person she might have become.\n\nAfter a while, the structure begins to feel formulaic. With each character given only a fleeting moment in the limelight, there’s little time to truly get beneath their skin. Still, it’s easy to see why the show has picked up such a dedicated fanbase over the years. This is a genuinely unique musical and, with a few tweaks, it could soar.",
  "summary": "<p><strong>Southwark Playhouse Elephant, London<br /></strong>A rollercoaster accident leaves six choristers in limbo, each having to make their case for a second chance on Earth in this eccentric show</p><p>Well, this is a peculiar musical. Jacob Richmond and Brooke Maxwell’s cult hit, which began life in a fringe theatre in Canada in 2009, has the spirit of the circus woven into its fabric. It arrives in London, quirks and all, in a wonderfully eccentric production directed by Lizzi Gee.</p><p>A story about six high-school choristers sent spiralling to their demise from a rollercoaster is hardly the most conventional ground for an all-singing, all-dancing show. But as we travel with them into a space between life and death, where they are forced to compete for a second chance on Earth, the narrative gradually slips away from its morbid trappings and celebrates life.</p> <a href=\"https://www.theguardian.com/stage/2025/nov/20/ride-the-cyclone-review-southwark-playhouse-elephant-london\">Continue reading...</a>",
  "published": "Thu, 20 Nov 2025 13:10:47 GMT",
  "url": "https://www.theguardian.com/stage/2025/nov/20/ride-the-cyclone-review-southwark-playhouse-elephant-london",
  "source": "The Guardian"
}