{
  "title": "Trump defends Saudi crown prince over Khashoggi killing, threatens ABC News in White House meeting – as it happened",
  "text": "From 2d ago 20.15 GMT Summary Donald Trump welcomed crown prince Mohammed bin Salman to Washington on Tuesday, in the de facto ruler of Saudi Arabia’s first White House visit since the 2018 killing of Washington Post journalist Jamal Khashoggi by Saudi agents in Istanbul . The shocking murder caused global outrage and appeared to set the Gulf kingdom on a path to international pariah status. In 2021 US intelligence concluded that bin Salman had approved the capture or killing of Khashoggi, a fierce critic of the Saudi regime. The crown prince has denied ordering the operation but acknowledged responsibility as the kingdom’s de facto ruler. Seven years on, that shocking murder seemed a distant memory, as MBS arrived to a lavish display including fanfare, a US Marine band and a military flyover as he stepped onto the South Lawn of the White House to meet Trump.\n\nTalking to reporters in the Oval Office, the US president brushed off questions from a reporter about MBS’s role in Khashoggi’s killing, saying “things happen” . “You’re mentioning somebody that was extremely controversial,” Trump said of the murdered columnist, before going on to contradict US intelligence on the Saudi crown prince’s role in the affair. “A lot of people didn’t like that gentleman that you’re talking about. Whether you like him, or didn’t like him, things happen. But he [bin Salman] knew nothing about it, and we can leave it at that.” While Trump castigated the reporter for the question, a calm MBS said:“It’s painful and it’s a huge mistake, and we are doing our best that this doesn’t happen again.”\n\nThe crown prince announced Saudi Arabia was raising its planned investments in the US to almost $1tn , up from $600bn that the Saudis said they planned to invest when Trump visited the kingdom in May. MBS said the kingdom has “huge demand” for computing power and desires US AI chips. Trump also said he “can see” a deal happening to transfer American nuclear technology to Saudi Arabia, but didn’t specify a timeline. Against a backdrop of subdued oil prices and MBS’s high spending on megaprojects at home, that figure is likely very unrealistic, but Trump seemed thrilled nonetheless.\n\nTrump also pushed back on the notion that there was a conflict of interest, given his family’s strong personal interest in the kingdom. “I have nothing to do with the family business,” said Trump, adding that his family has relatively little interest in the kingdom. In September, London real estate developer Dar Global announced that it plans to launch Trump Plaza in the Red Sea city of Jeddah. It’s Dar Global’s second collaboration with the Trump Organization, the collection of companies controlled by Trump’s children, in Saudi Arabia. Last year, the two companies announced the launch of Trump Tower Jeddah.\n\nTrump confirmed that he had agreed to sell the Saudis F-35 fighter jets despite some concerns within the administration that the sale could lead to China gaining access to the US technology behind the advanced weapon system. The agreement will be similar to the one the US has with Israel, which is significant as until now Israel has been the only country in the Middle East to have the jets. The move has the potential to alter the military balance in the region. As Politico noted earlier: “A major arms deal would signal a sea change in the US approach to Saudi Arabia: No longer would deeper ties between the two countries be so dependent on Saudi Arabia normalising relations with Israel.”\n\nOn that subject, MBS made clear that normalisation with Israel (i.e. Saudi Arabia joining the Abraham Accords, which Trump really wants) could not happen without first securing a clear path towards a two-state solution. The crown prince said he wants Israelis and Palestinians “to coexist peacefully” in the region. Trump has been trying to nudge the Saudis to join the accords for some time and said today he felt he’d had a “positive response”. But it’s worth remembering that Israel, meanwhile, remains steadfastly opposed to the creation of a Palestinian state.\n\nTrump will return to the South Lawn later, with first lady Melania, to welcome the crown prince when he returns for the evening East Room dinner. In addition to today’s White House pomp, the two nations are also planning an investment summit at the Kennedy Center on Wednesday that will include the heads of Salesforce, Qualcomm, Pfizer, the Cleveland Clinic, Chevron and Aramco, Saudi Arabia’s national oil and natural gas company, where even more deals with the Saudis could be announced. Share Updated at 20.17 GMT\n\n2d ago 20.15 GMT Summary Donald Trump welcomed crown prince Mohammed bin Salman to Washington on Tuesday, in the de facto ruler of Saudi Arabia’s first White House visit since the 2018 killing of Washington Post journalist Jamal Khashoggi by Saudi agents in Istanbul . The shocking murder caused global outrage and appeared to set the Gulf kingdom on a path to international pariah status. In 2021 US intelligence concluded that bin Salman had approved the capture or killing of Khashoggi, a fierce critic of the Saudi regime. The crown prince has denied ordering the operation but acknowledged responsibility as the kingdom’s de facto ruler. Seven years on, that shocking murder seemed a distant memory, as MBS arrived to a lavish display including fanfare, a US Marine band and a military flyover as he stepped onto the South Lawn of the White House to meet Trump.\n\nTalking to reporters in the Oval Office, the US president brushed off questions from a reporter about MBS’s role in Khashoggi’s killing, saying “things happen” . “You’re mentioning somebody that was extremely controversial,” Trump said of the murdered columnist, before going on to contradict US intelligence on the Saudi crown prince’s role in the affair. “A lot of people didn’t like that gentleman that you’re talking about. Whether you like him, or didn’t like him, things happen. But he [bin Salman] knew nothing about it, and we can leave it at that.” While Trump castigated the reporter for the question, a calm MBS said:“It’s painful and it’s a huge mistake, and we are doing our best that this doesn’t happen again.”\n\nThe crown prince announced Saudi Arabia was raising its planned investments in the US to almost $1tn , up from $600bn that the Saudis said they planned to invest when Trump visited the kingdom in May. MBS said the kingdom has “huge demand” for computing power and desires US AI chips. Trump also said he “can see” a deal happening to transfer American nuclear technology to Saudi Arabia, but didn’t specify a timeline. Against a backdrop of subdued oil prices and MBS’s high spending on megaprojects at home, that figure is likely very unrealistic, but Trump seemed thrilled nonetheless.\n\nTrump also pushed back on the notion that there was a conflict of interest, given his family’s strong personal interest in the kingdom. “I have nothing to do with the family business,” said Trump, adding that his family has relatively little interest in the kingdom. In September, London real estate developer Dar Global announced that it plans to launch Trump Plaza in the Red Sea city of Jeddah. It’s Dar Global’s second collaboration with the Trump Organization, the collection of companies controlled by Trump’s children, in Saudi Arabia. Last year, the two companies announced the launch of Trump Tower Jeddah.\n\nTrump confirmed that he had agreed to sell the Saudis F-35 fighter jets despite some concerns within the administration that the sale could lead to China gaining access to the US technology behind the advanced weapon system. The agreement will be similar to the one the US has with Israel, which is significant as until now Israel has been the only country in the Middle East to have the jets. The move has the potential to alter the military balance in the region. As Politico noted earlier: “A major arms deal would signal a sea change in the US approach to Saudi Arabia: No longer would deeper ties between the two countries be so dependent on Saudi Arabia normalising relations with Israel.”\n\nOn that subject, MBS made clear that normalisation with Israel (i.e. Saudi Arabia joining the Abraham Accords, which Trump really wants) could not happen without first securing a clear path towards a two-state solution. The crown prince said he wants Israelis and Palestinians “to coexist peacefully” in the region. Trump has been trying to nudge the Saudis to join the accords for some time and said today he felt he’d had a “positive response”. But it’s worth remembering that Israel, meanwhile, remains steadfastly opposed to the creation of a Palestinian state.\n\nTrump will return to the South Lawn later, with first lady Melania, to welcome the crown prince when he returns for the evening East Room dinner. In addition to today’s White House pomp, the two nations are also planning an investment summit at the Kennedy Center on Wednesday that will include the heads of Salesforce, Qualcomm, Pfizer, the Cleveland Clinic, Chevron and Aramco, Saudi Arabia’s national oil and natural gas company, where even more deals with the Saudis could be announced. Share Updated at 20.17 GMT\n\n2d ago 19.06 GMT If you’re just joining us, Donald Trump has welcomed Mohammed bin Salman to Washington, as the de facto ruler of Saudi Arabia seeks to rebrand himself as a global statesman in his first White House visit since the 2018 killing of journalist Jamal Khashoggi by Saudi agents. Trump warmly received the crown prince when he arrived at the White House this morning for a pomp-filled ceremony that included a military flyover and a thundering greeting from the US Marine band. The US-Saudi relationship had been sent into a tailspin by the operation targeting Khashoggi, a fierce critic of the kingdom, that US intelligence agencies later determined MBS likely directed the agents to carry out. But seven years later, Khashoggi was an afterthought as the two leaders unveiled billions of dollars in deals and Trump brushed off questions to the crown prince about the journalist’s gruesome murder. “Whether you like [Khashoggi] or didn’t like him, things happen,” Trump said, referring to the murdered Washington Post columnist as “extremely controversial”. “But he [bin Salman] knew nothing about it,” he said of bin Salman. Trump chastised the reporter for “embarrassing our guest” with the question and went on to commended the Saudi leader for strides made by the kingdom on human rights without providing any specific detail. “I’m very proud of the job he’s done,” Trump said. “What’s he done is incredible in terms of human rights and everything else.” View image in fullscreen Donald Trump and Mohammed bin Salman hold hands in the Oval Office. Photograph: Evelyn Hockstein/Reuters Share Updated at 19.41 GMT\n\n2d ago 18.25 GMT Trump calls for ABC's broadcasting licenses to be revoked Trump lashes out once again at a reporter’s question, calling her a “terrible reporter” and saying he believes ABC News’s broadcasting license should be revoked. The reporter had asked him why he wouldn’t just release the Epstein files rather than wait for Congress to do it. He says. I have nothing to do with Jeffrey Epstein. It’s worth noting that MBS, in comparison, has remained calm and confident in the face of tough questions. Share Updated at 18.25 GMT\n\n2d ago 18.14 GMT Trump sees potential civil nuclear deal with Saudi Arabia Trump says he “can see” a deal happening to transfer American nuclear technology to Saudi Arabia, but doesn’t specify any sort of timeline, adding it’s not urgent. Share Updated at 18.18 GMT\n\n2d ago 18.08 GMT MBS says Saudi Arabia wants to secure clear path for two-state solution before joining Abraham Accords Trump says he spoke with bin Salman about the Abraham Accords, adding that he believes he got a positive response. The crown prince adds that while Saudi Arabia wants to be part of the accords, which normalises ties with Israel, it also wants to make sure it secures a clear path for a two-state solution. He says he wants Israelis and Palestinians “to coexist peacefully” in the region. Share Updated at 18.12 GMT\n\n2d ago 18.07 GMT Trump says F-35 jets sold to Saudi will be similar to arrangement with Israel Trump says the US would sell F-35 stealth fighter jets to Saudi Arabia in a similar arrangement it has with Israel. “As far as I’m concerned, I think they are both at a level where they should get top of the line [F-35s],” he says, referring to Saudi and Israel as great allies. Israel and Saudi Arabia have never had formal diplomatic relations but have engaged in covert cooperation on issues such as Iran. Share\n\n2d ago 18.04 GMT US has reached a defense deal with Saudis, says Trump Trump says the United States has reached a defense deal with Saudi Arabia. Share\n\n2d ago 18.01 GMT Trump says he has 'nothing to do with the family business' As the Trump Organization and a Saudi developer look to open the latest Trump hotel in the Maldives, Trump is asked about a possible conflict of interest for the Trump Organization to do business with Saudi Arabia while he is president. He replies: I have nothing to do with the family business. I have left, and I’ve devoted 100% of my energy. What my family does is fine. They do business all over. They’ve done very little with Saudi Arabia actually. I’m sure they could do a lot, and anything they’ve done has been very good. Share\n\n2d ago 17.58 GMT Trump defends Mohammed bin Salman over killing of Jamal Khashoggi, claiming Saudi crown prince 'knew nothing about it' and 'things happen' An ABC reporter then addresses the elephant in the room, asking whether why Americans should trust bin Salman given that US intelligence concluded that he orchestrated the brutal murder of journalist Jamal Khashoggi. Trump blasts ABC News as fake news, before contradicting US intelligence on the Saudi crown prince’s role in Khashoggi death: You’re mentioning somebody that was extremely controversial. A lot of people didn’t like that gentleman [Khashoggi] that you’re talking about. Whether you like him or didn’t like him, things happen. But he [bin Salman] knew nothing about it. And we can leave it at that. You don’t have to embarrass our guest by asking something like that. As I noted earlier, US intelligence concluded in 2021 that bin Salman approved the capture or killing of Khashoggi at the Saudi consulate in Istanbul in 2018. The crown prince denied ordering the operation but acknowledged responsibility as the kingdom’s de facto ruler. Here’s our report on that from the time: US finds Saudi crown prince approved Khashoggi murder but does not sanction him Read more Share Updated at 18.40 GMT\n\n2d ago 17.52 GMT Asked by a reporter whether Saudi Arabia can really continue to invest as much as $1tn in the United States given the reality of lower oil prices, bin Salman says the kingdom was not “creating fake opportunities to please America or please Trump” and that Saudi Arabia has “huge demand” for computing power and desires US advanced chips. Share\n\n2d ago 17.50 GMT Trump says US working to approve advanced AI chip sales to Saudi Arabia Trump says he is working to approve the sale of advanced US AI chips to Saudi Arabia, signalling a major shift in export policy and deepening tech ties with the kingdom. Share Updated at 17.52 GMT\n\n2d ago 17.42 GMT “We’ve been really good friends for a long period of time,” Trump says of the crown prince. Share Updated at 17.43 GMT\n\n2d ago 17.42 GMT Trump says Saudi Arabia agreed to invest $600bn in US, then crown prince promises $1tn “I want to thank you because you’ve agreed to invest $600bn into the United States, and because he’s my friend, he might make it a trillion, but I’m going to have to work on him,” Trump says, referring to bin Salman. Bin Salman then says in response that Saudi Arabia “believes in the future of America” and is going to increase its pledge to almost $1tn of investment in the United States. Share Updated at 17.45 GMT\n\n2d ago 17.37 GMT Talks in the Oval Office are underway, albeit somewhat behind schedule. I’ll bring you any key news lines here. Share\n\n3d ago 17.24 GMT Bearing in mind that, while this is not a state visit – Mohammed bin Salman is not technically the Saudi head of state, though he is the kingdom’s de facto leader – that ceremony was definitely more lavish than your average state visit arrival, including the Marine band and officers on horseback flying the Saudi and US flags. View image in fullscreen Donald Trump salutes the troops as he waits for the arrival of Mohammed bin Salman. Photograph: Saul Loeb/AFP/Getty Images Share Updated at 17.24 GMT\n\n3d ago 16.44 GMT Here are some more pictures capturing the pomp and circumstance Donald Trump has put on for MBS. View image in fullscreen Donald Trump salutes as he waits for the arrival of Mohammed bin Salman. Photograph: Mark Schiefelbein/AP View image in fullscreen Fanfare for the crown prince’s welcome to the White House. Photograph: Saul Loeb/AFP/Getty Images View image in fullscreen A flyover of military aircraft on the South Lawn. Photograph: Brendan Smialowski/AFP/Getty Images Share Updated at 17.03 GMT",
  "summary": "<p>This live blog is now closed.</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/2025/nov/18/trump-bin-salman-visit-jamal-khashoggi\">Trump shrugs off Khashoggi murder during Saudi prince’s White House visit</a></p></li></ul><p>A reminder that <strong>Donald Trump</strong>’s family has a strong personal interest in <strong>Saudi Arabia</strong>. In September, London real estate developer Dar Global announced that <a href=\"https://apnews.com/article/saudi-arabia-trump-organization-jeddah-dar-global-539989a563d8f7eb949be2e10ee18d0a\">it plans to launch Trump Plaza</a> in the Red Sea city of Jeddah.</p><p>It’s Dar Global’s second collaboration with the Trump Organization, the collection of companies controlled by the US president’s children, in the kingdom. Last year, the two companies announced the launch of <strong>Trump Tower Jeddah</strong>.</p> <a href=\"https://www.theguardian.com/world/live/2025/nov/18/donald-trump-mbs-saudi-arabia-meeting-f35-jets-latest\">Continue reading...</a>",
  "published": "Tue, 18 Nov 2025 20:16:13 GMT",
  "url": "https://www.theguardian.com/world/live/2025/nov/18/donald-trump-mbs-saudi-arabia-meeting-f35-jets-latest",
  "source": "World news | The Guardian"
}