{
  "title": "A fire in southwestern Japan damages 170 homes and forces evacuations",
  "text": "A fire in southwestern Japan damages 170 homes and forces evacuations\n\ntoggle caption Kyodo News/AP\n\nTOKYO — Firefighters and army helicopters battled a fire Wednesday that burned through a neighborhood of old wooden houses in a fishing town in southwestern Japan, killing one person, injuring another and forcing more than 170 people to evacuate.\n\nA man in his 70s was unaccounted for and firefighters later found a body, possibly of the missing man, and a woman in her 50s suffered a minor injury, the Oita prefecture disaster response team said.\n\nDozens of fire engines and more than 200 firefighters were mobilized to battle the fire, which was not still fully under control more than a day after it started. The Ground Self-Defense Force dispatched two UH-1 army helicopters to assist.\n\nSponsor Message\n\nIt may take a few more days before the fire is completely extinguished, town mayor Shinya Adachi told reporters after he visited the devastated neighborhood Wednesday.\n\ntoggle caption Takumi Sato/Kyodo News via AP\n\nAt least 170 homes have been damaged or burned down, the disaster response team said. The residential section struck by the fire is close to the coastal area of Oita known for mackerel fishing but not near the prefecture's popular hot spring resorts, called onsen, and historic, thatched-roof homes.\n\nThe fire started during strong winds Tuesday evening near a fishing port in the Saganoseki district of Oita City on the southern main island of Kyushu. The blaze spread to a forest, affecting about 4.9 hectares (12 acres), the Fire and Disaster Management Agency said. There was an advisory for strong wind when the fire broke out.\n\nA firefighter told the Kyodo News Agency that fire fighting operation was hampered by narrow backstreets where fire engines could not enter. There were also abandoned homes in the rapidly aging and shrinking neighborhood, Kyodo said.\n\ntoggle caption Takumi Sato/Kyodo News via AP\n\nThe local network YTV noted that the narrow alleyways where the fire burned had old wooden houses.\n\nThe fires spread quickly as a strong wind was \"blowing in all directions,\" a 59-year-old office worker told Kyodo as she recalled how the fire started Tuesday evening.\n\nSponsor Message\n\nAuthorities are still investigating the fire's cause and how it spread, the FDMA said.\n\nJapanese television footage showed smoke rising from swaths of land filled with destroyed and damaged houses, though orange flames were no longer visible by midday Wednesday. The Oita prefecture said about 260 homes remained without electricity Wednesday afternoon.\n\nA resident told Kyodo that she quickly fled without many of her belongings because the fire \"spread in the blink of an eye.\"\n\nPrime Minister Sanae Takaichi posted a statement on X offering sympathy for those affected by the fire and pledged to \"provide maximum support.\"",
  "summary": "Firefighters and army helicopters battled a fire that burned through old wooden houses in a fishing town in southwestern Japan.",
  "published": "Wed, 19 Nov 2025 12:50:53 -0500",
  "url": "https://www.npr.org/2025/11/19/g-s1-98403/fire-japan-oita",
  "source": "NPR Topics: World"
}