{
  "title": "Trump Makes Vaguely Threatening Joke About Firing His Treasury Secretary",
  "text": "LOADING ERROR LOADING\n\nPresident Donald Trump joked Wednesday about firing Treasury Secretary Scott Bessent if interest rates don’t go down, urging him to “get it fixed fast.”\n\nTrump’s remarks, made during a speech at the U.S.-Saudi Investment Forum, came as he launched more criticism at Federal Reserve Chair Jerome Powell over the United States’ central bank not lowering interest rates to his liking, despite inflation threats posed by the president’s tariffs.\n\nAdvertisement\n\n“You’ve got to work on him, Scott. The only thing Scott’s blowing it on is the Fed, because the Fed ― the rates are too high, Scott. And if you don’t get it fixed fast, I’m gonna fire your ass, OK?” Trump said to laughs from the crowd.\n\nBessent has no control over interest rates, as the Federal Reserve is a politically independent agency. And though the president lacks the legal authority to fire the Federal Reserve chair, he’s repeatedly called for Powell’s ouster.\n\nAdvertisement\n\n“He’s got some real mental problems,” Trump complained about Powell at Wednesday’s forum. “There’s something wrong with him. I’ll be honest, I’d love to fire his ass. He should be fired. Guy’s grossly incompetent.”\n\nTrump added that Bessent has urged him to drop talk of firing Powell, whose term ends in May.\n\n“Don’t fire him. Sir, please don’t fire him ― he’s got three months to go,” Trump mimicked Bessent.\n\n“He’s the voice of reason,” Trump complimented him, telling the crowd, “You’re very lucky you have him, I’ll tell you that. He’s done a good job.”\n\nTrump first nominated Powell as chair of the Fed in 2017, but within a matter of months, the president grew openly frustrated with him for increasing interest rates, blaming him for a decline in the stock market and unsuccessfully pressuring him to resign. When former President Joe Biden took over the White House, he nominated him for a second term that would bleed well into Trump’s second presidency.\n\nAdvertisement",
  "summary": "Trump added he'd also \"love to fire\" Jerome Powell, ramping up his attacks on the Federal Reserve chair.",
  "published": "Wed, 19 Nov 2025 20:12:13 -0500",
  "url": "https://www.huffpost.com/entry/trump-scott-bessent-interest-rates_n_691e4eede4b0b763ab8da326",
  "source": "Politics"
}