{
  "title": "Combination therapy can prolong life in severe heart disease",
  "text": "Aortic valve narrowing (aortic stenosis) with concomitant cardiac amyloidosis is a severe heart disease of old age that is associated with a high risk of death. Until now, treatment has consisted of valve replacement, while the deposits in the heart muscle, known as amyloidosis, often remain untreated. An international research consortium led by MedUni Vienna and University College London has now been able to demonstrate for the first time that combined treatment consisting of heart valve replacement and specific drug therapy offers a significant survival advantage for patients. The study results have been published in the European Heart Journal.\n\nAs part of the study conducted by the research team led by Christian Nitsche (Department of Medicine II, Clinical Division of Cardiology, MedUni Vienna) and Thomas Treibel (Department of Cardiovascular Imaging, University College London), data from 226 patients with aortic stenosis and concomitant cardiac amyloidosis from ten countries were examined. Aortic stenosis is a narrowing of the heart valve that directs blood from the left ventricle into the bloodstream. In cardiac amyloidosis, misfolded proteins are deposited in the heart muscle. Both diseases occur in older people and often together. Until now, it was unclear whether treating amyloidosis in addition to valve surgery would benefit patients.\n\nThe analysis now published showed that both aortic valve replacement and treatment with the drug tafamidis for amyloidosis were associated with a significantly lower risk of death. The survival benefit was highest in patients who received both forms of treatment. \"Our results even show that patients with both conditions who received valve replacement and specific amyloidosis therapy had similar long-term survival rates to people with aortic stenosis without amyloidosis,\" emphasises study leader Christian Nitsche.\n\nTargeted tests necessary\n\nBoth aortic stenosis and cardiac amyloidosis impair the heart's pumping function and can lead to death if left untreated. Targeted therapy can slow the progression of amyloidosis, while valve replacement treats the mechanical stress caused by the narrowed heart valve. Around ten percent of patients with aortic stenosis also have amyloidosis, but this is often not diagnosed in everyday clinical practice. \"Our findings also suggest that patients with severe aortic valve stenosis should be screened for amyloidosis so that we can offer them targeted life-prolonging treatment options,\" emphasises Christian Nitsche.",
  "summary": "Aortic valve narrowing (aortic stenosis) with concomitant cardiac amyloidosis is a severe heart disease of old age that is associated with a high risk of death. Until now, treatment has consisted of valve replacement, while the deposits in the heart muscle, known as amyloidosis, often remain untreated. Researchers have now demonstrated that combined treatment consisting of heart valve replacement and specific drug therapy offers a significant survival advantage for patients.",
  "published": "Mon, 02 Jun 2025 15:55:08 EDT",
  "url": "https://www.sciencedaily.com/releases/2025/06/250602155508.htm",
  "source": "Latest Science News -- ScienceDaily"
}