{
  "title": "Bam! What is the acronym everyone is talking about at Cop30?",
  "text": "All through the halls of the UN climate talks, civil society activists are wearing badges that read “Bam!”. They are not showing their fandom for old superhero comics but rather indicating their support for the Belém Action Mechanism (Bam), a proposal for states to drive action on a just transition towards a low-carbon economy.\n\nSecuring the Bam is a top priority for climate justice advocates at Cop30. Proponents say that if a just transition is not a priority, climate action will unintentionally leave workers and communities behind.\n\nIt is no secret that the current extractive energy systems and other polluting industries harm some people – such as frontline workers and adjacent communities – more than others. A new green economy should not replicate those trends, Bam proponents say, but should boost prosperity and minimise inequality.\n\nAdvocates secured a major win this week when countries collectively representing about 80% of the world’s population signalled their support for such a proposal. But what exactly is Bam, and why is it such a hot-button issue at Cop30?\n\nWhat is a just transition?\n\nThe concept of the just transition originated from the US labour movement, specifically from energy and chemical workers who said employees of polluting sectors should be supported and compensated as they move into more environmentally friendly jobs.\n\nIt has since been taken up by civil society organisations and expanded to include all people affected by sectors that are shifting as climate policies are enacted. That includes workers in the booming transition minerals sector, as well as people living near mineral extraction sites. It also encompasses people affected by attempts to clean up the agriculture sector.\n\nWhen did the just transition become a consideration in Cop negotiations?\n\nThe preamble to the 2015 Paris agreement mentioned the framework, when parties agreed to “taking into account the imperatives of a just transition of the workforce and the creation of decent work and quality jobs in accordance with nationally defined development priorities”. It acknowledged that without planning, the shift to a low-carbon economy could leave workers and communities behind. But preamble text does not lead to implementation.\n\nDuring the 2018 climate talks in Katowice, the just transition concept entered the sphere of negotiations when a committee of experts convened by Cop officials considered it. Three years later, at Cop27 in Egypt, parties created the “just transition work programme”, which was intended to help countries design fair pathways and mitigate unintended harms of climate action.\n\nThe following year in Dubai, officials fleshed out the programme some more, including by agreeing to hold regular dialogues for parties focused on the just transition. But none of those agreements included requirements for parties. Bam supporters say they have a plan to fix that.\n\nWhat would the Bam do?\n\nBam proponents say a new mechanism is needed to require countries to take concrete steps toward a just transition. Right now, global just transition efforts are fragmented and inconsistent.\n\n“No one is even tracking progress on this,” said Teresa Anderson, the global climate justice lead at the NGO ActionAid. “Bam would fix that.”\n\nBam would also require countries to coordinate their work supporting a just transition, ensuring everyone knows what is happening globally and who it is affecting. It also aims to develop ways for countries to share best practices on a just transition and to support the implementation of such policies, especially in low-income countries with limited state capacity.\n\nskip past newsletter promotion Sign up to Down to Earth Free weekly newsletter The planet's most important stories. Get all the week's environment news - the good, the bad and the essential Enter your email address Sign up Privacy Notice: Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on theguardian.com to send you this newsletter. You can complete full registration at any time. For more information about how we use your data see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nAnd though it would not mandate any new spending on climate finance, it would prioritise non-debt-inducing finance and ensure technology is shared with developing countries – values that states agreed to uphold in the Paris agreement.\n\nWho in civil society is supporting Bam?\n\nBam was developed by civil society groups beginning earlier this year. It was created by the Climate Action Network, the largest international coalition of environmental nonprofits; the Women and Gender Constituency, a coalition of dozens of gender justice organisations, which is officially recognised as a stakeholder group by the UN’s climate body; and allies in the labour movement and youth movement and the climate justice coalition Global Campaign to Demand Climate Justice.\n\nAt Cop30, a coalition of Indigenous groups also joined the call for Bam, Anderson said. “They were not able to join it until they could meet in person at Cop and decide together, because of their collective decision-making structure, but they now say that this is the kind of thing they need as well.”\n\nWhich states are against Bam? And which are for it?\n\nPowerful countries are still naysayers, civil society members told the Guardian. Among them are the UK and Japan: this week Climate Action Network gave the two countries the ironic “fossil of the day” award for their failure to back the proposal.\n\nThe Philippines was the earliest strong supporter of Bam, Anderson said. Now, many others are onboard. On Tuesday, the G77 and China, collectively representing about 80% of the world’s population, announced a unified call in support of a “just transition mechanism,” indicating backing for the advocates’ plan. It was a huge boost for the movement.\n\nAdditional reporting by Nina Lakhani",
  "summary": "<p>Securing the Belém Action Mechanism is a top priority for climate justice advocates at the talks in Brazil</p><p> • <a href=\"https://www.theguardian.com/environment/cop30\">Cop30: click here for full Guardian coverage of the climate talks in Brazil</a></p><p>All through the halls of the UN climate talks, civil society activists are wearing badges that read “Bam!”. They are not showing their fandom for old superhero comics but rather indicating their support for the Belém Action Mechanism (Bam), a proposal for states to drive action on a just transition towards a low-carbon economy.</p><p>Securing the Bam is a top priority for climate justice advocates at Cop30. Proponents say that if a just transition is not a priority, climate action will unintentionally leave workers and communities behind.</p> <a href=\"https://www.theguardian.com/environment/2025/nov/18/bam-belem-action-mechanism-explainer-cop30\">Continue reading...</a>",
  "published": "Tue, 18 Nov 2025 06:00:26 GMT",
  "url": "https://www.theguardian.com/environment/2025/nov/18/bam-belem-action-mechanism-explainer-cop30",
  "source": "The Guardian"
}