{
  "title": "Delhi St Columba's School suicide case: 4 teachers suspended",
  "text": "Image Credit: TOI\n\nDelhi Student Suicide Case: Massive Protest Outside School After Note Alleges Harassment By Teachers\n\nNEW DELHI: Four teachers of St Columba's School, named in an FIR filed in connection with the suicide by Class X student Shourya Patil (16), were on Thursday suspended.\"The matter is under investigation... In view of the seriousness of the allegations, the competent authority has decided to place you under suspension with immediate effect,\" the order said, adding the teachers \"must stay available for official communication, avoid visiting the school or interacting with students, staff or parents without written permission\".Shourya's family returned for his last rites to Sangli, Maharashtra, where his grandparents live. He was cremated at his ancestral village, Dhawaleshwar, in Vita tehsil.Speaking to TOI on the phone, Shourya's father, Pradip Patil, said: \"For the past six months, he kept telling us he was being singled out and targeted even for normal conversations, and that teachers were humiliating him. We were repeatedly called to school over very small issues, especially in the past four months.\"Days before the school vacations, Shourya had pleaded with his father to pull him out. His father had promised he would be shifted after the break. But the harassment was so relentless the teenager could no longer bear it, alleged his family.\"His vacations were just 8-10 days away. After that, he only had to come for his pre-boards. We had assured him that once this was over, we would shift him to another school for the next two years.Because 20 internal marks are with the school, we didn't want to risk his board performance. We thought it was better not to create conflict with the teachers and just wait it out,\" he added.Patil described his son as charismatic and cheerful, someone who loved dancing and had recently represented the school at a competition just a month ago. \"We were planning a family trip to China after his board exams. It was his wish, everything was already planned,\" he said.The suicide note found in Shourya's bag stated that he was sorry and that his body parts should be donated to someone in need. It also mentioned the names of the teachers who allegedly humiliated him. \"My last wish is that action is taken against them, I don't want any other child to do something like me (sic),\" it said.A grief-stricken Patil said, \"Especially after reading his note — and I'm staying strong — we will not stop fighting for justice.\"On Thursday, several parents, former students and family friends gathered in anger and grief. Copies of Shourya's handwritten suicide note were pasted outside the school gates and boundary walls, drawing crowds of parents who stopped to read his final words.Chandrashil Dhawan (35), a relative of the Patils at the protest, said, \"Several children have now told us they faced harassment from the same teachers. They were even planning to write everything down and go to the police.\"He alleged Shourya had been threatened by teachers on the morning of the incident for not performing a dance because of a sprained ankle. He left through the back gate and never reached his pick-up point for his driver to find him. \"The next we heard,\" Dhawan said, \"was that he had jumped from the metro station.\"Parents at the protest said the school's counsellors exist \"only on paper\" and students do not feel safe approaching them. Former students said the school must end what they described as a \"pick-and-point culture\" that singles out students repeatedly. Aditya Sagar (18), an alumnus, said, \"The school has counsellors, but students rarely approach them about teacher-related issues. They are all part of the same ecosystem, so it doesn't feel like a safe space to complain. \"A police team visited the school and interacted with the students. They also secured CCTV footage related to the incident. \"We have collected the details of the teachers named in the FIR, and summons will be issued to them to join the investigation,\" an officer said.",
  "summary": "Four teachers at St. Columba's School have been suspended following the suicide of a Class X student, Shourya Patil. The student's family alleges he was repeatedly humiliated and targeted by teachers. A suicide note found in his bag named the teachers and requested action, prompting protests and an ongoing police investigation.",
  "published": "Fri, 21 Nov 2025 05:52:02 +0530",
  "url": "https://timesofindia.indiatimes.com/city/delhi/students-suicide-school-suspends-four-teachers/articleshow/125469566.cms",
  "source": "Times of India"
}