{
  "title": "Angel Reese defends gesture directed towards Caitlin Clark after LSU national title win; calls out double standard after being 'unapologetically' her",
  "text": "CNN —\n\nLSU star Angel Reese defended the gesture she aimed at Iowa Hawkeyes’ Caitlin Clark near the end of the Tigers’ first NCAA women’s basketball national championship victory on Sunday, saying “I don’t take disrespect lightly.”\n\nReese could be seen approaching Clark before moving her open hand in front of her face – popularized by WWE star John Cena to mean “you can’t see me” – before pointing to her ring finger in a gesture some interpreted as a reference to the place her newly-acquired championship ring might sit.\n\nClark made a similar gesture to another player earlier in the tournament.\n\nThe gesture has sparked much debate, especially on social media. Some have criticized Reese, while others have defended her actions, highlighting how there was no public outrage in response to Clark’s gesture earlier in the tournament.\n\nSports journalist Jose de Jesus Ortiz called Reese’s actions “classless,” while former ESPN host Keith Olbermann called Reese an “idiot” for the gesture.\n\nIn the press conference after the victory, Reese referenced the difference in reaction she received as a result of her gesture as compared to the one Clark received.\n\nCaitlin Clark did the \"You can't see me\" gesture earlier in the NCAA tournament. From ESPN\n\n“All year, I was critiqued for who I was. I don’t fit the narrative,” Reese said. “I don’t fit the box that y’all want me to be in. I’m too hood. I’m too ghetto. Y’all told me that all year. But when other people do it, and y’all don’t say nothing.\n\n“So this is for the girls that look like me. For those that want to speak up for what they believe in. It’s unapologetically you. And that’s what I did it for tonight. It was bigger than me tonight. And Twitter is going to go into a rage every time.\n\n“And I’m happy. I feel like I’ve helped grow women’s basketball this year. (…) I’m looking forward to celebrating and then next season.”\n\nReese had 15 points and 10 rebounds in the 102-85 victory and won the women’s March Madness’ Most Outstanding Player award.\n\nIn the post-game broadcast, Reese referenced the similar gesture Clark made to a Louisville opponent in the Elite Eight.\n\nIn the same game, Clark said to an opponent: “You’re down by 15 points. Shut up,” according to the Bleacher Report.\n\n“Caitlin Clark is a hell of a player but I don’t take disrespect lightly,” Reese said. “She disrespected [LSU’s] Alexis [Morris] (…) and I wanted to pick her pocket. But I had a moment at the end of her game. I was in my bag, I was in my moment.”\n\nAfter the Championship game, Clark herself said she didn’t notice anything at the time.\n\n“I was just trying to get to the handshake line and shake hands and be grateful that my team was in that position,” Clark said in the post-game press conference. “All the credit in the world to LSU. They were tremendous. They deserve it. They had a tremendous season.\n\n“(LSU head coach) Kim Mulkey coached them so, so well. She’s one of the best basketball coaches of all time, and it shows. She only said really kind things to me in the handshake line, so I’m very grateful of that too.\n\n“But honestly I have no idea. I was just trying to spend the last few moments on the court with especially the five people that I’ve started 93 games with and relishing every second of that.”\n\nLSU head coach Mulkey said she had “no clue” about what transpired.\n\nLSU players celebrate after winning the national championship game on Sunday, April 2. Tony Gutierrez/AP LSU's Angel Reese gestures toward her ring finger in the final moments of the game. Maddie Meyer/Getty Images LSU's Flau'jae Johnson hugs head coach Kim Mulkey at the end of the game. Kevin Jairaj/USA Today Sports/Reuters LSU came into the tournament as a No. 3 seed, but it knocked off a 1-seed (Virginia Tech) and a 2-seed (Iowa) in the Final Four. Maddie Meyer/Getty Images LSU's Alexis Morris drives to the basket during the second half. She had 19 of her 21 points in the second half. Darron Cummings/AP Morris, center, is congratulated by teammates after drawing a foul in the fourth quarter. Kirby Lee/USA Today Sports/Reuters An Iowa fan holds a \"believe\" sign during the second half. Tony Gutierrez/AP Iowa star Caitlin Clark runs back on defense after making a 3-pointer in the second half. Tony Gutierrez/AP Players jostle for position in the second half. C. Morgan Engel/NCAA Photos/Getty Images LSU players celebrate after Jasmine Carson hit a buzzer-beating 3-pointer to end the first half. The Tigers led Iowa 59-42. Darron Cummings/AP Iowa head coach Lisa Bluder walks the sideline during the first half. Kevin Jairaj/USA Today Sports/Reuters Reese is defended by Iowa's McKenna Warnock in the first quarter. Kevin Jairaj/USA Today Sports/Reuters Reese and Monika Czinano battle for a rebound. C. Morgan Engel/NCAA Photos/Getty Images Carson reacts after hitting a 3-pointer in the second quarter. Carson came off the bench to score 21 first-half points, and she was 5-for-5 from behind the 3-point arc. Tony Gutierrez/AP Clark yells from the sideline during the first half. She was in foul trouble for much of the game. Tony Gutierrez/AP Johnson is fouled by Clark in the first quarter. Maddie Meyer/Getty Images Mulkey reacts to a call during the first half. Tony Gutierrez/AP Clark hits one of her four 3-pointers in the first quarter. She finished the first half with 16 points. Maddie Meyer/Getty Images LSU's LaDazhia Williams is defended in the first half. Maddie Meyer/Getty Images Reese and Czinano compete for the opening jump ball. Ron Jenkins/Getty Images First lady Jill Biden, in the green jacket, takes in the game with tennis legend Billie Jean King, right. Maddie Meyer/Getty Images The National Anthem is played before the game in Dallas. Kirby Lee/USA Today Sports/Reuters Iowa fans get ready for the game at the American Airlines Center. Kirby Lee/USA Today Sports/Reuters LSU players high-five fans on their way to the game. Tom Pennington/Getty Images In pictures: LSU wins national title in women's basketball Prev Next\n\nAmong those defending Reese on social media were ESPN’s Holly Rowe and former NBA star Etan Thomas.\n\n“People hating on Angel Reese or Caitlin Clark. Stop. Unapologetically confident young women should be celebrated NOT hated. Get used to it,” Rowe wrote on Twitter.\n\nFormer Washington Wizards, Oklahoma City Thunder and Atlanta Hawks player Thomas wrote: “Hold on now!!!! It was cute when Caitlin Clark did it. Y’all didn’t have any issues with it at all. So don’t be all outraged and talking about class and sportsmanship when Angel Reese does the same thing. We’re not doing double standards here.”\n\nReese said the negative reaction on social media throughout the season has helped fuel her excellent season, having finished averaging 23.0 points and 15.4 rebounds in her first season with LSU after transferring from Maryland.\n\n“Twitter can say what they want to say,” she said. “I love reading those comments. I have all the screenshots of what everybody has said about me all season. What are you going to say now?”",
  "summary": "LSU star Angel Reese defended the gesture she aimed at Iowa Hawkeyes' Caitlin Clark near the end of the Tigers' first NCAA women's basketball national championship victory on Sunday, saying \"I don't take disrespect lightly.\"",
  "published": "Mon, 03 Apr 2023 18:34:35 GMT",
  "url": "https://www.cnn.com/2023/04/03/sport/angel-reese-gesture-caitlin-clark-lsu-iowa-spt-intl/index.html",
  "source": "CNN.com - RSS Channel - App International Edition"
}