{
  "title": "Lee produces career-best round to lead LPGA finale",
  "text": "South Korea's Somi Lee shot a career-best eight-under-par 64 to open up a two-shot lead in the first round of the LPGA's lucrative season-ending CME Group Tour Championship.\n\nThe 26-year-old made four birdies on the front nine and three more on the back nine - plus an eagle on the 17th - with the only blemish to her scorecard arriving with a bogey on the 18th.\n\n\"It's an honour playing my first Tour Championship and I don't think I was necessarily in a position to be nervous about anything,\" Lee said.\n\n\"I thought to myself 'whatever the score is or how I play, let's just prepare for next year's season'. I think that kind of alleviated the stress in today's round to be able to get a better score.\"\n\nAmerican Allisen Corpuz is at six under, while world number one and defending champion Jeeno Thitikul, who leads the Race to CME Globe rankings, is one of four players a stroke further back at five under.\n\nGermany's Esther Henseleit and Sweden's Madelene Sagstrom ended Thursday in a tie for seventh at four under and are the highest-placed Europeans in the 60-player field at Tiburon Golf Club in Florida, which contains 28 of the 29 winners from this season.\n\nEngland's Charley Hull, who won this tournament in 2016, knocked in five birdies but a double-bogey on the 10th checked her progress and she eventually signed for a three-under-par 69.\n\nHer compatriot Lottie Woad is at two under, while world number two Nelly Korda recovered from consecutive bogeys on the second and third holes to finish one under as she chases her first win of the campaign.\n\nThe LPGA's final event of the season carries a total purse of $11m (£8.4m).\n\nThe $4m (£3.1m) top prize is the largest winner's cheque in women's golf and the third biggest in all of golf behind the men's Tour Championship ($10m/£7.6m) and The Players Championship ($4.5m/£3.4m).",
  "summary": "South Korea's Somi Lee shoots a career-best eight-under 64 to open up a two-shot lead in the first round of the LPGA's lucrative season-ending CME Group Tour Championship.",
  "published": "Thu, 20 Nov 2025 23:05:12 GMT",
  "url": "https://www.bbc.com/sport/golf/articles/cd7r79jvdqzo?at_medium=RSS&at_campaign=rss",
  "source": "BBC Sport"
}