{
  "title": "They just call it ‘the virus’: mosquito-borne illnesses heap misery on Cubans affected by Hurricane Melissa",
  "text": "Maidel Jorge, a 36-year-old farmer, sweats as he chops down a tree to collect wood for cooking: the early November weather in eastern Cuba is still as hot as summer. The tree was young, so the wood is green, which means it will take longer to burn and their meal will take longer to prepare.\n\nJorge, his pregnant wife and their six-year-old son are among 300 people staying in a school turned into an evacuation centre in Grito de Yara, Granma province, some of the 3 million Cubans exposed to Hurricane Melissa, which barrelled into the country last month.\n\nJorge’s family haven’t had electricity for two weeks, the water supply arrives on occasional tankers, and mosquito-borne illnesses are rampant. In the evacuation centre, 18 people are suffering from a fever. Nobody knows for sure which it is: they just call it “the virus”.\n\n“It was terrible,” says Jorge, describing the hurricane’s assault. “Nothing was left.”\n\nView image in fullscreen Maidel Jorge (left) chops down a tree to collect wood for cooking at the evacuation centre where he is staying with his family. Photograph: Eileen Sosin\n\nWhile his clapboard house survived, he lost his crops of corn, beans and sweet potato, two oxen and a 100kg pig. A single hen survived. The greatest destruction wasn’t caused by wind or rain, but by flooding.\n\nNo deaths were reported when Melissa – one of the strongest storms on record to make landfall in the Caribbean – slammed into the island as a category 3 hurricane last month. But the storm brought more than 38cm (15 inches) of rain to some rural areas, and the ensuing floods exacerbated conditions that were already dire for many Cubans.\n\nAll the damage I’ve seen breaks my heart Miguel Ángel Rodríguez, social worker\n\nFor four years now, Cuba has been sinking into economic crisis. Failed internal policies, aggressive US sanctions and the consequences of the coronavirus pandemic have reduced many people’s prospects to an exhausted wait for better times.\n\nLong before Melissa hit, people in Cuba’s countryside faced 20-hour blackouts and a lack of basic supplies such as food and medicine. Lately, as the government’s once-impressive eradication programmes have faltered, there has been an increase in mosquito and sandfly related viruses such as chikungunya, dengue, oropouche and zika.\n\nIn the past months, Cuba has suffered a particularly terrible epidemic of chikungunya, which, while rarely fatal, causes a week-long fever and terrible joint pain.\n\nAlerts were first raised in Matanzas in Cuba’s heartlands last July. By late October, health officials said there had been 13,000 new fever cases across the country in a week. But recent reports suggest one-third of the Cuban population has been infected, and the government officially called the outbreak an epidemic.\n\nView image in fullscreen A primary school serves as an evacuation centre housing more than 300 people in Grito de Yara, Granma province. Photograph: Eileen Sosin\n\nIn the east, where Melissa swept through, such illnesses have been heaping misery on those trying to rebuild. Leanet Pérez, a 21-year-old teacher in Cauto del Paso, 3km (1.86 miles) from Grito de Yara, has spent the past two weeks evacuated at a cousin’s house in Bayamo with her family.\n\nThey returned home to scenes of disaster that made them cry. Their house, very close to the Cauto River, was inundated and barely standing. Pérez swiftly contracted chikungunya. She has struggled to get up, applies alcohol compresses to lower the fever and relies on the paracetamol her sister gives her. Many families without access to repellants and medicines have been forced to rely on natural remedies.\n\nCauto del Paso dam, the largest in the province, started to spill over the day after the hurricane arrived, releasing 4,000 cubic metres a second at the peak of the flood, according to state officials. The water levels have remained high since, leaving homes covered in sludge, and foul pools where mosquitoes breed.\n\nskip past newsletter promotion Sign up to Global Dispatch Free newsletter Get a different world view with a roundup of the best news, features, opinion and photography, curated by our global development team Enter your email address Sign up Privacy Notice: Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on theguardian.com to send you this newsletter. You can complete full registration at any time. For more information about how we use your data see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nView image in fullscreen A woman is evacuated from her home after the Cauto River flooded. The standing water has become a breeding pool for mosquitoes. Photograph: Norlys Perez/Reuters\n\nMiguel Ángel Rodríguez, 31, is a social worker at Grito de Yara’s evacuation centre. Along with other colleagues, he visits small settlements to gather information to send on to the authorities. “All the damage I’ve seen breaks my heart,” he says. “I have no words.”\n\nIn Cauto del Paso, the floods quickly inundated houses, sweeping away mattresses, clothes and electrical appliances.\n\nTractors now struggle in the thick mud that covers the paths. Along the way, two vultures peck at a dead horse. The raised graves in the local cemetery give the impression they are floating in a swamp.\n\nAt sunset, wood smoke rises from the balconies and back yards in Grito de Yara. Without power for more than two weeks, better-off families cook with charcoal.\n\n“Here, cooking with butane gas is only for the wealthy,” says Yudelkis Alarcón, a 42-year-old teacher, who was born and raised in the village. Her four-year-old son has contracted “the virus” and needs to be administered saline solution in the local polyclinic.\n\nView image in fullscreen Dayana Álvarez is expecting a baby girl in February, who she says she will name Melissa, after the hurricane. Photograph: Eileen Sosin\n\nOther fires are lit to keep the mosquitoes away. Jorge’s wife, Dayana Álvarez, 20, is due to give birth in February. She says she will name her baby girl Melissa. It’s a tradition that children born when a hurricane hits Cuba are named after the meteorological phenomenon.\n\nIn the meantime, she sleeps on a thin mattress at the evacuation centre. By the time they welcome baby Melissa, she hopes things will get better: “At least a bit.”",
  "summary": "<p>A lack of clean water and medicines in the aftermath of the storm has led to a sharp rise in viruses such as chikungunya and dengue</p><p>Maidel Jorge, a 36-year-old farmer, sweats as he chops down a tree to collect wood for cooking: the early November weather in eastern <a href=\"https://www.theguardian.com/world/cuba\">Cuba</a> is still as hot as summer. The tree was young, so the wood is green, which means it will take longer to burn and their meal will take longer to prepare.</p><p>Jorge, his pregnant wife and their six-year-old son are among 300 people staying in a school turned into an evacuation centre in Grito de Yara, Granma province, some of the <a href=\"https://www.undp.org/press-releases/more-48-million-tonnes-debris-left-hurricane-melissa-across-western-jamaica-according-un-development-programme-analysis#:~:text=In%20Cuba%2C%20nearly%203%20million,also%20reporting%20flooding%20and%20destruction\">3 million Cubans</a> exposed to <a href=\"https://www.theguardian.com/world/2025/oct/29/hurricane-melissa-hits-cuba-after-turning-jamaica-into-disaster-area\">Hurricane Melissa</a>, which barrelled into the country last month.</p> <a href=\"https://www.theguardian.com/global-development/2025/nov/20/they-just-call-it-the-virus-mosquito-borne-illnesses-heap-misery-on-cubans-affected-by-hurricane-melissa\">Continue reading...</a>",
  "published": "Thu, 20 Nov 2025 12:00:10 GMT",
  "url": "https://www.theguardian.com/global-development/2025/nov/20/they-just-call-it-the-virus-mosquito-borne-illnesses-heap-misery-on-cubans-affected-by-hurricane-melissa",
  "source": "The Guardian"
}