{
  "title": "Great Nicobar Project: Petitioner seeks full disclosure of key report",
  "text": "An interlocutory application (IA) filed before the National Green Tribunal (NGT) by activist Ashish Kothari has sought full disclosure of a report of the Centre’s high-powered committee (HPC), which examined deficiencies in the clearances granted to the Great Nicobar Island mega-infrastructure project, and has also questioned the government’s stance of keeping the report secret.\n\nThe plea alleged that the Centre’s stance to keep the report confidential due to strategic and privileged information was a “convenient claim to escape judicial scrutiny of their actions” and was contrary to facts.\n\nThe IA, filed in an ongoing matter in which Kothari has challenged alleged environmental violations in the project’s clearances, states that the Environment Ministry’s refusal to share a copy of the report is “illegal and violative of principles of natural justice”. A 6-member bench of the NGT, headed by chairperson Justice Prakash Shrivastava, is already hearing two petitions filed by Kothari on alleged violation of Island Coastal Regulation Zone 2019 notification, and another seeking directions to revisit environmental clearance for the project.\n\nThe HPC was formed in April 2023 on orders of the NGT to address “unanswered deficiencies” regarding the impact of the Rs 81,000 crore project on the ecologically sensitive and biodiverse Great Nicobar island. It was headed by Leena Nandan, former secretary, Ministry of Environment, Forest and Climate Change. The Environment Ministry has earlier submitted to the NGT that no part of the trans-shipment port fell in a no-go development zone under Island Coastal Regulation Zone, and Kothari’s counsel has contested this claim.\n\nThe project involves construction of a trans-shipment port, a township, a civil and military use airport, and a 450 MVA gas and solar power-based plant. It will be spread over 166 sq km, and 130 sq km of forest land will be diverted.\n\nIn an affidavit filed July 5 before the NGT, the Environment Ministry had said that the HPC’s report and relevant documents were brought in a sealed envelope for the Tribunal’s perusal. The report and its annexures were also circulated to the Tribunal in a sealed cover on October 30 during the previous hearing of the pending applications.\n\nIn his IA, Kothari urged the Tribunal to not rely on information contained in the HPC report as any decision based on such material would be violative of principles of natural justice, and prejudicial to rights of a fair trial. The IA has questioned the Centre’s rationale of terming the HPC report confidential when the entire clearance process — over 40 kinds of documents including environmental impact assessment, masterplan — are in public domain.",
  "summary": "",
  "published": "Thu, 20 Nov 2025 22:50:15 +0000",
  "url": "https://indianexpress.com/article/india/great-nicobar-project-petitioner-seeks-full-disclosure-of-key-report-10377304/",
  "source": "India | The Indian Express"
}