{
  "title": "Untie me! Why big bows are everywhere – feminine, ironic and strangely subversive",
  "text": "Wuthering Heights is a story about pain, revenge and the Yorkshire moors as a metaphor for bad life choices. But if Emerald Fennell’s forthcoming adaptation is anything to go by, it’s also about bows.\n\nIn the two-minute trailer for the film, Cathy wears red bows and black bows, navy bows and pink bows. There are bows around garden pots, and bows around “baddy” Edgar Linton’s throat. Some bows flutter in the fell wind, others are unlaced at speed. In one memorable shot straight from the Jilly Cooper precoital playbook, a pretty white bow is cut from Cathy’s bodice using a labourer’s knife, which would be unforgivable hamminess were it not incredibly hot. Never mind that Emily Brontë rarely mentions bows in the book; that one is an entire plot device.\n\nView image in fullscreen All tied up … Margot Robbie in Wuthering Heights. Photograph: Warner Bros./Avalon\n\nBows are, of course, not new. Victorian children wore them, Marie Antoinette wore them. So did Jojo Siwa, and Minnie Mouse. But today’s versions sometimes carry more weight. Take the Welsh rugby player Georgia Evans, who was attacked by trolls earlier this year for wearing pink hair bows during a game, leading to a volunteer-led “ribbon station” and more than 1,000 bows being worn in solidarity at a game against Fiji. “When we sign up to this as a professional athlete, you sign up for the scrutiny of your performance,” Evans told the BBC. “But … it’s bigger than a bow, it’s bigger than the game and it’s bigger than myself.”\n\nIn 2025, bows are big, garish and ostentatious. They are the centrepiece of a look, not the accessory – see the gold Marc Jacobs dress Lily Allen wore to her album launch party, with a giant bow at the bust. The modern bow has range, too. They can be pretty and demure (see Amanda Seyfried at the Venice film festival wrapped up like a gift in Prada), but also dark and gothy (Cynthia Erivo’s huge green velvet one at the Oscars).\n\nAnd it is not just celebrities: on the UK high street, Next is selling nine (nine!) different bow-covered cardigans, while M&S has two bow-festooned little black dresses for Christmas – one with small white bows at the bust, the other with a big bow as the main event. At Joseph, a white cotton tuxedo shirt comes with a detachable grosgrain bow, and I counted at least five pairs of bow-shaped earrings at Oliver Bonas and four bow hair accessories at Damson Madder. During his first womenswear collection for Dior in September – the most anticipated collection of five-figure clothes in recent times – the designer Jonathan Anderson opened the show with a white dress topped and tailed with two large organza bows. It’s no wonder the internet is calling 2025 the year of the bow-pocalypse.\n\nView image in fullscreen The rugby player Georgia Evans was attacked by trolls for wearing pink bows during a game. Photograph: Adrian Dennis/AFP/Getty Images\n\nThere is a risk of overthinking this. After all, bows are easy to tie and an affordable way to zhoosh something up, especially as we creep towards Christmas, the bow’s most riotous season. But there is something bigger at play. From the pandemic-era microtrend of cottagecore through to the tradwife, the last few years of womenswear have cycled through a strangely Arcadian idea of femininity. Dressing as a woman, or the idea of it, has changed – and bows have become a means of demonstrating femininity in the most blunted way possible.\n\n“There has been a gradual shift from women no longer feeling they have to dress like men to be taken seriously,” says Elisa De Wyngaert, a curator at Momu fashion museum in Antwerp, whose current exhibition, Girls, looks at the impact of girlhood on culture. The bow revival, she says, comes at a time when other traditionally girly items – Mary Jane shoes and white socks, for example – “have been readopted and embraced by people who see girlishness not as a weakness or lacking in intellectual rigour, but as something to be proud of”.\n\nView image in fullscreen Lily Allen at her album launch party in October. Photograph: Dave Benett/Getty Images for Perfect Magazine\n\nTake young designers such as Sandy Liang, Chopova Lowena and Simone Rocha, who have all made bows their trademark, popping them on grownup handbags, grungy slips and even wedding dresses. “For these designers, a bow has become a sort of code or an identity,” says the fashion historian Valerie Steele. “They are a signifier of femininity, but they are also ironic.” A pretty bow worn in an unexpected context is subversive.\n\nThe Danish designer Cecilie Bahnsen knows this all too well. She designs voluminous dresses for all body shapes, using bows in place of zips and buttons, and even placing them at the shoulder of a dress to hold it together. “I like that a bow can be feminine, but frivolous, but mostly not overtly sexual,” she says. “It’s about women dressing for women.” De Wyngaert agrees: “The way bows are used today is often in contrast to something darker, a joyful element in a dark time,” she says. “They’re really not about the male gaze.”\n\nView image in fullscreen Kate Garraway in a bow-adorned T-shirt, and Joe Marler in Celebrity Traitors. Photograph: PHOTOGRAPHER:/CREDIT LINE:BBC/Studio Lambert/Euan Cherry\n\nAnd yet it was men who first wore bows, when Croatian soldiers, whose uniform included a knotted scarf, inspired a new trend in Louis XIV’s court for aristocratic men to wear bows on their clothing. Then came Marie Antoinette, who really deployed the bow as a fashion item, says Dr Sarah Grant, a curator at the V&A who specialises in 18th and 19th century design. She describes Antoinette as “history’s peak bow”. “She wore them in her hair, on gowns, on her bust, and they’re woven into cushions and furniture,” says Grant. Back then it was about “showing off your finest French silks, of course”, but their placement was also strategic – “there they are, winking on typically feminine areas”.\n\nView image in fullscreen Queen of the bows … Marie Antoinette. Photograph: Christophe Fouin/© Château de Versailles, Dist. Grand Palais RMN\n\nThese days, there is rarely a red carpet without a few men bowed up to the hilt (see Andrew Garfield and Harry Styles, and Ncuti Gatwa at the Met Gala wearing an Ozwald Boateng suit and a large, detachable bow). Back in the 18th-century court, men largely wore bows for status. In today’s fashion, flouting the gender binary has become an alpha move in itself.\n\nOf course, not all bows are tied equal. In the appallingly watchable TV show All’s Fair, Sarah Paulson’s stuffy lawyer wears one around her neck that is so large she can barely see over it – apt for a character who is suffocated by her own desire to be in the girls’ club.\n\nThen there’s Kate Garraway. It would be a stretch to describe the TV anchor as a style icon, yet among Claudia Winkleman’s gothy knits and Jonathan Ross’s chaotic prints on Celebrity Traitors, it was Garraway’s strategic use of bows – a red beret covered in pink bows and a white jumper covered in delicate black ones – that jumped out. Eagle-eyed viewers spotted that the jumper was from Debenhams and the hat from H&M, real woman-of-the-people stuff. But others saw something else: a contestant on a show that hinges on players forming robust alliances, desperately trying to soften her image by using one of the most loaded accessories in the history of fashion. The bow seemed to say Garraway “does have a softness – we’ve just missed it”, says de Wyngaert.\n\nView image in fullscreen Ncuti Gatwa in Ozwald Boateng at this year’s Met Gala. Photograph: Gilbert Flores/Variety/Getty Images\n\nIn all this, it’s easy to forget that bows are also just a way of tying something. “Bows have always been decorative and feminine,” says Bahnsen. “Personally, I use them as an adjustment system to change the shape or size of something.” The Danish designer would always choose a bow over a button or a zip: “A big bow around the waist can completely change a garment.”\n\nBut even that comes back to sex. “Yes, they’re a way of closing or opening something, but depending on where the bow is, you can’t escape from the fact that you’re tying yourself up as a gift for someone,” says Steele. “It’s a gender signifier but also an erotic signifier – a bow says: untie me!.”",
  "summary": "<p>They can be garish and ostentatious, or a sign you are softer than you might first appear. From the catwalk to the high street to the big screen to the rugby pitch, you just can’t miss them right now</p><p>Wuthering Heights is a story about pain, revenge and the Yorkshire moors as a metaphor for bad life choices. But if Emerald Fennell’s forthcoming adaptation is anything to go by, it’s also about bows.</p><p>In the <a href=\"https://www.youtube.com/watch?v=3fLCdIYShEQ\">two-minute trailer</a> for the film, Cathy wears red bows and black bows, navy bows and pink bows. There are bows around garden pots, and bows around “baddy” Edgar Linton’s throat. Some bows flutter in the fell wind, others are unlaced at speed. In one memorable shot straight from the Jilly Cooper precoital playbook, a pretty white bow is cut from Cathy’s bodice using a labourer’s knife, which would be unforgivable hamminess were it not incredibly hot. Never mind that Emily Brontë rarely mentions bows in the book; that one is an entire plot device.</p> <a href=\"https://www.theguardian.com/fashion/2025/nov/18/big-bows-style-trend-feminine-ironic-strangely-subversive\">Continue reading...</a>",
  "published": "Tue, 18 Nov 2025 05:00:25 GMT",
  "url": "https://www.theguardian.com/fashion/2025/nov/18/big-bows-style-trend-feminine-ironic-strangely-subversive",
  "source": "The Guardian"
}