{
  "title": "Scientists finally discover what’s fueling massive sargassum blooms",
  "text": "By early June this year, an estimated 38 million tons of Sargassum drifted toward the coastlines of the Caribbean islands, the Gulf of Mexico, and northern South America, setting an unfortunate new record. During the summer, these floating mats of brown algae collect in large amounts on beaches where they decay and release an unpleasant smell. This buildup discourages visitors and stresses coastal ecosystems. Far from shore, however, Sargassum drifting at the surface provides food and shelter for many marine animals.\n\nThe algae originate in the Sargasso Sea east of Florida. Since 2011, scientists have tracked the recurring appearance of the Great Atlantic Sargassum Belt, a massive band of gulfweed that moves from the equator toward the Caribbean during periods of strong easterly winds. Until recently, the source of the phosphorus (P) and nitrogen (N) that fueled its rapid growth remained uncertain. Some had proposed that agricultural runoff or nutrients released by rainforest deforestation were responsible. These explanations, however, do not match the steady increase in Sargassum biomass seen in recent years.\n\nIdentifying the Forces Behind the Blooms\n\nA team of international researchers led by the Max Planck Institute for Chemistry has now determined the primary process driving these large-scale blooms. They have also identified the climate patterns that set the stage for this growth, allowing them to begin developing a system that could predict future Sargassum arrivals.\n\nIn a recent publication in Nature Geoscience, the researchers describe how strong wind-driven upwelling near the equator brings phosphorus-rich deep water to the surface and transports it northward into the Caribbean. The increased supply of phosphorus benefits cyanobacteria that live on the surface of the brown algae. These microorganisms capture atmospheric nitrogen gas (N 2 ) and convert it into a form that Sargassum can use, a process known as nitrogen fixation. Cyanobacteria commonly colonize Sargassum, forming a partnership that provides the algae with an extra nitrogen source. According to the study, this symbiosis offers Sargassum a competitive advantage over other algae in the Equatorial Atlantic and helps explain the changes in Sargassum abundance recorded in past years.\n\nCoral Cores Reveal a Century of Nitrogen Fixation\n\nThe team linked algae growth, enhanced nitrogen fixation, and the upwelling of cool, nutrient-rich waters by studying coral cores collected across the Caribbean. Corals serve as long-term environmental archives because their skeletons incorporate chemical traces from the surrounding water as they grow. By examining their yearly growth layers, similar to tree rings, scientists can reconstruct changes in ocean chemistry over centuries.\n\nIn this study, the researchers measured the nitrogen isotopic composition in corals to infer how much nitrogen microorganisms have fixed over the past 120 years. During nitrogen fixation, bacteria reduce the ratio of the stable nitrogen isotopes 15N to 14N in seawater. When corals display low 15N to 14N ratios, it signals periods of increased nitrogen fixation. To confirm the meaning of these chemical signatures, seawater samples collected by the research vessel Eugen Seibold were used to calibrate the nitrogen isotopes in modern corals, demonstrating that they reliably record nitrogen fixation.\n\nCoupled Trends Since 2011\n\nJonathan Jung, a PhD student at the Max Planck Institute for Chemistry and the study's lead author, explains, \"In the first set of measurements we noticed two significant increases in nitrogen fixation in 2015 and 2018, two years of record Sargassum blooms. So we compared our coral reconstruction with annual Sargassum biomass data, and the two records aligned perfectly! At that time, however, it was not at all clear whether there was a causal link.\"\n\nA deeper comparison showed that algae biomass and nitrogen fixation have been consistently linked since 2011, including both high and low values. This timing is notable because in 2010 strong winds transported brown algae from the Sargasso Sea into the tropical Atlantic for the first time.\n\nRuling Out Other Nutrient Sources\n\nAfter eliminating other ideas, the team concluded that an oversupply of phosphorus is the main factor behind major Sargassum events. Earlier theories that Saharan dust carried iron that could stimulate algae growth did not match biomass records. Similarly, nutrient inputs from the Amazon or Orinoco rivers showed no correlation with the timing or intensity of Sargassum blooms.\n\nA Mechanism That Improves Future Predictions\n\nThe researchers describe a process in which phosphorus delivered by upwelling deep water and nitrogen supplied by nitrogen-fixing bacteria together fuel the blooms seen over past decades. Geochemist Jung notes, \"Our mechanism explains the variability of Sargassum growth better than any previous approaches. However, there is still uncertainty as to whether and to what extent other factors also play a role.\"\n\nThe arrival of phosphorus-rich water depends on cooler sea surface temperatures in the tropical North Atlantic and warmer conditions in the southern Atlantic. These temperature differences shift air pressure patterns, creating changes in wind strength and direction that move surface waters aside and allow the deeper phosphorus-rich water to rise.\n\nAccording to the researchers in Mainz, monitoring wind conditions, sea surface temperatures, and associated upwelling patterns in the equatorial Atlantic can help refine predictions of future Sargassum growth. Alfredo Martínez-García, group leader at the Max Planck Institute for Chemistry and senior author of the study, explains, \"Ultimately, the future of Sargassum in the tropical Atlantic will depend upon how global warming affects the processes that drive the supply of excess phosphorous to the equatorial Atlantic.\" The team plans to expand their analysis by examining new coral records from multiple locations throughout the Caribbean. They expect that these insights will support efforts to protect coral reefs and help coastal communities manage the growing ecological and economic impacts of Sargassum blooms.",
  "summary": "Massive Sargassum blooms sweeping across the Caribbean and Atlantic are fueled by a powerful nutrient partnership: phosphorus pulled to the surface by equatorial upwelling and nitrogen supplied by cyanobacteria living directly on the drifting algae. Coral cores reveal that this nutrient engine has intensified over the past decade, perfectly matching surges in Sargassum growth since 2011. By ruling out older theories involving Saharan dust and river runoff, researchers uncovered a climate-driven process that shapes when and where these colossal seaweed mats form.",
  "published": "Wed, 19 Nov 2025 03:56:56 EST",
  "url": "https://www.sciencedaily.com/releases/2025/11/251118220054.htm",
  "source": "All Top News -- ScienceDaily"
}