{
  "title": "Congress to hold rally against SIR at Delhi’s Ramlila Maidan: ‘Election Commission working on behalf of BJP and Narendra Modi’",
  "text": "The Congress said Tuesday that it will hit the streets to protest against the ongoing Special Intensive Revision (SIR) of electoral rolls in 12 states and Union Territories (UTs), and plans to hold a “massive” rally in the first week of December at Ramlila Maidan in Delhi.\n\nAddressing reporters after a meeting of the Congress high command in Delhi with leadership from the 12 states and UTs where the SIR is underway, Congress general secretary (organisation) K C Venugopal said, “We are going to the streets. In the first week of December, the Congress party will hold a massive rally at the Ramlila Maidan, attended by lakhs of people. We will expose the Election Commission of India (ECI) again.”\n\n“The motive of the ECI is to destroy democracy and Opposition parties, which has never happened in Indian democracy,” said Venugopal.\n\nCongress chief Mallikarjun Kharge and Lok Sabha Leader of Opposition Rahul Gandhi were also part of the meeting held at the Congress headquarters, Indira Bhawan.\n\n‘SIR designed to delete votes of some sections of society’\n\nVenugopal said, “Generally, the feeling of the state units is that the ECI is purposely trying to delete votes of some sections of society. The design of the SIR is to delete targeted votes. This is what we experienced in Bihar, too, and now, they are going to start it in 12 states.”\n\nThe Congress leader said that this “is a sinister attempt by the ECI to destroy democracy in the country”.\n\nStory continues below this ad\n\n“It is completely unethical and undemocratic. Usually, the revision of the electoral roll takes place for a longer period… You can see that booth level officers (BLOs) are dying by suicide because of work pressure. This process typically takes six months to one year. However, BLOs are now being pressured to do it within one month. What is the need?” he said.\n\nVenugopal also mentioned the Kerala state Assembly resolution seeking the postponement of the SIR exercise.\n\n“The CEO (Chief Electoral Officer) of Kerala has requested the ECI that this is not the right time to do the SIR. All political parties, except the BJP, have demanded the same thing. But the ECI doesn’t listen to anything. It is very clear that they are working only on behalf of the BJP and Narendra Modi,” he said.\n\nKerala Monday moved a resolution that was passed unanimously in the state Legislative Assembly, urging the ECI to reconsider its decision to roll out the SIR of electoral rolls across the country.\n\nStory continues below this ad\n\nFollowing Bihar, the second phase of the SIR is currently taking place in the Andaman and Nicobar Islands, Chhattisgarh, Goa, Gujarat, Kerala, Lakshadweep, Madhya Pradesh, Puducherry, Rajasthan, Tamil Nadu, Uttar Pradesh, and West Bengal.\n\nAmong these, Kerala, West Bengal, Tamil Nadu, and Puducherry will hold Assembly polls next year.",
  "summary": "",
  "published": "Tue, 18 Nov 2025 15:47:05 +0000",
  "url": "https://indianexpress.com/article/india/congress-rally-sir-delhi-ramlila-maidan-rahul-gandhi-10372954/",
  "source": "India | The Indian Express"
}