{
  "title": "Businesses are running out of pennies in the US",
  "text": "Businesses are running out of pennies in the US\n\nA penny is worth one cent, or one-hundredth of a US dollar.\n\nIn February, President Donald Trump said producing the coin was wasteful and too expensive and on social media called to \"rip the waste out of our great nation's budget, even if it's a penny at a time\".\n\n\"That adds up really quickly,\" said Dylan Jeon, senior director of government relations with the National Retail Federation\n\nSince the Trump administration ended minting the one-cent coins earlier this year, those still in circulation are becoming harder to find. Many stores are now rounding their cash sales down to the nearest five cents, saying there are no federal guidelines on how to proceed.\n\nThe US Mint officially stopped making pennies in May. The Treasury Department estimated shortages would start in early 2026, but they actually came much sooner. Banks can't get pennies from the federal government, so businesses can't get them from the banks.\n\n\"We first heard about the issue in late August, early September,\" Mr Jeon said. \"It's really impacting any business that deals with cash payments.\"\n\nNow store clerks don't know what to do when their tills are bare and someone needs change in pennies from a cash purchase.\n\nThe temporary solution for many, Mr Jeon said, is rounding the price of the sale up or down to the nearest five cents so the customer can use a nickel, the next lowest tender in the US.\n\nBut some cities, including New York, require retailers to give exact change and others don't allow cash payments to differ from card payments for the same item, Mr Jeon said.\n\nTo avoid lawsuits and customer complaints, many retailers have chosen to just round down.\n\n\"You're talking about losing up to four cents for every cash transaction across multiple stores across the country,\" he said. \"It's unsustainable.\"\n\nMany stores are now urging customers to pay in exact change. Others are hosting promotions for customers to bring in extra pennies they have at home.\n\nConvenience stores are some of the hardest hit by the shortage, said Jeff Lenard, a spokesperson for the National Association of Convenience Stores.\n\nConvenience giant Kwik Trip has announced it is rounding down to the nickel, which it says will cost it up to $3m (£2.3m) this year.\n\nAmerican coins have been discontinued before, including the half-cent, three-cent and 20-cent pieces that were retired in the 1800s, Mr Lenard said. It's been many years, though, since a staple like the penny - which entered ciruclation in 1793 - has ceased production.\n\n\"People don't want the penny until they can't get it back in change,\" he said.",
  "summary": "Find a penny, pick it up, then what? Now the US has stopped making pennies,  a shortage has emerged and created confusion.",
  "published": "Fri, 31 Oct 2025 21:54:31 GMT",
  "url": "https://www.bbc.com/news/articles/c20556ly45eo?at_medium=RSS&at_campaign=rss",
  "source": "BBC News"
}