{
  "title": "7th Colombo Security Conclave: Doval, NSAs discuss ways to boost maritime safety, counter terrorism",
  "text": "National Security Advisor (NSA) Ajit Doval held a discussion with his counterparts from Maldives, Mauritius, Sri Lanka, Bangladesh, Seychelles and Malaysia at the 7th NSA-level meeting of the Colombo Security Conclave (CSC) here on Thursday.\n\nDuring the meet, the NSAs discussed ways of enhancing cooperation under identified pillars, maritime safety and security; countering terrorism and radicalisation; combating trafficking and transnational organised crime; cyber security and protection of critical infrastructure and technology; and humanitarian assistance and disaster relief, including through training and capacity building.\n\n“At the 7th NSA level meeting, the first Secretary General, appointed by India, presented a comprehensive review to the CSC member states on the decisions taken at the 6th NSA-level meeting in Mauritius on 7-8 December 2023 and activities undertaken since then under the five pillars of cooperation, namely Maritime Safety and Security; Countering Terrorism and Radicalisation; Combating Trafficking and Transnational Organised Crime; Cyber Security and Protection of Critical Infrastructure and Technology; and Humanitarian Assistance and Disaster Relief,” the Ministry of External Affairs said.\n\nThe CSC Members welcomed the decision of Republic of Seychelles to accede to the CSC as a full member.\n\nThis comes at a time when the region is facing challenges of terrorism, including the recent terror attack in Delhi, trafficking of individuals for cybercrimes and maritime security threats.\n\nSources said that security challenges and the threat perceptions from countries in the region and beyond were discussed during the deliberations.\n\nThe MEA said that delegations of Member States were respectively led by Ibrahim Latheef, DC (Retd.), Lt. Col. (Retd.), NSA, Republic of Maldives; Rahul Rasgotra, NSA, Republic of Mauritius; and Air Vice Marshal Sampath Thuyacontha (Retd.), Secretary, Ministry of Defence, Democratic Socialist Republic of Sri Lanka; and Dr. Khalil-ur-Rehman, NSA, People’s Republic of Bangladesh.\n\nStory continues below this ad\n\nWhile Seychelles participated as an observer state, and Malaysia was invited as a guest.\n\nThe delegation from Seychelles was led by Major General Michael Rosette, Chief of Defence Forces, Republic of Seychelles Defence Forces. Malaysia was represented by Badrul Shah Mohd Idris, Deputy Director General of the Malaysian National Security Council.\n\nThe CSC was formed to promote closer cooperation between member states on security matters and to strengthen partnerships for enhancing regional security in the Indian Ocean Region. The signing ceremony for the Founding Documents of the CSC was held in Sri Lanka in August 2024.",
  "summary": "",
  "published": "Thu, 20 Nov 2025 22:43:12 +0000",
  "url": "https://indianexpress.com/article/india/7th-colombo-security-conclave-doval-nsas-discuss-ways-to-boost-maritime-safety-counter-terrorism-10377366/",
  "source": "India | The Indian Express"
}