{
  "title": "DOJ case against Comey faces troubles. And, powerful figures in latest Epstein docs",
  "text": "DOJ case against Comey faces troubles. And, powerful figures in latest Epstein docs\n\nGood morning. You're reading the Up First newsletter. Subscribe here to get it delivered to your inbox, and listen to the Up First podcast for all the news you need to start your day.\n\nToday's top stories\n\nThe Justice Department yesterday informed the judge overseeing the criminal case against former FBI Director James Comey that the full grand jury never reviewed the final indictment against him. The government described this as little more than a paperwork error. But Comey's attorney disagreed, saying this is grounds to have the case dismissed. Comey faces false statement and obstruction charges tied to congressional testimony he gave in 2020.\n\ntoggle caption Alex Wong/Getty Images\n\n🎧 Former federal prosecutors expressed to NPR's Ryan Lucus that the fact that the full jury didn't see the final indictment is a self-inflicted wound by the government. Lucus says the judge overseeing the case sounded concerned, and the DOJ's action raises questions about the validity of the indictment itself. A magistrate judge who ordered the government to hand over all grand jury materials to the defense a few days ago says there has been a pattern of \"profound investigative missteps\" in the case.\n\nPresident Trump has signed the bill that directs the Justice Department to make public its case files on convicted sex offender Jeffrey Epstein. Ahead of the new documents' release, there is renewed focus on what the thousands of pages that are already public divulge about the president. The documents also reveal other powerful people who kept close ties with Epstein, even after he became a registered sex offender.\n\n\n\nSponsor Message\n\n🎧 Rich and powerful academics, lawyers, politicians and more sought counsel from Epstein, NPR's Stephen Fowler tells Up First. Epstein gave former Trump strategist Steve Bannon advice on how to build a far-right political movement in Europe. There were also several high-profile Democrats in Epstein's orbit, and the president is directing the DOJ to investigate links among the prominent names, including former President Bill Clinton. But some of Epstein's accusers are urging Trump to avoid partisanship and focus on the powerful people that they say have not faced scrutiny, regardless of political affiliation.\n\nTech company Nvidia announced yesterday that it generated $32 billion in profit over the last three months. In recent weeks, it reached a valuation of $5 trillion. The company is fueling much of Wall Street's optimism surrounding artificial intelligence.\n\n\n\n🎧 Tech, and AI in particular, makes up a huge portion of the stock market, says NPR's Maria Aspan. AI-related stocks make up almost half of the value of the S&P 500. While Wall Street is pinning its hopes on the AI boom, the companies investing in the technology are not yet seeing significant tangible results. Aspan notes that it is essential to remember that the stock market is not the economy; it is often an indicator of the economy's performance. Much of the AI boom is driving the market to record highs, which means investors may overlook questions about what is actually happening in the economy.\n\nSponsor Message\n\nToday's listen\n\ntoggle caption Scott A Garfitt/Scott A Garfitt/Invision/AP/Invision\n\nScottish singer-songwriter Lewis Capaldi realized he needed to change his life when he was performing at Glastonbury Festival in 2023. His voice cracked. Then, one shoulder twitched uncontrollably — a symptom of his Tourette syndrome. He found himself unable to finish the chorus of his hit \"Someone You Loved.\" During an interview with Morning Edition host Leila Fadel, Capaldi said that looking back, he needed that moment, and it ultimately saved him. The singer was absent from the spotlight for almost two years, but he has now returned with a new EP, Survive. It's only four tracks long — a decision Capaldi says was intentional and made to sidestep perfectionism and the pressure of his second album. Listen to Capaldi discuss his journey back to the stage and hear snippets of his new music.\n\nIf you or someone you know may be considering suicide or is in crisis, call or text 988 to reach the Suicide & Crisis Lifeline.\n\nLife advice\n\nEnlarge this image Photograph by Reet Talreja/Unsplash; Collage by Kaz Fantone/NPR Photograph by Reet Talreja/Unsplash; Collage by Kaz Fantone/NPR\n\nCrowded airports, high ticket prices, the risk of bad weather and flight delays can make flying for the holidays stressful. To help you make informed travel decisions, Scott Keyes, founder of the travel site Going.com, offered his insights to Life Kit.\n\n\n\n✈️ If you travel on the actual holiday, you will encounter fewer crowds, reduced fares, and fewer flight disruptions.\n\n✈️ Avoid peak travel days. For Thanksgiving, the busiest days are Tuesday and Wednesday before the holiday and Saturday and Sunday after.\n\n✈️ Direct flights have the advantage of not having layovers, which can get delayed and cause you to miss your connecting flight.\n\nFor more tips on how to avoid flight delays this holiday season, listen to this episode of NPR's Life Kit. Subscribe to the Life Kit newsletter for expert advice on love, money, relationships and more.\n\n3 things to know before you go\n\ntoggle caption Andy Kropa/Invision\n\nAuthor Rabih Alameddine won the 2025 National Book Award for Fiction with his novel The True True Story of Raja the Gullible (and His Mother). Here's who else took home awards last night. The small Caribbean nation of Curaçao has set a historic record by becoming the least populous country ever to reach the FIFA World Cup. This week, NPR's Far-Flung Postcard series takes you to a carving shop in Yimianpo, China, where artisans sculpt Russian nesting dolls.\n\nSponsor Message\n\nThis newsletter was edited by Suzanne Nuyen.",
  "summary": "The DOJ's case against former FBI Director James Comey faces new challenges. And, newly released emails name powerful figures who stayed close to Jeffrey Epstein even after his conviction.",
  "published": "Thu, 20 Nov 2025 06:56:57 -0500",
  "url": "https://www.npr.org/2025/11/20/g-s1-98494/up-first-newsletter-james-comey-epstein-files-nvidia",
  "source": "NPR Topics: World"
}