{
  "title": "Tea, berries, dark chocolate and apples could lead to a longer life span, study shows",
  "text": "New research has found that those who consume a diverse range of foods rich in flavonoids, such as tea, berries, dark chocolate, and apples, could lower their risk of developing serious health conditions and have the potential to live longer.\n\nThe study was led by a team of researchers from Queen's University Belfast, Edith Cowan University Perth (ECU), and the Medical University of Vienna and Universitat Wien.\n\nThe findings reveal that increasing the diversity of flavonoids within your diet could help prevent the development of health conditions such as type 2 diabetes, cardiovascular disease (CVD), cancer and neurological disease.\n\nFlavonoids are found in plant foods like tea, blueberries, strawberries, oranges, apples, grapes, and even red wine and dark chocolate.\n\nPublished in Nature Food, the study tracked over 120,000 participants aging from 40 to 70 years old for over a decade. It is the first study of its kind to suggest that there is a benefit to consuming a wide range of flavonoids beyond that of simply consuming a high quantity.\n\nECU Research Fellow, first author and co-lead of the study Dr Benjamin Parmenter, made the initial discovery that a flavonoid-diverse diet is good for health.\n\n\"Flavonoid intakes of around 500 mg a day was associated with a 16% lower risk of all-cause mortality, as well as a ~10% lower risk of CVD, type 2 diabetes, and respiratory disease. That's roughly the amount of flavonoids that you would consume in two cups of tea.\"\n\nDr Parmenter added, however, that those who consumed the widest diversity of flavonoids, had an even lower risk of these diseases, even when consuming the same total amount. For example, instead of just drinking tea, it's better to eat a range of flavonoid-rich foods to make up your intake, because different flavonoids come from different foods.\n\n\"We have known for some time that higher intakes of dietary flavonoids, powerful bioactives naturally present in many foods and drinks, can reduce the risk of developing heart disease, type 2 diabetes, and neurological conditions like Parkinson's,\" study co-lead Professor Aedín Cassidy from the Co-Centre for Sustainable Food Systems and Institute for Global Food Security at Queen's said.\n\n\"We also know from lab data and clinical studies that different flavonoids work in different ways, some improve blood pressure, others help with cholesterol levels and decrease inflammation. This study is significant as the results indicate that consuming a higher quantity and wider diversity has the potential to lead to a greater reduction in ill health than just a single source.\"\n\nProfessor Tilman Kuhn from the Medical University of Vienna, Universitat Wien and Queen's University Belfast was also a co-lead author, noted that the importance of diversity of flavonoid intake has never been investigated until now, making this study very significant as the findings align with popular claims that eating colourful foods are invaluable to maintain good health.\n\n\"Eating fruits and vegetables in a variety of colours, including those rich in flavonoids, means you're more likely to get the vitamins and nutrients you need to sustain a healthier lifestyle,\" he said.\n\nThe first-ever dietary guidelines for flavonoids were released recently recommending increasing the consumption of flavonoids to maintain health.\n\n\"Our study provides inaugural evidence that we may also need to advise increasing diversity of intake of these compounds for optimal benefits,\" Dr Parmenter said.\n\n\"The results provide a clear public health message, suggesting that simple and achievable dietary swaps, such as drinking more tea and eating more berries and apples for example, can help increase the variety and intake of flavonoid-rich foods, and potentially improve health in the long-term,\" Professor Cassidy added.",
  "summary": "New research has found that those who consume a diverse range of foods rich in flavonoids, such as tea, berries, dark chocolate, and apples, could lower their risk of developing serious health conditions and have the potential to live longer.",
  "published": "Tue, 03 Jun 2025 11:50:28 EDT",
  "url": "https://www.sciencedaily.com/releases/2025/06/250603115028.htm",
  "source": "Latest Science News -- ScienceDaily"
}