{
  "title": "Wetlands and wildlife in the Netherlands: slowing down and connecting with nature in Friesland",
  "text": "If there are times when the sights, smells and sounds of a new destination are best downed in a single, heady, flaming sambuca of a weekend, there are others when a more slow-drip pace is called for. Such is the case with De Alde Feanen, in Friesland. One of the most peaceful national parks in the Netherlands, this 4,000-hectare wetland slows down naturally after the summer season. Its waterways shrug off their summer flocks of kayakers, paddleboarders, boat trippers and terrace diners. Museums and galleries close. The local tourist office winds down. Even the park’s population of nesting storks fly south.\n\nA 20-minute drive south-east of Leeuwarden, in the country’s north-east, the lakes, ponds, ditches and canals of “The Old Fens” are the remains of the peat-cutting that began there in the middle ages. Now awash with reeds, rushes and sedges, its watery habitats are richly biodiverse, home to more than 100 bird species as well as otters, pine martens, roe deer and dragonflies. Hay meadows and wetland forest add marsh thistle, reed orchids, alders and willows to the list. Ribboned with well-marked hiking and cycling trails, the proximity to nature draws spring and summer tourists but treasures can be found there in autumn and winter too; among them thousands of ducks and geese, and some of the starriest skies in the Netherlands.\n\nIn search of a place to be rather than do, my son and I book a simple cabin, De Ooievaar (“the Stork”), with a plan to walk, cycle, read and sleep. Upcycled from an old barn during the pandemic by owner Jurjen Veldboom, the cabin’s galley kitchen and wooden sleeping platforms give it the cosy feel of a boat but it’s the picture window in its living room that sells it to us. With a sofa to one side and a wood burner on the other, it’s the perfect winter roost: a place to sit and sketch, or watch deer bouncing through the alders.\n\nView image in fullscreen Wooden heart … De Ooievaar cabin. Photograph: Rhiannon Batten\n\nTo get our bearings we start with a gentle walk, spotting a white heron almost as soon as we step outside. A skein of geese skim the sky above us as we wander along a blustery 15-minute track through the reeds to the park’s gateway village, Earnewâld. Winding between its doll’s house-like buildings to the Princenhof Hotel, we eat bowls of salty fish soup while watching the soporific ebb and flow of small cargo boats.\n\nWhen we arrived, Jurjen told us that canny marketeers have a new verb for winter holidaying in Friesland: opfriezen is a play on words that means embracing the cold (with the help of a cosy hot tub or sauna) in Friesland. Back at the cabin, we give it a go, slipping into the site’s sauna at dusk and listening to the soothing ticking of the heater’s timer, cocooned in its warm, timber embrace. What follows is even more uplifting, though: opening the door into the dark Friesland night, a huge gibbous moon is glowing above us, the skeins of geese replaced by stars and the cabin’s twinkling lights giving it the look of a giant gingerbread house.\n\nOpening the door into the dark Friesland night, a huge moon is glowing above us, the skeins of geese replaced by stars\n\nThe following morning we hire two e-bikes from Hollema in Earnewâld (€25pp a day), where owner Rikele Hollema meets us with a map for a gentle 50km route looping through the eastern corner of the park and then out to the villages and forests around Beetsterzwaag.\n\nCycling out along little paths crunchy with seashells is like pedalling through one of Jan Hendrik Weissenbruch’s paintings. Skirting low fields where the horizon is broken only by the odd birch tree or farmhouse, there’s more sky than land, and it’s filled with clouds that look like balls of scrunched-up paper, soft grey shadows tucked into creases in the white. Cycling along these flat, empty paths, hopping on and off little foot and bike ferries to cross bridge-less stretches of water, is a meditative experience. A feeling that’s later heightened when the sun emerges and we dip into forests where the light is sieved through golden beech leaves.\n\nBeyond the palatial houses of Beetsterzwaag, in Olterterp we stop at De Witte Huis for lunch – fat chips and bowls of mustard soup hiding slivers of sausage. It’s just the fuel we need for the long ride back along the windy polders, catching the whimsical sight along the way of three cows sailing past on a ferry, and two swans flying alongside us, their white plumage glowing against the rose gold of the rushes.\n\nView image in fullscreen Water wheel … Rhiannon’s son with his rented e-bike on a ferry. Photograph: Rhiannon Batten\n\nThat evening, with Jurjen’s help, I track down Jannie Slot, project coordinator for a new mindfulness walking trail launched in the park this summer. Designed to get visitors offscreen, slowing down and reconnecting with their surroundings, those who want to try it have to borrow a physical copy of the guide and then follow its prompts as they walk the 5km route. She tells me of the tricky balance between welcoming visitors and protecting the park but believes that if people can connect with nature, they will love it and want to protect it.\n\nCycling along these flat, empty paths, hopping on and off little foot and bike ferries to cross bridge-less stretches of water, it’s a meditative experience\n\nFor now the guide is only available in Dutch or German but there are plans to produce an English version. Trying my best with rusty German, I leave my son sleeping and head out into the park at dawn the next day to try it out. The path leads through the reeds and forest paths behind our cabin and, as I walk, I follow the guide’s instructions to listen to the sound of the wind through the reeds. The ground is wet from overnight rain and the air is charged with the calls, rattles, clicks and chitter of blackbirds, goldcrests, reed buntings, wigeon and geese. At various points, I’m encouraged to do some gentle yoga, standing in poses inspired by birds or trees, or to look more deeply at the landscape. It’s not hard this morning. The rising sun is suspended in the ditches around me, coating the water with an ethereal bronze glow.\n\nView image in fullscreen Lake placid … De Alde Feanen national park. Photograph: Rhiannon Batten\n\nThe route leads to an observation tower and when I reach the top, it feels as if I’m at the very soul of the national park, a million shades of sugary golden brown spilling out around me. Towns glimmer on the horizon and a distant road rumbles, but here the hush is broken only by two geese honking away at eye level, and the reflective glint of a nearby windmill.\n\nLater, over coffee, I read that one of the park’s key plants is frogbit. In summer it floats above the water but in winter it retracts below, freezing until the spring, when it re-emerges in search of sunlight. The guide tells me: “It’s also very important, of course, for humans to slow down, take a breath, reflect and rest.” But De Alde Feanen has already taught me that.\n\nTransport from London to Amsterdam was provided Eurostar, which is launching a fifth direct weekday service on 15 December; advance return from £78pp. Onward travel to Earnewald by train and bus. Alternatively, hire a car from Leeuwarden station (greenwheels.nl). Two nights at De Ooievaar campsite from €352. For more information about De Alde Feanen national park, see np-aldefeanen.nl",
  "summary": "<p>The cosy cabins, bike rides and serenity of De Alde Feanen national park make it the perfect place to switch off and unwind in winter</p><p>If there are times when the sights, smells and sounds of a new destination are best downed in a single, heady, flaming sambuca of a weekend, there are others when a more slow-drip pace is called for. Such is the case with De Alde Feanen, in Friesland. One of the most peaceful national parks in the Netherlands, this 4,000-hectare wetland slows down naturally after the summer season. Its waterways shrug off their summer flocks of kayakers, paddleboarders, boat trippers and terrace diners. Museums and galleries close. The local tourist office winds down. Even the park’s population of nesting storks fly south.</p><p>A 20-minute drive south-east of Leeuwarden, in the country’s north-east, the lakes, ponds, ditches and canals of “The Old Fens” are the remains of the peat-cutting that began there in the middle ages. Now awash with reeds, rushes and sedges, its watery habitats are richly biodiverse, home to more than 100 bird species as well as otters, pine martens, roe deer and dragonflies. Hay meadows and wetland forest add marsh thistle, reed orchids, alders and willows to the list. Ribboned with well-marked hiking and cycling trails, the proximity to nature draws spring and summer tourists but treasures can be found there in autumn and winter too; among them thousands of ducks and geese, and some of the starriest skies in the Netherlands.</p> <a href=\"https://www.theguardian.com/travel/2025/nov/18/wetlands-wildlife-slow-travel-friesland-netherlands\">Continue reading...</a>",
  "published": "Tue, 18 Nov 2025 07:00:28 GMT",
  "url": "https://www.theguardian.com/travel/2025/nov/18/wetlands-wildlife-slow-travel-friesland-netherlands",
  "source": "The Guardian"
}