{
  "title": "Animals are developing the same chronic diseases as humans",
  "text": "Across the globe, a wide range of animals, including household pets, livestock, and marine species, are developing serious health problems such as cancer, obesity, diabetes, and degenerative joint disease. These non-communicable diseases (NCDs) chronic diseases are becoming increasingly common, yet the scientific community still lacks broad, interdisciplinary research that explains why they are rising in so many species. Understanding these trends is essential because the same factors influencing animal health often affect people as well.\n\nA recent study in Risk Analysis introduces a new conceptual approach designed to improve monitoring and management of chronic diseases in animals. Led by animal scientist Antonia Mataragka of the Agricultural University of Athens, the research offers an evidence-based risk assessment model. The framework not only supports veterinary health but also provides insights relevant to public health, since humans and animals are experiencing similar increases in chronic illnesses.\n\nGenetic and Environmental Drivers of Disease\n\nAfter reviewing existing research on NCDs in animals, Mataragka's study highlights multiple contributing factors.\n\nGenetic predisposition increases disease risk in certain populations. Dogs and cats that have been selectively bred for appearance and livestock bred for productivity show higher rates of conditions such as diabetes and mitral valve disease.\n\nEnvironmental influences, including poor diet, limited physical activity, and long-term stress, also shape how and when these diseases appear across species.\n\nExamples of these patterns are found in many environments. Obesity is widespread among domestic cats and dogs, with recent surveys estimating that 50-60% fall into the overweight category, which has contributed to yearly increases in feline diabetes. In agricultural settings, about 20% of intensively raised pigs develop osteoarthritis. Marine animals face similar challenges: beluga whales have documented gastrointestinal cancers, while farmed Atlantic salmon experience cardiomyopathy syndrome. Wildlife living in polluted estuaries contaminated with industrial chemicals such as polycyclic aromatic hydrocarbons (PAHs) and polychlorinated biphenyls (PCBs) show liver tumor rates as high as 15-25%.\n\nEnvironmental Change Intensifies Disease Risk\n\nHuman-driven ecological transformation is amplifying these threats. Urbanization, climate disruption, land conversion, and loss of biodiversity increase the frequency and severity of harmful exposures. Warming oceans and the decline of coral ecosystems correlate with higher tumor rates in marine turtles and fish. In cities, rising temperatures and poor air quality contribute to obesity, diabetes, and immune disorders in companion animals, while chemical runoff and airborne pollution influence endocrine function in birds and mammals.\n\n\"As environmental changes accelerate disease emergence, the absence of early diagnostic systems further delays the detection of NCDs in animals,\" says Mataragka. \"While organizations like the World Health Organization provide extensive data on NCD mortality in humans, similar detailed statistics for animals are scarce. This indicates the need for more comprehensive research and enhanced surveillance in veterinary health to better understand and address these issues.\"\n\nUnderstanding Disease Patterns Across Species\n\nThe study assesses NCD prevalence among different animal groups and examines how specific risk factors contribute to disease development. It proposes mitigation strategies at four levels: individual, population (herd), ecosystem, and policy. The findings highlight climate change, habitat degradation, pollution, and dietary imbalance as major forces increasing vulnerability among pets, livestock, and wildlife.\n\nLinking One Health and Ecohealth Approaches\n\nMataragka's model blends One Health and Ecohealth frameworks, both of which emphasize the connections between human, animal, and environmental well-being (but typically operate independently). By bringing these perspectives together, the model shows how biological susceptibility (genetic predisposition) intersects with environmental and socio-ecological pressures to drive disease.\n\nShe hopes this integrated approach will support more coordinated monitoring of animals, people, and ecosystems and help identify early warning signs of rising NCDs. By recognizing shared drivers of chronic illness, researchers and policymakers may be better equipped to reduce disease risks across species.",
  "summary": "Across the planet, animals are increasingly suffering from chronic illnesses once seen only in humans. Cats, dogs, cows, and even marine life are facing rising rates of cancer, diabetes, arthritis, and obesity — diseases tied to the same factors affecting people: genetics, pollution, poor nutrition, and stress. A new study led by scientists at the Agricultural University of Athens proposes a unified model linking these conditions across species.",
  "published": "Mon, 17 Nov 2025 03:21:37 EST",
  "url": "https://www.sciencedaily.com/releases/2025/11/251116105735.htm",
  "source": "All Top News -- ScienceDaily"
}