{
  "title": "Musk's Twitter promised a purge of blue check marks. Instead he singled out the New York Times",
  "text": "New York CNN —\n\nSome VIP Twitter users woke up on Saturday expecting to have lost their coveted blue verification check marks in a previously announced purge by Elon Musk. Instead, Twitter appeared to target a single account from a major publication Musk dislikes and changed the language on its site in a way that obscures why users are verified.\n\nTwitter had said it would “begin winding down” blue checks granted under its old verification system — which emphasized protecting high-profile users at risk of impersonation — on April 1. In order to stay verified, Musk said, users would have to pay $8 per month to join the platform’s Twitter Blue subscription service, which has allowed accounts to pay for verification since December.\n\nMost legacy blue check holders found this weekend that their verification marks had not disappeared, but rather had been appended with a new label reading: “This account is verified because it’s subscribed to Twitter Blue or is a legacy verified account.” The language, which shows up when users click on the check mark, makes it unclear whether verified accounts are actually notable individuals or simply users who have paid to join Twitter Blue.\n\nBut one high-profile account did lose its blue check over the weekend: the main account for the New York Times, which had previously told CNN it would not pay for verification.\n\nAfter an account that often engages with Musk posted a meme this weekend about the Times declining to pay for verification, Musk responded in a tweet saying, “Oh ok, we’ll take it off then.” Musk then lashed out at the Times — just the latest instance of the billionaire slamming journalists or media outlets — in a series of tweets that claimed the outlet’s coverage is boring and “propaganda.”\n\nThe weekend moves are just the latest example of Twitter creating confusion and whiplash for users over feature changes — and in this case, not just any users, but many of the most high-profile accounts that have long been a key selling point for the platform. It also highlights how Musk often appears to guide decisions about the platform more by whims than by policy.\n\nAlthough the New York Times’ main account lost its blue check, its other accounts, such as those for its arts, travel and books content, remained verified. (It’s not clear why the New York Times doesn’t have a gold “organizations” check mark, like accounts for other news outlets, including the Associated Press and the Washington Post.) After its blue check was removed, a spokesperson for the New York Times reiterated to CNN that it does not plan to pay for verification.\n\nTwitter, which laid off most of its public relations staff last fall, did not immediately respond to a request for comment.\n\nIn a separate puzzling move, Twitter’s blue bird logo at the top of the site was replaced on Monday with doge, the meme representing the cryptocurrency dogecoin, which Musk has promoted. The price of dogecoin shot up 20% on Monday.\n\nMusk’s long campaign against “legacy” blue checks\n\nMusk has been threatening to take away “legacy” blue check marks from users verified under Twitter’s old system since shortly after he bought Twitter last fall.\n\nIn early November, Twitter launched the option for people paying for its Twitter Blue subscription service to receive blue checks. The program was quickly put on pause after being plagued by a wave of celebrity and corporate impersonators, and was relaunched in December.\n\nTwitter also rolled out a color-coded verification system with differently colored marks for companies and government entities, but Musk continued to say that individual users would eventually have to pay for blue checks.\n\nIn the days leading up to the blue check purge that wasn’t, prominent users such as actor William Shatner and anti-bullying activist Monica Lewinksy pushed back against the idea that, as power users that draw attention to the site, they should have to pay for a feature that keeps them safe from impersonation.\n\nBy muddying the reason accounts are verified, the new label could risk making it easier for people to scam or impersonate high-profile users. Experts in inauthentic behavior have also said it’s not clear that reserving verification for paid users will reduce the number of bots on the site, an issue Musk has raised on and off over the past year.\n\nMusk, for his part, has previously presented changes to Twitter’s verification system as a way of “treating everyone equally.”\n\n“There shouldn’t be a different standard for celebrities,” he said in a tweet last week. The paid feature could also drive revenue, which could help Musk, who is on the hook for significant debt after buying Twitter for $44 billion.\n\nMusk last week also said that starting on April 15, only verified accounts would be recommended in users’ “For You” feeds alongside the accounts they follow.\n\n–CNN’s Oliver Darcy contributed to this report.",
  "summary": "Some VIP Twitter users woke up on Saturday expecting to have lost their coveted blue verification check marks in a previously announced purge by Elon Musk. Instead, Twitter appeared to target a single account from a major publication Musk dislikes and changed the language on its site in a way that obscures why users are verified.",
  "published": "Mon, 03 Apr 2023 20:06:03 GMT",
  "url": "https://www.cnn.com/2023/04/03/tech/twitter-blue-checks/index.html",
  "source": "CNN.com - RSS Channel - App International Edition"
}