{
  "title": "How to keep Ozempic/Wegovy weight loss without the nausea",
  "text": "New studies are revealing how medications that act on the glucagon-like peptide-1 (GLP-1) system influence brain networks tied to nausea, thirst, and reward-driven behaviors. GLP-1 drugs include commonly used treatments such as semaglutide (Ozempic, Wegovy), liraglutide (Victoza, Saxenda), and tirzepatide (Mounjaro, Zepbound). These findings will be featured at Neuroscience 2025, the Society for Neuroscience's annual meeting and the largest global event for new research in brain science and health.\n\nMedications that work through the GLP-1 system are widely prescribed for type 2 diabetes and obesity. They imitate a natural hormone released in the digestive tract after eating and signal the brain to reduce hunger. Although these drugs are effective, up to 40% of people taking them experience side effects such as nausea and vomiting, which often lead to stopping treatment. Scientists are now examining whether the helpful actions of GLP-1 medications can be separated from the uncomfortable ones, and whether these drugs might have additional therapeutic applications.\n\nKey New Findings Across Brain and Behavior\n\nToday's new findings show that:\n\nCombining low doses of the drug tirzepatide, a \"dual agonist\" that works, in part, by activating GLP-1 receptors, with the hormone oxytocin results in weight loss without gastrointestinal side effects in obese rats. (James E. Blevins, University of Washington)\n\nNerve cells in the area postrema -- the brain's vomit center -- are important for both weight loss and nausea in response to GLP-1 drugs in mice. (Warren Yacawych, University of Michigan)\n\nIn mice, activation of GLP-1 receptors on cells in the central amygdala activates a newly identified brain circuit that suppresses signals driving pleasure-based eating. (Ali D. Güler, University of Virginia)\n\nGLP-1 receptor agonists suppress thirst as well as appetite, and a region in the forebrain of rats called the median preoptic area appears to be involved in this effect. (Derek Daniels, University at Buffalo)\n\n\"Research demonstrates an effect of these medications on the brain beyond treating diabetes and obesity, via mechanisms that are still not fully understood,\" says Lorenzo Leggio, MD, PhD, a physician-scientist and clinical director of the National Institute on Drug Abuse (NIDA), part of the National Institutes of Health. \"GLP-1 therapies appear to have multiple synergistic effects that may be useful for treating chronic diseases with overlapping neural mechanisms, including binge eating disorders and addictive disorders.\"\n\nThis research was funded by national agencies including the National Institutes of Health (NIH), the Department of Veterans Affairs (VA), and private organizations. The authors are solely responsible for the content, which does not necessarily represent the views of NIH or VA. Media credentials are required for full in-person and online access to Neuroscience 2025.\n\nHighlights From the GLP-1 Press Conference\n\nGLP-1 medications effectively treat type 2 diabetes and obesity by curbing hunger, but these drugs often cause gastrointestinal side effects like nausea and vomiting, as well as decreases in other motivated behaviors like thirst.\n\nWorking with rodent models, research demonstrates that GLP-1 drugs affect reward processing in the brain, and ongoing efforts are working to reduce the gastrointestinal side effects of these drugs.\n\nOxytocin May Enhance Tirzepatide's Weight-Loss Benefits\n\nJames E. Blevins, Abstract PSTR033.02\n\nTirzepatide (TZP; Mounjaro®) is a dual GLP-1 receptor (GLP-1R)/glucose-dependent insulinotropic polypeptide receptor (GIPR) agonist approved for obesity and type 2 diabetes, but it can also lead to nausea, vomiting, and loss of muscle mass. Oxytocin, a hormone known for its role in social behavior, can reduce bodyweight without causing nausea or vomiting.\n\nIn this study, obese rats were treated with low doses of TZP combined with oxytocin. Researchers monitored changes in bodyweight and kaolin intake -- a soft clay animals consume when nauseated -- over 28 days.\n\nOxytocin and low-dose TZP each produced a 6-7% reduction in bodyweight when used alone, but the combination nearly doubled the effect to 11%. Food intake and body fat mass decreased without an increase in kaolin consumption, indicating the absence of gastrointestinal discomfort.\n\nThese findings suggest that pairing oxytocin with lower doses of TZP may promote weight loss while minimizing unpleasant side effects.\n\nPinpointing the Brain Region Responsible for Both Nausea and Weight Loss\n\nWarren Yacawych, Abstract PSTR083.12\n\nGLP-1 receptor agonists reduce hunger and support weight loss through actions in the brain. However, they also frequently cause nausea and vomiting. To understand how these effects are controlled, researchers examined two key brain areas: the nucleus tractus solitarius (NTS) -- involved in satiety -- and the area postrema -- involved in vomiting.\n\nAlthough NTS cells containing GLP-1 receptors naturally help regulate bodyweight, directly targeting this region with GLP-1 receptor agonists did not lead to weight loss. In contrast, targeting the area postrema -- the brain's vomit center -- produced both weight loss and nausea.\n\nThe results indicate that the area postrema is central to both the beneficial and unpleasant effects of GLP-1 receptor agonists. Separating appetite suppression from nausea will be a major focus for improving these medications.\n\nA Newly Identified Brain Circuit That Dampens Reward-Driven Eating\n\nAli D. Güler, Abstract PSTR151.06\n\nGLP-1 receptor agonists can reduce appetite and bodyweight, but the precise neural pathways behind these effects are still being mapped. Using genetically engineered mice, researchers demonstrated that GLP-1 drugs influence two major brain systems: one that regulates hunger and another that reduces cravings for highly \"rewarding\" foods.\n\nThe team studied GLP-1 receptor-expressing cells in the central amygdala. When activated, these cells lowered food intake. They send signals to the ventral tegmental area, which is important for dopamine responses to \"rewarding\" stimuli.\n\nActivation of these central amygdala neurons lowered dopamine activity in this reward circuit, revealing a pathway that connects the amygdala, brainstem, and midbrain. This circuit appears relevant to pleasure-based eating, binge eating, addiction, and other conditions involving reward-related behaviors.\n\nHow GLP-1 Drugs Influence Thirst and Hydration Signals\n\nDerek Daniels, Abstract PSTR083.03",
  "summary": "Scientists are uncovering how GLP-1 drugs like Ozempic and Wegovy act on brain regions that control hunger, nausea, pleasure-based eating, and thirst. These discoveries may help create treatments that keep the benefits of weight loss while reducing unwanted side effects.",
  "published": "Tue, 18 Nov 2025 22:48:02 EST",
  "url": "https://www.sciencedaily.com/releases/2025/11/251118220041.htm",
  "source": "All Top News -- ScienceDaily"
}