{
  "title": "Papua New Guinea ‘not happy’ as Australia walks away from bid to host Cop31",
  "text": "Papua New Guinea has voiced frustration after Australia ditched a bid to co-host next year’s UN climate talks with its Pacific island neighbours.\n\n“We are all not happy. And disappointed it’s ended up like this,” foreign minister Justin Tkatchenko told Agence France-Presse after Australia ceded hosting rights to Turkey.\n\nAustralia had been pushing to host Cop31 next year alongside south Pacific nations which are increasingly threatened by rising seas and climate-fuelled disasters.\n\nBut Australia pulled the plug on its long-touted bid after Turkey, the other prospective host, refused to back down. It would have been the first time the region had hosted the UN’s premier climate summit.\n\nTurkey will host next year’s UN climate summit while Australia will lead the conference’s negotiations among governments, under a compromise deal taking shape in talks in Brazil, Australian prime minister Anthony Albanese said on Thursday.\n\nMinister Tkatchenko on Thursday criticised the entire Cop summit process as a waste of time. “What has Cop achieved over the years. Nothing,” said Papua New Guinea’s top diplomat.\n\n“It’s just a talk fest and doesn’t hold the big polluters accountable.”\n\nPacific Island leaders have long criticised COP summits for marginalising their voices or offering limited practical solutions as they battle the mounting costs of climate change.\n\nThey hoped that co-hosting duties could change that and raise awareness. But winning the COP hosting would also have drawn extensive scrutiny on Australia’s green record. The country has long profited from fossil fuel exports and treated climate action as a political and economic liability.\n\nThe former prime minister of Tuvalu – which may become uninhabitable this century if planet-heating emissions are not constrained – said the decision showed “the non-committal of Australia to climate justice”.\n\nTuvalu, a tiny nation of thinly populated atolls and reef islands, is among the world’s most vulnerable nations due to rising sea levels.\n\n“The Pacific countries should seriously remodel their relationship with Australia,” Bikenibeu Paeniu told AFP.\n\nHe added it was not good enough that the Pacific region hosts a pre-COP event, while Turkey will host the summit.\n\n“What a miss but the Pacific will continue its fight no matter what.”\n\nAustralia started walking back its bid earlier this week as leaders met in the Brazilian port city of Belém. Albanese had pledged that, if Australia did lose out, he would still look for ways to keep the Pacific’s plight on the agenda.\n\nAustralia had pitched its bid as a “Pacific Cop”, done in partnership with low-lying island nations and emphasising their exposure to climate change and rising sea levels.\n\nThe annual conferences are the world’s main forum for driving climate action.\n\nAbout 320,000 people in the Pacific were displaced by disasters between 2008 and 2017, according to the International Organisation for Migration. Nasa projects sea levels could rise by up to 15cm over the next 30 years.\n\nWith Agence France-Presse",
  "summary": "<p>Australia had been pushing to host climate conference next year with south Pacific nations, which are increasingly threatened by rising seas and climate-fuelled disasters</p><p>Papua New Guinea has voiced frustration after Australia <a href=\"https://www.theguardian.com/australia-news/2025/nov/20/turkey-to-host-cop31-climate-conference-after-australia-drops-push-to-hold-it-in-adelaide\">ditched a bid to co-host next year’s UN climate talks</a> with its Pacific island neighbours.</p><p>“We are all not happy. And disappointed it’s ended up like this,” foreign minister Justin Tkatchenko told Agence France-Presse after Australia ceded hosting rights to Turkey.</p> <a href=\"https://www.theguardian.com/environment/2025/nov/20/papua-new-guinea-pacific-not-happy-australia-walks-away-from-bid-to-host-cop31\">Continue reading...</a>",
  "published": "Thu, 20 Nov 2025 01:38:02 GMT",
  "url": "https://www.theguardian.com/environment/2025/nov/20/papua-new-guinea-pacific-not-happy-australia-walks-away-from-bid-to-host-cop31",
  "source": "World news | The Guardian"
}