{
  "title": "‘It’s fabulous’: Swansea on cloud wine for Beaujolais Nouveau Day",
  "text": "There was snow on the hills a few miles away and a north-westerly wind was cutting through the city.\n\nBut a bit of chilly weather didn’t stop thousands of revellers, dressed in party gowns and sharp suits, hitting the streets of Swansea to celebrate Beaujolais Nouveau Day.\n\n“It’s an excuse to have a good time, really,” said Laura, a 20-year-old supermarket worker, as she and her co-worker Kelly, 42, danced out of the No Sign Wine Bar, once a haunt of Swansea’s most famous son, Dylan Thomas. “A chance to put on the fake tan, dress up and party.”\n\nIt isn’t de rigueur here, by any means, to actually sample Beaujolais on the third Thursday of November. Laura and Kelly had been drinking prosecco. “I tried Beaujolais once,’ said Kelly. “Didn’t like it – a bit boring.”\n\nView image in fullscreen Laura, right, and Kelly, left, outside the No Sign Bar in Swansea Photograph: Francesca Jones/The Guardian\n\nIn the 1970s in the UK, the “Beaujolais Nouveau Run” became modish, with motoring enthusiasts racing back from eastern France to London with the first cases of the new wine.\n\nBy the 1980s, the wine became associated with City traders and the upwardly mobile. A poster for Beaujolais Nouveau can be seen in the beloved 1989 “Yuppy Love” episode of Only Fools and Horses when Derek “Del Boy” Trotter falls through a bar flap in a bistro.\n\nPopularity waned in the 2000s but there are signs of a comeback. Global heating may have improved growing conditions in the area and the skill of a new breed of Beaujolais winemakers has led to it winning plaudits with critics in France and farther afield.\n\nThis week the supermarket Asda put out a poll claiming more than a quarter of British people planned to celebrate the day. The percentage may feel a little high, but the Radio 6 Music breakfast DJ Nick Grimshaw announced bright and early that a member of his team had taken the morning off to celebrate the moment.\n\nIn Swansea, it never really went out of fashion. It is thought the city’s love affair with Beaujolais Nouveau Day began at the No Sign Wine Bar because one of its former owners, the ex Wales rugby union captain Clem Thomas, used to have a house in France and would bring Beaujolais back to Wales.\n\nView image in fullscreen Molly Dowrick: ‘Some offices completely close for the day. It’s a good warmup for Christmas.’ Photograph: Francesca Jones/The Guardian\n\nThe day grew slowly in popularity and is now a bit of a monster. On Thursday, Morgan’s Hotel near the river was serving 1,000 Beaujolais dinners over five sittings. They sold out six weeks ago.\n\n“It’s fabulous,” said Molly Dowrick, head of marketing. “Beaujolais Nouveau day is a kind of cult.” She said many business people used the event to wine and dine clients. “Some offices completely close for the day.” And friends used it to re-connect. ‘“It’s a good warmup for Christmas.”\n\nAt a table in Morgan’s marquee (they can’t fit everyone inside), this was the 11th year for a bunch of eight female friends.\n\nskip past newsletter promotion Sign up to First Edition Free daily newsletter Our morning email breaks down the key stories of the day, telling you what’s happening and why it matters Enter your email address Sign up Privacy Notice: Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on theguardian.com to send you this newsletter. You can complete full registration at any time. For more information about how we use your data see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nOne of them, Kirsty, 35, a beauty therapist, said they met to do makeup at 9am, hair at 10am and had their first drink at 11am. “And we start planning our outfits in July,” said another of the friends, Gabrielle, 32.\n\nAn online “Beaujolais Bible” is the place to look for events. The Grand Hotel throws in a french kiss cocktail for guests to its event, while the Heaven nightclub offers an all-day party with bongo players, a saxophonist and “bottomless prosecco”.\n\nView image in fullscreen Morgan’s Hotel near the river was serving 1,000 Beaujolais dinners over five sittings. Photograph: Francesca Jones/The Guardian\n\nCameron Richards, a 26-year-old TikToker, was out and about with a bunch of mates. “This is a good representation of our culture,” he said. “A day off, chance to unwind, to celebrate our city.”\n\nIt can get messy. Extra emergency services workers stand by in case there is any trouble. Tabloid reporters and photographers were in town ready to chronicle outbreaks of bad behaviour – young people being sick in smart outfits has become a newspaper favourite in recent years.\n\nBut Andrew “Duggie” Douglas, manager at Swansea BID (business improvement district), said Beaujolais Day provided a huge boost to Swansea’s economy. Hairdressers and beauty salons open before dawn; clothes shops do well; taxi drivers are kept busy. “People don’t always know what Beaujolais is, but it’s become this Swansea institution,” he said.\n\n“You get the business people come out about midday, then the people who go out after work and then the night crew. Beaujolais Day is a little bit like being on holiday. And when you’re on the holiday, it’s acceptable to have a beer at 10 o’clock in the morning.”",
  "summary": "<p>A once-niche wine event has morphed into a sprawling get-together, powering bars, salons and the local economy</p><p>There was snow on the hills a few miles away and a north-westerly wind was cutting through the city.</p><p>But a bit of chilly weather didn’t stop thousands of revellers, dressed in party gowns and sharp suits, hitting the streets of Swansea to celebrate Beaujolais Nouveau Day.</p> <a href=\"https://www.theguardian.com/uk-news/2025/nov/20/swansea-on-cloud-wine-beaujolais-nouveau-day\">Continue reading...</a>",
  "published": "Thu, 20 Nov 2025 18:27:27 GMT",
  "url": "https://www.theguardian.com/uk-news/2025/nov/20/swansea-on-cloud-wine-beaujolais-nouveau-day",
  "source": "The Guardian"
}