{
  "title": "Porsche Reveals Everything About Its Cayenne Electric—Except for One Vital Thing",
  "text": "Porsche needs a hit. In the first nine months of 2025, Porsche's operating profit plummeted by 99 percent compared to the same stint the year before. Yep, 99 percent. Profit has tanked for the auto brand with a track record of making billions.\n\nThe reasons for Porsche's misfortune are no secret. There's the hugely expensive product strategy shift that saw the dramatic scaling back of EV plans. There was Porsche scrapping projects to build its own EV batteries in-house and instead developing new combustion and hybrid models. Plus, the double hit of US tariffs and a slump in the Chinese market have left the German automaker reeling.\n\nHowever, whether or not the EU decides to rewrite its EV transition timetable, the future for autos, sooner or later, will not be combustion but electric. So this means that European car companies playing the long game must still show their prowess in electrification. Which brings us to today's reveal of the final production Cayenne Electric and Cayenne Turbo Electric.\n\nThe Cayenne is Porsche's first fully electric SUV. Courtesy of Porsche Courtesy of Porsche\n\nCosting $109,000 for the Cayenne, and $163,000 for the turbo version (£83,200 and £130,900 respectively in the UK), Porsche will be hoping that this, its first ever fully electric SUV, will present better long-term value for money than its formidable Taycan has, which saw unlucky owners lose half the value of the car in its first six months, pushing some into negative equity on the vehicles.\n\nThis new electric SUV is the most powerful production Porsche of all time, and the specs are fittingly mighty. The Cayenne Turbo shifts from 0 to 62 mph in 2.5 seconds, from 0 to 124 mph in 7.4 seconds, and goes on to a top speed of 162 mph. A new drive system develops up to 850 kW (1,156 PS) and up to 1,500 Nm of torque when the cars' Launch Control is activated. Interestingly, borrowing an innovation from motorsports, the Turbo has direct oil cooling of the electric motor on the rear axle for high continuous output.\n\nThe “entry-level” Cayenne model has 300 kW (408 PS) in normal operation and 325 kW (442 PS) and 835 Nm of torque with Launch Control. It can manage 0 to 62 mph in 4.8 seconds, on its way to a top speed of 143 mph.\n\nEnergy recovery for the Cayenne Electric is also impressive, with recuperative power matching Gen 3 Formula E levels of up to 600 kW. Both models can be specced with rear-axle steering too. This allows the rear wheels to move by up to 5 degrees, making it easier to make tight turns or shimmy into parking spots.",
  "summary": "The automaker has taken the covers off its Cayenne Electric and Cayenne Turbo Electric, the most powerful production Porsches ever. But it won’t confirm a key AI feature of its first fully electric SUV.",
  "published": "Wed, 19 Nov 2025 14:15:00 +0000",
  "url": "https://www.wired.com/story/porsche-reveals-everything-about-its-cayenne-electric-apart-from-one-vital-thing/",
  "source": "WIRED"
}