{
  "title": "Prominent Democratic Veterans Urge Troops To Defy 'Illegal Orders'",
  "text": "LOADING ERROR LOADING\n\nIn a video released on Tuesday, a group of Democratic veterans and former intelligence officers urged service members to stand up to the Trump administration if they receive “illegal orders.”\n\n“This administration is pitting our uniformed military and intelligence community professionals against American citizens,” the group, which included Sen. Elissa Slotkin (D-Mich.), Sen. Mark Kelly (D-Ariz.), Rep. Chrissy Houlahan (D-Pa.), Rep. Chris Deluzio (D-Pa.), Rep. Maggie Goodlander (D-N.H.) and Rep. Jason Crow (D-Colo.), said.\n\nAdvertisement\n\n“Our laws are clear: You can refuse illegal orders. You can refuse illegal orders. You must refuse illegal orders,” they said, without specifying which directives. “No one has to carry out orders that violate the law or our Constitution.”\n\nSince returning to office, President Donald Trump has deployed National Guard troops to several Democrat-led cities under the pretense of combating crime. Earlier this year, Trump also sent active-duty Marines to Los Angeles in response to largely peaceful protests about Trump’s immigration policies. In recent months, the Pentagon has also ordered a series of lethal strikes on alleged drug trafficking boats in waters in the Caribbean and Pacific.\n\n“This is not a hypothetical exercise,” Slotkin wrote in another post on X, which featured a video of her referencing Trump’s efforts to send soldiers to Washington, D.C. in 2020 to stop demonstrations against police brutality. At the time, Trump allegedly asked whether authorities could shoot unarmed protesters in the leg, according to former Defense Secretary Mark Esper.\n\nAdvertisement\n\n“Under Article 92 of the Uniform Code of Military Justice and the U.S. Manual for Courts-Martial, service members must obey lawful orders and disobey unlawful orders,” University of Massachusetts Amherst professor Charli Carpenter and researcher Geraldine Santoso wrote for The Conversation. “Unlawful orders are those that clearly violate the U.S. Constitution, international human rights standards or the Geneva Conventions.”\n\nExamples of unlawful orders include intentionally harming civilians and falsifying legal records, the office of attorney David Sheldon, a law firm that represents service members, stated on its website.\n\nMembers of the military who obey illegal orders may face consequences, including court-martial and prosecution by international tribunals, Carpenter and Santoso wrote.\n\nAdvertisement\n\nThe Democrats’ video has sparked pushback from conservatives, with White House Deputy Chief of Staff Stephen Miller claiming the lawmakers were “openly calling for insurrection.”\n\n“Stage 4 TDS,” Defense Secretary Pete Hegseth posted in response to the video in an apparent reference to the term “Trump Derangement Syndrome.” The Department of Defense did not immediately respond to a request for comment.\n\nDemocrats countered these attacks, arguing that the video was aimed at supporting troops who could be put in a difficult position by this administration and reminding them about their ability to question certain directives.\n\nAdvertisement",
  "summary": "“No one has to carry out orders that violate the law or our Constitution.”",
  "published": "Wed, 19 Nov 2025 22:25:11 -0500",
  "url": "https://www.huffpost.com/entry/elissa-slotkin-mark-kelly-veterans-video_n_691e6db9e4b0b763ab8dbd39",
  "source": "Politics"
}