{
  "title": "Red Fort blast echo: In Kashmir, a crackdown on potential ammonium nitrate misuse",
  "text": "Alerted by the Red Fort car explosion and the recovery of huge quantities of ammonium nitrate from the “inter-state” Jaish-e-Mohammad (JeM) module, the J&K Police has launched an extensive operation to inspect fertiliser and chemical shops in the Valley to check “misuse” of these products. Ammonium nitrate is extensively used as a nitrogen-rich fertilizer in agriculture.\n\nThe police are also inspecting industries that handle mixable and sensitive raw materials as well as car dealers dealing in second-hand vehicles. Calling it “strengthening of preventive measures”, the police have inspected multiple shops and industries over the last three days.\n\n“These inspections are carried out to plug all possible loopholes that could be exploited for terror or criminal activities, and to maintain a robust security environment,” the police said in a statement. “Police remain committed to ensuring public safety and urge citizens to stay alert and report any suspicious activity.”\n\nThe security checks come in the wake of the November 10 Red Fort blast in which ammonium nitrate is believed to have been used along with highly potent triacetone triperoxide (TATP). The J&K Police also claimed to recover 360 kg of ammonium nitrate after busting the Jaish module in Faridabad, involving two Kashmiri doctors Adil Ahmad Rather and Muzammil Ganai, among others. The seized explosives, however, blew up at the Nowgam police station in Srinagar on November 14 during sampling by Forensic Scientific Lab officials, killing nine people and injuring 32.\n\n“Since it has become increasingly difficult to bring explosives from Pakistan, the militants are relying on locally available materials and ammonium nitrate is the most easily available product in the market,” said a police officer. “The Red Fort blast and the Nowgam (police station) blast have indicated how devastating it could also be. That’s why there is this urgency.”\n\nThe police officer said the wide but essential use of ammonium nitrate in the agriculture sector makes it readily available in the market and the government can’t afford to ban it.\n\n“That’s why there is a need to check its misuse,” he said. “During this intense drive, we verify the stock registers, check documents and the storage practices and movement of such materials.”\n\nStory continues below this ad\n\nAnother police officer said proper storage and movement of these products is also necessary for the safety of the people. “We have to check if the regulated material is stored and moved as per the scientific norms and in specific quantities,” he said, adding, “This is essential for the safety of the people and to prevent any accidental explosion.”\n\nA security officer said a new challenge for the security agencies is the availability of bomb-making videos on social media channels like YouTube.\n\n“The information we have as of now about the Jaish module suggests that they didn’t have any formal knowledge or training in bomb-making and they learnt it from videos,” he said. “This is particularly dangerous in lone-wolf type of attacks. This is a new challenge and we are gearing up for it.”\n\nThe police teams are also inspecting the car dealers to ensure that second-hand vehicles bought by the people are transferred to the new owner through “proper and legal” means to prevent the misuse of these cars. The car that exploded near the Red Fort was registered in the name of a Pampore resident.",
  "summary": "",
  "published": "Tue, 18 Nov 2025 17:17:30 +0000",
  "url": "https://indianexpress.com/article/india/red-fort-blast-jammu-and-kashmir-police-searches-chemical-stops-ammonium-nitrate-10373074/",
  "source": "India | The Indian Express"
}