{
  "title": "Formula 1 tech used to rev-up train wi-fi speeds in new pilot",
  "text": "Formula 1 tech used to rev-up train wi-fi speeds in new pilot\n\n4 days ago Share Save Laura Cress Technology reporter Share Save\n\nGWR Some of the Great Western Railway fleet will use a hybrid system including low earth orbit satellites in space to create a more-reliable wi-fi connection\n\nA new UK-first pilot scheme is aiming to create fast and more reliable train wi-fi, using technology originally developed for Formula 1 cars. It will see a train in the Great Western Railway fleet use a hybrid system of both signals from mobile phone masts on the ground and low earth orbit (LEO) satellites in space to create a more reliable connection. The scheme has been developed by British tech company Motion Applied, in partnership with the transport body for Cornwall, Devon, Plymouth, Somerset and Torbay, Peninsula Transport. The pilot will last for 60 days onboard GWR's Intercity Express Train which runs in the South West region, having started in mid-November.\n\nIn a recent study by networking testing firm Ookla, the UK ranked 16th out of 18 major European and Asian countries for train wi-fi speed, with average download speeds at just 1.09 megabits per second, compared to Sweden's 64.58. Nick Fry, chairman of Motion Applied, formerly part of McLaren Group, said the issues faced in connecting to the internet from a fast moving train had \"many parallels with motorsport\". He added that by using technology originally developed for F1 cars, trains should be able to switch between ground and space-based networks such as LEO satellites to \"reliably connect\" without drop outs. In the 2025 spending review, the Department of Transport secured £41m to introduce low earth orbit satellite connectivity on all mainline trains by 2030.\n\n'A step in the right direction'",
  "summary": "The 60 day pilot will use signals from mobile phone masts and satellites in space to create a more reliable connection.",
  "published": "Mon, 17 Nov 2025 00:00:21 GMT",
  "url": "https://www.bbc.com/news/articles/cqjwkdez71ro?at_medium=RSS&at_campaign=rss",
  "source": "BBC News"
}