{
  "title": "The one change that worked: I had Sad and felt desperate – until a scientist gave me some priceless advice",
  "text": "I’m pretty sure I must be half human, half plant – how else to explain why I need the light to thrive? During the brighter seasons I feel fine, but when winter comes and the light begins to fade, I start drooping.\n\nI have struggled with seasonal affective disorder (Sad) since I was a teenager. The symptoms of Sad are similar to regular depression, with low moods and lethargy, and can be equally debilitating. Over the years I’ve experienced the full Sad spectrum, from moments of excessive tiredness and carb cravings (yes, those are official Sad symptoms), to a low point of breaking down crying on the kitchen floor after school because it was so cold, dark and bleak.\n\nI’ve always struggled to enjoy the cosiness of early winter when Sad feels like a curse waiting to pounce, like an inevitable winter bug that lasts all season. But maybe it didn’t have to be this way? Sick of losing months of my life to the gloom every winter, one year I decided to do a deep dive into the science of Sad and even spoke to a serious-faced Finnish scientist about it for a feature I was writing. His advice? Sit yourself down in front of a light box emitting 10,000 lux, for up to an hour, at least five times a week. Eight out of 10 people will have good results with this, the Finn explained, and you should start a couple of weeks before the symptoms usually kick in. And do it in the morning.\n\nView image in fullscreen The stock advice for Sad is to ‘get light’. Photograph: courtesy of Jessica Furseth\n\nAt first it seemed too simple – the stock advice for Sad is to “get light”, but I’d tried Sad lamps and lunchtime walks before, with little success. But I didn’t realise the timing is so crucial: you have to get that light into your eyeballs soon after waking – before 10am – because the whole point is to help your circadian rhythm. The darkness sets people with Sad adrift because our bodies can’t keep track of the time, and the body clock affects so much, from hormones, hunger, digestion and immune function to alertness, memory and sleep.\n\nI was desperate, so I decided to follow the instructions to the letter. I bought new bulbs for my 10-year-old Sad lamps and rigged them up on either side of myself in a window seat that gets the morning sun, or at least an overcast approximation. Last winter I sat myself down there first thing every morning to read a book in the blinding light, coffee in hand.\n\nI was honestly shocked how well it worked. I still had the occasional gloomy day, but thanks to my new light routine, I mostly felt like myself. Instead of sinking into tiredness as the afternoons grew shorter, I was ready to take on the day. I could skip the occasional morning without any ill effects, but I soon felt myself drawn to the light because I knew it would brighten me up, especially on a rainy day.\n\nAs winter progressed I realised the light went far beyond just giving me energy to get through the day – I also had the energy to have fun. Instead of preferring a blanket on the sofa most January nights, I found myself keen to go out for dinners and dancing on the weekends. Best of all, I was able to appreciate how beautiful winter can be, when you’re awake enough to notice.\n\nNow winter is almost here again, I’m back in front of the bright window, and I’m no longer afraid of the dark.",
  "summary": "<p>Since I was a teenager I had struggled in winter, experiencing excessive tiredness and low mood. A specific instruction lifted the gloom</p><p>I’m pretty sure I must be half human, half plant – how else to explain why I need the light to thrive? During the brighter seasons I feel fine, but when winter comes and the light begins to fade, I start drooping.</p><p>I have struggled with seasonal affective disorder (Sad) since I was a teenager. The <a href=\"https://www.nhs.uk/mental-health/conditions/seasonal-affective-disorder-sad/overview/\">symptoms of Sad</a> are similar to regular depression, with low moods and lethargy, and can be equally debilitating. Over the years I’ve experienced the full Sad spectrum, from moments of excessive tiredness and carb cravings (yes, those are official Sad symptoms), to a low point of breaking down crying on the kitchen floor after school because it was so cold, dark and bleak.</p> <a href=\"https://www.theguardian.com/lifeandstyle/2025/nov/17/the-one-change-that-worked-i-had-sad-and-felt-desperate-until-a-scientist-gave-me-some-priceless-advice\">Continue reading...</a>",
  "published": "Mon, 17 Nov 2025 10:00:04 GMT",
  "url": "https://www.theguardian.com/lifeandstyle/2025/nov/17/the-one-change-that-worked-i-had-sad-and-felt-desperate-until-a-scientist-gave-me-some-priceless-advice",
  "source": "The Guardian"
}