{
  "title": "Blast from confiscated explosives at police station in Indian-controlled Kashmir kills nine",
  "text": "At least nine people were killed and 32 injured after a cache of confiscated explosives detonated inside a police station in Indian-controlled Kashmir, police have announced.\n\nThe blast occurred in the Nowgam area of Srinagar, the region’s main city, late on Friday while a team of forensic experts and police were examining the explosive material, said Nalin Prabhat, the region’s police director general. He ruled out any foul play, saying it was an accident.\n\nMost of the dead were police and forensic officials. Some of the injured were in critical condition.\n\nThe huge blast ripped through the police station, setting it and multiple vehicles on fire. According to local media, small successive explosions prevented immediate rescue operations.\n\nThe police station blast came days after Monday’s deadly car explosion in New Delhi, which killed at least eight people near the city’s historic Red Fort. Indian officials called it a “heinous terror incident” carried out by “anti-national forces”.\n\nThe blast happened hours after police in Kashmir said they had dismantled a suspected militant cell operating from the disputed region, arresting at least seven people, including two doctors from Indian cities, and seizing a large quantity of bomb-making material in the city of Faridabad.\n\nIndian security agencies have since carried out a series of raids in Kashmir as part of their investigation into the car blast, questioning hundreds and detaining scores.\n\nPolice had brought the explosive material seized in Faridabad to Kashmir as part of their investigation, adding that they were “kept securely in an open area” at the police station, where the investigation that led to the suspected militant cell began last month, according to Prabhat, the top officer.\n\nHe said a team of experts was taking samples for forensic investigation when the blast occurred, calling it an “accidental explosion”.\n\n“Any other speculation into the cause of this incident is unnecessary.”",
  "summary": "<p>The accidental explosion comes days after a deadly car blast in New Delhi which killed at least eight people near the city’s historic Red Fort</p><p>At least nine people were killed and 32 injured after a cache of confiscated explosives detonated inside a police station in Indian-controlled Kashmir, police have announced.</p><p>The blast occurred in the Nowgam area of Srinagar, the region’s main city, late on Friday while a team of forensic experts and police were examining the explosive material, said Nalin Prabhat, the region’s police director general. He ruled out any foul play, saying it was an accident.</p> <a href=\"https://www.theguardian.com/world/2025/nov/15/blast-from-confiscated-explosives-at-police-station-in-indian-controlled-kashmir-kills-nine\">Continue reading...</a>",
  "published": "Sat, 15 Nov 2025 07:18:57 GMT",
  "url": "https://www.theguardian.com/world/2025/nov/15/blast-from-confiscated-explosives-at-police-station-in-indian-controlled-kashmir-kills-nine",
  "source": "World news | The Guardian"
}