{
  "title": "After Hidma encounter, the Octopus raids – 31 Maoists and sympathisers hiding in Andhra as migrants are picked up",
  "text": "Security forces in Andhra Pradesh, including its anti-terrorist unit called the Organisation for Counter Terrorist Operations or Octopus, have arrested 31 suspected Maoists and their sympathisers in Vijayawada, Krishna and NTR districts following the morning encounter of six Maoists, including top commander Madvi Hidma.\n\nAdditional Director General of Police (ADGP) Mahesh Chandra Laddha said that of the 31 persons arrested, nine are former personal security guards of the banned Communist Party of India (Maoist) General Secretary Thippiri Tirupathi alias Devuji.\n\n“The rest belong to various Maoist battalions of South Bastar. Under pressure in Chhattisgarh, they have sneaked into Andhra Pradesh and are in hiding. We have been receiving inputs for several days and are tracking them. Today, 31 people were arrested from various places. Some of the surviving Maoist leaders and cadres are trying to come back to AP and set up base, but we will not allow it. They are fleeing due to enormous pressure in Chhattisgarh. Our operations against them will continue,’’ Laddha said.\n\nAfter the death of General Secretary Nambala Keshava Rao alias Basvaraj in an encounter with security forces this May, the CPI (Maoist) had appointed Devuji as the new General Secretary.\n\nIn New Autonagar in Vijayawada, Octopus commandos surrounded a four-storey building where at least 21 Maoist cadres allegedly posing as migrant workers were staying. All of them are from Chhattisgarh, officials said.\n\nAn official said that just before the commandos stormed the building, a few Maoists escaped, but most have been taken into custody. Elsewhere, 10 Maoists hiding at houses or properties of sympathisers have been arrested. None of them was carrying weapons. Officials recovered diaries and notebooks with contact numbers of sympathisers who could provide shelter. A high alert has been sounded in various cities and towns of Andhra Pradesh following intelligence inputs that Maoist cadres may have slipped in the guise of migrant workers and are trying to assimilate with local populations.\n\nThe raids were conducted immediately after the encounter in Maredmulli in Alluri Sitarama Raju district ended, in which top Maoist leader and Central Committee member Madvi Hidma and his wife and four others were killed. Sources said that Devuji, a member of the Central Military Commission, does not command much following, unlike powerful leaders like Basvaraj and Muppala Laxman Rao alias Ganapathi, and may have urged his cadres to escape the security dragnet while they can. Hailing from Telangana, his following among the Telangana Maoist leadership is also waning as most of the leaders and cadres are surrendering.",
  "summary": "",
  "published": "Tue, 18 Nov 2025 09:58:04 +0000",
  "url": "https://indianexpress.com/article/india/hidma-encounter-octopus-raids-maoists-andhra-migrants-10372355/",
  "source": "India | The Indian Express"
}