{
  "title": "Barcelona peg back Chelsea before TV blackout delay to reach WCL summit",
  "text": "The spoils were shared at Stamford Bridge between Chelsea and their Champions League torturers Barcelona, but Sonia Bompastor’s side will be the more frustrated of the two.\n\nIt was a battling performance from the home team and two late attempts – Ellie Carpenter’s failure to add her second goal from close range and the substitute Catarina Macario’s narrowly offside effort – could have given the Blues all three points.\n\n“I’m happy but frustrated because we could have won the game,” said Bompastor, speaking to BBC Sport. “I think we were the better team tonight, we had a really good performance and created a lot of opportunities. We scored a great goal.”\n\nIt is no secret that the Champions League is Chelsea’s white whale. “We all know there’s one thing missing for us,” Millie Bright told the Guardian the preceding week. The defender was on the bench here, Bompastor favouring a centre-back pairing of Naomi Girma and Nathalie Björn.\n\nBarcelona have been their perennial party poopers, delivering heartbreak in the final in 2021 before knocking Chelsea out in three back-to-back semi finals up to last season. Chelsea have just one win, but that hard-fought 1-0 victory against the Catalan giants in Spain was undone in London, and one draw in seven games against the Blaugrana.\n\nOn a horrendously cold night the opening 15 minutes followed a familiar pattern, the visitors dominating possession and frustrating an unsettled home side with their aggressive press. It was the Blues’ goal against the run of play that triggered a more even encounter. The full-back Carpenter, playing in front of the right-back Lucy Bronze, collected the ball from Aggie Beever-Jones just inside the Barcelona half and raced towards the box unchallenged before she lashed it ferociously past Cata Coll. It was a blistering effort and the celebrations were wild, Chelsea taking a lead at home against Barcelona for the first time in four attempts.\n\nView image in fullscreen Ellie Carpenter lashes the ball past Cata Coll to put Chelsea ahead. Photograph: Neil Hall/EPA\n\nThe Carpenter-Bronze axis on the right was a potent one, as was the equally rapid combination of Alyssa Thompson and Sandy Baltimore on the left. They nullified the dynamic Barcelona forwards Caroline Graham Hansen and Clàudia Pina, keeping them busy by helping out their own full-backs as they struggled to contain the wide onslaught.\n\nThe goal injected confidence into Bompastor’s side and they created the better chances of the half, but a Barcelona corner helped cancel out Carpenter’s stunning strike, the ball falling kindly for Ewa Pajor, who took a step to her left and fired in. It was the 36th Champions League goal for the Poland forward, who was a runner-up four times in the competition with Wolfsburg.\n\nChelsea attempted to take advantage on the resumption of the game, Thompson trying her luck after a quick attack but she put her effort wide. There was a nervous energy after half-time, the home team’s inability to convert their superior number of shots on target while Barcelona dominated possession a worry as the clock ticked on.\n\n“If you want to be perfect you have to be clinical and that is something we are working on, we won’t give up on that aspect,” said Bompastor.\n\nThere was an unusual pause shortly before the end of the first half, prompting nine minutes added on, when the live feed of the game went down and disrupted TV coverage and the VAR. The players tried to stay warm on the pitch until the action resumed.\n\nView image in fullscreen The referee stops play before a technical issue delayed the Women’s Champions League tie for nine minutes in the first half. Photograph: John Walton/PA\n\nIt was Carpenter who attempted to alleviate the Barcelona pressure that dominated the opening 15 minutes of the second half much in the way it had the first, the former Lyon player breaking forward in a move that mirrored her run for the opening goal but this time her effort was low and wide of the far post.\n\nThere was frustration for Chelsea in the 74th minute, celebrations cut short after Macario’s clinical header with her first touch after coming on in place of Beever-Jones was deemed offside, the margin extremely tight.\n\nThere was further agony when Carpenter put the ball wide of the far post with just Coll to beat from close range on the right after receiving a backheel pass from Macario in a neat one-two.\n\nQuick Guide WCL roundup: Atlético thrash Twente as Bayern blow away PSG Show Atlético Madrid made it two wins from four in the Women's Champions League with a 4-0 thrashing of Twente. The Spanish side opened the scoring in the 29th minute via a low, rifled shot from Amaiur Sarriegi before Júlia Bartel, Synne Jensen and Fiamma Benítez piled on the pain for their hosts. The win leaves Atlético ninth in the table and Twente languishing in 14th place. Bayern Munich, meanwhile, rose to fifth with a 3-1 victory at Paris Saint-Germain. Linda Dallmann, Momoko Tanikawa and Jovana Damnjanovic found the net to inflict a fourth loss from four on PSG, who are now rock bottom. In the other match of the evening, OH Leuven held Roma to a 1-1 draw at home. The visitors were well-placed to take all three points thanks to Evelyne Viens' slotted finish after 18 minutes, but the Belgian side were awarded a penalty for an off-the-ball foul after a VAR check midway through the second half and Jada Conijnenberg did the business from the spot. Will Magee Was this helpful? Thank you for your feedback.\n\n“Chelsea were very stable and they pressed us. That meant the second balls were theirs,” said the Barcelona manager, Pere Romeu. “It was a good game. It’s very different to the last semi-finals as Chelsea matched all the players we had and that limited us.”\n\nThe draw means Bompastor’s and Romeu’s sides remain two of the three unbeaten teams, the former earning a draw for the second time and the latter’s perfect start halted. They remain in good positions, Barcelona topping the table on 10 points and Chelsea in sixth on eight with two rounds of fixtures remaining.",
  "summary": "<p>The spoils were shared at Stamford Bridge between Chelsea and their Champions League torturers Barcelona, but Sonia Bompastor’s side will be the more frustrated of the two.</p><p>It was a battling performance from the home team and two late attempts – Ellie Carpenter’s failure to add her second goal from close range and the substitute Catarina Macario’s narrowly offside effort – could have given the Blues all three points.</p> <a href=\"https://www.theguardian.com/football/2025/nov/20/chelsea-barcelona-womens-champions-league-match-report\">Continue reading...</a>",
  "published": "Thu, 20 Nov 2025 22:04:16 GMT",
  "url": "https://www.theguardian.com/football/2025/nov/20/chelsea-barcelona-womens-champions-league-match-report",
  "source": "The Guardian"
}