{
  "title": "‘Unforgivable’: Trump’s ‘piggy’ insult is stoking more outrage than usual",
  "text": "It’s one outrage in days full of outrageous material.\n\n“Quiet, piggy,” Donald Trump told a female reporter in a press gaggle, pointing his finger at her angrily.\n\nIt wasn’t the first time – not even the hundredth time – the US president has attacked the media. And it’s hard for any storyline to break through the administration’s “flood the zone” strategy, much less one like this. Nothing seems to stick. But the “quiet, piggy” clip has taken off, several days after the admonishment occurred on Air Force One last Friday, and without much help from the media itself.\n\n“I don’t know why the ‘Piggy’ thing is bothering me so much,” wrote Hank Green, a YouTuber and author. “It’s one more unforgivable thing in a list of 20,000 unforgivable things, but I’ve been mad about it for like 12 straight hours.”\n\nTrump is going through a string of losses: Democrats dominating in off-year elections, having to reverse course on the Epstein files, Republicans refusing to get rid of the filibuster to end the shutdown, a faltering economy. There’s a possibility that he’s losing his air of impenetrability, and his grip on the right could maybe, just maybe, be loosening.\n\nThe anger he displayed in the clip could be a sign of someone on the back foot, overreacting to a question Bloomberg correspondent Catherine Lucey was asking about why Trump was fighting against releasing the Epstein files “if there’s nothing incriminating in the files”. The files related to the child sexual abuser released so far by Congress show that Epstein communicated regularly, and derogatorily, about women with a host of prominent friends.\n\n0:19 Trump tells reporter 'quiet piggy' after Epstein question – video\n\nLashing out at a female reporter with a derogatory insult amid a news cycle dominated by politicians splitting hairs over a man who ran a sex-trafficking outfit – it was pretty on the nose.\n\nBut the clip also pinged around the internet in the same news cycle as Trump telling another female reporter it was rude to ask Saudi Arabian crown prince Mohammed bin Salman about the murder of Jamal Khashoggi, a Saudi journalist whom the CIA determined was killed at the direction of the crown prince.\n\n“You’re mentioning somebody that was extremely controversial,” Trump said of Khashoggi, responding to a question from ABC News’s Mary Bruce. “A lot of people didn’t like that gentleman that you’re talking about. Whether you like him, or didn’t like him, things happen. But he knew nothing about it, and we can leave it at that. You don’t have to embarrass our guest by asking a question like that.”\n\nThe combined force of two outbursts at female journalists in a single news cycle – for asking about a child sexual abuser and a murdered colleague – went beyond the standard-fare Trumpian attacks on the media.\n\nPart of the collective ire could be that no one in the press gaggle jumped to Lucey’s defense in the video, underlining that those attacked by Trump often stand alone while others fear becoming next on his list; the media backbone that stiffened in his first term has wilted, under exhaustion and at the hands of Trump-friendly owners, in his second. The condemnations of Trump and accolades for both journalists came after the fact.\n\n“These incidents are not isolated; they are part of an unmistakable pattern of hostility – often directed at women – that undermines the essential role of a free and independent press,” the Society of Professional Journalists said in a statement Wednesday.\n\nThe White House, meanwhile, has doubled down on the comment, saying Lucey had “behaved in an inappropriate and unprofessional way towards her colleagues on the plane”, providing no details on what that meant. “If you’re going to give it, you have to be able to take,” they said.\n\nBeyond the clip’s power to outrage, though, is a sign that the leftwing media ecosystem and its creators are starting to command attention and elevate stories that media outlets aren’t jumping on.\n\nAs Democratic digital strategist Parker Butler pointed out on X, the “quiet, piggy” clip grabbed millions of views on online accounts four days after it happened, saying: “It got almost NO coverage when he said it … A viral post can shape an entire news cycle.”\n\nAnd some Democrats who’ve taken the strategy of being Trump back to Trump, including California governor Gavin Newsom’s press office, are using the clip to bully the president back, Photoshopping Trump’s face onto pigs and repeatedly tweeting “quiet, piggy”.\n\nIn Trump 2.0, you never know which affronts to decency will stick in people’s minds. This one, though, has a symbolism that seems to be resonating.\n\n“Portland has reclaimed the frog as a symbol of its resistance to Trump’s efforts to militarize the city,” former US attorney and commentator Joyce Alene wrote on X. “Perhaps women should claim the glamorous, sassy Muppet Miss Piggy, a known diva with a fierce karate chop, as their own symbol.”",
  "summary": "<p>The clip of the US president on Air Force One last Friday has taken off without much help from the media itself</p><p>It’s one outrage in days full of outrageous material.</p><p>“Quiet, piggy,” Donald Trump <a href=\"https://www.theguardian.com/us-news/2025/nov/18/trump-calls-reporter-piggy-bloomberg\">told a female reporter</a> in a press gaggle, pointing his finger at her angrily.</p> <a href=\"https://www.theguardian.com/us-news/2025/nov/19/trump-quiet-piggy\">Continue reading...</a>",
  "published": "Wed, 19 Nov 2025 21:36:30 GMT",
  "url": "https://www.theguardian.com/us-news/2025/nov/19/trump-quiet-piggy",
  "source": "The Guardian"
}