{
  "title": "Terror module case: Dr Rather’s neighbour, who set himself on fire after being called to police station, dies",
  "text": "A 55-year-old dry fruit seller, who set himself on fire in south Kashmir on Sunday morning, has succumbed at the hospital. Bilal Ahmad Wani had sprinkled petrol and set himself ablaze hours after the police called him to the local police station. Wani’s son, Jasir Altaf, and brother, Nabeel Ahmad, were already in police custody.\n\n“Yes, he has succumbed,” an official at Srinagar’s Shri Maharaja Hari Singh Hospital told The Indian Express. “He had more than 70 per cent burn injuries.”\n\nOn Sunday, a family member had said that Wani returned home late Saturday evening after spending the day at the police station. The relative had said Wani was visibly disturbed. “He didn’t talk to anyone. In the morning, he got up and went outside. He took petrol from the car…,” the relative said.\n\nBilal is a Bachelor’s student, while Ahmad is a teacher, officials said.\n\nThe family members said that on Saturday morning, the police asked Wani to present himself at the Qazigund police station. “He was taken to Srinagar,” the family member said. “He returned home at around 9 pm.”\n\nIt is learnt that Wani’s family members were asked if they attended Rather’s wedding recently. “He is a neighbour and we know him. He is also a doctor, and people here would go to him,” the relative said.\n\nSuperintendent of Police, Kulgam, Anayat Ali Chowdhary, had on Sunday denied that Wani was called by the Kulgam police. “Why should we call him when there is no case against them with the Kulgam police?” he said. “When his son was picked up, we called him and took details. We let him go at that moment only. None of his family members are in detention of the Kulgam police.”\n\nStory continues below this ad\n\nFormer Chief Minister Mehbooba Mufti had said that “random” picking of young men risks driving them towards “darker paths”.",
  "summary": "",
  "published": "Mon, 17 Nov 2025 10:05:48 +0000",
  "url": "https://indianexpress.com/article/india/terror-module-case-dr-rather-neighbour-fire-police-station-dies-10370565/",
  "source": "India | The Indian Express"
}