{
  "title": "The Frida Kahlo scandal: Fridamania could reach new heights today – but where are her ‘missing’ masterpieces?",
  "text": "This may well be Frida Kahlo’s biggest year yet. There’s the recent opening of a museum in Mexico City celebrating her life and work. There’s the Art Institute in Chicago exhibiting her work for the first time. And then, in Shenzhen, there’s the show that marked her Chinese debut. All this “Fridamania” tucks in between last year’s big screen documentary Frida and next year’s exhibitions in London and the US.\n\nWhat’s more, to cap it all, a Sotheby’s auction in New York today is almost certain to make Kahlo a record-breaker. Her 1940 painting The Dream (The Bed) is forecast to fetch between $40-$60m, which would dwarf the previous record for a female artist, set in 2014 by Georgia O’Keeffe’s Jimson Weed/White Flower No 1, which sold for $44.4m.\n\nIt’s almost enough confetti to obscure a report published in April by Hilda Trujillo Soto, who served as a deputy director and then director from 2002 to 2020 at Casa Azul, as the Frida Kahlo museum in Mexico is known. Concluding her own independent five-year investigation after leaving the museum, Trujillo Soto alleged the disappearance of two oil paintings and eight drawings between the museum’s 1957 and 2011 inventories, as well as at least six pages extracted from Kahlo’s illustrated diary. Summing up these “crimes against the property of the nation”, Trujillo Soto declared: “As a Mexican society, we are owed an explanation.”\n\nOne of the allegedly missing works, 1952’s Congress of the Peoples for Peace, was sold by New York’s Mary-Anne Martin Fine Art gallery for $2.66m at auction in 2020. According to Wayback Machine’s online archives, the gallery was also offering Kahlo’s other allegedly stolen painting, 1954’s Self-Portrait Inside a Sunflower, with provenance listed only as “private collection, Dallas”. The gallery did not respond to interview requests about this.\n\nView image in fullscreen All but worshipped in Mexico … Frida Kahlo in 1944. Photograph: Bettmann/Bettmann Archive\n\nTrujillo Soto’s broader conclusions were supported by Helga Prignitz-Poda, a Berlin-based Kahlo expert. “Many things have disappeared from Casa Azul,” she told journalists in response to Trujillo Soto’s report.\n\n“Frida painted her reality – even when it was uncomfortable,” Trujillo Soto told me. “I wrote mine. Discomfort and all.”\n\nKahlo is all but worshipped in Mexico, her work fiercely protected, ostensibly, by patrimony laws. She is to Mexico what Turner is to Britain or Michelangelo is to Italy. Yet rather than investigating Trujillo Soto’s catalogue of missing works – if only to discredit it – the government has stonewalled the issue. All three chiefs of the Ministry of Culture’s Transparency Unit opted against transparency, deferring completely to representatives at the state-run Bank of Mexico, which manages Kahlo’s trust. Those bank officials did not reply to our interview requests.\n\nThe trust, though, has accused Trujillo Soto of holding a grudge. In a statement it said that she “never filed a formal complaint” and added: “On the contrary, their contract was terminated after irregularities were detected in their administration and for having benefited third parties with the assets under their care”, an accusation she in turn denies.\n\nThe day after Trujillo Soto’s claims, Inbal, the agency tasked with protecting and promoting Mexican art as heritage, said it “has not granted any permission for definitive exports of works by [Kahlo]”. But it did not otherwise comment on possible foreign sales of the museum’s inventory.\n\nView image in fullscreen Congress of the Peoples for Peace, at a Sotheby’s preview in 2020. Photograph: Cindy Ord/Getty Images,\n\n“It’s a strategy of silence,” said Trujillo Soto of the Ministry of Culture. “If I were a man, my report would be seen as an analysis. But I am a woman, so Mexican machismo decides that what I say is gossip instead.”\n\nIn a statement, Casa Azul called Trujillo Soto’s allegations “unfounded, erroneous and [lacking] verifiable evidence” but did not amplify their position with evidence of their own. Asked to put concerns to rest by demonstrating that the missing works are still part of the museum’s inventory, Perla Labarthe, the museum’s current director, was unresponsive.\n\n“I believe that after my death,” Kahlo said, “I am going to be the biggest piece of shit in the world.” Casa Azul increasingly seems like ground zero for Kahlo’s shitstorm. In fairness, the government and the museum already openly defy the last will of Diego Rivera, the muralist who married, divorced and remarried Kahlo before she widowed him. That will ordered “under no circumstances or pretext may the objects belonging to the heritage be removed from the premises”.\n\nMuseums sometimes engage in deaccession, the act of selling art to pay for costs, debts, renovations, or just to pad pockets. It can go unreported to cover humility or humiliation. Unauthorised deaccession is probably the most bureaucratic euphemism for theft.\n\nInterpol officials declined to discuss the matter but law enforcement agents familiar with the details – who requested anonymity because they were not authorised to speak publicly – said the Mexican government has not yet sought Interpol’s assistance, and Interpol can only act at the request of its member governments.\n\nSimilarly, “the museum has not registered any losses with us,” said Julian Radcliffe, chair of the London-based Art Loss Register, which has flagged four disputed Kahlos in circulation, “but that is not surprising since museums are reluctant to admit to missing items, and, of course, there are many more losses due to internal theft by museum curators from stock or storage than by external robbery of items on display”.\n\nView image in fullscreen Kahlo’s Self-Portrait Inside a Sunflower, 1954. Photograph: Markus Schreiber/AP\n\nRobert Wittman, a retired senior investigator at the FBI’s Art Crime Team, expressed surprise that the Mexican government was not sounding more alarms – especially given that the country’s previous presidency prioritised art repatriation with strong success. “Mexico should do their due diligence,” he said.\n\nReluctance to report missing art can be a matter of institutional embarrassment or outright corruption, says Christopher Marinello, an art lawyer who founded Art Recovery International. Even among the standard chaos and drama of art theft, he added, “Mexico is a whole other problem. We have worked on cases and struggled to obtain police reports only to discover that members of the local police force were the main suspects in committing the theft.”\n\nA 2015 Sotheby’s Institute of Art analysis of Mexican patrimony laws and their impact on the art market found that work by artists on the patrimony list was suppressed in Mexico to at least half its worldwide value. Mexican auction houses have complained to legislators that patrimony restrictions cause as much as a 30% dampening of business, as buyers see their private ownership as an obtrusive de facto shared custody with the government.\n\nSo Casa Azul’s lack of investigation is further vexing amid abundant motives and suspects for art theft. Mexican auction houses, buyers, curators, gallerists and police all have vested interests in patrimony’s underground market. Meanwhile, it’s not just Interpol that can’t act alone. Neither can art market observers.\n\nView image in fullscreen ‘If I were a man, my report would be seen as an analysis’ … Hilda Trujillo Soto poses for a photograph at Casa Azul in 2020. Photograph: Carlos Jasso/Reuters\n\n“As far as we know, there have not been any formal or legal accusations substantiating claims of stolen works,” says Raúl Zorrilla, the CEO at Kurimanzutto, one of the most-respected galleries in Mexico City – which avoids all secondary markets, including Kahlo’s, in favour of living artists. “We prefer to anchor any discussion in the frameworks of law, provenance verification, and institutional process rather than speculation.” Earlier this week in New York, Christie’s auctioned a minor Kahlo. It sold for just $7.2m, perhaps because it is small and not a self-portrait (it’s a painting of knickknacks in a shop window in Detroit). Yet $7.2m is still a huge sum. In 2021, Kahlo’s 1949 self-portrait Diego and I sold for $34.9m, more than quadrupling the previous $8m high for a Kahlo sale and also breaking the broader record for Latin American art that had been held since 2018 by a $9.76m painting by Rivera.\n\nSuch blockbuster auctions may be as dangerous to Kahlo’s legacy as any theft. “The criminal element doesn’t have much imagination,” says Noah Charney, a Cambridge University doctoral candidate studying the history of art theft. “They steal what they’ve recently read about as having high value.” And not only thieves. Collectively, he said, we share “a subconscious understanding that if this artist is worth stealing, they must be very good”.\n\nAt her first exhibition – in New York in 1938 – Kahlo happily sold 12 of 25 works. In her life, she was praised by the art legends of her day: Kandinsky, Miró, Picasso. The surrealist André Breton called her art “a ribbon around a bomb”. Unimpressed, she called them all “artistic bitches.”\n\nKahlo’s ideals – of communism, feminism, hedonism, intimacy, magic, queerness, romance, truth and trust – ached to stir uncertainty in audiences. Now, more than 70 years after her death, the art market is reckoning with Kahlo uncertainties that are of its own making.",
  "summary": "<p>An auction in New York today is almost certain to make the celebrated artist a record-breaker. But, overshadowing what could be a $60m sale are questions about works that have allegedly disappeared</p><p>This may well be Frida Kahlo’s biggest year yet. There’s the recent opening of a museum in Mexico City celebrating her life and work. There’s the Art Institute in Chicago exhibiting her work for the first time. And then, in Shenzhen, there’s the show that marked her Chinese debut. All this “Fridamania” tucks in between last year’s <a href=\"https://www.theguardian.com/film/2024/mar/06/frida-review-intimate-dive-into-artists-letters-is-raw-and-thrilling\">big screen documentary Frida</a> and next year’s exhibitions in London and the US.</p><p>What’s more, to cap it all, a Sotheby’s auction in New York today is almost certain to make Kahlo a record-breaker. Her 1940 painting The Dream (The Bed) is forecast to fetch between $40-$60m, which would dwarf the previous record for a female artist, set in 2014 by Georgia O’Keeffe’s Jimson Weed/White Flower No 1, which <a href=\"https://www.theguardian.com/artanddesign/2014/nov/20/georgia-okeeffe-painting-world-record-price-art-woman\">sold for $44.4m</a>.</p> <a href=\"https://www.theguardian.com/artanddesign/2025/nov/20/frida-kahlo-scandal-fridamania-missing-masterpieces\">Continue reading...</a>",
  "published": "Thu, 20 Nov 2025 15:11:46 GMT",
  "url": "https://www.theguardian.com/artanddesign/2025/nov/20/frida-kahlo-scandal-fridamania-missing-masterpieces",
  "source": "The Guardian"
}