{
  "title": "Could you do better than Reeves as chancellor? Play our interactive budget game",
  "text": "The challenge\n\nOn 26 November, Rachel Reeves will deliver this year’s budget to parliament. As in all years, the chancellor has to strike a balance between:\n\nRaising the money needed to fund the services that voters demand.\n\nKeeping taxes at levels that are acceptable to voters.\n\nPersuading the government’s creditors in the bond markets that it will continue to be able to pay its debts.\n\nThe game\n\nIn our game you get to try your hand at designing a successful budget. Can you keep backbenchers happy without upsetting the bond markets? And can you do it all while keeping the books balanced?\n\n\n\nJust like the real chancellor, you begin in the red.\n\nAt the spring statement, Reeves had left herself £9.9bn of “headroom” against her fiscal rules, which require day-to-day spending to be matched by receipts by the end of this parliament.\n\n\n\nHowever, the buffer is widely expected to have been more than wiped out by three things: higher borrowing costs; welfare U-turns; and an anticipated productivity downgrade from the Office for Budget Responsibility.\n\nTaken together, the Institute for Fiscal Studies predicts government borrowing could be £22bn higher in 2029-30 than forecast in March. In response, Reeves would need £12bn from tax rises and spending cuts just to meet her fiscal rule. Rebuilding her £9.9bn headroom would require a full £22bn.\n\nHowever, she is widely expected to go further. Leaving a slim margin of headroom again could rekindle bond market fears. Most City investors expect a new buffer in the region of £20bn.\n\nSolving this is all part of your task. You need to reduce the shortfall by £12bn, you’ll see the yellow bar changing in response to your policy calls. But keep an eye on the alerts on how the markets– who may not be convinced by a £12bn turnaround – and polls are responding as you go. Good luck!\n\n(If you get stuck watch out for treasury briefings – chart icon – and political notes – note icon – for guidance.)\n\n{{ html }}\n\nSources and notes: the estimates of income from each of the measures and for the current government balance come from a variety of economists and thinktanks and the government’s own assumptions; Capital Economics, Resolution Foundation, Institute for Fiscal Studies, National Institute of Economic and Social Research, IPPR and HMs Revenue and Customs. These estimates are often based on those economists’ own assumptions about future growth, inflation, collection rates and other variables. So this game should be seen as illustrative of the relative sizes of the impacts of measures. Do not attempt to drive a major economy on the basis of this game.",
  "summary": "<p>Could you keep the markets calm and your MPs happy as you pull the economic levers to deliver a budget?</p><p>On 26 November, Rachel Reeves will deliver this year’s budget to parliament. As in all years, the chancellor has to strike a balance between:</p><p>Raising the money needed to fund the services that voters demand.</p><p>Keeping taxes at levels that are acceptable to voters.</p><p>Persuading the government’s creditors in the bond markets that it will continue to be able to pay its debts.</p> <a href=\"https://www.theguardian.com/politics/ng-interactive/2025/nov/20/you-be-the-chancellor-play-our-interactive-budget-game\">Continue reading...</a>",
  "published": "Thu, 20 Nov 2025 11:51:19 GMT",
  "url": "https://www.theguardian.com/politics/ng-interactive/2025/nov/20/you-be-the-chancellor-play-our-interactive-budget-game",
  "source": "The Guardian"
}