{
  "title": "Daily entries capped at 1 lakh, spot bookings at 20,000: Sabarimala tightens rules as crowds swell",
  "text": "The Travancore Devaswom Board (TDB), along with the police, imposed more restrictions at Sabarimala as close to two lakh devotees reached the hill shrine within 48 hours of the season’s opening. The authorities capped daily entries at one lakh and announced that spot bookings would return to the 20,000 limit from Wednesday.\n\nOn Tuesday, a 58-year-old woman from Koyilandy collapsed and died while waiting in the darshan queue. Jayakumar said the TDB would arrange to send the body home.\n\nIn Kottayam, a bus carrying 33 pilgrims from Karnataka overturned near Erumely while overtaking another vehicle on a slope. Three passengers suffered minor injuries and left the hospital after treatment.\n\nHeavy crowding\n\nVisuals showed heavy crowding at the 18 steps and along the Pamba-Sannidhanam route, with long delays in movement. TDB president K Jayakumar said officers would stop devotees at Nilakkal to reduce congestion at Pamba. He said teams would distribute water bottles in the queues and that seven more spot-booking counters would open at Nilakkal to reduce people travelling to Pamba for it. “I have never seen such a massive and dangerous crowd on the temple grounds till now. It appears some people cut the line to jump in front. Even I am scared seeing the large crowd here,” he said.\n\nSTORY | Authorities struggle to manage massive pilgrim flow at Sabarimala As nearly two lakh devotees arrived at the Lord Ayyappa shrine at Sabarimala here on Tuesday within 48 hours of the temple opening for the annual ‘mandala-makaravilakku’ pilgrimage season, the TDB and the… pic.twitter.com/wuLQlptfNx — Press Trust of India (@PTI_News) November 18, 2025\n\nADGP S Sreejith said the crowd inflated after 37,000 people sought spot entry despite a court-mandated cap of 20,000 and after virtual-Q holders arrived on days other than those allotted to them. He told pilgrims to follow the queue system and arrive as per bookings made. The TDB brought in 200 sanitation workers from Tamil Nadu to clear toilets at the shrine.\n\n‘Failed to provide basic facilities’\n\nLeader of Opposition in the state assembly, V D Satheesan, claimed that the government and the TDB have “failed” to provide basic facilities, like drinking water, to the pilgrims and that adequate police personnel were not deputed. Satheesan said the government’s stand that proper arrangements could not be made due to the model code of conduct being in force, was “ridiculous” as preparations ought to have been made much earlier.\n\nHe alleged that those who organised the Global Ayyappa Sangam with political motives, spoiled this year’s pilgrimage for devotees. He sought the urgent intervention of the Kerala High Court in the matter.\n\nFormer Union Minister of State V Muraleedharan made similar allegations against the state government and the TDB\n\nStory continues below this ad\n\nKarnataka issues advisory on ‘brain-eating amoeba’\n\nThe Karnataka Health Department issued a safety advisory to pilgrims after cases of Naegleria fowleri infections were reported in Kerala.\n\nThe advisory asked pilgrims to avoid contact with stagnant water and to use nose clips while bathing. It said symptoms such as fever, severe headache, vomiting, or confusion within seven days of water exposure require immediate medical attention.",
  "summary": "",
  "published": "Wed, 19 Nov 2025 08:02:27 +0000",
  "url": "https://indianexpress.com/article/india/sabarimala-tighter-curbs-pilgrim-dead-10373873/",
  "source": "India | The Indian Express"
}