{
  "title": "Panun Kashmir slams Centre, says investment invitation to Gulf nations radicalising youth",
  "text": "Panun Kashmir, an organisation advocating a separate homeland for displaced Kashmiri Pandits in valley, on Wednesday slammed the Centre saying that invitations to Gulf nations to invest exclusively in Kashmir has resulted in radicalisation of youth here.\n\n“The Government of India has taken steps that directly strengthen the ecosystem driving radicalisation. This has created state-facilitated pathways for white-collared terrorism to expand and return in more lethal forms,” Panun Kashmir chairman Dr Ajay Chrungoo told reporters here.\n\nReferring to the November 10 Delhi blast and the subsequent explosion in Nowgam police station in Srinagar, Chrungoo said, “Once again the nation has witnessed targeted terror assaults, and once again we confront the intolerable reality that the Centre continues to deny the war being waged against majority community, a war that reinvented itself with the exodus of Hindus in Kashmir in 1989–90.” He said that white-collared separatists and professionals had long played a role in strengthening the terror ecosystem in Kashmir.\n\n“Doctors, engineers, administrators, academics — this class has repeatedly acted as the ideological spine of terrorist operations since the 1990s in Kashmir,” he said. “The involvement of medical professionals in the Delhi blast is not new. It is a continuation of what we experienced three decades ago.” “In the aftermath of the Pahalgam massacre, the political class tried to trivialise a genocidal assault on Hindus as an attempt to disrupt communal harmony. After the Delhi blast, we are again being persistent into believing in a so-called new phenomenon white-collared terrorism,” he said.\n\nChrungoo also accused the Centre and J-K administration of refusing to “acknowledge core realities”.\n\n“They still do not accept that the primary objective of Islamist terrorism in India is the genocidal destruction and demographic disintegration of Hindus,” he said. “Every security review after a terror attack is a performative cycle that avoids revising strategic doctrine.” Panun Kashmir said that the government was focusing only on investigations into the Delhi blast and the Nowgam police station explosion instead of confronting what it described as internal subversive networks.\n\n“Pakistan is a convenient distraction for these networks,” Chrungoo said.",
  "summary": "",
  "published": "Wed, 19 Nov 2025 14:47:34 +0000",
  "url": "https://indianexpress.com/article/india/panun-kashmir-slams-centre-investment-invitation-gulf-nations-youth-10374767/",
  "source": "India | The Indian Express"
}