{
  "title": "House Unanimously Passes Bill To Shut Down Senator Payday Over Jan. 6 Probe",
  "text": "LOADING ERROR LOADING\n\nWASHINGTON – The House of Representatives passed a bill Wednesday night to kill a new law that potentially awards Republican senators millions of dollars in damages over the Justice Department’s Jan. 6 investigation.\n\nThe vote was unanimous, with the bill passing 426 to 0. But it’s not clear if the Senate will take it up.\n\nAdvertisement\n\nBefore the vote, a bipartisan chorus of House lawmakers criticized the prospect of senators getting paid millions of dollars as a direct result of a law they wrote. The provision granted senators — and only senators — the right to file special lawsuits against the government if their phone records were obtained by the Justice Department in the course of an investigation, with damages amounting to $500,000 per violation.\n\nThe provision was specifically written to benefit several Senate Republicans whose phone records were obtained in the course of special counsel Jack Smith’s criminal investigation into President Donald Trump’s attempt to overthrow the 2020 election.\n\n“This is the most self-centered, self-serving language that I have ever seen in any piece of legislation,” Rep. Austin Scott (R-Ga.) said before the vote. “There are a select few people who did the wrong thing in putting language in the bill that would make themselves individually wealthy.”\n\nAdvertisement\n\nThe provision was quietly added to a bill to end the longest government shutdown in U.S. history last week, right before the legislation passed the Senate and was sent to the House. Scott and others called it out at the time, but still felt they had to vote to reopen the government. They vowed to come back and repeal the provision.\n\nSenate Majority Leader John Thune (R-S.D.) added the senator payout to the bill with agreement from Senate Minority Leader Chuck Schumer (D-N.Y.), as several Republicans noted on Wednesday.\n\nMost Democrats, of course, voted against the whole thing.\n\n“Anyone who voted for this appalling provision, including all but two House Republicans, just last week, should feel ashamed of themselves,” Rep. Joe Morelle (D-N.Y.) said. “As these Republican senators and House members know, phone records are among the most routine tools used in criminal investigations. They do not reveal the content of any conversations; they simply show which numbers were called, which numbers called them, and when those calls were made.”\n\nAdvertisement\n\nWhether the Senate plans to take up the new bill is yet to be determined. Republican senators spent a significant portion of their closed-door lunch on Wednesday discussing its fate. Some Republicans have defended the provision, including Thune.\n\n“There’s a statute that obviously was violated, and what this does is enables people who are harmed, in this case, United States senators, to have a private right of action against the weaponization by the Justice Department,” Thune told reporters on Tuesday.\n\nSen. Lindsey Graham (R-S.C.), one of the provision’s loudest advocates, vowed to sue the Department of Justice and Verizon, his phone provider, after his data logs were obtained secretly by the DOJ under a court-ordered subpoena during ex-Special Counsel Jack Smith’s Jan. 6, 2021, investigation.\n\nAdvertisement\n\nGraham, a former Air Force lawyer, told Fox News he intended to seek “tens of millions” of dollars in damages.\n\n“I would give some of it away, and I would probably keep some of it, but I don’t know. I don’t have any money,” Graham told reporters on Wednesday. “Is it wrong for any American to sue the government if they violated your rights?”\n\nThe top Trump ally said it would also protect Democratic lawmakers in the future. He added that he sought approval in advance from Schumer’s staff, and that they had signed off on it. Schumer’s office maintains it should now be repealed even though the senator signed off on it last week after it was changed to include prospective protections for Democratic senators.\n\n\n\n",
  "summary": "It’s not clear if Senate Majority Leader John Thune (R-S.D.) will give the bill a Senate vote.",
  "published": "Wed, 19 Nov 2025 21:15:34 -0500",
  "url": "https://www.huffpost.com/entry/senate-cause-of-action-damages-jan-6-repeal_n_691e3c4fe4b0dc5d37ac1ec6",
  "source": "Politics"
}