{
  "title": "Kashmir Times office raided by investigators in Jammu",
  "text": "Jammu and Kashmir’s State Investigation Agency (SIA) on Thursday raided the office of the Kashmir Times, one of the oldest English-language news organisations in J&K.\n\nThe raids followed the registration of an FIR alleging the organisation’s involvement in anti-national activities and attempts to spread disaffection against the country.\n\nFounded by journalist Ved Bhasin, the Kashmir Times has stopped publication of its print edition from Jammu for a while now and operates primarily online.\n\nAfter Bhasin’s death, his daughter Anuradha Bhasin and her husband Prabodh Jamwal had taken over the reins of the newspaper.\n\nHowever, both of them have moved to the US and have been staying there for some years now. Its website lists Prabodh as editor and Anuradha as managing editor.\n\nAccording to official sources, the FIR mentions alleged activities and communications that are under scrutiny for “potential threats to the sovereignty and integrity of India”.\n\nThe raid started around 6 am, and SIA officials called the newspaper’s manager, Sanjeev Kerni, from his home to open the office.\n\nStory continues below this ad\n\nSIA officials examined documents, digital equipment and other material as part of the investigation.\n\nThe agency is likely to question Anuradha, officials said.\n\nOfficials said the operation is part of the agency’s continuing action against networks suspected of aiding separatist narratives or unlawful propaganda.\n\nThe SIA maintains that no platform – media or otherwise – can be permitted to be used for advancing seditious or anti-national content.\n\nKashmir Times editors Prabodh Jamwal and Anuradha Bhasin called the raids “yet another attempt to silence us”.\n\nStory continues below this ad\n\nFull statement by Kashmir Times editors\n\n“The reported raids on our office, the baseless accusations of activities “inimical to the state,” and the coordinated crackdown on the Kashmir Times are yet another attempt to silence us.\n\nCriticising the government is not the same as being inimical to the state. In fact, it is the very opposite. A robust, questioning press is essential to a healthy democracy. Our work of holding power to account, investigating corruption, amplifying marginalised voices strengthens our nation. It does not weaken it.\n\nSince 1954, the Kashmir Times (whose founding editor was Ved Bhasin), has stood as a pillar of independent journalism. We have chronicled the region’s triumphs and failures with equal rigour. We have given voice to communities that would otherwise go unheard. We have asked difficult questions when others remained silent.\n\nWe are being targeted precisely because we continue to do this work. In an era when critical voices are increasingly scarce, we remain one of the few independent outlets willing to speak truth to power.\n\nStory continues below this ad\n\nThe accusations leveled against us are designed to intimidate, to delegitimise, and ultimately to silence. We will not be silenced.\n\nWe call on the authorities to immediately cease this harassment, withdraw these unfounded allegations, and respect the constitutional guarantees of press freedom. We call on our colleagues in the media to stand with us. We call on civil society, on citizens who value their right to know, to recognise that this moment is a test of whether journalism can survive in an environment of increasing authoritarianism.\n\nJournalism is not a crime. Accountability is not treason. And we will continue to inform, investigate, and advocate for those who depend on us.\n\nThe state may have the power to raid our offices. But it cannot raid our commitment to the truth.\n\nStory continues below this ad\n\nOur print edition was suspended in 2021-2022 after relentless targeting, but we continue the operation digitally. All our reporting and writing are publicly available on kashmirtimes.com.”",
  "summary": "",
  "published": "Thu, 20 Nov 2025 08:04:11 +0000",
  "url": "https://indianexpress.com/article/india/kashmir-times-office-raided-by-investigators-in-jammu-10375987/",
  "source": "India | The Indian Express"
}