{
  "title": "The benefits of remembering how lucky we are | Letters",
  "text": "I agree with Julian Richer: the circumstances into which we are born affect how we get on in life (Do you feel lucky? Why acknowledging our own good fortune would make the world a better place, 17 November). I had a relatively ordinary background and worked in the public sector, but the security I had allowed me to have a good life. As he says, these things are not available to so many children. Considering the wealth in this country, that is a disgrace.\n\nIn 2009, the Guardian published an article about 1948 being the best year to have been born. This was based on every aspect of life you can think of: free education, NHS, availability of work, final-salary pensions and opportunities to buy houses at sensible prices. I was born in 1948. What a total privilege.\n\nMary Mullarkey\n\nLostwithiel, Cornwall\n\nJulian Richer’s article is so correct about the place of sheer luck in our achievements. Having been born in 1940, I have had the full benefit of the 1945-51 Labour government’s radical changes to society. I have had the support of the health service virtually all my life, I was enabled to be the first in my family to get a university degree, and when I was about 12 my family moved into smart new social housing. All this was brought about by a government with vision, despite inheriting a war-bankrupt economy. And, because of the policies of the 1940s, by the time I needed employment there were many opportunities to choose from.\n\nYoung people desperately need a Labour government with an equivalent vision today.\n\nMichael McLoughlin\n\nWallington, Surrey\n\nJulian Richer makes a good case, but an important question remains. On the basis that hard work, determination and talent will no doubt have played an important role in determining how you have got to where you are today, he asks how much factors outside your control have influenced your path in life. The untested assumption is that hard work, determination and talent are within your control.\n\nBut, as the US neuroscientist Robert Sapolsky has shown so brilliantly, the presence and expression of such characteristics are just as much products of that which precedes them as everything else. There are no causeless causes. It’s turtles all the way down.\n\nMark de Brunner\n\nBurn Bridge, North Yorkshire\n\nIt would be a pity if Julian Richer’s critique of today’s class-based unequal society led some people to conclude that the idea of meritocracy should be abandoned.\n\nFor our country to prosper, he rightly wants to open conversations about how we can enable everyone to fulfil their ambitions. We should begin with considerations about how we could ensure that our political representatives and leaders are selected for their merit rather than for their party’s popularity at the time of an election.\n\nDerek Heptinstall\n\nWestgate-on-Sea, Kent\n\nHow true, Mr Richer. As Malvolio said in Twelfth Night: “Some are born great, some achieve greatness and some have greatness thrust upon them.” Let us not forget how important luck is; but equally, let’s not forget determination.\n\nJohn Marriott\n\nNorth Hykeham, Lincolnshire\n\nUnsubscribing to the idea of “No one ever gave me anything” is a huge leap forward in one’s personal development, bestowing empathy and compassion.\n\nAlan Walker\n\nTorrelodones, Spain",
  "summary": "<p>Readers respond to an article by Julian Richer about the need to recognise that meritocracy is a myth so we can do something about it</p><p>I agree with Julian Richer: the circumstances into which we are born affect how we get on in life (<a href=\"https://www.theguardian.com/commentisfree/2025/nov/17/luck-good-fortune-world-success-people\">Do you feel lucky? Why acknowledging our own good fortune would make the world a better place, 17 November</a>). I had a relatively ordinary background and worked in the public sector, but the security I had allowed me to have a good life. As he says, these things are not available to so many children. Considering the wealth in this country, that is a disgrace.</p><p>In 2009, the Guardian published an article about <a href=\"https://www.theguardian.com/uk/2009/nov/06/1948-nhs-pensions-baby-boom\">1948 being the best year</a> to have been born. This was based on every aspect of life you can think of: free education, NHS, availability of work, final-salary pensions and opportunities to buy houses at sensible prices. I was born in 1948. What a total privilege. <br /><strong>Mary Mullarkey</strong><br /><em>Lostwithiel, Cornwall</em></p> <a href=\"https://www.theguardian.com/inequality/2025/nov/20/the-benefits-of-remembering-how-lucky-we-are\">Continue reading...</a>",
  "published": "Thu, 20 Nov 2025 17:46:47 GMT",
  "url": "https://www.theguardian.com/inequality/2025/nov/20/the-benefits-of-remembering-how-lucky-we-are",
  "source": "The Guardian"
}