{
  "title": "Stock market today: Nifty50 opens in red; BSE Sensex down over 250 points",
  "text": "Experts anticipate continued positive movement, considering domestic factors, worldwide economic data. (AI image)\n\n(Disclaimer: Recommendations and views on the stock market, other asset classes or personal finance management tips given by experts are their own. These opinions do not represent the views of The Times of India)\n\nStock market today: Nifty50 and BSE Sensex , the Indian equity benchmark indices, opened in red on Friday on weak global cues. While Nifty50 was above 26,100, BSE Sensex was down over 250 points. At 9:16 AM, Nifty50 was trading at 26,109.45, down 83 points or 0.32%. BSE Sensex was at 85,382.02, down 251 points or 0.29%.Experts anticipate continued positive movement, considering domestic factors, worldwide economic data, foreign institutional investment patterns and expected developments in India-US trade relations.Dr. VK Vijayakumar, Chief Investment Strategist, Geojit Investments Limited says, “Market volatility has spiked up. Nasdaq, the barometer of the AI trade, closed down 2.15% yesterday crashing 4.4% from the intraday peak. This kind of market movement is a signal of more volatility in store. While there are valuation concerns in AI stocks with many experts warning of a bubble burst, the Nvidia CEO disagreed with this cautionary warning with the statement “we see a different picture characterised by sustainable rise of advanced AI systems. ” At lower valuations, fresh buying may again emerge in AI stocks. We will have to wait and see how this volatile phase unfolds.”“There is excessive speculative trading in many stocks in India, particularly in some newly listed stocks. Retail investors better avoid such speculative trades which usually end in tears for the vast majority. The ideal investment strategy now would be to buy fairly-valued high quality stocks on declines and wait patiently. Since India has been an under-performer in this year’s AI trade, India will benefit if the AI trade fades and money starts flowing into non-AI stocks in countries like India. But a big crash would impact all markets. So wait and watch how things unfold”.Asian equities dropped following volatility in US markets, where an initial surge led by Nvidia Corp. quickly dissipated as investors moved away from high-risk assets including cryptocurrencies.Wall Street indices retreated on Thursday, reversing earlier gains, as initial optimism from Nvidia's results and US employment data faded, leaving investors uncertain about labour market conditions.The US dollar headed towards its strongest weekly performance in over a month on Friday, as investors assessed that the Federal Reserve would likely maintain rate, with the latest US employment report providing unclear signals for monetary policy direction.Foreign portfolio investors purchased shares worth Rs 284 crore net on Thursday. Domestic institutional investors acquired Rs 824 crore net.",
  "summary": "Stock market today: Nifty50 and BSE Sensex, the Indian equity benchmark indices, opened in red on Friday on weak global cues. While Nifty50 was above 26,100, BSE Sensex was down over 250 points.",
  "published": "Fri, 21 Nov 2025 09:21:02 +0530",
  "url": "https://timesofindia.indiatimes.com/business/india-business/stock-market-today-nifty50-bse-sensex-november-21-2025-dalal-street-indian-equities-global-markets-donald-trump-tariffs-india-us-trade-deal/articleshow/125476056.cms",
  "source": "Times of India"
}