{
  "title": "Saudi Arabia releases US retiree jailed over critical tweets",
  "text": "Saudi Arabia has agreed to allow US citizen Saad Almadi to return home to Florida, five months ahead of the scheduled lifting of travel restrictions and a day after Saudi crown prince and prime minister Mohammed bin Salman met Donald Trump at the White House.\n\nAlmadi, 75, was sentenced to 19 years of incarceration in the kingdom in 2021 after he wrote 14 tweets critical of the Riyadh government. Two years later, the charges were reduced to so-called “cyber crimes” and he was sentenced to a 30-year ban on leaving Saudi Arabia.\n\nThe announcement that Almadi, a dual citizen and retired engineer who had lived in the US since the 1970s, would be free to leave the country came after the US president delivered a speech touting US-Saudi ties, including arms sales and investment deals, during a second day of public events in Washington.\n\n“Our family is overjoyed that, after four long years, our father, Saad Almadi, is finally on his way home to the United States!” the Almadi family said in a statement.\n\n“This day would not have been possible without President Donald Trump and the tireless efforts of his administration. We are deeply grateful to Dr Sebastian Gorka and the team at the national security council, as well as everyone at the state department,” it added.\n\nThe statement by Almadi’s son, Ibrahim Almadi, also thanked various non-profit organizations, including the James Foley Fund and Hostages America, and House speaker Mike Johnson for supporting the elder Almadi’s cause. He later posted on X that his father was on his way to the US.\n\nAlmadi is one of a handful of American dual citizens facing exit bans from Saudi Arabia following a crackdown on online dissent. His son has previously claimed that Almadi was pressured to sign papers renouncing his US citizenship.\n\nThe case against Almadi centered on social media posts in which he was alleged to have urged Saudi citizens to seek Lebanese citizenship and faulted the kingdom’s defenses against Houthi rocket strikes.\n\nMore controversially he expressed approval for the renaming of a street in the US capital after Jamal Khashoggi, the journalist and Washington Post columnist killed in the Saudi consulate in Istanbul in 2018.\n\nUS intelligence reports released by the Biden administration later assessed that the crown prince had approved of a plan to “capture or kill” Khashoggi.\n\nAsked about the killing on Tuesday, Trump said the crown prince “knew nothing” of Khashoggi’s kiling. The Saudi crown prince has denied any wrongdoing. He said at the White House that Saudi Arabia “did all the right things” to investigate Khashoggi’s death, which he called “painful” and a “huge mistake”.\n\nUS pressure to release Almadi and allow him to return to the US has been building since Trump’s trip to Saudi Arabia in May. Many appealed to Trump claim that he is uniquely successful in repatriating US citizens detained overseas.\n\nWhen asked by a reporter in May about the case, Trump said he didn’t know about it but promised to take a look. A few weeks later, one of his national security aides, Gorka, met the younger Almadi at the White House.\n\nJohnson also met Almadi’s son. Johnson said: “President Trump is the president of deals and he loves to do business with the Saudis and we will win your father back.”",
  "summary": "<p>Saad Almadi’s family thanks Trump and state department as announcement comes after meeting with crown prince</p><p>Saudi Arabia has agreed to allow US citizen Saad Almadi to return home to Florida, five months ahead of the scheduled lifting of travel restrictions and a day after Saudi crown prince and prime minister <a href=\"https://www.theguardian.com/world/mohammed-bin-salman\">Mohammed bin Salman</a> met Donald Trump <a href=\"https://www.theguardian.com/us-news/2025/nov/18/trump-bin-salman-visit-jamal-khashoggi\">at the White House</a>.</p><p>Almadi, 75, was sentenced to 19 years of incarceration in the kingdom in 2021 after he wrote 14 tweets critical of the Riyadh government. Two years later, the charges were reduced to so-called “cyber crimes” and he was sentenced to a 30-year ban on leaving Saudi Arabia.</p> <a href=\"https://www.theguardian.com/us-news/2025/nov/19/saudi-arabia-saad-almadi-release\">Continue reading...</a>",
  "published": "Wed, 19 Nov 2025 21:21:29 GMT",
  "url": "https://www.theguardian.com/us-news/2025/nov/19/saudi-arabia-saad-almadi-release",
  "source": "World news | The Guardian"
}