{
  "title": "TV tonight: Aimee Lou Wood and David Morrissey’s sitcom returns",
  "text": "Daddy Issues\n\n9.35pm, BBC One\n\nAimee Lou Wood and David Morrissey’s sweet father-and-daughter comedy returns – and they’re now joined by baby Sadie. Gemma (Wood) is grappling with motherhood and daydreaming about dating again, while dealing with her formerly estranged mother Davina (Jill Halfpenny) moving in. Eager to be a grandfather, Malcolm (Morrissey) goes to extremes to help her get rid of his ex. Hollie Richardson\n\nReturn to Paradise\n\n8pm, BBC One\n\nThe classic trope of the locked room mystery gets a lads-on-tour twist in this instalment of the cosy Aussie cop show, as a drunken English mate of expat detective Colin (Lloyd Griffith) is implicated in a messy motel murder. Can his hyper-focused colleague Mack (Anna Samson) get to the bottom of things? Graeme Virtue\n\nGardeners’ World\n\n8pm, BBC Two\n\nA last visit to Monty Don before the winter sets in, and he’s making leafmould from decomposing leaves, while also storing dahlias and planting tulips in pots. Elsewhere, Carol Klein looks at how to maintain spectacular garden borders throughout autumn. HR\n\nEmpire With David Olusoga\n\nView image in fullscreen Radical … David Olusoga. Photograph: BBC/Hillgate Films/Voltage TV\n\n9pm, BBC Two\n\nOlusoga is, and always has been, a quietly radical historian. In the last of his three episodes on the British empire, his assessment of the collapse of the UK’s global influence upends some beliefs about the two world wars, Windrush immigration and the partition of India. Talking to the descendants of the colonised brings extra clarity. Jack Seale\n\nAll Her Fault\n\n9pm, Sky Atlantic\n\nSarah Snook (AKA Shiv from Succession) and Jake Lacy (Shane from The White Lotus) are excellent as the desperate parents of a missing child in this twisty thriller. In this episode, errant nanny Ana returns with a story about the Chicago marathon, and details of a new suspect for Det Alcaras (Michael Peña) to pursue. Ellen E Jones\n\nThe Graham Norton Show\n\n10.40pm, BBC One\n\nIt’s a big movie night. Hugh Jackman and Kate Hudson play a Neil Diamond tribute act in upcoming film Song Sung Blue. They’ll join Ben Stiller – who has made a documentary about his parents – and Da’Vine Joy Randolph, who stars in A24’s afterlife romcom Eternity. HR\n\nFilm choice\n\nView image in fullscreen Heart-stirring … Joel Edgerton in Train Dreams. Photograph: PA\n\nTrain Dreams (Clint Bentley, 2025), Netflix\n\nClint Bentley’s film of Denis Johnson’s novella is an epic, grief-infused American tale. Joel Edgerton plays railway worker and logger Robert, a quiet, solitary figure in his rural Idaho home town in the early 20th century. Then he marries Gladys (Felicity Jones); they build their own house and have a child, giving him a taste of simple bliss. But it doesn’t last … The spirit of Terrence Malick is present here in the elegiac voiceover narration, episodic plot and heart-stirring images of the natural world. Edgerton is perfectly cast as an everyman who bears witness to his country’s progress from the sidelines, not expecting much joy from life but haunted after he loses what little he does get. Simon Wardell\n\nThe Unholy Trinity (Richard Gray, 2025), Paramount+\n\nAfter his father’s hanging, the callow, vengeful Henry (Brandon Lessard) turns up at the Montana settlement of Trinity in 1888 to shoot the sheriff. However, his target is already dead and Henry finds himself stuck in a town full of secrets, most involving the new lawman, Pierce Brosnan’s Gabriel. Samuel L Jackson has a ball as St Christopher, an old cohort of Henry’s pa, plus there’s the odd posse and some hidden gold. The uncertain designation of heroes and villains is one of the pleasures of Richard Gray’s solid western, with everyone having their reasons. SW",
  "summary": "<p>Gemma becomes a mum in the second series of Daddy Issues. Plus, the final episode of Empire With David Olusoga. Here’s what to watch this evening</p><p><strong>9.35pm, BBC One<br /></strong>Aimee Lou Wood and David Morrissey’s sweet father-and-daughter comedy returns – and they’re now joined by baby Sadie. Gemma (Wood) is grappling with motherhood and daydreaming about dating again, while dealing with her formerly estranged mother Davina (Jill Halfpenny) moving in. Eager to be a grandfather, Malcolm (Morrissey) goes to extremes to help her get rid of his ex. <em>Hollie Richardson</em></p> <a href=\"https://www.theguardian.com/tv-and-radio/2025/nov/21/tv-tonight-aimee-lou-wood-and-david-morrissey-daddy-issues-returns\">Continue reading...</a>",
  "published": "Fri, 21 Nov 2025 06:15:02 GMT",
  "url": "https://www.theguardian.com/tv-and-radio/2025/nov/21/tv-tonight-aimee-lou-wood-and-david-morrissey-daddy-issues-returns",
  "source": "The Guardian"
}