{
  "title": "Turkey to host Cop31 climate conference after Australia drops push to hold it in Adelaide",
  "text": "Turkey will host the Cop31 climate conference after the Australian government dropped its push to hold the event in Adelaide at the last moment despite having invested in a more than three-year campaign.\n\nBut Australia’s climate change minister, Chris Bowen, is expected to lead climate negotiations at the summit in Turkey’s Mediterranean resort city of Antalya in November 2026 under a compromise deal to resolve a standoff between the two countries.\n\nThe arrangement was negotiated in meetings between Bowen and the Turkish climate minister, Murat Kurum, at the Cop30 conference in the Brazilian city of Belém. Details were still being finalised on Wednesday night local time before an announcement expected on Thursday.\n\nBowen told journalists the deal could involve a pre-Cop31 event on a Pacific island that would be a pledging event for a Pacific resilience fund, Turkey assuming the Cop presidency as hosts, and Australia being appointed “president for negotiations” – a role that has not previously existed.\n\nHe said this outcome – if agreed – could elevate the interests of the Pacific and Australia and support multilateralism, which has been under threat. Pacific nations had been promised that if Australia’s bid were successful they would be co-hosts, and that there would be a significant focus on the threat the climate crisis poses to their survival.\n\n“Obviously, it would be great if Australia could have it all, but we can’t have it all,” Bowen said. “This process works on consensus. And consensus means, if someone objected to our bid, it would go to [the UN climate headquarters] in Bonn. That would mean 12 months with a lack of leadership.\n\n“That would be irresponsible for multilateralism and this challenged environment. And we didn’t want that to happen. So hence, it was important to strike an agreement with Turkey.”\n\nSign up: AU Breaking News email\n\nThe wording of the unprecedented agreement between Turkey and Australia will need to be approved by the conference plenary before it is confirmed.\n\nAustralia’s failure to win the bid was a sharp disappointment to climate activists and clean industry investors in the country who had campaigned for the event since the Labor party announced its plan for the bid in 2021, while still in opposition. Pacific leaders expressed frustration. Papua New Guinea’s foreign minister, Justin Tkatchenko, said he was “not at all happy with result”.\n\nThe Australian prime minister, Anthony Albanese, had signalled a change in his messaging on hosting the world’s biggest climate meeting in a press conference in Perth late on Tuesday, local time, when he said his government would not block Turkey’s bid if it were chosen.\n\nSome longtime observers at climate negotiations interpreted Albanese’s comments as undermining the Australia-Pacific bid and leaving Bowen to sort out the details. They noted that Albanese had not attended a year-ending climate conference since becoming prime minister.\n\nView image in fullscreen Murat Kurum, Turkey’s environment and climate change minister. Photograph: Pablo Porciúncula/AFP/Getty Images\n\nHis intervention on Tuesday came just hours after Bowen declared in a public event and media interview at Cop30 that Australia was “in it to win it” on Cop31.\n\nskip past newsletter promotion Sign up to Breaking News Australia Free newsletter Get the most important news as it breaks Enter your email address Sign up Privacy Notice: Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on theguardian.com to send you this newsletter. You can complete full registration at any time. For more information about how we use your data see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nUnder the UN rules, Cop31 would have defaulted to the UN climate headquarters in the German city of Bonn if the standoff between Turkey and Australia had not been resolved this week. But the Germans did not want to host the negotiations, which attract tens of thousands of delegates and run alongside the world’s biggest green industry trade fair.\n\nThe Australians argued that they had the declared support of at least 24 of the 28 members of the “western Europe and others group” of countries. But they said an unprecedented deadlock that forced the event to be held in Bonn could have undermined faith in the negotiations and someone needed to broker a deal to avoid that.\n\nAustralian government sources have expressed frustration with the opaque UN decision-making process and its lack of a resolution mechanism. Australian newspapers have reported on opposition within the government to the bid, including claiming that hosting Cop31 could cost taxpayers more than A$1bn.\n\nOn Thursday Albanese said it was “an outstanding result” for Australia after weeks of negotiations. “Turkey will host the conference but Australia, by having the COP presidency for negotiations, will be in a very strong position and, some might argue, in the strongest possible position,” he said.\n\nThe South Australian premier, Peter Malinauskas, who had strongly supported Cop31 being held in Adelaide, the state capital, said he was disappointed and blamed the loss on flaws in the UN process to determine hosting rights.\n\n“I understand the position the prime minister has taken,” he said. “He has taken a position to try and navigate the frankly obscene process that exists internationally.”\n\nThe Smart Energy Council, representing Australian clean energy businesses, said it was “deeply disappointed” in the outcome, and urged the Australian government to organise its own giant green trade fair. The council’s chief executive, John Grimes, accused the Turkish government of holding the UN climate talks hostage.\n\n“It is an indictment on Turkey and the process that they were able to stand in the way of the overwhelming support from the Pacific and other countries for a Pacific COP31,” he said.\n\nDenise Cauchi, chief executive of Climate Action Network Australia, said Australia must ensure Cop31 delivered for Pacific and Australian communities.\n\n“That includes backing long-standing Pacific demands like a just and equitable phase out of fossil fuels, complying with Australia’s legal obligations to prevent climate harm, and committing to new, predictable, and accessible grant-based climate finance,” she said.\n\nCauchi called on the Albanese government to work Turkey to ensure civil society was able to participate at the Turkey summit, as it had in Brazil but not at some previous conferences. “People, not polluters, must be at the heart of Cop31,” she said.",
  "summary": "<p>Fortnight-long event to be held in Antalya but Australian climate change minister Chris Bowen expected to lead the negotiations</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/nov/20/australia-news-live-volcano-java-labor-nature-laws-coalition-sussan-ley-anthony-albanese-nsw-leadership-spill-liberal-chaos-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Turkey will host the Cop31 climate conference after the Australian government dropped its push to hold the event in Adelaide at the last moment despite having invested in a more than three-year campaign.</p><p>But Australia’s climate change minister, Chris Bowen, is expected to lead climate negotiations at the summit in Turkey’s Mediterranean resort city of Antalya in November 2026 under a compromise deal to resolve a standoff between the two countries.</p> <a href=\"https://www.theguardian.com/australia-news/2025/nov/20/turkey-to-host-cop31-climate-conference-after-australia-drops-push-to-hold-it-in-adelaide\">Continue reading...</a>",
  "published": "Thu, 20 Nov 2025 01:51:33 GMT",
  "url": "https://www.theguardian.com/australia-news/2025/nov/20/turkey-to-host-cop31-climate-conference-after-australia-drops-push-to-hold-it-in-adelaide",
  "source": "The Guardian"
}