{
  "title": "Lip-Lock legacy: Humans inherited kissing from apes; origins trace back 21mn years",
  "text": "BENGALURU: If you think kissing is only about human romance, you’re already missing the story. The first kiss happened long before humans walked the Earth—somewhere in the misty forests of prehistoric Africa, between two ape ancestors, 16.9-21.5 million years ago.As per a new evolutionary study, a kiss is better understood as an ancient, risky mouth-to-mouth gamble that large apes, and probably Neanderthals, started playing millions of years ago. And instead of asking what a kiss means, researchers went after a tougher question: why this odd, germ-sharing behaviour evolved at all in the first place.Researchers from University of Oxford, University College London, and the Florida Institute of Technology began by stripping the sentimentality out of kissing and giving it a cross-species definition: non-aggressive, mouth-to-mouth contact within a species, with some lip or mouth movement and no food transfer.That rules out feeding, “kiss-fighting” and your dog licking your face, but includes everything from human deep kisses to brief pecks between monkeys and apes. As per this definition, they found that kissing occurs in taxa as diverse as ants, birds, and polar bears, but the majority of reports seem to be in the primates.Using this, they sifted through decades of primate fieldwork and video material to classify each Afro-Eurasian monkey and ape species as “kissing observed” or “not observed”.They then mapped the data onto a primate family tree and used statistical methods to estimate when kissing first appeared. Their findings: proper lip-to-lip contact predates humans by a vast margin. The behaviour likely evolved in the common ancestor we share with chimpanzees, bonobos and orangutans, making every romantic clinch a faint genetic echo from deep time.The research, published in Evolution and Human Behavior, also indicates an 84% chance that Neanderthals kissed. It is even possible they kissed modern humans during the period both species coexisted. The clue lies in shared oral microbes that could only have been passed through close mouth-to-mouth contact.Why Kiss At All?Kissing poses an evolutionary puzzle because it offers no obvious survival benefit, while the risk of disease transfer is high. Matilda Brindle from University of Oxford and her colleagues wanted to know why animals persist with it. Using primates, the only group where kissing is well-documented, they traced its evolutionary path.The behaviour appears in most great apes and at least eight Old World monkey species. Gorillas do it, though infrequently. Bonobos engage in what researchers call “prolonged tongue-tongue interaction”. Chimpanzees opt for brief, tense kisses, usually after confrontations.So why kiss at all? Leading explanations suggest it may help assess a mate’s health, increase arousal, strengthen social bonds or even transfer beneficial microbes. The study hints that species with several mating partners are more likely to kiss, pointing to a role in sexual selection.Yet kissing is not universal among humans. It is absent in some societies, raising the possibility of cultural learning rather than pure instinct.The researchers note that scientific records of kissing are sparse because the behaviour is often dismissed as trivial. Still, they argue that their framework offers a starting point for understanding a habit so common that we rarely question it.Next time you kiss someone, remember: you’re participating in a ritual older than us, refined across millions of years of primate evolution. Though whether that makes it more or less romantic is anyone’s guess.",
  "summary": "A groundbreaking study reveals kissing predates humans by millions of years, originating with ape ancestors in prehistoric Africa. Researchers define it as non-aggressive mouth-to-mouth contact, observing it across diverse species, particularly primates. This ancient behavior, possibly practiced by Neanderthals, may have evolved for mate assessment or social bonding, offering a glimpse into our deep evolutionary past.",
  "published": "Fri, 21 Nov 2025 06:44:51 +0530",
  "url": "https://timesofindia.indiatimes.com/india/we-stole-our-smooch-from-apes-from-21mn-years-ago/articleshow/125475004.cms",
  "source": "Times of India"
}