{
  "title": "Jeeves Again review – new Jeeves and Wooster stories by celebrity fans",
  "text": "As with most of the giants of late 19th- and early 20th-century English literature, the vast majority of PG Wodehouse’s readers today are non-white. Perhaps it was brutal colonial indoctrination that ensured the modern descendants of the aspirant imperial middle classes from Barbados to Burma, with their tea caddies, gin-stuffed drinks cabinets and yellowing Penguin paperbacks, still devour Maugham, Shaw and Kipling. Perhaps they just have good taste.\n\nWodehouse’s detractors are many – Stephen Sondheim (“archness … tweeness … flimsiness”), Winston Churchill (“He can live secluded in some place or go to hell as soon as there is a vacant passage”), the Inland Revenue – but for millions around the world he remains the greatest comic writer Britain has ever produced. And he clearly still sells here, as this collection of a dozen new officially sanctioned stories by writers, comedians and celebrity admirers, out in time to be a stocking filler, attests.\n\nThese aren’t the first modern Jeeves stories – Ben Schott and Sebastian Faulks, no strangers to the stocking-filler market, have contributed three novels in the past 12 years – but they’re the first attempt at the form that made Wodehouse one of the highest-paid writers of his time, the short story. It’s easy to parody Jeeves and Wooster: the pyjama-clad prelapsarian sexlessness, the midnight bally-hooing and double-barrelled surnames. It’s much harder to pinpoint what makes them stand the test of time – the remarkable psychological insights into human nature that Jeeves displays, the inherent decency of Bertie Wooster, the gift for observation and description that never reaches too far or outstays its welcome.\n\nMuch like Wodehouse’s post-50s output, it’s a mixed bag of the quotidian with a few touches of magic\n\nWodehouse always played absurd situations completely straight; even in the face of outright insanity, characters will remain decorous to a fault, straitjacketed by centuries of social convention and selective breeding. There are no winking asides to the audience; while Bertie is an inveterate fourth-wall breaker, his humour, and thankfully this collection, is never tainted by what dooms most 21st-century comic novels: references to social media that make no sense in a year or two’s time. Wodehouse planned laboriously, writing hundreds of pages of notes, his novels structured around set pieces chosen and then relentlessly stress-tested for their comic value. For every apposite simile and unexpected transferred epithet, a dozen were rejected. The stories here are well put together, if not as expertly planned, with sometimes a slight laboriousness in the construction as they get into gear. The urge of every pastiche writer, to explore territories unknown to the original writer, is mostly handled tastefully: see Frank Skinner’s opening sojourn into modern London by way of cryogenics gone wrong, and John Finnemore’s blitz air raid warden duty. Roddy Doyle’s Dublin terrace-set effort will cause localised outbreaks of apoplexy on Boxing Day afternoon.\n\nFor every modern touch there are surfeits of Bertie’s slangy initialising, “Knock me down with a feather”-ing and Jeeves’s encyclopedia quoting. Much like Wodehouse’s post-50s output, it’s a mixed bag of the quotidian with a few touches of magic. Dominic Sandbrook’s inspired story, in the form of a university exam and with lovingly Craig Brownish send-ups of Chips Channon and George Orwell, is the best piece here, and features the utterly barmy line: ‘‘‘The day Roderick Spode appeared on Multi-Coloured Swap Shop was the day that British culture died’ – Polly Toynbee. Is this fair?” The QI elf turned novelist Andrew Hunter Murray’s sparky entry aims at the pomposity of Britain’s most resolutely Wodehousian industry, publishing, and there’s a touching feminist reworking of Aunt Agatha by Scarlett Curtis. A few stories waste interesting set-ups by overusing modern references as a shortcut to easy laughs.\n\nAs Evelyn Waugh wrote, the reading public has never much cared how Wodehouse’s characters would react to changing social conditions. Wodehouse himself well understood, during his self-exile on Long Island following his disastrously ill-thought-through wartime radio broadcasts from Berlin, that he was a man out of time – see his rueful revised lyrics for a 60s Cole Porter revival: “When the courts decide, / As they did latterly, / We could read Lady Chatterley, / If we chose, Anything goes”. Feeling rejected by his country, he chose to aim for timelessness.\n\nThis new collection will be warmly welcomed by fans who want to keep Wodehouse’s name and reputation burning brightly. The stories clearly come from a place of love and respect, plus, on the 50th anniversary of Wodehouse’s death, the keen-eyed appreciation of a commercial opportunity. Jeeves (and Wooster) would approve.\n\nskip past newsletter promotion Sign up to Bookmarks Free weekly newsletter Discover new books and learn more about your favourite authors with our expert reviews, interviews and news stories. Literary delights delivered direct to you Enter your email address Sign up Privacy Notice: Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on theguardian.com to send you this newsletter. You can complete full registration at any time. For more information about how we use your data see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion",
  "summary": "<p>This collection of new short stories about Bertie and his valet pays homage to the genius of PG Wodehouse – just in time for Christmas</p><p>As with most of the giants of late 19th- and early 20th-century English literature, the&nbsp;vast majority of <a href=\"https://www.theguardian.com/books/pgwodehouse\">PG Wodehouse</a>’s readers today are non-white. Perhaps it was brutal colonial indoctrination that ensured the modern descendants of the aspirant imperial middle classes from Barbados to Burma, with their tea caddies, gin-stuffed drinks cabinets and yellowing Penguin paperbacks, still devour Maugham, Shaw and Kipling. Perhaps they just have good taste.</p><p>Wodehouse’s detractors are many – Stephen Sondheim (“archness … tweeness … flimsiness”), Winston Churchill (“He can live secluded in some place or go to hell as soon as there is a vacant passage”), the&nbsp;Inland Revenue – but for millions around the world he remains the greatest comic writer Britain has ever produced. And&nbsp;he clearly still sells here, as this collection of a dozen new officially sanctioned stories by writers, comedians and celebrity admirers, out in time to be a stocking filler, attests.</p> <a href=\"https://www.theguardian.com/books/2025/nov/20/jeeves-again-review-new-jeeves-and-wooster-stories-by-celebrity-fans\">Continue reading...</a>",
  "published": "Thu, 20 Nov 2025 07:00:17 GMT",
  "url": "https://www.theguardian.com/books/2025/nov/20/jeeves-again-review-new-jeeves-and-wooster-stories-by-celebrity-fans",
  "source": "The Guardian"
}