{
  "title": "Ford UK boss warns Rachel Reeves against higher taxes on electric vehicles",
  "text": "The boss of Ford UK has warned Rachel Reeves against increasing taxes on electric vehicles in next week’s budget, saying it could discourage drivers from making the switch away from petrol and diesel cars.\n\nLisa Brankin, the managing director of Ford UK, said it was “certainly not the right time” to introduce new levies on EVs, amid reports that the chancellor could implement a new pay-per-mile charge on electric vehicles (EVs) from 2028.\n\nThe proposed plan would introduce a charge of 3p a mile for EVs on top of other road taxes, to help offset falling tax revenue from petrol and diesel cars.\n\nView image in fullscreen Lisa Brankin, the managing director of Ford UK. Photograph: Ford\n\n“That [policy], in the face of really fragile demand for electric vehicles, is just another brake,” Brankin told the BBC.\n\n“Electric vehicles in some instances have gone from being a great thing to being something that we’re trying to push people into,” she added.\n\nBrankin’s company, which makes the bestselling car in the UK, the Ford Puma, is among the many carmakers under pressure to meet the government’s target for 80% of new vehicle sales to be EVs by 2030.\n\nThe government reintroduced an electric car grant worth up to £3,750 in July after intense lobbying by carmakers who argued that they were struggling to meet targets on electric sales.\n\nElectric car sales have been hitting record highs in the UK since, but Brankin said that without such government support Ford would not be able to achieve the 80% target.\n\nView image in fullscreen Brankin said Reeves should retain lower rates of ‘company car tax’ on EVs for companies ‘greening’ their fleets. Photograph: Justin Tallis/Reuters\n\nThe market was “distorted” owing to heavy discounting and lower values for second-hand EVs, she said.\n\n“When that [target] was set a number of years ago, the outlook for demand around electric vehicles was buoyant and there seemed to be momentum behind electric vehicles. What we’re seeing now is that customer demand is not in line with that ambition.”\n\nBrankin added: “It’s really easy to sell people things they want,. It’s hard to sell people things they don’t want.”\n\nMany new EVs are sold to businesses for their employees, who benefit from lower rates of “company car tax” compared with diesel or petrol options.\n\nBrankin said Reeves should retain this tax benefit for companies “greening” their fleets.\n\nFord, whose world headquarters is in Michigan in the US, employs about 6,000 people in the UK, including at its diesel engine plant in Dagenham.\n\nBrankin said the company was yet to make any decisions about the long-term future of the Dagenham plant, which will build diesel engines up until 2030.\n\n“We’re working really hard on what the next life of Dagenham looks like,”she said, adding there was “nothing that we’ve settled on at the moment”.\n\nA spokesperson for the Treasury said: “Fuel duty covers petrol and diesel, but there’s no equivalent for electric vehicles. We want a fairer system for all drivers whilst backing the transition to electric vehicles, which is why we have invested £4bn in support, including grants to cut upfront costs by up to £3,750 per eligible vehicle.\n\n“Just as it is right to seek a tax system that fairly funds roads, infrastructure and public services, we will look at further support measures to make owning electric vehicles more convenient and more affordable.”",
  "summary": "<p>Lisa Brankin says new levies could discourage switch to EVs amid reports chancellor mulling pay-per-mile charge</p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/nov/20/markets-rally-nvidia-results-ai-bubble-us-jobs-report-ftse-pound-dollar-business-live-news\">Business live – latest updates</a></p></li></ul><p>The boss of Ford UK has warned Rachel Reeves against increasing taxes on electric vehicles in next week’s budget, saying it could discourage drivers from making the switch away from petrol and diesel cars.</p><p>Lisa Brankin, the managing director of Ford UK, said it was “certainly not the right time” to introduce new levies on EVs, amid reports that the chancellor could implement a new <a href=\"https://www.theguardian.com/business/nils-pratley-on-finance/2025/nov/06/ignore-the-howls-around-pay-per-mile-chancellor-we-cant-afford-not-to-tax-electric-cars\">pay-per-mile charge</a> on electric vehicles (EVs) from 2028.</p> <a href=\"https://www.theguardian.com/environment/2025/nov/20/ford-uk-boss-warns-rachel-reeves-against-higher-taxes-on-electric-vehicles\">Continue reading...</a>",
  "published": "Thu, 20 Nov 2025 08:49:55 GMT",
  "url": "https://www.theguardian.com/environment/2025/nov/20/ford-uk-boss-warns-rachel-reeves-against-higher-taxes-on-electric-vehicles",
  "source": "The Guardian"
}