{
  "title": "Record high: Study finds growing cannabis use among older adults",
  "text": "Marijuana use among older adults in the US has reached a new high, with 7 percent of adults aged 65 and over who report using it in the past month, according to an analysis led by researchers with the Center for Drug Use and HIV/HCV Research (CDUHR) at the NYU School of Global Public Health.\n\nTheir findings, published in JAMA Internal Medicine, also show that the profile of those who use cannabis has changed in recent years, with pronounced increases in use by older adults who are college-educated, married, female, and have higher incomes.\n\n\"Our study shows that cannabis use among older adults continues to increase, although there have been major shifts in use according to demographic and socioeconomic factors,\" said Joseph Palamar, PhD, MPH, an associate professor of population health at NYU Grossman School of Medicine, an affiliated researcher with CDUHR, and the study's senior author.\n\nMost Americans live in a state where marijuana has been legalized for medical use, recreational use, or both. To better understand the prevalence of marijuana use among older adults in the US, researchers examined data from the National Survey on Drug Use and Health from 2021 through 2023. The respondents, who were 65 and older, were asked about past-month cannabis use, which was defined as \"current\" use.\n\n\"This is the first time we were able to examine 'current' use of cannabis in this age group. Before, we were only able to look at past-year use because the numbers for current use were too small,\" said Benjamin Han, MD, MPH, associate professor and associate chief of research in the Division of Geriatrics, Gerontology, and Palliative Care at the University of California San Diego and the study's first author.\n\nThe researchers found that current cannabis use among older adults grew to 7 percent in 2023, up from 4.8 percent in 2021 and 5.2 percent in 2022 -- a nearly 46 percent increase in only two years.\n\n\"If we look even further back to 2006 and 2007, less than 1 percent of older adults used cannabis in the past year. Now, we're seeing that 7 percent have used it in the past month alone,\" said Han, an affiliated researcher with CDUHR.\n\nCertain groups of older adults experienced sharper increases in use over this period than others, including those who are married, white, have a college degree, and have an income of at least $75,000. Older women also saw a steep increase in cannabis use, although older men are still more likely than women to use the drug.\n\nIn addition, cannabis use grew more among those living in states where medical marijuana is legal versus states where it is not.\n\n\"It shouldn't be surprising that use is becoming increasingly more common among people who live in states that allow medical cannabis, which could be due to increased availability or social acceptability,\" said Palamar. \"Interestingly, with respect to income, those with the highest incomes had the lowest prevalence of cannabis use in 2021, but by 2023 this group had the highest prevalence, which may indicate who has access to medical cannabis given its costs.\"\n\nThe researchers also found significant increases in cannabis use by older adults with chronic diseases -- and notably, those with multiple chronic conditions -- including heart issues, diabetes, hypertension, cancer, and chronic pulmonary obstructive disease.\n\nThe authors caution that the overall increases may be driven, in part, by those who use cannabis aging into the 65+ age bracket for the period studied. Regardless, they recommend that clinicians screen and educate their older patients about cannabis use, including how physiological changes that accompany aging can make people more sensitive to psychoactive substances.\n\n\"As a geriatrician, I see more and more people interested in using cannabis for treating chronic health symptoms. But cannabis can complicate the management of chronic diseases and be potentially harmful if patients are not educated on its use and potential risks,\" said Han.\n\nKevin H. Yang of UC San Diego and Charles Cleland of NYU Grossman School of Medicine were also co-authors on the study. The research was supported by the National Institute on Drug Abuse (K23DA043651, R21DA058404, R21DA060362, R01DA057289, R01DA060207, and P30DA01104) and the UC San Diego Sam and Rose Stein Institute for Research on Aging.",
  "summary": "Marijuana use among older adults in the US has reached a new high, with 7 percent of adults aged 65 and over who report using it in the past month, according to a recent analysis.",
  "published": "Mon, 02 Jun 2025 22:54:04 EDT",
  "url": "https://www.sciencedaily.com/releases/2025/06/250602225404.htm",
  "source": "Latest Science News -- ScienceDaily"
}