{
  "title": "Federal Workers Ask Judge To Block Trump’s ‘Loyalty’ Question On Job Applications",
  "text": "LOADING ERROR LOADING\n\nGovernment employees asked a federal judge Wednesday to block the Trump administration from encouraging job applicants to demonstrate their loyalty to the president’s agenda.\n\nIn a lawsuit filed earlier this month, a group of federal labor unions argues that the White House’s “merit hiring plan” violates applicants’ First Amendment rights. The plan, put forth by the Office of Personnel Management, includes the following short essay question:\n\nAdvertisement\n\n“How would you help advance the President’s Executive Orders and policy priorities in this role? Identify one or two relevant Executive Orders or policy initiatives that are significant to you, and explain how you would help implement them if hired.”\n\nThe administration rolled out the question in May as part of its hiring plan. But following an outcry, the White House said answering the questions was optional and claimed applicants wouldn’t damage their prospects if they skipped them.\n\nDemocracy Forward, a legal group assisting the unions in the lawsuit, says the “loyalty question” is currently part of more than 6,000 federal job postings.\n\nAdvertisement\n\nThe unions claim the question creates an “unconstitutional” and discriminatory system in which job-seekers are rewarded or punished for their political views. The administration’s hiring plan is part of a broader effort by Trump to politicize the traditionally nonpartisan civil service, raising concerns he could return it to an old-style spoils system.\n\n“This question is a clear violation of my free speech rights and it goes against everything that the United States stands for.” - From a VA employee's declaration\n\nOn Wednesday, the unions asked a judge to issue a preliminary injunction that would prevent the administration from putting the loyalty question to applicants while the case moves forward.\n\nAdvertisement\n\nAs part of the litigation, several federal employees anonymously submitted declarations testifying to how they believe the question infringes on their rights. They asked to withhold their names for fear that federal agencies might retaliate against them.\n\nA Colorado-based employee of the Department of Education said the application question has prevented them from applying for a new federal job, even though they know Donald Trump’s administration is continuing to dismantle their agency.\n\n“Honesty is important to me, and I cannot in good conscience pretend to agree with President Trump’s policies,” the worker attested. “Even if the question is supposed to be optional, I believe it would be used against me if I don’t answer. After all, the question is there for a reason.”\n\nAdvertisement\n\nPresident Donald Trump's administration issued a \"merit hiring plan\" earlier this year that asks job applicants to pledge their loyalty to the president. via Associated Press\n\nA Department of Veterans Affairs employee who works in information technology said they had been applying for other federal jobs that seem better insulated from layoffs. They were recently “taken aback” when they came upon the loyalty question.\n\n“This question is a clear violation of my free speech rights and it goes against everything that the United States stands for,” the employee said. “As a civil servant, I do not have to profess loyalty to a particular President. I instead profess loyalty to the Constitution.”\n\nAdvertisement\n\nAnother VA worker who’s been applying to jobs at other agencies said they answered the loyalty question only because they assumed their application would be tossed if they didn’t. Answering honestly required some research, apparently.\n\n“To answer, I had to look through President Trump’s executive orders, the vast majority of which I disagreed with, to find one that I could discuss at least somewhat positively,” the worker recounted. “I would not have done so if not for the question on job applications.”",
  "summary": "One federal employee said in a court filing that they \"cannot in good conscience pretend to agree with President Trump’s policies.\"",
  "published": "Thu, 20 Nov 2025 16:56:16 -0500",
  "url": "https://www.huffpost.com/entry/trump-loyalty-question-lawsuit_n_691f7faae4b0448495238ff5",
  "source": "Politics"
}