{
  "title": "How to avoid bad Black Friday TV deals – and some of the best UK offers for 2025",
  "text": "When it comes to buying a new TV during Black Friday, careful prep and a canny eye for detail are everything. Sometimes that big-screen bargain isn’t quite the steal you might think, and even if the price is right, niggling problems could sour long-term satisfaction.\n\nThe Guardian’s journalism is independent. We will earn a commission if you buy something through an affiliate link. Learn more.\n\nAnd it may be that you don’t need a new TV at all – don’t let the Black Friday FOMO fool you. Read our guide to making the most out of the TV you already have.\n\nBut if you are set on a new TV, the trick is to know what you want, and why, before you start shortlisting. Here we tell you everything you need to look out for, before rounding up some of the best TV deals in this year’s Black Friday sales.\n\nBlack Friday TV deals: what to look for\n\nView image in fullscreen Steer clear of the bargain aisle if you want your new TV to make a statement. Photograph: Pressmaster/Getty Images\n\nDesign is important\n\nDesign counts. If you want that new TV to be a statement in your living space, stay clear of the bargain aisle – that’s where you’ll find cookie-cutter designs with flimsy plastic pedestal stands. If you’re not wall mounting, pay particular attention to the feet. Are they placed close to each edge? On a TV 55 inches and larger, that could mean you’ll also have to factor in new furniture just to accommodate it.\n\nCentral pedestal stands are always the easiest to live with, and some models also have a swivel so that you can angle the screen to best suit your seating. It’s a little bonus well worth having.\n\nThink about when you’ll use it\n\nAre you buying a TV for everyday use, or do you hanker after a special screen for movies? If it’s the latter, buying an OLED will generally be your best bet. Unlike LED-based TVs, there’s no need for a backlight, because OLED pixels are self-emitting. This means when you dim the lights, black levels stay nice and inky and shadow detail is retained, giving your pictures cinematic depth. Conversely, LED models (be they LCD LED, QLED or Mini LED) tend to look their best in rooms with ambient light, and therefore make better daytime TVs.\n\nConnectivity counts\n\nDon’t just look at the front. The cheapest TVs you’ll see during the Black Friday sales will only offer three HDMI inputs at the back. This may be fine if you don’t plan on connecting much equipment, but it could prove limiting in the long term. Cheap televisions tend to offer poor audio, so one of those HDMI ports will probably be assigned to a soundbar. That just leaves two to share between games consoles, set-top boxes and Blu-ray/DVD players.\n\nView image in fullscreen Maximise gaming performance by playing at a higher refresh rate. Photograph: simpson33/Getty Images\n\nConsider what you need for gaming\n\nIf you plan to play video games on your new set, check to see if those HDMIs support a 120Hz high refresh rate. If you own a PlayStation 5 or current Xbox, you can maximise performance (and therefore improve your chances of winning against your mates) by playing at a higher refresh rate. These 120Hz-capable TVs also tend to offer VRR (variable refresh rate) and ALLM (auto low latency mode), acronyms that add to the gaming experience.\n\nIncidentally, if you buy a Sony Bravia, there’s a good chance it will also have PS Remote Play, meaning you can enjoy your PlayStation console while it’s not even in the same room as the TV.\n\nOf course, you can always play games on standard 60Hz TVs, and if you have an older console or just like casual family games, you’ve nothing to worry about.\n\nDon’t avoid last year’s models\n\nMany TV makers use Black Friday to offer cheap deals on older stock, to clear inventory. This is where you really can grab a killer deal, particularly at the mid-to-higher end of the market.\n\nFor example, a 2024 LG OLED C5 55in screen has a sale price of £1,199. The 2025 G5 OLED, also on sale, still commands a premium of £1,599. Last year’s top models will still impress 12 months after release.\n\nBuying a well-reviewed older TV is almost always better than buying a newer model that’s been stockpiled to shift in volume during the sales.\n\nNot all HDR is worth having\n\nIt’s worth bearing in mind that not all HDR (high dynamic range) TVs are created equal. While every 4K model sporting a Black Friday price tag will boast HDR compatibility, there can be huge differences in performance. Entry-level screens – typically those 50in models selling for little more than £200 – will invariably lack the brightness to make HDR programmes really shine. Indeed, in their attempt to make HDR details (such as bright street lights, fireworks, explosions and so on) pop, the rest of the show can look unnaturally dark. These HDR ‘lite’ TVs are actually better suited to non-HDR programmes, such as regular SDR (standard dynamic range) channels on Freeview, rather than streams from Netflix and Co.\n\nThe good news is that HDR performance improves dramatically from the mid-range upwards, and is a real differentiator at the posh end of the market.\n\nBe aware also that HDR comes in different flavours. In addition to standard HDR10, there’s HDR10+, Dolby Vision and cleverly ‘Adaptive’ versions of each on top, able to react to the light levels in your living room. Film fans favour screens that offer Dolby Vision, but not every brand has it. Samsung is the most prominent outlier.\n\nSound advice\n\nFinally, listen out for audio. It’s a fact that thin, inexpensive TVs generally tend to sound awful. They lack bass and become painful when you crank the volume. But there are exceptions that could save you from shelling out on a soundbar.\n\nSamsung QLED TVs boasting object tracking sound (OTS) offer far better audio than you might expect, and tend to have innovative processing that can enhance dialogue and combat extraneous noise, making them great for family use. Meanwhile, Sony OLED TVs have a clever Acoustic Surface Audio sound system, which uses actuators on the rear of the OLED panel to produce impressive high-fidelity audio. And if you want the full home theatre audio enchilada, Panasonic’s best sets have a full 360-degree sound system with front, side and up-firing speakers tuned by sister brand Technics, able to produce convincing Dolby Atmos cinema sound.\n\nAnd here’s a closing tip. Even if your Black Friday bargain TV doesn’t have decent sound onboard, check to see if it passes a Dolby Atmos signal out over the e-ARC HDMI connection, because you can always add a great-sounding Dolby Atmos soundbar during the January sales. Steve May\n\nQ&A How is the Filter covering Black Friday? Show At the Filter, we believe in buying sustainably, and the excessive consumerism encouraged by Black Friday doesn’t sit easily with us. However, we also believe in shopping smarter, and there’s no denying that it’s often the best time of year to buy big-ticket items that you genuinely need and have planned to buy in advance, or stock up on regular buys such as skincare and cleaning products. Retailers often push offers that are not as good as they seem, with the intention of clearing out old stock, so we only recommend genuine deals. We assess the price history of every product where it’s available, and we won’t feature anything unless it is genuinely lower than its average price – and we will always specify this in our articles. We only recommend deals on products that we’ve tested or have been recommended by product experts. What we choose to feature is based on the best products at the best prices chosen by our editorially independent team, free of commercial influence. Was this helpful? Thank you for your feedback.\n\nThe best 4K TV deals this Black Friday\n\nAn affordable 55in TV\n\nHisense A6Q LED, 55in\n\nFor such an affordable mid-sized TV, this Hisense A6Q ticks most of the boxes, with a 4K resolution and a pleasant complement of HDR standards (Dolby Vision, HDR10 and HLG) that can provide vivid highlights in supported content. Freely is built in to provide access to live and on-demand TV out of the box, with no aerial or set-top box required. For gaming, there’s support for Auto Low Latency Mode, although the refresh rate tops out at 60Hz (120Hz or higher is preferable for smoother onscreen action with recent consoles). Connectivity is limited to three HDMI 2.1 ports.\n\nPrice history: this is its lowest ever price.\n\nA bargain TCL TV\n\nTCL C6KS QD-Mini LED, 50in\n\nThe TCL C6KS seems too good to be true, packed with higher-end features at a bargain-basement price. It’s a modest 50 inches, but its Mini LED panel is bright and sharp with 160 dimming zones, allowing for surprisingly vibrant and saturated images for a television at this price point. Its new HVA panel helps in providing more depth to its overall images, top. For this price, the fact that it supports HLG, HDR10, HDR10+ and Dolby Vision is excellent. Many TVs several times more expensive can’t say that.\n\nGaming performance is fine – it’ll do up to 4K/60Hz with VRR and ALLM – although the lack of higher-refresh-rate output means it isn’t optimal for powerful home consoles or PCs. In terms of connectivity, there are three HDMI ports, one of which supports eARC to hook up a soundbar or speakers for improved audio. The Onkyo-branded system with this TV is surprisingly detailed, though – you may be able to get away with using it for some time before feeling the need to upgrade to separate speakers.\n\nPrice history: this is its lowest ever price.\n\nA quality Sony TV for a low price\n\nSony Bravia KD55X75WL, 55in\n\nWhile this isn’t Sony’s latest and greatest option, it’s a quality telly for a great price. It’s a moderate size that should be good for most rooms, and HDR support is reasonable, with HDR10, HLG and Dolby Vision all supported.\n\nThis Sony TV also comes with four HDMI ports for inputs, plus support for eARC to connect a soundbar or supported speakers. For gaming, it has ALLM, a custom screen size setting, a black equaliser and an onscreen crosshair – features more commonly seen in monitors than TVs.\n\nSmart TV duties are handled by the familiar Google TV OS, providing good access to smart apps, and it bundles in 15 credits of Sony Pictures Core and a 24-month streaming package.\n\nPrice history: this is its lowest ever price.\n\nA bright Mini LED TV\n\nHisense U7Q Pro Mini LED, 65in\n\nThis large, feature-rich Mini LED TV looks like a capable option for everything from games to films.\n\nThere’s a rich set of HDR support (Dolby Vision and Dolby Vision IQ, plus HDR10+, HDR10 and HLG) and the Mini LED screen allows for some serious depth and searing brightness (Hisense claims a peak brightness of 2,000 nits).\n\nThe integrated speakers provide up to 50W of power and support Dolby Atmos and DTS:X surround standards. There are different sound modes to dig into, too, as well as different picture modes, so you can optimise image quality as you wish.\n\nIt has four HDMI 2.1 ports with full support for 4K/120Hz gaming, so will play nicely with modern games consoles (and if you’re a PC gamer looking for a living-room monitor, you’ll be glad to know that refresh rate can be overclocked further up to 165Hz). Support for variable refresh rate and ALLM further enhances the gaming experience.\n\nPrice history: not available, but this is its lowest ever price at Currys.\n\nAn entry-level LG OLED for less\n\nLG B5 OLED, 55in\n\nLG’s B5 OLED is the most affordable entry in the brand’s 2025 OLED lineup, adding a new processor, improved connectivity and an updated UI to last year’s B4 model.\n\nIt comes with four HDMI 2.1 ports with full support for 4K/120Hz output, and also offers VRR and ALLM for gaming. In terms of HDR, the B5 supports Dolby Vision IQ, Dolby Vision, HDR10, HLG and Cinema HDR, offering impactful highlights in supported content. It also comes with LG’s slick and easy-to-use webOS operating system, with a wide range of streaming apps, plus different picture modes. The 20W speakers support Dolby Atmos.\n\nIf you want a larger version, the 65in version is currently £1,299 at AO.\n\nPrice history: this is the lowest ever price.\n\nskip past newsletter promotion Sign up to The Filter Free weekly newsletter Get the best shopping advice from the Filter team straight to your inbox. The Guardian’s journalism is independent. We will earn a commission if you buy something through an affiliate link. Enter your email address Sign up Privacy Notice: Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on theguardian.com to send you this newsletter. You can complete full registration at any time. For more information about how we use your data see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nA Philips Ambilight bargain\n\nPhilips Ambilight 65PUS8200, 65in\n\nIf all you’re after is a serviceable and hardy larger-screen TV, then this 65in Philips Ambilight model could be a good choice – especially for sub-£500. It provides you with plenty of screen real estate and Philips’ own TitanOS smart system for accessing smart TV apps.\n\nThere is decent HDR support for such an affordable television, with HDR10 and HLG, plus compatibility with HDR10+, and it has three HDMI ports – one of which is an eARC port for soundbars. It also supports HDMI VRR and ALLM for gaming. With this in mind, though, its maximum refresh rate is 60Hz rather than 120Hz. Its 20W speakers also have Atmos support.\n\nWhat’s unique about Philips TVs is the presence of the company’s Ambilight system, which provides atmospheric lighting on the rear of the unit that projects on to the surface behind it. Aimed at reducing eye strain, this is also useful if you want to add a splash of colour to your room.\n\nPrice history: this is its lowest ever price.\n\nA smart Samsung OLED\n\nSamsung S90F OLED, 65in\n\nThe S90F is one of the only QD-OLED TVs Samsung offers – combining the inky blacks and virtually infinite contrast of an OLED with the higher peak brightness of a QLED. It means this telly provides sublime image quality. HDR support consists of HDR10, HDR10+ and HLG; Samsung still isn’t supporting Dolby Vision.\n\nThe four HDMI 2.1 ports are welcome, and offer support for proper 4K/120Hz gaming, with up to 144Hz for PC gaming. There is also support for variable refresh and ALLM, alongside Samsung’s Game Hub menu.\n\nPrice history: this is its lowest ever price at Amazon.\n\nSony’s best OLED TV\n\nSony Bravia 8 II QD-OLED, 65in\n\nSony’s Bravia 8 II is one of the best TVs currently available – with a price to match. The QD-OLED panel is 25% brighter than on the A95L model it replaces, with even sharper picture quality, not least with HDR enabled. There’s support for Dolby Vision, HLG and HDR10, and claimed peak brightness is a searing 4,000 nits.\n\nThe Acoustic Surface Audio+ speaker system is widely well reviewed, providing surprisingly solid audio for a set of TV speakers. Gaming support is strong, too, with 4K/120Hz input supported over HDMI 2.1, plus VRR and ALLM. There’s even an ‘optimised for PS5’ mode that automatically optimises the TV’s settings when it detects that the PlayStation is plugged in. Unlike Samsung and LG’s flagships, however, there are only two HDMI 2.1 ports here (one of which is an eARC, if you did want to connect a soundbar).\n\nPrice history: this is its lowest ever price.\n\nAn LG mid-range TV for a little cheaper\n\nLG C5 OLED, 55in\n\nLG’s latest mid-range C-series model OLED offers an improved operating system and a new processor over last year’s C4. The new processor helps it to better upscale content to 4K than previous models, too, which is handy if you watch a lot of older and lower-definition content.\n\nThere are four HDMI 2.1 ports for 4K/144Hz gaming (or up to 4K/120Hz on consoles), with VRR and ALLM supported on all of them. HDR support comes in the form of HDR10, HLG and Dolby Vision, and this 55in model benefits from LG’s Evo panel for even stronger brightness.\n\nAs you’d expect from an LG OLED, it comes with dazzling image quality with inky blacks, sublime contrast and wonderfully accurate colours that make viewing everything from games to movies a pleasure.\n\nPrice history: it’s been available slightly cheaper but this is its lowest price at a mainstream retailer.\n\nA great mid-range Sony OLED\n\nSony Bravia 8A OLED, 55in\n\nThe Sony Bravia 8A was initially more expensive than the standard Bravia 8, but as pricing has settled, this A variant has become a more compelling choice. One of Sony’s 2024 TV models, it comes with an OLED panel that it claims is 10% brighter than its predecessor. HDR support comes in with Dolby Vision, HDR10 and HLG (no HDR10+). It also comes with Sony’s AI-enabled Bravia XR processor inside, plus the same Acoustic Surface Audio+ sound system for surprisingly decent audio. The Google TV operating system also provides a familiar experience.\n\nAs an OLED, image quality looks to be rather excellent, and gamers should be decently happy with HDMI 2.1 support for 4K/120Hz output with VRR and ALLM. As with the other Bravia above, this comes with the caveat that HDMI 2.1 is supported on only two of this TV’s four HDMI inputs.\n\nPrice history: this is its lowest ever price.\n\nThe small 42in smart OLED TV\n\nLG C5 OLED, 42in\n\nThis 42in TV is the most compact OLED you can buy in the current LG range, making it a dead cert if you’ve got a smaller room like me, or want to use this TV as a super-size monitor.\n\nThere are four HDMI 2.1-enabled ports with 4K/144Hz capability (and up to 120Hz on consoles), plus VRR and ALLM support for gaming. There’s also solid HDR support with HDR10, Dolby Vision and HLG. LG’s new webOS 25 brings small upgrades, such as the ability to hide apps on the front screen, and it’s a reasonable smart TV system to use every day.\n\nIt also comes with a new AI Magic Remote with what LG calls ‘AI buttons’ – voice controls and drag-and-drop functions.\n\nPrice history: this is its lowest ever price.\n\nThe surprising Mini LED standout 65in TV\n\nTCL C7K QD-Mini LED, 65in\n\nTCL has become known for its more affordable, feature-rich televisions in recent years. The C7K is a shining example of this, providing excellent image quality at a modest price point for its 65in size. A particular highlight is its fantastic black levels, contrast and dynamic range, helped along by a bright QD-Mini LED panel with 1,008 dimming zones and a claimed peak brightness of up to 2,600 nits.\n\nIt also has a full complement of HDR support, with HLG, HDR10, HDR10+ and Dolby Vision for impactful highlights. Gaming support is great, with two out of the four HDMI ports supporting 4K/144Hz HDMI 2.1 powers with VRR and ALLM. Plus, if you’re willing to drop the resolution down to Full HD from 4K, it can double the refresh rate to 288Hz. That’s a feature more typically found on a PC monitor than a TV, but if you have a powerful PC connected and want to maximise performance in high-refresh-rate games, then the C7K should allow you to do so.\n\nThis new model also adds in a Bang & Olufsen stereo with 60W of power, replacing TCL’s previous collaboration with Onkyo, as well as support for Dolby Atmos and DTS:X soundtracks.\n\nIf you’re after an even bigger screen, the 75in version is £948 at Amazon and AO.\n\nPrice history: it’s only £40 cheaper than it’s been at Currys all month, but it’s still its lowest ever price.\n\nA big-screen LG OLED\n\nLG C4 OLED, 77in\n\nLast year’s mid-range LG OLED, the C4 was the first LG C-series OLED to support native 4K/144Hz output over its four HDMI 2.1 ports – a boon for gamers. It also brings proper Nvidia G-Sync certification for one of its supported VRR standards.\n\nThe presence of webOS 24 brings benefits such as a built-in Chromecast for easy wireless casting right out of the box, and the Alpha 9 processor brings AI smarts to enhance the clarity of onscreen dialogue and to bring even more channels of virtual surround sound. The internal 40W speakers have Atmos support to provide more cinematic audio in supported content.\n\nPrice history: this is higher than it was during Prime Day – but only by 2p.",
  "summary": "<p>We’ve rounded up the best early Black Friday TV deals, from 50in OLEDs and small smart TVs to big-name brands like Samsung and LG</p><p>• <a href=\"https://www.theguardian.com/thefilter/2025/nov/18/do-you-really-need-to-buy-new-tv\"><strong>Do you really need to buy a new TV?</strong></a><strong><br />• </strong><a href=\"https://www.theguardian.com/thefilter/2025/nov/19/how-to-shop-smart-black-friday\"><strong>How to shop smart this Black Friday</strong></a></p><p>When it comes to buying a new TV during Black Friday, careful prep and a canny eye for detail are everything. Sometimes that big-screen bargain isn’t quite the steal you might think, and even if the price is right, niggling problems could sour long-term satisfaction.</p><p>And it may be that you don’t need a new TV at all – don’t let the Black Friday FOMO fool you. Read our guide to <a href=\"https://www.theguardian.com/thefilter/2025/nov/18/do-you-really-need-to-buy-new-tv\">making the most out of the TV you already have</a>.</p> <a href=\"https://www.theguardian.com/thefilter/2025/nov/20/best-black-friday-tv-deals-uk-2025\">Continue reading...</a>",
  "published": "Thu, 20 Nov 2025 12:46:40 GMT",
  "url": "https://www.theguardian.com/thefilter/2025/nov/20/best-black-friday-tv-deals-uk-2025",
  "source": "The Guardian"
}