{
  "title": "Shashi Tharoor lauds PM Narendra Modi’s Ramnath Goenka Lecture: ‘Glad to have been in audience’",
  "text": "Congress leader Shashi Tharoor Tuesday called Prime Minister Narendra Modi’s Ramnath Goenka Lecture “an economic outlook and a cultural call to action”, and said he was “glad to have been in the audience”.\n\nModi on Monday delivered the sixth RNG lecture and spoke about reversing the “Western mindset”, the Bihar Assembly elections, and the Express Group founder Ramnath Goenka’s role in the freedom struggle and beyond.\n\nTaking to social media platform X, Shashi Tharoor wrote that Modi spoke of “India’s “constructive impatience” for development and strongly pushed for a post-colonial mindset”.\n\n“The PM emphasized that India is no longer just an ’emerging market’ but an ’emerging model’ for the world, noting its economic resilience. PM Modi said he’d been accused of being in “election mode” all the time, but he was really in “emotional mode” to redress the problems of the people. A significant part of the speech was dedicated to overturning Macaulay’s 200-year legacy of “slave mentality.” PM Modi appealed for a 10-year national mission to restore pride in India’s heritage, languages, and knowledge systems. I wish he had also acknowledged how Ramnath Goenka had used English to raise a voice for Indian nationalism!,” the post continued\n\nAttended PM @narendramodi’s #RamnathGoenkaLecture at the invitation of @IndianExpress last night. He spoke of India’s “constructive impatience” for development and strongly pushed for a post-colonial mindset. The PM emphasized that India is no longer just an ’emerging market’… pic.twitter.com/97HwGgQ67N — Shashi Tharoor (@ShashiTharoor) November 18, 2025\n\nTharoor wrote that “On the whole, the PM’s address served as both an economic outlook and a cultural call to action, urging the nation to be restless for progress. Glad to have been in the audience despite battling a bad cold and cough!”\n\nWhat PM Modi said in RNG lecture\n\nIn his lecture, Modi said Thomas Babington Macaulay, the colonial officer who moulded Indian education system during British rule, wanted to create Indians who “are Indians by appearance but British at heart”.\n\nModi said India “paid a heavy price” for this, as the belief that the Western or foreign was superior took deep root. Macaulay broke India’s “self-confidence and instilled a sense of inferiority. In one stroke, he discarded thousands of years of India’s knowledge, science, art, culture, and entire way of life,” the prime minister said.\n\nAgainst this backdrop, Modi set a 10-year timeframe, leading to the 200th year of Macaulay’s campaign, to reverse that legacy.\n\nStory continues below this ad\n\nModi also addressed the criticism that he and the BJP remain perpetually in election campaign mode. “Not election mode — one must remain in emotion mode 24 by 7,” he said.\n\nModi recalled that Goenka supported the Congress during the freedom struggle — even suspending publication rather than bowing to British diktats during Quit India — and later backed the JP movement and the Janata Party during the Emergency period. “He gave a new height to journalism and democracy. He established the Express Group not as just a newspaper but as a mission,” the PM said, noting that The Indian Express had published a blank editorial as a defiant act against censorship.",
  "summary": "",
  "published": "Tue, 18 Nov 2025 10:42:18 +0000",
  "url": "https://indianexpress.com/article/india/shashi-tharoor-pm-narendra-modi-ramnath-goenka-lecture-glad-audience-10372330/",
  "source": "India | The Indian Express"
}