{
  "title": "Lebanon arrests alleged drug kingpin sanctioned by US State Department",
  "text": "The Lebanese army has detained the country’s most infamous drug lord, two years after he was sanctioned by the United States over suspected links to narcotics rings in Syria.\n\nIn a post on X on Thursday, the Lebanese army confirmed they had arrested a citizen with the initials “NZ”, and three security sources confirmed to the Reuters news agency that the individual in question was the fugitive Noah Zaitar.\n\nFollowing a “series of precise security surveillance and monitoring operations”, security forces arrested Zaitar in an ambush in the city of Baalbek in Lebanon’s eastern Baalbek-Hermel governorate, the Lebanese military said.\n\n“The detainee is one of the most dangerous wanted individuals, pursuant to a large number of arrest warrants, for crimes of forming gangs operating across numerous Lebanese regions in drug and arms trafficking, manufacturing narcotic substances, and robbery and theft by force of arms,” the military said.\n\n“He had also previously opened fire on army elements and facilities, as well as citizens’ homes, and kidnapped individuals for financial ransom. The investigation has commenced with the detainee under the supervision of the competent judiciary,” it added.\n\nZaitar allegedly ran a drug empire in Lebanon’s Bekaa Valley area near the Syrian border, producing and exporting drugs including the synthetic stimulant captagon.\n\nA military tribunal sentenced Zaitar – who had evaded arrest for years while living in his home village of Kneisseh surrounded by armed supporters – to death in 2024 for killing a Lebanese soldier.\n\nAdvertisement\n\nHe was also named in US Department of State sanctions in 2023 against the regime of ousted Syrian ruler Bashar al-Assad and individuals connected to his lucrative captagon trafficking network.\n\nThe State Department said Zaitar was a “known arms dealer and drug smuggler”, with close ties to the Fourth Division of the Syrian Arab Army – an elite unit once central to the captagon trade.\n\nIt also said Zaitar was wanted for having “materially assisted, sponsored, or provided financial, material, or technological support for, or goods or services” to the Lebanese armed group Hezbollah.\n\nThe arrest of Zaitar comes amid an ongoing crackdown by Lebanese authorities against drug traffickers in the country.\n\nIn a separate post on X on Wednesday, the Lebanese military said two soldiers, named as Bilal al-Baradi and Ali Haidar, were killed in clashes in Baalbek on Tuesday as they pursued fugitive narcotics suspects.\n\nتنعى قيادة الجيش ـــ مديرية التوجيه، المعاون الأول الشهيد بلال البرادعي والعريف الشهيد علي حيدر اللذين استشهدا بتاریخ ١٨ /١١ /٢٠٢٥ نتيجة اشتباكات مع مطلوبين أثناء تنفيذ مديرية المخابرات سلسلة عمليات دهم بمؤازرة وحدة من الجيش في منطقة الشراونة – بعلبك.\n\nوفي ما يلي نبذة عن حياة كل… pic.twitter.com/aIw9IjiuYi — الجيش اللبناني (@LebarmyOfficial) November 18, 2025\n\nTranslation: The Army Command – Directorate of Orientation, mourns the First Assistant Martyr Bilal al-Baradi and Corporal Martyr Ali Haidar, who were martyred on 18/11/2025 as a result of clashes with wanted individuals during the execution by the Intelligence Directorate of a series of raids backed by an Army unit in the al-Sharawna area – Baalbek.\n\nThe military said that another Lebanese citizen, referred to by the initials HAJ – and named by the local news outlet Lebanese Broadcasting Corporation International as Hassouneh Jaafar – was shot and killed after opening fire on Lebanese security forces during that raid.\n\nThe fugitive was wanted in connection with the murder of four soldiers, as well as kidnapping, robbery, armed robbery and drug trafficking.\n\nLebanese authorities also arrested two other men – referred to only as FM and GQ – for “promoting drugs” and “possessing a quantity of weapons and military ammunition” in the Akkar governorate, north of Baalbek, close to the Syrian border.",
  "summary": "Noah Zaitar allegedly ran a drug empire, producing and exporting narcotics, including the synthetic stimulant captagon.",
  "published": "Fri, 21 Nov 2025 01:58:58 +0000",
  "url": "https://www.aljazeera.com/news/2025/11/21/lebanon-arrests-alleged-drug-kingpin-sanctioned-by-us-state-department?traffic_source=rss",
  "source": "Al Jazeera – Breaking News, World News and Video from Al Jazeera"
}