{
  "title": "Mamdani says he will ‘stand up for New Yorkers’ in Trump meeting",
  "text": "New York mayor-elect says he ‘will meet with anyone’ to push forward his affordability agenda for the largest US city.\n\nNew York City Mayor-elect Zohran Mamdani has said he is “not concerned” about a potential clash with United States President Donald Trump when the two officials meet at the White House on Friday.\n\nMamdani — who is set to take office on the first day of 2026 — stressed on Thursday that he will negotiate with the presidency to push forward his affordability agenda for the largest US city.\n\nThe democratic socialist underscored that both he and Trump ran campaigns focused on the cost-of-living crisis.\n\n“That’s why everything comes back to making the case for an affordability agenda,” Mamdani told reporters.\n\n“I will meet with anyone. I will speak to everyone so long as it could stand to benefit an economic agenda for New Yorkers. And that’s where I will always make the case.”\n\nTrump, a Republican, has been a vocal critic of Mamdani, often falsely calling him a “communist”. The White House has gone as far as suggesting that it would consider stripping the mayor-elect of his US citizenship.\n\nThe president also threatened to withhold funds to New York and deploy federal forces to the city if Mamdani is elected.\n\nMany of Trump’s allies have echoed his criticisms and used Islamophobic language against the Muslim mayor-elect.\n\nRepresentative Elise Stefanik, for instance, called Mamdani a “jihadist”, and Laura Loomer, a right-wing activist with close ties to the White House, falsely claimed that the mayor-elect will implement Islamic law in New York.\n\nBut after Mamdani won his election this month, Trump appeared to soften his stance, telling Fox News he wants to “make the city succeed”.\n\nLate on Wednesday, Trump announced on social media that he would host Mamdani at the White House, but not without taking shots at the mayor-elect’s politics and middle name.\n\nAdvertisement\n\n“Communist Mayor of New York City, Zohran ‘Kwame’ Mamdani, has asked for a meeting,” Trump wrote.\n\n“We have agreed that this meeting will take place at the Oval Office on Friday, November 21st.”\n\nCritics argue that Trump has used the bully pulpit of the White House to ambush and belittle guests, including Ukrainian President Volodymyr Zelenskyy and South African leader Cyril Ramaphosa.\n\nAt a White House visit in February, for instance, Trump accused Zelenskyy of “gambling with World War III” and “disrespecting” the US, as media cameras rolled.\n\nWhen asked on Thursday what he would do if he were to receive the Zelenskyy treatment in the Oval Office, Mamdani said: “I’ll stand up for New Yorkers every single day.”\n\nThe mayor-elect also said that he views the meeting as an opportunity to make his case personally to the president.\n\nA New York State lawmaker, Mamdani, 34, had minimal name recognition before launching his mayoral campaign late last year.\n\nBut in the lead-up to the Democratic primary, he quickly rose in the polls with a message focused on lowering the cost of living. He also has been a vocal supporter of Palestinian human rights.\n\nMamdani ultimately defeated former Governor Andrew Cuomo twice: once to clinch the Democratic nomination in June, and a second time in the November election. Cuomo, who ran on the final ballot as an independent, had Trump’s support.\n\nOn January 1, Mamdani will be sworn in as the 111th mayor of New York City.\n\nThe mayor-elect’s ambitious agenda includes promises of free bus travel and childcare as well as expanding public housing and freezing the rent for government-subsidised properties.",
  "summary": "New York mayor-elect says he &#039;will meet with anyone&#039; to push forward his affordability agenda for the largest US city.",
  "published": "Thu, 20 Nov 2025 18:12:01 +0000",
  "url": "https://www.aljazeera.com/news/2025/11/20/mamdani-says-he-will-stand-up-for-new-yorkers-in-trump-meeting?traffic_source=rss",
  "source": "Al Jazeera – Breaking News, World News and Video from Al Jazeera"
}