{
  "title": "Attack, defend, pursue—the Space Force’s new naming scheme foretells new era",
  "text": "A little more than a century ago, the US Army Air Service came up with a scheme for naming the military’s multiplying fleet of airplanes.\n\nThe 1924 aircraft designation code produced memorable names like the B-17, A-26, B-29, and P-51—B for bomber, A for attack, and P for pursuit—during World War II. The military later changed the prefix for pursuit aircraft to F for fighter, leading to recognizable modern names like the F-15 and F-16.\n\nNow, the newest branch of the military is carving its own path with a new document outlining how the Space Force, which can trace its lineage back to the Army Air Service, will name and designate its “weapon systems” on the ground and in orbit. Ars obtained a copy of the document, first written in 2023 and amended in 2024.\n\nThe changes could ultimately lead to the retirement, or at least the de-emphasis, of bulky bureaucratic acronyms. You might think of it as similar to how the Pentagon’s Joint Strike Fighter program evolved into the F-35 Lightning II.\n\nThe memorandum outlining the Space Force’s new nomenclature was signed in 2023 by then-Lt. Gen. Shawn Bratton, who was the branch’s chief strategy and resource officer at the time. Bratton is now a four-star general serving as vice chief of space operations, the No. 2 uniformed position in the Space Force.\n\nThe document, titled Space Force Instruction 16-403, covers “Space Force weapon system naming and designations.” It provides guidance for creating new designators. The Space Force says compliance with the instruction is mandatory for new programs, but it does not require an update for existing satellites.\n\n“All new weapon systems developed after the effective date of this instruction will require a designator,” the memorandum says. The new names will have letters identifying each system’s purpose and orbital regime, followed by numbers or letters describing its design number and design series.\n\nShawn Bratton, then a two-star general, gives remarks as the featured speaker for the 38th Space Symposium Satellite Forum Breakfast in Colorado Springs, Colorado, on April 19, 2023. Credit: US Space Force/Ethan Johnson\n\nJohn Shaw, a retired Space Force lieutenant-general, was part of internal discussions about revamping the military satellite naming scheme several years ago.\n\n“We were looking at this in 2018, before we had a Space Force, and trying to fit it into the Air Force nomenclature,” Shaw told Ars. “And it sort of hit a dead end because the Air Force just wasn’t set up well for this. You really needed to start over. That wasn’t going to happen very easily. Now that we have a Space Force, we can start over… I’m glad to see that it’s becoming reality.”",
  "summary": "Ars is first to reveal how the Space Force will name its weapon systems.",
  "published": "Thu, 20 Nov 2025 13:48:39 +0000",
  "url": "https://arstechnica.com/space/2025/11/attack-defend-pursue-the-space-forces-new-naming-scheme-foretells-new-era/",
  "source": "Ars Technica - All content"
}