{
  "title": "‘Lakhs of genuine electors face risk of exclusion’: Cong MP moves SC against SIR",
  "text": "Congress’s Barabanki MP Tanuj Punia has moved the Supreme Court challenging the Special Intensive Revision (SIR) of electoral rolls in Uttar Pradesh.\n\nIn his petition submitted by advocate Shariq Ahmed, Punia said the SIR in UP “carries an immediate risk of excluding lakhs of genuine electors from the rolls of India’s largest State”.\n\nThe poll body had ordered an SIR on June 24, starting with Bihar ahead of Assembly elections in the state. In a notification on October 27, the EC ordered the second phase of the exercise in nine states, including UP which goes to polls in 2027, and three UTs.\n\nThe plea, which sought quashing of the EC’s October 27 order, said the “consequences of such exclusion fall most heavily on communities that already face structural barriers, Scheduled Castes, OBC and EBC groups, minorities, women with limited documentation, migrant and daily-wage workers, and households in districts”.\n\n“The process introduced requires every elector to reestablish eligibility through documentation that large segments of the State’s population have never possessed. These requirements have no foundation in the Representation of the People Act, 1950, which proceeds on a presumption of continuity and only permits deletion on narrowly defined grounds,” said the plea by Punia, who also heads the Scheduled Castes Department of UP Congress.\n\nThe petition said SIR is “tied to the 2003 rolls, although Uttar Pradesh has added nearly four crore new electors since then, many of whom were neither born at the time nor captured in institutional records”.\n\n“The timelines prescribed for a State of this scale, one month for enumeration and a further month for claims and objections, are impossible to meet in districts…” the petition said.",
  "summary": "",
  "published": "Tue, 18 Nov 2025 06:17:09 +0000",
  "url": "https://indianexpress.com/article/india/lakhs-of-face-risk-of-exclusion-cong-mp-moves-sc-against-sir-10372003/",
  "source": "India | The Indian Express"
}