{
  "title": "Mahmoud Khalil sues Trump officials over ‘collusion’ with anti-Palestinian groups",
  "text": "Mahmoud Khalil, the Palestinian activist who participated in protests at Columbia University and was detained by Ice earlier this year, has filed a lawsuit demanding the Trump administration release its communications with anti-Palestinian groups he says contributed to his March arrest and efforts to detain him.\n\nThe groups, a number of which have boasted about their involvement in sharing dossiers on Palestine activists with the administration, have claimed credit for Khalil’s arrest, according to the Center for Constitutional Rights, which is part of the legal team representing Khalil, and they say there is evidence that indicates the Trump administration “acted on information and misinformation – provided by these groups in cracking down” on Khalil and other pro-Palestine activists.\n\n“For months, shady organizations and individuals carried out a smear and harassment campaign designed to intimidate and silence me,” said Khalil in a statement to the Center for Constitutional Rights.\n\n“The public deserves full accountability for every bad actor who helped make that possible, including those at Columbia who fabricated and amplified these smears and opened the door for state retaliation against Palestinian speech.”\n\nThe Center for Constitutional Rights said that several weeks before Khalil’s arrest, Betar USA – a far-right, pro-Israel group – included him on its “deport list” and said ICE was “aware of his home address and whereabouts” on X. Betar reportedly said it shared that information with officials within the Trump administration, including secretary of state, Marco Rubio.\n\nThen, in the days before Khalil’s arrest, the group Documenting Jew Hatred on Campus called for his deportation in a post on X, as did Shai Davidai, a Columbia professor and advisory board member of the group.\n\n“Mr Khalil and the public at large have the right to know about the depth of the collusion between the federal government and the shadowy groups targeting people who speak out against a genocide,” said Adina Marx-Arpadi, an attorney and justice fellow at the Center for Constitutional Rights.\n\nKhalil was released from an ICE facility in Jena, Louisiana, in June, having been held for more than three months over his activism against Israel’s war on Gaza. The Columbia University student had been detained in early March in the lobby of his Columbia building.\n\nHis detention was the first in a series of arrests of international student activists, and his release was part of several defeats for the administration, which had promised to deport pro-Palestinian international students en masse. Three other students detained on similar grounds – Rümeysa Öztürk, Badar Khan Suri and Mohsen Mahdawi – were previously released while their immigration cases were pending.\n\nAs part of the lawsuit, Khalil is hoping to uncover records of communications between ICE, the justice department, the state department and the homeland security department with the groups Canary Mission, Betar, Documenting Jew Hatred on Campus, Columbia Alumni for Israel, Middle East Forum, Shirion Collective, Capital Research Center, and Camera.\n\nHe is also seeking any communications between the agencies and individuals reported to have targeted, doxxed, and called for or sought to facilitate his own deportation or that of other pro-Palestinian students.\n\nEarlier this year, Khalil filed a claim for $20m in damages against the administration, alleging false imprisonment, malicious prosecution and being smeared as an antisemite as the government sought to deport him over his prominent role in campus protests.\n\nThat July filing – a precursor to a lawsuit under the Federal Tort Claims Act – names the Department of Homeland Security, US Immigration and Customs Enforcement and the state department.",
  "summary": "<p>Activist detained by ICE condemns ‘smear and harassment campaign’ and demands release of key communications</p><p>Mahmoud Khalil, the Palestinian activist who participated in protests at Columbia University and was detained by Ice earlier this year, has filed a lawsuit demanding the Trump administration release its communications with anti-Palestinian groups he says contributed to his March arrest and efforts to detain him.</p><p>The groups, a number of which have boasted about their involvement in sharing dossiers on Palestine activists with the administration, have claimed credit for Khalil’s arrest, according to the Center for Constitutional Rights, which is part of the legal team representing Khalil, and they say there is evidence that indicates the Trump administration “acted on information and misinformation – provided by these groups in cracking down” on Khalil and other pro-Palestine activists.</p> <a href=\"https://www.theguardian.com/us-news/2025/nov/20/mahmoud-khalil-lawsuit-trump-administration\">Continue reading...</a>",
  "published": "Fri, 21 Nov 2025 00:25:26 GMT",
  "url": "https://www.theguardian.com/us-news/2025/nov/20/mahmoud-khalil-lawsuit-trump-administration",
  "source": "World news | The Guardian"
}