{
  "title": "The running man: Odds are Josh Allen makes QB TD history on Thursday night",
  "text": "Open Extended Reactions\n\nJosh Allen recorded a season-high three rushing touchdowns -- and three passing TDs, for good measure -- in the Buffalo Bills' 44-32 win over the Tampa Bay Buccaneers in Week 11, giving him 75 for his career.\n\nOnly three times in NFL history, including the postseason, has a quarterback had three passing and three rushing touchdowns in a game. Allen has done it twice (last year in a Week 14 loss to the Los Angeles Rams), and Otto Graham did it once in 1954.\n\nMost career rushing TDs by a QB Player TDs Josh Allen 75 Cam Newton 75 Jalen Hurts 61 Otto Graham 44 Steve Young 43\n\nNow in his eighth season, Allen is tied with Cam Newton for the most rushing touchdowns by a quarterback in NFL history. One more, and the record is his alone.\n\nHowever, Allen's Week 12 opponent, the Houston Texans, is one of three teams to not allow a rushing score to an opposing quarterback this season (the Cleveland Browns and Indianapolis Colts are the others). Allen is -120 to score a touchdown Thursday night.\n\nSo, will he break the record in Week 12? Or will we have to wait? We asked our betting analysts for their predictions.\n\nAllen's props for Thursday TD scorer Rushing yards (O/U) Passing yards (O/U) Passing TDs (O/U) INTs (O/U) -120 34.5 (-110/-120) 225.5 (-115/-115) 1.5 (+125/-160) 0.5 (-120/-110) Odds by ESPN BET\n\nTimothy T Ludwig/Getty Images\n\nWill he break the record against the Texans?\n\nMatt Bowen: Yes. Allen's rushing usage in the low red zone is up, as he has five goal-to-go carries over his past three games. Look for that to continue Thursday, with Allen being deployed on designed run concepts in scoring position versus the Texans.\n\nEric Karabell: Yes, he will score. Sure, the Texans play strong defense. Allen can't be defended at the goal line.\n\nPamela Maldonado: Yes. When Houston locks down the pass near the goal line, Allen is usually a run-it-in-himself kind of guy.\n\nSeth Walder: Yes. Allen is always a threat to score, but he might need to rely on his scrambling ability more than usual against the elite Texans pass rush that could get after him in a hurry. Plus, it's already high-leverage season for the Bills -- who still have a shot at the No. 1 seed if they can go on a run -- so they need every lever available to get a win, including relying on Allen's legs.\n\nBuffalo's remaining schedule after Thursday's game: @PIT, CIN, @NE, @CLE, PHI, NYJ",
  "summary": "The Buffalo Bills' MVP is one rushing TD away from becoming the NFL's all-time leader in rushing TDs by a QB. Will he get it Thursday?",
  "published": "Thu, 20 Nov 2025 12:33:37 EST",
  "url": "https://www.espn.com/espn/betting/story/_/id/47011271/nfl-week-12-odds-lines-spread-betting-picks-josh-allen-quarterback-rushing-touchdown-record",
  "source": "www.espn.com - TOP"
}