{
  "title": "“Great Unified Microscope” reveals micro and nano worlds in a single view",
  "text": "Researchers Kohki Horie, Keiichiro Toda, Takuma Nakamura, and Takuro Ideguchi at the University of Tokyo have created a microscope capable of detecting signals across an intensity range fourteen times broader than that of standard instruments. The system also works label-free, meaning it does not rely on added dyes. This gentle approach allows cells to remain unharmed during long-term imaging, which could benefit testing and quality control in pharmaceutical and biotechnology settings. The study appears in Nature Communications.\n\nMicroscopes have driven scientific progress since the 16th century, but major improvements have often required increasingly specialized tools. As techniques became more advanced, they also faced tradeoffs in what they could measure. Quantitative phase microscopy (QPM) uses forward-scattered light to visualize structures at the microscale (in this study, over 100 nanometers), which makes it useful for capturing still images of complex cell features. However, QPM cannot detect very small particles. Interferometric scattering (iSCAT) microscopy works differently by capturing back-scattered light and can detect structures as tiny as single proteins. While iSCAT enables researchers to \"track\" individual particles and observe rapid changes inside cells, it lacks the wider view offered by QPM.\n\nCapturing Two Directions of Light at Once\n\n\"I would like to understand dynamic processes inside living cells using non-invasive methods,\" says Horie, one of the first authors.\n\nMotivated by this goal, the team examined whether collecting light from both directions at the same time could bridge the gap and reveal activity across a broad range of sizes and motions in a single image. To explore the idea and confirm that their microscope performed as expected, they observed how cells behaved during cell death. In one experiment, they captured an image that contained information from both forward- and backward-traveling light.\n\nSeparating Overlapping Signals\n\n\"Our biggest challenge,\" Toda, another first author, explains, \"was cleanly separating two kinds of signals from a single image while keeping noise low and avoiding mixing between them.\"\n\nThe researchers succeeded in identifying the movement of larger cell structures (micro) as well as much smaller particles (nano). By comparing the patterns in forward- and back-scattered light, they could estimate each particle's size and its refractive index, which describes how strongly light bends or scatters when it passes through a material.\n\nFuture Applications for Smaller Particles\n\n\"We plan to study even smaller particles,\" Toda says, already thinking about future research, \"such as exosomes and viruses, and to estimate their size and refractive index in different samples. We also want to reveal how living cells move toward death by controlling their state and double-checking our results with other techniques.\"",
  "summary": "A new dual-light microscope lets researchers observe micro- and nanoscale activity inside living cells without using dyes. The system captures both detailed structures and tiny moving particles at once, providing a more complete view of cellular behavior. Its creators tested it by analyzing changes during cell death and were able to estimate particle size and refractive index. They hope to push the technique toward imaging particles as small as viruses.",
  "published": "Mon, 17 Nov 2025 09:50:47 EST",
  "url": "https://www.sciencedaily.com/releases/2025/11/251117091134.htm",
  "source": "All Top News -- ScienceDaily"
}