{
  "title": "Disgraced Former Harvard President Actually Spent Honeymoon On Epstein Island",
  "text": "LOADING ERROR LOADING\n\nPublicly available flight logs examined by the Harvard Crimson show that on Dec. 21, 2005 ― about 10 days after their wedding ― Summers and New flew south from Bedford, Massachusetts, on Epstein’s private plane to Charlotte Amalie, St. Thomas.\n\nAdvertisement\n\nThe U.S. Virgin Island’s city is the place where visitors would grab a helicopter before heading off to Epstein’s island, the Crimson noted.\n\nThe honeymoon flight was confirmed by Summers’ spokesman Steven Goldberg, who claimed it was just a brief visit long before Epstein was ever arrested.\n\n“Mr. Summers and Ms. New spent their honeymoon in St. John and Jamaica in December 2005, which was long before Mr. Epstein was arrested for the first time,” Goldberg told the paper. “As part of that trip, they made a brief visit of less than a day to Mr. Epstein’s island.”\n\nAdvertisement\n\nHuffPost reached out to Summers for comment on the vacation, but no one immediately responded.\n\nSummers and New weren’t the only passengers on the flight. The logs also show Epstein’s partner-in-crime, Ghislaine Maxwell, was there as well as the financier’s longtime pilot, Larry Visoski.\n\nThe Crimson notes that Summers and New’s visit came months after Florida officials opened an investigation into Epstein and days after the convicted sex trafficker had started assembling a legal team that included Summers’ Harvard colleague Alan Dershowitz.\n\nThe story about the honeymoon trip to Epstein’s island is just the latest revelation about Summers that has popped up since last week’s Epstein email dump, which showed their friendship went on longer and was deeper than previously known.\n\nAdvertisement\n\nNot only did Summers stay in contact with Epstein for years after the billionaire financier’s guilty plea for soliciting sex from underage girls in Florida in 2008, but he sent his last message to Epstein just one day before Epstein was arrested on federal charges of sex trafficking minors in July 2019.\n\nAmong the cringiest revelations: The Harvard professor even asked Epstein for dating tips with a woman he described as a “mentee.”\n\nThe outcry over the emails has been bad for Summers’ career, especially after Sen. Elizabeth Warren (D-Mass.) demanded he resign from Harvard and warned that he “cannot be trusted” with students.\n\nAdvertisement\n\nIn addition, President Donald Trump ― who also appears in the Epstein files ―demanded that the Justice Department and FBI investigate Epstein’s ties to powerful Democrats like Summers and former president Bill Clinton.\n\nSummers tried to deal with the fallout by announcing on Monday he would step back from all public commitments so he can “rebuild trust and repair relationships with the people closest to me.”\n\nOn Wednesday, he said he would be exiting the board of OpenAI.\n\nStill, Summers hoped to at least keep teaching, and told students attending a class on Wednesday that he thought that it was “very important to fulfill my teaching obligations.”\n\nAdvertisement",
  "summary": "Larry Summers and his wife, Elisa New, flew on Jeffrey Epstein's private plane with Ghislaine Maxwell to the convicted sex offender's private island in the Virgin Isles.",
  "published": "Thu, 20 Nov 2025 16:42:41 -0500",
  "url": "https://www.huffpost.com/entry/larry-summers-visited-epstein-island-on-honeymoon_n_691f641ae4b0448495237084",
  "source": "Politics"
}