{
  "title": "Finland's Prime Minister Sanna Marin concedes election",
  "text": "CNN —\n\nFinland’s left-wing Prime Minister Sanna Marin conceded defeat on Sunday in the Nordic country’s parliamentary election as the opposition right-wing National Coalition Party (NCP) claimed victory in a tightly fought contest.\n\nThe pro-business NCP was expected to win 48 of the 200 seats in parliament, narrowly ahead of the nationalist Finns Party with 46 seats and Marin’s Social Democrats on 43 seats, justice ministry election data showed with all ballots counted.\n\n“We got the biggest mandate,” NCP leader Petteri Orpo said in a speech to followers, vowing to “fix Finland” and its economy.\n\nHe will get the first chance at forming a coalition to obtain majority in parliament as Marin’s era as prime minister was expected to end.\n\n“We have gained support, we have gained more seats (in parliament). That’s an excellent achievement, even if we did not finish first today,” the prime minister said in a speech to party members.\n\nMarin, 37, the world’s youngest prime minister when she took office in 2019, is considered by fans around the globe as a millennial role model for progressive new leaders, but at home she has faced criticism for her partying and her government’s public spending.\n\nWhile she remains very popular among many Finns, particularly young moderates, she antagonized some conservatives with lavish spending on pensions and education they see as not frugal enough.\n\nThe NCP has led in polls for almost two years although its lead had melted away in recent months. It has promised to curb spending and stop the rise of public debt, which has reached just over 70% of GDP since Marin took office in 2019.\n\nOrpo accused Marin of eroding Finland’s economic resilience at a time when Europe’s energy crisis, driven by Russia’s war in Ukraine, has hit the country hard and the cost of living has increased.\n\nOrpo has said he will negotiate with all groups to obtain a majority in parliament, while Marin has said her Social Democrats may govern with the NCP but will not go into government with the Finns Party.\n\nMarin called the Finns Party “openly racist” during a debate in January – an accusation the nationalist group rejected.\n\nThe National Coalition Chairman Petteri Orpo celebrates with supporters following the Finnish parliamentary elections, on April 2, 2023, in Helsinki. Alessandro Rampazzo/AFP/Getty Images\n\nThe Finns Party’s main goal is to reduce what leader Riikka Purra has called “harmful” immigration from developing countries outside the European Union. It also calls for austerity policies to curb deficit spending, a stance it shares with the NCP.\n\nVideo Ad Feedback Who is Sanna Marin? (2019) 02:10 • Source: CNN Who is Sanna Marin? (2019) 02:10\n\nMost notable of Marin’s foreign policy actions has been her push, along with President Sauli Niinisto, for the country to make a watershed policy U-turn by seeking NATO membership in the wake of Russia’s invasion of Ukraine.\n\nThat process is now almost complete, with Helsinki expected to join within days after all the Western defense alliance’s 30 members approved the accession.",
  "summary": "Finland's left-wing Prime Minister Sanna Marin conceded defeat on Sunday in the Nordic country's parliamentary election as the opposition right-wing National Coalition Party (NCP) claimed victory in a tightly fought contest.",
  "published": "Mon, 03 Apr 2023 10:24:55 GMT",
  "url": "https://www.cnn.com/2023/04/02/europe/sanna-marin-finland-elections-concedes-intl/index.html",
  "source": "CNN.com - RSS Channel - App International Edition"
}