{
  "title": "Trump Admin Signals Mysterious ‘Structural Changes’ To SNAP Food Benefits",
  "text": "LOADING ERROR LOADING\n\nWASHINGTON ― The Trump administration is planning major changes to federal food benefits, according to U.S. Department of Agriculture Secretary Brooke Rollins, though the exact nature of those changes is unclear even to members of Trump’s own party.\n\nRollins has said all 22 million households enrolled in the Supplemental Nutrition Assistance Program will have to reapply for benefits as part of a forthcoming purge of fraudulent recipients. A Republican source on Capitol Hill said lawmakers have no idea what Rollins is talking about.\n\nAdvertisement\n\n“We’re making a lot of structural changes in SNAP,” Rollins said Wednesday on Newsnation. “We’ll have a big announcement about that the week after Thanksgiving exactly what that’s going to look like.”\n\nLast week, Rollins said the USDA would “fundamentally rebuild this program, have everybody reapply for their benefit, make sure that everybody’s taking a taxpayer benefit through SNAP or food stamps that they literally are vulnerable and can’t survive without it.”\n\nSpeaking to Newsmax, Rollins said the USDA had uncovered evidence that thousands of SNAP recipients were actually dead, and their benefits were being paid fraudulently. The USDA hasn’t made the data public.\n\nAdvertisement\n\nIt’s not clear what reforms could be coming, especially since people on SNAP already have to reapply for benefits and quickly report any changes in their economic circumstances that would be disqualifying.\n\nNew applicants have to demonstrate either that they’re poor enough to qualify for SNAP ― meaning they have both low income and few resources ― or that they’re already enrolled in another federal program that vets their income and assets. And most SNAP recipients already have to recertify their eligibility every six or 12 months.\n\nIn a statement, a spokesperson for the USDA said the existing recertification process is part of the new effort to stamp out fraud, which will include increased collaboration with state agencies.\n\nAdvertisement\n\n“Using standard recertification processes for households is a part of that work,” the spokesperson told HuffPost.\n\nOn Wednesday, Rollins suggested the recertification process could change, but perhaps not too much.\n\n“Whatever that reapplication looks like, again, we’re working on that right now, but it won’t be too onerous,” Rollins said. “And for the families that really need it, it will make sure that they’re going to get it.”\n\nRep. Angie Craig (D-Minn.) said SNAP already has rigorous anti-fraud protections and a “trafficking” fraud rate of 1.6%, according to the most recent estimate.\n\nAdvertisement\n\n“I am astounded by the secretary’s careless disregard for the hungry seniors and children who can afford to eat because of this program,” Craig said in a statement to HuffPost. “Her words have consequences, and her offhanded comments about forcing people to re-apply for SNAP benefits created unnecessary confusion for the millions of food assistance recipients who are already struggling to afford food due to the reckless tariff and economic policies of the Trump administration.”\n\nSome SNAP recipients will lose eligibility starting this fall as a result of the tax law Republicans passed this summer, which used cuts to SNAP and Medicaid to offset part of the cost of trillions in tax cuts. The changes to SNAP included stricter “work requirements” for able-bodied adults that the Congressional Budget Office has said will reduce enrollment by 2.4 million.\n\nThe anti-fraud efforts at the USDA are reminiscent of those made against the Social Security Administration by former Trump adviser Elon Musk after he established his “Department of Government Efficiency” in the White House. Musk’s actions caused chaos and consternation among Social Security recipients more than they reduced fraud and he left the White House in an acrimonious split with Donald Trump.\n\nAdvertisement\n\nThe promise to crack down on SNAP follows a government shutdown in which the USDA refused to pay benefits for the month of November, contributing to Democrats’ decision to give up their health care demands and reopen the government. Withholding the benefits may also have damaged the president’s approval rating.\n\nKatie Bergh, an expert on food assistance at the liberal Center for Budget and Policy Priorities, told HuffPost it’s unclear what the USDA might be up to other than bad-mouthing SNAP.\n\n“The bottom line here is after enacting the deepest SNAP cuts in history and needlessly disrupting SNAP benefits during the shutdown by refusing to spend available funds, the administration is doubling down on attacks on our nation’s most important and effective anti-hunger program,” Bergh said.",
  "summary": "USDA Secretary Brooke Rollins' talk about making SNAP recipients reapply for benefits has program stakeholders scratching their heads.",
  "published": "Wed, 19 Nov 2025 17:44:17 -0500",
  "url": "https://www.huffpost.com/entry/usda-snap-fraud-brooke-rollins_n_691e2e93e4b06f2a60cb7bd2",
  "source": "Politics"
}