{
  "title": "Turner: The Secret Sketchbooks review – the sheer number of pornographic drawings is a big shock",
  "text": "The hook for Turner: the Secret Sketchbooks is meant to be that many of the 37,000 sketches left behind by the great British painter JMW Turner have rarely been seen and never been filmed; therein may be hints at the nuances of his elusive character that his main oeuvre kept hidden. Equally remarkable, though, is the documentary’s bold choice of contributors. As well as the art historians and present-day British artists who would dominate a standard art film, there are famous laymen, from the obviously somewhat qualified – Timothy Spall played the artist in Mike Leigh’s biographical film Mr Turner; Chris Packham is well placed to comment on Turner’s reverence for the natural world – to the more surprising hire of Ronnie Wood from the Rolling Stones.\n\nNeither the sketchbooks nor the celebs turn the documentary format upside down, but they add something to a distillation of Turner’s life and legacy that balances accessibility with analytical muscle. Will a previously uninitiated viewer now be more likely to attend a Turner exhibition? Yes. Can existing Turner experts finesse their knowledge? Yes. Job done.\n\nHaving been brought up adjacent to the most vivid realities of adult life in the centre of Georgian London, Turner suffers a devastating bereavement at the age of eight when his younger sister dies. His mother’s mental illness, which eventually sees her confined to a nightmarish asylum where she perishes – unvisited but surely not forgotten – is a second dark spot on the soul of a young man who soon displays signs of febrile genius. Turner’s early sketches show him capturing buildings in obsessive detail, which leads to the programme’s first headline-worthy statement: Packham, who is autistic himself, describes Turner as “hyperfocused” in a way that “maybe speaks to his potential neurodiversity”.\n\nView image in fullscreen ‘He’s enthralled by that rawness of nature’ … Chris Packham in Turner: The Secret Sketchbooks. Photograph: BBC/Passion Docs/Jim Petersen\n\nTurner enrols at the Royal Academy and flourishes there despite being, as an empathetic Tracey Emin points out, a working-class voice at a time when “art was for the wealthy”. He is a success, but in work of that era such as his painting of Dolbadarn Castle, the structure high on a hill with a forlorn human figure tiny in the foreground, there is trauma: the clinical psychologist Orna Guralnik wonders if Turner is the man and the institution housing his mother the distant castle.\n\nNot all the comments from celebrities are worth hearing. Ronnie Wood, whose contributions have the air of an interview from which little was salvageable, puts forward an unenlightening comparison between paintings starting life as sketches and rock songs developing from smaller musical ideas, before offering a review of Turner’s 1806 stunner Fall of the Rhine at Schaffhausen that probably won’t have the Tate ringing up to ask Wood to write their pamphlets: “It’s the epitome of drama. It’s very dramatic.” But if the programme hadn’t let celebrities in, we wouldn’t have Packham enthusing about how a sojourn in the Alps gave Turner’s view of nature an adrenalised new clarity: “He’s enthralled by that rawness of nature, its uncontrollability, its supreme power, and before it our imperceptible nothingness. This defined the sublime for him.”\n\nIf the sketchbooks don’t help with a particular part of Turner’s career, they are temporarily discarded, but on occasion they prove extremely helpful. Turner’s working-class roots are there in the way he uses pen and paper not just to capture images, but to set out his own finances, including plans for reducing the price of unsold paintings: wealthier artists, comfortable within the establishment, would feel no need to fret about their future.\n\nThe archive’s biggest revelation does, however, come from Turner’s private drawings, specifically those of humans having sex. The wild, unhappy young Turner generates a massive collection of pencilled pornography, with the sexual organs of participants in startling detail and everything else a hastily sketched blur. Later in life, when he finds happiness with Margate landlady Sophia Booth, she inspires pictures that are explicit but now more tenderly erotic: the naked people have become fully rounded humans. You can’t get that sort of glimpse of the artist’s intimate inner life from The Fighting Temeraire, no matter how long you stare at it.\n\nAs it discusses Turner’s majestic but, at the time, underappreciated late period, The Secret Sketchbooks has one final insight of note. Contemporary relevance can be found in the way Turner understood climate change, not of course in the way we see it but in his awareness that the Industrial Revolution constituted a human-made force powerful enough to taint the sublime. The star of the show, Chris Packham, says: “This is where we start to brutalise nature … what was his final mission with those paintings? Was he saying, progress at your peril?” If Turner was a man ahead of his time, this programme helps us see him afresh.\n\nTurner: The Secret Sketchbooks aired on BBC Two and is on iPlayer now.",
  "summary": "<p>JMW Turner left behind some 37,000 sketches when he died, many of which have rarely been seen. Do they – including a huge collection of explicit sketches – reveal truths about the elusive man?</p><p>The hook for Turner: the Secret Sketchbooks is meant to be that many of the 37,000 sketches left behind by the great British painter JMW Turner have rarely been seen and never been filmed; therein may be hints at the nuances of his elusive character that his main oeuvre kept hidden. Equally remarkable, though, is the documentary’s bold choice of contributors. As well as the art historians and present-day British artists who would dominate a standard art film, there are famous laymen, from the obviously somewhat qualified – Timothy Spall played the artist in Mike Leigh’s biographical film Mr Turner; Chris Packham is well placed to comment on Turner’s reverence for the natural world – to the more surprising hire of Ronnie Wood from the Rolling Stones.</p><p>Neither the sketchbooks nor the celebs turn the documentary format upside down, but they add something to a distillation of Turner’s life and legacy that balances accessibility with analytical muscle. Will a previously uninitiated viewer now be more likely to attend a Turner exhibition? Yes. Can existing Turner experts finesse their knowledge? Yes. Job done.</p> <a href=\"https://www.theguardian.com/tv-and-radio/2025/nov/19/turner-the-secret-sketchbooks-review-bbc-two-iplayer\">Continue reading...</a>",
  "published": "Wed, 19 Nov 2025 22:00:05 GMT",
  "url": "https://www.theguardian.com/tv-and-radio/2025/nov/19/turner-the-secret-sketchbooks-review-bbc-two-iplayer",
  "source": "The Guardian"
}