{
  "title": "Sheikh Hasina party leaders slam death term: ‘India must help our fight’",
  "text": "Sheikh Hasina News Today: A day after former Bangladesh prime minister Sheikh Hasina was awarded the death penalty by an International Crimes Tribunal, and Dhaka asked Delhi to send her back, leaders of her Awami League party who are in undisclosed locations said they can only return if there is “political inclusion” and that they expect India to continue giving her shelter, as well as “honour” and “security”.\n\nThe Indian Express spoke to several Awami League leaders and former MPs – about hundred of them are living in exile, with an equal number along with thousands of party cadres behind bars in Bangladesh.\n\nFour-time MP Nahim Razzaq, who talks about the attempt to “finish off” Awami League with a ban, criminal cases against its leaders, targeting of their families, and a freeze on their bank accounts, says the verdict against Hasina has in fact “suddenly motivated” them. The former PM was sentenced to death for “crimes against humanity”, along with former home minister Asaduzzaman Khan Kamal on similar charges.\n\nEditorial | Hasina death sentence is a travesty of justice\n\n“We know going back to Bangladesh is a challenge, but if the ban on the party is lifted and we are granted bail in the cases against us, the cadre and the leadership are raring to go,” said Razzaq.\n\nAll Awami League leaders said it was a matter of time before the interim government headed by Prof Muhammad Yunus crumbles. Former Textiles and Jute minister Jahangir Kabir Nanok said no election held with Yunus at the helm would be credible. “He has to resign. The senior leaders of the Awami League are clear about the fact that we will not participate in polls under him,” said Nanok, a member of the Presidium of the Awami League Central Committee.\n\nOn what leaders like him expect from India, Nanok, 71, said that as “our friend and neighbour”, “They have to ensure that Bangladesh does not generate into another terrorist, Islamic State.” He added: “India has to help us in our fight against the interim government which created the ITC (International Crimes Tribunal) and which gave such an illegal verdict of death penalty for our Prime Minister in absentia. It is a totally one-sided verdict, where no opportunity for defence was given.”\n\nPankaj Nath, a three-time former MP who fought the 2024 general elections in Bangladesh as an Independent, said Awami League leaders like him were left shocked by the death penalty for Hasina. “The target is the elimination of the Awami League from the political scene in Bangladesh, but we know that things will change soon.”\n\nStory continues below this ad\n\nAccording to Nath, people would not participate in any election in which Hasina was not in the contest. He also called for general amnesty for jailed workers and leaders of the Awami League for any democratic process to start again. “We all must go back home to our families. There will be an uprising in Bangladesh and this will happen very soon. We also know that India will not allow such atrocities in its neighborhood.”\n\nAnother ex-MP, who is the Joint Secretary of the Awami League Executive Committee, Bahauddin Nasim, told The Indian Express that Hasina keeps in touch with them and other party committee members over Internet apps, to keep their morale high.\n\nShe did so a few hours after the death penalty was announced as well, Nasim said. “Her message was unequivocal. She told us what had happened was unconstitutional and that the Yunus government should be overthrown.”\n\nHe added: “Hasina is our leader and we will follow any advice she gives. If she gives a call for fighting elections, and if the ban on the Awami League is lifted and key leaders are released from jail, we will fight under her leadership. But there should be a level playing field.”",
  "summary": "",
  "published": "Tue, 18 Nov 2025 22:30:47 +0000",
  "url": "https://indianexpress.com/article/india/awami-league-in-exile-hasina-party-leaders-slam-death-term-india-must-help-our-fight-10373332/",
  "source": "India | The Indian Express"
}