{
  "title": "This Excellent LG OLED Is Deeply Discounted Before Black Friday",
  "text": "If you're looking to make the move to an OLED screen, but don't feel like stomaching the high price tag usually associated with the tech, you might consider the LG B5 OLED. It's already a great screen at the full price, but Best Buy currently has it marked down to just $600. That's a significant markdown for this TV, which can typically be found between $1,000 and $1,200.\n\nThe star of the show is LG's OLED panel, the type typically found on TVs twice the price. If you're curious why that's so important, we have a great explainer that breaks down the difference between all the different panel types. The important takeaway here is that the pixels emit their own light, allowing individual spots of the screen to be perfectly black. The result is impressive, with incredible contrast between the brightest and darkest spots that's best understood by seeing it in person.\n\nThe other areas of the screen are excellent as well. Our reviewer Ryan Waniata opined that “there's a sumptuous touch to images of all sorts,\" and liked the colors as well, which were accurate and sharp without any adjustment. The screen has a natural and vivid performance to it that feels all the more impressive when you consider the price point.\n\nIt has the chops for some gaming too, with feature support that meets or beats higher-end screens. With four proper HDMI 2.1 inputs, your consoles won't need to fight for the good ports, which is a nice surprise for the price point. It can reach a refresh rate of up to 120 Hz, which is just fine for most console gamers, and has both AMD FreeSync Premium and Nvidia G-Sync to make sure everything is smooth, plus Auto Low Latency Mode for quick response times.\n\nOverall, the LG B5 OLED is a solid value at its full price, but the steep discount here makes this a really sweet upgrade or first OLED. If you're still not sold, make sure to swing by our roundup of all the best TVs available, including the B5 and other OLEDs.",
  "summary": "With premium black levels and accurate colors, the LG B5 is a great entry point to OLED screens.",
  "published": "Wed, 19 Nov 2025 20:27:56 +0000",
  "url": "https://www.wired.com/story/lg-b5-oled-deal-1125/",
  "source": "WIRED"
}