{
  "title": "Relaxed entry rules make it easier than ever to visit this stunning Asian nation",
  "text": "Editor’s Note: This CNN Travel series is, or was, sponsored by the country it highlights. CNN retains full editorial control over subject matter, reporting and frequency of the articles and videos within the sponsorship, in compliance with our policy.\n\nUlaanbaatar, Mongolia CNN —\n\nDue to its remoteness and short summer season, Mongolia has long been a destination overlooked by travelers.\n\nBut as the country moves to further open up to tourism by easing its entry conditions for international visitors and upgrading its infrastructure, 2023 might just be the best time yet to get there.\n\nHere are 10 reasons travelers should start planning their long-dreamed-of Mongolia visit now.\n\nA growing visa-free list\n\nWith the government of Mongolia declaring 2023 through 2025 the “Years to Visit Mongolia,” citizens from an additional 34 countries can now visit the country visa-free through the end of 2025.\n\nThe addition of several European countries, including Denmark, France, Greece, Italy, Norway, Spain, and the UK, as well as Australia and New Zealand, now brings the total number of countries and territories on the visa-exempt list to 61.\n\nThe full list is here.\n\nA new $650 million airport opens its doors\n\nMongolia's new Chinggis Khaan International Airport. Saruul Enkhbold/AP\n\nAfter years of delays, a pandemic and several controversies, the newly built Chinggis Khaan International Airport finally opened in the summer of 2021.\n\nWith the ability to handle approximately 3 million passengers a year (double that of the old airport), the addition of 500 new aircraft parking spaces and the infrastructure to support an increase in domestic as well as budget flights, the airport is a welcome addition to the country’s efforts to grow tourism.\n\nBudget flights to Hong Kong from EZNIS Airways have been relaunched since the airport’s opening, and talks to resume direct flights to the United States are reportedly underway.\n\nA modern new museum\n\nThe recently opened Chinggis Khaan Museum offers a beautiful, fresh look at Mongolia’s tumultuous history.\n\nWith more than 10,000 artifacts spanning over 2,000 years, the museum explores the history of the Mongols and the empire they created – and eventually lost.\n\nThe museum’s artifacts are presented over eight floors, with six permanent and two temporary exhibition halls. Guided tours are offered in English every Saturday and Sunday from 10 a.m. to 4 p.m. free of charge.\n\nMongolia’s answer to Coachella\n\nMongolia's 2023 Spirit of Gobi festival will take place in August. Majesty Mongolia\n\nWhen most people think of Mongolia, music festivals and conservation-focused art installations in the heart of one of the world’s largest deserts are the last things to come to mind.\n\nBut that’s all changing thanks to festivals like Playtime, Spirit of Gobi, INTRO Electronic Music Festival and the Kharkhorum 360 Visual Art & Music Experience.\n\nPlacing international bands, DJs, and musicians from around the world alongside Mongolia’s eclectic mix of rappers, bands and folk singers, the country just might be one of the world’s most underrated places for festival lovers.\n\nCelebrate Naadam as it turns the century\n\nThe annual Naadam event has always been a great reason to visit Mongolia, but now that the festival has just celebrated its 100 year anniversary, 2023 is as good a time as ever to attend.\n\nWhile the festival’s origins are rooted in the days of Genghis Khan, when he used horse racing, wrestling and archery competitions to keep his warriors in shape between battles, Naadam only officially became a national holiday 100 years ago.\n\nToday, the festival – held in Ulaanbaatar at the National Sports Stadium, has a few more bells and whistles than it did during the days of the Great Khan.\n\nA seat at July 11’s opening ceremony is always one of the hardest tickets to score in town.\n\nTry your hand at archery the Mongolian way\n\nMongolian archery is making a comeback. Namnaa Academy\n\nMounted archery is seeing a resurgence in Mongolia thanks to guys like Altankhuyag Nergui, one of the most accomplished archers in the sport and his archery academy, Namnaa.\n\nHere, locals learn the fundamentals of Mongolian archery before mounting a horse and taking their new found skills to another level.\n\nIn the summer months, students and academy members put on weekly shows for interested spectators. The academy also offers day-long training sessions for those wanting to try this intense sport.\n\nLearn about Mongolian calligraphy from a master\n\nSpeaking of giving life to Mongolia’s most ancient traditions, the resurrection of Mongol bichig, or the traditional Mongolian script written from top to bottom and read from left to right, has also seen a major resurgence in recent years.\n\nVisit the Erdenesiin Khuree Mongolian Calligraphy Center in Karakorum to learn from master calligraphist Tamir Samandbadraa Purev about this important cultural heritage. And, while you’re there, browse the yurts filled with Tamir’s works.\n\nDitch the horse for horsepower\n\nA Mongolian hunter sends his golden eagle to catch prey. Tuul & Bruno Morandi/The Image Bank RF/Getty Images\n\nPair the release of Husqvarna’s new Norden 901 Expedition motorbike with Nomadic Off-Road’s newly announced Eagle Hunter Tour, and you have one of the fastest adventures in Mongolia.\n\nThe tour takes six riders 1,700 kilometers from Ulaanbaatar to Bayan-Ulgii, where riders eventually meet their hosts, Mongolia’s famous eagle hunters.\n\nThe only thing faster than this adventure is the rate at which Nomadic Off-Road’s tours sell out.\n\nWinter tours offer new insights\n\nProfessional musher Joel Rauzy has been leading dogsledding tours across the frozen Lake Khuvsgul for 18 years.\n\nWith fewer crowds, lower hotel rates and the chance to see one of the largest freshwater lakes in the world completely frozen over, winter in Mongolia is something else to see and experience.\n\nRauzy’s company, Wind of Mongolia, offers tours of the lake, where each person is assigned their own sled and dogs for the journey. Following Rauzy’s lead, mushers will make a loop of the lake. Activities include ice fishing, while travelers stay in winterized yurts and spend time with nomadic families along the journey.\n\nScandinavian design hits Mongolia at Yeruu Lodge\n\nYeruu Lodge is infused with Scandinavian minimalism. Yeruu Lodge\n\nNestled in the heart of Selenge province on the Yeruu River, Yeruu Lodge is the brainchild of Norwegian founder Eirik Gulsrud Johnsen, who first visited Mongolia in 2017.\n\nWith a minimal Scandinavian-style restaurant and dining area, a handful of fully kitted out yurts for guests to stay in, two pétanque courts, kayaks, a driving range, mountain bikes and a yoga area, the lodge is a destination for nature lovers.\n\nCompletely off-grid, the lodge runs off solar panels, uses of thermal heating, and all of the property’s water comes from an on-property well and is recycled after use.\n\nAdditionally, all glass, metal and plastic used at the lodge is also recycled, and food waste is turned into compost used to grow vegetables, berries and herbs onsite.\n\nThe lodge is set to open in April 2023.",
  "summary": "Due to its remoteness and short summer season, Mongolia has long been a destination overlooked by travelers.",
  "published": "Fri, 31 Mar 2023 04:25:31 GMT",
  "url": "https://www.cnn.com/travel/article/mongolia-reasons-to-visit-2023/index.html",
  "source": "CNN.com - RSS Channel - World"
}