{
  "title": "Webb denies WSL official lost role over complaint",
  "text": "Webb told the tribunal it was \"our honestly held belief that she would be accepted\" because of the growth of the women's game and the \"noises we were hearing\" from sports bodies.\n\n\"Unfortunately, highly regrettably, it wasn't, but unfortunately, compared to the other officials in this ranking, she was correctly placed sixth, based on the performance factors listed and the holistic view we've gone through,\" he said.\n\n\"This is a competitive world in which we work and we need to rank officials against each other.\n\n\"We produce a lot of other really good officials in this country and we are in the difficult task to have to rank them against each other.\n\nBenn alleged Steve Child, a former Premier League assistant referee, grabbed her arm and \"forcefully pushed\" her on to a pitch at a video assistant referee (VAR) training tournament in March 2023, and later told her, \"your card has been marked\".\n\nChild, an assistant referee coach at the time, has denied making the comment and a PGMOL investigation found insufficient evidence for disciplinary action.\n\nBenn then attended a training camp in August 2023, where she claimed Child intimidated her in the hotel reception, an incident she raised with Webb's wife, Bibi Steinhaus-Webb, who was then PGMOL's head of women's referees.\n\nPGMOL's Fifa nominations were submitted the following month and Benn found out she had not been selected later in December.\n\nCarla Fischer, for Benn, told Webb: \"She made a second complaint that a male PGMOL coach made unwanted threatening remarks to a female referee in the women's game and that is why she was ranked sixth isn't it.\"\n\nBut Webb replied: \"No, that is not correct.\"\n\nA meeting was held in October 2023 in which Benn discussed her issues with PGMOL's investigation and said officials feared raising grievances because of possible consequences.\n\nRecollecting the discussion, Webb added \"the point being raised by Lisa that there was this sense of fear, among officials, in terms of reporting concerns.\n\n\"Of course, we want to know what is on the minds of our officials and for them to speak to us openly and confidently. We want our officials out on the field and performing.\"\n\nWhen asked to describe the status of the Fifa list to refereess, he said: \"They treasure this badge, they really, really do.\n\n\"We had a view that a sixth position was really, really quite likely. I think the growth of the women's game is pretty incredible and we think it's important to serve the demand.\"\n\nThe tribunal continues.",
  "summary": "Referees' chief Howard Webb denies a former staff member lost her position as an international football referee because she complained a coach \"manhandled\" her.",
  "published": "Thu, 20 Nov 2025 18:07:14 GMT",
  "url": "https://www.bbc.com/sport/football/articles/cgr4rpqeqn7o?at_medium=RSS&at_campaign=rss",
  "source": "BBC Sport"
}