{
  "title": "US judge orders end to Trump’s deployment of troops in Washington, DC",
  "text": "US president’s controversial deployment of soldiers to US cities has raised alarm and a series of legal challenges.\n\nA United States federal judge has said the Trump administration must pause its deployment of National Guard troops to Washington, DC, a setback for the president’s push to send the military into cities across the country.\n\nUS District Judge Jia Cobb temporarily suspended the deployment in a ruling on Thursday, responding to a lawsuit filed by city officials who said Trump had usurped policing powers and was using the military for domestic law enforcement.\n\nThe federal government has unique powers in Washington, DC. But the Trump administration has taken the controversial step to deploy soldiers in a growing list of Democrat-led cities, despite frequent protests from state and local officials and a lack of any emergency conditions.\n\nCobb, who said in her decision that the president cannot deploy soldiers for “whatever reason” he wants, gave the Trump administration 21 days to appeal the order before it goes into effect.\n\nLawyers for the government slammed the lawsuit that challenged the military deployment as a “frivolous stunt”.\n\n“There is no sensible reason for an injunction unwinding this arrangement now, particularly since the District’s claims have no merit,” Department of Justice lawyers wrote.\n\nTrump has also deployed troops to cities such as Los Angeles, California; Portland, Oregon; and Chicago, Illinois, in what he depicts as an effort to tackle crime and round up undocumented immigrants.\n\nResidents and civil liberties groups have documented aggressive raids and what they say are widespread rights violations and racial profiling by federal agents during those crackdowns, in which US citizens have sometimes been swept up.\n\nAdvertisement\n\nTrump has threatened to imprison local and state officials who criticise his deployment of the military.\n\nA legal challenge filed in September by Washington, DC Attorney General Brian Schwalb said that US democracy would “never be the same if these occupations are permitted to stand”.\n\nTrump ordered the first deployment in August, involving about 2,300 National Guard members from various states and hundreds of federal agents from various agencies.",
  "summary": "US president&#039;s controversial deployment of soldiers to US cities has raised alarm and a series of legal challenges.",
  "published": "Fri, 21 Nov 2025 00:52:32 +0000",
  "url": "https://www.aljazeera.com/news/2025/11/21/us-judge-orders-end-to-trumps-deployment-of-troops-in-washington-dc?traffic_source=rss",
  "source": "Al Jazeera – Breaking News, World News and Video from Al Jazeera"
}