{
  "title": "Trump Plan To End Ukraine War Would Cede Territory To Russia",
  "text": "LOADING ERROR LOADING\n\nWASHINGTON (AP) — President Donald Trump’s plan for ending the war in Ukraine would cede territory to Russia and limit the size of Kyiv’s military, according to a draft proposal obtained Thursday by The Associated Press.\n\nWashington and Moscow worked together on the draft, which Ukrainian President Volodymyr Zelenskyy discussed with a U.S. representative Thursday. If enacted, it would resolve a conflict that began nearly four years ago by requiring significant concessions from Kyiv and European leaders.\n\nAdvertisement\n\nFor example, the proposal would not only bar Ukraine from joining NATO but would also prevent the alliance’s future expansion. Such a step would be a significant victory for Moscow, which views NATO as a threat.\n\nRussian President Vladimir Putin would also gain ground that he has been unable to win on the battlefield. Under the draft, Moscow would hold all the eastern Donbas region, even though approximately 14% still remains in Ukrainian hands.\n\nIn this photo provided by the Ukrainian Presidential Press Office, Ukrainian President Volodymyr Zelenskyy, left, shakes hands with U.S. Secretary of the Army Dan Driscoll in Kyiv, Ukraine, Thursday, Nov. 20, 2025. (Ukrainian Presidential Press Office via AP) via Associated Press\n\nAdvertisement\n\nThere would be a path to lifting sanctions on Russia and returning the country to what was formerly known as the Group of 8, which includes many of the world’s biggest economies.\n\nRussia would commit to making no future attacks, something the White House views as a concession. In addition, $100 billion in frozen Russian assets would be dedicated to rebuilding Ukraine.\n\nHowever, handing over territory to Russia would be deeply unpopular in Ukraine. It also would be illegal under Ukraine’s constitution. Zelenskyy has repeatedly ruled out such a possibility.\n\nAdvertisement\n\nSecretary of State Marco Rubio and U.S. special envoy Steve Witkoff have been quietly working on the peace plan for a month, receiving input from both Ukrainians and Russians on terms that are acceptable to each side, White House press secretary Karoline Leavitt said Thursday. Witkoff and Kirill Dmitriev, a close adviser to Putin, have been key to drafting the proposal.\n\nIn other developments, Russia’s chief military officer, Gen. Valery Gerasimov, announced that Moscow’s forces had taken full control of Kupiansk in Ukraine’s Kharkiv region, although he also said some Ukrainian troops remained in the city.\n\nThe general staff for Ukraine’s armed forces denied Gerasimov’s claims and said Kyiv’s forces remained in control of Kupiansk.\n\nAdvertisement\n\n___\n\nMadhani reported from Washington. Associated Press journalists Sam McNeil in Brussels, Samya Kullab in Kyiv and Katie Marie Davies in Manchester, England, contributed to this report.\n\n___",
  "summary": "President Donald Trump’s plan for ending the war in Ukraine would cede territory to Russia and limit the size of Kyiv’s military, according to a draft proposal obtained by The Associated Press.",
  "published": "Thu, 20 Nov 2025 19:40:03 -0500",
  "url": "https://www.huffpost.com/entry/russia-ukraine-war-trump_n_691fb3bae4b044849523b14a",
  "source": "Politics"
}