{
  "title": "How Donald Trump Lost Control of the Epstein Spin Cycle",
  "text": "For almost a decade, President Donald Trump has managed to control the conspiracy theory spin around disgraced financier and registered sex offender Jeffrey Epstein. The conspiracy theories benefited him; they were one of the factors buoying him to office. It’s only been in the last few weeks—spurred by the release of new Epstein documents and the public defection of GOP lawamkers—that the complex web of misinformation has spun out of Trump’s control.\n\nIt all began with QAnon. It is hard to overstate just how fringe QAnon was when Georgia representative Marjorie Taylor Greene began posting about it in November 2017, when she posted a video praising Q as a “patriot.”\n\nThe movement was led by “Q,” someone who claimed to be a government insider and who posted what they claimed was top secret intel in posts, known as “drops,” on the anonymous message board 4chan. Q laid out a wild and untrue conspiracy theory that a cabal of Democrat and Hollywood elites were behind a supposed global sex trafficking ring.\n\nAlready, Jeffrey Epstein was among the key characters in the QAnon universe.\n\nEpstein was first mentioned just two weeks after QAnon began in late October 2017 and was referenced dozens of times in the almost 5,000 posts Q wrote over the following three years. Like all good conspiracy theories, this one contained a kernel of truth: The fact that Epstein had pleaded guilty in 2008 to state prostitution solicitation charges meant QAnon supporters felt emboldened to believe every wild allegation that Q put forward.\n\nI became aware of QAnon in early 2018 but didn’t write about it until September of that year. At the time Greene started promoting it, years before she was elected to Congress, the conspiracy was in its infancy with just a handful of dedicated followers.\n\nTrump was quickly cast as the hero of this narrative, working against the “deep state” to expose these demons and bring about “the storm,” which would see the cabal unmasked and everyone from Epstein to the Clintons face public executions. (No, really.) Trump, who has claimed his relationship with Epstein ended around 2004, used the QAnon community to his benefit. Trump famously praised its followers ahead of the 2020 election, and supported Greene’s congressional campaign after she won her primary.\n\nEpstein had become a sort of shorthand for those within QAnon trying to explain it to outsiders. Q repeatedly returned to the topic of Epstein, claiming the disgraced financier had a “dungeon (beneath the temple)” on his island along with “sex & torture rooms.”",
  "summary": "Donald Trump has spent years benefiting from the QAnon's Jeffrey Epstein obsession. That’s all changing.",
  "published": "Wed, 19 Nov 2025 16:00:00 +0000",
  "url": "https://www.wired.com/story/how-donald-trump-lost-control-of-the-epstein-spin-cycle/",
  "source": "WIRED"
}