{
  "title": "Nvidia CEO Dismisses Concerns of an AI Bubble. Investors Remain Skeptical",
  "text": "Nvidia CEO Jensen Huang didn’t need any prompting on Wednesday to address the elephant in the room. “There's been a lot of talk about an AI bubble,” he said on an earnings call before quickly getting to his main point: “From our vantage point, we see something very different.”\n\nHuang went on to spend about five minutes trying to explain how the chipmaker, which has soared to become the world’s most valuable publicly traded company over the past three years, would be able to sustain unprecedented customer demand. His thesis is that AI is taking over the world, and Nvidia chips will be sorely needed to power that technological revolution underway. “All industries, across every phase of AI, across all of the diverse computing needs in a cloud, and also from cloud to enterprise to robots,” will need Nvidia’s products, Huang said.\n\nThe CEO’s pep talk ultimately drew mixed reactions from Wall Street. Nvidia shares have fallen about 10 percent in recent weeks after hitting an all-time high in late October. Shares budged up about 5 percent in after-hours trading on Wednesday after Nvidia reported record quarterly sales and Huang made his anti-bubble comments. But the increase was not enough to fully make up for the recent sell-off.\n\nNvidia has enjoyed three years of booming success since OpenAI debuted ChatGPT and caused a massive surge in demand for the company’s GPUs, which are used to train and operate generative AI systems. Nvidia dominates the global market for GPUs, and its latest releases have become highly sought after, with demand far exceeding supply. On Wednesday, Nvidia executives reiterated that it has about $500 billion in unfilled orders.\n\nThe company has used its newfound wealth to buy back its own shares and invest billions of dollars in AI companies, including top users and customers of its chips such as ChatGPT developer OpenAI, data center operator CoreWeave, and Elon Musk’s xAI, which develops the chatbot Grok.\n\nNvidia’s deals have fueled concerns among some investors that the company is unsustainably propping up sales. AI industry executives contend that partnering closely with Nvidia is crucial for getting access to chips and technical support, and that their revenues will eventually increase enough to fund their GPU purchases.\n\nOn Wednesday’s call, Huang addressed a financial analyst’s question about the rationale for investing in companies such as OpenAI. “The partnership that we have with them is one so that we could work even deeper from a technical perspective, so that we could support their accelerated growth,” Huang said. “I fully expect that investment to translate to extraordinary returns.”",
  "summary": "Record sales, a strong financial forecast, and CEO Jensen Huang’s impassioned arguments on his company’s earnings call weren’t enough to push Nvidia shares back to their October high.",
  "published": "Thu, 20 Nov 2025 00:45:35 +0000",
  "url": "https://www.wired.com/story/nvidia-third-quarter-2026-earnings/",
  "source": "WIRED"
}