{
  "title": "Ultra-thin lenses that make infrared light visible",
  "text": "Lenses are the most widely used optical devices. Camera lens or objectives, for example, produce a sharp photo or video by directing light at a focal point. The speed of evolution made in the field of optics in recent decades is exemplified by the transformation of conventional bulky cameras into today's compact smartphone cameras.\n\nEven high-performance smartphone cameras still require a stack of lenses that often account for the thickest part of the phone. This size constraint is an inherent feature of classic lens design -- a thick lens is crucial for bending light to capture a sharp image on the camera sensor.\n\nMajor strides in the field of optics over the past ten years have sought to overcome this limitation and have come up with a solution in the form of metalenses. They are flat, perform in the same way as normal lenses and are not only 40 times thinner than an average human hair but also lightweight as they do not need to be made of glass.\n\nA special metasurface composed of structures a mere hundred nanometres in width and height (one nanometre is one billionth of a metre) modifies the direction of light. Using such nanostructures researchers can radically reduce the size of a lens and make it more compact.\n\nWhen combined with special materials, these nanostructures can be used to explore other unusual properties of light. One example is nonlinear optics, where light is converted from one colour into another. A green laser pen works according to this principle: infrared light goes through a high-quality crystalline material and generates light of half the wavelength -- in this case green light. One well-known material that produces such effects is lithium niobate. This is used in the telecommunications industry to create components that interface electronics with optical fibres.\n\nRachel Grange, a professor at the Institute for Quantum Electronics at ETH Zurich, conducts research into the fabrication of nanostructures with such materials. She and her team have developed a new process that allows lithium niobate to be used to create metalenses. The study has recently been published in the journal Advanced Materials.\n\nFor her new method, the physicist combines chemical synthesis with precision nanoengineering. \"The solution containing the precursors for lithium niobate crystals can be stamped while still in a liquid state. It works in a similar way to Gutenberg's printing press,\" co-first author Ülle-Linda Talts, a doctoral student working with Rachel Grange, explains. Once the material is heated to 600°C, it takes on crystalline properties that enable the conversion of light as in the case of the green laser pen.\n\nThe process has several advantages. Producing lithium niobate nanostructures is difficult using conventional methods as it is exceptionally stable and hard. According to the researchers, this technique is suitable for mass production as an inverse mould can be used multiple times, allowing the printing of as many metalenses as needed. It is also much more cost-effective and faster to fabricate than other lithium niobate miniaturised optical devices.\n\nUltra-thin lenses that generate new light\n\nUsing this technique, the ETH researchers in Grange's group succeeded in creating the first lithium niobate metalenses with precisely engineered nanostructures. While functioning as normal light focusing lenses, these devices can simultaneously change the wavelength of laser light. When infrared light with a wavelength of 800 nanometres is sent through the metalens, visible radiation with a wavelength of 400 nanometres emerges on the other side and is directed at a designated point.\n\nThis magic of light conversion, as Rachel Grange calls it, is only made possible by the special structure of the ultra-thin metalens and its composition of a material that allows the occurrence of what is known as the nonlinear optical effect. This effect is not limited to a defined laser wavelength, making the process highly versatile in a broad range of applications.\n\nFrom counterfeit-proof banknotes to next-generation microscopy tools\n\nMetalenses and similar hologram-generating nanostructures could be used as security features to render banknotes and securities counterfeit-proof and to guarantee the authenticity of artworks. Their exact structures are too small to be seen using visible light, while their nonlinear material properties allow highly reliable authentication.\n\nResearchers can also use simple camera detectors to convert and steer the emission of laser light to make infrared light -- in sensors, for example -- visible. Or for reducing the equipment needed for deep-UV light patterning in state-of-the-art electronics fabrication.\n\nThe field of such ultra-thin optical elements -- known as metasurfaces -- is a relatively young branch of research at the interface between physics, materials science and chemistry. \"We have only scratched the surface so far and are very excited to see how much of an impact this type of new cost-effective technology will have in the future,\" emphasises Grange.",
  "summary": "Physicists have developed a lens with 'magic' properties. Ultra-thin, it can transform infrared light into visible light by halving the wavelength of incident light.",
  "published": "Mon, 02 Jun 2025 15:55:11 EDT",
  "url": "https://www.sciencedaily.com/releases/2025/06/250602155511.htm",
  "source": "Latest Science News -- ScienceDaily"
}