{
  "title": "Al Falah under lens, attention turns to once-renowned Siddiqui family from Madhya Pradesh",
  "text": "Locally known as “Maulana’s building”, the structure at Kayastha Mohalla in Madhya Pradesh’s Mhow is the ancestral home of the Siddiqui family, once respected residents who held sway in the small cantonment town near Indore until a couple of decades ago.\n\nThe family patriarch, Mohammad Hammad Siddiqui, served as the Qazi in Mhow, a position of religious authority and respect. However, the family has now come under increased scrutiny from law enforcement agencies due to its connection with Al Falah University.\n\nHammad Siddiqui’s son, Javed Ahmed Siddiqui, is the founder and chairman of Al Falah University. Javed has now been summoned by the Delhi Police Crime Branch in connection with alleged fraud and irregularities flagged by the University Grants Commission (UGC) and National Assessment and Accreditation Council (NAAC).\n\nJaved’s brother, Hamood Ahmed Siddiqui, was arrested on Sunday by the Madhya Pradesh Police from Hyderabad in a two-decade-old alleged investment fraud case.\n\nThe scrutiny on the family came in the aftermath of the November 10 blast in Delhi. Umar Nabi, who is suspected to have driven the car that exploded outside the Red Fort, and another doctor, Muzammil Ganai, who was allegedly part of a terror module linked with the blast, were employed by Al Falah Medical Research Foundation.\n\nAccording to police sources, the family started an investment company in the early 1990s, which went bust following a stock market crash.\n\nA senior officer of the Madhya Pradesh Police said, “The brothers came from a well-respected family. They began an investment company in the early 1990s, and their first clients were local Army officers, military engineers and local shopkeepers. They all invested their money because they respected their father, the city Qazi.”\n\nStory continues below this ad\n\nThen, the stock market crashed and investors panicked. They demanded their investment back, which proved to be the end of the company, the officer said. “Javed and Hamood reportedly fought with each other over mishandling the company. Their firm had promised high returns to investors,” a police source claimed.\n\nFacing increasing pressure, they left Mhow in the early 2000s, allegedly with Rs 3 lakh yet to be repaid to investors. “We were pursuing three cases against Hamood. We thought the family fled to Dubai. Then, after the blast case, we began tracing the family members and pursued the case. We checked the digital records and traced the family to Hyderabad,” the officer said. Hamood had been living in Hyderabad, working in share trading while maintaining a low profile, he said.\n\nPolice inquiries suggest that Javed Siddiqui, who began his career in Mhow in the 1990s, ran a company named Al-Falah Investment Company. According to Mhow Additional SP Rupesh Dwivedi, in 2001, after reports of financial irregularities, the family first moved to Delhi. Investigators say that after leaving Madhya Pradesh, Javed Siddiqui established the Al-Falah Charitable Trust, which went on to set up Al-Falah University in Faridabad, Haryana.",
  "summary": "",
  "published": "Tue, 18 Nov 2025 04:55:47 +0000",
  "url": "https://indianexpress.com/article/india/al-falah-lens-attention-renowned-siddiqui-family-madhya-pradesh-10371864/",
  "source": "India | The Indian Express"
}