{
  "title": "Researchers develop innovative model to study sense of smell",
  "text": "Using a newly devised, three-dimensional model to study the regeneration of nerve tissue in the nose, researchers at Tufts University School of Medicine and the Graduate School of Biomedical Sciences (GSBS) and colleagues have discovered that one type of stem cell thought to be dormant may play a more significant role in preserving the sense of smell than originally believed.\n\nUnlike cells in the central nervous system, sensory neurons in the nasal cavity have a remarkable ability to regenerate throughout life despite near constant exposure to the outside environment.\n\nViral infections such as COVID-19, exposure to toxins, or even aging itself can diminish their function or the ability of these cells to replicate, which can lead to a partial or complete loss of smell. The team of researchers devised a new, easy-to-create, three-dimensional olfactory tissue mouse model or organoid to help scientists better study how neurons are continually formed in the nose and why this process might decline in disease and aging.\n\nTheir research, published recently in Cell Reports Methods, uses this mouse model to show how two types of stem cells in the nose, called horizontal basal cells (HBCs) and globose basal cells (GBCs), communicate and support each other to develop new smell-sensing nerve tissue.\n\n\"Our research suggests that these two stem cells may be interdependent,\" says Brian Lin, senior author on the study and a research assistant professor in the Department of Developmental, Molecular and Chemical Biology. \"One type that we thought was largely dormant -- HBCs -- may actually play a crucial role in supporting the production of new neurons and the repair of damaged tissue.\"\n\nUsing this model, the team identified a specific subpopulation of HBCs, marked by their production of the protein KRT5, that actively support the generation of new olfactory neurons. The researchers observed that these particular HBCs play a key role in the formation of the organoids, and they found that when these cells were selectively depleted from the organoid cultures, the generation of new neurons was significantly impaired. These results suggest that these stem cells, once thought to be dormant, are essential players in the regenerative process.\n\n\"We also looked at cells from mice of different ages and grew them in the model,\" Lin says. \"We found a decline in the ability of the older mice cells to generate new neurons. We think this is due to a decrease in the GBC population as we age, but we need to do more work to test this hypothesis and if so, develop ways to rejuvenate them.\"\n\nAn Easy-To-Use Model\n\nLead author of the study, Juliana Gutschow Gameiro, a former Ph.D. student visiting GSBS, came to Tufts from the State University of Londrina, Parana, in Brazil. Lin says she was dedicated to developing a model that was easy to create in labs with limited funds and equipment.\n\n\"Because loss of smell is associated with COVID-19, as well as with Parkinson's disease and other conditions, a much larger number of researchers from a variety of different fields have begun researching olfactory epithelial cells in the last few years,\" says Lin.\n\n\"We wanted to develop an easy-to-use model so that non-stem cell biologists and those working in labs with limited resources could use it to better understand how olfactory neurons regenerate and what happens that causes that process to diminish or fail completely,\" he says.\n\nNext Step: A Human Organoid\n\nThe ultimate goal is to use this mouse-tissue model of olfactory sensory neurons as a pathway to developing a human organoid that can be used to screen drugs to treat people whose sense of smell is significantly diminished or gone.\n\nOrganoids make pre-clinical trial research quicker, less expensive, and potentially more effective than using whole animals or existing human cell cultures. Organoids have already been developed for lungs, kidneys, and other organs, but not for human olfactory tissue.\n\n\"It's challenging to get pure olfactory tissue from humans,\" Lin says. Individuals are anesthetized and a brush similar to a COVID test wand is pushed deep into the nasal cavity. Unlike in their mouse model, human respiratory stem cells and olfactory stem cells collected in this process are difficult to separate.\n\nThe research team's next challenge is to develop a simple, inexpensive technique for separating out the human olfactory stem cells and coaxing them to grow in the lab.",
  "summary": "Using a newly devised, three-dimensional model to study the regeneration of nerve tissue in the nose, researchers have discovered that one type of stem cell thought to be dormant may play a more significant role in preserving the sense of smell than originally believed.",
  "published": "Tue, 03 Jun 2025 17:29:11 EDT",
  "url": "https://www.sciencedaily.com/releases/2025/06/250603172911.htm",
  "source": "Latest Science News -- ScienceDaily"
}