{
  "title": "Meta beats FTC case, won't have to spin off WhatsApp, Instagram",
  "text": "Meta beats FTC case, won't have to spin off WhatsApp, Instagram\n\nSCOTT DETROW, HOST:\n\nThe tech company Meta won a victory in federal court today. A judge ruled it is not operating as an illegal monopoly. The decision means Meta will not be forced to spin off Instagram and WhatsApp. The ruling comes after a seven-week trial back in April. NPR's Bobby Allyn covered that trial and joins us now to talk about what this all means for Meta and the tech industry as a whole. Hey, Bobby.\n\nBOBBY ALLYN, BYLINE: Hey, Scott.\n\nDETROW: Let's start with the decision. What exactly did the judge rule?\n\nALLYN: Yeah, at a high level, the federal judge, James Boasberg, said the Federal Trade Commission did not clear the high bar for establishing Meta as a monopoly. In order to show any given company is monopolizing a market, you have to define that market. And here, regulators argued Meta was abusing power in the personal social networking market, meaning chatting with friends and family on social media. But Boasberg said that definition had one big problem. It didn't include TikTok and YouTube, which Meta said are it's two biggest competitors.\n\nDETROW: Why would they leave two giant companies off the definition?\n\nALLYN: Part of the reason is when this case was filed back in 2020, during Trump's first term, TikTok was not as big as it is today. Technology, of course, moves much faster than antitrust lawsuits. So when the trial happened five years later, the social media ecosystem looked very different and TikTok was dominant. More than half of Americans use the app now. When Meta CEO Mark Zuckerberg took the witness stand during this trial, he really emphasized this - that TikTok is a fierce rival. And it's no coincidence that one of Instagram's most popular features today - reels - is basically a clone of TikTok.\n\nDETROW: So this is a big win for Meta. Was it surprising, though?\n\nALLYN: You know, not entirely. The lawsuit was filed with the aim of breaking up Meta, with forcing the spinoff of Instagram and WhatsApp into separate companies. And while there are loud bipartisan cries in Washington to rein in the power of Big Tech, actually doing so remains quite hard. And this case, regulators said Meta would not be so powerful today if it hadn't bought WhatsApp and Instagram, that it purchased those companies to neutralize a competitive threat. But look, Scott, both of those deals were approved by the FTC at the time, and I talked to legal experts who said reassessing those deals now is going to be a real uphill battle for the government.\n\nBut there are other cases in this legal push against Silicon Valley. Cases are still pending against Apple and Amazon, and Google lost two cases against the Department of Justice. We're waiting to see what a judge does in those.\n\nDETROW: This case stretched back several years, but the big shift that we've seen has been tech leaders really embracing the Trump administrations. How do we make sense of these lawsuits in light of that?\n\nALLYN: Yeah, the executives in Silicon Valley have hoped that praising the president and changing policies to appease Trump would give them something concrete, like maybe having these lawsuits go away, right? But we just haven't seen that happen. Some of the cases were filed in Trump's first term, others in Biden's, so in both administrations. In all of them, though, Scott, Trump has taken a hands-off approach and just let them unfold in the courts.\n\nYou can even see how the suits could be used as leverage for the White House when it's talking to tech companies, when the administration is seeking something from them - right? - when the administration needs something. You know, while those discussions are going on, hanging over the companies are these big antitrust suits, which can be incredibly costly, time-consuming and even force them to entirely overhaul their businesses.\n\nDETROW: That is NPR's Bobby Allyn. Thank you so much.\n\nALLYN: Thank you, Scott.\n\n(SOUNDBITE OF MUSIC)\n\nCopyright © 2025 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\n\nAccuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.",
  "summary": "A federal judge ruled against the Federal Trade Commission's antitrust suit alleging that Meta had stifled competition by buying up its rivals.",
  "published": "Tue, 18 Nov 2025 18:56:57 -0500",
  "url": "https://www.npr.org/2025/11/18/nx-s1-5612785/meta-beats-ftc-case-wont-have-to-spin-off-whatsapp-instagram",
  "source": "NPR Topics: Business"
}