{
  "title": "Tariff relief: Trump drops 40% levies on Brazilian food imports including beef, coffee",
  "text": "File photo: US President Donald Trump (Picture credit: AP)\n\n\n\n‘Will Show Trump His Mistakes…’: Putin’s Ally Challenges Trump At Asean Summit | Tariff War\n\nUS President Donald Trump has withdrawn steep tariffs on a wide range of Brazilian food products — including beef, coffee, cocoa, fruits and tomatoes — in a major reversal of policies that had sharply increased costs for American consumers.The decision, announced on Thursday, removes the 40% duties that were imposed in July as retaliation for Brazil’s prosecution of former president Jair Bolsonaro, as per news agency AFP.According to the executive order published by the White House, the exemptions will apply to Brazilian shipments arriving in the United States on or after November 13.The move may also require Washington to refund duties collected while the tariffs were still in force.Rollback widens a growing list of exclusions from tariff regimes introduced in recent months, as Trump faces voter frustration over the rising cost of living.Brazil supplies around one-third of the coffee consumed in the United States — the world’s largest coffee market — and has become an increasingly important source of beef, particularly the kind used for burgers, reported Reuters.US retail coffee prices climbed as much as 40% this year, driven by the tariffs and weather-related production shortages.Trump’s falling approval ratings have been closely tied to food inflation, according to a Reuters/Ipsos poll.Importers reacted quickly to the announcement. Commodities analyst Judith Ganes was quoted by Reuters as saying, \"You can expect some thousands of bags of Brazilian coffee that were sitting in bonded warehouses to start moving quickly to US roasters.\"Many importers had stored goods in such facilities, which allow products to be held without paying duties, in the hope that the tariffs would eventually be reversed.Brazil’s beef industry welcomed the decision. The trade group ABIEC was cited by Reuters as saying, \"The decision (to lift Brazil tariffs) shows the effectiveness of the trade negotiations,\" adding that it intends to keep pushing to expand its access to the US market.Trump’s order did not address the sanctions he imposed earlier this year on Brazilian officials involved in the prosecution of Bolsonaro, who was convicted in September for plotting to overturn the 2022 election result.Brazil’s Supreme Court Justice Alexandre de Moraes and his wife were previously sanctioned under the Global Magnitsky Act, and some officials had their US visas revoked.Officials cited by AFP justified the new tariff exemptions by saying that there had been “initial progress in negotiations with the Government of Brazil.”An annex to the order lists the agricultural items no longer subject to the additional 40% duty, with exclusions backdated to November 13.Brazilian President Luiz Inacio Lula da Silva welcomed the shift, saying he was pleased that the punitive tariff had been removed, reported Reuters.",
  "summary": "US President Donald Trump has reversed steep tariffs on Brazilian food imports, including beef and coffee, a move expected to lower costs for American consumers. The 40% duties, imposed in July, are lifted for shipments arriving after November 13. This decision follows growing voter frustration over rising living expenses and signals progress in trade talks with Brazil.",
  "published": "Fri, 21 Nov 2025 09:37:08 +0530",
  "url": "https://timesofindia.indiatimes.com/business/international-business/tariff-relief-donald-trump-drops-40-levies-on-brazilian-food-imports-including-beef-coffee-official-cites-progress-in-talks/articleshow/125476524.cms",
  "source": "Times of India"
}