{
  "title": "House, 5 commercial properties of ‘drug peddler’ demolished in J-K: Police",
  "text": "The Jammu and Kashmir Police on Saturday demolished a house and five commercial properties of an alleged drug peddler in Udhampur district.\n\nIdentifying the alleged drug peddler as Makhan Din of Narssoo in Chenani tehsil, a police spokesperson described the demolition as a “decisive action against narco criminals”.\n\nThe spokesperson described him as a “habitual offender”, against whom a case was registered at Rehmbal police station last year. He has been detained under Prevention of Illicit Traffic in Narcotic Drugs and Psychotropic Substances Act (PITNDPS), and is currently lodged in Central Jail at Kot Bhalwal in Jammu.\n\nDuring the investigation, it was found that Makhan Din had allegedly encroached upon state land and constructed five commercial properties and a residential property worth crores of rupees on NH-44 at Narsoo, the police spokesperson said.\n\nThe allegedly illegal property was demolished as part of the ongoing crackdown to dismantle the financial infrastructure of drug peddlers in the district, police said.\n\nIn a separate action, the police spokesperson said, a team from Majalta police station in Udhampur attached the property of alleged drug peddler Vikramjeet Kumar, a resident of Inderpuri in Amritsar.\n\nDuring the course of investigation in a case registered under relevant sections of the Narcotic Drugs and Psychotropic Substances (NDPS) Act and the Bharatiya Nyaya Sanhita (BNS) at Majalta police station, it was revealed that Kumar owns a duplex house, which he allegedly acquired through the proceeds of crime generated through narco trade.\n\nStory continues below this ad\n\nThe property, worth over Rs 1 crore, has been attached under the NDPS Act for further legal action.\n\nPolice in Udhampur have attached property worth Rs 11.62 crore in NDPS Act-related cases so far this year as part of efforts to make the district drugs-free, the police spokesperson said.",
  "summary": "",
  "published": "Sat, 15 Nov 2025 15:29:44 +0000",
  "url": "https://indianexpress.com/article/india/house-5-commercial-properties-of-drug-peddler-demolished-in-j-k-police-10368038/",
  "source": "India | The Indian Express"
}