{
  "title": "Man becomes first to be convicted of hate speech against trans people in NSW",
  "text": "A New South Wales man who called for violence and created an “invitation on social media for a genocide” has become the state’s first person to be convicted of hate speech against transgender people.\n\nThomas Fordham, 27, was on Wednesday sentenced to a 12-month community correction order for the offence in Sydney’s Central local court, with magistrate Christopher Halburd acknowledging his “multitude” of mental health conditions.\n\nAccording to court documents, Fordham posted a series of comments on YouTube accounts, including some videos by the American influencer and transgender activist Mercury Stardust, between March to May 2024. The comments were in response to videos about LGBTIQ+ issues.\n\nSign up: AU Breaking News email\n\nOne comment read: “We should have a geneside [sic] and kill al [sic] trans people”, according to court documents.\n\nThe comments were quickly removed by the website but Halburd on Wednesday said that did not negate that Fordham’s “serious” offending in posting them.\n\n“In essence, this is an invitation on social media for a genocide,” Halburd said.\n\n“These were exhortations directed against a class of people who were distributed across the globe.”\n\nDuring a sentencing hearing on Wednesday, Fordham’s barrister, Allan Goldsworthy, said his client was targeted with a “flood” of “Old Testament religious material” on YouTube.\n\n“In his mind … he’s doing the right thing by conveying the word of God,” he said.\n\nGoldsworthy said his client, who received NDIS support, was socially isolated and “intellectually performing at a low level”.\n\nHe said Fordham was getting “very specific treatment” and had shown insight into what “he can and can’t say on the internet and the way it may affect others”.\n\nHe pointed to a report from a clinical psychologist who said further therapeutic interventions would focus on Fordham cultivating “flexible thinking skills” and considering “multiple perspectives beyond his initial assumptions”.\n\nHalburd acknowledged Fordham had significant mental health impairments, including an intellectual development disorder, depression, post-traumatic stress disorder and ADHD.\n\nHe said if it weren’t for those issues, Fordham would be “going straight to jail”.\n\nHalburd also said there had been significant concerns raised over recent years about social media’s impact on people and the influence of algorithms that can feed into the inciting of violence.\n\nskip past newsletter promotion Sign up to Breaking News Australia Free newsletter Get the most important news as it breaks Enter your email address Sign up Privacy Notice: Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on Newsletters may contain information about charities, online ads, and content funded by outside parties. If you do not have an account, we will create a guest account for you on theguardian.com to send you this newsletter. You can complete full registration at any time. For more information about how we use your data see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nPolice initally charged Fordham with 25 alleged offences but all but two were later withdrawn.\n\nFordham pleaded guilty to two charges: threatening or inciting violence on grounds of gender identity – which carries a potential three-year prison sentence and $11,000 fine – and failing to comply with a digital evidence access order direction.\n\nThe conviction is the state’s first successful prosecution of gender identity vilification since the current laws came into effect in 2018.\n\nKatie Green, the chief executive of the Inner City Legal Centre, which provides advice to LGBTQI+ clients, said such offending was not rare but many people do not report it to police.\n\nOn the occasions where clients lodge complaints about online comments, the legal centre will send a letter to its author and threaten action if they do not take the posts down, Green said.\n\nIn New South Wales, it is illegal to threaten or incite violence on the grounds of race, religion, sexual orientation, gender identity or intersex or HIV/Aids status.\n\nThe state has recorded three guilty findings under these laws relating to race and religion, according to statistics provided by the NSW Bureau of Crime Statistics and Research.\n\nThe conviction comes as the NSW government this week unveiled reform to combat displays of Nazi ideology, after a neo-Nazi rally outside state parliament earlier this month.",
  "summary": "<p>Man sentenced to community correction order after pleading guilty to threatening or inciting violence on grounds of gender identity</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/nov/21/australia-news-live-mark-dreyfus-republic-anthony-albanese-g20-south-africa-eu-trade-deal-nt-cyclone-darwin-airlines-powerbank-ban-nsw-politics-leadership-kellie-sloane-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>A New South Wales man who called for violence and created an “invitation on social media for a genocide” has become the state’s first person to be convicted of hate speech against transgender people.</p><p>Thomas Fordham, 27, was on Wednesday sentenced to a 12-month community correction order for the offence in Sydney’s Central local court, with magistrate Christopher Halburd acknowledging his “multitude” of mental health conditions.</p> <a href=\"https://www.theguardian.com/australia-news/2025/nov/21/man-becomes-first-to-be-convicted-of-hate-speech-against-trans-people-in-nsw-ntwnfb\">Continue reading...</a>",
  "published": "Fri, 21 Nov 2025 02:44:58 GMT",
  "url": "https://www.theguardian.com/australia-news/2025/nov/21/man-becomes-first-to-be-convicted-of-hate-speech-against-trans-people-in-nsw-ntwnfb",
  "source": "World news | The Guardian"
}